[
    {
        "title": "Tim Davie resigns as BBC's director-general - with CEO of BBC News also stepping down",
        "description": "Tim Davie has resigned as the BBC's director-general after five years in the role - with chief executive of BBC News Deborah Turness also resigning.",
        "url": "https://news.sky.com/story/tim-davie-resigns-as-bbcs-director-general-13467527",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tim-davie-deborah-turness_7077340.jpg?20251109182934",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-09 17:45:00",
        "Headline": "The resignations come as the BBC is expected to apologise on Monday following concerns about impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama.",
        "Content": " Tim Davie has resigned as the BBC's director-general after five years in the role - with chief executive of BBC News Deborah Turness also resigning. It comes as the corporation is expected to apologise on Monday following concerns about impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama. The concerns regard clips spliced together from sections of the US president's speech on 6 January 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\" in the documentary Trump: A Second Chance?, which was broadcast by the BBC the week before last year's US election.  Mr Trump responded to the pair's resignation on Sunday night, describing Mr Davie and Ms Turness as \"very dishonest people who tried to step on the scales of a presidential election\" in a post on his Truth Social platform. White House and others react to resignations - latest 'Ongoing controversy' Mr Davie sent a message to staff on Sunday afternoon, saying it was \"entirely\" his decision to quit. \n                  Downfall of BBC leaders greeted with undisguised glee by many on the right of British politics\n                 \n                  Tim Davie and Deborah Turness's resignation letters in full – and the BBC response\n                 \n                  'Teflon Tim' rode out several BBC controversies – but now he's come unstuck\n                 Admitting the BBC \"is not perfect\", he said: \"We must always be open, transparent and accountable.\" \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision. \"Overall, the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.\"  Ms Turness told staff the \"ongoing controversy\" around the edition of Panorama \"has reached a stage where it is causing damage to the BBC - an institution that I love. \"The buck stops with me - and I took the decision to offer my resignation to the director-general last night. \"In public life, leaders need to be fully accountable, and that is why I am stepping down. While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong.\" BBC Chair, Samir Shah called it \"a very difficult day\", thanking Ms Turness and crediting her with having \"transformed\" the corporation's news output. Mr Trump's press secretary, Karoline Leavitt, posted a triumphant two-word reaction on X, using the drinking term \"shot\" to describe reports that the US president was \"going to war with fake news\", referring to the BBC programme, and describing Mr Davie's resignation as a \"chaser\" - a drink taken after the shot to soften the taste of the alcohol. Ms Leavitt later said the BBC \"is dying because they are anti-Trump Fake News\". In an interview published on Friday, she had described the BBC as \"100% fake news\" and a \"propaganda machine\". Farage: 'BBC's last chance' In a message posted on social media, Culture Secretary Lisa Nandy thanked Mr Davie for leading the BBC through a period of \"significant change\". She called the organisation \"one of our most important national institutions\", adding that \"now, more than ever, the need for trusted news and high-quality programming is essential to our democratic and cultural life, and our place in the world\".  Conservative leader, Kemi Badenoch, said it was \"right that Tim Davie and Deborah Turness have finally taken responsibility and resigned from the BBC\". She said: \"The culture at the BBC has not yet changed. BBC Arabic must be brought under urgent control. The BBC's US and Middle East coverage needs a full overhaul.\" Ms Badenoch said it \"should not expect the public to keep funding it through a compulsory licence fee unless it can finally demonstrate true impartiality\". Liberal Democrat leader Sir Ed Davey said Sunday's resignations \"must be an opportunity for the BBC to turn a new leaf, rebuild trust and not give in to the likes of [Reform UK leader] Nigel Farage who want to destroy it\". Mr Farage said the pair's resignations must be \"the start of wholesale change\" at the BBC. He urged the ministers to appoint \"somebody with a record of coming in and turning companies and their cultures around\", preferably someone \"from the private sector who has run a forward-facing business and understands PR\". Mr Farage said: \"This is the BBC's last chance. If they don't get this right, there will be vast numbers of people refusing to pay the licence fee.\" As well as the Panorama show on Mr Trump, the BBC has also been accused of failing to maintain its neutrality in its coverage of the Israel-Hamas war and over trans issues. Read more on the BBC:Glastonbury complaints partly upheldGaza documentary 'breached Ofcom rules'Wallace responds to Masterchef sackingWho are BBC's highest earners? The Campaign Against Antisemitism (CAA) called for an independent inquiry into potential bias at the BBC, saying \"growing bias\" had been evident for \"many years across a wide array of issues\". The group claimed that, under Mr Davie and Ms Turness, the BBC had \"often served as a mouthpiece for Hamas\" and \"gaslit\" its audience \"by claiming to be a bastion of ethics and truthful journalism\".  Marcus Ryder, a former executive producer of current affairs at the BBC, called the resignations \"really sad\", adding that \"it shows the pressure and ethical climate that the BBC is operating in, that this edit can actually bring down the director- general\". Dame Melanie Dawes, chief executive of Ofcom, thanked Mr Davie, saying he had led the organisation \"at a time of great change and challenge\". The Daily Telegraph reported on Tuesday that a memo by a former external adviser to the BBC's editorial standards committee raised the issue, as well as other concerns about impartiality, in the summer. Dealing with controversies Mr Davie took the role in 2020, replacing Tony Hall. During his time in charge of the broadcaster, he has dealt with a number of high-profile controversies within the corporation. They include a row over former Match of the Day host Gary Lineker's sharing of his political views, top presenter Huw Edwards being convicted of making indecent images of children, and the BBC's broadcasting of Bob Vylan's controversial Glastonbury performance. Read: The BBC controversies faced by Tim Davie during his time in charge There were also controversies surrounding some of its top shows, such as MasterChef and its former presenter, Gregg Wallace, as well as Strictly Come Dancing. Mr Davie, who had a career in marketing and finance before joining the BBC's marketing team in 2005, was previously acting director-general from November 2012 until April 2013. He said his departure will not be immediate and that he is \"working through\" timings to ensure an \"orderly transition\" over the coming months. A person familiar with the situation said Davie's decision had left the BBC board stunned by the move."
    },
    {
        "title": "The BBC controversies faced by Tim Davie during his time in charge",
        "description": "Tim Davie stepping down as director-general of the&#160;BBC comes after several controversies faced by the broadcaster in recent years.",
        "url": "https://news.sky.com/story/the-bbc-controversies-faced-by-tim-davie-during-his-time-in-charge-13467725",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-donald-trump-capitol_5230334.jpg?20221216224518",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-09 20:38:00",
        "Headline": "After 20 years at the BBC, and in charge for the last five, Tim Davie has announced his resignation. Here are some of the controversies he has faced during his time as director-general.",
        "Content": " Tim Davie stepping down as director-general of the BBC comes after several controversies faced by the broadcaster in recent years. His resignation came at the same time as that of BBC News chief executive Deborah Turness, at the end of a week in which concerns about impartiality were raised over how a speech by US President Donald Trump was edited in an episode of Panorama. \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision,\" Mr Davie wrote in a note sent to staff. \"Overall, the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.\" Mr Davie has been in the role for five years and at the BBC for 20 in total, having previously worked as director of marketing, director of audio and music, and chief executive of BBC Studios. Here are the controversies the broadcaster has faced in recent years. The Trump documentary edit A memo sent in the summer by a former external adviser to the BBC's editorial standards committee, highlighting the edit of a Donald Trump speech as well as other concerns about impartiality, was first reported by The Daily Telegraph on Tuesday.  The concerns regard clips spliced together from sections of a speech made by the US president on 6 January 2021, featured in the Panorama programme Trump: A Second Chance? It made it appear that Mr Trump told supporters he was going to walk to the US Capitol with them to \"fight like hell\", although the quotes were made during separate parts of the speech. The episode was broadcast by the BBC the week before last year's US election. Bob Vylan at Glastonbury In July, punk-rap duo Bob Vylan led chants of \"death to the IDF\" while on stage at Glastonbury, a performance which was live-streamed as part of the BBC's coverage of the festival. Afterwards, the broadcaster said it would no longer live broadcast \"high risk\" performances, and suggested disciplinary action could be taken against staff who failed to halt the stream. The BBC's Executive Complaints Unit received four complaints about the performance relating to incitement to violence, terrorism or ethnic cleansing, hate speech and expressions of antisemitism.  In a ruling given in September, it found the stream of the performance had breached its editorial standards. Following the backlash over the Glastonbury gig, Bob Vylan said in a post on Instagram that \"we are not for the death of Jews, Arabs or any other race or group of people\". MasterChef In the same month, presenter Gregg Wallace was sacked from cooking show MasterChef after an investigation into historical allegations of misconduct upheld multiple accusations against him. These first emerged towards the end of 2024. Wallace, who co-presented the show for almost 20 years, said he was \"deeply sorry for any distress caused\" and that he \"never set out to harm or humiliate\", but also said in a statement released ahead of the publication of a summary of the report that he had been \"cleared of the most serious and sensational accusations\" made against him.  His co-presenter John Torode left the show the following week after an allegation he used an \"extremely offensive racist term\" was upheld, the BBC said. In October, Wallace announced he was suing the broadcaster for \"distress and harassment\". Gary Lineker No stranger to controversy during his last few years at the BBC, Gary Lineker stepped down from hosting Match Of The Day and World Cup coverage in May. It came after he apologised unreservedly for sharing a social media post from the Palestine Lobby group that had been illustrated with a rat - which has been used to represent Jewish people in antisemitic propaganda, including Nazi Germany. He said he had not known about the rat's symbolism. \"I would never consciously repost anything antisemitic - it goes against everything I stand for,\" Lineker said in a statement as he confirmed his resignation. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" The former England star had previously been temporarily suspended from the BBC in March 2023, after an impartiality row over comments he made criticising the then Conservative government's asylum policy. His temporary suspension led pundits Ian Wright and Alan Shearer to both announce they would not appear on Match of the Day, and a shortened show went ahead without commentary, pundit analysis, or post-match interviews. The incident sparked a report, which decided that high-profile BBC presenters outside of its news coverage should be able to express their views on political issues as long as they stop short of campaigning. Gaza documentary Gaza: How To Survive A Warzone was pulled from BBC iPlayer in February after it emerged that the 13-year-old boy narrating the programme was the son of a deputy minister in the Hamas-run government. The documentary was made by independent production company Hoyo Films. A BBC review into the controversial programme said three members of the independent production company knew about the role of the boy's father - but no one within the corporation was aware. In July, the BBC said it had breached its own editorial guidelines by failing to disclose the full identity of the child narrator's father - Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. In October, an Ofcom investigation found the documentary had breached the broadcasting code. Huw Edwards In April 2024, veteran news presenter Huw Edwards resigned from the BBC, nine months after coming off air following accusations of paying a teenager thousands of pounds for sexually explicit pictures. Just a few months later, it emerged he had remained one of the broadcaster's highest-paid stars of the year, despite his suspension. Days later, new allegations emerged - and he was charged and pleaded guilty in court to three counts of \"making\" indecent images of children, after receiving the illegal images as part of a WhatsApp conversation. The court heard how he paid up to £1,500 to a paedophile who sent him 41 illegal images between December 2020 and August 2021, seven of which were of the most serious type. The disgraced broadcaster avoided jail, but was given a six-month suspended sentence. Strictly Come Dancing Ahead of the 2024 series of BBC favourite Strictly Come Dancing, producers said they would introduce staff chaperones into all future rehearsals. It followed the departure of two professional dancers following complaints about their behaviour. Following an investigation, the BBC upheld \"some, but not all\" of the allegations made against Giovanni Pernice by his 2023 dance partner Amanda Abbington. Abbington described an apology from the corporation as vindication, while Pernice denied displaying \"abusive or threatening behaviour\" and said the majority of the complaints had not been upheld. Another professional dancer, Graziano Di Prima, also left the show amid reports of alleged misconduct. Apology over Diana interview In 2021, a report into Martin Bashir's bombshell 1995 programme with Princess Diana found the journalist had \"deceived and induced\" her brother to secure the interview. By using fake bank statements, Mr Bashir made a \"serious breach\" of BBC guidelines on straight-dealing, the Lord Dyson report concluded. Mr Davie, who was not at the BBC at the time the programme was made, issued a \"full and unconditional\" apology after the findings were released, and the corporation sent written apologies to Prince William and Prince Harry, as well as to Prince Charles and Earl Spencer. Mr Bashir also apologised and said the faking of bank statements was a \"stupid thing to do\" and \"an action I deeply regret\", but added he felt it had \"no bearing whatsoever on the personal choice by Princess Diana to take part in the interview\". Former director-general Lord Hall, who was the BBC's director of news and current affairs when the Diana interview was screened, said he accepted the corporation's 1996 inquiry into how the sit-down was secured \"fell well short of what was required\"."
    },
    {
        "title": "Starmer avoided political heat at home during Brazil climate conference - but he returns to a prisons crisis",
        "description": "Sir Keir Starmer's been on the other side of the world for most of the week - at the COP30 climate summit in Brazil, his 40th foreign trip in 16 months.",
        "url": "https://news.sky.com/story/starmer-avoided-political-heat-at-home-during-brazil-climate-conference-but-he-returns-to-a-prisons-crisis-13467463",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-prime-minister_7077200.jpg?20251109171609",
        "type": "Home",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-09 16:58:00",
        "Headline": "The prime minister comes back from the COP talks as his government struggles to deal with the fallout from a spate of wrongly-released prisoners and his colleagues' unconvincing attempts to reassure the public.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Sir Keir Starmer's been on the other side of the world for most of the week - at the COP30 climate summit in Brazil, his 40th foreign trip in 16 months. Back home, his government's credibility has continued its painful unravelling. Five days on from David Lammy's disastrous stand-in performance at PMQS, the justice secretary's ministerial colleagues are still struggling to explain why he repeatedly failed to answer questions on whether another migrant criminal had been released from prison by mistake. Yes, Conservative MP James Cartlidge got the question wrong, as Brahim Kaddour-Cherif was an illegal migrant, not an asylum seeker. But Mr Cartlidge argued that because the deputy prime minister failed to divulge the information he did have, he failed to act with full transparency and should be investigated by the PM's ethics advisor for a possible breach of the ministerial code. Culture Secretary Lisa Nandy has been defending Mr Lammy's response.  She told Sunday Morning with Trevor Phillips she doesn't accept that he was being evasive, insisting Mr Lammy had been carefully weighing his words to ensure that \"when we do speak about matters of such significance to the public… we do so with care and make sure the full facts are presented\". At that time, rather extraordinarily, we're told the justice secretary did not have the full facts of the case, even though the Metropolitan Police had been informed the day before (six days after Kaddour-Cherif was accidentally freed). How Sky correspondent found escaped prisoner  The combination of wrongly-freed prisoners and illegal migrants is a conjunction of two of the most toxic issues in British politics - the overflowing prison system and the dysfunctional asylum system. Both are vast, chaotic problems the government is struggling to get a grip on, as the Conservatives also found, to their cost. But ministers' ongoing failure to bring both issues under control has only been highlighted by Mr Lammy's sloppy handling of the situation. Football regulator donations row Ms Nandy has herself been at the heart of another government controversy this week - over the appointment of the new football regulator, David Kogan.  An independent investigation found she \"unknowingly\" breached the code on public appointments by failing to declare that Mr Kogan had previously donated £2,900 to her Labour leadership campaign - and also criticised her department for not highlighting his status as a Labour donor who had previously given £33,410 to the party. The culture secretary has apologised and explained she had been unaware of the donations. She also pointed out that Mr Kogan was a candidate originally put forward by the Conservatives. But again, it's messy. It's yet another story which chips away at the government's promises to clear up politics and act with full transparency and accountability.  Budget blues? The ultimate breach of trust looks set to come with the budget on 26 November, however. In an extraordinary early morning speech this week, Chancellor Rachel Reeves signalled that she's likely to raise taxes in two and a half weeks - and thus breach the core promise of the Labour Party manifesto. The rationale for her dire warnings on Tuesday was to start explaining why she will probably have to do so - getting in her excuses early about the languishing state of the economy as a result of Brexit, Donald Trump's tariffs and her inheritance from the Conservatives. The Tories claim Ms Reeves could sort out the finances by cutting welfare spending - something ministers dramatically failed to do when their efforts at reform were scuttled by angry backbenchers. Read more:Govt 'gripping' prisons crisisDenmark migration model backedPrisons 'close to breaking point' Governments breach their manifesto commitments all the time. But if the chancellor goes ahead and puts up income tax, as expected (even if that's offset, for some, by a corresponding cut to national insurance), it will be a shock - and the first such increase in 50 years. The new deputy leader of the party, Lucy Powell, pointedly warned the government this week about the risks of breaching trust in politics by breaking manifesto promises. Lisa Nandy didn't shoot her comments down when Sir Trevor asked for her response, arguing instead that while \"we take our promises very, very seriously\", they [Labour] \"were also elected on a promise to change this country\", with a particular focus on fixing the NHS. The impossibility of doing both - protecting taxes while also increasing government spending in such a challenging economic climate - highlights the folly of making such restrictive promises. But voters are not in a forgiving mood."
    },
    {
        "title": "Two dead and a million evacuated as Super Typhoon Fung-wong hits Philippines",
        "description": "Two people have died and more than one million people evacuated after a storm bearing down on the Philippines intensified into a super typhoon and made landfall on Sunday.",
        "url": "https://news.sky.com/story/nearly-a-million-people-evacuate-as-super-typhoon-fung-wong-hits-philippines-13467085",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-philippines-typhoon_7077462.jpg?20251109192636",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-09 06:41:00",
        "Headline": "Fung-wong starts battering eastern and central parts of the country as it makes landfall, causing power outages, and forcing the evacuation of high-risk villages. Filipinos are still dealing with the aftermath of Typhoon Kalmaegi, which killed more than 200 people earlier this week.",
        "Content": " Two people have died and more than one million people evacuated after a storm bearing down on the Philippines intensified into a super typhoon and made landfall on Sunday. Fung-wong started battering eastern and central parts of the country, causing power outages, and forcing President Ferdinand Marcos Jr to declare a state of emergency. One person drowned in Catanduanes and firefighters recovered the body of a woman trapped under the debris of a collapsed home in Catbalogan City, officials said. Packing sustained winds of 115mph and gusts of up to 140mph, Super Typhoon Fung-wong made landfall in Aurora province in central Luzon. Those living in high-risk villages in northeastern provinces were told to evacuate, including in Bicol, a coastal region vulnerable to Pacific cyclones and mudflows from Mayon, one of the country's most active volcanoes. Defence secretary Gilberto Teodoro Jr warned Fung-wong could affect a vast expanse of the country, including the capital Manila, and Cebu, the central province hit hardest by the deadly Typhoon Kalmaegi just days ago. More than 200 people were killed in the earlier typhoon, and around 100 are still missing.  Mr Teodoro Jr urged residents to heed evacuation orders, warning refusing to comply was dangerous and unlawful. \"We ask people to pre-emptively evacuate so that we don't end up having to conduct rescues at the last minute, which could put the lives of police, soldiers, firefighters and coast guard personnel at risk,\" he said in a public address. More than 30 million people could be exposed to hazards posed by Fung-wong, the Office of Civil Defence said. In Isabela in northern Luzon, dozens of families were sheltering at a basketball court repurposed as an evacuation centre. \"We're scared,\" said Christopher Sanchez, 50, who fled his home with his family. \"We're here with our grandchildren and our kids. The whole family is in the evacuation area.\" Nearly 400 domestic and international flights have been cancelled, according to the civil aviation regulator. Read more from Sky News:Ghislaine Maxwell's emails from jail leakedThe Amazonians who don't care who Trump is  Deadly tornado in Brazil Meanwhile, a powerful tornado ripped through the southern state of Parana in Brazil - killing at least six and injuring more than 750 people, state officials said on Saturday. The tornado left a trail of destruction, downing trees, overturning vehicles and damaging buildings. Roads were also blocked and power lines damaged, with authorities saying around 1,000 people were displaced, \"We will continue to assist the people of Parana and provide all the help needed,\" President Luiz Inacio Lula da Silva wrote on X."
    },
    {
        "title": "Manhunt for prisoner who 'absconded' after being freed from HMP Wandsworth for brother's wedding",
        "description": "A Palestine Action protester who was temporarily freed from jail to go to his brother's wedding has failed to return to Wandsworth prison, Sky News understands.",
        "url": "https://news.sky.com/story/manhunt-for-prisoner-who-absconded-after-being-freed-from-hmp-wandsworth-for-brothers-wedding-13467181",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hmp-wandsworth-london_7072725.jpg?20251105122500",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-11-09 11:51:00",
        "Headline": "Police are searching for Sean Middlebrough, a Palestine Action protester, who has failed to return to the south London jail.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n A Palestine Action protester who was temporarily freed from jail to go to his brother's wedding has failed to return to Wandsworth prison, Sky News understands. Police are searching for Sean Middlebrough, 32, who was being held on remand at HMP Wandsworth. It's understood he was granted bail by a judge to attend his brother's wedding, but hasn't returned. Middlebrough was charged over an alleged plot by activists to disrupt the London Stock Exchange by chaining themselves to the building. Palestine Action was formally proscribed as a terrorist organisation earlier this year. A government spokesperson said \"court decisions are made by judges - independently of government\". \"Absconding is a serious criminal offence, and any defendant who commits this crime could face longer behind bars,\" they added.  This failure to return to HMP Wandsworth in south London marks the latest in a string of embarrassing episodes for the justice system, after three high-profile mistaken prison releases in the past two weeks. The number of these types of errors has risen recently, with 262 instances between March 2024 and March 2025 - a 128% increase on 115 in the previous 12 months.  Read more: How many prisoners are released by mistake? 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Culture Secretary Lisa Nandy told Sky News the government is \"gripping\" the prisons crisis, adding it is \"unacceptable\" that the number of prisoners being wrongly released has risen. She told Sunday Morning With Trevor Phillips that Justice Secretary David Lammy has made a senior appointment \"to make sure we really grip this\". Read more from Sky News:Labour exploring Danish migration modelKing leads Remembrance Sunday service     Brahim Kaddour-Cherif, a 24-year-old Algerian sex offender, was released in error from HMP Wandsworth on 29 October - just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex. Kaddour-Cherif came to the UK legally and is not an asylum seeker, but it is understood he overstayed his visit visa and deportation proceedings had been started. Sky News filmed the moment Kaddour-Cherif was detained on Friday 7 November. Kebatu came to the UK illegally before sexually assaulting a child, for which he was jailed. He has since been recaptured and deported. A third man, fraudster William Smith, 35, was mistakenly released from HMP Wandsworth on 3 November, but turned himself in on Thursday 6 November. "
    },
    {
        "title": "Monument honours millions who did not fight in WWII - but whose roles were vital to war effort",
        "description": "In the pouring rain, Nicola Pickett wiped a tear from her eye as she stared up at a 12-foot (3.7m) monument that finally gave recognition to her father, Job.&#160;",
        "url": "https://news.sky.com/story/monument-honours-millions-who-did-not-fight-in-wwii-but-whose-roles-were-vital-to-war-effort-13467778",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sculpture-reserved-occupationists_7077699.jpg?20251109224628",
        "type": "Home",
        "Author": "Lisa Dowd",
        "Date Published": "2025-11-09 21:47:00",
        "Headline": "People whose jobs were seen as vital to the war effort, like mining or making chains for warships, were prevented from joining up to the Second World War, even if they wanted to go and fight.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  In the pouring rain, Nicola Pickett wiped a tear from her eye as she stared up at a 12-foot (3.7m) monument that finally gave recognition to her father, Job.  \"This means the world,\" she told me. An imposing steel sculpture of a Black Country chain maker, stands at the edge of a churchyard in Cradley Heath. It commemorates millions of people who weren't allowed to fight in the Second World War because their jobs at home were too important. Nicola's dad had been a miner in the war. She said, \"he was a bit embarrassed because all of his brothers went to war and for years he wondered if he was appreciated for what he did\". I caught up with West Midlands-based sculptor Luke Perry before the monument was unveiled on Remembrance Sunday, finding him hammering another name into the artwork's base. People keep coming up to him to say they also had a relative known as a \"reserved occupationist\", and they'd like to have them remembered. Luke's grandfather, Eric, was one. He made chains in the war, which helped to power the Royal Navy's warships. \"There was a very complicated set of feelings going on,\" Luke said. \"He never said he wanted to fight necessarily, but I think he did say that he perhaps should have gone and that sense of duty was very heavy to that generation, and that is what they carried for their lives.\" A man called Harry taps me on the shoulder to show me a black-and-white photo of his dad, also called Harry. \"There he is, seventh from the left,\" he says as he points him out. His dad also made chains, but had wanted to go to war. \"I knew he felt guilty about it because my mum told me when he went to join up they refused him… and I felt a little bit guilty too because I had friends whose dads were in the war.\" Read more on Sky News:King leads Remembrance Sunday silenceHero rail worker regains consciousnessBBC bosses resign A lady named Jen called me over to show me her dad's old business card. Leslie, she said, had been an accountant for a bus company transporting workers during the war and couldn't be conscripted. She said some people had suggested he was a \"conscientious objector\" because he wasn't fighting. \"It hurt him, it really did, because his brother luckily survived. He did come back, but it sort of caused a bit of unrest in the family as to why the elder son couldn't go to war.\""
    },
    {
        "title": "'Teflon Tim' rode out several BBC controversies – but now he's come unstuck",
        "description": "Under his tenure, Tim Davie has had to deal with a lot.",
        "url": "https://news.sky.com/story/teflon-tim-rode-out-several-bbc-controversies-8211-but-now-hes-come-unstuck-13467750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tim-davie-bbc_7077668.jpg?20251109215702",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-09 21:01:00",
        "Headline": "The corporation's director-general Tim Davie and Deborah Turness, the CEO of BBC News have resigned over recent events. But Davie especially has been dealing with controversies for years. ",
        "Content": "\n          Arts and entertainment correspondent\n        Under his tenure, Tim Davie has had to deal with a lot. While both he and his head of news Deborah Turness have resigned over events of the last week, it's important to also take into account just how shaky the last couple of years have been for Davie - earning him the nickname 'Teflon Tim'. While his missteps on Strictly and firings on MasterChef have made tabloid headlines, it's the errors when it comes to news coverage that are arguably most inexcusable at an organisation that prides itself on putting trust and accountability at its heart. Follow latest: Trump responds to Davie resignation  You might remember Davie dodged calls for his resignation earlier this year when it emerged a child narrator on one of its documentaries was the son of a Hamas official. They investigated, apologised and tried to move on, but just over a week ago, Davie found himself going from the frying pan into the fire. That's when a leaked memo by a former adviser to the corporation was published - accusing the corporation of \"serious and systemic\" bias in its coverage of issues including Gaza, trans rights and Donald Trump. For an organisation that talks the talk on trust and accountability being such an important part of what it stands for, time and time again under Davie's tenure, it has felt almost as if - rather than coming out and facing the press - he's perfected the art of strategic invisibility. Read more:Tributes paid to ex-Top Gear hostDavina McCall shares cancer diagnosis While some may see him as a victim of culture wars in the time of Trump, the director-general spent the week ignoring the fire alarms going off inside the BBC. The truth is, he'd left it far too late. The heat was far too hot for him to do anything else but resign."
    },
    {
        "title": "Tim Davie resigns as BBC's director-general - with CEO of BBC News also stepping down",
        "description": "Tim Davie has resigned as the BBC's director-general after five years in the role - with chief executive of BBC News Deborah Turness also resigning.",
        "url": "https://news.sky.com/story/tim-davie-resigns-as-bbcs-director-general-13467527",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tim-davie-deborah-turness_7077340.jpg?20251109182934",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-09 17:45:00",
        "Headline": "The resignations come as the BBC is expected to apologise on Monday following concerns about impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama.",
        "Content": " Tim Davie has resigned as the BBC's director-general after five years in the role - with chief executive of BBC News Deborah Turness also resigning. It comes as the corporation is expected to apologise on Monday following concerns about impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama. The concerns regard clips spliced together from sections of the US president's speech on 6 January 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\" in the documentary Trump: A Second Chance?, which was broadcast by the BBC the week before last year's US election.  Mr Trump responded to the pair's resignation on Sunday night, describing Mr Davie and Ms Turness as \"very dishonest people who tried to step on the scales of a presidential election\" in a post on his Truth Social platform. White House and others react to resignations - latest 'Ongoing controversy' Mr Davie sent a message to staff on Sunday afternoon, saying it was \"entirely\" his decision to quit. \n                  Downfall of BBC leaders greeted with undisguised glee by many on the right of British politics\n                 \n                  Tim Davie and Deborah Turness's resignation letters in full – and the BBC response\n                 \n                  'Teflon Tim' rode out several BBC controversies – but now he's come unstuck\n                 Admitting the BBC \"is not perfect\", he said: \"We must always be open, transparent and accountable.\" \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision. \"Overall, the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.\"  Ms Turness told staff the \"ongoing controversy\" around the edition of Panorama \"has reached a stage where it is causing damage to the BBC - an institution that I love. \"The buck stops with me - and I took the decision to offer my resignation to the director-general last night. \"In public life, leaders need to be fully accountable, and that is why I am stepping down. While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong.\" BBC Chair, Samir Shah called it \"a very difficult day\", thanking Ms Turness and crediting her with having \"transformed\" the corporation's news output. Mr Trump's press secretary, Karoline Leavitt, posted a triumphant two-word reaction on X, using the drinking term \"shot\" to describe reports that the US president was \"going to war with fake news\", referring to the BBC programme, and describing Mr Davie's resignation as a \"chaser\" - a drink taken after the shot to soften the taste of the alcohol. Ms Leavitt later said the BBC \"is dying because they are anti-Trump Fake News\". In an interview published on Friday, she had described the BBC as \"100% fake news\" and a \"propaganda machine\". Farage: 'BBC's last chance' In a message posted on social media, Culture Secretary Lisa Nandy thanked Mr Davie for leading the BBC through a period of \"significant change\". She called the organisation \"one of our most important national institutions\", adding that \"now, more than ever, the need for trusted news and high-quality programming is essential to our democratic and cultural life, and our place in the world\".  Conservative leader, Kemi Badenoch, said it was \"right that Tim Davie and Deborah Turness have finally taken responsibility and resigned from the BBC\". She said: \"The culture at the BBC has not yet changed. BBC Arabic must be brought under urgent control. The BBC's US and Middle East coverage needs a full overhaul.\" Ms Badenoch said it \"should not expect the public to keep funding it through a compulsory licence fee unless it can finally demonstrate true impartiality\". Liberal Democrat leader Sir Ed Davey said Sunday's resignations \"must be an opportunity for the BBC to turn a new leaf, rebuild trust and not give in to the likes of [Reform UK leader] Nigel Farage who want to destroy it\". Mr Farage said the pair's resignations must be \"the start of wholesale change\" at the BBC. He urged the ministers to appoint \"somebody with a record of coming in and turning companies and their cultures around\", preferably someone \"from the private sector who has run a forward-facing business and understands PR\". Mr Farage said: \"This is the BBC's last chance. If they don't get this right, there will be vast numbers of people refusing to pay the licence fee.\" As well as the Panorama show on Mr Trump, the BBC has also been accused of failing to maintain its neutrality in its coverage of the Israel-Hamas war and over trans issues. Read more on the BBC:Glastonbury complaints partly upheldGaza documentary 'breached Ofcom rules'Wallace responds to Masterchef sackingWho are BBC's highest earners? The Campaign Against Antisemitism (CAA) called for an independent inquiry into potential bias at the BBC, saying \"growing bias\" had been evident for \"many years across a wide array of issues\". The group claimed that, under Mr Davie and Ms Turness, the BBC had \"often served as a mouthpiece for Hamas\" and \"gaslit\" its audience \"by claiming to be a bastion of ethics and truthful journalism\".  Marcus Ryder, a former executive producer of current affairs at the BBC, called the resignations \"really sad\", adding that \"it shows the pressure and ethical climate that the BBC is operating in, that this edit can actually bring down the director- general\". Dame Melanie Dawes, chief executive of Ofcom, thanked Mr Davie, saying he had led the organisation \"at a time of great change and challenge\". The Daily Telegraph reported on Tuesday that a memo by a former external adviser to the BBC's editorial standards committee raised the issue, as well as other concerns about impartiality, in the summer. Dealing with controversies Mr Davie took the role in 2020, replacing Tony Hall. During his time in charge of the broadcaster, he has dealt with a number of high-profile controversies within the corporation. They include a row over former Match of the Day host Gary Lineker's sharing of his political views, top presenter Huw Edwards being convicted of making indecent images of children, and the BBC's broadcasting of Bob Vylan's controversial Glastonbury performance. Read: The BBC controversies faced by Tim Davie during his time in charge There were also controversies surrounding some of its top shows, such as MasterChef and its former presenter, Gregg Wallace, as well as Strictly Come Dancing. Mr Davie, who had a career in marketing and finance before joining the BBC's marketing team in 2005, was previously acting director-general from November 2012 until April 2013. He said his departure will not be immediate and that he is \"working through\" timings to ensure an \"orderly transition\" over the coming months. A person familiar with the situation said Davie's decision had left the BBC board stunned by the move."
    },
    {
        "title": "'Teflon Tim' rode out several BBC controversies – but now he's come unstuck",
        "description": "Under his tenure, Tim Davie has had to deal with a lot.",
        "url": "https://news.sky.com/story/teflon-tim-rode-out-several-bbc-controversies-8211-but-now-hes-come-unstuck-13467750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tim-davie-bbc_7077668.jpg?20251109215702",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-09 21:01:00",
        "Headline": "The corporation's director-general Tim Davie and Deborah Turness, the CEO of BBC News have resigned over recent events. But Davie especially has been dealing with controversies for years. ",
        "Content": "\n          Arts and entertainment correspondent\n        Under his tenure, Tim Davie has had to deal with a lot. While both he and his head of news Deborah Turness have resigned over events of the last week, it's important to also take into account just how shaky the last couple of years have been for Davie - earning him the nickname 'Teflon Tim'. While his missteps on Strictly and firings on MasterChef have made tabloid headlines, it's the errors when it comes to news coverage that are arguably most inexcusable at an organisation that prides itself on putting trust and accountability at its heart. Follow latest: Trump responds to Davie resignation  You might remember Davie dodged calls for his resignation earlier this year when it emerged a child narrator on one of its documentaries was the son of a Hamas official. They investigated, apologised and tried to move on, but just over a week ago, Davie found himself going from the frying pan into the fire. That's when a leaked memo by a former adviser to the corporation was published - accusing the corporation of \"serious and systemic\" bias in its coverage of issues including Gaza, trans rights and Donald Trump. For an organisation that talks the talk on trust and accountability being such an important part of what it stands for, time and time again under Davie's tenure, it has felt almost as if - rather than coming out and facing the press - he's perfected the art of strategic invisibility. Read more:Tributes paid to ex-Top Gear hostDavina McCall shares cancer diagnosis While some may see him as a victim of culture wars in the time of Trump, the director-general spent the week ignoring the fire alarms going off inside the BBC. The truth is, he'd left it far too late. The heat was far too hot for him to do anything else but resign."
    },
    {
        "title": "Tim Davie and Deborah Turness's resignation letters in full – and the BBC response",
        "description": "The BBC's director-general Tim Davie and Deborah Turness, the CEO of BBC News, have resigned from their positions.",
        "url": "https://news.sky.com/story/tim-davie-and-deborah-turnesss-resignation-letters-in-full-8211-and-the-bbc-response-13467776",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bbc-broadcasting-house_6965315.jpg?20250715115906",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-09 21:53:00",
        "Headline": "BBC chair Samir Shah responded to Tim Davie and Deborah Turness's statements as the pair's exits were announced on Sunday evening. ",
        "Content": "The BBC's director-general Tim Davie and Deborah Turness, the CEO of BBC News, have resigned from their positions. The bosses announced their departures on Sunday evening and the notes they sent to staff at the corporation have been published. Read them both in full below, along with the response from the BBC's chair, Samir Shah. Tim Davie's note: \"I wanted to let you know that I have decided to leave the BBC after 20 years. This is entirely my decision, and I remain very thankful to the chair and board for their unswerving and unanimous support throughout my entire tenure, including during recent days. \"I am working through exact timings with the board to allow for an orderly transition to a successor over the coming months. \"I have been reflecting on the very intense personal and professional demands of managing this role over many years in these febrile times, combined with the fact that I want to give a successor time to help shape the charter plans they will be delivering. Analysis: 'Teflon Tim' has come unstuck \"In these increasingly polarised times, the BBC is of unique value and speaks to the very best of us. It helps make the UK a special place; overwhelmingly kind, tolerant and curious. Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable. \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision. Overall the BBC is delivering well, but there have been some mistakes made and as Director-General I have to take ultimate responsibility. \"Our organisation is a critical ingredient of a healthy society, as well as a thriving creative sector. We should champion it, not weaponise it. \"Despite a hugely competitive market, I am proud that the BBC remains the most trusted news brand globally. We have continued to ensure that it is used by almost everyone in the UK as well as hundreds of millions of people globally. Despite the inevitable issues and challenges, our journalism and quality content continues to be admired as a gold standard. \"Our transition to a digital organisation has been deeply impressive, and our thriving commercial businesses are admired globally. Also, our work together on ensuring that we have the right culture has been important and motivating. I could not be more impressed by what you are achieving. Read more:The controversies Davie has facedBBC Gaza doc breached Ofcom code  \"You will ask why now, why this moment? \"I am BBC through and through, having spent the last 20 years of my life working for this organisation as director of marketing, communications and audiences, director of audio and music, acting director-general and chief executive of BBC Studios. \"I care deeply about it and want it to succeed. That is why I want to create the best conditions and space for a new DG to come in and positively shape the next royal charter. I hope that as we move forward, a sensible, calm and rational public conversation can take place about the next chapter of the BBC. \"This timing allows a new DG to help shape the next charter. I believe we are in a strong position to deliver growth. \"Thank you again, it has been a wonderful ride, which I have loved. I count myself very lucky to have served as DG no.17. I will have a proper chance to see many of you before I go, but I have been incredibly proud to lead the BBC as DG for over five years. \"It is a precious UK institution and you are a world-class team. Thank you all for the tireless support and friendship. \"I will always be a passionate cheerleader for civilised society, a strong BBC and a thriving UK. \"Best wishes, Tim.\" Deborah Turness sent the following to BBC staff: \"Dear all, \"I have never been more proud of the work that you do every day. You really are the best of the best. \"I have taken the difficult decision that it will no longer be my role to lead you in the collective vision that we all have: to pursue the truth with no agenda. \"The ongoing controversy around the Panorama on President Trump has reached a stage where it is causing damage to the BBC - an institution that I love. \"As the CEO of BBC News and Current Affairs, the buck stops with me - and I took the decision to offer my resignation to the director-general last night. \"In public life leaders need to be fully accountable, and that is why I am stepping down. While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong. \"In a polarised world, BBC News journalism is more vital than ever, and I could not be prouder of the work that you do. Together we have bucked the global trend, to grow trust in BBC News, and I want to thank you, wherever you are in the world, for your courageous work to deliver that. \"My plea to you: please keep the courage to continue our mission. I'm only sorry that I won't be there to lead and champion your brilliant journalism. \"It has been a great privilege to work with you all. \"I will now work with Tim to plan an orderly handover to ensure that my decision to step away causes the least disruption possible to the important work that you do. \"With very best wishes, Deborah.\"  BBC chair Samir Shah shared separate statements on each exit. Here's his note on Mr Davie's resignation: \"This is a sad day for the BBC. Tim has been an outstanding director-general for the last five years. He has propelled the BBC forward with determination, single-mindedness and foresight. \"He has had the full support of me and the board throughout. However, I understand the continued pressure on him, personally and professionally, which has led him to take this decision today. The whole Board respects the decision and the reasons for it. \"Tim has given 20 years of his life to the BBC. He is a devoted and inspirational leader and an absolute believer in the BBC and public service broadcasting. He has achieved a great deal. Foremost, under his tenure, the transformation of the BBC to meet the challenges in a world of unprecedented change and competition is well underway.  \"Personally, I will miss his stamina, good humour and resilience and I will miss working with him. I wish him and his family the very best for the future. \"This is an important time for the corporation and the board and I will continue to work with Tim in the interim while we conduct the process to appoint his successor.\" And his response on Ms Turness's exit: \"I want to thank Deborah for her leadership of BBC News over the past three years. She has transformed the operation of News with real commitment and a clear vision of the future. \"She has acted with integrity in challenging circumstances and leaves a strong legacy from which to build for the many millions around the world who rely on and trust the voice of BBC News every day.\""
    },
    {
        "title": "The BBC controversies faced by Tim Davie during his time in charge",
        "description": "Tim Davie stepping down as director-general of the&#160;BBC comes after several controversies faced by the broadcaster in recent years.",
        "url": "https://news.sky.com/story/the-bbc-controversies-faced-by-tim-davie-during-his-time-in-charge-13467725",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-donald-trump-capitol_5230334.jpg?20221216224518",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-09 20:38:00",
        "Headline": "After 20 years at the BBC, and in charge for the last five, Tim Davie has announced his resignation. Here are some of the controversies he has faced during his time as director-general.",
        "Content": " Tim Davie stepping down as director-general of the BBC comes after several controversies faced by the broadcaster in recent years. His resignation came at the same time as that of BBC News chief executive Deborah Turness, at the end of a week in which concerns about impartiality were raised over how a speech by US President Donald Trump was edited in an episode of Panorama. \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision,\" Mr Davie wrote in a note sent to staff. \"Overall, the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.\" Mr Davie has been in the role for five years and at the BBC for 20 in total, having previously worked as director of marketing, director of audio and music, and chief executive of BBC Studios. Here are the controversies the broadcaster has faced in recent years. The Trump documentary edit A memo sent in the summer by a former external adviser to the BBC's editorial standards committee, highlighting the edit of a Donald Trump speech as well as other concerns about impartiality, was first reported by The Daily Telegraph on Tuesday.  The concerns regard clips spliced together from sections of a speech made by the US president on 6 January 2021, featured in the Panorama programme Trump: A Second Chance? It made it appear that Mr Trump told supporters he was going to walk to the US Capitol with them to \"fight like hell\", although the quotes were made during separate parts of the speech. The episode was broadcast by the BBC the week before last year's US election. Bob Vylan at Glastonbury In July, punk-rap duo Bob Vylan led chants of \"death to the IDF\" while on stage at Glastonbury, a performance which was live-streamed as part of the BBC's coverage of the festival. Afterwards, the broadcaster said it would no longer live broadcast \"high risk\" performances, and suggested disciplinary action could be taken against staff who failed to halt the stream. The BBC's Executive Complaints Unit received four complaints about the performance relating to incitement to violence, terrorism or ethnic cleansing, hate speech and expressions of antisemitism.  In a ruling given in September, it found the stream of the performance had breached its editorial standards. Following the backlash over the Glastonbury gig, Bob Vylan said in a post on Instagram that \"we are not for the death of Jews, Arabs or any other race or group of people\". MasterChef In the same month, presenter Gregg Wallace was sacked from cooking show MasterChef after an investigation into historical allegations of misconduct upheld multiple accusations against him. These first emerged towards the end of 2024. Wallace, who co-presented the show for almost 20 years, said he was \"deeply sorry for any distress caused\" and that he \"never set out to harm or humiliate\", but also said in a statement released ahead of the publication of a summary of the report that he had been \"cleared of the most serious and sensational accusations\" made against him.  His co-presenter John Torode left the show the following week after an allegation he used an \"extremely offensive racist term\" was upheld, the BBC said. In October, Wallace announced he was suing the broadcaster for \"distress and harassment\". Gary Lineker No stranger to controversy during his last few years at the BBC, Gary Lineker stepped down from hosting Match Of The Day and World Cup coverage in May. It came after he apologised unreservedly for sharing a social media post from the Palestine Lobby group that had been illustrated with a rat - which has been used to represent Jewish people in antisemitic propaganda, including Nazi Germany. He said he had not known about the rat's symbolism. \"I would never consciously repost anything antisemitic - it goes against everything I stand for,\" Lineker said in a statement as he confirmed his resignation. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" The former England star had previously been temporarily suspended from the BBC in March 2023, after an impartiality row over comments he made criticising the then Conservative government's asylum policy. His temporary suspension led pundits Ian Wright and Alan Shearer to both announce they would not appear on Match of the Day, and a shortened show went ahead without commentary, pundit analysis, or post-match interviews. The incident sparked a report, which decided that high-profile BBC presenters outside of its news coverage should be able to express their views on political issues as long as they stop short of campaigning. Gaza documentary Gaza: How To Survive A Warzone was pulled from BBC iPlayer in February after it emerged that the 13-year-old boy narrating the programme was the son of a deputy minister in the Hamas-run government. The documentary was made by independent production company Hoyo Films. A BBC review into the controversial programme said three members of the independent production company knew about the role of the boy's father - but no one within the corporation was aware. In July, the BBC said it had breached its own editorial guidelines by failing to disclose the full identity of the child narrator's father - Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. In October, an Ofcom investigation found the documentary had breached the broadcasting code. Huw Edwards In April 2024, veteran news presenter Huw Edwards resigned from the BBC, nine months after coming off air following accusations of paying a teenager thousands of pounds for sexually explicit pictures. Just a few months later, it emerged he had remained one of the broadcaster's highest-paid stars of the year, despite his suspension. Days later, new allegations emerged - and he was charged and pleaded guilty in court to three counts of \"making\" indecent images of children, after receiving the illegal images as part of a WhatsApp conversation. The court heard how he paid up to £1,500 to a paedophile who sent him 41 illegal images between December 2020 and August 2021, seven of which were of the most serious type. The disgraced broadcaster avoided jail, but was given a six-month suspended sentence. Strictly Come Dancing Ahead of the 2024 series of BBC favourite Strictly Come Dancing, producers said they would introduce staff chaperones into all future rehearsals. It followed the departure of two professional dancers following complaints about their behaviour. Following an investigation, the BBC upheld \"some, but not all\" of the allegations made against Giovanni Pernice by his 2023 dance partner Amanda Abbington. Abbington described an apology from the corporation as vindication, while Pernice denied displaying \"abusive or threatening behaviour\" and said the majority of the complaints had not been upheld. Another professional dancer, Graziano Di Prima, also left the show amid reports of alleged misconduct. Apology over Diana interview In 2021, a report into Martin Bashir's bombshell 1995 programme with Princess Diana found the journalist had \"deceived and induced\" her brother to secure the interview. By using fake bank statements, Mr Bashir made a \"serious breach\" of BBC guidelines on straight-dealing, the Lord Dyson report concluded. Mr Davie, who was not at the BBC at the time the programme was made, issued a \"full and unconditional\" apology after the findings were released, and the corporation sent written apologies to Prince William and Prince Harry, as well as to Prince Charles and Earl Spencer. Mr Bashir also apologised and said the faking of bank statements was a \"stupid thing to do\" and \"an action I deeply regret\", but added he felt it had \"no bearing whatsoever on the personal choice by Princess Diana to take part in the interview\". Former director-general Lord Hall, who was the BBC's director of news and current affairs when the Diana interview was screened, said he accepted the corporation's 1996 inquiry into how the sit-down was secured \"fell well short of what was required\"."
    },
    {
        "title": "Monument honours millions who did not fight in WWII - but whose roles were vital to war effort",
        "description": "In the pouring rain, Nicola Pickett wiped a tear from her eye as she stared up at a 12-foot (3.7m) monument that finally gave recognition to her father, Job.&#160;",
        "url": "https://news.sky.com/story/monument-honours-millions-who-did-not-fight-in-wwii-but-whose-roles-were-vital-to-war-effort-13467778",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sculpture-reserved-occupationists_7077699.jpg?20251109224628",
        "type": "UK",
        "Author": "Lisa Dowd",
        "Date Published": "2025-11-09 21:47:00",
        "Headline": "People whose jobs were seen as vital to the war effort, like mining or making chains for warships, were prevented from joining up to the Second World War, even if they wanted to go and fight.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  In the pouring rain, Nicola Pickett wiped a tear from her eye as she stared up at a 12-foot (3.7m) monument that finally gave recognition to her father, Job.  \"This means the world,\" she told me. An imposing steel sculpture of a Black Country chain maker, stands at the edge of a churchyard in Cradley Heath. It commemorates millions of people who weren't allowed to fight in the Second World War because their jobs at home were too important. Nicola's dad had been a miner in the war. She said, \"he was a bit embarrassed because all of his brothers went to war and for years he wondered if he was appreciated for what he did\". I caught up with West Midlands-based sculptor Luke Perry before the monument was unveiled on Remembrance Sunday, finding him hammering another name into the artwork's base. People keep coming up to him to say they also had a relative known as a \"reserved occupationist\", and they'd like to have them remembered. Luke's grandfather, Eric, was one. He made chains in the war, which helped to power the Royal Navy's warships. \"There was a very complicated set of feelings going on,\" Luke said. \"He never said he wanted to fight necessarily, but I think he did say that he perhaps should have gone and that sense of duty was very heavy to that generation, and that is what they carried for their lives.\" A man called Harry taps me on the shoulder to show me a black-and-white photo of his dad, also called Harry. \"There he is, seventh from the left,\" he says as he points him out. His dad also made chains, but had wanted to go to war. \"I knew he felt guilty about it because my mum told me when he went to join up they refused him… and I felt a little bit guilty too because I had friends whose dads were in the war.\" Read more on Sky News:King leads Remembrance Sunday silenceHero rail worker regains consciousnessBBC bosses resign A lady named Jen called me over to show me her dad's old business card. Leslie, she said, had been an accountant for a bus company transporting workers during the war and couldn't be conscripted. She said some people had suggested he was a \"conscientious objector\" because he wasn't fighting. \"It hurt him, it really did, because his brother luckily survived. He did come back, but it sort of caused a bit of unrest in the family as to why the elder son couldn't go to war.\""
    },
    {
        "title": "Manhunt for prisoner who 'absconded' after being freed from HMP Wandsworth for brother's wedding",
        "description": "A Palestine Action protester who was temporarily freed from jail to go to his brother's wedding has failed to return to Wandsworth prison, Sky News understands.",
        "url": "https://news.sky.com/story/manhunt-for-prisoner-who-absconded-after-being-freed-from-hmp-wandsworth-for-brothers-wedding-13467181",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hmp-wandsworth-london_7072725.jpg?20251105122500",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-11-09 11:51:00",
        "Headline": "Police are searching for Sean Middlebrough, a Palestine Action protester, who has failed to return to the south London jail.",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n A Palestine Action protester who was temporarily freed from jail to go to his brother's wedding has failed to return to Wandsworth prison, Sky News understands. Police are searching for Sean Middlebrough, 32, who was being held on remand at HMP Wandsworth. It's understood he was granted bail by a judge to attend his brother's wedding, but hasn't returned. Middlebrough was charged over an alleged plot by activists to disrupt the London Stock Exchange by chaining themselves to the building. Palestine Action was formally proscribed as a terrorist organisation earlier this year. A government spokesperson said \"court decisions are made by judges - independently of government\". \"Absconding is a serious criminal offence, and any defendant who commits this crime could face longer behind bars,\" they added.  This failure to return to HMP Wandsworth in south London marks the latest in a string of embarrassing episodes for the justice system, after three high-profile mistaken prison releases in the past two weeks. The number of these types of errors has risen recently, with 262 instances between March 2024 and March 2025 - a 128% increase on 115 in the previous 12 months.  Read more: How many prisoners are released by mistake? 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Culture Secretary Lisa Nandy told Sky News the government is \"gripping\" the prisons crisis, adding it is \"unacceptable\" that the number of prisoners being wrongly released has risen. She told Sunday Morning With Trevor Phillips that Justice Secretary David Lammy has made a senior appointment \"to make sure we really grip this\". Read more from Sky News:Labour exploring Danish migration modelKing leads Remembrance Sunday service     Brahim Kaddour-Cherif, a 24-year-old Algerian sex offender, was released in error from HMP Wandsworth on 29 October - just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex. Kaddour-Cherif came to the UK legally and is not an asylum seeker, but it is understood he overstayed his visit visa and deportation proceedings had been started. Sky News filmed the moment Kaddour-Cherif was detained on Friday 7 November. Kebatu came to the UK illegally before sexually assaulting a child, for which he was jailed. He has since been recaptured and deported. A third man, fraudster William Smith, 35, was mistakenly released from HMP Wandsworth on 3 November, but turned himself in on Thursday 6 November. "
    },
    {
        "title": "Starmer avoided political heat at home during Brazil climate conference - but he returns to a prisons crisis",
        "description": "Sir Keir Starmer's been on the other side of the world for most of the week - at the COP30 climate summit in Brazil, his 40th foreign trip in 16 months.",
        "url": "https://news.sky.com/story/starmer-avoided-political-heat-at-home-during-brazil-climate-conference-but-he-returns-to-a-prisons-crisis-13467463",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-prime-minister_7077200.jpg?20251109171609",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-09 16:58:00",
        "Headline": "The prime minister comes back from the COP talks as his government struggles to deal with the fallout from a spate of wrongly-released prisoners and his colleagues' unconvincing attempts to reassure the public.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Sir Keir Starmer's been on the other side of the world for most of the week - at the COP30 climate summit in Brazil, his 40th foreign trip in 16 months. Back home, his government's credibility has continued its painful unravelling. Five days on from David Lammy's disastrous stand-in performance at PMQS, the justice secretary's ministerial colleagues are still struggling to explain why he repeatedly failed to answer questions on whether another migrant criminal had been released from prison by mistake. Yes, Conservative MP James Cartlidge got the question wrong, as Brahim Kaddour-Cherif was an illegal migrant, not an asylum seeker. But Mr Cartlidge argued that because the deputy prime minister failed to divulge the information he did have, he failed to act with full transparency and should be investigated by the PM's ethics advisor for a possible breach of the ministerial code. Culture Secretary Lisa Nandy has been defending Mr Lammy's response.  She told Sunday Morning with Trevor Phillips she doesn't accept that he was being evasive, insisting Mr Lammy had been carefully weighing his words to ensure that \"when we do speak about matters of such significance to the public… we do so with care and make sure the full facts are presented\". At that time, rather extraordinarily, we're told the justice secretary did not have the full facts of the case, even though the Metropolitan Police had been informed the day before (six days after Kaddour-Cherif was accidentally freed). How Sky correspondent found escaped prisoner  The combination of wrongly-freed prisoners and illegal migrants is a conjunction of two of the most toxic issues in British politics - the overflowing prison system and the dysfunctional asylum system. Both are vast, chaotic problems the government is struggling to get a grip on, as the Conservatives also found, to their cost. But ministers' ongoing failure to bring both issues under control has only been highlighted by Mr Lammy's sloppy handling of the situation. Football regulator donations row Ms Nandy has herself been at the heart of another government controversy this week - over the appointment of the new football regulator, David Kogan.  An independent investigation found she \"unknowingly\" breached the code on public appointments by failing to declare that Mr Kogan had previously donated £2,900 to her Labour leadership campaign - and also criticised her department for not highlighting his status as a Labour donor who had previously given £33,410 to the party. The culture secretary has apologised and explained she had been unaware of the donations. She also pointed out that Mr Kogan was a candidate originally put forward by the Conservatives. But again, it's messy. It's yet another story which chips away at the government's promises to clear up politics and act with full transparency and accountability.  Budget blues? The ultimate breach of trust looks set to come with the budget on 26 November, however. In an extraordinary early morning speech this week, Chancellor Rachel Reeves signalled that she's likely to raise taxes in two and a half weeks - and thus breach the core promise of the Labour Party manifesto. The rationale for her dire warnings on Tuesday was to start explaining why she will probably have to do so - getting in her excuses early about the languishing state of the economy as a result of Brexit, Donald Trump's tariffs and her inheritance from the Conservatives. The Tories claim Ms Reeves could sort out the finances by cutting welfare spending - something ministers dramatically failed to do when their efforts at reform were scuttled by angry backbenchers. Read more:Govt 'gripping' prisons crisisDenmark migration model backedPrisons 'close to breaking point' Governments breach their manifesto commitments all the time. But if the chancellor goes ahead and puts up income tax, as expected (even if that's offset, for some, by a corresponding cut to national insurance), it will be a shock - and the first such increase in 50 years. The new deputy leader of the party, Lucy Powell, pointedly warned the government this week about the risks of breaching trust in politics by breaking manifesto promises. Lisa Nandy didn't shoot her comments down when Sir Trevor asked for her response, arguing instead that while \"we take our promises very, very seriously\", they [Labour] \"were also elected on a promise to change this country\", with a particular focus on fixing the NHS. The impossibility of doing both - protecting taxes while also increasing government spending in such a challenging economic climate - highlights the folly of making such restrictive promises. But voters are not in a forgiving mood."
    },
    {
        "title": "Ghislaine Maxwell's emails from minimum-security jail leaked - amid claims of 'VIP treatment'",
        "description": "Ghislaine Maxwell has said she is \"much, much happier\" since being moved to a minimum-security prison in Texas, leaked emails reveal.",
        "url": "https://news.sky.com/story/ghislaine-maxwells-emails-from-minimum-security-jail-leaked-amid-claims-of-vip-treatment-13467069",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-ghislaine-maxwell-jeffrey-epstein_5608363.jpg?20211229223739",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-09 02:44:00",
        "Headline": "The convicted sex trafficker wrote to a relative: \"I have not seen a single fight, drug deal, passed out person or naked inmate running around or several of them congregating in a shower! In other words, I feel like I have dropped through Alice in Wonderland's looking glass.\"",
        "Content": "Ghislaine Maxwell has said she is \"much, much happier\" since being moved to a minimum-security prison in Texas, leaked emails reveal. The messages - which were shared with US politicians - have been exclusively obtained by Sky's US partner NBC News. Maxwell, a disgraced British socialite and ex-girlfriend of the convicted paedophile Jeffrey Epstein, is serving a 20-year sentence for sex trafficking. She was moved days after being interviewed by the Justice Department in July - even though prisoners convicted of sex offences aren't meant to be held in such facilities. This - along with reported perks such as meals sent to her dormitory room, late-night workouts and permission to shower when other inmates are in bed - have led some critics to claim she is receiving \"VIP treatment\". Describing conditions at Federal Prison Camp Bryan, Maxwell wrote to a relative: \"The food is legions better, the place is clean, the staff polite... I haven't heard or seen the usual foul language or screaming accompanied by threats levelled by inmates by anyone. \"I have not seen a single fight, drug deal, passed out person or naked inmate running around or several of them congregating in a shower! In other words, I feel like I have dropped through Alice in Wonderland's looking glass.\" The 63-year-old contrasted this with FCI Tallahassee in Florida, where she described possums falling from ceilings, frying on ovens, and mingling with food being served. Some of Maxwell's new inmates have told The Wall Street Journal that they have been threatened with retaliation if they speak about her to the media - with reports suggesting at least one was transferred. Her lawyer David Oscar Markus told NBC News: \"There's nothing journalistic about publishing a prisoner's private emails, including ones with her lawyers. That's tabloid behaviour, not responsible reporting. \"Anyone still interested in that kind of gossip reveals far more about themselves than about Ghislaine. It's time to get over the fact that she is in a safer facility. We should want that for everyone.\" Meanwhile, Maxwell's brother Ian said their messages were \" private by their very nature\" - and if they were sent to a reporter, \"they were stolen and leaked without authorisation\". The Justice Department has declined to comment. Read more:Andrew urged to tell police about his time with EpsteinKing formally strips Andrew of prince title and HRH style  Federal Prison Camp Bryan is located in a residential area, ringed with barbed wire and houses about 635 prisoners - and Maxwell's arrival over the summer sparked protests. One demonstrator said back in August: \"It's brought a lot of attention to our town that we haven't consented for. We don't want a child sex trafficker here.\" Last month, the Supreme Court rejected Maxwell's attempts to appeal her sentence - meaning a presidential pardon from Donald Trump is now her best shot at being freed before her projected release date in 2037, when she would be 75 years old. Mr Trump told reporters at the time that he was planning to speak to the Justice Department and \"would have to take a look\" at whether he would consider clemency.  Epstein died by suicide while awaiting trial on sex trafficking charges back in 2019, but pressure remains on those who had connections to the disgraced financier. Earlier this week, the US Congress wrote to Andrew Mountbatten Windsor - who has now been stripped of his royal titles by the King - requesting an interview about his \"long-standing friendship\" with Epstein. Virginia Giuffre, who died in April, accused Andrew of sexually assaulting her after being introduced by Epstein. Andrew has always vehemently denied her accusations. She alleged she was forced to have sex with Andrew three times - including once at Ghislaine Maxwell's home in London."
    },
    {
        "title": "Two dead and a million evacuated as Super Typhoon Fung-wong hits Philippines",
        "description": "Two people have died and more than one million people evacuated after a storm bearing down on the Philippines intensified into a super typhoon and made landfall on Sunday.",
        "url": "https://news.sky.com/story/nearly-a-million-people-evacuate-as-super-typhoon-fung-wong-hits-philippines-13467085",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-philippines-typhoon_7077462.jpg?20251109192636",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-09 06:41:00",
        "Headline": "Fung-wong starts battering eastern and central parts of the country as it makes landfall, causing power outages, and forcing the evacuation of high-risk villages. Filipinos are still dealing with the aftermath of Typhoon Kalmaegi, which killed more than 200 people earlier this week.",
        "Content": " Two people have died and more than one million people evacuated after a storm bearing down on the Philippines intensified into a super typhoon and made landfall on Sunday. Fung-wong started battering eastern and central parts of the country, causing power outages, and forcing President Ferdinand Marcos Jr to declare a state of emergency. One person drowned in Catanduanes and firefighters recovered the body of a woman trapped under the debris of a collapsed home in Catbalogan City, officials said. Packing sustained winds of 115mph and gusts of up to 140mph, Super Typhoon Fung-wong made landfall in Aurora province in central Luzon. Those living in high-risk villages in northeastern provinces were told to evacuate, including in Bicol, a coastal region vulnerable to Pacific cyclones and mudflows from Mayon, one of the country's most active volcanoes. Defence secretary Gilberto Teodoro Jr warned Fung-wong could affect a vast expanse of the country, including the capital Manila, and Cebu, the central province hit hardest by the deadly Typhoon Kalmaegi just days ago. More than 200 people were killed in the earlier typhoon, and around 100 are still missing.  Mr Teodoro Jr urged residents to heed evacuation orders, warning refusing to comply was dangerous and unlawful. \"We ask people to pre-emptively evacuate so that we don't end up having to conduct rescues at the last minute, which could put the lives of police, soldiers, firefighters and coast guard personnel at risk,\" he said in a public address. More than 30 million people could be exposed to hazards posed by Fung-wong, the Office of Civil Defence said. In Isabela in northern Luzon, dozens of families were sheltering at a basketball court repurposed as an evacuation centre. \"We're scared,\" said Christopher Sanchez, 50, who fled his home with his family. \"We're here with our grandchildren and our kids. The whole family is in the evacuation area.\" Nearly 400 domestic and international flights have been cancelled, according to the civil aviation regulator. Read more from Sky News:Ghislaine Maxwell's emails from jail leakedThe Amazonians who don't care who Trump is  Deadly tornado in Brazil Meanwhile, a powerful tornado ripped through the southern state of Parana in Brazil - killing at least six and injuring more than 750 people, state officials said on Saturday. The tornado left a trail of destruction, downing trees, overturning vehicles and damaging buildings. Roads were also blocked and power lines damaged, with authorities saying around 1,000 people were displaced, \"We will continue to assist the people of Parana and provide all the help needed,\" President Luiz Inacio Lula da Silva wrote on X."
    },
    {
        "title": "UK deploying specialist RAF team to defend Belgium from 'rogue' drones",
        "description": "The UK is deploying a specialist Royal Air Force team to help defend Belgium's skies following a series of sightings of \"rogue\" drones, the defence secretary and his military chief have revealed.",
        "url": "https://news.sky.com/story/uk-deploying-specialist-raf-team-to-defend-belgium-from-rogue-drones-13467164",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-queen-camilla-anti-drone_7076723.jpg?20251109113435",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-09 10:45:00",
        "Headline": "The ground-based unit will be equipped with kit that can track and take down unmanned aerial systems.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK is deploying a specialist Royal Air Force team to help defend Belgium's skies following a series of sightings of \"rogue\" drones, the defence secretary and his military chief have revealed. The ground-based unit will be equipped with kit that can track and take down unmanned aerial systems. It is not yet clear who is responsible for the drone incursions, which forced the country's main airport near Brussels to close temporarily and have also impacted Belgian military bases. However, there are suspicions that they could be linked to Russia. Other NATO nations have also experienced similar problems, including Denmark and Germany. Ukraine war latest: Lavrov 'ready' to meet US's Rubio Air Chief Marshal Sir Rich Knighton, speaking to Trevor Phillips on Sky News, said his Belgian counterpart had called him to request British support. \"I had my Belgian opposite number - the chief of the defence staff - in touch with me this week, seeking our help to track and potentially defeat the drones,\" he said. \"We agreed with the defence secretary on Friday that we would send our people and our equipment into Belgium to help them with the current problem they have got there.\" Read more from Sky News:Ghislaine Maxwell's emails from minimum-security jail leakedSouthport victims 'failed at every possible turn' John Healey, the defence secretary, said: \"When our NATO allies call, we step up. Belgium requested urgent support to counter rogue drone activity at their military bases, so I've directed a small team of RAF specialists to deploy immediately. \"As hybrid threats grow, our strength lies in our alliances and our collective resolve to defend, deter and protect our critical infrastructure and airspace.\" The RAF team is trained and equipped to combat drones."
    },
    {
        "title": "Three dead and 15 injured in Tenerife tidal surge",
        "description": "Three people have died after they were swept into the sea off the coast of Tenerife during treacherous weather, officials said on Sunday.",
        "url": "https://news.sky.com/story/three-dead-and-15-injured-in-tenerife-tidal-surge-13467146",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tenerife-generic_7076675.jpg?20251109100636",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-09 09:58:00",
        "Headline": "Authorities had warned people of a tidal surge and strong winds at the popular Spanish holiday island, advising them not to walk along coastal paths.",
        "Content": "Three people have died after they were swept into the sea off the coast of Tenerife during treacherous weather, officials said on Sunday. Strong waves pulled them into the Atlantic Ocean during a tidal surge on Saturday. A man who had fallen into the water at Charco del Viento, a rocky beauty spot in the north of the island not far from Icod de los Vinos, was airlifted to hospital and was pronounced dead on arrival, Spanish media reported. In a separate incident, a man was found floating off Cabezo beach in El Medano in the south of the island. Lifeguards and paramedics were unable to resuscitate him and he was pronounced dead at the scene. A woman suffered a heart attack and died when a wave swept several people into the sea at Puerto de la Cruz in northern Tenerife. Three people were seriously injured and taken to hospital for treatment. The victim was a 79-year-old Dutch woman, according to El Dia. The Spanish newspaper reported the deceased at Charco del Viento was a 43-year-old man from La Orotava, a town in northern Tenerife, while the identity of the man who died at Cabezo beach had not been released. Around 15 people were injured in four different incidents along the coast of the island of Tenerife on Saturday, according to emergency services. Read more from Sky News:Super Typhoon Fung-wong hits PhilippinesGhislaine Maxwell's emails from jail leakedThe Amazonians who don't care who Trump is Authorities had warned people of a tidal surge and strong winds, advising them not to walk along coastal paths and avoid putting themselves at risk by taking photos and videos of the rough seas. The Canary Islands, a Spanish archipelago off the west coast of Africa that includes Tenerife, are on alert for coastal hazards, officials said."
    },
    {
        "title": "Third body pulled from rubble after boiler tower collapses in South Korea - four still trapped ",
        "description": "A third body has been pulled from rubble after a boiler tower at a thermal power plant collapsed in South Korea. ",
        "url": "https://news.sky.com/story/third-body-pulled-from-rubble-after-boiler-tower-collapses-in-south-korea-four-still-trapped-13467074",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-south-korea-power-plant_7073411.jpg?20251106071807",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-09 04:11:00",
        "Headline": "Rescuers have deployed heat sensors and search dogs in their attempts to reach the workers - however, their efforts have been hampered by the risk of a further collapse.",
        "Content": "A third body has been pulled from rubble after a boiler tower at a thermal power plant collapsed in South Korea.  Rescuers in the southeastern city of Ulsan have been involved in a painstaking operation to reach those trapped. The structure had collapsed on Thursday while it was being prepared for demolition. Officials say the first two bodies were recovered on Friday. A 44-year-old man died while awaiting rescue that same day, and firefighters reached his body early on Sunday morning. A further two workers are presumed dead and are believed to still be trapped under the debris. Meanwhile, the exact locations of another two workers are yet to be confirmed. The 60m (196ft) tall structure was being weakened at the time of its collapse. Operations at the boiler tower had ceased in 2021 after 40 years of continual use. Rescuers have deployed heat sensors and search dogs in their attempts to reach the workers. However, their efforts have been hampered by the risk of a further collapse. Read more from world news:Ghislaine Maxwell's emails leakedSyria arrests 71 in clampdown on IS Kim Jeong-shik, an official with the local fire department, said earlier this week: \"The rescue site is currently covered with large amounts of asbestos and glass fibres. \"The space is extremely cramped, forcing rescue workers to manually clear the debris by hand in order to carry out the rescue operations.\" South Korean President Lee Jae Myung has ordered officials to mobilise all available personnel and equipment for the rescue effort."
    },
    {
        "title": "Ghislaine Maxwell's emails from minimum-security jail leaked - amid claims of 'VIP treatment'",
        "description": "Ghislaine Maxwell has said she is \"much, much happier\" since being moved to a minimum-security prison in Texas, leaked emails reveal.",
        "url": "https://news.sky.com/story/ghislaine-maxwells-emails-from-minimum-security-jail-leaked-amid-claims-of-vip-treatment-13467069",
        "image_url": "https://e3.365dm.com/21/12/1920x1080/skynews-ghislaine-maxwell-jeffrey-epstein_5608363.jpg?20211229223739",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-09 02:44:00",
        "Headline": "The convicted sex trafficker wrote to a relative: \"I have not seen a single fight, drug deal, passed out person or naked inmate running around or several of them congregating in a shower! In other words, I feel like I have dropped through Alice in Wonderland's looking glass.\"",
        "Content": "Ghislaine Maxwell has said she is \"much, much happier\" since being moved to a minimum-security prison in Texas, leaked emails reveal. The messages - which were shared with US politicians - have been exclusively obtained by Sky's US partner NBC News. Maxwell, a disgraced British socialite and ex-girlfriend of the convicted paedophile Jeffrey Epstein, is serving a 20-year sentence for sex trafficking. She was moved days after being interviewed by the Justice Department in July - even though prisoners convicted of sex offences aren't meant to be held in such facilities. This - along with reported perks such as meals sent to her dormitory room, late-night workouts and permission to shower when other inmates are in bed - have led some critics to claim she is receiving \"VIP treatment\". Describing conditions at Federal Prison Camp Bryan, Maxwell wrote to a relative: \"The food is legions better, the place is clean, the staff polite... I haven't heard or seen the usual foul language or screaming accompanied by threats levelled by inmates by anyone. \"I have not seen a single fight, drug deal, passed out person or naked inmate running around or several of them congregating in a shower! In other words, I feel like I have dropped through Alice in Wonderland's looking glass.\" The 63-year-old contrasted this with FCI Tallahassee in Florida, where she described possums falling from ceilings, frying on ovens, and mingling with food being served. Some of Maxwell's new inmates have told The Wall Street Journal that they have been threatened with retaliation if they speak about her to the media - with reports suggesting at least one was transferred. Her lawyer David Oscar Markus told NBC News: \"There's nothing journalistic about publishing a prisoner's private emails, including ones with her lawyers. That's tabloid behaviour, not responsible reporting. \"Anyone still interested in that kind of gossip reveals far more about themselves than about Ghislaine. It's time to get over the fact that she is in a safer facility. We should want that for everyone.\" Meanwhile, Maxwell's brother Ian said their messages were \" private by their very nature\" - and if they were sent to a reporter, \"they were stolen and leaked without authorisation\". The Justice Department has declined to comment. Read more:Andrew urged to tell police about his time with EpsteinKing formally strips Andrew of prince title and HRH style  Federal Prison Camp Bryan is located in a residential area, ringed with barbed wire and houses about 635 prisoners - and Maxwell's arrival over the summer sparked protests. One demonstrator said back in August: \"It's brought a lot of attention to our town that we haven't consented for. We don't want a child sex trafficker here.\" Last month, the Supreme Court rejected Maxwell's attempts to appeal her sentence - meaning a presidential pardon from Donald Trump is now her best shot at being freed before her projected release date in 2037, when she would be 75 years old. Mr Trump told reporters at the time that he was planning to speak to the Justice Department and \"would have to take a look\" at whether he would consider clemency.  Epstein died by suicide while awaiting trial on sex trafficking charges back in 2019, but pressure remains on those who had connections to the disgraced financier. Earlier this week, the US Congress wrote to Andrew Mountbatten Windsor - who has now been stripped of his royal titles by the King - requesting an interview about his \"long-standing friendship\" with Epstein. Virginia Giuffre, who died in April, accused Andrew of sexually assaulting her after being introduced by Epstein. Andrew has always vehemently denied her accusations. She alleged she was forced to have sex with Andrew three times - including once at Ghislaine Maxwell's home in London."
    },
    {
        "title": "Four killed and 11 injured after car fleeing police smashes into Florida bar",
        "description": "Four people have been killed and 11 injured after a speeding car fleeing police slammed into a crowded bar in Tampa, Florida.",
        "url": "https://news.sky.com/story/four-killed-and-11-injured-after-car-fleeing-police-smashes-into-florida-bar-13467135",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tampa-florida-crash_7076682.jpg?20251109101927",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-09 09:27:00",
        "Headline": "The driver lost control and hit more than a dozen people outside a bar, police say. The force says the crash was not targeted.",
        "Content": "Four people have been killed and 11 injured after a speeding car fleeing police slammed into a crowded bar in Tampa, Florida. An air patrol unit spotted the silver sedan driving recklessly on a motorway around 12.40am on Saturday after it was seen racing in another neighbourhood, the Tampa Police Department said. The Florida Highway Patrol caught up with the vehicle and tried to perform a PIT manoeuvre, which involves striking the car's rear to cause it to spin out, but it was unsuccessful. Highway patrol officers \"disengaged\" as the vehicle sped toward the historic Ybor City, which is known for its nightlife and tourists. The driver then lost control and hit more than a dozen people outside the bar, Bradley's on 7th, police said. The force said the crash was not targeted. Three people died at the scene and a fourth died at hospital. Police said, as of Saturday afternoon, two people were in hospital in a critical condition, seven were listed as stable and two had been treated and discharged. Two people who only had minor injuries declined treatment at the scene. \"What happened this morning was a senseless tragedy, our hearts are with the loved ones of the victims and all those who were impacted,\" police chief Lee Bercaw said. \"Reckless driving put innocent lives in danger.\" Officers identified the suspect as Silas Sampson, 22. Court documents show he was charged with four counts of vehicular homicide and four counts of aggravated fleeing or eluding with serious bodily injury or death - all first-degree felonies. Read more from Sky News:Ghislaine Maxwell's emails from minimum-security jail leakedSouthport victims 'failed at every possible turn' \"Our entire city feels this loss,\" mayor Jane Castor said. In a statement, the owner of Bradley's on 7th, Bradley Nelson, said the driver hit three people on the pavement before careering into the bar's patio area. \"This event has been very traumatic for my entire staff, and myself,\" he said. \"Our thoughts and prayers go to the families of those who were killed, and to all the injured.\""
    },
    {
        "title": "Carlyle seizes control of online retailer Very Group",
        "description": "The unravelling of the Barclay family's business empire will continue this week when Carlyle, the US-based investment giant, formally takes control of The Very Group, one of Britain&#8217;s biggest online retailers.",
        "url": "https://news.sky.com/story/carlyle-seizes-control-of-online-retailer-very-group-13467453",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-very-group-verygroup_6985453.jpg?20250808104049",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-09 16:51:00",
        "Headline": "The Nasdaq-listed investment giant will announce on Monday that it has taken ownership of one of the UK’s biggest online shopping companies from the Barclay family, its owner since 2002, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The unravelling of the Barclay family's business empire will continue this week when Carlyle, the US-based investment giant, formally takes control of The Very Group, one of Britain’s biggest online retailers. Sky News has learnt that the company, which boasts annual revenues of over £2bn and is chaired by Nadhim Zahawi, the former Conservative chancellor, will announce on Monday that Carlyle has become its controlling shareholder. IMI, the Abu Dhabi-based media group which has been part of efforts to take control of The Daily Telegraph since 2023, will remain a lender to The Very Group. Sources said the company's directors had held a board meeting on Sunday to ratify the changes. The transaction brings to an end more than 20 years of the Barclay family's involvement with the business, which was known as Littlewoods when it last changed hands in 2002 in a £750m deal. Nasdaq-listed Carlyle injected several hundred million pounds into Very Group's capital structure, paving the way for it to take ownership control under the terms of the financing. Sources said the change of control would provide the online retailer with a stronger capital base and greater financial flexibility to support a concerted growth effort. \n                  'I bought a €1 house - and got more than I bargained for in a padlocked chest' | Money blog\n                 \n                  Why a Sky-ITV deal makes sense in a shifting entertainment landscape\n                 \n                  ITV in 'preliminary' talks over £1.6bn sale of media and entertainment arm to Sky\n                 Previously known as Shop Direct, Very Group employs thousands of people, and sells general merchandise under the Very and Littlewoods brands, encompassing electrical goods, homewares, fashion and toys. It has 4.4million customers and operates a major consumer finance business to help shoppers manage their payments. Mr Zahawi was appointed as the company's chairman last year, days after he announced that he was standing down as the MP for Stratford-on-Avon at the July 2024 general election. He replaced Aidan Barclay, a senior member of the family which has owned the business for 23 years. In its latest full-year results, group chief executive Robbie Feather announced a 16% increase in adjusted earnings before interest, tax, depreciation and amortisation to £307m. Read more from Sky News:Why a Sky-ITV deal makes sense in a shifting entertainment landscapeBurger chain Five Guys hunts new investor to flip stake Carlyle's move to take control of Very Group was revealed by Sky News in the summer. Earlier this year, the company borrowed a further £600m from Arini, a Mayfair-based fund, as it sought to stave off a cash crunch and buy itself breathing space. The Barclay family drew up plans to hire bankers to run an auction of Very Group earlier this year, but a process was never formally launched. Retail industry insiders have long speculated that the business was likely to be valued in the region of £2.5bn - below the valuation which the Barclay family was holding out for in an auction which took place several years ago. The Barclays, who used to own London's Ritz hotel, have already lost control of other corporate assets, including the Yodel parcel delivery service, as well as the Telegraph newspapers. Carlyle, which declined to comment, could hold onto the business for a significant period before looking to offload it. Very Group also declined to comment on Sunday."
    },
    {
        "title": "Starmer avoided political heat at home during Brazil climate conference - but he returns to a prisons crisis",
        "description": "Sir Keir Starmer's been on the other side of the world for most of the week - at the COP30 climate summit in Brazil, his 40th foreign trip in 16 months.",
        "url": "https://news.sky.com/story/starmer-avoided-political-heat-at-home-during-brazil-climate-conference-but-he-returns-to-a-prisons-crisis-13467463",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-prime-minister_7077200.jpg?20251109171609",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-09 16:58:00",
        "Headline": "The prime minister comes back from the COP talks as his government struggles to deal with the fallout from a spate of wrongly-released prisoners and his colleagues' unconvincing attempts to reassure the public.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Sir Keir Starmer's been on the other side of the world for most of the week - at the COP30 climate summit in Brazil, his 40th foreign trip in 16 months. Back home, his government's credibility has continued its painful unravelling. Five days on from David Lammy's disastrous stand-in performance at PMQS, the justice secretary's ministerial colleagues are still struggling to explain why he repeatedly failed to answer questions on whether another migrant criminal had been released from prison by mistake. Yes, Conservative MP James Cartlidge got the question wrong, as Brahim Kaddour-Cherif was an illegal migrant, not an asylum seeker. But Mr Cartlidge argued that because the deputy prime minister failed to divulge the information he did have, he failed to act with full transparency and should be investigated by the PM's ethics advisor for a possible breach of the ministerial code. Culture Secretary Lisa Nandy has been defending Mr Lammy's response.  She told Sunday Morning with Trevor Phillips she doesn't accept that he was being evasive, insisting Mr Lammy had been carefully weighing his words to ensure that \"when we do speak about matters of such significance to the public… we do so with care and make sure the full facts are presented\". At that time, rather extraordinarily, we're told the justice secretary did not have the full facts of the case, even though the Metropolitan Police had been informed the day before (six days after Kaddour-Cherif was accidentally freed). How Sky correspondent found escaped prisoner  The combination of wrongly-freed prisoners and illegal migrants is a conjunction of two of the most toxic issues in British politics - the overflowing prison system and the dysfunctional asylum system. Both are vast, chaotic problems the government is struggling to get a grip on, as the Conservatives also found, to their cost. But ministers' ongoing failure to bring both issues under control has only been highlighted by Mr Lammy's sloppy handling of the situation. Football regulator donations row Ms Nandy has herself been at the heart of another government controversy this week - over the appointment of the new football regulator, David Kogan.  An independent investigation found she \"unknowingly\" breached the code on public appointments by failing to declare that Mr Kogan had previously donated £2,900 to her Labour leadership campaign - and also criticised her department for not highlighting his status as a Labour donor who had previously given £33,410 to the party. The culture secretary has apologised and explained she had been unaware of the donations. She also pointed out that Mr Kogan was a candidate originally put forward by the Conservatives. But again, it's messy. It's yet another story which chips away at the government's promises to clear up politics and act with full transparency and accountability.  Budget blues? The ultimate breach of trust looks set to come with the budget on 26 November, however. In an extraordinary early morning speech this week, Chancellor Rachel Reeves signalled that she's likely to raise taxes in two and a half weeks - and thus breach the core promise of the Labour Party manifesto. The rationale for her dire warnings on Tuesday was to start explaining why she will probably have to do so - getting in her excuses early about the languishing state of the economy as a result of Brexit, Donald Trump's tariffs and her inheritance from the Conservatives. The Tories claim Ms Reeves could sort out the finances by cutting welfare spending - something ministers dramatically failed to do when their efforts at reform were scuttled by angry backbenchers. Read more:Govt 'gripping' prisons crisisDenmark migration model backedPrisons 'close to breaking point' Governments breach their manifesto commitments all the time. But if the chancellor goes ahead and puts up income tax, as expected (even if that's offset, for some, by a corresponding cut to national insurance), it will be a shock - and the first such increase in 50 years. The new deputy leader of the party, Lucy Powell, pointedly warned the government this week about the risks of breaching trust in politics by breaking manifesto promises. Lisa Nandy didn't shoot her comments down when Sir Trevor asked for her response, arguing instead that while \"we take our promises very, very seriously\", they [Labour] \"were also elected on a promise to change this country\", with a particular focus on fixing the NHS. The impossibility of doing both - protecting taxes while also increasing government spending in such a challenging economic climate - highlights the folly of making such restrictive promises. But voters are not in a forgiving mood."
    },
    {
        "title": "Reform's been pretty quiet since Labour started exploring Danish migration model - and this is why",
        "description": "Denmark is regularly ranked as one of the happiest countries in the world - with a cosy international reputation as the home of hygge and Lego, the idealistic fictional prime minister Birgitte Nyborg in Borgen and the woolly jumpers of TV detective Sarah Lund.&#160;",
        "url": "https://news.sky.com/story/denmark-has-a-cosy-international-reputation-but-warmth-doesnt-extend-to-asylum-seekers-13467065",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-copenhagen-denmark_6626629.jpg?20240715105230",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-11-09 00:30:00",
        "Headline": "Many on the left are deeply alarmed about the UK following a more draconian Danish path - with MPs like Nadia Whittome and Clive Lewis describing their ideas as \"hardcore\", \"dangerous\", \"far right\" and in some cases \"racist\".",
        "Content": "\n          Political correspondent\n              @amandaakass\n  Denmark is regularly ranked as one of the happiest countries in the world - with a cosy international reputation as the home of hygge and Lego, the idealistic fictional prime minister Birgitte Nyborg in Borgen and the woolly jumpers of TV detective Sarah Lund.  But that warmth does not extend to asylum seekers - and in recent years the country has developed some of the toughest illegal migration policies in Europe, despite being led for six years by a centre-left politician. PM Mette Frederiksen's \"zero refugees\" policy is not just popular - it has enabled her to face down her right-wing opponents. The number of successful asylum claims in Denmark has fallen to a 40-year low - and 95% of failed claimants are deported. Facing a rampant Reform UK and plummeting approval ratings amid explosive public anger over small boat crossings and asylum hotels, it's no wonder Sir Keir Starmer and his team are desperate to learn from their example. Sir Keir and Ms Frederiksen are closely aligned on issues of defence and security - standing side by side at meetings of the Coalition of the Willing and united in their staunch support for Ukraine. Now the UK - like many other European countries - is explicitly modelling itself on the Danish approach to migration too. I understand that, since she was appointed two months ago, new Home Secretary Shabana Mahmood has been looking at Denmark's policies across the board - but there's particular interest in their tight restrictions on family reunification, and the use of temporary visas for successful asylum seekers (which become invalid if their home countries are regarded as safe to return to). Home Office officials recently travelled to Copenhagen to learn from their Danish counterparts ahead of a major shake-up of the asylum system later this month. Denmark has adopted increasingly restrictive rules in order to deal with migration over the last few years. In Denmark, most asylum or refugee statuses are temporary. Residency can be revoked once a country is deemed safe. In order to achieve settlement, asylum seekers are required to be in full-time employment, and the length of time it takes to acquire those rights has been extended. Denmark also has tougher rules on family reunification - both the sponsor and their partner are required to be at least 24 years old, which the Danish government says is designed to prevent forced marriages.\n The sponsor must also not have claimed welfare for three years and must provide a financial guarantee for their partner. Both must also pass a Danish language test. In 2018, Denmark introduced what it called a ghetto package, a controversial plan to radically alter some residential areas, including by demolishing social housing. Areas with over 1,000 residents were defined as ghettos if more than 50% were \"immigrants and their descendants from non-Western countries\". In 2021, the left of centre government passed a law that allowed refugees arriving on Danish soil to be moved to asylum centres in a partner country - and subsequently agreed with Rwanda to explore setting up a program, although that has been put on hold. The Sunday Times reports this could see successful asylum seekers forced to repay the costs of their accommodation and benefits - and they will only be accepted if they speak a high standard of English and have no criminal record. This focus on the Danish model has been enthusiastically welcomed by Red Wall MPs like Jo White from Bassetlaw. \"We came into government in 2024 saying that we're going to be tackling this issue head on and that's what I promised my constituents,\" she told me. \"We have seen the growth of Reform who are solely focused on this. And if we are going to fill the space where we can actually deliver on our priorities, we have to tackle the small boats and the asylum system head on,\" Ms White added. \"Denmark is seen as one of the toughest countries in Europe for dealing with asylum claims. And what's even more interesting is that it's a democratic socialist leadership. They had to tackle this issue when they came into power because the fight was with the far right who were leading on this issue, and they recognised that they had to manage the process in order to be able to focus on delivering their policies.\" It's an issue which increasingly splits the party. Many on the left are deeply alarmed about the UK following a more draconian Danish path - with MPs like Nadia Whittome and Clive Lewis describing their ideas as \"hardcore\", \"dangerous\", \"far right\" and in some cases \"racist\". Some of the most controversial policies include confiscating valuable jewellery from migrants crossing the border and demolishing apartment blocks where more than 50% of residents are of what they define as \"non-Western\" backgrounds. It seems vanishingly unlikely those more extreme ideas will be on the agenda for Ms Mahmood and her team. But she's a tough operator. What's striking about the week's revelations about Denmark is how little comment there's been from either Reform UK or the Conservatives. Read more politics news:How Elon Musk is boosting the British rightCulture secretary defended in 'cronyism' row Yes, it's recess. But there's also an uncomfortable feeling that the right-wing parties thoroughly agree with the home secretary's robust approach. If she's successful in bringing down the numbers (and that's a huge if), Reform's key attacks on the government would be largely neutralised. Some experts and asylum charities argue the Danish approach would fail to translate to the UK - with desperate refugees drawn to Britain because they speak English and have existing networks of family and friends here. Steve Smith of Care for Calais said: \"The deterrence isn't going to work, because you're dealing with people who are fleeing something far worse. \"These are desperate people and trying to put in desperate measures isn't going to work, because those desperate measures can never be as desperate.\" But Ms Mahmood has promised to do \"whatever it takes\" to get a grip on the issue, and it seems she's prepared to look at increasingly radical solutions to do so."
    },
    {
        "title": "Tories demand investigation into Lisa Nandy over failure to disclose donations from head of new football regulator",
        "description": "The Conservatives have demanded a further investigation into the culture secretary Lisa Nandy over a failure to disclose donations from the new head of the football watchdog.",
        "url": "https://news.sky.com/story/tories-demand-investigation-into-lisa-nandy-over-failure-to-disclose-donations-from-head-of-new-football-regulator-13467261",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-downing-street-lisa-nandy_6970517.jpg?20250722093722",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-09 14:23:00",
        "Headline": "Lisa Nandy was found to have breached the public appointments code after David Kogan was made chair of the Independent Football Regulator.",
        "Content": "The Conservatives have demanded a further investigation into the culture secretary Lisa Nandy over a failure to disclose donations from the new head of the football watchdog. Ms Nandy apologised after Sir William Shawcross, commissioner for public appointments, ruled on Thursday that the government's appointment in October of David Kogan as chair of the new Independent Football Regulator breached the code on public appointments three times. He said Mr Kogan had donated to the leadership campaigns of both Sir Keir Starmer and Ms Nandy, but this had not been disclosed. As well as Ms Nandy's failure to disclose his £2,900 donation to her 2020 leadership campaign previously, the potential conflict of interest arising from that was not discussed with Mr Kogan at the interview, and his links to the Labour Party were not revealed, the report said. Former broadcasting executive Mr Kogan was not on the original shortlist, was a director of LabourList - the independent pro-Labour news site - and has written two books about the party. Following its conclusion, Sir Keir Starmer reprimanded Ms Nandy by saying \"the process followed was not entirely up to the standard expected\" but said she had \"acted in good faith\". The Conservatives have now written to Daniel Greenberg, the parliamentary commissioner for standards, to formally complain about Ms Nandy's failure to declare donations and to call for a further inquiry.  Conservative Party chair Kevin Hollinrake said in the letter that there were two £1,450 donations in 2020 to Ms Nandy's campaign, which he said were \"clearly from the same source\", with one from Mr Kogan personally and another from David Kogan Ltd, which he controls. Each fell just below the £1,500 declaration threshold, which Conservative Party chairman Kevin Hollinrake said \"appears deliberately designed to conceal the total from the public\". He queried whether Sir Keir also received similar donations and said this \"raises serious questions about Keir Starmer's judgement\". Sir William's report said the Department for Culture, Media and Sport (DCMS) should have publicly disclosed Mr Kogan's political activity. He particularly highlighted the £33,410 donated by him and his company to the Labour Party and Labour candidates in the five years prior. Read more:Govt 'gripping' prisons crisis, minister says as mistaken releases riseUK looking at Denmark model to cut illegal migration Ms Nandy said on Sunday that her department disclosed the information \"on a number of occasions\", including during his interview. \"It just wasn't discussed that he donated specifically to me because I didn't know about that,\" she told the BBC's Sunday with Laura Kuenssberg show, as she explained she was doing leadership hustings and donations were not handled by her. She said Mr Kogan had not recalled having donated to her either, but as soon as it was discovered, she \"put that information into the public domain and recused myself from the process\". Ms Nandy said there was a failure to \"add a line to a particular press release about David Kogan having donated previously to the Labour Party\". The minister denied that the incident made a farce of Labour's manifesto pledge to clean up public life. She insisted she took \"full responsibility\" for the process and said Mr Kogan was approached by the previous Conservative government, \"who began this process\" for the role. The Conservatives have already written to Sir Laurie Magnus, the prime minister's ethics watchdog, calling for Sir Keir to face further scrutiny over Mr Kogan's donations to the PM during the 2020 leadership race, and a £2,500 donation to the PM's constituency Labour Party in the run-up to last year's election. Mr Burghart has asked whether the PM had \"exactly the same conflict of interest, if not a greater one [than his culture secretary], given the 2024 general election donation\". He suggested Sir Keir's \"extensive hospitality from the football industry\" meant he should have recused himself from the entire process of appointing Mr Kogan. Mr Kogan, in response to the findings, said he had never been \"aware of any deviation from best practice\" in the appointment process and could \"now draw a line under the process\"."
    },
    {
        "title": "Govt 'gripping' prisons crisis as 'unacceptable' mistaken releases have risen, minister says",
        "description": "The government is \"gripping\" the prisons crisis, minister Lisa Nandy told Sky News, as she said it is \"unacceptable\" the number of prisoners being wrongly released has risen.",
        "url": "https://news.sky.com/story/govt-gripping-prisons-crisis-as-unacceptable-mistaken-releases-have-risen-minister-says-13467119",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lisa-nandy-prisons_7076632.jpg?20251109091436",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-09 08:56:00",
        "Headline": "Lisa Nandy said the government will first look at reforming the \"antiquated\" paper-based system in prisons.",
        "Content": " The government is \"gripping\" the prisons crisis, minister Lisa Nandy told Sky News, as she said it is \"unacceptable\" the number of prisoners being wrongly released has risen. Ms Nandy, the culture secretary, told Sunday Morning With Trevor Phillips that Justice Secretary David Lammy has made a senior appointment \"to make sure we really grip this\" after it was revealed this week two prisoners had been mistakenly released. She said the number of wrongful releases had gone up under the current government, from 17 a month under the Conservatives, to 22, which she said was \"completely unacceptable\". Algerian sex offender Brahim Kaddour-Cherif was recaptured on Friday, with his arrest witnessed by Sky News, while Billy Smith handed himself in. Days before Kaddour-Cherif's release, Mr Lammy had promised to implement further checks on prisoner releases after migrant sex offender Hadush Kebatu was earlier released by mistake.  Regarding wrongful prisoner releases, Ms Nandy said: \"Even one is too many, and the justice secretary is gripping this by appointing Dame Lynne Owens, who is the former director of the National Crime Agency, to make sure that we really grip this.\" She said that will begin with looking at the \"antiquated\" paper-based system still being used, but also by building new prisons and more checks to prevent prisoners from being wrongly released. \n                  Downfall of BBC leaders greeted with undisguised glee by many on the right of British politics\n                 \n                  Politics latest: We're 'gripping' prisons crisis, minister says - and confirms wrong releases up under Labour\n                 \n                  Starmer avoided political heat at home during Brazil climate conference - but he returns to a prisons crisis\n                 The 17 wrongful releases a month under the Conservative government that Ms Nandy used were from January to June 2024, but in the 13 years before that, they had on average 61 wrongful releases - about five a month. Read more:How a cup of coffee led Sky News to a sex offender on the run Charlie Taylor, the chief inspector of prisons, said the growing number of mistaken early releases is \"as symptom of a system that is close to breaking point\". It is down to \"an overcomplicated sentencing framework\" and was \"embarrassing and potentially dangerous\", he wrote in The Daily Telegraph on Saturday. Ms Nandy defended Mr Lammy for failing to reveal he knew Kaddour-Cherif had been wrongly released when asked five times at Prime Minister's Questions by the Conservatives if any more asylum seekers had been mistakenly released after Kebatu. She said she did not accept the justice secretary was \"being evasive\" and said she could see him \"weighing up in his mind\" about what information to release. Ms Nandy added Kaddour-Cherif was not an asylum seeker, which is what the Tories had specifically asked about. She said: \"I really strongly feel that if you, when you speak about matters of public importance, you have to take great care in order to make sure that that information is completely accurate.\" Mr Lammy will make a statement to parliament about the mistaken release of Kaddour-Cherif in the coming week, Ms Nandy added.  Conservative shadow defence secretary James Cartlidge, who asked Mr Lammy the five questions at PMQs, called for an investigation into whether the justice secretary had broken the ministerial code by failing to be \"transparent\". He told Sunday Morning with Trevor Phillips the minister \"couldn't have misled the House because he didn't answer the question at all\". Misleading - or lying - to the House of Commons is a sackable offence."
    },
    {
        "title": "Tim Davie resigns as BBC's director-general - with CEO of BBC News also stepping down",
        "description": "Tim Davie has resigned as the BBC's director-general after five years in the role - with chief executive of BBC News Deborah Turness also resigning.",
        "url": "https://news.sky.com/story/tim-davie-resigns-as-bbcs-director-general-13467527",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tim-davie-deborah-turness_7077340.jpg?20251109182934",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-09 17:45:00",
        "Headline": "The resignations come as the BBC is expected to apologise on Monday following concerns about impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama.",
        "Content": " Tim Davie has resigned as the BBC's director-general after five years in the role - with chief executive of BBC News Deborah Turness also resigning. It comes as the corporation is expected to apologise on Monday following concerns about impartiality, including how a speech by US President Donald Trump was edited in an episode of Panorama. The concerns regard clips spliced together from sections of the US president's speech on 6 January 2021 to make it appear he told supporters he was going to walk to the US Capitol with them to \"fight like hell\" in the documentary Trump: A Second Chance?, which was broadcast by the BBC the week before last year's US election.  Mr Trump responded to the pair's resignation on Sunday night, describing Mr Davie and Ms Turness as \"very dishonest people who tried to step on the scales of a presidential election\" in a post on his Truth Social platform. White House and others react to resignations - latest 'Ongoing controversy' Mr Davie sent a message to staff on Sunday afternoon, saying it was \"entirely\" his decision to quit. \n                  Downfall of BBC leaders greeted with undisguised glee by many on the right of British politics\n                 \n                  Tim Davie and Deborah Turness's resignation letters in full – and the BBC response\n                 \n                  'Teflon Tim' rode out several BBC controversies – but now he's come unstuck\n                 Admitting the BBC \"is not perfect\", he said: \"We must always be open, transparent and accountable.\" \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision. \"Overall, the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.\"  Ms Turness told staff the \"ongoing controversy\" around the edition of Panorama \"has reached a stage where it is causing damage to the BBC - an institution that I love. \"The buck stops with me - and I took the decision to offer my resignation to the director-general last night. \"In public life, leaders need to be fully accountable, and that is why I am stepping down. While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong.\" BBC Chair, Samir Shah called it \"a very difficult day\", thanking Ms Turness and crediting her with having \"transformed\" the corporation's news output. Mr Trump's press secretary, Karoline Leavitt, posted a triumphant two-word reaction on X, using the drinking term \"shot\" to describe reports that the US president was \"going to war with fake news\", referring to the BBC programme, and describing Mr Davie's resignation as a \"chaser\" - a drink taken after the shot to soften the taste of the alcohol. Ms Leavitt later said the BBC \"is dying because they are anti-Trump Fake News\". In an interview published on Friday, she had described the BBC as \"100% fake news\" and a \"propaganda machine\". Farage: 'BBC's last chance' In a message posted on social media, Culture Secretary Lisa Nandy thanked Mr Davie for leading the BBC through a period of \"significant change\". She called the organisation \"one of our most important national institutions\", adding that \"now, more than ever, the need for trusted news and high-quality programming is essential to our democratic and cultural life, and our place in the world\".  Conservative leader, Kemi Badenoch, said it was \"right that Tim Davie and Deborah Turness have finally taken responsibility and resigned from the BBC\". She said: \"The culture at the BBC has not yet changed. BBC Arabic must be brought under urgent control. The BBC's US and Middle East coverage needs a full overhaul.\" Ms Badenoch said it \"should not expect the public to keep funding it through a compulsory licence fee unless it can finally demonstrate true impartiality\". Liberal Democrat leader Sir Ed Davey said Sunday's resignations \"must be an opportunity for the BBC to turn a new leaf, rebuild trust and not give in to the likes of [Reform UK leader] Nigel Farage who want to destroy it\". Mr Farage said the pair's resignations must be \"the start of wholesale change\" at the BBC. He urged the ministers to appoint \"somebody with a record of coming in and turning companies and their cultures around\", preferably someone \"from the private sector who has run a forward-facing business and understands PR\". Mr Farage said: \"This is the BBC's last chance. If they don't get this right, there will be vast numbers of people refusing to pay the licence fee.\" As well as the Panorama show on Mr Trump, the BBC has also been accused of failing to maintain its neutrality in its coverage of the Israel-Hamas war and over trans issues. Read more on the BBC:Glastonbury complaints partly upheldGaza documentary 'breached Ofcom rules'Wallace responds to Masterchef sackingWho are BBC's highest earners? The Campaign Against Antisemitism (CAA) called for an independent inquiry into potential bias at the BBC, saying \"growing bias\" had been evident for \"many years across a wide array of issues\". The group claimed that, under Mr Davie and Ms Turness, the BBC had \"often served as a mouthpiece for Hamas\" and \"gaslit\" its audience \"by claiming to be a bastion of ethics and truthful journalism\".  Marcus Ryder, a former executive producer of current affairs at the BBC, called the resignations \"really sad\", adding that \"it shows the pressure and ethical climate that the BBC is operating in, that this edit can actually bring down the director- general\". Dame Melanie Dawes, chief executive of Ofcom, thanked Mr Davie, saying he had led the organisation \"at a time of great change and challenge\". The Daily Telegraph reported on Tuesday that a memo by a former external adviser to the BBC's editorial standards committee raised the issue, as well as other concerns about impartiality, in the summer. Dealing with controversies Mr Davie took the role in 2020, replacing Tony Hall. During his time in charge of the broadcaster, he has dealt with a number of high-profile controversies within the corporation. They include a row over former Match of the Day host Gary Lineker's sharing of his political views, top presenter Huw Edwards being convicted of making indecent images of children, and the BBC's broadcasting of Bob Vylan's controversial Glastonbury performance. Read: The BBC controversies faced by Tim Davie during his time in charge There were also controversies surrounding some of its top shows, such as MasterChef and its former presenter, Gregg Wallace, as well as Strictly Come Dancing. Mr Davie, who had a career in marketing and finance before joining the BBC's marketing team in 2005, was previously acting director-general from November 2012 until April 2013. He said his departure will not be immediate and that he is \"working through\" timings to ensure an \"orderly transition\" over the coming months. A person familiar with the situation said Davie's decision had left the BBC board stunned by the move."
    },
    {
        "title": "'Teflon Tim' rode out several BBC controversies – but now he's come unstuck",
        "description": "Under his tenure, Tim Davie has had to deal with a lot.",
        "url": "https://news.sky.com/story/teflon-tim-rode-out-several-bbc-controversies-8211-but-now-hes-come-unstuck-13467750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tim-davie-bbc_7077668.jpg?20251109215702",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-09 21:01:00",
        "Headline": "The corporation's director-general Tim Davie and Deborah Turness, the CEO of BBC News have resigned over recent events. But Davie especially has been dealing with controversies for years. ",
        "Content": "\n          Arts and entertainment correspondent\n        Under his tenure, Tim Davie has had to deal with a lot. While both he and his head of news Deborah Turness have resigned over events of the last week, it's important to also take into account just how shaky the last couple of years have been for Davie - earning him the nickname 'Teflon Tim'. While his missteps on Strictly and firings on MasterChef have made tabloid headlines, it's the errors when it comes to news coverage that are arguably most inexcusable at an organisation that prides itself on putting trust and accountability at its heart. Follow latest: Trump responds to Davie resignation  You might remember Davie dodged calls for his resignation earlier this year when it emerged a child narrator on one of its documentaries was the son of a Hamas official. They investigated, apologised and tried to move on, but just over a week ago, Davie found himself going from the frying pan into the fire. That's when a leaked memo by a former adviser to the corporation was published - accusing the corporation of \"serious and systemic\" bias in its coverage of issues including Gaza, trans rights and Donald Trump. For an organisation that talks the talk on trust and accountability being such an important part of what it stands for, time and time again under Davie's tenure, it has felt almost as if - rather than coming out and facing the press - he's perfected the art of strategic invisibility. Read more:Tributes paid to ex-Top Gear hostDavina McCall shares cancer diagnosis While some may see him as a victim of culture wars in the time of Trump, the director-general spent the week ignoring the fire alarms going off inside the BBC. The truth is, he'd left it far too late. The heat was far too hot for him to do anything else but resign."
    },
    {
        "title": "The BBC controversies faced by Tim Davie during his time in charge",
        "description": "Tim Davie stepping down as director-general of the&#160;BBC comes after several controversies faced by the broadcaster in recent years.",
        "url": "https://news.sky.com/story/the-bbc-controversies-faced-by-tim-davie-during-his-time-in-charge-13467725",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-donald-trump-capitol_5230334.jpg?20221216224518",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-09 20:38:00",
        "Headline": "After 20 years at the BBC, and in charge for the last five, Tim Davie has announced his resignation. Here are some of the controversies he has faced during his time as director-general.",
        "Content": " Tim Davie stepping down as director-general of the BBC comes after several controversies faced by the broadcaster in recent years. His resignation came at the same time as that of BBC News chief executive Deborah Turness, at the end of a week in which concerns about impartiality were raised over how a speech by US President Donald Trump was edited in an episode of Panorama. \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision,\" Mr Davie wrote in a note sent to staff. \"Overall, the BBC is delivering well, but there have been some mistakes made and as director-general I have to take ultimate responsibility.\" Mr Davie has been in the role for five years and at the BBC for 20 in total, having previously worked as director of marketing, director of audio and music, and chief executive of BBC Studios. Here are the controversies the broadcaster has faced in recent years. The Trump documentary edit A memo sent in the summer by a former external adviser to the BBC's editorial standards committee, highlighting the edit of a Donald Trump speech as well as other concerns about impartiality, was first reported by The Daily Telegraph on Tuesday.  The concerns regard clips spliced together from sections of a speech made by the US president on 6 January 2021, featured in the Panorama programme Trump: A Second Chance? It made it appear that Mr Trump told supporters he was going to walk to the US Capitol with them to \"fight like hell\", although the quotes were made during separate parts of the speech. The episode was broadcast by the BBC the week before last year's US election. Bob Vylan at Glastonbury In July, punk-rap duo Bob Vylan led chants of \"death to the IDF\" while on stage at Glastonbury, a performance which was live-streamed as part of the BBC's coverage of the festival. Afterwards, the broadcaster said it would no longer live broadcast \"high risk\" performances, and suggested disciplinary action could be taken against staff who failed to halt the stream. The BBC's Executive Complaints Unit received four complaints about the performance relating to incitement to violence, terrorism or ethnic cleansing, hate speech and expressions of antisemitism.  In a ruling given in September, it found the stream of the performance had breached its editorial standards. Following the backlash over the Glastonbury gig, Bob Vylan said in a post on Instagram that \"we are not for the death of Jews, Arabs or any other race or group of people\". MasterChef In the same month, presenter Gregg Wallace was sacked from cooking show MasterChef after an investigation into historical allegations of misconduct upheld multiple accusations against him. These first emerged towards the end of 2024. Wallace, who co-presented the show for almost 20 years, said he was \"deeply sorry for any distress caused\" and that he \"never set out to harm or humiliate\", but also said in a statement released ahead of the publication of a summary of the report that he had been \"cleared of the most serious and sensational accusations\" made against him.  His co-presenter John Torode left the show the following week after an allegation he used an \"extremely offensive racist term\" was upheld, the BBC said. In October, Wallace announced he was suing the broadcaster for \"distress and harassment\". Gary Lineker No stranger to controversy during his last few years at the BBC, Gary Lineker stepped down from hosting Match Of The Day and World Cup coverage in May. It came after he apologised unreservedly for sharing a social media post from the Palestine Lobby group that had been illustrated with a rat - which has been used to represent Jewish people in antisemitic propaganda, including Nazi Germany. He said he had not known about the rat's symbolism. \"I would never consciously repost anything antisemitic - it goes against everything I stand for,\" Lineker said in a statement as he confirmed his resignation. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" The former England star had previously been temporarily suspended from the BBC in March 2023, after an impartiality row over comments he made criticising the then Conservative government's asylum policy. His temporary suspension led pundits Ian Wright and Alan Shearer to both announce they would not appear on Match of the Day, and a shortened show went ahead without commentary, pundit analysis, or post-match interviews. The incident sparked a report, which decided that high-profile BBC presenters outside of its news coverage should be able to express their views on political issues as long as they stop short of campaigning. Gaza documentary Gaza: How To Survive A Warzone was pulled from BBC iPlayer in February after it emerged that the 13-year-old boy narrating the programme was the son of a deputy minister in the Hamas-run government. The documentary was made by independent production company Hoyo Films. A BBC review into the controversial programme said three members of the independent production company knew about the role of the boy's father - but no one within the corporation was aware. In July, the BBC said it had breached its own editorial guidelines by failing to disclose the full identity of the child narrator's father - Ayman Alyazouri, who has worked as Hamas's deputy minister of agriculture. In October, an Ofcom investigation found the documentary had breached the broadcasting code. Huw Edwards In April 2024, veteran news presenter Huw Edwards resigned from the BBC, nine months after coming off air following accusations of paying a teenager thousands of pounds for sexually explicit pictures. Just a few months later, it emerged he had remained one of the broadcaster's highest-paid stars of the year, despite his suspension. Days later, new allegations emerged - and he was charged and pleaded guilty in court to three counts of \"making\" indecent images of children, after receiving the illegal images as part of a WhatsApp conversation. The court heard how he paid up to £1,500 to a paedophile who sent him 41 illegal images between December 2020 and August 2021, seven of which were of the most serious type. The disgraced broadcaster avoided jail, but was given a six-month suspended sentence. Strictly Come Dancing Ahead of the 2024 series of BBC favourite Strictly Come Dancing, producers said they would introduce staff chaperones into all future rehearsals. It followed the departure of two professional dancers following complaints about their behaviour. Following an investigation, the BBC upheld \"some, but not all\" of the allegations made against Giovanni Pernice by his 2023 dance partner Amanda Abbington. Abbington described an apology from the corporation as vindication, while Pernice denied displaying \"abusive or threatening behaviour\" and said the majority of the complaints had not been upheld. Another professional dancer, Graziano Di Prima, also left the show amid reports of alleged misconduct. Apology over Diana interview In 2021, a report into Martin Bashir's bombshell 1995 programme with Princess Diana found the journalist had \"deceived and induced\" her brother to secure the interview. By using fake bank statements, Mr Bashir made a \"serious breach\" of BBC guidelines on straight-dealing, the Lord Dyson report concluded. Mr Davie, who was not at the BBC at the time the programme was made, issued a \"full and unconditional\" apology after the findings were released, and the corporation sent written apologies to Prince William and Prince Harry, as well as to Prince Charles and Earl Spencer. Mr Bashir also apologised and said the faking of bank statements was a \"stupid thing to do\" and \"an action I deeply regret\", but added he felt it had \"no bearing whatsoever on the personal choice by Princess Diana to take part in the interview\". Former director-general Lord Hall, who was the BBC's director of news and current affairs when the Diana interview was screened, said he accepted the corporation's 1996 inquiry into how the sit-down was secured \"fell well short of what was required\"."
    },
    {
        "title": "Tim Davie and Deborah Turness's resignation letters in full – and the BBC response",
        "description": "The BBC's director-general Tim Davie and Deborah Turness, the CEO of BBC News, have resigned from their positions.",
        "url": "https://news.sky.com/story/tim-davie-and-deborah-turnesss-resignation-letters-in-full-8211-and-the-bbc-response-13467776",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bbc-broadcasting-house_6965315.jpg?20250715115906",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-09 21:53:00",
        "Headline": "BBC chair Samir Shah responded to Tim Davie and Deborah Turness's statements as the pair's exits were announced on Sunday evening. ",
        "Content": "The BBC's director-general Tim Davie and Deborah Turness, the CEO of BBC News, have resigned from their positions. The bosses announced their departures on Sunday evening and the notes they sent to staff at the corporation have been published. Read them both in full below, along with the response from the BBC's chair, Samir Shah. Tim Davie's note: \"I wanted to let you know that I have decided to leave the BBC after 20 years. This is entirely my decision, and I remain very thankful to the chair and board for their unswerving and unanimous support throughout my entire tenure, including during recent days. \"I am working through exact timings with the board to allow for an orderly transition to a successor over the coming months. \"I have been reflecting on the very intense personal and professional demands of managing this role over many years in these febrile times, combined with the fact that I want to give a successor time to help shape the charter plans they will be delivering. Analysis: 'Teflon Tim' has come unstuck \"In these increasingly polarised times, the BBC is of unique value and speaks to the very best of us. It helps make the UK a special place; overwhelmingly kind, tolerant and curious. Like all public organisations, the BBC is not perfect, and we must always be open, transparent and accountable. \"While not being the only reason, the current debate around BBC News has understandably contributed to my decision. Overall the BBC is delivering well, but there have been some mistakes made and as Director-General I have to take ultimate responsibility. \"Our organisation is a critical ingredient of a healthy society, as well as a thriving creative sector. We should champion it, not weaponise it. \"Despite a hugely competitive market, I am proud that the BBC remains the most trusted news brand globally. We have continued to ensure that it is used by almost everyone in the UK as well as hundreds of millions of people globally. Despite the inevitable issues and challenges, our journalism and quality content continues to be admired as a gold standard. \"Our transition to a digital organisation has been deeply impressive, and our thriving commercial businesses are admired globally. Also, our work together on ensuring that we have the right culture has been important and motivating. I could not be more impressed by what you are achieving. Read more:The controversies Davie has facedBBC Gaza doc breached Ofcom code  \"You will ask why now, why this moment? \"I am BBC through and through, having spent the last 20 years of my life working for this organisation as director of marketing, communications and audiences, director of audio and music, acting director-general and chief executive of BBC Studios. \"I care deeply about it and want it to succeed. That is why I want to create the best conditions and space for a new DG to come in and positively shape the next royal charter. I hope that as we move forward, a sensible, calm and rational public conversation can take place about the next chapter of the BBC. \"This timing allows a new DG to help shape the next charter. I believe we are in a strong position to deliver growth. \"Thank you again, it has been a wonderful ride, which I have loved. I count myself very lucky to have served as DG no.17. I will have a proper chance to see many of you before I go, but I have been incredibly proud to lead the BBC as DG for over five years. \"It is a precious UK institution and you are a world-class team. Thank you all for the tireless support and friendship. \"I will always be a passionate cheerleader for civilised society, a strong BBC and a thriving UK. \"Best wishes, Tim.\" Deborah Turness sent the following to BBC staff: \"Dear all, \"I have never been more proud of the work that you do every day. You really are the best of the best. \"I have taken the difficult decision that it will no longer be my role to lead you in the collective vision that we all have: to pursue the truth with no agenda. \"The ongoing controversy around the Panorama on President Trump has reached a stage where it is causing damage to the BBC - an institution that I love. \"As the CEO of BBC News and Current Affairs, the buck stops with me - and I took the decision to offer my resignation to the director-general last night. \"In public life leaders need to be fully accountable, and that is why I am stepping down. While mistakes have been made, I want to be absolutely clear recent allegations that BBC News is institutionally biased are wrong. \"In a polarised world, BBC News journalism is more vital than ever, and I could not be prouder of the work that you do. Together we have bucked the global trend, to grow trust in BBC News, and I want to thank you, wherever you are in the world, for your courageous work to deliver that. \"My plea to you: please keep the courage to continue our mission. I'm only sorry that I won't be there to lead and champion your brilliant journalism. \"It has been a great privilege to work with you all. \"I will now work with Tim to plan an orderly handover to ensure that my decision to step away causes the least disruption possible to the important work that you do. \"With very best wishes, Deborah.\"  BBC chair Samir Shah shared separate statements on each exit. Here's his note on Mr Davie's resignation: \"This is a sad day for the BBC. Tim has been an outstanding director-general for the last five years. He has propelled the BBC forward with determination, single-mindedness and foresight. \"He has had the full support of me and the board throughout. However, I understand the continued pressure on him, personally and professionally, which has led him to take this decision today. The whole Board respects the decision and the reasons for it. \"Tim has given 20 years of his life to the BBC. He is a devoted and inspirational leader and an absolute believer in the BBC and public service broadcasting. He has achieved a great deal. Foremost, under his tenure, the transformation of the BBC to meet the challenges in a world of unprecedented change and competition is well underway.  \"Personally, I will miss his stamina, good humour and resilience and I will miss working with him. I wish him and his family the very best for the future. \"This is an important time for the corporation and the board and I will continue to work with Tim in the interim while we conduct the process to appoint his successor.\" And his response on Ms Turness's exit: \"I want to thank Deborah for her leadership of BBC News over the past three years. She has transformed the operation of News with real commitment and a clear vision of the future. \"She has acted with integrity in challenging circumstances and leaves a strong legacy from which to build for the many millions around the world who rely on and trust the voice of BBC News every day.\""
    }
]