[
    {
        "title": "Amputations, badly burned bomb victims and lack of medicine: British surgeons on life in Gaza",
        "description": "Doctors are a very special category of people. Doctors who opt to work in war zones are an entirely different level of special.",
        "url": "https://news.sky.com/story/amputations-badly-burned-bomb-victims-and-lack-of-medicine-british-surgeons-on-daily-life-in-gaza-13385804",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dr-tom-potokar-alex-crawford_6945922.jpg?20250619134021",
        "type": "Home",
        "Author": "Alex Crawford",
        "Date Published": "2025-06-19 16:00:00",
        "Headline": "Two British surgeons who have worked in Gaza during Israel's bombardment of the territory have filmed video blogs for Sky News. They don't see themselves as heroes or even remarkable - that, of course, is what makes them even more so.",
        "Content": "\n          Special correspondent\n              @AlexCrawfordSky\n  Doctors are a very special category of people. Doctors who opt to work in war zones are an entirely different level of special. They take their skills and medical experience into the most dangerous of environments, knowing they risk their own lives in their mission to save others. Yet they do this regardless. Warning: This article contains details and images that some readers may find distressing. The British doctors who we came to know and immensely respect at the centre of our report, Gaza: Doctors on the Frontline, don't see themselves as heroes or even remarkable for what they've done over the past few weeks in Gaza. That, of course, is what makes them even more remarkable. \"This shouldn't be about us,\" Dr Tom Potokar scolded us more than once. \"This should be about what's happening to the Palestinians and health workers inside Gaza.\" But like it or not, the daily video blogs the travelling doctors did about their experiences on the ground in Gaza resonated with viewers. They sent us searing accounts of their daily lives while in Gaza. They told us of having to stitch together mostly young broken bodies, torn apart by repeated Israeli bombs. They talked of having to perform amputations on the young, of trying to stem the pain and infections on badly burned bomb victims and of the lack of common medicines. They fumed at what they saw as political 'complicity' from the international community for not doing enough to end the war. They begged for aid to be allowed in. They spoke from the heart as humanitarians and doctors but also witnesses - and we saw them tired, frustrated, angry at times, maybe a little anxious, certainly emotional.  And yet, all the time they realised how they were just visitors in Gaza while their patients, their medical co-workers and their colleagues' families were all living this permanently, with no escape while just trying to survive. Many do not. \"What do you say to a seven-year-old who's lost both her legs,\" Dr Tom says in one heart-wrenching vlog. \"Most of my patients are children,\" Dr Victoria Rose tells us in another. We see her fall in love with a badly burned toddler, so swathed in bandages, only his face was uncovered. \"This is my favourite little guy,\" she says in her vlog about three-year-old Haitum, \"he has 35% burns\". \"That's a lot for a little guy,\" she goes on. And the tens of thousands who watched her updates on social media platforms fell in love with the little boy too. Viewers see how Haitum was far from an exceptional case too. \"My first three patients today were under 12,\" we learn from Dr Victoria in another post. Read more from Dr Victoria Rose: 'I felt I had to go back to help'  The two surgeons were in small teams sent into the battlefield courtesy of the IDEALS charity, which funded their trip. Their limited time in the Gaza Strip turned out to be of an intensity which both recognised as unmatched before by either of them. They witnessed alongside their patients and fellow medics, daily and nightly bombings; gunfire; dwindling medical supplies and saw the dire lack of food. They treated tiny skeletal bodies desperate for sustenance - and helped mass evacuations of badly wounded patients from the fast-disappearing health facilities. 'No one is safe' \"There just seems to be indiscriminate bombing,\" Dr Victoria says of the Israeli bombardment. \"No one is safe - whether you're a woman, man, child or health worker. \"But there seems to be a systematic pattern of attacking infrastructure, particularly around health provision.\" She goes on to cite how she's observed the Israeli attacks focus on taking out the hospital water supplies, then the power source, as well as declaring red zones or implementing evacuation orders around health facilities to make it difficult for patients to access the hospital and for staff to travel into work. The Israeli authorities have an alternative narrative - the Israeli Defence Forces claim they are carrying out \"precision strikes\", insist Hamas is using patients as human shields and say they've uncovered vast military command centres beneath hospitals - including the European Gaza. Conflicting accounts The doctors - equally insistently - say they've seen no arms in the hospitals and have seen no evidence of Hamas command centres or tunnels beneath. Dr Tom rang me while our team was on assignment in Somalia. \"You won't have heard but the European Gaza Hospital has been bombed,\" he said, \"I'll send you the videos\". He shuns social media and has no accounts, but he's a veteran who's been travelling to Gaza for the past seven years, and he knew very well the importance of what he was witnessing on the ground and living through. He's extremely experienced and has travelled across the globe working in war zones like Cambodia and Lebanon, and is a former chief surgeon for the International Red Cross. He's also a burns specialist with his own international charity called Interburns. \"If Cambodia was the killing fields, Gaza is the slaughterhouse,\" he says about his most recent time inside Gaza. Dr Victoria Rose is an NHS plastic surgeon based in London and was on her third trip to Gaza. She talks frankly of being motivated to go after helping to mentor Gaza surgeons who'd travelled to Britain to learn extra skills some years ago. \"We saw them struggling in Gaza and I felt I just had to help,\" she explains. She videoed everything - unstintingly - and has her own Instagram handle @rosieplasticsurgeon. She teases Dr Tom - on camera of course - about his lack of digital awareness. \"This is the man who calls it Facetube, aren't you Tom?\" The two have very different approaches but mutual respect. And both realised their job in Gaza was twofold. They had to bear witness. They had to report. Running past huge craters They had to provide insight into what fellow Palestinian medics are up against in Gaza; how hospitals - protected under international law - are being affected, and how ordinary Gazan civilians are suffering. So, Dr Tom took us into the heart of the European Gaza Hospital minutes after Israeli forces dropped multiple bombs around the complex. We saw him racing through the car park outside the Emergency Department and past huge craters and rubble. He delivered commentary as he ran through the smoke-filled corridors to try to find his anaesthetist. He showed us the repeated bombings a day later - and the scramble to get injured patients out to safety. The two surgeons may be very different people. But both are highly regarded in their fields and have been brought together by a burning desire to help the wounded and injured in Gaza as well as their fellow medics on the frontline. They also both entered Gaza with the knowledge that foreign journalists are barred from the territory - and many of those inside have been killed or maimed - so it fell to them, the doctors, to be the witnesses during their stay in Gaza and beyond. \"It's really not something I'm comfortable with,\" Dr Tom said. \"For a start, it takes up a lot of time! But it's important people see what's going on here. \"The question people should be asking is, why are foreign journalists being barred? What is it the Israelis do not want people to see?\" Analysis: Jonathan Levy - Israel's block on international journalists in Gaza should not be allowed to stand Dr Victoria texted a lot about her fears that Nasser Hospital, where the two travelling teams finally end up, may face the same fate as the European Gaza - evacuated and now out of action. \"We've got to keep on reminding people what's going on here because Nasser is the last functioning hospital in the south, and if it has to be evacuated, it will have tragic consequences for the civilians here. Hundreds will die,\" she says. The film is a graphic, often painful watch of human endurance, tragedy, pain and survival - told through the eyes of two exceptional and inspiring surgeons who felt their duty as doctors also meant they should lay bare what's happening inside the Gaza Strip - and what is still happening - while the world's focus has shifted elsewhere."
    },
    {
        "title": "Russia would react 'negatively' if Iran's leader is killed, says the Kremlin",
        "description": "Regime change in Iran is \"unacceptable\" and the assassination of the country's Supreme Leader would \"open the Pandora's box\", the Kremlin has said.",
        "url": "https://news.sky.com/story/russia-would-react-negatively-if-irans-leader-is-killed-says-the-kremlin-13385983",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-peskov-russia_6946318.jpg?20250619224737",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Russia has deepened its ties with Iran since invading Ukraine, and the two countries signed a strategic partnership in January.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Regime change in Iran is \"unacceptable\" and the assassination of the country's Supreme Leader would \"open the Pandora's box\", the Kremlin has said. In a rare interview with a foreign media organisation, Kremlin spokesman Dmitry Peskov told Sky News that Russia would react \"very negatively\" if Ayatollah Ali Khamenei was killed. The comments came as US President Donald Trump said he will decide within two weeks whether America will join Israel's military campaign against Tehran, after earlier speculating on social media about killing the Iranian leader. \"The situation is extremely tense and is dangerous not only for the region but globally,\" Mr Peskov said in an interview at the Constantine Palace in Saint Petersburg. \"An enlargement of the composition of the participants of the conflict is potentially even more dangerous. \"It will lead only to another circle of confrontation and escalation of tension in the region.\" They are the Kremlin's strongest comments yet regarding the Israel-Iran conflict, which has stoked fears in Moscow that it could be on the verge of losing its closest ally in the Middle East. \n                  Kellogg's, Coca-Cola and Brewdog beer on Russian shelves despite sanctions\n                 \n                  Ukraine war: 14 killed as Russian missile and drone attacks strike Kyiv - including American citizen\n                 \n                  G7 to discuss further sanctions if Russia fails to come to negotiating table, PM says\n                 Russia has deepened its ties with Iran since invading Ukraine, and the two countries signed a strategic partnership in January. \"[Regime change in Iran] is unimaginable. It should be unacceptable, even talking about that should be unacceptable for everyone,\" Mr Peskov said, in a thinly veiled reference to Washington.  But Mr Peskov refused to be drawn on what action Russia would take if Khamenei was killed, saying instead it would trigger action \"from inside Iran\". \"It would lead to the birth of extremist moods inside Iran and those who are speaking about [killing Khamenei], they should keep it in mind. They will open the Pandora's box.\" Vladimir Putin's offers to mediate an end to the conflict have so far been rejected by Mr Trump, who said on Wednesday that he told the Russian president to \"mediate your own [conflict]\", in reference to Russia's war against Ukraine. Mr Peskov denied the American president's words were insulting, adding: \"Everyone has a different language. \"President Trump has his own unique way of speaking and his unique language. We are quite tolerant and expect everyone to be tolerant of us.\" The Trump administration's own mediation efforts to end the war in Ukraine have failed to yield any major breakthroughs, despite two rounds of direct talks between Moscow and Kyiv. Moscow has stepped up its aerial bombardment of Ukraine in recent weeks and continues to reject Volodymyr Zelenskyy's calls for a 30-day ceasefire. \"Now we have a strategic advantage. Why should we lose it? We are not going to lose it. We are going further. We're advancing and we'll continue to advance,\" Mr Peskov said. Russia has previously said it would only commit to a ceasefire if Kyiv stops receiving foreign military support, fearing that a pause in the fighting would offer Ukraine a chance to rearm and regroup its forces. Read more:Western brands on Russian shelves despite sanctionsBodies of Ukrainian soldiers returned to Kyiv  Asked if Moscow could commit to not using a ceasefire in the same way, Mr Peskov said: \"A ceasefire is a ceasefire, and you stop. \"But America is not saying that 'we'll quit any supplies'. Britain is not saying that as well. France is not saying that as well. This is the problem.\""
    },
    {
        "title": "Donald Trump weighing up many risks before possible US strike on Iran",
        "description": "This is the most significant statement from the US president in days, though it still keeps everyone guessing.",
        "url": "https://news.sky.com/story/donald-trump-weighing-up-many-risks-before-possible-us-strike-on-iran-13385951",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6946264.jpg?20250619204746",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-06-19 19:05:00",
        "Headline": "The Israelis are pressuring Donald Trump to use American B2 bombers with their bunker-busting bombs to destroy Iran's nuclear facility at Fodow. But the president is under significant pressure domestically not to get involved in Iran.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  This is the most significant statement from the US president in days, though it still keeps everyone guessing. In a message conveyed through his press secretary, he is giving diplomacy up to two weeks to work. \"Based on the fact that there's a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks,\" Karoline Leavitt quoted him as saying. It is not clear what \"whether or not to go\" entails. Israel-Iran conflict: Latest updates  We know that he has been given a spectrum of different military options by his generals and we know that the Israelis are pressuring him to use American B2 bombers with their bunker-busting bombs to destroy Iran's nuclear facility at Fodow. The Israelis are encouraging no delay. But against that, he is weighing up many risks, both military and political. \n                  Is Trump losing his MAGA loyalist support over Iran?  \n                 \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                 Militarily, it is not clear how successful a bunker-busting strike on Fordow would be. Experts have suggested it would require several of the massive bombs, which have never been used in combat before, to be dropped on the site. It is not as simple as one clean strike and job done. Politically, the president is under significant pressure domestically not to get involved in Iran.  Within his own MAGA coalition - influencers, politicians and media personalities are lining up in criticism of involvement in the conflict. One of those leading the criticism, his former chief strategist Steve Bannon, who maintains huge influence, was seen entering the White House on Thursday. His press secretary reiterated to us that the president always wants to give diplomacy a chance and she confirmed that his Middle East envoy Steve Witkoff has spoken to the Iranian foreign minister Abbas Araghchi. European leaders, including the UK foreign secretary David Lammy, who is in Washington, are meeting Mr Araghchi in Geneva on Friday. The two-week window - assuming it lasts that long - also gives space to better prepare for any strike and mitigate against some of the other risks of US involvement. Read more from Sky News:Is Trump losing his MAGA support?Gantz defends conflict with Iran'Love Trump' says Israeli minister There are 40,000 troops in bases across the Middle East. It takes time to increase security at these bases or to move non-essential personnel out. It also takes time to move strategic military assets into the region. The USS Nimitz aircraft carrier and its support vessels were redeployed from the Indo-Pacific on Monday. Their last known position was the Strait of Malacca two days ago. The Nimitz Carrier Group will overlap with the USS Carl Vinson group which was deployed to the Middle East in March. The potential two-week window also allows for more time for a 'day after' plan, given that the Israeli strategy appears to be regime change from within. Since the Israeli action in Iran began last week, the worst-case scenario of mass casualties in Israel from Iranian attacks has not materialised. The president is said to be surprised and encouraged by this. \"Israel has exceeded a lot of people's expectations in their abilities,\" press secretary Karoline Leavitt said. The Israeli success, the absence of a mass casualty event in Israel, and the lack of any sustained counterattack by Iranian proxies in the region remove reservations that previous presidents have had about taking on Iran. That said, sources have told Sky News that the president is determined that the diplomatic solution should be given a chance despite current pessimism over the chances of success. A critical two weeks ahead."
    },
    {
        "title": "'Loving father' shot dead in suspected case of mistaken identity prompts appeal for information",
        "description": "The family of a father shot dead in a suspected case of mistaken identity in north London have said he \"deserves justice\" as they appealed for information.",
        "url": "https://news.sky.com/story/loving-father-shot-dead-in-suspected-case-of-mistaken-identity-prompts-appeal-for-information-13385799",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tottenham-murder-mahad-abdi-mohamed_6945883.jpg?20250619131623",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Mahad Abdi Mohamed died from a gunshot wound to the head after attackers opened fire from a stolen car.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The family of a father shot dead in a suspected case of mistaken identity in north London have said he \"deserves justice\" as they appealed for information. Mahad Abdi Mohamed, 27, died from a gunshot wound to the head in hospital after he was hit with bullets fired from a stolen Mitsubishi Outlander, which was later found burnt out. Detectives believe those responsible for his murder had set out to hurt someone else in a \"pre-meditated and targeted attack\" in Waverley Road, Tottenham, at 8.45pm on Thursday 20 March. Mr Abdi Mohamed's younger sister, Amal Abdi Mohamed, 23, said he was a \"loving father\" to his five-year-old son, who \"looked up to him like a superhero\", and was planning to get married in the summer. \"He was taken away from us through gun violence,\" she said. \"A bullet didn't just take his life, it tore through our family, through our heart, and it's truly shocking, it's devastating, and it's so senseless, because this type of violence should never be normal. \"It should never be something a family ever has to expect, prepare for, or live with.\" \n                  Jennifer Abbott: Woman's 'murder' could be linked to diamond-encrusted Rolex, say police\n                 \n                  Sadeq Nikzad: Man jailed for raping 15-year-old after following her in Falkirk town centre\n                 \n                  Disgraced singer Gary Glitter to stay in jail as parole bid refused\n                 Mr Abdi's 26-year-old friend, with whom he had been breaking his Ramadan fast, was also shot in the leg and was treated in hospital for a wound police said was not life-changing. The Metropolitan Police arrested four men on suspicion of murder, who have been released on bail pending further investigations. Detectives are appealing for witnesses who saw a silver Mitsubishi Outlander in the area, which was found burnt out in Runcorn Close, the following morning. \"This tragic event and Mahad's death, has had a profound impact on the community and all those who loved him. Someone out there knows what happened. And that person, or people, must come forward,\" said Detective Chief Inspector Rebecca Woodsford. \"Regardless of how small you think your information is, please share it with us. It could be the missing link we need to secure justice for Mahad and his family.\" Read more from Sky News:Government whip quits over Starmer's welfare cutsPatrols to protect women and girls from violence at concertsCompensation scheme for Capture victims announced 'To stay silent is to be complicit'  Many of Mr Abdi Mohamed's family members were in tears as they visited the scene of his murder as part of the appeal for information. \"My sweet Mahad was the kind of person who could light up a room without even trying,\" said his sister. \"His laugh was so loud, and it still echoes in our memories.\" Ms Abdi Mohamed said her brother \"was funny, he was honest, and overall he was just a good man\" but \"wasn't perfect\". She said he had \"made mistakes but turned his life around\" working at Waterloo Station, and part-time at the Tottenham Hotspur Stadium and Royal Ascot as a security guard. \"How do you look at a child who adored him day and night, and tell them that he's gone and you don't have the answers why? That boy will have to grow up with no dad,\" she said. \"If you think you may know anything or have seen anything - you may think it doesn't matter, but it might be the key to giving us an answer, and it might be the thing that finally lets our family take a breath. \"To stay silent is to be complicit. \"To stay silent is to let a grieving mother suffer in confusion. To stay silent is to let a little boy grow up not knowing what happened to his father. \"If you know something and you haven't come forward, please think about that. Think about a family that cannot begin to heal because the truth is still hiding in the shadows. My brother deserves better. He deserves justice.\""
    },
    {
        "title": "Labour MP Vicky Foxcroft quits as government whip over cuts to disability benefits",
        "description": "Labour MP Vicky Foxcroft has quit her job as a government whip in opposition to the government's plans to cut disability benefits.",
        "url": "https://news.sky.com/story/labour-mp-vicky-foxcroft-quits-as-government-whip-over-cuts-to-disability-benefits-13385986",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vicky-foxcroft-labour_6946322.jpg?20250619225556",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-19 21:45:00",
        "Headline": "The Labour MP wrote in a letter to the prime minister that she could not vote \"for reforms which include cuts to disabled people's finances\".",
        "Content": " Labour MP Vicky Foxcroft has quit her job as a government whip in opposition to the government's plans to cut disability benefits. She wrote in a letter to the prime minister that she could not vote \"for reforms which include cuts to disabled people's finances\". The former shadow minister for disabled people becomes the first MP to quit a government job over the controversial welfare reform plans that have seen over 100 Labour MPs publicly express concern over the proposals. A government spokesperson defended the reforms as \"principled\" and insisted they will protect the vulnerable. Politics latest: Defence secretary warns of 'moment of real danger' The MP for Lewisham North wrote that the benefits system is in \"desperate need of reform\", but argued this is not the way to do it. She said: \"I absolutely understand the need to address the ever-increasing welfare bill in these difficult economic times, but I have always believed this could and should be done by supporting more disabled people into work. \n                  Is Labour facing big backlash over welfare reforms?\n                 \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  First Minister John Swinney says winter fuel payment in Scotland 'will not be less than UK benefit'\n                 \"I do not believe that cuts to personal independence payment (PIP) and the health element of Universal Credit should be part of the solution.\" Ms Foxcroft said she has \"wrestled\" with the decision over whether to resign, but said: \"Sadly it now seems that we are not going to get the changes I desperately wanted to see. \"I therefore tender my resignation as I know I will not be able to do the job that is required of me and whip - or indeed vote - for reforms which include cuts to disabled people's finances.\" She has received public support from a number of fellow Labour MPs, who praised her \"principled\" stand on this issue. 'Moral case for change' The government published its bill earlier this week to tighten the eligibility for PIP benefits, and also cuts to the sickness-related portion of Universal Credit. Ministers say these plans will cut £5bn from the welfare budget that is ballooning.  The cost of long-term sickness and disability benefits for working-age people has risen by £20bn since the pandemic and is forecast to hit £70bn over the next five years. Ministers have said there is also a moral case for change, with one in eight young people not in education, training, or employment - prompting fears of a \"wasted generation\". But disability groups say they fear an increase in suicides and mental health conditions. Read more from Sky News:Why cancer patient is praying assisted dying bill passes major voteCompensation scheme for Capture victims announced The government's own assessment forecast an extra 250,000 people could be pushed into poverty - including 50,000 children. It did not include the impact of people moving into work. A government spokesperson said: \"This Labour government was elected to deliver change. The broken welfare system we inherited is failing the sick and most vulnerable and holding too many young people back. It is fair and responsible to fix it. \"Our principled reforms will ensure those who can work should, that those who want to work are properly supported, and that those with most severe disabilities and health conditions are protected.\""
    },
    {
        "title": "Met Police launches patrols to protect women and girls from violence at concerts",
        "description": "The Metropolitan Police has introduced patrols aimed at keeping women and girls safe at concerts.",
        "url": "https://news.sky.com/story/met-police-launches-patrols-to-protect-women-and-girls-from-violence-at-concerts-13385969",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beyonce-tottenham_6946298.jpg?20250619220245",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "The patrols, which began at a Beyonce concert on 5 June, have been introduced alongside the V100 project, a new data-driven approach to identify serious sexual offenders and prevent crimes.",
        "Content": "The Metropolitan Police has introduced patrols aimed at keeping women and girls safe at concerts. The new patrols come ahead of 51 large-scale music events due to take place in London this summer, with more than three million people set to attend shows at Wembley Stadium alone. The patrols started on 5 June with Beyonce's concert at Tottenham Hotspur Stadium, with the operation leading to the removal of an individual on suspicion of stalking and threatening behaviour, as well as the arrest of a man for upskirting, who remains on police bail. The patrols have been introduced alongside the V100 project, a new data-driven approach to identify serious sexual offenders and prevent crimes. Ben Russell, deputy assistant commissioner for the Metropolitan Police, said 177 of the V100 nominals had already been arrested, and 129 of them have been convicted for a range of serious offences. \"The V100 is our approach to identifying those men who are at the top end of carrying out the most serious and harmful attacks against women and girls - that's multiple serious sexual assaults. \"Thankfully, there are a relatively small number of offenders who we believe are behind the most serious crimes. \n                  'Loving father' shot dead in suspected case of mistaken identity prompts appeal for information\n                 \n                  Police officers face gross misconduct hearing after Taser aimed at 90-year-old woman\n                 \n                  Zhenhao Zou: Student who drugged and raped 10 women in London and China jailed for life\n                 \"And this is about identifying through our data the men posing the biggest risk of women and girls in London and taking action in a very targeted, precise way.\" Read more:Post Office scandal redress must not only be fair - it must be fastTrump reveals timeline on Iran attack decision The patrols work on both engaging with the public, \"helping people to feel safe, and letting them know that if they've got concerns, they can come and speak to us\", Mr Russell said. \"But the other part to it has a much harder edge, which is looking at the crowd and saying, 'who should not be here?'. \"So that will not be so visible to normal concert-goers, but we will approach people we think should not be there and we will make sure they leave venues and leave the areas as quickly as possible.\" An additional 565 officers and staff have been drafted into public protection roles across the force, aimed at enhancing the domestic abuse, rape and sexual offence investigation teams. Mr Russell added: \"For us and the Met, protecting women and girls has been one of our number one priorities for a while now, and we're working really closely with the government on that, and we're supportive of the mission to try and halve violence against women and girls, over the life of this parliament.\""
    },
    {
        "title": "UK weather: Amber heat health alert issued across England as hottest day of the year recorded",
        "description": "An amber heat health alert has been issued across England, as the UK recorded its hottest day of the year so far.",
        "url": "https://news.sky.com/story/uk-weather-amber-heat-health-alert-issued-across-england-as-hottest-day-of-the-year-recorded-13385733",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-weather-sunshine-southend_6946195.jpg?20250619190058",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-19 08:21:00",
        "Headline": "The UKHSA alert warns there could be \"a rise in deaths\" among people with pre-existing health conditions and those aged over 65.",
        "Content": "An amber heat health alert has been issued across England, as the UK recorded its hottest day of the year so far. Temperatures reached a peak of 32.2C (89.9F) at Kew Gardens and Heathrow Airport in west London. Check the weather forecast in your area Bushy Park in Teddington and Wisley in Surrey both recorded temperatures of 31.6C (88.88F). It makes Thursday the hottest day of the year so far and beats the 29.4C (85F) recorded last Friday in Suffolk. Thursday's record is likely to be broken in the next few days though, with temperatures forecast to hit highs of 33C (91F) by this weekend. Wales and Northern Ireland also saw their highest temperatures of the year so far with 30.1C (86.1F) recorded in Bute Park, Cardiff and 25.7C (78.2F) at Castlederg, Co Tyrone. \n                  At least 33 die in floods in Democratic Republic of Congo\n                 \n                  Seven killed as thunderstorms and tornadoes rip through US states\n                 \n                  Swirling polar vortex linked to deadly cluster of storms in 2022, say UK scientists\n                 In Scotland, it hit 24.3C (75.7F) in Glasgow, so falling short of the 25.7C (78.2F) seen at Lossiemouth on 13 June. The UK Health Security Agency's (UKHSA) latest heat health warnings for England include all regions, and are in effect from midday on Thursday to 9am on Monday. The amber alert indicates \"significant impacts are likely\" across health and social care services, and warns there could be \"a rise in deaths\" among people with pre-existing health conditions and those aged over 65. Read more: What is a heat health alert and when is one issued? A heatwave is officially declared when temperatures exceed a certain level for three days in a row. Thresholds vary from 25C to 28C (77F to 82F) across the UK. According to the Met Office, it will get progressively warmer as the week progresses - with the heat peaking on Sunday. Deputy chief meteorologist Dan Holley said thundery showers may be possible heading into Saturday morning, with \"tropical nights\" a possibility as parts of the UK approach heatwave territory. Read more from Sky News:Father and son drowned during test driveAttorney general 'questions' legality of Israel's actions in IranSpaceX rocket being tested explodes before launch Charities have also issued warnings about the potential risks of hotter weather, and the Local Government Association, which represents councils in England and Wales, has urged people to check in on vulnerable neighbours. It comes after the Met Office said this week that there is a 50:50 chance of temperatures reaching up to 40C or more again in the next 12 years. Temperatures first hit 40C in the UK during a record-breaking heatwave in 2022, peaking at 40.3C in Coningsby in Lincolnshire on 19 July. The previous top temperature was 38.7C in Cambridge, recorded in 2019. The extreme heat caused dozens of fires, which ripped through houses, schools, churches and farmland, with fire brigades in London, Leicestershire and South Yorkshire declaring major incidents at the time. More than 3,000 heat-related deaths were recorded in England over summer 2022, including more than 1,000 excess deaths among older people around the four-day peak of the heatwave."
    },
    {
        "title": "Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'",
        "description": "Sir Alan Bates has called for those responsible for the wrongful convictions of sub postmasters in the Capture IT scandal to be \"brought to account\".",
        "url": "https://news.sky.com/story/post-office-capture-scandal-sir-alan-bates-calls-for-those-responsible-for-wrongful-convictions-to-be-brought-to-account-13385926",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sir-alan-bates-post-office_6946261.jpg?20250619204329",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "It comes after Sky News unearthed a report showing Post Office lawyers knew of faults in the software nearly three decades ago.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Sir Alan Bates has called for those responsible for the wrongful convictions of sub postmasters in the Capture IT scandal to be \"brought to account\". It comes after Sky News unearthed a report showing Post Office lawyers knew of faults in the software nearly three decades ago. The documents, found in a garage by a retired computer expert, describe the Capture system as \"an accident waiting to happen\".  Sir Alan said the Sky News investigation showed \"yet another failure of government oversight; another failure of the Post Office board to ensure [the] Post Office recruited senior people competent of bringing in IT systems\" and management that was \"out of touch with what was going on within its organisation\". The unearthed Capture report was commissioned by the defence team for sub postmistress Patricia Owen and served on the Post Office in 1998 at her trial. It described the software as \"quite capable of producing absurd gibberish\" and concluded \"reasonable doubt\" existed as to \"whether any criminal offence\" had taken place. Ms Owen was found guilty of stealing from her branch and given a suspended prison sentence. She died in 2003 and her family had always believed the computer expert, who was due to give evidence on the report, \"never turned up\". Adrian Montagu reached out after seeing a Sky News report earlier this year and said he was actually stood down by the defending barrister with \"no reason given\". The barrister said he had no recollection of the case. Victims and their lawyers hope the newly found \"damning\" expert report, which may never have been seen by a jury, could help overturn Capture convictions. Read more: Post Office scandal redress must not only be fair - it must be fast  'These people have to be brought to account' Sir Alan, the leading campaigner for victims of the Horizon Post Office scandal, said while \"no programme is bug free, why [was the] Post Office allowed to transfer the financial risk from these bugs on to a third party ie the sub postmaster, and why did its lawyers continue with prosecutions seemingly knowing of these system bugs?\" He continued: \"Whether it was incompetence or corporate malice, these people have to be brought to account for their actions, be it for Capture or Horizon.\" More than 100 victims have come forward More than 100 victims, including those who were not convicted but who were affected by the faulty software, have so far come forward. Capture was used in 2,500 branches between 1992 and 1999, just before Horizon was introduced - which saw hundreds wrongfully convicted. The Criminal Cases Review Commission (CCRC), the body responsible for investigating potential miscarriages of justice, is currently looking at a number of Capture convictions. A CCRC spokesperson told Sky News: \"We have received applications regarding 29 convictions which pre-date Horizon.25 of these applications are being actively investigated by case review managers, and two more recent applications are in the preparatory stage and will be assigned to case review managers before the end of June. \"We have issued notices under s.17 of the Criminal Appeal Act 1995 to Post Office Ltd requiring them to produce all material relating to the applications received. \"To date, POL have provided some material in relation to 17 of the cases and confirmed that they hold no material in relation to another 5. The CCRC is awaiting a response from POL in relation to 6 cases.\" A spokesperson for the Department for Business and Trade said: \"Postmasters negatively affected by Capture endured immeasurable suffering. We continue to listen to those who have been sharing their stories on the Capture system, and have taken their thoughts on board when designing the Capture Redress Scheme.\""
    },
    {
        "title": "Diplomacy to end Israel-Iran conflict picks up pace - but what is its chance of success?",
        "description": "Diplomacy to prevent the conflict between Israel and Iran spiralling further out of control is picking up pace with the UK at its centre.",
        "url": "https://news.sky.com/story/diplomacy-to-end-israel-iran-conflict-picks-up-pace-but-what-is-its-chance-of-success-13385875",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-israel-iran-hospital_6946107.jpg?20250619170521",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "If Iran can be persuaded to give up its enrichment programme and verifiably guarantee its nuclear project can only be used for civilian purposes, a deal might be possible. That is a big if.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Diplomacy to prevent the conflict between Israel and Iran spiralling further out of control is picking up pace with the UK at its centre. British Foreign Secretary David Lammy has met with his US counterpart Marco Rubio and President Trump's chief negotiator Steve Witkoff in Washington, and flies next to Geneva. Sources close to the talks say the meeting in the US capital was positive and the Americans are seeking a diplomatic solution while retaining military action as very much an option \"on the table\". Follow the latest updates on the Israel-Iran war Mr Lammy flies to meet with Iran's foreign minister Abbas Aragchi and their French and German counterparts in Geneva on Friday. He will be taking with him a message to the Iranians from the Trump administration. Their response could be crucial in what happens next in a conflict that threatens to escalate, engulfing the region.  There are limitations to the diplomacy under way not least because Israel is not involved in the talks. \n                  Donald Trump weighing up many risks before possible US strike on Iran\n                 \n                  Why Iranian strike that damaged Israeli hospital could have big impact on the conflict\n                 \n                  Daughter of human rights lawyer held in Iranian prison in area targeted by Israeli missiles begs for his release\n                 Israelis say Iran cannot be trusted and do not want their stunning military progress jeopardised by weeks of delaying diplomacy, fearing the Iranians will play for time. US President Donald Trump though seems willing to give the talks more time, possibly as much as two weeks before taking military action if it fails. Read more:Russia would react 'negatively' if Iran's leader is killed - KremlinTrump's statement on Iran - but keeps everyone guessing  The talks will focus on Iran's alleged nuclear weapons programme and the issue of uranium enrichment. Iran has been enriching to levels that can only be used for military purposes while claiming to do so for civilian reasons. Israel and America both believe Iran cannot be trusted to enrich uranium for any purposes. But if Iran can be persuaded to give up its enrichment programme and verifiably guarantee its nuclear project can only be used for civilian purposes, a deal might be possible. That is a big if. Iran has long defended its right to enrich uranium. Israel will need a lot of persuading to call off its military offensive and if President Trump remains unconvinced by the diplomacy too, escalation including US military action seems at this stage hard to avoid."
    },
    {
        "title": "Director Danny Boyle on how 28 Years Later could be seen as an allegory for Brexit",
        "description": "Director Danny Boyle has said his latest film 28 Years Later could be seen as an allegory for Brexit.",
        "url": "https://news.sky.com/story/director-danny-boyle-on-how-28-years-later-could-be-seen-as-an-allegory-for-brexit-13385818",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-28-years-later-alfie-williams_6946019.jpg?20250619152208",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Boyle's film also features a digital recreation of the Sycamore Gap tree, which the director says he hopes will be \"a wonderful tribute\" to Northumberland's iconic tree.",
        "Content": "\n          Arts and entertainment correspondent\n        Director Danny Boyle has said his latest film 28 Years Later could be seen as an allegory for Brexit. Boyle's original zombie horror, 28 Days Later, was a groundbreaking film which revitalised the genre. Now, his follow-up 28 Years Later gives an insight into how much of humanity is still standing almost three decades after the deadly Rage virus took hold. \"It's a very ambitious picture of what's happened to the British mainland 28 years after the original infection,\" he tells Sky News. The film shows how mainland Europe has cut Britain off, the country is isolated, with the remaining population left to fend for itself, which Boyle says could be seen as an allegory for Brexit or the pandemic. \"There is an element of that… horror is a wonderful genre because you can put transparencies against it, you can put COVID against it… you can put Brexit against it as well, and you read things into it like that and it's deliciously flexible,\" he says. Central to this new story is a new character, a young boy called Spike, played by newcomer Alfie Williams, whose character has been raised on a remote coastal Island with Jodie Comer starring as his mum. \n                  Most anticipated films coming to cinemas in 2025\n                 \n                  Zombie classic 28 Days Later set for new sequel under Danny Boyle and Alex Garland\n                 \n                  Danny Boyle dismisses conspiracy theorist 'rabbit holes' in adaptation of The Matrix\n                 \"To get to see how Danny and his team work on set and then see the final product, it's been a dream,\" Comer says. Fans won't have to wait quite so long for the follow-up to this, with a triptych of films planned this time around. While the second has already been shot and is due out next January, the really scary thing for Boyle currently is securing the financing to make the last instalment. \"We're hoping we do well enough to get the third film financed... we want there to be three films ultimately,\" he says. 'A wonderful tribute' to Sycamore Gap Boyle's film also features a digital recreation of the Sycamore Gap tree, which the director says he hopes will be \"a wonderful tribute\" to Northumberland's iconic tree. Eagle-eyed viewers will spot the tree is still standing in scenes for Boyle's apocalyptic horror despite being felled in September 2023. Boyle explains: \"It had already been destroyed by the time we came to film, so we recreated it for the same reasons that you see the Queen in this… all the things that have happened to us in the last 28 years have not happened.\" Read more:Two men who cut down Sycamore Gap tree face lengthy jail terms As well as forming a part of people's personal lives, as the scene of wedding proposals, ashes being scattered and countless photographs, it had already held a place in pop culture, featuring in the 1991 Kevin Costner film Robin Hood: Prince Of Thieves. It is a blink-and-you'll-miss-it moment in the film, but Boyle said given how much of what they shot is filmed in the beautiful Northumbria countryside, to resurrect \"one of their most beautiful icons\" was a \"real privilege which we felt we couldn't ignore\". \"So we've recreated it deliberately to say that it was still growing… which is a wonderful tribute,\" he adds. 28 Years Later is out on 20 June."
    },
    {
        "title": "Post Office scandal redress must not only be fair - it must be fast",
        "description": "\"Exonerate and acknowledge\" say victims of the Post Office Capture scandal.",
        "url": "https://news.sky.com/story/post-office-scandal-redress-must-not-only-be-fair-it-must-be-fast-13385886",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-post-office-robinson_6945442.png?20250619130329",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-19 15:40:00",
        "Headline": "Capture is not a separate Post Office scandal - it's part of the same one. Victims now want \"parity\" with Horizon victims when it comes to redress and quashing their convictions.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n \"Exonerate and acknowledge\" say victims of the Post Office Capture scandal. And it's easy to see why patience is wearing thin. To understand what happened with Capture, you must first understand Horizon. Both scandals centre not on flawed software alone, but how the Post Office reacted to it.  A business that used its powers to privately prosecute sub-postmasters, forcing them to pay back unexplained accounting shortfalls. Any suggestion that the system itself was at fault was dismissed. Capture is not a separate scandal - it's part of the same one. \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  Could there be another Post Office scandal?\n                 \n                  Post Office scandal: Compensation scheme for Capture victims announced\n                 That's why Capture victims now want \"parity\" with Horizon victims when it comes to redress and exoneration. \"It should now be a given,\" says Steve Lewis, who was sacked from his job as a sub-postmaster after raising concerns about shortfalls linked to Capture software. The government has promised an Autumn 2025 redress scheme. But Steve wants proposed interim payments to be \"paid swiftly due to demographics, age, and well-being of the Capture group\". And beyond compensation lie even more urgent demands: for those wrongfully convicted under Capture to be exonerated. Many of these individuals remain ineligible for redress, their names still tarnished. They're calling for blanket exonerations - just as in the Horizon scandal - to finally quash their convictions. The judiciary will push back, undoubtedly, against this. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:Call to sue government over delaysCompensation offer was 'utter disgrace'Post Office auditor under investigation But, as Steve puts it, \"time is not on our side\" for redress and exoneration. Too many Capture victims have already died without ever knowing justice - as have many Horizon victims. If governments have learned anything over the years, it's this: justice delayed is justice denied. Redress must not only be fair - it must be fast."
    },
    {
        "title": "'Loving father' shot dead in suspected case of mistaken identity prompts appeal for information",
        "description": "The family of a father shot dead in a suspected case of mistaken identity in north London have said he \"deserves justice\" as they appealed for information.",
        "url": "https://news.sky.com/story/loving-father-shot-dead-in-suspected-case-of-mistaken-identity-prompts-appeal-for-information-13385799",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tottenham-murder-mahad-abdi-mohamed_6945883.jpg?20250619131623",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Mahad Abdi Mohamed died from a gunshot wound to the head after attackers opened fire from a stolen car.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  The family of a father shot dead in a suspected case of mistaken identity in north London have said he \"deserves justice\" as they appealed for information. Mahad Abdi Mohamed, 27, died from a gunshot wound to the head in hospital after he was hit with bullets fired from a stolen Mitsubishi Outlander, which was later found burnt out. Detectives believe those responsible for his murder had set out to hurt someone else in a \"pre-meditated and targeted attack\" in Waverley Road, Tottenham, at 8.45pm on Thursday 20 March. Mr Abdi Mohamed's younger sister, Amal Abdi Mohamed, 23, said he was a \"loving father\" to his five-year-old son, who \"looked up to him like a superhero\", and was planning to get married in the summer. \"He was taken away from us through gun violence,\" she said. \"A bullet didn't just take his life, it tore through our family, through our heart, and it's truly shocking, it's devastating, and it's so senseless, because this type of violence should never be normal. \"It should never be something a family ever has to expect, prepare for, or live with.\" \n                  Jennifer Abbott: Woman's 'murder' could be linked to diamond-encrusted Rolex, say police\n                 \n                  Sadeq Nikzad: Man jailed for raping 15-year-old after following her in Falkirk town centre\n                 \n                  Disgraced singer Gary Glitter to stay in jail as parole bid refused\n                 Mr Abdi's 26-year-old friend, with whom he had been breaking his Ramadan fast, was also shot in the leg and was treated in hospital for a wound police said was not life-changing. The Metropolitan Police arrested four men on suspicion of murder, who have been released on bail pending further investigations. Detectives are appealing for witnesses who saw a silver Mitsubishi Outlander in the area, which was found burnt out in Runcorn Close, the following morning. \"This tragic event and Mahad's death, has had a profound impact on the community and all those who loved him. Someone out there knows what happened. And that person, or people, must come forward,\" said Detective Chief Inspector Rebecca Woodsford. \"Regardless of how small you think your information is, please share it with us. It could be the missing link we need to secure justice for Mahad and his family.\" Read more from Sky News:Government whip quits over Starmer's welfare cutsPatrols to protect women and girls from violence at concertsCompensation scheme for Capture victims announced 'To stay silent is to be complicit'  Many of Mr Abdi Mohamed's family members were in tears as they visited the scene of his murder as part of the appeal for information. \"My sweet Mahad was the kind of person who could light up a room without even trying,\" said his sister. \"His laugh was so loud, and it still echoes in our memories.\" Ms Abdi Mohamed said her brother \"was funny, he was honest, and overall he was just a good man\" but \"wasn't perfect\". She said he had \"made mistakes but turned his life around\" working at Waterloo Station, and part-time at the Tottenham Hotspur Stadium and Royal Ascot as a security guard. \"How do you look at a child who adored him day and night, and tell them that he's gone and you don't have the answers why? That boy will have to grow up with no dad,\" she said. \"If you think you may know anything or have seen anything - you may think it doesn't matter, but it might be the key to giving us an answer, and it might be the thing that finally lets our family take a breath. \"To stay silent is to be complicit. \"To stay silent is to let a grieving mother suffer in confusion. To stay silent is to let a little boy grow up not knowing what happened to his father. \"If you know something and you haven't come forward, please think about that. Think about a family that cannot begin to heal because the truth is still hiding in the shadows. My brother deserves better. He deserves justice.\""
    },
    {
        "title": "Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'",
        "description": "Sir Alan Bates has called for those responsible for the wrongful convictions of sub postmasters in the Capture IT scandal to be \"brought to account\".",
        "url": "https://news.sky.com/story/post-office-capture-scandal-sir-alan-bates-calls-for-those-responsible-for-wrongful-convictions-to-be-brought-to-account-13385926",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sir-alan-bates-post-office_6946261.jpg?20250619204329",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "It comes after Sky News unearthed a report showing Post Office lawyers knew of faults in the software nearly three decades ago.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Sir Alan Bates has called for those responsible for the wrongful convictions of sub postmasters in the Capture IT scandal to be \"brought to account\". It comes after Sky News unearthed a report showing Post Office lawyers knew of faults in the software nearly three decades ago. The documents, found in a garage by a retired computer expert, describe the Capture system as \"an accident waiting to happen\".  Sir Alan said the Sky News investigation showed \"yet another failure of government oversight; another failure of the Post Office board to ensure [the] Post Office recruited senior people competent of bringing in IT systems\" and management that was \"out of touch with what was going on within its organisation\". The unearthed Capture report was commissioned by the defence team for sub postmistress Patricia Owen and served on the Post Office in 1998 at her trial. It described the software as \"quite capable of producing absurd gibberish\" and concluded \"reasonable doubt\" existed as to \"whether any criminal offence\" had taken place. Ms Owen was found guilty of stealing from her branch and given a suspended prison sentence. She died in 2003 and her family had always believed the computer expert, who was due to give evidence on the report, \"never turned up\". Adrian Montagu reached out after seeing a Sky News report earlier this year and said he was actually stood down by the defending barrister with \"no reason given\". The barrister said he had no recollection of the case. Victims and their lawyers hope the newly found \"damning\" expert report, which may never have been seen by a jury, could help overturn Capture convictions. Read more: Post Office scandal redress must not only be fair - it must be fast  'These people have to be brought to account' Sir Alan, the leading campaigner for victims of the Horizon Post Office scandal, said while \"no programme is bug free, why [was the] Post Office allowed to transfer the financial risk from these bugs on to a third party ie the sub postmaster, and why did its lawyers continue with prosecutions seemingly knowing of these system bugs?\" He continued: \"Whether it was incompetence or corporate malice, these people have to be brought to account for their actions, be it for Capture or Horizon.\" More than 100 victims have come forward More than 100 victims, including those who were not convicted but who were affected by the faulty software, have so far come forward. Capture was used in 2,500 branches between 1992 and 1999, just before Horizon was introduced - which saw hundreds wrongfully convicted. The Criminal Cases Review Commission (CCRC), the body responsible for investigating potential miscarriages of justice, is currently looking at a number of Capture convictions. A CCRC spokesperson told Sky News: \"We have received applications regarding 29 convictions which pre-date Horizon.25 of these applications are being actively investigated by case review managers, and two more recent applications are in the preparatory stage and will be assigned to case review managers before the end of June. \"We have issued notices under s.17 of the Criminal Appeal Act 1995 to Post Office Ltd requiring them to produce all material relating to the applications received. \"To date, POL have provided some material in relation to 17 of the cases and confirmed that they hold no material in relation to another 5. The CCRC is awaiting a response from POL in relation to 6 cases.\" A spokesperson for the Department for Business and Trade said: \"Postmasters negatively affected by Capture endured immeasurable suffering. We continue to listen to those who have been sharing their stories on the Capture system, and have taken their thoughts on board when designing the Capture Redress Scheme.\""
    },
    {
        "title": "Labour MP Vicky Foxcroft quits as government whip over cuts to disability benefits",
        "description": "Labour MP Vicky Foxcroft has quit her job as a government whip in opposition to the government's plans to cut disability benefits.",
        "url": "https://news.sky.com/story/labour-mp-vicky-foxcroft-quits-as-government-whip-over-cuts-to-disability-benefits-13385986",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vicky-foxcroft-labour_6946322.jpg?20250619225556",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-19 21:45:00",
        "Headline": "The Labour MP wrote in a letter to the prime minister that she could not vote \"for reforms which include cuts to disabled people's finances\".",
        "Content": " Labour MP Vicky Foxcroft has quit her job as a government whip in opposition to the government's plans to cut disability benefits. She wrote in a letter to the prime minister that she could not vote \"for reforms which include cuts to disabled people's finances\". The former shadow minister for disabled people becomes the first MP to quit a government job over the controversial welfare reform plans that have seen over 100 Labour MPs publicly express concern over the proposals. A government spokesperson defended the reforms as \"principled\" and insisted they will protect the vulnerable. Politics latest: Defence secretary warns of 'moment of real danger' The MP for Lewisham North wrote that the benefits system is in \"desperate need of reform\", but argued this is not the way to do it. She said: \"I absolutely understand the need to address the ever-increasing welfare bill in these difficult economic times, but I have always believed this could and should be done by supporting more disabled people into work. \n                  Is Labour facing big backlash over welfare reforms?\n                 \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  First Minister John Swinney says winter fuel payment in Scotland 'will not be less than UK benefit'\n                 \"I do not believe that cuts to personal independence payment (PIP) and the health element of Universal Credit should be part of the solution.\" Ms Foxcroft said she has \"wrestled\" with the decision over whether to resign, but said: \"Sadly it now seems that we are not going to get the changes I desperately wanted to see. \"I therefore tender my resignation as I know I will not be able to do the job that is required of me and whip - or indeed vote - for reforms which include cuts to disabled people's finances.\" She has received public support from a number of fellow Labour MPs, who praised her \"principled\" stand on this issue. 'Moral case for change' The government published its bill earlier this week to tighten the eligibility for PIP benefits, and also cuts to the sickness-related portion of Universal Credit. Ministers say these plans will cut £5bn from the welfare budget that is ballooning.  The cost of long-term sickness and disability benefits for working-age people has risen by £20bn since the pandemic and is forecast to hit £70bn over the next five years. Ministers have said there is also a moral case for change, with one in eight young people not in education, training, or employment - prompting fears of a \"wasted generation\". But disability groups say they fear an increase in suicides and mental health conditions. Read more from Sky News:Why cancer patient is praying assisted dying bill passes major voteCompensation scheme for Capture victims announced The government's own assessment forecast an extra 250,000 people could be pushed into poverty - including 50,000 children. It did not include the impact of people moving into work. A government spokesperson said: \"This Labour government was elected to deliver change. The broken welfare system we inherited is failing the sick and most vulnerable and holding too many young people back. It is fair and responsible to fix it. \"Our principled reforms will ensure those who can work should, that those who want to work are properly supported, and that those with most severe disabilities and health conditions are protected.\""
    },
    {
        "title": "Zhenhao Zou: Student who drugged and raped 10 women in London and China jailed for life",
        "description": "A Chinese PhD student found guilty of drugging and raping 10 women has been jailed for life with a minimum term of 24 years.",
        "url": "https://news.sky.com/story/zhenhao-zou-student-who-drugged-and-raped-10-women-in-london-and-china-jailed-for-life-13384903",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-zhenhao-zou-met-police_6841208.png?20250303213211",
        "type": "UK",
        "Author": "Amelia Harper",
        "Date Published": "2025-06-19 11:30:00",
        "Headline": "Jurors found Zhenhao Zou, 28, guilty of 11 counts of rape against 10 women between 2019 and 2023. ",
        "Content": "\n          Home news correspondent\n              @AmeliaHarperTV\n  A Chinese PhD student found guilty of drugging and raping 10 women has been jailed for life with a minimum term of 24 years. Warning: This article contains details of sexual offences Zhenhao Zou, 28, was convicted of multiple sexual assaults on women in the UK and China in March, where he used drugs to incapacitate his victims before raping them. The trial at Inner London Crown Court heard how he used the drug butanediol to render his victims unconscious, and how he used hidden cameras to record nine of his assaults. Jurors found him guilty of 11 counts of rape against 10 women between 2019 and 2023. Three of these women were raped in London and seven in China. Zou was sentenced to 24 years in prison, but because of time served, he will serve at least 22 years and 227 days before being eligible for parole in 2048. Sentencing Zou at Inner London Crown Court on Thursday, Judge Rosina Cottage told him he was a \"very bright man\" who used a manipulative \"charming mask\" to hide that he is a \"sexual predator\". The judge said Zou \"planned and executed a campaign of rape\", which had \"devastating and long-term effects\" on his victims. She told Zou he treated the women, who were \"pieces in an elaborate game\" for the defendant, \"callously\" and as \"sex toys\" for his own pleasure, adding he has a \"sexual interest\" in \"asserting power and control over women\" and has \"no understanding of the meaning of consent\". Only two of his victims were identified during the trial. Since Zou's conviction, police have now identified one of the other victims involved in this case. The prosecution said Zou embarked on a \"campaign of offending of the utmost gravity\". He targeted young Chinese women, inviting them to his flat for drinks or to study before he drugged and assaulted them. Zou used hidden cameras or his mobile phone to record the attacks, keeping the footage and sometimes the women's belongings as souvenirs. Officers discovered nearly 1,300 videos in one of the biggest cases the Met's digital forensics lab has ever dealt with.  The rape material the jury had to watch was so graphic that jurors have been excused from jury service for two decades. During the sentencing hearing, the victim impact statements of three women were read out. The first said she'd woken up to find the former PhD student raping her in 2021. She said it happened while \"unconscious\" after being out drinking for four or five hours with friends in London's Chinatown. The woman said: \"That moment will clearly stay in my mind forever. As a result, I now experience severe physical and psychological distress. The memories trigger migraines, physical pain in the places he violated, and an overwhelming urge to scrub myself clean. \"To this day, I struggle to trust anyone. I avoid new friendships, trapped in the aftermath of what he did.\" The second victim was raped while \"drunk and unconscious\" at Zou's flat in London's Elephant and Castle in May 2023. Zou filmed the attack and took intimate images without her knowledge using a small camera by the bed. \"No matter what I did, I could not sleep; whenever I closed my eyes, the events of what happened to me kept replaying in my mind,\" she said in her statement, outlining her \"mental agony and pain\". \"I am not sure anything will help what I have gone through. The only thing I want him to know is that if he does this again, I will do everything in my power to send him back to prison.\" The third woman was unidentified during the trial until she came forward as part of the police appeal. This woman was raped at an unknown location in China, and Zou filmed her rape while she was unconscious. She told the court: \"When I recently saw that face again in the news reports, my trembling body reacted faster than my conscious mind. Now insomnia and anxiety rage anew. \"Reliving this feels like I'm being forced to watch my past self endure repeated violations.\" Zou is currently at the heart of the UK's largest rape investigation. Following Zou's conviction, investigators shared that they believed Zou's offending was on a much larger scale than the 11 rape convictions. Metropolitan Police detectives believe Zou could be the \"most substantial and prolific offender we've come across in recent times\". Officers believe more than 50 other women could also be victims of Zou, which would make him one of the worst sex offenders the UK has ever seen. Investigators have further video material showing unidentified women being attacked, and police believe around 25 of those incidents happened in the UK and 25 in China. An international appeal was launched for these women to come forward, resulting in 24 reporting they may have been raped by Zou. It's understood that some of these women form part of the 50 additional women that police say have also been targeted by the former University College London student. Police are particularly keen to hear from women from the Chinese student community who may have met Zou and were living in and around London between 2019 and 2024. Following the sentencing, the Metropolitan Police said the reports made by 24 women \"continue to be investigated thoroughly by a dedicated team of officers\" and the force \"will continue to liaise with the Crown Prosecution Service around potential future charges\". \"The lengthy sentence reflects justice for the women who are victim-survivors of Zou and is testament to the extraordinary lengths gone to by investigators, who left no stone unturned in their pursuit to take a dangerous sexual predator off the streets,\" Met Police said in a statement.  Commander Kevin Southworth said: \"First and foremost, our thoughts have always been with the courageous victim-survivors of Zou's heinous and predatory crimes.\" He added: \"I hope the fact Zou can no longer harm others serves as a small amount of comfort to the women who have suffered immeasurably.\" Saira Pike, of the Crown Prosecution Service, said Zou \"is a serial rapist and a danger to women\", adding that his life sentence was reflecting \"the heinous acts and harm he caused to women and the danger he posed to society\". Zou first moved to Belfast in 2017 to study mechanical engineering at Queen's University before moving to London in 2019. Read more:How student was unmasked as prolific sexual predatorMore than 20 new potential victims come forward He then studied for a Master's degree at University College London from 2019 to 2021, followed by a PhD at the same university from 2021. Police say \"investigators have not received any reports from women who met Zou while he was living in Belfast but remain in contact with Police Service Northern Ireland\", but that anyone with concerns should come forward."
    },
    {
        "title": "Met Police launches patrols to protect women and girls from violence at concerts",
        "description": "The Metropolitan Police has introduced patrols aimed at keeping women and girls safe at concerts.",
        "url": "https://news.sky.com/story/met-police-launches-patrols-to-protect-women-and-girls-from-violence-at-concerts-13385969",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beyonce-tottenham_6946298.jpg?20250619220245",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "The patrols, which began at a Beyonce concert on 5 June, have been introduced alongside the V100 project, a new data-driven approach to identify serious sexual offenders and prevent crimes.",
        "Content": "The Metropolitan Police has introduced patrols aimed at keeping women and girls safe at concerts. The new patrols come ahead of 51 large-scale music events due to take place in London this summer, with more than three million people set to attend shows at Wembley Stadium alone. The patrols started on 5 June with Beyonce's concert at Tottenham Hotspur Stadium, with the operation leading to the removal of an individual on suspicion of stalking and threatening behaviour, as well as the arrest of a man for upskirting, who remains on police bail. The patrols have been introduced alongside the V100 project, a new data-driven approach to identify serious sexual offenders and prevent crimes. Ben Russell, deputy assistant commissioner for the Metropolitan Police, said 177 of the V100 nominals had already been arrested, and 129 of them have been convicted for a range of serious offences. \"The V100 is our approach to identifying those men who are at the top end of carrying out the most serious and harmful attacks against women and girls - that's multiple serious sexual assaults. \"Thankfully, there are a relatively small number of offenders who we believe are behind the most serious crimes. \n                  'Loving father' shot dead in suspected case of mistaken identity prompts appeal for information\n                 \n                  Police officers face gross misconduct hearing after Taser aimed at 90-year-old woman\n                 \n                  Zhenhao Zou: Student who drugged and raped 10 women in London and China jailed for life\n                 \"And this is about identifying through our data the men posing the biggest risk of women and girls in London and taking action in a very targeted, precise way.\" Read more:Post Office scandal redress must not only be fair - it must be fastTrump reveals timeline on Iran attack decision The patrols work on both engaging with the public, \"helping people to feel safe, and letting them know that if they've got concerns, they can come and speak to us\", Mr Russell said. \"But the other part to it has a much harder edge, which is looking at the crowd and saying, 'who should not be here?'. \"So that will not be so visible to normal concert-goers, but we will approach people we think should not be there and we will make sure they leave venues and leave the areas as quickly as possible.\" An additional 565 officers and staff have been drafted into public protection roles across the force, aimed at enhancing the domestic abuse, rape and sexual offence investigation teams. Mr Russell added: \"For us and the Met, protecting women and girls has been one of our number one priorities for a while now, and we're working really closely with the government on that, and we're supportive of the mission to try and halve violence against women and girls, over the life of this parliament.\""
    },
    {
        "title": "Director Danny Boyle on how 28 Years Later could be seen as an allegory for Brexit",
        "description": "Director Danny Boyle has said his latest film 28 Years Later could be seen as an allegory for Brexit.",
        "url": "https://news.sky.com/story/director-danny-boyle-on-how-28-years-later-could-be-seen-as-an-allegory-for-brexit-13385818",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-28-years-later-alfie-williams_6946019.jpg?20250619152208",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Boyle's film also features a digital recreation of the Sycamore Gap tree, which the director says he hopes will be \"a wonderful tribute\" to Northumberland's iconic tree.",
        "Content": "\n          Arts and entertainment correspondent\n        Director Danny Boyle has said his latest film 28 Years Later could be seen as an allegory for Brexit. Boyle's original zombie horror, 28 Days Later, was a groundbreaking film which revitalised the genre. Now, his follow-up 28 Years Later gives an insight into how much of humanity is still standing almost three decades after the deadly Rage virus took hold. \"It's a very ambitious picture of what's happened to the British mainland 28 years after the original infection,\" he tells Sky News. The film shows how mainland Europe has cut Britain off, the country is isolated, with the remaining population left to fend for itself, which Boyle says could be seen as an allegory for Brexit or the pandemic. \"There is an element of that… horror is a wonderful genre because you can put transparencies against it, you can put COVID against it… you can put Brexit against it as well, and you read things into it like that and it's deliciously flexible,\" he says. Central to this new story is a new character, a young boy called Spike, played by newcomer Alfie Williams, whose character has been raised on a remote coastal Island with Jodie Comer starring as his mum. \n                  Most anticipated films coming to cinemas in 2025\n                 \n                  Zombie classic 28 Days Later set for new sequel under Danny Boyle and Alex Garland\n                 \n                  Danny Boyle dismisses conspiracy theorist 'rabbit holes' in adaptation of The Matrix\n                 \"To get to see how Danny and his team work on set and then see the final product, it's been a dream,\" Comer says. Fans won't have to wait quite so long for the follow-up to this, with a triptych of films planned this time around. While the second has already been shot and is due out next January, the really scary thing for Boyle currently is securing the financing to make the last instalment. \"We're hoping we do well enough to get the third film financed... we want there to be three films ultimately,\" he says. 'A wonderful tribute' to Sycamore Gap Boyle's film also features a digital recreation of the Sycamore Gap tree, which the director says he hopes will be \"a wonderful tribute\" to Northumberland's iconic tree. Eagle-eyed viewers will spot the tree is still standing in scenes for Boyle's apocalyptic horror despite being felled in September 2023. Boyle explains: \"It had already been destroyed by the time we came to film, so we recreated it for the same reasons that you see the Queen in this… all the things that have happened to us in the last 28 years have not happened.\" Read more:Two men who cut down Sycamore Gap tree face lengthy jail terms As well as forming a part of people's personal lives, as the scene of wedding proposals, ashes being scattered and countless photographs, it had already held a place in pop culture, featuring in the 1991 Kevin Costner film Robin Hood: Prince Of Thieves. It is a blink-and-you'll-miss-it moment in the film, but Boyle said given how much of what they shot is filmed in the beautiful Northumbria countryside, to resurrect \"one of their most beautiful icons\" was a \"real privilege which we felt we couldn't ignore\". \"So we've recreated it deliberately to say that it was still growing… which is a wonderful tribute,\" he adds. 28 Years Later is out on 20 June."
    },
    {
        "title": "Woman, 66, arrested on suspicion of murder after woman's death linked to missing Rolex",
        "description": "A woman has been arrested on suspicion of murder after the death of a 69-year-old woman was linked to a missing Rolex watch.",
        "url": "https://news.sky.com/story/woman-66-arrested-on-suspicion-of-murder-after-womans-death-linked-to-missing-rolex-13385865",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jennifer-abbott-rolex_6945264.jpg?20250618152931",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-19 14:35:00",
        "Headline": "Jennifer Abbott was pronounced dead in her north London flat on Friday. A post-mortem gave the cause of death as sharp force trauma.",
        "Content": "A woman has been arrested on suspicion of murder after the death of a 69-year-old woman was linked to a missing Rolex watch. A 66-year-old woman is now in custody after police previously said they believed the death of Jennifer Abbott - who was also known professionally as Sarah Steinberg - could be linked to the diamond-encrusted piece. Police were called at 6pm on Friday 13 June to a report of an unresponsive woman at her home in Mornington Place, Camden. Officers found a woman with stab injuries, who was pronounced dead at the scene. A post-mortem gave Ms Abbott's cause of death as sharp force trauma. She had last been seen by neighbours on Tuesday 10 June, walking her dog in the Camden area. Detective Inspector Barry Hart said: \"Our deepest sympathies are with the victim's loved ones who are being supported by specialist officers at this time. \n                  Post Office scandal: 'Hugely significant' evidence unearthed in computer expert's garage\n                 \n                  Post Office scandal redress must not only be fair - it must be fast\n                 \n                  'Loving father' shot dead in suspected case of mistaken identity prompts appeal for information\n                 \"We thank the local community for their patience as we continue to investigate this shocking crime. This arrest marks a significant step forward. There are several lines of enquiry ongoing, and we are working hard to establish the exact circumstances of this incident. \"Locals can expect to see an increased police presence in the area while we conduct our enquires.\""
    },
    {
        "title": "UK weather: Amber heat health alert issued across England as hottest day of the year recorded",
        "description": "An amber heat health alert has been issued across England, as the UK recorded its hottest day of the year so far.",
        "url": "https://news.sky.com/story/uk-weather-amber-heat-health-alert-issued-across-england-as-hottest-day-of-the-year-recorded-13385733",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-weather-sunshine-southend_6946195.jpg?20250619190058",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-19 08:21:00",
        "Headline": "The UKHSA alert warns there could be \"a rise in deaths\" among people with pre-existing health conditions and those aged over 65.",
        "Content": "An amber heat health alert has been issued across England, as the UK recorded its hottest day of the year so far. Temperatures reached a peak of 32.2C (89.9F) at Kew Gardens and Heathrow Airport in west London. Check the weather forecast in your area Bushy Park in Teddington and Wisley in Surrey both recorded temperatures of 31.6C (88.88F). It makes Thursday the hottest day of the year so far and beats the 29.4C (85F) recorded last Friday in Suffolk. Thursday's record is likely to be broken in the next few days though, with temperatures forecast to hit highs of 33C (91F) by this weekend. Wales and Northern Ireland also saw their highest temperatures of the year so far with 30.1C (86.1F) recorded in Bute Park, Cardiff and 25.7C (78.2F) at Castlederg, Co Tyrone. \n                  At least 33 die in floods in Democratic Republic of Congo\n                 \n                  Seven killed as thunderstorms and tornadoes rip through US states\n                 \n                  Swirling polar vortex linked to deadly cluster of storms in 2022, say UK scientists\n                 In Scotland, it hit 24.3C (75.7F) in Glasgow, so falling short of the 25.7C (78.2F) seen at Lossiemouth on 13 June. The UK Health Security Agency's (UKHSA) latest heat health warnings for England include all regions, and are in effect from midday on Thursday to 9am on Monday. The amber alert indicates \"significant impacts are likely\" across health and social care services, and warns there could be \"a rise in deaths\" among people with pre-existing health conditions and those aged over 65. Read more: What is a heat health alert and when is one issued? A heatwave is officially declared when temperatures exceed a certain level for three days in a row. Thresholds vary from 25C to 28C (77F to 82F) across the UK. According to the Met Office, it will get progressively warmer as the week progresses - with the heat peaking on Sunday. Deputy chief meteorologist Dan Holley said thundery showers may be possible heading into Saturday morning, with \"tropical nights\" a possibility as parts of the UK approach heatwave territory. Read more from Sky News:Father and son drowned during test driveAttorney general 'questions' legality of Israel's actions in IranSpaceX rocket being tested explodes before launch Charities have also issued warnings about the potential risks of hotter weather, and the Local Government Association, which represents councils in England and Wales, has urged people to check in on vulnerable neighbours. It comes after the Met Office said this week that there is a 50:50 chance of temperatures reaching up to 40C or more again in the next 12 years. Temperatures first hit 40C in the UK during a record-breaking heatwave in 2022, peaking at 40.3C in Coningsby in Lincolnshire on 19 July. The previous top temperature was 38.7C in Cambridge, recorded in 2019. The extreme heat caused dozens of fires, which ripped through houses, schools, churches and farmland, with fire brigades in London, Leicestershire and South Yorkshire declaring major incidents at the time. More than 3,000 heat-related deaths were recorded in England over summer 2022, including more than 1,000 excess deaths among older people around the four-day peak of the heatwave."
    },
    {
        "title": "Amputations, badly burned bomb victims and lack of medicine: British surgeons on life in Gaza",
        "description": "Doctors are a very special category of people. Doctors who opt to work in war zones are an entirely different level of special.",
        "url": "https://news.sky.com/story/amputations-badly-burned-bomb-victims-and-lack-of-medicine-british-surgeons-on-daily-life-in-gaza-13385804",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dr-tom-potokar-alex-crawford_6945922.jpg?20250619134021",
        "type": "World",
        "Author": "Alex Crawford",
        "Date Published": "2025-06-19 16:00:00",
        "Headline": "Two British surgeons who have worked in Gaza during Israel's bombardment of the territory have filmed video blogs for Sky News. They don't see themselves as heroes or even remarkable - that, of course, is what makes them even more so.",
        "Content": "\n          Special correspondent\n              @AlexCrawfordSky\n  Doctors are a very special category of people. Doctors who opt to work in war zones are an entirely different level of special. They take their skills and medical experience into the most dangerous of environments, knowing they risk their own lives in their mission to save others. Yet they do this regardless. Warning: This article contains details and images that some readers may find distressing. The British doctors who we came to know and immensely respect at the centre of our report, Gaza: Doctors on the Frontline, don't see themselves as heroes or even remarkable for what they've done over the past few weeks in Gaza. That, of course, is what makes them even more remarkable. \"This shouldn't be about us,\" Dr Tom Potokar scolded us more than once. \"This should be about what's happening to the Palestinians and health workers inside Gaza.\" But like it or not, the daily video blogs the travelling doctors did about their experiences on the ground in Gaza resonated with viewers. They sent us searing accounts of their daily lives while in Gaza. They told us of having to stitch together mostly young broken bodies, torn apart by repeated Israeli bombs. They talked of having to perform amputations on the young, of trying to stem the pain and infections on badly burned bomb victims and of the lack of common medicines. They fumed at what they saw as political 'complicity' from the international community for not doing enough to end the war. They begged for aid to be allowed in. They spoke from the heart as humanitarians and doctors but also witnesses - and we saw them tired, frustrated, angry at times, maybe a little anxious, certainly emotional.  And yet, all the time they realised how they were just visitors in Gaza while their patients, their medical co-workers and their colleagues' families were all living this permanently, with no escape while just trying to survive. Many do not. \"What do you say to a seven-year-old who's lost both her legs,\" Dr Tom says in one heart-wrenching vlog. \"Most of my patients are children,\" Dr Victoria Rose tells us in another. We see her fall in love with a badly burned toddler, so swathed in bandages, only his face was uncovered. \"This is my favourite little guy,\" she says in her vlog about three-year-old Haitum, \"he has 35% burns\". \"That's a lot for a little guy,\" she goes on. And the tens of thousands who watched her updates on social media platforms fell in love with the little boy too. Viewers see how Haitum was far from an exceptional case too. \"My first three patients today were under 12,\" we learn from Dr Victoria in another post. Read more from Dr Victoria Rose: 'I felt I had to go back to help'  The two surgeons were in small teams sent into the battlefield courtesy of the IDEALS charity, which funded their trip. Their limited time in the Gaza Strip turned out to be of an intensity which both recognised as unmatched before by either of them. They witnessed alongside their patients and fellow medics, daily and nightly bombings; gunfire; dwindling medical supplies and saw the dire lack of food. They treated tiny skeletal bodies desperate for sustenance - and helped mass evacuations of badly wounded patients from the fast-disappearing health facilities. 'No one is safe' \"There just seems to be indiscriminate bombing,\" Dr Victoria says of the Israeli bombardment. \"No one is safe - whether you're a woman, man, child or health worker. \"But there seems to be a systematic pattern of attacking infrastructure, particularly around health provision.\" She goes on to cite how she's observed the Israeli attacks focus on taking out the hospital water supplies, then the power source, as well as declaring red zones or implementing evacuation orders around health facilities to make it difficult for patients to access the hospital and for staff to travel into work. The Israeli authorities have an alternative narrative - the Israeli Defence Forces claim they are carrying out \"precision strikes\", insist Hamas is using patients as human shields and say they've uncovered vast military command centres beneath hospitals - including the European Gaza. Conflicting accounts The doctors - equally insistently - say they've seen no arms in the hospitals and have seen no evidence of Hamas command centres or tunnels beneath. Dr Tom rang me while our team was on assignment in Somalia. \"You won't have heard but the European Gaza Hospital has been bombed,\" he said, \"I'll send you the videos\". He shuns social media and has no accounts, but he's a veteran who's been travelling to Gaza for the past seven years, and he knew very well the importance of what he was witnessing on the ground and living through. He's extremely experienced and has travelled across the globe working in war zones like Cambodia and Lebanon, and is a former chief surgeon for the International Red Cross. He's also a burns specialist with his own international charity called Interburns. \"If Cambodia was the killing fields, Gaza is the slaughterhouse,\" he says about his most recent time inside Gaza. Dr Victoria Rose is an NHS plastic surgeon based in London and was on her third trip to Gaza. She talks frankly of being motivated to go after helping to mentor Gaza surgeons who'd travelled to Britain to learn extra skills some years ago. \"We saw them struggling in Gaza and I felt I just had to help,\" she explains. She videoed everything - unstintingly - and has her own Instagram handle @rosieplasticsurgeon. She teases Dr Tom - on camera of course - about his lack of digital awareness. \"This is the man who calls it Facetube, aren't you Tom?\" The two have very different approaches but mutual respect. And both realised their job in Gaza was twofold. They had to bear witness. They had to report. Running past huge craters They had to provide insight into what fellow Palestinian medics are up against in Gaza; how hospitals - protected under international law - are being affected, and how ordinary Gazan civilians are suffering. So, Dr Tom took us into the heart of the European Gaza Hospital minutes after Israeli forces dropped multiple bombs around the complex. We saw him racing through the car park outside the Emergency Department and past huge craters and rubble. He delivered commentary as he ran through the smoke-filled corridors to try to find his anaesthetist. He showed us the repeated bombings a day later - and the scramble to get injured patients out to safety. The two surgeons may be very different people. But both are highly regarded in their fields and have been brought together by a burning desire to help the wounded and injured in Gaza as well as their fellow medics on the frontline. They also both entered Gaza with the knowledge that foreign journalists are barred from the territory - and many of those inside have been killed or maimed - so it fell to them, the doctors, to be the witnesses during their stay in Gaza and beyond. \"It's really not something I'm comfortable with,\" Dr Tom said. \"For a start, it takes up a lot of time! But it's important people see what's going on here. \"The question people should be asking is, why are foreign journalists being barred? What is it the Israelis do not want people to see?\" Analysis: Jonathan Levy - Israel's block on international journalists in Gaza should not be allowed to stand Dr Victoria texted a lot about her fears that Nasser Hospital, where the two travelling teams finally end up, may face the same fate as the European Gaza - evacuated and now out of action. \"We've got to keep on reminding people what's going on here because Nasser is the last functioning hospital in the south, and if it has to be evacuated, it will have tragic consequences for the civilians here. Hundreds will die,\" she says. The film is a graphic, often painful watch of human endurance, tragedy, pain and survival - told through the eyes of two exceptional and inspiring surgeons who felt their duty as doctors also meant they should lay bare what's happening inside the Gaza Strip - and what is still happening - while the world's focus has shifted elsewhere."
    },
    {
        "title": "Russia would react 'negatively' if Iran's leader is killed, says the Kremlin",
        "description": "Regime change in Iran is \"unacceptable\" and the assassination of the country's Supreme Leader would \"open the Pandora's box\", the Kremlin has said.",
        "url": "https://news.sky.com/story/russia-would-react-negatively-if-irans-leader-is-killed-says-the-kremlin-13385983",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-peskov-russia_6946318.jpg?20250619224737",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Russia has deepened its ties with Iran since invading Ukraine, and the two countries signed a strategic partnership in January.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Regime change in Iran is \"unacceptable\" and the assassination of the country's Supreme Leader would \"open the Pandora's box\", the Kremlin has said. In a rare interview with a foreign media organisation, Kremlin spokesman Dmitry Peskov told Sky News that Russia would react \"very negatively\" if Ayatollah Ali Khamenei was killed. The comments came as US President Donald Trump said he will decide within two weeks whether America will join Israel's military campaign against Tehran, after earlier speculating on social media about killing the Iranian leader. \"The situation is extremely tense and is dangerous not only for the region but globally,\" Mr Peskov said in an interview at the Constantine Palace in Saint Petersburg. \"An enlargement of the composition of the participants of the conflict is potentially even more dangerous. \"It will lead only to another circle of confrontation and escalation of tension in the region.\" They are the Kremlin's strongest comments yet regarding the Israel-Iran conflict, which has stoked fears in Moscow that it could be on the verge of losing its closest ally in the Middle East. \n                  Kellogg's, Coca-Cola and Brewdog beer on Russian shelves despite sanctions\n                 \n                  Ukraine war: 14 killed as Russian missile and drone attacks strike Kyiv - including American citizen\n                 \n                  G7 to discuss further sanctions if Russia fails to come to negotiating table, PM says\n                 Russia has deepened its ties with Iran since invading Ukraine, and the two countries signed a strategic partnership in January. \"[Regime change in Iran] is unimaginable. It should be unacceptable, even talking about that should be unacceptable for everyone,\" Mr Peskov said, in a thinly veiled reference to Washington.  But Mr Peskov refused to be drawn on what action Russia would take if Khamenei was killed, saying instead it would trigger action \"from inside Iran\". \"It would lead to the birth of extremist moods inside Iran and those who are speaking about [killing Khamenei], they should keep it in mind. They will open the Pandora's box.\" Vladimir Putin's offers to mediate an end to the conflict have so far been rejected by Mr Trump, who said on Wednesday that he told the Russian president to \"mediate your own [conflict]\", in reference to Russia's war against Ukraine. Mr Peskov denied the American president's words were insulting, adding: \"Everyone has a different language. \"President Trump has his own unique way of speaking and his unique language. We are quite tolerant and expect everyone to be tolerant of us.\" The Trump administration's own mediation efforts to end the war in Ukraine have failed to yield any major breakthroughs, despite two rounds of direct talks between Moscow and Kyiv. Moscow has stepped up its aerial bombardment of Ukraine in recent weeks and continues to reject Volodymyr Zelenskyy's calls for a 30-day ceasefire. \"Now we have a strategic advantage. Why should we lose it? We are not going to lose it. We are going further. We're advancing and we'll continue to advance,\" Mr Peskov said. Russia has previously said it would only commit to a ceasefire if Kyiv stops receiving foreign military support, fearing that a pause in the fighting would offer Ukraine a chance to rearm and regroup its forces. Read more:Western brands on Russian shelves despite sanctionsBodies of Ukrainian soldiers returned to Kyiv  Asked if Moscow could commit to not using a ceasefire in the same way, Mr Peskov said: \"A ceasefire is a ceasefire, and you stop. \"But America is not saying that 'we'll quit any supplies'. Britain is not saying that as well. France is not saying that as well. This is the problem.\""
    },
    {
        "title": "Diplomacy to end Israel-Iran conflict picks up pace - but what is its chance of success?",
        "description": "Diplomacy to prevent the conflict between Israel and Iran spiralling further out of control is picking up pace with the UK at its centre.",
        "url": "https://news.sky.com/story/diplomacy-to-end-israel-iran-conflict-picks-up-pace-but-what-is-its-chance-of-success-13385875",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-israel-iran-hospital_6946107.jpg?20250619170521",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "If Iran can be persuaded to give up its enrichment programme and verifiably guarantee its nuclear project can only be used for civilian purposes, a deal might be possible. That is a big if.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Diplomacy to prevent the conflict between Israel and Iran spiralling further out of control is picking up pace with the UK at its centre. British Foreign Secretary David Lammy has met with his US counterpart Marco Rubio and President Trump's chief negotiator Steve Witkoff in Washington, and flies next to Geneva. Sources close to the talks say the meeting in the US capital was positive and the Americans are seeking a diplomatic solution while retaining military action as very much an option \"on the table\". Follow the latest updates on the Israel-Iran war Mr Lammy flies to meet with Iran's foreign minister Abbas Aragchi and their French and German counterparts in Geneva on Friday. He will be taking with him a message to the Iranians from the Trump administration. Their response could be crucial in what happens next in a conflict that threatens to escalate, engulfing the region.  There are limitations to the diplomacy under way not least because Israel is not involved in the talks. \n                  Donald Trump weighing up many risks before possible US strike on Iran\n                 \n                  Why Iranian strike that damaged Israeli hospital could have big impact on the conflict\n                 \n                  Daughter of human rights lawyer held in Iranian prison in area targeted by Israeli missiles begs for his release\n                 Israelis say Iran cannot be trusted and do not want their stunning military progress jeopardised by weeks of delaying diplomacy, fearing the Iranians will play for time. US President Donald Trump though seems willing to give the talks more time, possibly as much as two weeks before taking military action if it fails. Read more:Russia would react 'negatively' if Iran's leader is killed - KremlinTrump's statement on Iran - but keeps everyone guessing  The talks will focus on Iran's alleged nuclear weapons programme and the issue of uranium enrichment. Iran has been enriching to levels that can only be used for military purposes while claiming to do so for civilian reasons. Israel and America both believe Iran cannot be trusted to enrich uranium for any purposes. But if Iran can be persuaded to give up its enrichment programme and verifiably guarantee its nuclear project can only be used for civilian purposes, a deal might be possible. That is a big if. Iran has long defended its right to enrich uranium. Israel will need a lot of persuading to call off its military offensive and if President Trump remains unconvinced by the diplomacy too, escalation including US military action seems at this stage hard to avoid."
    },
    {
        "title": "IDF does not 'deliberately target hospitals', says former Israeli defence minister Benny Gantz",
        "description": "A former Israeli defence minister has told Sky News it is \"absolutely not true\" that the country's military deliberately targets hospitals.",
        "url": "https://news.sky.com/story/idf-does-not-deliberately-target-hospitals-says-former-israeli-defence-minister-benny-gantz-13385958",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-israeli-defence-minister_6946177.jpg?20250619183951",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-19 19:28:00",
        "Headline": "The World Health Organization (WHO) has said at least 94% of all hospitals in the Gaza Strip have been damaged or destroyed.",
        "Content": " A former Israeli defence minister has told Sky News it is \"absolutely not true\" that the country's military deliberately targets hospitals. In an interview with Yalda Hakim, Benny Gantz - who quit Benjamin Netanyahu's war cabinet last year - also said he has \"nothing against\" the people of Iran or Gaza. The World Health Organization (WHO) has said at least 94% of all hospitals in the Gaza Strip have been damaged or destroyed. A total of 917 healthcare workers in medical facilities have been killed, the WHO said last month. Asked about the figures, and if the Israeli military deliberately targets healthcare buildings, Mr Gantz replied: \"This is absolutely not true.\" He said that when the Israel Defence Forces (IDF) targeted al Shifa hospital in Gaza earlier in the war, it \"did everything in our capacity to ensure nobody was getting hurt\". Mr Gantz continued: \"Those hospitals are a coverage, they are being used by Hamas to put all their infrastructure under those hospitals, underneath those schools. \"We alert them and evacuate it, then we do what we have to do. We do not deliberately go and hit a hospital just because it's a hospital. There's no way we're doing it.\"  The Israelis' military action in Gaza began after Hamas's attacks on 7 October 2023. Israel last week started launching airstrikes on targets in Iran as tensions between the countries escalated. Describing himself as a \"man of peace\", Mr Gantz said: \"I have nothing against the people of Iran as much as I don't have anything against the people of Gaza. \"I do hope that one day they can live with something they can live with and we can live beside. \"Until then, we must continue to operate to free our hostages, to make sure that Hamas is not threatening anyone and we can move forward.\" Read more:British surgeons on life in GazaIsraeli hospital damaged in Iranian strike He said of Israel's military action: \"Yes we are fighting for own security [..] but aren't we serving strategically the region? Aren't we serving strategically the global society?\" His comments came after an Israeli airstrike on a camp in north Gaza killed a total of 19 people on Thursday, according to the director of al Shifa hospital. They included three children and five women, Mohamed Abu Selmiyah said. Since the war began in October 2023, a total of 55,706 people have been killed, Gaza's Hamas-run health ministry has said. It does not distinguish between civilians and combatants in its count."
    },
    {
        "title": "Air India suspends some long-haul flights after fatal crash and reduces the frequency of others",
        "description": "Air India has confirmed it is suspending some of its long-haul flights from Saturday, including routes using the same type of Boeing aircraft which crashed shortly after take-off from Ahmedabad.",
        "url": "https://news.sky.com/story/air-india-suspends-some-long-haul-flights-after-fatal-crash-and-reduces-the-frequency-of-others-13385918",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-boeing-787-8_6939901.jpg?20250612100837",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-19 17:20:00",
        "Headline": "The airline's chairman has insisted the Boeing 787-8 aircraft travelling from Ahmedabad to Gatwick had a \"clean history\".",
        "Content": "Air India has confirmed it is suspending some of its long-haul flights from Saturday, including routes using the same type of Boeing aircraft which crashed shortly after take-off from Ahmedabad. The decision follows last Thursday's fatal crash involving a Boeing 787-8 flight from Ahmedabad to Gatwick. All but one of the 242 people on board were killed, with around 30 fatalities on the ground, in the world's worst aviation disaster in a decade. It was confirmed on Wednesday that the sole survivor, a British national, had left hospital. Most temporary reductions will last until at least mid-July, affecting both 787 and 777 aircraft types, and includes routes to Gatwick. The firm said in a statement it was cutting international services because of \"enhanced pre-flight safety checks\" and to accommodate \"additional flight durations arising from airspace closures in the Middle East\". Routes between Delhi-Nairobi, Amritsar-Gatwick and Goa-Gatwick are being suspended entirely. \n                  British survivor of Air India crash carries brother's coffin after being discharged from hospital\n                 \n                  Air India flight from Ahmedabad to London cancelled days after fatal crash\n                 \n                  Families of British Air India crash victims 'feel utterly abandoned' and hit out at government\n                  The frequency of other services will also be reduced from Delhi, Bengaluru and Amritsar to certain destinations in North America, Australia, Japan, South Korea and Europe - including Heathrow and Birmingham. The route between Ahmedabad and Gatwick remains unaffected. Air India has apologised and promised to contact affected passengers to offer alternative flights or refunds. The airline's chairman Natarajan Chandrasekaran on Wednesday insisted the Boeing 787-8 aircraft had a \"clean history\". \"The right engine was a new engine put in [in] March 2025. The left engine was last serviced in 2023 and was due [its] next maintenance check in December 2025,\" he told the Indian channel Times Now.. Meanwhile, India's aviation regulator has issued warning notices to Air India for breaching safety rules after three of its Airbus planes flew despite being overdue checks on emergency slides and for being slow to address the issue, according to news agency Reuters. The warning notices and an investigation report were not in any way related to last week's crash and were sent days before that incident. Read more:British families 'feel utterly abandoned'Flight to Gatwick cancelled after crashWatch: Moment Air India plane crashed The government has also said there has not been any decision yet on where the flight data recorders, also called black boxes, will be analysed. Indian newspaper The Economic Times reported that they were due to be sent to the US so the data could be extracted, as they had suffered fire damage and could not be analysed in India. The government said in a statement that India's Aircraft Accident Investigation Bureau (AAIB) would decide where the recorders would be examined after making a \"due assessment\" of all technical, safety and security considerations. Black boxes have two components - the flight data recorder and cockpit voice recorder - and provide crucial insights for crash investigators. They include altitude, airspeed, the status of controls and pilot conversations which help determine probable causes of crashes."
    },
    {
        "title": "Govt urged to keep citizenship promise to Hong Kongers - after threat to double timeline",
        "description": "The government should honour its promise to Hong Kongers to gain settled status after five years - not a proposed 10 years, MPs have urged.",
        "url": "https://news.sky.com/story/govt-urged-to-keep-promise-to-hong-kongers-after-threat-to-double-timeline-to-british-citizenship-13385790",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-passport-british_6945951.jpg?20250619140442",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-19 11:19:00",
        "Headline": "Sir Keir Starmer announced in May he would be doubling the time immigrants have to be in the UK before they can get settled status.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The government should honour its promise to Hong Kongers to gain settled status after five years - not a proposed 10 years, MPs have urged. People who fled Hong Kong for the UK on the British National Overseas (BNO) humanitarian visa say they have been left in limbo after the immigration white paper last month said the qualifying period for indefinite leave to remain (settled status) would be extended from five years to 10 years. The government has said it is consulting on whether Hong Kongers will be included in that extension, but has not given a timeline for when it will decide. Hong Kongers have been able to come to the UK under the BNO visa since 2021, with the promise of gaining the right to work and live without any limits (settled status) after five years, then to apply for British citizenship a year later. MPs with large Hong Kong populations in their constituencies are calling for the government to honour its initial promise. They say changing it could undermine confidence in the UK's immigration system and that the country has a \"duty\" to welcome those fleeing repression. Read more: What are Sir Keir Starmer's new immigration rules? \n                  Air India Boeing 787-8 Dreamliner turns around mid-flight after technical issue\n                 \n                  Let students who fled Hong Kong to go to UK pay same university fees as Britons, urge MPs\n                 \n                  Liberal Democrat MP Wera Hobhouse denied entry to Hong Kong says it should be 'wake-up call' to all parliamentarians\n                 Lord Patten, the last governor of Hong Kong and patron of campaign group Hong Kong Watch, said \"rewriting the terms of the promise would be disastrous for the UK's legitimacy on the world stage\". Hong Kongers have told Sky News they have had sleepless nights since the announcement, with many concerned about the government's commitment to them and the financial implications of having to pay international university fees for their children because of their status. Govt is breaching relationship Stella, 50, from Sutton, moved to the UK in 2021 and her two sons are set to go to university from next year, when they should have settled status and pay home fees, but will have to pay international fees for five years if the period is doubled. She said: \"This was a binding relationship, we uprooted everything in Hong Kong, packing up our whole life was not an easy thing, the cultural and language barriers, the UK economy isn't good - there are many challenges, but we've been so dedicated to integrating and planting our roots here. \"Now the government is trying to breach the original relationship, it's made us feel very uncertain. \"I agree on strengthening the border but why don't they concentrate on illegal immigrants? We contribute financially and socially, BNO holders should not be the target group.\" Read more:Let students who fled Hong Kong pay same university fees as Britons, urge MPs My son's fencing career is at risk Kolman, 55, came to the UK in 2022, and said extending the five years could be the difference between his son being able to compete for Team GB in fencing or not. \"My son is at uni now and was invited to join the national team but, because of his status he can't, but he could in a couple of years with settled status,\" he said. \"If it gets extended to 10 years, he may already be in the last chapter of his sporting life.\"  UK integrity will be same as Hong Kong Ivan, 50, from Sutton, came to the UK in 2022 with his wife and two sons and said he was anxious and his son might have to go to university in Hong Kong because of the international fees. He said: \"I am disappointed. The reason I came to the UK was the loss of integrity of the Hong Kong government, but if the settled status period is doubled with such short notice, I think the integrity of the UK government will be the same as the Hong Kong government. \"The terms were quite clear. \"My quality of sleep is really bad recently as I'm so anxious, my whole plan will be destroyed, I've just bought a house in Sutton. My biggest concern is the university fees and the NHS fee, which is a lot of money.\" UK has duty to Hong Kongers James Naish, the Labour MP for Rushcliffe near Nottingham, said the UK \"has a duty to welcome those fleeing repression in Hong Kong\". \"To fail to maintain the five-year pathway for BN(O) visa holders would potentially permanently damage the government's standing with Hongkongers, hundreds of thousands of whom have placed their trust in the UK and uprooted their lives to seek a safe haven in Britain,\" he added. A vital lifeline Nadia Whittome, the Labour MP for Nottingham East, said the five years to settled status had \"provided a vital lifeline to those fleeing repression\" and said it \"isn't fair\" to change the time period now. \"A 10-year wait for settled status would have huge practical implications for people who are eager to rebuild their lives in our country,\" she said. \"We must honour the terms that Hong Kongers, and other migrants, have arrived on.\" Moral targets Clive Jones, the Lib Dem MP for Wokingham, said: \"This isn't about migration targets, it's about moral targets. \"Changing the rules halfway through undermines confidence in our immigration system. \"We lose our credibility if we fail to protect those we welcomed, and we gain nothing by disrupting the lives of those already contributing.\" A Home Office spokesperson said: \"We are committed to supporting members of the Hong Kong community who have relocated to the UK and those who may come here in future. \"Further details of all measures announced in the immigration white paper will be set out in due course.\""
    },
    {
        "title": "Donald Trump weighing up many risks before possible US strike on Iran",
        "description": "This is the most significant statement from the US president in days, though it still keeps everyone guessing.",
        "url": "https://news.sky.com/story/donald-trump-weighing-up-many-risks-before-possible-us-strike-on-iran-13385951",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-us-president_6946264.jpg?20250619204746",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-19 19:05:00",
        "Headline": "The Israelis are pressuring Donald Trump to use American B2 bombers with their bunker-busting bombs to destroy Iran's nuclear facility at Fodow. But the president is under significant pressure domestically not to get involved in Iran.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  This is the most significant statement from the US president in days, though it still keeps everyone guessing. In a message conveyed through his press secretary, he is giving diplomacy up to two weeks to work. \"Based on the fact that there's a substantial chance of negotiations that may or may not take place with Iran in the near future, I will make my decision whether or not to go within the next two weeks,\" Karoline Leavitt quoted him as saying. It is not clear what \"whether or not to go\" entails. Israel-Iran conflict: Latest updates  We know that he has been given a spectrum of different military options by his generals and we know that the Israelis are pressuring him to use American B2 bombers with their bunker-busting bombs to destroy Iran's nuclear facility at Fodow. The Israelis are encouraging no delay. But against that, he is weighing up many risks, both military and political. \n                  Is Trump losing his MAGA loyalist support over Iran?  \n                 \n                  Tariffs hit US economy forecast but the Fed unmoved by latest Trump threats with no change to interest rates\n                 \n                  Donald Trump's comments about getting involved in Israel-Iran conflict are raising alarm bells in Moscow \n                 Militarily, it is not clear how successful a bunker-busting strike on Fordow would be. Experts have suggested it would require several of the massive bombs, which have never been used in combat before, to be dropped on the site. It is not as simple as one clean strike and job done. Politically, the president is under significant pressure domestically not to get involved in Iran.  Within his own MAGA coalition - influencers, politicians and media personalities are lining up in criticism of involvement in the conflict. One of those leading the criticism, his former chief strategist Steve Bannon, who maintains huge influence, was seen entering the White House on Thursday. His press secretary reiterated to us that the president always wants to give diplomacy a chance and she confirmed that his Middle East envoy Steve Witkoff has spoken to the Iranian foreign minister Abbas Araghchi. European leaders, including the UK foreign secretary David Lammy, who is in Washington, are meeting Mr Araghchi in Geneva on Friday. The two-week window - assuming it lasts that long - also gives space to better prepare for any strike and mitigate against some of the other risks of US involvement. Read more from Sky News:Is Trump losing his MAGA support?Gantz defends conflict with Iran'Love Trump' says Israeli minister There are 40,000 troops in bases across the Middle East. It takes time to increase security at these bases or to move non-essential personnel out. It also takes time to move strategic military assets into the region. The USS Nimitz aircraft carrier and its support vessels were redeployed from the Indo-Pacific on Monday. Their last known position was the Strait of Malacca two days ago. The Nimitz Carrier Group will overlap with the USS Carl Vinson group which was deployed to the Middle East in March. The potential two-week window also allows for more time for a 'day after' plan, given that the Israeli strategy appears to be regime change from within. Since the Israeli action in Iran began last week, the worst-case scenario of mass casualties in Israel from Iranian attacks has not materialised. The president is said to be surprised and encouraged by this. \"Israel has exceeded a lot of people's expectations in their abilities,\" press secretary Karoline Leavitt said. The Israeli success, the absence of a mass casualty event in Israel, and the lack of any sustained counterattack by Iranian proxies in the region remove reservations that previous presidents have had about taking on Iran. That said, sources have told Sky News that the president is determined that the diplomatic solution should be given a chance despite current pessimism over the chances of success. A critical two weeks ahead."
    },
    {
        "title": "SpaceX rocket being tested explodes into giant fireball before launch in Texas",
        "description": "A SpaceX rocket has exploded before launch - sending a dramatic fireball high into the sky.",
        "url": "https://news.sky.com/story/spacex-rocket-being-tested-explodes-into-giant-fireball-before-launch-in-texas-13385700",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spacex-starship-starbase_6945682.png?20250619090730",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-19 05:59:00",
        "Headline": "Starship 36 was preparing for its 10th test flight when the rocket burst into flames.",
        "Content": " A SpaceX rocket has exploded before launch - sending a dramatic fireball high into the sky. Starship 36 was preparing for its 10th test flight at Starbase - SpaceX's launch site at the southern tip of Texas - when the incident occurred on Wednesday evening. During take off procedures just after 11pm local time, the rocket exploded into a giant fireball. The company described the incident as a \"major anomaly\". In a statement, it added: \"A safety clear area around the site was maintained throughout the operation and all personnel are safe and accounted for. \"Our Starbase team is actively working to safe the test site and the immediate surrounding area in conjunction with local officials. \"There are no hazards to residents in surrounding communities, and we ask that individuals do not attempt to approach the area while safing operations continue.\" Read more from Sky News:Trump: I 'may or may not' strike IranElon Musk posts 'drug test results' It marks the latest failure for the space flight company, which hopes that Starship will one day be used to ferry people and cargo to Mars. Last month, a Starship test flight began spinning out of control about 30 minutes after its launch because of fuel leaks - meaning it broke up on re-entry into the Earth's atmosphere.  That followed explosive past failures in January, where a rocket blew up about eight minutes after take-off, and March, which forced flights in Florida to be temporarily grounded. SpaceX CEO Elon Musk said in May that despite the rocket failure, the test flight was a \"big improvement\". A day later, he said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of 2026."
    },
    {
        "title": "Government considering measure to slash industrial energy prices",
        "description": "Ministers are considering a commitment to cut soaring industrial energy prices for British companies to the same level enjoyed by competitors in France and Germany as part of its industrial strategy.",
        "url": "https://news.sky.com/story/government-considering-measure-to-slash-industrial-energy-prices-13385856",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-vauxhall-cars-manufacturing_6335198.jpg?20231025142155",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-06-19 13:55:00",
        "Headline": "Businesses have demanded a cut to bills as Britain has the highest industrial electricity prices in the G7.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Ministers are considering a commitment to cut soaring industrial energy prices for British companies to the same level enjoyed by competitors in France and Germany as part of its industrial strategy. Sky News understands proposals to make energy prices more competitive are at the heart of final discussions between the Department for Business and Trade and the Treasury ahead of the publication of its industrial strategy on Monday. Industrial electricity prices in the UK are the highest in the G7 and 46% above the median for the 32 member states of the International Energy Agency, which account for 75% of global demand. In 2023, British businesses paid £258 per megawatt-hour for electricity compared to £178 in France and £177 in Germany, according to IEA data. Matching those prices will require a reduction of around 27% at a cost of several billion pounds. Money blog: Interest rate held - but Bank of England gave 'small surprise' Earlier this month, automotive giant Nissan said UK energy prices make its Sunderland plant its most expensive in the world. Business secretary Jonathan Reynolds is understood to be sympathetic to business concerns, and chancellor Rachel Reeves told the CBI's annual dinner the issue of energy prices \"is a question we know we need to answer\". \n                  Why are UK industrial electricity prices so high - and what can be done about it?\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  What is Sizewell C – and why is it so controversial?\n                 Extending relief  While around 350 companies in energy-intensive industries, including steel, ceramics and cement, enjoy some relief from prices through the energy supercharger scheme, which refunds 60% of network charges and is expected to rise to 90%, there is currently no support for manufacturers. Sky News understands ministers are considering introducing a similar scheme to support the 200,000 manufacturing businesses in the UK. Cutting network costs entirely could save more than 20% from electricity prices. Explainer: Why are UK industrial electricity prices so high? The mechanism for delivering support is expected to require consultation before being introduced to ensure only businesses for whom energy is a central cost would benefit. This could be based on the proportion of outgoings spent on energy bills. It is not clear how the scheme would be funded, but the existing industrial supercharger is paid for by a levy on energy suppliers that is ultimately passed on to customers. A central demand  Bringing down prices, particularly for electricity, has been the central demand of business and industry groups, with Make UK warning high prices are rendering businesses uncompetitive and risk \"deindustrialising\" the UK. The primary driver of high electricity costs in the UK is wholesale gas, which both underpins the grid and sets the price in the market, even in periods when renewables provide the majority of supply. Why are costs so high? Wholesale prices account for around 39% of bills, with operating costs and network charges - the cost of using and maintaining the grid - making up another 25%, and VAT 20%. Business groups, including the manufacturers group Make UK, have called for a reduction in those additional charges, as well as the so-called policy costs that make up the final 16% of bills. These are made up of levies and charges introduced by successive governments to encourage and underwrite the construction of renewable sources of power. Read more from Sky News:Bank of England holds rate Warm Home Discount extendedWhy Middle East conflict poses new cost of living threat Make UK estimate that shifting policy costs into general taxation would cost around £3.8bn, but pay for itself over time in increased growth. Government sources confirmed that energy prices are a central issue that the industrial strategy will address, but said no final policy decisions have been agreed. The industrial strategy, which is delayed from its scheduled publication earlier this month, will set out the government's plans to support eight sectors identified as having high-growth potential, including advanced manufacturing, life sciences, defence and creative industries."
    },
    {
        "title": "Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'",
        "description": "Sir Alan Bates has called for those responsible for the wrongful convictions of sub postmasters in the Capture IT scandal to be \"brought to account\".",
        "url": "https://news.sky.com/story/post-office-capture-scandal-sir-alan-bates-calls-for-those-responsible-for-wrongful-convictions-to-be-brought-to-account-13385926",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sir-alan-bates-post-office_6946261.jpg?20250619204329",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "It comes after Sky News unearthed a report showing Post Office lawyers knew of faults in the software nearly three decades ago.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n Sir Alan Bates has called for those responsible for the wrongful convictions of sub postmasters in the Capture IT scandal to be \"brought to account\". It comes after Sky News unearthed a report showing Post Office lawyers knew of faults in the software nearly three decades ago. The documents, found in a garage by a retired computer expert, describe the Capture system as \"an accident waiting to happen\".  Sir Alan said the Sky News investigation showed \"yet another failure of government oversight; another failure of the Post Office board to ensure [the] Post Office recruited senior people competent of bringing in IT systems\" and management that was \"out of touch with what was going on within its organisation\". The unearthed Capture report was commissioned by the defence team for sub postmistress Patricia Owen and served on the Post Office in 1998 at her trial. It described the software as \"quite capable of producing absurd gibberish\" and concluded \"reasonable doubt\" existed as to \"whether any criminal offence\" had taken place. Ms Owen was found guilty of stealing from her branch and given a suspended prison sentence. She died in 2003 and her family had always believed the computer expert, who was due to give evidence on the report, \"never turned up\". Adrian Montagu reached out after seeing a Sky News report earlier this year and said he was actually stood down by the defending barrister with \"no reason given\". The barrister said he had no recollection of the case. Victims and their lawyers hope the newly found \"damning\" expert report, which may never have been seen by a jury, could help overturn Capture convictions. Read more: Post Office scandal redress must not only be fair - it must be fast  'These people have to be brought to account' Sir Alan, the leading campaigner for victims of the Horizon Post Office scandal, said while \"no programme is bug free, why [was the] Post Office allowed to transfer the financial risk from these bugs on to a third party ie the sub postmaster, and why did its lawyers continue with prosecutions seemingly knowing of these system bugs?\" He continued: \"Whether it was incompetence or corporate malice, these people have to be brought to account for their actions, be it for Capture or Horizon.\" More than 100 victims have come forward More than 100 victims, including those who were not convicted but who were affected by the faulty software, have so far come forward. Capture was used in 2,500 branches between 1992 and 1999, just before Horizon was introduced - which saw hundreds wrongfully convicted. The Criminal Cases Review Commission (CCRC), the body responsible for investigating potential miscarriages of justice, is currently looking at a number of Capture convictions. A CCRC spokesperson told Sky News: \"We have received applications regarding 29 convictions which pre-date Horizon.25 of these applications are being actively investigated by case review managers, and two more recent applications are in the preparatory stage and will be assigned to case review managers before the end of June. \"We have issued notices under s.17 of the Criminal Appeal Act 1995 to Post Office Ltd requiring them to produce all material relating to the applications received. \"To date, POL have provided some material in relation to 17 of the cases and confirmed that they hold no material in relation to another 5. The CCRC is awaiting a response from POL in relation to 6 cases.\" A spokesperson for the Department for Business and Trade said: \"Postmasters negatively affected by Capture endured immeasurable suffering. We continue to listen to those who have been sharing their stories on the Capture system, and have taken their thoughts on board when designing the Capture Redress Scheme.\""
    },
    {
        "title": "Why are UK industrial electricity prices so high - and what can be done about it?",
        "description": "Britain has the highest industrial electricity prices in the G7, a cost businesses say makes it impossible to compete internationally and risks \"deindustrialising\" the UK.",
        "url": "https://news.sky.com/story/why-are-uk-industrial-electricity-prices-so-high-and-what-can-be-done-about-it-13385866",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-pylon-scotland-uk-energy_6683164.jpg?20240912143105",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-06-19 14:36:00",
        "Headline": "Business groups are calling for costs to be cut to allow them to compete more equitably with competitors in France and Germany. ",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Britain has the highest industrial electricity prices in the G7, a cost businesses say makes it impossible to compete internationally and risks \"deindustrialising\" the UK. Electricity prices are driven by wholesale fuel prices, particularly natural gas, but include taxes and \"policy costs\" that business groups, including Make UK and the CBI, want the government to cut. Sky News understands the issue is a \"live discussion\" within government as ministers finalise the government's industrial strategy, due to be published next week. Money blog: Interest rate held - but Bank of England gave 'small surprise' So what are the options, and why are prices so high in the first place? How much does UK business pay for electricity? Industrial electricity prices in 2023 were 46% higher than the average of the 32 members of the International Energy Agency, a group that includes EU and G7 nations that, between them, account for 75% of global demand. \n                  Government considering measure to slash industrial energy prices\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  What is Sizewell C – and why is it so controversial?\n                 UK businesses paid an average of £258 per megawatt-hour, according to IEA data - higher than Italy (£218), France (£178) and Germany (£177), and more than four times the £65 paid on average in the USA. While wholesale prices have been driven up in the last five years by external factors including post-pandemic demand and the Ukraine war, this is not a blip - UK prices have been consistently above the IEA average for decades.  Why are prices so high? The main determinant is exposure to wholesale gas markets. Gas underpins the UK grid, reliably filling the gaps renewables and nuclear sources cannot fill. Crucially, gas also sets the price in the electricity market even when it is not the primary source of energy. The UK market uses a \"marginal pricing system\", in which the price is set by the last, and thus most expensive, unit of power required to meet demand at any one time. That means that while renewable sources, initially offered at a cheaper price, may provide the majority of power in a given period, the price for all sources is set by gas-fired power stations providing the balance of supply. Industrial electricity bills are lower in markets that are less exposed to gas. In France, gas sets the price less than 10% of the time because its fleet of nuclear power stations underpin supply. What makes up electricity bills? The biggest single element of electricity prices is wholesale gas costs, which make up 39% of the bill, according to industrial supplier SEFE. The next largest element is \"network costs\", charges imposed for using, maintaining and expanding the grid, which account for 23%. Operating costs are 2%, with VAT adding a further 20%. The remaining 16% of electricity bills is made up of \"policy costs\", levies and payments introduced over the last two decades to subsidise the construction of renewable power capacity, primarily wind power. Increasing renewable supply and storage to reduce exposure has been the long-term solution favoured by successive governments. Sir Keir Starmer's administration has a target of shifting to a \"clean power\" grid by 2030 and achieving net-zero carbon emissions by 2050, a target Kemi Badenoch describes as \"impossible\". Read more from Sky News:Government considering slashing industrial energy pricesBank of England holds rateWarm Home Discount extended Some energy-intensive industries (EII), such as chemicals, steel, and cement, already receive support, with a 60% relief on network charges and a reduction of around 10% from the British Industry Supercharger fund, which the government is considering increasing. What does business want? Business groups are calling for these policy costs to be lifted and shifted into general taxation, calculating that a 15% reduction in prices would give them a chance of competing more equitably. Make UK say cutting policy costs would cut 15% from bills, and is also proposing a \"contract for difference\" for manufacturers' electricity, a model borrowed from the renewables market. Under the plan, the government would guarantee a \"strike price\" for electricity 10% lower than the wholesale price. When prices are higher, the taxpayer would refund business, and when they are lower, industry would pay back the difference. Make UK estimate the cost to the exchequer of £3.8bn. They believe it will be cost-neutral courtesy of increased growth. The alternative, they say, is an uncompetitive manufacturing sector doomed to decline. \"We need to see the government remove those costs in the industrial strategy,\" says Make UK chief executive Stephen Phipson. \"We believe it will be cost-neutral because of the benefit to the economy of retaining manufacturing in this country. If we don't see it happen, we will risk deindustrialising the United Kingdom.\" A government spokesperson said: \"Through our sprint to clean power, we will get off the rollercoaster of fossil fuel markets - protecting business and household finances with clean, homegrown energy that we control.\""
    },
    {
        "title": "Bank of England holds rate but eyes cuts ahead despite global risks",
        "description": "The Bank of England has signalled a weakening labour market could yet trump rising global challenges to allow for more interest rate cuts in the near term.",
        "url": "https://news.sky.com/story/bank-of-england-holds-rate-but-eyes-cuts-ahead-despite-risks-13385713",
        "image_url": "https://e3.365dm.com/23/06/1920x1080/skynews-commuters-london-generic_6178623.jpg?20230605091958",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-19 07:22:00",
        "Headline": "While voting to keep Bank rate at 4.25%, Bank of England policymakers are now keeping tabs on the effects of a weakening labour market as well as global inflation challenges.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The Bank of England has signalled a weakening labour market could yet trump rising global challenges to allow for more interest rate cuts in the near term. Policymakers on the nine-member monetary policy committee (MPC) voted 7-3 to maintain Bank rate at 4.25%. There was greater support than was expected for a cut. The Bank had previously signalled that a majority on the committee were cautious about the effects of global instability - especially the on-off US trade war. Money latest: What interest rate decision means for your money But the minutes of the Bank's meeting showed there was a greater focus on a rising jobless rate and evidence that employers are shedding jobs - indicating it had dominated the meeting. It acknowledged, however, that there were potential challenges from the on-off US trade war and as a result of the Israel-Iran conflict. The barrage of warheads has already resulted in double-digit percentage spikes to oil and natural gas prices in the space of a week. \"Interest rates remain on a gradual downward path,\" governor Andrew Bailey said, while adding that there was no pre-set path. \"The world is highly unpredictable. In the UK we are seeing signs of softening in the labour market. We will be looking carefully at the extent to which those signs feed through to consumer price inflation,\" he added. The Bank maintained its core message that it would take a \"gradual\" and \"careful\" approach. \"Energy prices had risen owing to an escalation of the conflict in the Middle East. The committee would remain vigilant about these developments and their potential impact on the UK economy,\" the Bank said. The rise in the UK's jobless rate, along with recent data on payrolled employment, has been linked to a business backlash against budget measures, which kicked in in April, that saw employer national insurance contributions and minimum pay demands rise. While a weaker labour market, including a fall in vacancies, could allow room for the Bank to react through further interest rate cuts, the spectre of war in the Middle East is now clouding its rate judgements. The last thing borrowers need is an inflation spike. The UK's core measure of inflation peaked above 11% in the wake of Russa's invasion of Ukraine - giving birth to what became known as the cost of living crisis.  Inflation across the economy was driven by unprecedented spikes in natural gas costs, which pushed up not only household energy bills to record levels but those for businesses too - with the cost of goods and services reflecting those extra costs. Borrowing costs have eased, through interest rate cuts, as the pace of price growth has come down. The rate of inflation currently stands at 3.4% but was already forecast to rise in the second half of the year before the aerial bombardments between Israel and Iran had begun. LSEG data shortly after the Bank of England minutes were published showed that financial markets were expecting a quarter point cut at the Bank's next meeting in August and at least one more by the year's end. Read more:Why Middle East conflict poses new cost of living threat Commenting on the Bank's remarks, Nicholas Hyett, investment manager at Wealth Club, said: \"Conflict in the Middle East risks higher energy prices potentially pushing inflation higher - though calling the course of events there is almost certainly a mugs game, and the Bank has said that under current conditions it expects inflation to remain broadly at current levels for the rest of the year. \"The risk is that all the uncertainty leaves the Bank paralysed, with rates stuck at their current level.\""
    },
    {
        "title": "Post Office scandal redress must not only be fair - it must be fast",
        "description": "\"Exonerate and acknowledge\" say victims of the Post Office Capture scandal.",
        "url": "https://news.sky.com/story/post-office-scandal-redress-must-not-only-be-fair-it-must-be-fast-13385886",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-post-office-robinson_6945442.png?20250619130329",
        "type": "Business",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-19 15:40:00",
        "Headline": "Capture is not a separate Post Office scandal - it's part of the same one. Victims now want \"parity\" with Horizon victims when it comes to redress and quashing their convictions.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n \"Exonerate and acknowledge\" say victims of the Post Office Capture scandal. And it's easy to see why patience is wearing thin. To understand what happened with Capture, you must first understand Horizon. Both scandals centre not on flawed software alone, but how the Post Office reacted to it.  A business that used its powers to privately prosecute sub-postmasters, forcing them to pay back unexplained accounting shortfalls. Any suggestion that the system itself was at fault was dismissed. Capture is not a separate scandal - it's part of the same one. \n                  Post Office Capture scandal: Sir Alan Bates calls for those responsible for wrongful convictions to be 'brought to account'\n                 \n                  Could there be another Post Office scandal?\n                 \n                  Post Office scandal: Compensation scheme for Capture victims announced\n                 That's why Capture victims now want \"parity\" with Horizon victims when it comes to redress and exoneration. \"It should now be a given,\" says Steve Lewis, who was sacked from his job as a sub-postmaster after raising concerns about shortfalls linked to Capture software. The government has promised an Autumn 2025 redress scheme. But Steve wants proposed interim payments to be \"paid swiftly due to demographics, age, and well-being of the Capture group\". And beyond compensation lie even more urgent demands: for those wrongfully convicted under Capture to be exonerated. Many of these individuals remain ineligible for redress, their names still tarnished. They're calling for blanket exonerations - just as in the Horizon scandal - to finally quash their convictions. The judiciary will push back, undoubtedly, against this. 👉 Listen to Sky News Daily on your podcast app 👈 Read more:Call to sue government over delaysCompensation offer was 'utter disgrace'Post Office auditor under investigation But, as Steve puts it, \"time is not on our side\" for redress and exoneration. Too many Capture victims have already died without ever knowing justice - as have many Horizon victims. If governments have learned anything over the years, it's this: justice delayed is justice denied. Redress must not only be fair - it must be fast."
    },
    {
        "title": "Could there be another Post Office scandal?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/could-there-be-another-post-office-scandal-13385825",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-daily-podcast_6945916.png?20250619133641",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-19 12:39:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 The Horizon scandal gained international exposure after the ITV drama Mr Bates vs The Post Office. And now, more faulty Post Office accounting software has been uncovered, in what some are calling a second Post Office scandal. Today, the government has announced details of a compensation scheme for postmasters who suffered through using Capture in the 1990s. In today's episode, Sarah-Jane Mee is joined by news correspondent Adele Robinson, who has unearthed new evidence to show the system was faulty and speaks to families devastated by the scandal. Producer: Emily HulmeEditor: Philly Beaumont"
    },
    {
        "title": "The Sky News Business Podcast ",
        "description": "Joining Darren McCaffrey today are Sky's economics and data editor Ed Conway and Ellie Groves from State Street Global Advisors.\n",
        "url": "https://news.sky.com/story/the-sky-news-business-podcast-13385800",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-19 11:45:00",
        "Headline": "No subtitle found",
        "Content": "Joining Darren McCaffrey today are Sky's economics and data editor Ed Conway and Ellie Groves from State Street Global Advisors.\n :: Listen and subscribe to the Sky News Business Podcast here."
    },
    {
        "title": "Labour MP Vicky Foxcroft quits as government whip over cuts to disability benefits",
        "description": "Labour MP Vicky Foxcroft has quit her job as a government whip in opposition to the government's plans to cut disability benefits.",
        "url": "https://news.sky.com/story/labour-mp-vicky-foxcroft-quits-as-government-whip-over-cuts-to-disability-benefits-13385986",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-vicky-foxcroft-labour_6946322.jpg?20250619225556",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-19 21:45:00",
        "Headline": "The Labour MP wrote in a letter to the prime minister that she could not vote \"for reforms which include cuts to disabled people's finances\".",
        "Content": " Labour MP Vicky Foxcroft has quit her job as a government whip in opposition to the government's plans to cut disability benefits. She wrote in a letter to the prime minister that she could not vote \"for reforms which include cuts to disabled people's finances\". The former shadow minister for disabled people becomes the first MP to quit a government job over the controversial welfare reform plans that have seen over 100 Labour MPs publicly express concern over the proposals. A government spokesperson defended the reforms as \"principled\" and insisted they will protect the vulnerable. Politics latest: Defence secretary warns of 'moment of real danger' The MP for Lewisham North wrote that the benefits system is in \"desperate need of reform\", but argued this is not the way to do it. She said: \"I absolutely understand the need to address the ever-increasing welfare bill in these difficult economic times, but I have always believed this could and should be done by supporting more disabled people into work. \n                  Is Labour facing big backlash over welfare reforms?\n                 \n                  Battle to convince MPs to back benefit cuts to more than three million households \n                 \n                  First Minister John Swinney says winter fuel payment in Scotland 'will not be less than UK benefit'\n                 \"I do not believe that cuts to personal independence payment (PIP) and the health element of Universal Credit should be part of the solution.\" Ms Foxcroft said she has \"wrestled\" with the decision over whether to resign, but said: \"Sadly it now seems that we are not going to get the changes I desperately wanted to see. \"I therefore tender my resignation as I know I will not be able to do the job that is required of me and whip - or indeed vote - for reforms which include cuts to disabled people's finances.\" She has received public support from a number of fellow Labour MPs, who praised her \"principled\" stand on this issue. 'Moral case for change' The government published its bill earlier this week to tighten the eligibility for PIP benefits, and also cuts to the sickness-related portion of Universal Credit. Ministers say these plans will cut £5bn from the welfare budget that is ballooning.  The cost of long-term sickness and disability benefits for working-age people has risen by £20bn since the pandemic and is forecast to hit £70bn over the next five years. Ministers have said there is also a moral case for change, with one in eight young people not in education, training, or employment - prompting fears of a \"wasted generation\". But disability groups say they fear an increase in suicides and mental health conditions. Read more from Sky News:Why cancer patient is praying assisted dying bill passes major voteCompensation scheme for Capture victims announced The government's own assessment forecast an extra 250,000 people could be pushed into poverty - including 50,000 children. It did not include the impact of people moving into work. A government spokesperson said: \"This Labour government was elected to deliver change. The broken welfare system we inherited is failing the sick and most vulnerable and holding too many young people back. It is fair and responsible to fix it. \"Our principled reforms will ensure those who can work should, that those who want to work are properly supported, and that those with most severe disabilities and health conditions are protected.\""
    },
    {
        "title": "Whitehall officials tried to convince Lord Gove to cover up grooming scandal, he tells Sky News",
        "description": "Whitehall officials tried to convince Lord Michael Gove to go to court to cover up details of a report into the grooming scandal in 2011, he has said, confirming Sky News reporting earlier this week.",
        "url": "https://news.sky.com/story/whitehall-officials-tried-to-convince-lord-gove-to-cover-up-grooming-scandal-he-tells-sky-news-13385939",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-lord-gove_6946258.jpg?20250619204035",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-19 18:22:00",
        "Headline": "The former senior cabinet minister admitted that it is \"undoubtedly the case that more should have been done\" to prevent the abuse of young girls.",
        "Content": " Whitehall officials tried to convince Lord Michael Gove to go to court to cover up details of a report into the grooming scandal in 2011, he has said, confirming Sky News reporting earlier this week. Speaking to Sky's Politics Hub With Sophy Ridge, the former senior cabinet minister said it is \"undoubtedly the case that more should have been done\" to prevent the abuse of young girls in Britain, admitting that it weighs on him. The allegations of an attempted cover-up were first made to Sky News by former Downing Street adviser Dominic Cummings in an interview with Sky News, and the claims were substantiated by other sources as well. Mr Cummings was working for Lord Gove, who was then education secretary. Politics latest: Badenoch says UK should 'support Israel' Lord Gove explained that in 2011, he learned that the late Times journalist Andrew Norfolk, who he described as \"a heroic reporter who did more than anyone to initially uncover this scandal\", was seeking to publish details of a report from Rotherham Council about the abuse and grooming of young girls. He said: \"Rotherham Council wanted to stop that happening. They wanted to go to court to prevent him publishing some details, and we in the Department for Education were asked by the council, 'would we join in, would we be a party to that court action to stop it?' \"And I had to look at the case, advised by Dominic [Cummings] and by others, and there were some within the department, some officials who said, 'be cautious, don't allow this to be published, there may be risks for relatives of the victims concerned.\" \n                  Is Kemi Badenoch's grooming gangs outrage just politics or does she really care?\n                 \n                  'Britain's darkest secret': Grooming survivor calls for apology from Starmer\n                 \n                  Grooming gangs report author says 'do-gooders' giving racists 'more ammunition'\n                  Rotherham Council also argued that publication may pose \"risks\" to the process of \"improving in the way in which it handles\" grooming cases, he continued. The judicial review wanted by officials would have asked a judge to decide about the lawfulness of The Times' publication plans and the consequences that would flow from this information entering the public domain. But Lord Gove said: \"My view at the time, advised by Dominic and by others within the department, was that it was definitely better for it to be published.\" \"So we said to Rotherham, we will join the case, but we're joining it on the side of the Times and Andrew Norfolk because we believe in transparency.\"  'Tough questions' for Whitehall Lord Gove went on to say that a national inquiry could see some \"tough questions\" asked of the Home Office about its culture and its interactions with the police. But those questions will also be posed to two departments he led - the Department for Local Government and the Department of Education, and he said: \"I think it's right that there should be, because the nature and scale of what the victims have endured means that there's an obligation on all of us who've been in any form of elected office to be honest and unsparing in looking at what went on.\" He said he \"certainly didn't have the knowledge at my command that we now do about the widespread nature of this activity\". 'Not nearly enough' progress made Sophy Ridge put to Lord Gove that despite commissioning a report on what was happening to girls in care, and not seeking to block the publication of Andrew Norfolk's reporting, he still failed to make change. He replied: \"Yes, so it is undoubtedly the case that more should have been done.\" Read more on grooming gangs:What we do and don't know from the dataA timeline of the scandal He admitted that it \"absolutely\" weighs on him, and that \"not nearly enough\" progress was made on the protection of vulnerable girls. \"With the benefit of hindsight, I do wish that I had been more vehement in trying to persuade people to take appropriate action,\" he said.  Local government 'sought to deny scale' of scandal The now Spectator editor went on to say that there was \"pushback, particularly but not exclusively, from those in local government\" to subsequent questions about cultural background, and he said \"local councillors and others sought to deny the scale of what was happening and particularly, sought to deny questioning about the identity and the background of the perpetrators\". 👉 Listen to Sky News Daily on your podcast app 👈 He continued: \"I think the right thing to do is for everyone to acknowledge that sometimes there were people who were acting from noble motives, who did not want to increase ethnic and racial anxieties, who did not to fan far-right flames, and thought that it was better to step away from the really grim reality of what was going on. \"I can understand that. But ultimately, that didn't serve anyone. It did not serve the victims.\" The Department for Education and Rotherham Council did not respond when approached for comment earlier this week on the claims first made by Dominic Cummings, revealed by Sky News."
    },
    {
        "title": "MP who introduced assisted dying bill 'confident' it will be voted through",
        "description": "The politician who introduced the assisted dying bill has said she is \"confident\" MPs will push it through to the next stage on Friday.",
        "url": "https://news.sky.com/story/mp-who-introduced-assisted-dying-bill-confident-it-will-be-voted-through-13385762",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-kim-leadbeater-assisted-dying_6945690.jpg?20250619090528",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-19 09:57:00",
        "Headline": "The assisted dying bill will go to a major vote on Friday, which could see it in the House of Lords if MPs vote it through.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The politician who introduced the assisted dying bill has said she is \"confident\" MPs will push it through to the next stage on Friday. Speaking at a news conference ahead of a Commons vote, Kim Leadbeater said: \"I do feel confident we can get through tomorrow successfully.\" If new amendments are voted through on Friday, the bill to give some terminally ill adults the right to end their lives will get closer to becoming law as it will go through to the next stage in the House of Lords. Politics latest: PM should decide if MPs get vote on military action Ms Leadbeater, who introduced the bill in October last year, said if MPs do not vote it through on Friday, \"it could be another decade before this issue is brought back to parliament\". But she said there was a \"good majority\" who voted for the bill at the last major vote, the second reading in November, when MPs voted it through by 330 to 275. \"There might be some small movement in the middle, some people might change their mind or will change their mind the other way,\" she said. \n                  Why cancer patient is praying assisted dying bill passes major vote\n                 \n                  Assisted dying bill does 'not meet needs of patients', says Royal College of Psychiatrists\n                 \n                  Palpable anger as both sides of assisted dying debate gather in Parliament Square\n                 \"But fundamentally, I do not anticipate that that majority would be heavily eroded.\" A new YouGov poll found 72% of Britons supported the bill as it stands, including 59% of those who say they support assisted dying in principle but oppose it in practice, and 67% were opposed to the principle of euthanasia but are willing to back it in practice.  Criticism by doctors The Labour MP was joined by bereaved and terminally ill people at Thursday's news conference as she made her case for a change in the law. The proposed legislation would allow terminally ill adults, with fewer than six months to live, to apply for an assisted death, subject to approval by two doctors and a panel featuring a social worker, senior legal figure and psychiatrist. Recently, the Royal College of Psychiatrists, the Royal College of Pathologists and the Royal College of Physicians have raised concerns about the bill. The Royal College of Psychiatrists said the bill, in its current form, did \"not meet the needs of patients\". It has also expressed concern over the shortage of qualified psychiatrists to take part in assisted dying panels. Read more:Assisted dying bill does not meet needs of patients, says Royal College of PsychiatristsWhy cancer patient is praying assisted dying bill passes major vote But Ms Leadbeater said doctors and psychiatrists have their individual views on assisted dying and royal colleges have, over the years, been neutral because of that. \"My door is open, so if they have got concerns, they can come and speak to me about those concerns,\" she said. \"But what I would say is they were very keen that there was psychiatric involvement in the process, and that's why I included it. And I do think that's important.\" Health correspondent On the eve of one of the most important votes this current cohort of MPs will likely ever cast, it was a bold, daring claim to make. \n\n  Asked by a reporter at a news conference convened in a hot, crowded room deep inside the parliamentary estate if tomorrow's assisted dying vote was likely to pass, Kim Leadbeater replied, confidently, yes, her controversial bill would be carried.  It would take a sizeable shift to swing it the other way, and opponents of the bill have been trying very hard to convince wavering MPs to do just that. \n\n This week alone, there have been significant interventions from the Royal Colleges of Psychiatrists and Physicians - two professions that would be at the heart of delivering this end of life care and key in making the life or death decisions.  The setting might have been political, but the message was much less so. Ms Leadbeater was flanked by supporters with the most compelling, heart-wrenching testimonies. Each told their own powerful story: of lonely, painful deaths, carefully planned journeys to Switzerland's Dignitas clinic kept secret from loved ones, and the life limiting deterioration in health and dreading what new misery the next few weeks or months would bring. It was a powerful reminder to MPs that away from the parliamentary process and bill scrutiny, ultimately, this is what the legislation is all about. There was a (questionable) assurance from Lord Falconer that the House of Lords would respect the will of the people and the bill will pass through the upper chamber without difficulty. \n\n The timetable is tight, but it appears the country is ready for change - a historic one. On Friday, MPs will vote on a number of amendments proposed by Ms Leadbeater after months of discussions with the assisted dying committee, made up of MPs both for and against the bill. At the start of the session they will vote on a person not being eligible for assisted dying if their wish to end their life was substantially motivated by factors such as not wanting to be a burden, a mental disorder, a disability, financial considerations, a lack of access to care, or suicidal ideation. The Speaker has indicated he will also choose these amendments for MPs to vote on: • Supported by Ms Leadbeater - Requiring the government to publish an assessment of palliative and end-of-life care within a year of the bill passing • Supported by Ms Leadbeater - A person cannot be considered terminally ill solely because they voluntarily stopped eating or drinking • Not supported by Ms Leadbeater - Disapply the presumption a person has capacity unless the opposite is established • Not supported by Ms Leadbeater - Prevent section 1 of the NHS Act 2006, which sets out the NHS' purpose, from being amended by regulations."
    },
    {
        "title": "If Trump strikes, what will Starmer do? ",
        "description": " <a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/if-trump-strikes-what-will-starmer-do-13385697",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-19 05:23:00",
        "Headline": "No subtitle found",
        "Content": " 👉Listen to Politics at Sam and Anne's on your podcast app👈  On this episode - what advice is Sir Keir Starmer getting over Britain's potential involvement in the Iran-Israel conflict? There are reports the Attorney General's legal advice to the PM is to limit what it does to protect its allies from attack - Sky News' Sam Coates and Politico's Anne McElvoy discuss the implications of that. Plus, we hear Foreign Secretary David Lammy will get a meeting with his Iranian counterpart as part of a diplomatic push to prevent war. Foreign ministers from Germany and France will also join the talks in Geneva."
    },
    {
        "title": "Post Office scandal: Compensation scheme for Capture victims announced",
        "description": "The government has announced a compensation scheme for postmasters who suffered financial shortfalls due to a faulty Post Office IT system that preceded the Horizon scandal.",
        "url": "https://news.sky.com/story/post-office-scandal-compensation-scheme-for-capture-victims-announced-13385795",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pat-owen-david-owen_6839159.png?20250225115849",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-19 11:20:00",
        "Headline": "It comes as Sky News revealed that a damning report into the system has been unearthed after nearly 30 years and could help overturn criminal convictions.",
        "Content": "The government has announced a compensation scheme for postmasters who suffered financial shortfalls due to a faulty Post Office IT system that preceded the Horizon scandal. The Capture software was a faulty computer system used by postmasters in more than 2,000 branches in the 1990s. It comes as Sky News revealed that a damning report into the system has been unearthed after nearly 30 years and could help overturn criminal convictions. In response to the report, the chair of the business and trade committee has written to the chief executive of the Post Office to ask for \"full disclosure\" of information it has on Capture convictions and prosecutions.  Announcing its redress scheme, the government said it would \"provide fair compensation\" for those who suffered financial shortfalls due to the Capture software between 1992 and 2000. The scheme is expected to open for applications in Autumn 2025 and will have an \"initial phased rollout\" for 150 claimants to ensure the process is \"fair, proportionate and accessible before wider implementation\". Post Office minister Gareth Thomas said: \"We are committed to delivering fair and swift redress for all postmasters affected by Post Office software failures. \"Today's announcement represents another important step in righting the wrongs of the past and rebuilding trust in the Post Office.\" Read more from Sky News:Amber heat health alert issued across EnglandI had to go back to help Gaza's hospitals, says British surgeonSpaceX rocket being tested explodes into giant fireball  The government said all eligible claims will be reviewed by an independent panel of experts operating entirely separately from the government. It said the panel will take a holistic view of each claim, avoiding drawn-out legal processes and providing fair redress even where evidence is low. It will also use a balance of probabilities standard of proof, recommend appropriate payment levels and provide claimants the right to appeal in certain circumstances."
    },
    {
        "title": "Government considering measure to slash industrial energy prices",
        "description": "Ministers are considering a commitment to cut soaring industrial energy prices for British companies to the same level enjoyed by competitors in France and Germany as part of its industrial strategy.",
        "url": "https://news.sky.com/story/government-considering-measure-to-slash-industrial-energy-prices-13385856",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-vauxhall-cars-manufacturing_6335198.jpg?20231025142155",
        "type": "Politics",
        "Author": "Paul Kelso",
        "Date Published": "2025-06-19 13:55:00",
        "Headline": "Businesses have demanded a cut to bills as Britain has the highest industrial electricity prices in the G7.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Ministers are considering a commitment to cut soaring industrial energy prices for British companies to the same level enjoyed by competitors in France and Germany as part of its industrial strategy. Sky News understands proposals to make energy prices more competitive are at the heart of final discussions between the Department for Business and Trade and the Treasury ahead of the publication of its industrial strategy on Monday. Industrial electricity prices in the UK are the highest in the G7 and 46% above the median for the 32 member states of the International Energy Agency, which account for 75% of global demand. In 2023, British businesses paid £258 per megawatt-hour for electricity compared to £178 in France and £177 in Germany, according to IEA data. Matching those prices will require a reduction of around 27% at a cost of several billion pounds. Money blog: Interest rate held - but Bank of England gave 'small surprise' Earlier this month, automotive giant Nissan said UK energy prices make its Sunderland plant its most expensive in the world. Business secretary Jonathan Reynolds is understood to be sympathetic to business concerns, and chancellor Rachel Reeves told the CBI's annual dinner the issue of energy prices \"is a question we know we need to answer\". \n                  Why are UK industrial electricity prices so high - and what can be done about it?\n                 \n                  Bosses of Octopus Energy and SSE clash over 'postcode pricing' proposals\n                 \n                  What is Sizewell C – and why is it so controversial?\n                 Extending relief  While around 350 companies in energy-intensive industries, including steel, ceramics and cement, enjoy some relief from prices through the energy supercharger scheme, which refunds 60% of network charges and is expected to rise to 90%, there is currently no support for manufacturers. Sky News understands ministers are considering introducing a similar scheme to support the 200,000 manufacturing businesses in the UK. Cutting network costs entirely could save more than 20% from electricity prices. Explainer: Why are UK industrial electricity prices so high? The mechanism for delivering support is expected to require consultation before being introduced to ensure only businesses for whom energy is a central cost would benefit. This could be based on the proportion of outgoings spent on energy bills. It is not clear how the scheme would be funded, but the existing industrial supercharger is paid for by a levy on energy suppliers that is ultimately passed on to customers. A central demand  Bringing down prices, particularly for electricity, has been the central demand of business and industry groups, with Make UK warning high prices are rendering businesses uncompetitive and risk \"deindustrialising\" the UK. The primary driver of high electricity costs in the UK is wholesale gas, which both underpins the grid and sets the price in the market, even in periods when renewables provide the majority of supply. Why are costs so high? Wholesale prices account for around 39% of bills, with operating costs and network charges - the cost of using and maintaining the grid - making up another 25%, and VAT 20%. Business groups, including the manufacturers group Make UK, have called for a reduction in those additional charges, as well as the so-called policy costs that make up the final 16% of bills. These are made up of levies and charges introduced by successive governments to encourage and underwrite the construction of renewable sources of power. Read more from Sky News:Bank of England holds rate Warm Home Discount extendedWhy Middle East conflict poses new cost of living threat Make UK estimate that shifting policy costs into general taxation would cost around £3.8bn, but pay for itself over time in increased growth. Government sources confirmed that energy prices are a central issue that the industrial strategy will address, but said no final policy decisions have been agreed. The industrial strategy, which is delayed from its scheduled publication earlier this month, will set out the government's plans to support eight sectors identified as having high-growth potential, including advanced manufacturing, life sciences, defence and creative industries."
    },
    {
        "title": "Govt urged to keep citizenship promise to Hong Kongers - after threat to double timeline",
        "description": "The government should honour its promise to Hong Kongers to gain settled status after five years - not a proposed 10 years, MPs have urged.",
        "url": "https://news.sky.com/story/govt-urged-to-keep-promise-to-hong-kongers-after-threat-to-double-timeline-to-british-citizenship-13385790",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-passport-british_6945951.jpg?20250619140442",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-06-19 11:19:00",
        "Headline": "Sir Keir Starmer announced in May he would be doubling the time immigrants have to be in the UK before they can get settled status.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The government should honour its promise to Hong Kongers to gain settled status after five years - not a proposed 10 years, MPs have urged. People who fled Hong Kong for the UK on the British National Overseas (BNO) humanitarian visa say they have been left in limbo after the immigration white paper last month said the qualifying period for indefinite leave to remain (settled status) would be extended from five years to 10 years. The government has said it is consulting on whether Hong Kongers will be included in that extension, but has not given a timeline for when it will decide. Hong Kongers have been able to come to the UK under the BNO visa since 2021, with the promise of gaining the right to work and live without any limits (settled status) after five years, then to apply for British citizenship a year later. MPs with large Hong Kong populations in their constituencies are calling for the government to honour its initial promise. They say changing it could undermine confidence in the UK's immigration system and that the country has a \"duty\" to welcome those fleeing repression. Read more: What are Sir Keir Starmer's new immigration rules? \n                  Air India Boeing 787-8 Dreamliner turns around mid-flight after technical issue\n                 \n                  Let students who fled Hong Kong to go to UK pay same university fees as Britons, urge MPs\n                 \n                  Liberal Democrat MP Wera Hobhouse denied entry to Hong Kong says it should be 'wake-up call' to all parliamentarians\n                 Lord Patten, the last governor of Hong Kong and patron of campaign group Hong Kong Watch, said \"rewriting the terms of the promise would be disastrous for the UK's legitimacy on the world stage\". Hong Kongers have told Sky News they have had sleepless nights since the announcement, with many concerned about the government's commitment to them and the financial implications of having to pay international university fees for their children because of their status. Govt is breaching relationship Stella, 50, from Sutton, moved to the UK in 2021 and her two sons are set to go to university from next year, when they should have settled status and pay home fees, but will have to pay international fees for five years if the period is doubled. She said: \"This was a binding relationship, we uprooted everything in Hong Kong, packing up our whole life was not an easy thing, the cultural and language barriers, the UK economy isn't good - there are many challenges, but we've been so dedicated to integrating and planting our roots here. \"Now the government is trying to breach the original relationship, it's made us feel very uncertain. \"I agree on strengthening the border but why don't they concentrate on illegal immigrants? We contribute financially and socially, BNO holders should not be the target group.\" Read more:Let students who fled Hong Kong pay same university fees as Britons, urge MPs My son's fencing career is at risk Kolman, 55, came to the UK in 2022, and said extending the five years could be the difference between his son being able to compete for Team GB in fencing or not. \"My son is at uni now and was invited to join the national team but, because of his status he can't, but he could in a couple of years with settled status,\" he said. \"If it gets extended to 10 years, he may already be in the last chapter of his sporting life.\"  UK integrity will be same as Hong Kong Ivan, 50, from Sutton, came to the UK in 2022 with his wife and two sons and said he was anxious and his son might have to go to university in Hong Kong because of the international fees. He said: \"I am disappointed. The reason I came to the UK was the loss of integrity of the Hong Kong government, but if the settled status period is doubled with such short notice, I think the integrity of the UK government will be the same as the Hong Kong government. \"The terms were quite clear. \"My quality of sleep is really bad recently as I'm so anxious, my whole plan will be destroyed, I've just bought a house in Sutton. My biggest concern is the university fees and the NHS fee, which is a lot of money.\" UK has duty to Hong Kongers James Naish, the Labour MP for Rushcliffe near Nottingham, said the UK \"has a duty to welcome those fleeing repression in Hong Kong\". \"To fail to maintain the five-year pathway for BN(O) visa holders would potentially permanently damage the government's standing with Hongkongers, hundreds of thousands of whom have placed their trust in the UK and uprooted their lives to seek a safe haven in Britain,\" he added. A vital lifeline Nadia Whittome, the Labour MP for Nottingham East, said the five years to settled status had \"provided a vital lifeline to those fleeing repression\" and said it \"isn't fair\" to change the time period now. \"A 10-year wait for settled status would have huge practical implications for people who are eager to rebuild their lives in our country,\" she said. \"We must honour the terms that Hong Kongers, and other migrants, have arrived on.\" Moral targets Clive Jones, the Lib Dem MP for Wokingham, said: \"This isn't about migration targets, it's about moral targets. \"Changing the rules halfway through undermines confidence in our immigration system. \"We lose our credibility if we fail to protect those we welcomed, and we gain nothing by disrupting the lives of those already contributing.\" A Home Office spokesperson said: \"We are committed to supporting members of the Hong Kong community who have relocated to the UK and those who may come here in future. \"Further details of all measures announced in the immigration white paper will be set out in due course.\""
    },
    {
        "title": "Scotland's First Minister John Swinney defends new guidance on tackling pupil behaviour",
        "description": "Scotland's first minister has defended guidance issued to schools on how to deal with violent and aggressive behaviour from pupils amid criticism a stricter approach is required to \"restore discipline\".",
        "url": "https://news.sky.com/story/scotlands-first-minister-john-swinney-defends-new-guidance-on-tackling-pupil-behaviour-13385785",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-snp-first-minister_6945843.jpg?20250619123109",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-06-19 11:21:00",
        "Headline": "The Scottish government published new guidance earlier this week which said exclusion should only be used as a \"last resort\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Scotland's first minister has defended guidance issued to schools on how to deal with violent and aggressive behaviour from pupils amid criticism a stricter approach is required to \"restore discipline\". The Scottish government published new guidance earlier this week following calls from teachers for help to tackle the issue. In her foreword, Education Secretary Jenny Gilruth said that exclusion should only be used as a \"last resort\". The guidance aims to focus on improving outcomes by \"reinforcing positive behaviour and working to reduce the likelihood of negative behaviour occurring in future\". It comes after a survey by the NASUWT union in March found 83% of members believed pupil violence and aggression had increased in the last year. At First Minister's Questions on Thursday, the leader of the Scottish Conservatives said violent and disruptive behaviour in schools \"is getting worse\". MSP Russell Findlay added: \"A small minority of pupils prevent the majority from learning in peace and in safety. \n                  University of Dundee bosses quit after 'scathing' report into financial crisis\n                 \n                  Older teenagers should have mandatory lessons on domestic abuse, says survivor\n                 \n                  Ruling over VAT on private school fees 'huge disappointment', say campaigners\n                 \"Some teachers feel unsafe. Many feel unsupported. The SNP's naive and weak approach fails absolutely everyone.\" The Scottish government said the new guidance had been developed with input from headteachers, teaching unions, local government and educational psychologists. Mr Findlay said it was \"complicated and confusing\", branding it \"49 pages of tedious, hand-wringing nonsense\". He also criticised some of the suggested measures, including giving \"violent pupils laminated bullet points, telling them to think about their behaviour\", and tackling unsafe behaviour by having \"a conversation to jointly problem solve with the child\". Mr Findlay added: \"And it also says that disruptive pupils should be allowed to leave class two minutes early, which to me sounds like a reward rather than a punishment.\" The MSP said his party had \"long argued that a stricter approach is necessary to restore discipline in schools\" as he called on the first minister to empower teachers to be able to do so. He continued: \"We believe in exclusions for violence because they protect staff and pupils, and because they work.\" Read more from Sky News:Parents 'undermining staff by excusing poor behaviour'School leaders say 'job has impacted mental health' In response, John Swinney agreed that disruptive behaviour in schools was the product of a \"minority of pupils\". But the first minister added: \"I don't think for a moment that Mr Findlay's presentation of the guidance is in any way, shape or form representative of what is actually there.\" Mr Swinney argued the guidance had been designed to de-escalate and resolve situations to ensure the youngsters are well supported to \"fulfil their potential\". He explained: \"Because if young people are unable to participate in their education, they are unlikely to go into good outcomes in our society, and we will simply repeat the difficulties that we've seen for many years of young people who do not go on to positive destinations.\" Mr Swinney said there had been 11,676 exclusions in 2022/23. Although lower than what was recorded in 2018/19, the first minister said \"it is still a very high level of exclusion of young people from our schools\". Mr Swinney pointed to a summit he recently hosted in an attempt to curb school violence, where he said none of the attendees pushed for increased exclusions. He said: \"So, what we are getting from Russell Findlay today is a demonisation of young people and a failure to address the mechanisms and the interventions required to solve a difficult issue in our society.\" Mr Findlay - a former crime journalist - has repeatedly criticised the SNP's \"soft touch justice regime\" and in recent months raised the issue of organised crime gangs \"grooming\" vulnerable youngsters as they face a \"reduced risk\" of being jailed due to the nation's sentencing guidelines for under-25s. Mr Swinney said exclusions can have \"negative consequences\", explaining: \"If a young person is excluded from school, they are not in the safe environment of school. \"They are therefore likely to be out on the streets and therefore potentially able to become involved in some of the criminal activity that Mr Findlay himself has put to me within the last fortnight at First Minister's Questions as being a risk to which young people are exposed.\""
    },
    {
        "title": "Starmer's artificial intelligence adviser steps down",
        "description": "Sir Keir Starmer's artificial intelligence adviser is standing aside after six months for family reasons.",
        "url": "https://news.sky.com/story/starmers-artificial-intelligence-adviser-steps-down-13385851",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-matt-clifford-matthew_6946128.png?20250619172325",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-06-19 13:44:00",
        "Headline": "Matt Clifford, who had been working on the government's AI strategy, is standing down for family reasons, but is understood to be open to returning to Number 10 at a later point.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Sir Keir Starmer's artificial intelligence adviser is standing aside after six months for family reasons. Matt Clifford continues to have a good relationship with Downing Street, and Sky News understands he would potentially be open to a return to help the government in the future. A government spokesperson told Sky News: \"Matt Clifford is stepping down from his role as the prime minister's AI opportunities advisor for personal reasons. \"The prime minister has thanked him for his dedicated work to deliver and implement the AI opportunities action plan. We will be building on this work to bolster AI expertise across government and cement the UK's position as a world leader in AI.\" Politics latest: PM calls for 'de-escalation' in Middle East Mr Clifford told Sky News: \"It's been a privilege to spend the last year first writing and then implementing the AI opportunities action plan. \"I'm grateful to the prime minister and the government for this opportunity to serve and am hugely optimistic about the UK's potential to be an AI superpower. \"For family reasons, I will step back from my role as the prime minister's adviser on AI opportunities at the end of July, but I'm delighted that this important work will continue across government.\" Mr Clifford was the lead reviewer of the AI opportunities action plan, as well as being a member of the AI Safety Institute advisory board. As part of his backing of AI, Sir Keir accepted all 50 recommendations made by Mr Clifford in the action plan.  Read more on Starmer's AI plans:UK to 'mainline AI in the veins' says PMLet's be 'AI maker not taker'UK tech firms agree takeovers  Mr Clifford was appointed as Sir Keir's AI opportunities adviser in January 2025. His remit included advising on policy to grow the UK AI sector, including supporting uptake. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Mr Clifford was also working to help on strategies to attract AI talent and entrepreneurs to the UK. He worked with the previous Conservative government on setting up the AI Safety Institute and setting up the 2023 AI Safety Summit."
    },
    {
        "title": "SpaceX rocket being tested explodes into giant fireball before launch in Texas",
        "description": "A SpaceX rocket has exploded before launch - sending a dramatic fireball high into the sky.",
        "url": "https://news.sky.com/story/spacex-rocket-being-tested-explodes-into-giant-fireball-before-launch-in-texas-13385700",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spacex-starship-starbase_6945682.png?20250619090730",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-19 05:59:00",
        "Headline": "Starship 36 was preparing for its 10th test flight when the rocket burst into flames.",
        "Content": " A SpaceX rocket has exploded before launch - sending a dramatic fireball high into the sky. Starship 36 was preparing for its 10th test flight at Starbase - SpaceX's launch site at the southern tip of Texas - when the incident occurred on Wednesday evening. During take off procedures just after 11pm local time, the rocket exploded into a giant fireball. The company described the incident as a \"major anomaly\". In a statement, it added: \"A safety clear area around the site was maintained throughout the operation and all personnel are safe and accounted for. \"Our Starbase team is actively working to safe the test site and the immediate surrounding area in conjunction with local officials. \"There are no hazards to residents in surrounding communities, and we ask that individuals do not attempt to approach the area while safing operations continue.\" Read more from Sky News:Trump: I 'may or may not' strike IranElon Musk posts 'drug test results' It marks the latest failure for the space flight company, which hopes that Starship will one day be used to ferry people and cargo to Mars. Last month, a Starship test flight began spinning out of control about 30 minutes after its launch because of fuel leaks - meaning it broke up on re-entry into the Earth's atmosphere.  That followed explosive past failures in January, where a rocket blew up about eight minutes after take-off, and March, which forced flights in Florida to be temporarily grounded. SpaceX CEO Elon Musk said in May that despite the rocket failure, the test flight was a \"big improvement\". A day later, he said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of 2026."
    },
    {
        "title": "'Pioneering' new scanner used for brain tumour patients trialled in world-first",
        "description": "A \"pioneering\" new scanner derived from MRI technology could be used to track brain cancer spread and lead to improved treatment for patients, scientists have said.",
        "url": "https://news.sky.com/story/pioneering-new-scanner-used-for-brain-tumour-patients-trialled-in-world-first-13385740",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-fci-field-cycling-imaging_6945718.jpg?20250619094831",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-19 08:39:00",
        "Headline": "Field cycling imaging (FCI) derives from MRI but can work at low and ultra-low magnetic fields, which means it is capable of seeing how organs are affected by diseases in ways that were previously not possible.",
        "Content": "A \"pioneering\" new scanner derived from MRI technology could be used to track brain cancer spread and lead to improved treatment for patients, scientists have said. Researchers at the University of Aberdeen and NHS Grampian have been awarded £350,000 funding by the Scottish government to generate never-before-seen images of glioblastoma brain tumours. It is hoped the technology will improve treatment and quality of life for patients by investigating a new way to scan the tumours. Glioblastoma is the most common and aggressive type of brain tumour with more than 3,000 new patients in the UK diagnosed each year. The University of Aberdeen said half of all patients die within 15 months of diagnosis even after extensive surgery, radiotherapy and chemotherapy. Field cycling imaging (FCI) is a new and specialist type of low-field MRI scan pioneered in Aberdeen and has already been found to be effective in detecting tumours in breast tissue and brain damage in stroke patients. It is hoped it can now be used to help brain tumour patients. Full body MRI scanners were invented at the Scottish university 50 years ago, but the FCI scanner is the only one of its type used on patients anywhere in the world. The FCI derives from MRI but can work at low and ultra-low magnetic fields, which means it is capable of seeing how organs are affected by diseases in ways that were previously not possible. It can also vary the strength of the magnetic field during the patient's scan - acting like multiple scanners and extracting more information about the tissues. The tech can detect tumours without having to inject dye into the body, which can be associated with kidney damage and allergic reactions in some patients. Those involved in the project will scan glioblastoma patients undergoing chemotherapy after surgery and chemoradiotherapy. It is hoped the research will establish that, unlike conventional MRI scans, FCI can tell the difference between tumour growth and progression, and \"pseudo-progression\" which looks like tumour but is not cancerous tissue, which could improve care and quality of life. Read more from Sky News:New leukaemia treatment hailed as 'milestone'Genetic testing firm fined millions by watchdog The new tech was described as \"another example of the pioneering work coming out of the University of Aberdeen\", by the charity Friends of ANCHOR. Professor Anne Kiltie, who is leading the study, said: \"If we can detect true tumour progression early, we can swap the patient to a potentially more beneficial type of chemotherapy. \"Also, being able to verify that a patient has pseudo-progression will prevent effective chemotherapy being stopped too early, because it was thought that the tumour has progressed, thus worsening prognosis. \"Providing certainty will also reduce anxiety for both patients and relatives and improve the quality of life of patients. \"Importantly, having a reliable method to identify progressive disease will allow development and more precise evaluation of emerging potential treatments. This is of particular importance as patients currently have a limited choice of treatments for combating their cancer. \"Ultimately, this study and related future work will improve quality, effectiveness and healthcare cost-effectiveness in the treatment of glioblastoma patients across Scotland and beyond.\""
    },
    {
        "title": "Director Danny Boyle on how 28 Years Later could be seen as an allegory for Brexit",
        "description": "Director Danny Boyle has said his latest film 28 Years Later could be seen as an allegory for Brexit.",
        "url": "https://news.sky.com/story/director-danny-boyle-on-how-28-years-later-could-be-seen-as-an-allegory-for-brexit-13385818",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-28-years-later-alfie-williams_6946019.jpg?20250619152208",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-06-19 23:01:00",
        "Headline": "Boyle's film also features a digital recreation of the Sycamore Gap tree, which the director says he hopes will be \"a wonderful tribute\" to Northumberland's iconic tree.",
        "Content": "\n          Arts and entertainment correspondent\n        Director Danny Boyle has said his latest film 28 Years Later could be seen as an allegory for Brexit. Boyle's original zombie horror, 28 Days Later, was a groundbreaking film which revitalised the genre. Now, his follow-up 28 Years Later gives an insight into how much of humanity is still standing almost three decades after the deadly Rage virus took hold. \"It's a very ambitious picture of what's happened to the British mainland 28 years after the original infection,\" he tells Sky News. The film shows how mainland Europe has cut Britain off, the country is isolated, with the remaining population left to fend for itself, which Boyle says could be seen as an allegory for Brexit or the pandemic. \"There is an element of that… horror is a wonderful genre because you can put transparencies against it, you can put COVID against it… you can put Brexit against it as well, and you read things into it like that and it's deliciously flexible,\" he says. Central to this new story is a new character, a young boy called Spike, played by newcomer Alfie Williams, whose character has been raised on a remote coastal Island with Jodie Comer starring as his mum. \n                  Most anticipated films coming to cinemas in 2025\n                 \n                  Zombie classic 28 Days Later set for new sequel under Danny Boyle and Alex Garland\n                 \n                  Danny Boyle dismisses conspiracy theorist 'rabbit holes' in adaptation of The Matrix\n                 \"To get to see how Danny and his team work on set and then see the final product, it's been a dream,\" Comer says. Fans won't have to wait quite so long for the follow-up to this, with a triptych of films planned this time around. While the second has already been shot and is due out next January, the really scary thing for Boyle currently is securing the financing to make the last instalment. \"We're hoping we do well enough to get the third film financed... we want there to be three films ultimately,\" he says. 'A wonderful tribute' to Sycamore Gap Boyle's film also features a digital recreation of the Sycamore Gap tree, which the director says he hopes will be \"a wonderful tribute\" to Northumberland's iconic tree. Eagle-eyed viewers will spot the tree is still standing in scenes for Boyle's apocalyptic horror despite being felled in September 2023. Boyle explains: \"It had already been destroyed by the time we came to film, so we recreated it for the same reasons that you see the Queen in this… all the things that have happened to us in the last 28 years have not happened.\" Read more:Two men who cut down Sycamore Gap tree face lengthy jail terms As well as forming a part of people's personal lives, as the scene of wedding proposals, ashes being scattered and countless photographs, it had already held a place in pop culture, featuring in the 1991 Kevin Costner film Robin Hood: Prince Of Thieves. It is a blink-and-you'll-miss-it moment in the film, but Boyle said given how much of what they shot is filmed in the beautiful Northumbria countryside, to resurrect \"one of their most beautiful icons\" was a \"real privilege which we felt we couldn't ignore\". \"So we've recreated it deliberately to say that it was still growing… which is a wonderful tribute,\" he adds. 28 Years Later is out on 20 June."
    }
]