[
    {
        "title": "Trump to double tariffs on steel imports - as he threatens China",
        "description": "Donald Trump said he plans to double tariffs on steel imports from next week, deepening his trade war which has hit global markets.",
        "url": "https://news.sky.com/story/trump-to-double-tariffs-on-steel-imports-as-he-threatens-china-13377208",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-steel_6931732.jpg?20250531003052",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-30 23:22:00",
        "Headline": "The US president says the levy - also affecting aluminium imports - will be in effect from Wednesday and that American \"industries are coming back like never before\".",
        "Content": "Donald Trump said he plans to double tariffs on steel imports from next week, deepening his trade war which has hit global markets. The US president told a rally of steel workers in West Mifflin, Pennsylvania, on Friday that tariffs would be raised from 25% to 50%, \"which will even further secure the steel industry in the United States\". Mr Trump later said on Truth Social that the new levy - also affecting aluminium imports - would be in effect from Wednesday and that American \"industries are coming back like never before\". \"This will be yet another BIG jolt of great news for our wonderful steel and aluminum (sic) workers,\" he added. \"MAKE AMERICA GREAT AGAIN!\" He then said: \"We don't want America's future to be built with shoddy steel from Shanghai - we want it built with the strength and the pride of Pittsburgh!\" Sky News understands that British steel exports are exempt from this rise after a UK-US trade agreement was signed earlier this month. The agreement said at the time that the US \"will promptly construct a quota at most favoured nation (MFN) rates\" for British steel, aluminium and derivative products. \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Read more: Key details in the UK-US 'historic' trade deal  Earlier, the US president claimed China had \"totally violated\" an agreement to mutually roll back tariffs and trade restrictions for critical minerals. \"So much for being Mr Nice Guy,\" he said in a post on his social media platform. In March, Mr Trump introduced a 25% tariff on all foreign steel and aluminium imports as a way to protect US manufacturing and bolster jobs by making foreign-made products less attractive. The rates threaten to make the cost of products using steel and aluminium - such as cars or soft drink cans - more expensive for Americans. He also previously threatened Canada with 50% levies on imports, while the provincial government of Ontario, in turn, threatened to charge 25% more for the electricity it supplies to the US. Canada's most populous province provides electricity to more than 1.5 million American homes and businesses in Minnesota, New York and Michigan. At the time, Canadian Prime Minister Mark Carney called the proposed 50% tariffs an \"attack\" on Canadian workers, families and businesses. Read more:Musk appears with black eye at White House farewellTrump tariffs can stay in place for now amid legal challengeTrump furious over 'TACO' dig - what inspired the phrase? Roughly a quarter of all steel used in the US is imported, with a majority coming from Mexico, Canada, Japan, South Korea and Germany. In 2024, 6.6m tonnes of steel were imported by the US from Canada, while 3.5m tonnes were brought in from Mexico. The US is also reliant on imports for aluminium, with 3.2m tonnes coming from Canada last year."
    },
    {
        "title": "Man appears in court over Liverpool trophy parade incident",
        "description": "A 53-year-old man has appeared in court after a car was driven into a crowd at Liverpool FC's trophy parade earlier this week.",
        "url": "https://news.sky.com/story/man-appears-in-court-over-liverpool-trophy-parade-incident-13376785",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-doyle-liverpool_6931575.jpg?20250530193558",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-30 10:45:00",
        "Headline": "Paul Doyle was remanded in custody until a further hearing in August ahead of a trial later this year. ",
        "Content": " A 53-year-old man has appeared in court after a car was driven into a crowd at Liverpool FC's trophy parade earlier this week. Paul Doyle, from the West Derby area of Liverpool, is charged with seven offences. He confirmed his name and date of birth as he appeared in the dock of Liverpool Crown Court. Recorder of Liverpool Judge Andrew Menary KC said he would fix a provisional trial date of November 24, with the case expected to last three to four weeks. Doyle nodded as he was remanded into custody by Judge Andrew Menary, Honorary Recorder of Liverpool, until a further hearing on August 14 ahead of his trial in November.  Philip Astbury, prosecuting, told the court: \"This is very much an ongoing investigation. There are many witnesses to be interviewed and a great deal of CCTV to be analysed.\" A hearing will be held on Tuesday next week at the same court to consider reporting restrictions. In an earlier hearing, Doyle confirmed his name, gave his date of birth and address at Liverpool Magistrates' Court on Friday. He gave no indication of pleas when the charges were read to the court. Reporting restrictions preventing the victims from being identified were made by the judge. The father-of-three is accused of two counts of unlawful and malicious wounding with intent to cause grievous bodily harm, and two counts of causing unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm. North of England correspondent We have seen Paul Doyle in photographs, where he's smiling, either by himself or with family. Today was our first opportunity to see the 53-year-old in person. Doyle is believed to have been brought in a white police van from police custody, where he has been since Monday night, to Liverpool Magistrates' Court this morning. Shortly after 10.30am, he was brought into court and appeared to be holding back tears. Doyle wore a black suit, white shirt and grey tie and spoke to confirm his name, address and date of birth. His voice was croaky as he spoke - and then he sat, head bowed, listening to the legal argument around him. There are seven charges against Doyle involving six people, including two children. The Crown Prosecution Service say it will continue to review these, as the police investigation continues. The public interest in the case is intense. The courtroom here is full, with dozens of journalists in the public gallery - court staff had to make an additional room available for everyone who wanted to see what was happening. Doyle is also accused of two counts of attempted unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm, and one count of dangerous driving. The charges relate to six people, including two children. A wounding charge and an attempted grievous bodily harm charge relate to a child. Thousands of fans were gathered in Liverpool city centre on Monday to celebrate the Premier League champions' title win when a car struck a crowd on Water Street. Police said a total of 79 people were injured in the incident, with the youngest aged nine, and the oldest being a 78-year-old. Seven people remain in hospital in a stable condition."
    },
    {
        "title": "Why stockpiling vapes could be dangerous - as ban on disposables nears",
        "description": "A ban on disposable vapes comes into force tomorrow, with a warning issued about the \"life-threatening dangers\" of stockpiling.",
        "url": "https://news.sky.com/story/why-stockpiling-vapes-could-be-dangerous-as-ban-on-disposables-nears-13376796",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-disposable-vapes_6931044.jpg?20250530103321",
        "type": "Home",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-05-30 08:23:00",
        "Headline": "From Sunday it will be illegal for any businesses to sell or supply disposable vapes, but an online nicotine retailer says an alarming number of customers have said they will stockpile. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A ban on disposable vapes comes into force tomorrow, with a warning issued about the \"life-threatening dangers\" of stockpiling. From Sunday it will be illegal for any business to sell or supply, or have in their possession for sale, all single-use or disposable vapes. Online nicotine retailer Haypp said 82% of the 369 customers they surveyed plan to bulk purchase the vapes before they are no longer available. But the vapes contain lithium batteries and could catch fire if not stored correctly. While more than a third (34%) of people surveyed by Haypp said they would consider buying an illegal vape after the ban, the overall number of people using disposable products has fallen from 30% to to 24% of vapers, according to Action on Smoking and Health. Shops selling vapes are required to offer a \"take back\" service, where they accept vapes and vape parts that customers return for recycling - including single use products. Read more: Everything you need to know about the ban \n                  Man appears in court over Liverpool trophy parade incident\n                 \n                  Search for girl missing in Thames suspended\n                 \n                  Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges\n                 The Local Government Association (LGA) led the call for a ban two years ago, due to environmental and wellbeing concerns, and is warning people not to stockpile. Cllr David Fothergill, chairman of the LGA's Community Wellbeing Board, said: \"Failing to store disposable vapes correctly could cost lives, given the significant fire risk they pose.\" How disposable vapes catch fire - or even explode Figures obtained by the Electric Tobacconist, via Freedom of Information requests, found an increase in vape related fires - from 89 in 2020 to 399 in 2024. Many disposable vapes use cheap, or even unregulated lithium-ion batteries, to keep the costs down. These batteries often lack proper safety features, like thermal cut offs, making them more prone to overheating and catching fire. If the battery is damaged, or overheats in any way it can cause thermal runaway - a chain reaction where the battery's temperature rapidly increases, causing it to overheat uncontrollably.  Read more:Ban may not curb e-cig useToddler filmed vapingIllegal vapes found in WW2 bunker Then, once these fires start start, they are very hard to stop. Water alone can make things worse if the battery is still generating heat, so they require specialised fire suppressants to put them out. Batteries can then re-ignite hours, or even days later, making them a persistent hazard. Disposable vapes are a hazard for waste and litter collection and cause fires in bin lorries, even though customers have been warned not to throw them away in household waste. They are almost impossible to recycle because they are designed as one unit so the batteries cannot be separated from plastic. Some 8.2 million units were thrown away, or recycled incorrectly, every week prior to the ban. The Department for Environment, Food and Rural Affairs (Defra) said usage among young vapers remained too high, and the ban would \"put an end to their alarming rise in school playgrounds and the avalanche of rubbish flooding the nation's streets\". Circular economy minister Mary Creagh said: \"For too long, single-use vapes have blighted our streets as litter and hooked our children on nicotine. That ends today. \"The government calls time on these nasty devices.\" 'One in five say they will return to cigarettes' Separate research by life insurance experts at Confused.com found two in five people (37%) planned to stop vaping when the ban starts. Nearly one in five (19%) said they would return to cigarettes once the ban comes into force. The research was based on the answers of 500 UK adults who currently vape. Vaping and smoking also appears to be on the rise, with Confused.com saying there was a 44% increase in the number of people declaring they smoke or vape on their life insurance policy since 2019."
    },
    {
        "title": "Last hospital in northern Gaza out of service after evacuation",
        "description": "The last working hospital in northern Gaza is no longer functional according to the World Health Organisation (WHO) - a day after staff reported Israeli troops had surrounded the site.",
        "url": "https://news.sky.com/story/last-hospital-in-northern-gaza-out-of-service-after-evacuation-13377203",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-al-awda-hospital-gaza_6500249.jpg?20240325091855",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-30 22:00:00",
        "Headline": "The World Health Organisation (WHO) said Al-Awda Hospital went out of service on Thursday, after staff told news agencies that Israeli troops had surrounded the centre earlier this week.",
        "Content": "The last working hospital in northern Gaza is no longer functional according to the World Health Organisation (WHO) - a day after staff reported Israeli troops had surrounded the site. The WHO said Al-Awda Hospital went out of service on Thursday, and patients and health workers evacuated the same evening for fear of their safety. It said that the hospital's closure is \"severing a critical lifeline for the people\" in northern Gaza, and pleaded \"for the hospital's protection and staff and patients' safety\". Israeli authorities issued evacuation orders last week for large parts of northern Gaza ahead of offensives against Hamas, although the army did not order the hospital itself to evacuate. Dr Rami al Ashrafi told the Associated Press on Thursday that Al-Awda Hospital had been encircled by Israeli troops and had come under fire in recent days.  Gaza situation 'worst since war began' - UN It comes as the United Nations said on Friday that the humanitarian situation in Gaza is the worst since the war between Israel and Hamas began in October 2023 - despite a resumption in aid deliveries. \n                  UK will 'seek to do more if it can' for Gaza's injured children, foreign secretary David Lammy says\n                 \n                  'What did they do to be burned and bombed?': Charity calls on UK to offer Gaza children life-saving treatment\n                 \n                  'Daylight robbery of land - sanctioned by Israeli authorities': Inside 'terrorised' West Bank village\n                 Spokesperson Stephane Dujarric told reporters in New York that while \"any aid that gets into the hands of people who need it is good,\" the deliveries have so far had \"very, very little impact\". He added: \"The catastrophic situation in Gaza is the worst since the war began.\" The UN and other international aid groups have refused to work with the Gaza Humanitarian Foundation (GHF) - supported by Israel and the US - as they claim it is not neutral and forces the displacement of Palestinians by its distribution of aid. Read more:How the rollout of new Gaza aid system collapsed into chaos  As of Friday, GHF said that it has managed to distribute more than 2.1 million meals. Israel's UN ambassador Danny Danon said this week it would allow aid deliveries from both GHF and the UN's operations. Meanwhile, Hamas said it was still reviewing a US-proposed ceasefire a day after the White House said Israel accepted the offer. US President Donald Trump said in Washington that both sides were \"very close to an agreement on Gaza, and we'll let you know about it during the day or maybe tomorrow\". 👉 Listen to Sky News Daily on your podcast app 👈 The proposal reportedly calls for a 60-day pause in fighting, and the release of nine living hostages and half of the known hostages who have died, over the course of a week. Israel and Hamas would then continue talks to bring the remaining hostages home, but Israel would retain the right to resume military action in Gaza if talks were to break down. Read more from Sky News:Former UN chief calling Gaza war a 'genocide' marks extraordinary shiftCalls for UK to offer Gaza children life-saving treatmentFor Gaza's paramedics, every shift could be their last According to Reuters, some 28 Israeli hostages - alive and dead - would be returned in the first week of the ceasefire, in exchange for 125 Palestinian prisoners sentenced for life and the remains of 180 dead. The news agency added that the plan includes sending aid to Gaza as soon as Hamas agrees to its terms."
    },
    {
        "title": "Mountainhead: Succession writer Jesse Armstrong's new film takes aim at tech billionaires",
        "description": "Succession writer Jesse Armstrong says he hopes his new film about toxic tech billionaires can be a receptacle for anyone who is \"feeling wonky about the world\".",
        "url": "https://news.sky.com/story/mountainhead-succession-writer-jesse-armstrongs-new-film-takes-aim-at-tech-billionaires-13377010",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jesse-armstrong-steve-carell_6931325.jpg?20250530155249",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-30 14:45:00",
        "Headline": "Satire Mountainhead centres on a bunch of tech bros meeting up to compare bank balances, as an international crisis they appear to have stoked rages, and it could help lower viewers' anxiety, according to its writer.",
        "Content": "\n          Arts and entertainment correspondent\n       Succession writer Jesse Armstrong says he hopes his new film about toxic tech billionaires can be a receptacle for anyone who is \"feeling wonky about the world\". Now making his film directorial debut with Mountainhead, starring Steve Carell and Jason Schwartzman, Armstrong has shifted his focus from cut-throat media moguls to a group of billionaire friends meeting up to compare bank balances against the backdrop of a rolling international crisis they appear to have stoked. Speaking to Sky News about the project, he said: \"For a little while I poured some of my anxieties and feelings into it… and I hope it can be a receptacle for other people if they're feeling wonky about the world, maybe this can be somewhere they put some of their anxieties for a while.\" Few television writers achieve widespread recognition beyond their work, but Armstrong - the man behind Succession, one of the most critically acclaimed TV shows of the past decade - has become a household name and is today one of the world's hottest properties in high-end drama. \"If there was more self-reflection and self-knowledge, there probably wouldn't be such amenable targets for comedy and satire,\" he admits. Long before he gifted viewers with the likes of manipulative Logan Roy and sycophantically ambitious Tom Wambsgans, back in the beginning, there was selfish slacker Jez and the perennially insecure Mark on his breakthrough hit Peep Show. \"I love comedy, you know, it's my way in,\" he explains. \"I think I like it because… the mixture that you get of tragedy and absurdity strikes me as a sort of a true portrayal of the world… and I just like jokes, you know, that's probably the basic reason.\" \n                  Taylor Swift buys back rights to all master recordings - but it's bad news for Reputation fans\n                 \n                  Loretta Swit, Emmy-winning actress and star of M*A*S*H, dies aged 87\n                 \n                  Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges\n                 After putting his pen down on the finale of Succession, walking away with 19 Emmys and nine Golden Globes, attention was always going to be drawn to what Armstrong did next. \"I had a couple of other things that I thought I would write first and this kind of snuck up on me as an area of interest,\" Armstrong says. \"After I'd listened to a bunch of tech podcasts and Ted talks, I sort of needed somewhere to put the tone of voice that was increasingly in my head.\" Tapping into the unease surrounding big tech, he wrote, shot and edited Mountainhead in less than six months. Capturing the audience mood Explaining why he worked so fast, he said he \"wanted to be in the same sort of mood as my audience, if possible\". While he insists there aren't \"any direct map-ons\" to the billionaire tech moguls, which frequently make headlines in real life, he joked he's \"happy… to play a game of 'where did I steal what from who?'\" with viewers. \"You know… Elon Musk… I think at least people would see some Mark Zuckerberg and, I don't know, some Sam Altman, there is a bunch of those people in all the [film's] different characters… and we've stolen liberally from the world in terms of the stories we've given them.\" Steve Carell is tasked with delivering some of the film's most memorable lines as the satire explores the dynamic between those holding the power and those pulling the strings. Read more on Sky News:Brand denies sex chargesWynne Evans leaves radio showTom Daley on LGBT rights Lack of self-knowledge 'good for comedy' \"People who lack a certain degree of self-knowledge are good for comedy….and if there was more self-reflection and self-knowledge, there probably wouldn't be such amenable targets for comedy and satire. \"You know, living in a gated community and travelling by private jet certainly doesn't help you to understand what life is like for most people.\" Armstrong's gift for using humour to savagely dramatic ends is arguably what makes him one of the most sought-after writers working today. Behind his ability to craft some of the sharpest and scathing dialogue on our screens, he views what he does as more than getting a laugh. \"I do believe in the sort of nobility of the idea, that this is a good way to portray the world because this is how it feels a lot of the time.\" Mountainhead will air on Sky and streaming service NOW on 1 June."
    },
    {
        "title": "Taylor Swift buys back rights to all master recordings - but it's bad news for Reputation fans",
        "description": "Taylor Swift has bought back all the rights to her master recordings - but has suggested she won't be re-releasing her Reputation album. ",
        "url": "https://news.sky.com/story/taylor-swift-buys-back-rights-to-all-master-recordings-but-its-bad-news-for-reputation-fans-13377026",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-taylor-swift-eras-tour_6801775.jpg?20250116225711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-30 15:35:00",
        "Headline": "Taylor Swift shared the news with fans saying, \"you belong with me\", as she clutched vinyl copies of her first six albums. ",
        "Content": "Taylor Swift has bought back all the rights to her master recordings - but has suggested she won't be re-releasing her Reputation album.  \"All the music I've ever made now belongs to me,\" the star announced on her official website. \"I've been bursting tears of joy... ever since I found out this is really happening.\" The pop star had originally lost the rights to her first six albums in 2019 when her first record label, Big Machine, sold them to music executive Scooter Braun. After she learned Braun had acquired her musical catalogue, she opened up about it in a lengthy Tumblr post, blaming him for being complicit in Kanye West's \"incessant, manipulative bullying\" of her. Swift said she was not given the opportunity to buy her work outright, and so, in a bid to diminish the value of the master tapes, she set about re-recording them. She had re-released four \"Taylor's Version\" albums to date. Just her self-titled debut album and Reputation remained. Braun later sold his stake in her albums to Shamrock Holdings, a Los Angeles investment fund, in a deal reported to be worth £222 million. It is not known how much Swift paid Shamrock to re-acquire the rights to her songs. Swift said she was \"forever grateful\" to Shamrock for allowing her to buy the rights to her music back. \"This was a business deal to them, but I really felt like they saw it for what it was to me: My memories and my sweat and my handwriting and my decades of dreams,\" Swift wrote on her website. \"I am endlessly thankful. My first tattoo might just be a huge shamrock in the middle of my forehead.\" By Arts and Entertainment producer Jayson Mansaray Such is the power Swift has over her fanbase, by re-recording almost identical songs and encouraging Swifties to stream the new versions, it is likely to have devalued the rights that had been sold without her.  This means Taylor Swift potentially acquired the back catalogue for a fraction of what Scooter or Shamrock paid.   How much it cost to re-acquire her song rights has not been disclosed but it looks like she won't be re-recording the Debut and Reputation albums.  So the good news comes with a cruel summer for fans who had particularly been anticipating the latter’s re-release. What it means for Reputation fans Just two albums remained to be re-released by Swift - her self-titled debut album and Reputation. The latter was a particularly strong source of speculation among fans, who would look for clues in her outfits during her record-breaking Era's tour. But this announcement could spell the end of that. \"Full transparency: I haven't even re-recorded a quarter of it,\" Swift said.  She said Reputation was \"so specific\" to a certain time in her life, that she kept hitting a block when she tried to re-record it. She also said she felt it was the first album she could not improve by re-recording it. Debut has been re-recorded, with Swift saying she \"loves how it sounds now\". Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record But both albums could still \"re-emerge when the time is right\", particularly the unreleased tracks. \"If it happens, it won't be from a place of sadness and longing for what I wish I could have,\" Swift said. How Swift's stance changed the music industry In the music industry, the owner of a master controls all rights to their artists' recordings. This is usually agreed in contracts with artists, and allows them to recoup the financial investment they make in stars, including funding production, marketing and promotion. It also means they can distribute it to new streaming services or license the songs to be used in movies. Swift, as co-writer of her music, had always maintained publishing rights. \"I do want my music to live on. I do want it to be in movies. I do want it to be in commercials. But I only want that if I own it,\" she told Billboard in 2019. Swift said today she had been \"heartened by the conversations this saga had reignited within my industry among artists and fans\". \"Every time a new artist tells me they negotiated to own their master recordings in their record contract because of this right, I'm reminded of how important it was for all of this to happen.\""
    },
    {
        "title": "Nigeria floods: At least 117 dead as heavy flooding submerges thousands of houses",
        "description": "At least 117 people have died and others are still missing after heavy flooding in Nigeria, an emergency official said.",
        "url": "https://news.sky.com/story/nigeria-floods-at-least-117-dead-as-heavy-flooding-submerges-thousands-of-houses-13377025",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nigeria-flood_6931384.jpg?20250530165336",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-30 15:32:00",
        "Headline": "Heavy rain fell for several hours on Thursday, submerging a town in the Niger state. Media reports quoting local government officials said a dam collapse has worsened the situation.",
        "Content": " At least 117 people have died and others are still missing after heavy flooding in Nigeria, an emergency official said. Authorities initially said 21 people had died but this figure has today risen significantly. Media reports quoting local government officials said a dam collapse has worsened the situation. Ibrahim Hussaini, head of Niger State Emergency Management Agency, said some 3,000 houses were underwater in two communities. Videos posted on social media show floodwater sweeping through neighbourhoods, with rooftops barely visible above the brown currents. One clip shows a tanker floating through a town. The chairman of the Mokwa local government area suggested poor infrastructure has worsened the impact of the flooding. Jibril Muregi has appealed to the government to start \"long overdue\" construction of waterways in the area under a climate resilience project. \n                  More than 40% of Europe slides into drought, including pockets of Greece, southern Italy and Spain\n                 \n                  Four Just Stop Oil activists jailed for plotting to disrupt Manchester Airport\n                 \n                  Scientists embark on crucial study to save Britain's bees\n                 In a similar occurrence last September, torrential rains and a dam collapse in Nigeria's northeastern Maiduguri caused severe flooding, leaving at least 30 people dead and displacing millions. Nigeria is prone to flooding during the rainy season, which began in April - and flooding is becoming more common and extreme as the climate warms. Read more:More than 40% of Europe slides into droughtHow melting ice is boosting Russia's military Hotter air is thirstier and can hold more moisture - about 7% more for every 1C warmer - meaning it unleashes heavier flooding when it rains. Violent rain, which killed hundreds of people in Nigeria during 2022, was made at least 80 times more likely and 20% more intense by climate change, analysis by World Weather Attribution found."
    },
    {
        "title": "Loretta Swit, Emmy-winning actress and star of M*A*S*H, dies aged 87",
        "description": "Loretta Swit, who won Emmy Awards for her role on the comedy series M*A*S*H, has died aged 87.",
        "url": "https://news.sky.com/story/loretta-swit-emmy-winning-actress-and-star-of-mash-dies-aged-87-13377161",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-loretta-swit-1971-celebrity_6931642.jpg?20250530211035",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-30 19:58:00",
        "Headline": "Loretta Swit was best known for her star turn as Major Margaret Houlihan on CBS' M*A*S*H, which aired for 11 years from 1972 to 1983 and saw her win two Emmy Awards.",
        "Content": "Loretta Swit, who won Emmy Awards for her role on the comedy series M*A*S*H, has died aged 87. Her publicist, Harlan Boll, said the actress passed away at her home in New York City just after midday on Friday, likely from natural causes. She was best known for her star turn as Major Margaret Houlihan on CBS' M*A*S*H, which aired for 11 years from 1972 to 1983. Based on Robert Altman's 1970 film of the same name, M*A*S*H has been ranked as one of the greatest shows of all time by Rolling Stone and Time Out, with the finale watched by more than 100 million viewers - the most-watched episode of any scripted series ever. In the film, Major Margaret Houlihan was a one-dimensional, promiscuous character nicknamed Hot Lips, but the character was developed and deepened in the show. Swit told Suzy Kalter, author of \"The Complete Book of M*A*S*H,\" that as the show went on, \"I decided to try to play her as a real person, in an intelligent fashion, even if it meant hurting the jokes\". She won Emmy Awards for Outstanding Supporting Actress in a Comedy Series in 1980 and 1982 for her role in the show. \n                  Trump to double tariffs on steel imports - as he threatens China\n                 \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Born Loretta Jane Szwed in Passaic, New Jersey, in 1937, she was the daughter of Polish immigrants. She enrolled in the American Academy of Dramatic Arts before arriving in Hollywood in 1969. Along with M*A*S*H, she made appearances in shows like Gunsmoke, Hawaii Five-O, Mission Impossible and Bonanza. Swit also made regular appearances in theatre, starring on Broadway in 1975 in Same Time, Next Year, and The Mystery of Edwin Drood in 1986. Swit also appeared in a number of TV musical specials, including The Muppet Show and the Broadway musical It's a Bird, It's a Plane, It's Superman."
    },
    {
        "title": "Man appears in court over Liverpool trophy parade incident",
        "description": "A 53-year-old man has appeared in court after a car was driven into a crowd at Liverpool FC's trophy parade earlier this week.",
        "url": "https://news.sky.com/story/man-appears-in-court-over-liverpool-trophy-parade-incident-13376785",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-paul-doyle-liverpool_6931575.jpg?20250530193558",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-30 10:45:00",
        "Headline": "Paul Doyle was remanded in custody until a further hearing in August ahead of a trial later this year. ",
        "Content": " A 53-year-old man has appeared in court after a car was driven into a crowd at Liverpool FC's trophy parade earlier this week. Paul Doyle, from the West Derby area of Liverpool, is charged with seven offences. He confirmed his name and date of birth as he appeared in the dock of Liverpool Crown Court. Recorder of Liverpool Judge Andrew Menary KC said he would fix a provisional trial date of November 24, with the case expected to last three to four weeks. Doyle nodded as he was remanded into custody by Judge Andrew Menary, Honorary Recorder of Liverpool, until a further hearing on August 14 ahead of his trial in November.  Philip Astbury, prosecuting, told the court: \"This is very much an ongoing investigation. There are many witnesses to be interviewed and a great deal of CCTV to be analysed.\" A hearing will be held on Tuesday next week at the same court to consider reporting restrictions. In an earlier hearing, Doyle confirmed his name, gave his date of birth and address at Liverpool Magistrates' Court on Friday. He gave no indication of pleas when the charges were read to the court. Reporting restrictions preventing the victims from being identified were made by the judge. The father-of-three is accused of two counts of unlawful and malicious wounding with intent to cause grievous bodily harm, and two counts of causing unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm. North of England correspondent We have seen Paul Doyle in photographs, where he's smiling, either by himself or with family. Today was our first opportunity to see the 53-year-old in person. Doyle is believed to have been brought in a white police van from police custody, where he has been since Monday night, to Liverpool Magistrates' Court this morning. Shortly after 10.30am, he was brought into court and appeared to be holding back tears. Doyle wore a black suit, white shirt and grey tie and spoke to confirm his name, address and date of birth. His voice was croaky as he spoke - and then he sat, head bowed, listening to the legal argument around him. There are seven charges against Doyle involving six people, including two children. The Crown Prosecution Service say it will continue to review these, as the police investigation continues. The public interest in the case is intense. The courtroom here is full, with dozens of journalists in the public gallery - court staff had to make an additional room available for everyone who wanted to see what was happening. Doyle is also accused of two counts of attempted unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm, and one count of dangerous driving. The charges relate to six people, including two children. A wounding charge and an attempted grievous bodily harm charge relate to a child. Thousands of fans were gathered in Liverpool city centre on Monday to celebrate the Premier League champions' title win when a car struck a crowd on Water Street. Police said a total of 79 people were injured in the incident, with the youngest aged nine, and the oldest being a 78-year-old. Seven people remain in hospital in a stable condition."
    },
    {
        "title": "Search for girl missing in Thames suspended",
        "description": "Emergency services responding to reports of a girl missing in the Thames have suspended their search. ",
        "url": "https://news.sky.com/story/emergency-services-searching-for-child-missing-in-the-thames-13377090",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-child-gravesend_6931511.jpg?20250530182131",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-30 16:54:00",
        "Headline": "The South East Coast Ambulance Service said a second child, a boy, was treated at the scene near the Royal Terrace Pier in Gravesend, Kent.",
        "Content": "Emergency services responding to reports of a girl missing in the Thames have suspended their search.  His Majesty's Coastguard said it responded on Friday to a report of two children, a boy and a girl, in difficulty in the water near the Royal Terrace Pier in Gravesend, Kent. The alarm was raised at about 1.35pm. A boy has since been rescued, but the search for the missing girl has now been suspended. HM Coastguard said Metropolitan Police boats joined the search operation, alongside the RNLI lifeboat from Gravesend, Kent Police, and a police helicopter. The South East Coast Ambulance Service was also sent. The ambulance service said a \"male patient was assessed and treated\" at the scene. He was taken to a local hospital for further medical treatment."
    },
    {
        "title": "Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges",
        "description": "Russell Brand has pleaded not guilty to rape and sexual assault charges as he appeared in court in London.",
        "url": "https://news.sky.com/story/russell-brand-comedian-and-actor-pleads-not-guilty-to-rape-and-sexual-assault-charges-13376737",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russell-brand-court_6931009.jpg?20250530095514",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-30 05:29:00",
        "Headline": "The British comedian and actor has denied five charges related to alleged incidents which took place between 1999 and 2005. ",
        "Content": " Russell Brand has pleaded not guilty to rape and sexual assault charges as he appeared in court in London. The British comedian and actor, from Hambleden in Buckinghamshire, was charged by post last month with one count each of rape, indecent assault and oral rape as well as two counts of sexual assault. The charges relate to alleged incidents involving four separate women between 1999 and 2005. The 49-year-old, who has been living in the US, was flanked by two officers as he pleaded not guilty to all the charges at Southwark Crown Court today. Brand stood completely still and looked straight ahead as he delivered his pleas. The comedian, who has consistently denied having non-consensual sex since allegations were first aired two years ago, is due to stand trial in June 2026. Read more from Sky NewsMan who sold poisonous diet pills jailedFraudster who sold fake Scottish tea jailedTom Daley on LGBT rights  \n                  Man appears in court over Liverpool trophy parade incident\n                 \n                  Search for girl missing in Thames suspended\n                 \n                  NatWest boss thanks British taxpayer for 2008 bailout after government sells remaining shares\n                 He previously told his 11.2 million followers on X that he welcomed the opportunity to prove his innocence. The allegations were first made in a joint investigation by The Sunday Times, The Times and Channel 4 Dispatches in September 2023. As Friday's hearing finished, Brand replaced his sunglasses before exiting the dock and calmly walking past reporters."
    },
    {
        "title": "NatWest boss thanks British taxpayer for 2008 bailout after government sells remaining shares",
        "description": "The Chairman of NatWest has thanked British taxpayers for bailing out the bank during the 2008 financial crisis, as it returns into private ownership after 17 years.",
        "url": "https://news.sky.com/story/natwest-boss-thanks-british-taxpayer-for-2008-bailout-after-government-sells-remaining-shares-13377078",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rick-haythornthwaite_6931491.jpg?20250530180045",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-05-30 16:37:00",
        "Headline": "NatWest - which was called RBS at the time - received almost £46bn of taxpayer funding in 2008 and 2009.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  The Chairman of NatWest has thanked British taxpayers for bailing out the bank during the 2008 financial crisis, as it returns into private ownership after 17 years. Rick Haythornthwaite, who succeeded Sir Howard Davies as chairman in April last year, expressed \"gratitude to the taxpayer\" for rescuing the bank, adding that the company had not forgotten \"the lessons of the past\" even as it pushes for changes to regulations that were introduced after the financial crisis. Mr Haythornthwaite said the bank was in a reflective mood. \"It's about a desire to express gratitude to the taxpayer. They not just rescued this bank, they protected millions of savers, of businesses, of homeowners. \"From the bank's standpoint, it gave us the opportunity to completely restructure into a much safer and stronger bank.\" He spoke to Sky News as the government completed the sale of its remaining stake in the bank, formerly known as RBS, 17 years after a £46bn taxpayer-funded bailout that left the state with an 83% stake in the bank. Sky News' city editor Mark Kleinman broke the news at the weekend that the selloff was imminent and predicted that the taxpayers would lose about £10.2bn on the bailout. The government confirmed a £10.5bn loss on Friday. The government began unwinding its stake in 2021 and completed the sale today, posting a final loss of £10.5bn, and closing the door on one of the most turbulent periods in British economic history. It was also one of the most controversial periods. The bank bailouts, orchestrated by Alistair Darling and Gordon Brown, attracted public anger and scrutiny of the excessive risk-taking that took place in the City. A swathe of new regulations were implemented following the crisis, including new rules that forced banks to ring-fence their core retail banking arms from their investment arms, as well as a cap on bonuses. Read more from Sky News:Man in court over Liverpool trophy parade incidentFormer Sinn Fein leader wins libel case against the BBC While at the time the changes were viewed as necessary, Mr Haythornthwaite said the regulatory \"pendulum may have swung too far\". He said Britain had high-quality regulation, but there was scope to eliminate duplication in some areas. He said the current regime was compounding costs and inhibiting growth. \"The regulator stepped in very necessarily 17 years ago and raised the standards it expects of banks, of their leaders, of people working in those places. It made demands of the culture and demands of its service to customers. All that is very right,\" Mr Haythornthwaite said. \"Inevitably, the pendulum can swing slightly too far. One may question whether it's swung slightly too far, but I use the word 'slightly'.\" The Chancellor is receptive to his arguments. In her search for economic growth, Rachel Reeves is eyeing up the City. In a Mansion House speech last year, she said that some of those post-2009 reforms had \"gone too far\". The bonus cap, first implemented by the EU, has already been lifted, and major banks, including NatWest, are now calling for an end to ring-fencing too. The Chancellor has said she is \"open-minded\" about the idea. Some may be more nervous about that idea, less than two decades after the biggest bank bailout in history, but Mr Haythornthwaite said: \"We're not going to forget the lessons of the past,\" adding: \"This is not about triggering a race to the bottom. \"It's very clear to me that this is a very different place. There's a focus on the ethics of running a bank, of really focusing on customers,\" he said. \"This is not a place where we are looking for quick wins to serve the few.\""
    },
    {
        "title": "Sledgehammer-wielding burglar used smoke grenades in attempted jewellery heist at Claridge's",
        "description": "A sledgehammer-wielding burglar who used smoke grenades in an attempt to steal jewels worth &#163;190,000 from Claridge's Hotel in London has been jailed.",
        "url": "https://news.sky.com/story/sledgehammer-wielding-burglar-used-smoke-grenades-in-attempted-jewellery-heist-at-claridges-13377158",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jay-mcginy-claridge_6931623.jpg?20250530204641",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-30 19:46:00",
        "Headline": "Jay McGinty, 37, was jailed for six years on Thursday after pleading guilty to aggravated burglary at Southwark Crown Court.",
        "Content": " A sledgehammer-wielding burglar who used smoke grenades in an attempt to steal jewels worth £190,000 from Claridge's Hotel in London has been jailed. Jay McGinty, 37, pulled the pins out of the smoke grenades after arriving at the Mayfair hotel riding pillion on a Vespa scooter in March last year, the Crown Prosecution Service (CPS) said. CCTV showed McGinty, of no fixed abode, entering Claridge's through the revolving doors at the side entrance on Davies Street and placing the smoking grenades in the hallway. He then used a sledgehammer to smash a display case containing several jewellery items as dark smoke billowed out around him. McGinty, who was wearing a balaclava and a crash helmet, was later detained by hotel security staff, who waited with him until police arrived. He was sentenced to six years' imprisonment on Thursday after pleading guilty to aggravated burglary at Southwark Crown Court, the CPS said. Monica Oluwole, senior crown prosecutor at the CPS, said: \"Jay McGinty tried to use a smokescreen to cover his brazen attempt to steal highly valued items of jewellery. Read more from Sky News:Man who sold poisonous diet pills is jailedSearch for girl missing in Thames suspended \"He was caught red-handed thanks to the quick actions of the hotel security and staff who prevented him from escaping and called the police. \"This heist, although it had all the hallmarks of planning and reconnaissance work, didn't work, and we were able to make sure he was brought to justice.\""
    },
    {
        "title": "Reform UK to accept crypto donations, Farage says",
        "description": "Reform UK will start accepting donations in cryptocurrency, making it the \"first\" British party to do so, its leader Nigel Farage has said - but the move has sparked concern from some experts.",
        "url": "https://news.sky.com/story/reform-uk-to-accept-crypto-donations-farage-says-13377162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-doncaster_6878714.jpg?20250407115544",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-30 20:03:00",
        "Headline": "The party claims it is the \"first\" in Britain to do this – but experts are warning that digital currencies are harder to trace, and so offer donors increased anonymity.",
        "Content": "Reform UK will start accepting donations in cryptocurrency, making it the \"first\" British party to do so, its leader Nigel Farage has said - but the move has sparked concern from some experts. The announcement came as Mr Farage spoke at a Bitcoin Conference in Las Vegas on Thursday, and as his party pledged to cut taxes on cryptocurrencies if elected. \"My message to the British public, my message particularly to young people, is help us to help you bring our country properly into the 21st century,\" he said. \"Let's recognise that crypto, Bitcoin, digital assets, are here to stay.\" The MP for Clacton also introduced a 'Cryptoassets and Digital Finance Bill' - which he described as a \"bold, post-Brexit roadmap\" to make London a \"world-leading trading centre\". However, experts have warned against the idea of allowing political donations to be made via cryptocurrency. Financial crime expert Steve Goodrich told Politico's Playbook: \"The anonymity offered by digital currencies makes it nearly impossible for political parties to have confidence in their donors' identities. He added that the growth of crypto threatens a \"widening loophole that could allow unlimited anonymous donations to flow into British politics.\" News reporter Donald Trump, who called Bitcoin a \"scam\" in 2021, changed course before the presidential election last year - and ended up receiving millions in donations from deep-pocketed investors. Mr Farage appears to be following the same playbook, and has pledged to create a \"sovereign Bitcoin reserve fund\" so taxpayers can benefit if this cryptocurrency's price rises. The Trump administration unveiled a similar policy in March - meaning Bitcoin seized from criminals would no longer be auctioned off, but held in case its value grows. Data from Arkham Intelligence shows the UK currently holds £4.7bn worth of Bitcoin - but Labour has ruled out treating it as an investment, arguing that this asset is too volatile. The government is yet to sell off these crypto holdings, despite the fact that it could comfortably pay for a U-turn on winter fuel payments - with plenty of change left over. Mr Farage announced his policy at the Bitcoin conference in Las Vegas. Pro-Bitcoin policies are unlikely to be front of mind for many British voters, who are still grappling with a cost-of-living crisis. But Reform's stance marks another point of difference from both Labour and the Conservatives, who are yet to take a definitive stance on crypto. Read more on Sky News:Retailer cancels Nintendo Switch 2 pre-ordersDid Brexit make Britain better or worse off? It came as Reform chairman Zia Yusuf told reporters on Friday that if the party were elected to government, the party would allow people to pay their taxes through Bitcoin. He also said Reform would reduce capital gains tax on assets like Bitcoin to 10% - with the hope of generating up to £1bn for the Treasury in 10 years. Currently, cryptocurrencies incur a capital gains tax of either 18% or 24%. He added that the cut may encourage additional use of the currency, and encourage people to move their assets to Britain. Cryptocurrencies - like Bitcoin - have become increasingly popular over recent years, with research suggesting that around 12% of adults in the UK currently, or once, owned cryptoassets - compared to 4% in 2021. Last month, the chancellor announced plans to regulate cryptoassets in order to make Britain a \"world leader\"."
    },
    {
        "title": "Why stockpiling vapes could be dangerous - as ban on disposables nears",
        "description": "A ban on disposable vapes comes into force tomorrow, with a warning issued about the \"life-threatening dangers\" of stockpiling.",
        "url": "https://news.sky.com/story/why-stockpiling-vapes-could-be-dangerous-as-ban-on-disposables-nears-13376796",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-disposable-vapes_6931044.jpg?20250530103321",
        "type": "UK",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-05-30 08:23:00",
        "Headline": "From Sunday it will be illegal for any businesses to sell or supply disposable vapes, but an online nicotine retailer says an alarming number of customers have said they will stockpile. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A ban on disposable vapes comes into force tomorrow, with a warning issued about the \"life-threatening dangers\" of stockpiling. From Sunday it will be illegal for any business to sell or supply, or have in their possession for sale, all single-use or disposable vapes. Online nicotine retailer Haypp said 82% of the 369 customers they surveyed plan to bulk purchase the vapes before they are no longer available. But the vapes contain lithium batteries and could catch fire if not stored correctly. While more than a third (34%) of people surveyed by Haypp said they would consider buying an illegal vape after the ban, the overall number of people using disposable products has fallen from 30% to to 24% of vapers, according to Action on Smoking and Health. Shops selling vapes are required to offer a \"take back\" service, where they accept vapes and vape parts that customers return for recycling - including single use products. Read more: Everything you need to know about the ban \n                  Man appears in court over Liverpool trophy parade incident\n                 \n                  Search for girl missing in Thames suspended\n                 \n                  Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges\n                 The Local Government Association (LGA) led the call for a ban two years ago, due to environmental and wellbeing concerns, and is warning people not to stockpile. Cllr David Fothergill, chairman of the LGA's Community Wellbeing Board, said: \"Failing to store disposable vapes correctly could cost lives, given the significant fire risk they pose.\" How disposable vapes catch fire - or even explode Figures obtained by the Electric Tobacconist, via Freedom of Information requests, found an increase in vape related fires - from 89 in 2020 to 399 in 2024. Many disposable vapes use cheap, or even unregulated lithium-ion batteries, to keep the costs down. These batteries often lack proper safety features, like thermal cut offs, making them more prone to overheating and catching fire. If the battery is damaged, or overheats in any way it can cause thermal runaway - a chain reaction where the battery's temperature rapidly increases, causing it to overheat uncontrollably.  Read more:Ban may not curb e-cig useToddler filmed vapingIllegal vapes found in WW2 bunker Then, once these fires start start, they are very hard to stop. Water alone can make things worse if the battery is still generating heat, so they require specialised fire suppressants to put them out. Batteries can then re-ignite hours, or even days later, making them a persistent hazard. Disposable vapes are a hazard for waste and litter collection and cause fires in bin lorries, even though customers have been warned not to throw them away in household waste. They are almost impossible to recycle because they are designed as one unit so the batteries cannot be separated from plastic. Some 8.2 million units were thrown away, or recycled incorrectly, every week prior to the ban. The Department for Environment, Food and Rural Affairs (Defra) said usage among young vapers remained too high, and the ban would \"put an end to their alarming rise in school playgrounds and the avalanche of rubbish flooding the nation's streets\". Circular economy minister Mary Creagh said: \"For too long, single-use vapes have blighted our streets as litter and hooked our children on nicotine. That ends today. \"The government calls time on these nasty devices.\" 'One in five say they will return to cigarettes' Separate research by life insurance experts at Confused.com found two in five people (37%) planned to stop vaping when the ban starts. Nearly one in five (19%) said they would return to cigarettes once the ban comes into force. The research was based on the answers of 500 UK adults who currently vape. Vaping and smoking also appears to be on the rise, with Confused.com saying there was a 44% increase in the number of people declaring they smoke or vape on their life insurance policy since 2019."
    },
    {
        "title": "Fears for future of Welsh rugby amid cuts to grassroots scheme",
        "description": "There are fears for the future of Welsh rugby amid cuts to grassroots funding and a record string of defeats for the men's senior national team.",
        "url": "https://news.sky.com/story/fears-for-future-of-welsh-rugby-amid-cuts-to-grassroots-scheme-13376842",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wales-rugby_6931165.jpg?20250530125416",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-05-30 09:53:00",
        "Headline": "The Welsh Rugby Union's (WRU) decision to scrap its hub officer scheme has been described as a \"big mistake\", but the governing body hopes a \"restructured programme\" will have \"100% coverage\" across Wales.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n There are fears for the future of Welsh rugby amid cuts to grassroots funding and a record string of defeats for the men's senior national team. The Welsh Rugby Union (WRU) recently confirmed it would stop funding a scheme created to develop the game at grassroots level. Its rugby hub officers have been employed in schools across Wales since 2014, with match funding from the WRU. Their main purpose has been to engage young people in rugby and encourage them to pursue their interest in the sport in local clubs. The governing body for rugby union in Wales says the aim would be for a \"restructured programme\" with \"100% coverage\" across the country. The change in approach comes at a difficult time for the WRU, which reported a loss of £7.5m last year. Head coach Warren Gatland quit during this year's Six Nations championship, after Wales's men secured the tournament's wooden spoon for the second year in a row. \n                  Husband of teacher stabbed at school in West Wales calls for action on pupil behaviour\n                 \n                  Bereaved parents criticise review into student suicides for 'dodging real issue'\n                 \n                  Some parents 'undermining' school staff 'by excusing poor behaviour', report says\n                 A petition calling for the WRU to reconsider its decision to discontinue the scheme has been signed nearly 5,000 times, describing the hub officers as the \"backbone of grassroots rugby\". Some areas who have felt the benefit of the officers are fearing for the future of the grassroots game. Einion Davies is the chairman of Bro Gwernant Rugby Club in Llangollen, Denbighshire. This weekend, he is embarking on a sponsored walk to raise funds to secure the role for the next two years. Mr Davies told Sky News he was \"shocked\" to learn the hub officer scheme was coming to an end. \"We were informed by...the school that he works at, that the funding has been withdrawn,\" he said. \"And the work that he's done there, as a club, we were keen to keep it all going, so we decided as a club to try and raise some of that money ourselves so we can keep him in his role.\" 'Big mistake' There was \"hardly any rugby\" played in the \"predominantly football-orientated\" area before a hub officer was appointed for the area, Mr Davies said. But he acknowledged that money was \"tight\" and that difficult decisions had to be made. \"I would imagine, they've got to make cuts and whatever in some places. But, in my opinion, to cut the grassroots, an investment in grassroots, is a big mistake,\" he added. He hopes his 54-mile trek, split over three days, will help secure the role and help Bro Gwernant find the next generation of Welsh rugby stars. \"As a club, we did put some of the money towards it as well, because obviously the cost, the National Insurance and everything's gone up, so the cost of the wages has gone up,\" he said. \"So we were doing the fundraising anyway, but since this funding's been withdrawn from the WRU, it's made it a lot harder for the club. \"We're striving to do our best to keep him, but it's made it a lot more difficult.\" The WRU said schools and educational establishments, who part-fund the programme, are \"free to reconsider how they re-allocate their investment in rugby\" as a result of its decision. Read more from Sky News:Demands government intervenes in 'dying' English rugbyBritish and Irish Lions see first English captain in more than 20 years Geraint John, the WRU's community director said: \"Due to an internal consultation process we are unable to expand on our future plans for community further than the statement published last month. \"Once this process is complete, I look forward to sharing information on the next chapter of our education programme.\""
    },
    {
        "title": "Prison officer stabbed at high-security HMP Long Lartin in Worcestershire",
        "description": "A prison officer has been airlifted to hospital after being stabbed at a high-security men's prison.",
        "url": "https://news.sky.com/story/prison-officer-stabbed-at-high-security-hmp-long-lartin-in-worcestershire-13377176",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-long-lartin-worcestershire_6494643.jpg?20240318230228",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-30 20:36:00",
        "Headline": "Police have said audio footage circulating online, and claiming to be the aftermath of the attack, is not connected to the incident.",
        "Content": "A prison officer has been airlifted to hospital after being stabbed at a high-security men's prison. West Mercia Police said officers were called to HMP Long Lartin in South Littleton, Worcestershire, shortly after 10am on Friday morning. The 25-year-old \"sustained serious injuries and was airlifted to hospital,\" the force added. They are still in hospital, but in a stable condition. A 22-year-old suspect is being held in custody within the prison, and a weapon has been recovered, the force said. In a follow-up statement, the police said audio footage circulating online, and claiming to be from the aftermath, is not connected to the incident. Read more:Man in court over Liverpool parade incidentMan jailed over poisonous diet pills  Assistant Chief Constable Grant Wills said: \"Whilst our investigation is in its early stages, we would like to clarify that this incident is not being treated as terrorism. \"Our initial enquiries suggest there was a disagreement between an inmate and prison officer that escalated and is an isolated matter within the prison.\" HMP Long Lartin is category A and category B prison with space for over 600 inmates."
    },
    {
        "title": "Trump to double tariffs on steel imports - as he threatens China",
        "description": "Donald Trump said he plans to double tariffs on steel imports from next week, deepening his trade war which has hit global markets.",
        "url": "https://news.sky.com/story/trump-to-double-tariffs-on-steel-imports-as-he-threatens-china-13377208",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-steel_6931732.jpg?20250531003052",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-30 23:22:00",
        "Headline": "The US president says the levy - also affecting aluminium imports - will be in effect from Wednesday and that American \"industries are coming back like never before\".",
        "Content": "Donald Trump said he plans to double tariffs on steel imports from next week, deepening his trade war which has hit global markets. The US president told a rally of steel workers in West Mifflin, Pennsylvania, on Friday that tariffs would be raised from 25% to 50%, \"which will even further secure the steel industry in the United States\". Mr Trump later said on Truth Social that the new levy - also affecting aluminium imports - would be in effect from Wednesday and that American \"industries are coming back like never before\". \"This will be yet another BIG jolt of great news for our wonderful steel and aluminum (sic) workers,\" he added. \"MAKE AMERICA GREAT AGAIN!\" He then said: \"We don't want America's future to be built with shoddy steel from Shanghai - we want it built with the strength and the pride of Pittsburgh!\" Sky News understands that British steel exports are exempt from this rise after a UK-US trade agreement was signed earlier this month. The agreement said at the time that the US \"will promptly construct a quota at most favoured nation (MFN) rates\" for British steel, aluminium and derivative products. \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Read more: Key details in the UK-US 'historic' trade deal  Earlier, the US president claimed China had \"totally violated\" an agreement to mutually roll back tariffs and trade restrictions for critical minerals. \"So much for being Mr Nice Guy,\" he said in a post on his social media platform. In March, Mr Trump introduced a 25% tariff on all foreign steel and aluminium imports as a way to protect US manufacturing and bolster jobs by making foreign-made products less attractive. The rates threaten to make the cost of products using steel and aluminium - such as cars or soft drink cans - more expensive for Americans. He also previously threatened Canada with 50% levies on imports, while the provincial government of Ontario, in turn, threatened to charge 25% more for the electricity it supplies to the US. Canada's most populous province provides electricity to more than 1.5 million American homes and businesses in Minnesota, New York and Michigan. At the time, Canadian Prime Minister Mark Carney called the proposed 50% tariffs an \"attack\" on Canadian workers, families and businesses. Read more:Musk appears with black eye at White House farewellTrump tariffs can stay in place for now amid legal challengeTrump furious over 'TACO' dig - what inspired the phrase? Roughly a quarter of all steel used in the US is imported, with a majority coming from Mexico, Canada, Japan, South Korea and Germany. In 2024, 6.6m tonnes of steel were imported by the US from Canada, while 3.5m tonnes were brought in from Mexico. The US is also reliant on imports for aluminium, with 3.2m tonnes coming from Canada last year."
    },
    {
        "title": "Last hospital in northern Gaza out of service after evacuation",
        "description": "The last working hospital in northern Gaza is no longer functional according to the World Health Organisation (WHO) - a day after staff reported Israeli troops had surrounded the site.",
        "url": "https://news.sky.com/story/last-hospital-in-northern-gaza-out-of-service-after-evacuation-13377203",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-al-awda-hospital-gaza_6500249.jpg?20240325091855",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-30 22:00:00",
        "Headline": "The World Health Organisation (WHO) said Al-Awda Hospital went out of service on Thursday, after staff told news agencies that Israeli troops had surrounded the centre earlier this week.",
        "Content": "The last working hospital in northern Gaza is no longer functional according to the World Health Organisation (WHO) - a day after staff reported Israeli troops had surrounded the site. The WHO said Al-Awda Hospital went out of service on Thursday, and patients and health workers evacuated the same evening for fear of their safety. It said that the hospital's closure is \"severing a critical lifeline for the people\" in northern Gaza, and pleaded \"for the hospital's protection and staff and patients' safety\". Israeli authorities issued evacuation orders last week for large parts of northern Gaza ahead of offensives against Hamas, although the army did not order the hospital itself to evacuate. Dr Rami al Ashrafi told the Associated Press on Thursday that Al-Awda Hospital had been encircled by Israeli troops and had come under fire in recent days.  Gaza situation 'worst since war began' - UN It comes as the United Nations said on Friday that the humanitarian situation in Gaza is the worst since the war between Israel and Hamas began in October 2023 - despite a resumption in aid deliveries. \n                  UK will 'seek to do more if it can' for Gaza's injured children, foreign secretary David Lammy says\n                 \n                  'What did they do to be burned and bombed?': Charity calls on UK to offer Gaza children life-saving treatment\n                 \n                  'Daylight robbery of land - sanctioned by Israeli authorities': Inside 'terrorised' West Bank village\n                 Spokesperson Stephane Dujarric told reporters in New York that while \"any aid that gets into the hands of people who need it is good,\" the deliveries have so far had \"very, very little impact\". He added: \"The catastrophic situation in Gaza is the worst since the war began.\" The UN and other international aid groups have refused to work with the Gaza Humanitarian Foundation (GHF) - supported by Israel and the US - as they claim it is not neutral and forces the displacement of Palestinians by its distribution of aid. Read more:How the rollout of new Gaza aid system collapsed into chaos  As of Friday, GHF said that it has managed to distribute more than 2.1 million meals. Israel's UN ambassador Danny Danon said this week it would allow aid deliveries from both GHF and the UN's operations. Meanwhile, Hamas said it was still reviewing a US-proposed ceasefire a day after the White House said Israel accepted the offer. US President Donald Trump said in Washington that both sides were \"very close to an agreement on Gaza, and we'll let you know about it during the day or maybe tomorrow\". 👉 Listen to Sky News Daily on your podcast app 👈 The proposal reportedly calls for a 60-day pause in fighting, and the release of nine living hostages and half of the known hostages who have died, over the course of a week. Israel and Hamas would then continue talks to bring the remaining hostages home, but Israel would retain the right to resume military action in Gaza if talks were to break down. Read more from Sky News:Former UN chief calling Gaza war a 'genocide' marks extraordinary shiftCalls for UK to offer Gaza children life-saving treatmentFor Gaza's paramedics, every shift could be their last According to Reuters, some 28 Israeli hostages - alive and dead - would be returned in the first week of the ceasefire, in exchange for 125 Palestinian prisoners sentenced for life and the remains of 180 dead. The news agency added that the plan includes sending aid to Gaza as soon as Hamas agrees to its terms."
    },
    {
        "title": "Nigeria floods: At least 117 dead as heavy flooding submerges thousands of houses",
        "description": "At least 117 people have died and others are still missing after heavy flooding in Nigeria, an emergency official said.",
        "url": "https://news.sky.com/story/nigeria-floods-at-least-117-dead-as-heavy-flooding-submerges-thousands-of-houses-13377025",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-nigeria-flood_6931384.jpg?20250530165336",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-30 15:32:00",
        "Headline": "Heavy rain fell for several hours on Thursday, submerging a town in the Niger state. Media reports quoting local government officials said a dam collapse has worsened the situation.",
        "Content": " At least 117 people have died and others are still missing after heavy flooding in Nigeria, an emergency official said. Authorities initially said 21 people had died but this figure has today risen significantly. Media reports quoting local government officials said a dam collapse has worsened the situation. Ibrahim Hussaini, head of Niger State Emergency Management Agency, said some 3,000 houses were underwater in two communities. Videos posted on social media show floodwater sweeping through neighbourhoods, with rooftops barely visible above the brown currents. One clip shows a tanker floating through a town. The chairman of the Mokwa local government area suggested poor infrastructure has worsened the impact of the flooding. Jibril Muregi has appealed to the government to start \"long overdue\" construction of waterways in the area under a climate resilience project. \n                  More than 40% of Europe slides into drought, including pockets of Greece, southern Italy and Spain\n                 \n                  Four Just Stop Oil activists jailed for plotting to disrupt Manchester Airport\n                 \n                  Scientists embark on crucial study to save Britain's bees\n                 In a similar occurrence last September, torrential rains and a dam collapse in Nigeria's northeastern Maiduguri caused severe flooding, leaving at least 30 people dead and displacing millions. Nigeria is prone to flooding during the rainy season, which began in April - and flooding is becoming more common and extreme as the climate warms. Read more:More than 40% of Europe slides into droughtHow melting ice is boosting Russia's military Hotter air is thirstier and can hold more moisture - about 7% more for every 1C warmer - meaning it unleashes heavier flooding when it rains. Violent rain, which killed hundreds of people in Nigeria during 2022, was made at least 80 times more likely and 20% more intense by climate change, analysis by World Weather Attribution found."
    },
    {
        "title": "Former UN chief's labelling of Gaza war as 'genocide' marks extraordinary shift",
        "description": "In a stark and direct intervention, Martin Griffiths, the former UN humanitarian chief, has described the situation in Gaza as genocide.",
        "url": "https://news.sky.com/story/former-un-chiefs-labelling-of-gaza-war-as-genocide-marks-extraordinary-shift-13376992",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-yalda-hakim-martin_6931431.jpg?20250530172031",
        "type": "World",
        "Author": "Yalda Hakim",
        "Date Published": "2025-05-30 14:21:00",
        "Headline": "Martin Griffiths' choice of words \"signals a significant shift\" in how some in the international system are viewing events in Gaza, Sky's Yalda Hakim writes. ",
        "Content": "\n          Lead world news presenter\n              @SkyYaldaHakim\n  In a stark and direct intervention, Martin Griffiths, the former UN humanitarian chief, has described the situation in Gaza as genocide. The statement, made during an interview I conducted with Griffiths on The World, marks one of the most pointed accusations yet from a figure known to be deeply embedded in the world of international politics and diplomacy. \"I think now we've got to the point this is unequivocal. Of course it is genocide. Just as it is weaponising aid. \"We don't need to look behind ourselves to see that's the case. That should encourage us even more because we, of course, all doubted whether it would come to that level of definition. \"We all doubted whether famine is actually there. I think starvation is killing people. That's bad enough. We don't have to worry about famine, which is obviously there lurking in the shadows. \"Also, genocide… of course that's what has happened. We only need to look at the statements made. Prime Minister Netanyahu has the virtue of being very clear about his objectives.\"  His choice of words is extraordinary - not just for its gravity, but because it's Griffiths who is saying it. A veteran diplomat with decades of experience navigating complex international crises, Griffiths is known for his calm and thoughtful demeanour - not for inflammatory language. For him to use the term \"genocide\" in a television interview signals a significant shift in how some within the international system are now interpreting events on the ground in Gaza - 20 months since Israel launched its war.  Read more:How Gaza's new aid rollout system collapsed into chaosIsrael's illegal settlements - and those fighting back The timing is also noteworthy. Just weeks earlier, Tom Fletcher, another respected former British ambassador and current UN humanitarian chief, came close to using the phrase during a UN Security Council session. 👉 Click here to listen to The World With Richard Engel And Yalda Hakim wherever you get your podcasts 👈 He said: \"What more evidence do you need now? Will you act decisively to prevent genocide and to ensure respect for international humanitarian law? Or will you say instead: 'we did all we could?'\" Whilst he stopped short, his tone showed a clear change in how leading international figures now view the direction of Israeli military operations in Gaza; staggering civilian deaths, and the statements made by Israeli officials prosecuting this war.  Griffiths' remarks now go a step further. It comes as the British government continues to grapple with public anger over the mounting civilian toll - and faces growing scrutiny over its continued arms exports to Israel.  This latest statement by Griffiths doesn't just reflect humanitarian concern. As a former ambassador, he knows the weight his words carry. And with the humanitarian crisis in Gaza worsening, his warning challenges Israel's allies to ask deeply uncomfortable questions. Lawyers representing Israel against accusations brought by South Africa to the International Court of Justice last year - accusing its actions in Gaza of amounting to genocide - called the claims \"unfounded\", \"absurd\" and amounting to \"libel\". They went on to say Israel respected international law and had a right to defend itself."
    },
    {
        "title": "Imane Khelif will not be able to compete in female category at upcoming event due to new testing rules, body says",
        "description": "Boxing's new global governing body is introducing sex testing from July - but has already informed Imane Khelif she won't be eligible to compete as a female fighter at an event in the Netherlands next week.",
        "url": "https://news.sky.com/story/imane-khelif-boxer-must-undergo-sex-test-to-compete-in-female-category-world-boxing-says-13377092",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-imane-khelif-boxing_6931497.jpg?20250530180841",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-05-30 17:00:00",
        "Headline": "The controversial Algerian athlete will no longer be able to compete in the Eindhoven Box Cup from 5 June due to mandatory sex testing for all boxers.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Boxing's new global governing body is introducing sex testing from July - but has already informed Imane Khelif she won't be eligible to compete as a female fighter at an event in the Netherlands next week. The Algerian's disputed failed gender eligibility test - conducted by a different controversial boxing body - was a major issue at the Paris Olympics before she won gold. World Boxing said its new policy \"reflects concerns over the safety and wellbeing of all boxers, including Imane Khelif, and aims to protect the mental and physical health of all participants.\" This, it says, is \"in light of some of the reactions that have been expressed in relation to the boxer's potential participation at the Eindhoven Box Cup.\"  The governing body wrote to the Algerian Boxing Federation today to say: \"Imane Khelif may not participate in the female category at the Eindhoven Box Cup, 5-10 June 2025, and any World Boxing event until Imane Khelif undergoes genetic sex screening in accordance with World Boxing's rules and testing procedures. Read more on Sky News:Man appears in court over Liverpool attackTaylor Swift buys back rights to all master recordings \"In accordance with the World Boxing Statutes, amendments to the Competition Rules are typically made by Congress. \"However, under special or emergency circumstances, the World Boxing Executive Board holds the authority to make immediate amendments when a rule is deemed no longer functional or when evolving conditions necessitate a change. \"In May 2025, the Executive Board exercised this authority and adopted new eligibility criteria for participation in sex-specific boxing categories.\" It added: \"These new eligibility rules were developed with the express purpose of safeguarding athletes in combat sports, particularly given the physical risks associated with Olympic-style boxing.\" The move towards mandatory testing forms part of a new policy on \"Sex, Age and Weight\", the boxing chiefs said. It aims to \"deliver a competitive level playing field for men and women.\" The policy - which is currently in its final stages of development - was created by \"examining data and medical evidence\" from a variety of sources, including global experts. It will come into force on 1 July this year - and will include an appeals process."
    },
    {
        "title": "Former Sinn Fein leader awarded thousands in damages after winning libel action against BBC",
        "description": "Former Sinn Fein leader Gerry Adams has been awarded &#8364;100,000 (&#163;84,000) in damages after winning his defamation action against the BBC.",
        "url": "https://news.sky.com/story/former-sinn-fein-leader-gerry-adams-wins-bbc-defamation-case-13375429",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gerry-adams-dublin_6931104.jpg?20250530121200",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-30 10:09:00",
        "Headline": "Gerry Adams, 76, claimed a BBC Spotlight programme and an online article published in 2016 defamed him by falsely accusing him of sanctioning the murder of British informant Denis Donaldson.",
        "Content": " Former Sinn Fein leader Gerry Adams has been awarded €100,000 (£84,000) in damages after winning his defamation action against the BBC. The 76-year-old had claimed a BBC Spotlight programme and an online article published in 2016 defamed him by alleging he sanctioned the murder of former Sinn Fein official Denis Donaldson, for which he denies any involvement. A jury at the High Court in Dublin found in his favour on Friday after determining that was the meaning of words included in the programme and article. It also found the BBC's actions were not in good faith and the corporation had not acted in a fair and reasonable way. Mr Donaldson, 55, was shot dead at a cottage near Glenties, County Donegal in 2006, months after being exposed as a British agent. The dissident republican group the Real IRA claimed responsibility for the killing in 2009 and a Garda investigation is ongoing. During the civil defamation trial, Mr Adams claimed the Spotlight programme was an \"attempted hatchet job\" that was \"full of inaccuracies\". \n                  Gerry Adams libel victory: 'Putting manners' on the BBC or 'hindering freedom of expression'?\n                 \n                  Wynne Evans leaves BBC radio show after controversy\n                 \n                  Gary Lineker bows out from Match Of The Day\n                 The programme featured an anonymous source named \"Martin\" who said that murders had to be approved by the political and military leadership of the IRA. When pressed on who he was referring to, \"Martin\" replied: \"Gerry Adams. He gives the final say\". Mr Adams, who spent seven days in the witness box during the trial, described the allegation as a \"grievous smear\". He told the court that he had \"liked\" Mr Donaldson and was \"shocked\" to learn of his murder. \"Personally, I think Denis Donaldson was a victim of the conflict. I don't see any other way of describing it,\" he said. Speaking outside court after the verdict, Mr Adams, who spoke in both Irish and English, said this case was \"about putting manners on the British Broadcasting Corporation\". Mr Adams told reporters: \"The British Broadcasting Corporation upholds the ethos of the British state in Ireland, and in my view it's out of sync in many, many fronts with the Good Friday Agreement. \"It hasn't caught on to where we are on this island as part of the process, the continuing process, of building peace and justice, and harmony, and, hopefully, in the time ahead, unity.\" Mr Adams added that he was \"very mindful of the Donaldson family\" in the course of the case. He continued: \"I want to say that the Justice Minister Jim O'Callaghan should meet the family of Denis Donaldson as quickly as possible, and that there's an onus on both governments and everyone else, and I include myself in this, to try and deal with these legacy issues as best that we can.\" Asked what the outcome of the case might mean for his reputation, Mr Adams replied: \"I've always been satisfied with my reputation. \"Obviously, like yourself, we all have flaws in our character, but the jury made the decision and let's accept the outcome, and I think let's accept what the jury said.\" Mr Adams's legal team sought at least €200,000 (£168,000) in damages. The former Sinn Fein president had said he would give any award received to good causes. His testimony during the trial was wide-ranging, including a lengthy account of his early years and political awakenings. At times, he became emotional as he recalled past events. Read more from Sky News:Man appears in court over Liverpool parade collisionRussell Brand pleads not guilty to rapeHow melting ice is boosting Russia's military The BBC denied it defamed Mr Adams and claimed the Spotlight programme and article were put out in good faith and during the course of discussion on a subject of public and vital interest. It defended its \"responsible journalism\" and said that it was the result of careful investigation. The BBC also argued it was merely reporting allegations, rather than standing over them. The British public service broadcaster also argued it would be a \"cruel joke\" to award the former Sinn Fein president any damages. Adam Smyth, director of BBC Northern Ireland, expressed disappointment at the outcome of the case. Speaking to media outside court, Mr Smyth said: \"We believe we supplied extensive evidence to the court of the careful editorial processes and journalistic diligence applied to this programme, and to the accompanying online article. \"Moreover, it was accepted by the court and conceded by Gerry Adams' legal team that the Spotlight broadcast and publication were of the highest public interest. \"We didn't want to come to court but it was important that we defend our journalism and we stand by that decision. \"[Northern Ireland's] past is difficult terrain for any jury and we thank them for their diligence and careful consideration of the issues in this case. \"The implications of their decision, though, are profound. As our legal team made clear, if the BBC's case cannot be won under existing Irish defamation law, it is hard to see how anyone's could, and they warned how today's decision would hinder freedom of expression.\" BBC Spotlight reporter Jennifer O'Leary said: \"I said in the witness box that I had nothing to hide, only sources to protect, and I want to thank them for trusting me. \"I'm a big believer in trying your best in life and going about your business with integrity, and I want to pay a particular tribute to our witnesses in court, senator Michael McDowell, Trevor Ringland, and in particular Ann Travers, who spoke so courageously. \"There are thousands of Ann Travers across this island and in Britain, victims and survivors of the Troubles, and in the years of violence after the peace agreement ... those people carry the burden of their grief and trauma with incredible dignity and courage, and they are the people I am thinking of, I know my colleagues are also thinking of. I am thinking of all of them today.\""
    },
    {
        "title": "More than 90 wildfires are out of control in Canada",
        "description": "Dozens of enormous wildfires have erupted across Canada, already forcing 21,000 evacuations and spewing toxic smoke into the air.",
        "url": "https://news.sky.com/story/more-than-90-wildfires-are-out-of-control-in-canada-13377002",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-canada-wildfire_6931683.jpg?20250530223713",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-05-30 14:37:00",
        "Headline": "Canada was battling 175 wildfires on Friday, of which 95 were uncontained, prompting evacuations and a military response. Officials warned that worse is probably still yet to come.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Dozens of enormous wildfires have erupted across Canada, already forcing 21,000 evacuations and spewing toxic smoke into the air. The provinces of Manitoba and Saskatchewan have both declared a state of emergency, as several separate blazes raged out of control. Canada's Prime Minister Mark Carney is sending in the military to help move residents and fight fires in Manitoba, where 17,000 people have been forced to evacuate. Manitoba Premier Wab Kinew called it the province's largest such exodus in living memory. In Saskatchewan, where 4,000 people have fled their homes, the conditions are \"as severe\" as \"anything that we have faced for quite some period of time, if not ever\", premier Scott Moe said. With no rain in the forecast, and a hot and dry summer on the horizon, the blazes are expected to balloon. Mr Moe added: \"I think there's an admission here that things are going to get worse before they get better.\" Much of the country is currently exceptionally dry and warm. On Friday, 175 active fires were burning, of which 95 were out of control, according to the Canadian Interagency Forest Fire Centre. In recent years, Canadian fires have billowed dirty smoke across North America, famously spreading ominous, orange-tinted skies and filthy air across New York in 2023. Air quality in Arrowhead, Minnesota, is deemed unhealthy for people and animals sensitive to pollution and other airborne particles, according to the Environmental Protection Agency's AirNow page. Daniel Swain, climate scientist and meteorologist at University of California, Los Angeles (UCLA), said smoke from Canada was already visible in the western US state of Colorado today, carried by favourable winds. The intense fires early in the year will likely \"have knock-on effects in the US later this fire season\", he warned. The countries share firefighting resources and will likely have to battle strong wildfire seasons at the same time later this year, creating competition for supplies. This challenge will be \"compounded by recent severe cuts to emergency response, wildland firefighting, and weather prediction\" by the Trump administration, added Dr Swain. In response, White House spokeswoman Abigail Jackson described Mr Swain as a \"longtime Democrat donor who has spent hundreds of dollars supporting liberal politicians, including loser Kamala Harris, with radical climate policies that the American people have repeatedly rejected\". \"President Trump is remaking our disaster response to keep all Americans safe by ending the ineffective ways of the past and working with state and local governments to invest in their own resilience before disaster strikes.\" Figures from the Federal Election Commission show Dr Swain's contributions since 2018 add up to less than $1,000. What causes Canada's wildfires? Canada is no stranger to wildfires, which can be sparked by human or natural causes like lightning, and are also influenced by the way the land is managed. But climate change is creating more fuel for them, as hotter air dries out the land. Fire-friendly weather that created exceptional blazes in eastern Canada in 2023 was made at least seven times more likely by climate change, scientists at World Weather Attribution found. Justin Murgai, CEO of WaterAid Canada, told Sky News: \"The growing scale and severity of wildfires in Canada are a stark reminder of our changing climate.\" He said the fires \"threaten air quality, displace families, and stretch essential services to breaking point, often contaminating water sources and cutting off communities from safe water\"."
    },
    {
        "title": "More than 40% of Europe slides into drought, including pockets of Greece, southern Italy and Spain",
        "description": "Well over a third of Europe, including parts of holiday destinations like Spain, Greece and Italy, are now in drought.",
        "url": "https://news.sky.com/story/more-than-40-of-europe-slides-into-drought-including-pockets-of-greece-southern-italy-and-spain-13376787",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-walchensee-water-low_6931001.jpg?20250530094407",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-05-30 08:07:00",
        "Headline": "More than 40% of Europe is now in some form of drought, brewing trouble for farmers in northern Europe and firefighters in Greece, where \"overtourism\" is making matters worse.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Well over a third of Europe, including parts of holiday destinations like Spain, Greece and Italy, are now in drought. March was Europe's warmest on record - a trend driven by climate change - and also saw below average rain across large parts of the north and east of the continent. Now 41.2% of Europe finds itself in some form of drought, according to the latest update from the EU's European Drought Observatory, which covers 11 to 20 May. It is most acute in pockets of south-eastern Spain, Cyprus, Greece and Albania, where the strongest \"alert\" category has been issued, as well as parts of Poland and Ukraine. But broad stretches of northern and eastern Europe through France, Germany, Poland and Ukraine also drying up, sowing concerns about crop yields. On Thursday, the UK's Environment Agency officially declared a drought in North West England after river and reservoir levels were licked away by a dry spring. Greece tourism is 'unsustainable' In Greece, \"overtourism\" from millions flocking to its beaches adds further pressure to water supplies, said Nikitas Mylopoulos, professor of water resource management at Thessaly University. \"The tourist sector is unsustainable and there is no planning... leading to a tremendous rise in water demand in summer,\" he told Sky News. \"The islands have an intense problem of drought and water scarcity.\" Islands like Santorini and Mykonos are now forced to ship in water from Athens or desalination plants to provide for showers and swimming pools. In the past, many residents could make do with local methods like rainwater harvesting. But agriculture is a far bigger drain on the country's water, with waste rife and policies lacking, said Prof Mylopoulos.  Wildfire season could be 'particularly difficult'  This year's hot and dry conditions are also fuelling the risk of yet another fierce wildfire season in Greece. Last week civil protection minister Ioannis Kefalogiannis warned of a \"particularly difficult\" summer. He said a record 18,000 firefighters have been deployed and the drone fleet almost doubled in a bid to combat fires being fuelled by a hotter climate. Droughts and their causes are more complicated, but scientists at World Weather Attribution say global warming is exacerbating drought in some parts of the world, including around the Mediterranean. They found the drought of 2022, which spread across the Northern Hemisphere, was made 20 times more likely by climate change. The International Hydropower Association said drought and intense rain in Europe are pushing power plants to \"operate at the limits of their existing equipment\". Extreme weather costs the EU about €28.3bn (£23.8bn) in lost crops and livestock per year, according to insurance firm Howden. Hayley Fowler, professor of climate change impacts at Newcastle University, said: \"With global warming, we expect more prolonged and intense droughts and heatwaves punctuated by more intense rainfall, possibly causing flash floods. \"In recent years, we have experienced more of these atmospheric blocks, causing record heat and persistent drought, as well as severe flooding in other locations in Europe. \"Recent months have been no different, with prolonged dry conditions and heatwaves in northern Europe and floods in southern Europe.\""
    },
    {
        "title": "Truck driver found guilty of murdering wife after her remains were found under stairs",
        "description": "A truck driver has been found guilty of murdering his wife, whose remains were found under the stairs at their home in Ireland.",
        "url": "https://news.sky.com/story/truck-driver-found-guilty-of-murdering-wife-after-her-remains-were-found-under-stairs-13376910",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-richard-satchwell-2023_6931164.jpg?20250530125238",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-30 11:34:00",
        "Headline": "Richard Satchwell, originally from Leicester, had denied the murder of Tina Satchwell. Her remains were discovered at the Co Cork property in October 2023, six years after her husband reported her missing.",
        "Content": "A truck driver has been found guilty of murdering his wife, whose remains were found under the stairs at their home in Ireland. Richard Satchwell, originally from Leicester, had denied the murder of Tina Satchwell on a date between 19 March and 20 March 2017. Her skeletal remains were discovered at the Co Cork property in October 2023, six years after her husband reported her missing. The Briton, 58, did not react as the unanimous verdict was read to the Central Criminal Court in Dublin. The jury had been deliberating since Tuesday afternoon. During the five-week trial, jurors heard from more than 50 witnesses, including police officers involved in the investigation. Police discovered Mrs Satchwell's remains buried under the stairs in the living room of their home. Her badly decomposed body was wrapped in a soiled sheet and covered with a black plastic sheet. She was wearing pyjamas with a dressing gown, with the belt of the gown wrapped around her. A state pathologist said she could not establish the exact cause of death because of how decomposed the body was. Read more from Sky News:How melting ice is boosting Russia's militaryHamas says Gaza ceasefire plan 'under discussion' During police interviews, Satchwell said that on the morning of 20 March 2017 he found his wife standing at the bottom of the stairs with a chisel in her hand, scraping off the plasterboard, and claimed she came at him with the object and he fell back on to the floor. He said Mrs Satchwell tried to stab him multiple times with the chisel and he grabbed her clothing and restrained her by putting the belt of the robe against her neck. Satchwell said that in a very short period of time she went limp and fell into his arms. He said he put her body on the sofa in the living room, before moving her to the chest freezer and then burying her under the stairs. Relatives of Mrs Satchwell wept as the guilty verdict was returned. He will be sentenced on 4 June."
    },
    {
        "title": "Elon Musk reveals when he hopes to launch mission crewed by robots to Mars",
        "description": "Elon Musk has said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of next year.",
        "url": "https://news.sky.com/story/elon-musk-reveals-when-he-hopes-to-launch-mission-crewed-by-robots-to-mars-13376914",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-spacex-starship_6931174.jpg?20250530125808",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-30 11:50:00",
        "Headline": "In a video update, the tech billionaire said meeting the schedule depended on overcoming technical challenges, and gave SpaceX a 50-50 chance of success.",
        "Content": "Elon Musk has said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of next year. The tech billionaire outlined his latest schedule for Starship in a video presented at the project's Starbase home in Texas and posted online on Thursday. The SpaceX founder had been set to give a presentation, called The Road to Making Life Multiplanetary, on Tuesday night, following a ninth test flight of the spacecraft earlier that evening. But the speech was cancelled after the vehicle spun out of control about 30 minutes into the launch, having not achieved some of its most important test goals.  And on Wednesday, Musk confirmed his brief but tumultuous spell in the Trump administration as head of the Department of Government Efficiency (DOGE) was ending. Musk warned there was no guarantee he would be able to meet the Starship timeframe he set out and much depended on overcoming a number of technical challenges, during flight-test development, especially a post-launch refuelling operation while orbiting Earth. He previously said he aimed to send an unmanned vehicle to the red planet as early as 2018 and had targeted 2024 to launch a first crewed mission there. \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Humans would land on Mars as part of the second or third flights, he said on Thursday, but the first trip would be in the hands of one or more humanoid Optimus design robots built by Tesla, the electric vehicle and battery maker he leads. The current target to land a human on Mars using Starship is 2028, but it has yet to make an orbit of Earth. Musk said he wants to make it so that \"anyone who wants to move to Mars and help build a new civilisation can do so. Anyone out there. How cool would that be?\". At the end of 2026, Mars and Earth align around the sun, reducing the distance between the two planets to its shortest, but still seven to nine months' travelling time by spacecraft. Musk said they had a 50-50 chance of meeting that deadline and if Starship isn't ready by then, SpaceX would wait another two years before trying again. NASA, which hopes to land astronauts on Mars sometime in the 2030s, is planning to use Starship to return humans to the surface of the moon as early as 2027 - more than 50 years after the last lunar landings of the Apollo era. Read more:What latest Starship failure means'Unique' bacteria found on space stationHow long before the UK is launching rockets? Starship's previous test flights in January and March also failed, with the spacecraft exploding moments after lift-off, raining debris over parts of the Caribbean and forcing scores of commercial jets to change course as a precaution. Musk shrugged off the latest mishap on Tuesday with a brief post on X, saying it produced a lot of \"good data to review\" and promising a faster launch \"cadence\" for the next several test flights."
    },
    {
        "title": "Trump to double tariffs on steel imports - as he threatens China",
        "description": "Donald Trump said he plans to double tariffs on steel imports from next week, deepening his trade war which has hit global markets.",
        "url": "https://news.sky.com/story/trump-to-double-tariffs-on-steel-imports-as-he-threatens-china-13377208",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-steel_6931732.jpg?20250531003052",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-30 23:22:00",
        "Headline": "The US president says the levy - also affecting aluminium imports - will be in effect from Wednesday and that American \"industries are coming back like never before\".",
        "Content": "Donald Trump said he plans to double tariffs on steel imports from next week, deepening his trade war which has hit global markets. The US president told a rally of steel workers in West Mifflin, Pennsylvania, on Friday that tariffs would be raised from 25% to 50%, \"which will even further secure the steel industry in the United States\". Mr Trump later said on Truth Social that the new levy - also affecting aluminium imports - would be in effect from Wednesday and that American \"industries are coming back like never before\". \"This will be yet another BIG jolt of great news for our wonderful steel and aluminum (sic) workers,\" he added. \"MAKE AMERICA GREAT AGAIN!\" He then said: \"We don't want America's future to be built with shoddy steel from Shanghai - we want it built with the strength and the pride of Pittsburgh!\" Sky News understands that British steel exports are exempt from this rise after a UK-US trade agreement was signed earlier this month. The agreement said at the time that the US \"will promptly construct a quota at most favoured nation (MFN) rates\" for British steel, aluminium and derivative products. \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Read more: Key details in the UK-US 'historic' trade deal  Earlier, the US president claimed China had \"totally violated\" an agreement to mutually roll back tariffs and trade restrictions for critical minerals. \"So much for being Mr Nice Guy,\" he said in a post on his social media platform. In March, Mr Trump introduced a 25% tariff on all foreign steel and aluminium imports as a way to protect US manufacturing and bolster jobs by making foreign-made products less attractive. The rates threaten to make the cost of products using steel and aluminium - such as cars or soft drink cans - more expensive for Americans. He also previously threatened Canada with 50% levies on imports, while the provincial government of Ontario, in turn, threatened to charge 25% more for the electricity it supplies to the US. Canada's most populous province provides electricity to more than 1.5 million American homes and businesses in Minnesota, New York and Michigan. At the time, Canadian Prime Minister Mark Carney called the proposed 50% tariffs an \"attack\" on Canadian workers, families and businesses. Read more:Musk appears with black eye at White House farewellTrump tariffs can stay in place for now amid legal challengeTrump furious over 'TACO' dig - what inspired the phrase? Roughly a quarter of all steel used in the US is imported, with a majority coming from Mexico, Canada, Japan, South Korea and Germany. In 2024, 6.6m tonnes of steel were imported by the US from Canada, while 3.5m tonnes were brought in from Mexico. The US is also reliant on imports for aluminium, with 3.2m tonnes coming from Canada last year."
    },
    {
        "title": "Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'",
        "description": "Elon Musk has formally left his role in Donald Trump's administration.",
        "url": "https://news.sky.com/story/musk-appears-with-black-eye-at-white-house-farewell-as-trump-says-hes-not-really-leaving-13376824",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-musk-trump_6931566.jpg?20250530192043",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-30 18:00:00",
        "Headline": "Donald Trump confirmed the expected departure of tech billionaire Elon Musk at a news conference at the White House on Friday.",
        "Content": " Elon Musk has formally left his role in Donald Trump's administration. Mr Musk sported a black eye at a press conference with Mr Trump in which the president confirmed the tech billionaire's expected departure on Friday. The billionaire owner of Tesla, SpaceX, and X said his five-year-old son X Æ A-12, or X for short, was responsible for the bruising. \"I was horsing around with my son... I said 'go ahead and punch me in the face', and he did,\" Mr Musk told reporters in the Oval Office. \"It turns out a five-year-old can punch, actually. I didn't really feel much at the time.\"  At the press conference, Mr Trump thanked Mr Musk \"for his incredible service\" with his work for his help setting up and running the Department of Government Efficiency, or DOGE, and suggested he would continue to be \"back and forth\". The US president handed Mr Musk a golden key in a White House-branded box, which he described as a \"special present\". \"Elon gave an incredible service. [There is] nobody like him. And he had to go through the slings and the arrows, which is a shame, because he is an incredible patriot,\" Mr Trump said. \"Some of the media organisations in this room are the slingers,\" Mr Musk said when asked about the \"slings and arrows\" in an apparent dig at The New York Times. The US president praised Mr Musk as \"one of the greatest business leaders and innovators the world has ever produced\", commending him for \"stepping forward to put his talents into our nation\" by leading DOGE. Meanwhile, Mr Musk, who was wearing a DOGE-branded baseball cap and a T-shirt with \"The Dogefather\" written on it, said it was \"not the end of DOGE, but the beginning\" and that the DOGE team would \"only grow stronger\". The 53-year-old added that he would continue to visit the White House and would still be an adviser to Mr Trump. During the press conference, Mr Trump also turned to various conflicts around the globe, telling reporters that Israel and Hamas are \"very close to an agreement\" for a ceasefire in Gaza. The president said an agreement with Iran to stop it from developing nuclear weapons was also \"very close\". Meanwhile, following recent tensions between India and Pakistan, Mr Trump took credit for de-escalating the situation between the two countries. Read more from Sky News:How USAID cuts are affecting the world'Harvard isn't Harvard anymore' The US president had handed Mr Musk the task of cutting government spending by sacking federal workers and eliminating bureaucratic waste as head of the newly formed DOGE department. Mr Musk oversaw drastic cuts to America's humanitarian efforts, leading to criticism that the US was relinquishing some of its global influence. Despite promising to save taxpayers as much as $2trn (£1.5trn), DOGE currently estimates its efforts have saved $175bn (£130bn). Mr Musk claimed the savings could be even higher, saying in the Oval Office on Friday: \"We do expect over time a trillion dollars in savings. Say by the middle of next year, with presidential support, we can do it.\"  Mr Trump read out a list of savings DOGE has allegedly made, including cutting $101m spent on DEI (diversity, equity and inclusion) policies in the Department of Education, $59m on hotel rooms for migrants in New York, $42m on a project for social and behavioural change in Uganda, £24m \"for an Arab Sesame Street\" and $8m \"for making mice transgender\". But questions have been raised about whether the department has actually saved taxpayers as much money as suggested. Meanwhile, Mr Musk - who famously brought his son X Æ A-12 to the Oval Office - has expressed frustration about resistance to his ideas, and clashed with other senior members of the Trump administration. He claimed DOGE had been blamed for cuts that had nothing to do with his department. \"What we found was happening was if there were any cuts anywhere, people would assume that was done by DOGE,\" he explained. \"We essentially became the 'DOGE' boogie man.\" It comes after Mr Musk's father, Errol Musk, speaking to Gillian Joseph on The World earlier this week, insisted there had been \"no rift between Elon and Donald Trump\".  As a \"special government employee\", US law allowed Mr Musk to serve for 130 days, which would have ended around Friday. He announced he was leaving in a post on X, in which he said: \"I would like to thank President Donald Trump for the opportunity to reduce wasteful spending.\""
    },
    {
        "title": "Loretta Swit, Emmy-winning actress and star of M*A*S*H, dies aged 87",
        "description": "Loretta Swit, who won Emmy Awards for her role on the comedy series M*A*S*H, has died aged 87.",
        "url": "https://news.sky.com/story/loretta-swit-emmy-winning-actress-and-star-of-mash-dies-aged-87-13377161",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-loretta-swit-1971-celebrity_6931642.jpg?20250530211035",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-30 19:58:00",
        "Headline": "Loretta Swit was best known for her star turn as Major Margaret Houlihan on CBS' M*A*S*H, which aired for 11 years from 1972 to 1983 and saw her win two Emmy Awards.",
        "Content": "Loretta Swit, who won Emmy Awards for her role on the comedy series M*A*S*H, has died aged 87. Her publicist, Harlan Boll, said the actress passed away at her home in New York City just after midday on Friday, likely from natural causes. She was best known for her star turn as Major Margaret Houlihan on CBS' M*A*S*H, which aired for 11 years from 1972 to 1983. Based on Robert Altman's 1970 film of the same name, M*A*S*H has been ranked as one of the greatest shows of all time by Rolling Stone and Time Out, with the finale watched by more than 100 million viewers - the most-watched episode of any scripted series ever. In the film, Major Margaret Houlihan was a one-dimensional, promiscuous character nicknamed Hot Lips, but the character was developed and deepened in the show. Swit told Suzy Kalter, author of \"The Complete Book of M*A*S*H,\" that as the show went on, \"I decided to try to play her as a real person, in an intelligent fashion, even if it meant hurting the jokes\". She won Emmy Awards for Outstanding Supporting Actress in a Comedy Series in 1980 and 1982 for her role in the show. \n                  Trump to double tariffs on steel imports - as he threatens China\n                 \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Born Loretta Jane Szwed in Passaic, New Jersey, in 1937, she was the daughter of Polish immigrants. She enrolled in the American Academy of Dramatic Arts before arriving in Hollywood in 1969. Along with M*A*S*H, she made appearances in shows like Gunsmoke, Hawaii Five-O, Mission Impossible and Bonanza. Swit also made regular appearances in theatre, starring on Broadway in 1975 in Same Time, Next Year, and The Mystery of Edwin Drood in 1986. Swit also appeared in a number of TV musical specials, including The Muppet Show and the Broadway musical It's a Bird, It's a Plane, It's Superman."
    },
    {
        "title": "Elon Musk reveals when he hopes to launch mission crewed by robots to Mars",
        "description": "Elon Musk has said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of next year.",
        "url": "https://news.sky.com/story/elon-musk-reveals-when-he-hopes-to-launch-mission-crewed-by-robots-to-mars-13376914",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-spacex-starship_6931174.jpg?20250530125808",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-30 11:50:00",
        "Headline": "In a video update, the tech billionaire said meeting the schedule depended on overcoming technical challenges, and gave SpaceX a 50-50 chance of success.",
        "Content": "Elon Musk has said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of next year. The tech billionaire outlined his latest schedule for Starship in a video presented at the project's Starbase home in Texas and posted online on Thursday. The SpaceX founder had been set to give a presentation, called The Road to Making Life Multiplanetary, on Tuesday night, following a ninth test flight of the spacecraft earlier that evening. But the speech was cancelled after the vehicle spun out of control about 30 minutes into the launch, having not achieved some of its most important test goals.  And on Wednesday, Musk confirmed his brief but tumultuous spell in the Trump administration as head of the Department of Government Efficiency (DOGE) was ending. Musk warned there was no guarantee he would be able to meet the Starship timeframe he set out and much depended on overcoming a number of technical challenges, during flight-test development, especially a post-launch refuelling operation while orbiting Earth. He previously said he aimed to send an unmanned vehicle to the red planet as early as 2018 and had targeted 2024 to launch a first crewed mission there. \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Humans would land on Mars as part of the second or third flights, he said on Thursday, but the first trip would be in the hands of one or more humanoid Optimus design robots built by Tesla, the electric vehicle and battery maker he leads. The current target to land a human on Mars using Starship is 2028, but it has yet to make an orbit of Earth. Musk said he wants to make it so that \"anyone who wants to move to Mars and help build a new civilisation can do so. Anyone out there. How cool would that be?\". At the end of 2026, Mars and Earth align around the sun, reducing the distance between the two planets to its shortest, but still seven to nine months' travelling time by spacecraft. Musk said they had a 50-50 chance of meeting that deadline and if Starship isn't ready by then, SpaceX would wait another two years before trying again. NASA, which hopes to land astronauts on Mars sometime in the 2030s, is planning to use Starship to return humans to the surface of the moon as early as 2027 - more than 50 years after the last lunar landings of the Apollo era. Read more:What latest Starship failure means'Unique' bacteria found on space stationHow long before the UK is launching rockets? Starship's previous test flights in January and March also failed, with the spacecraft exploding moments after lift-off, raining debris over parts of the Caribbean and forcing scores of commercial jets to change course as a precaution. Musk shrugged off the latest mishap on Tuesday with a brief post on X, saying it produced a lot of \"good data to review\" and promising a faster launch \"cadence\" for the next several test flights."
    },
    {
        "title": "'Harvard isn't Harvard anymore': The crucible of free speech lacking the freedom it once had",
        "description": "Harvard graduates have a lot to say. In a sign of the times, now isn't the time to say it.",
        "url": "https://news.sky.com/story/harvard-isnt-harvard-anymore-the-crucible-of-free-speech-lacks-the-freedom-it-once-had-13376717",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-students-james-matthews_6930861.png?20250530024337",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-05-30 01:03:00",
        "Headline": "The Trump administration had revoked Harvard University's ability to host international students, a move challenged and temporarily halted by the courts. At the gates of America's oldest university, there is a reluctance to talk about it.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Harvard graduates have a lot to say. In a sign of the times, now isn't the time to say it. That much was clear when I sought student opinion at the gates of America's oldest university. There is a reluctance to talk about Trump. \"He needs to come back to this country,\" said a Harvard dad of his son, politely declining an interview on the youngster's behalf. The young man, British, falls into the category of international student - a vulnerable species, currently, in America's elite university system. For him, saying the 'wrong' thing carries the risk of an exclusion order to go with his graduation certificate. Dad knows best. It is the modern reality at the gates of Harvard - this iconic seat of learning and crucible of free speech and ideas isn't as free as it was. For now, at least. Read more:Trump administration halts international student visa applications It's fair to say Harvard had other things on its mind this week, with Thursday's 'commencement' day and graduation parades winding their route through surrounding streets in a 'town and gown' spectacle. There were bagpipes and brass bands to lead students in their crowning moment. It was an emotional thank you and goodbye to Harvard, with a celebration soundtrack of music and 'mwah'. And yet, there was a political undercurrent. There has to be, when a US institution is at war with its president. Some students wore a white flower on their lapel as a symbol of solidarity with Harvard's international students. In giving his speech at the podium, Harvard president Alan Garber was given a standing ovation when he noted that graduates hail from \"around the world, just as it should be\". As graduates and families gathered in Harvard Yard, the university's defiance against Trump was playing out simultaneously in court, where the latest hearing took place on government efforts to stop the enrolment of foreign students. Leo Gerden, a 22 year-old student from Sweden, was graduating in economics and government. We chatted while he stiffened himself with a Starbucks for the celebrations ahead. What were his thoughts, as someone fitting the profile picked on by the government of his host country? \"I feel like the entire Harvard is under attack, because without its international students, Harvard is not Harvard anymore,\" he said. \"He's trying to crush us, but we have shown over the last couple of weeks that he won't do that easily. The uncertainty itself is going to cause a lot of harm. \"People are definitely reconsidering their plans right now, whether it was coming to America, going to any university, because they might be next on Trump's target list.\" 👉 Follow Trump100 on your podcast app 👈 The distraction is widely shared across campus, so is the sentiment - not that it will trouble the White House. Places like Harvard don't lean towards Trump, and he will lose a few votes in this fight. It is a conflict to shape the future of US education - it's politics, but it's much more."
    },
    {
        "title": "Taylor Swift buys back rights to all master recordings - but it's bad news for Reputation fans",
        "description": "Taylor Swift has bought back all the rights to her master recordings - but has suggested she won't be re-releasing her Reputation album. ",
        "url": "https://news.sky.com/story/taylor-swift-buys-back-rights-to-all-master-recordings-but-its-bad-news-for-reputation-fans-13377026",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-taylor-swift-eras-tour_6801775.jpg?20250116225711",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-30 15:35:00",
        "Headline": "Taylor Swift shared the news with fans saying, \"you belong with me\", as she clutched vinyl copies of her first six albums. ",
        "Content": "Taylor Swift has bought back all the rights to her master recordings - but has suggested she won't be re-releasing her Reputation album.  \"All the music I've ever made now belongs to me,\" the star announced on her official website. \"I've been bursting tears of joy... ever since I found out this is really happening.\" The pop star had originally lost the rights to her first six albums in 2019 when her first record label, Big Machine, sold them to music executive Scooter Braun. After she learned Braun had acquired her musical catalogue, she opened up about it in a lengthy Tumblr post, blaming him for being complicit in Kanye West's \"incessant, manipulative bullying\" of her. Swift said she was not given the opportunity to buy her work outright, and so, in a bid to diminish the value of the master tapes, she set about re-recording them. She had re-released four \"Taylor's Version\" albums to date. Just her self-titled debut album and Reputation remained. Braun later sold his stake in her albums to Shamrock Holdings, a Los Angeles investment fund, in a deal reported to be worth £222 million. It is not known how much Swift paid Shamrock to re-acquire the rights to her songs. Swift said she was \"forever grateful\" to Shamrock for allowing her to buy the rights to her music back. \"This was a business deal to them, but I really felt like they saw it for what it was to me: My memories and my sweat and my handwriting and my decades of dreams,\" Swift wrote on her website. \"I am endlessly thankful. My first tattoo might just be a huge shamrock in the middle of my forehead.\" By Arts and Entertainment producer Jayson Mansaray Such is the power Swift has over her fanbase, by re-recording almost identical songs and encouraging Swifties to stream the new versions, it is likely to have devalued the rights that had been sold without her.  This means Taylor Swift potentially acquired the back catalogue for a fraction of what Scooter or Shamrock paid.   How much it cost to re-acquire her song rights has not been disclosed but it looks like she won't be re-recording the Debut and Reputation albums.  So the good news comes with a cruel summer for fans who had particularly been anticipating the latter’s re-release. What it means for Reputation fans Just two albums remained to be re-released by Swift - her self-titled debut album and Reputation. The latter was a particularly strong source of speculation among fans, who would look for clues in her outfits during her record-breaking Era's tour. But this announcement could spell the end of that. \"Full transparency: I haven't even re-recorded a quarter of it,\" Swift said.  She said Reputation was \"so specific\" to a certain time in her life, that she kept hitting a block when she tried to re-record it. She also said she felt it was the first album she could not improve by re-recording it. Debut has been re-recorded, with Swift saying she \"loves how it sounds now\". Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record But both albums could still \"re-emerge when the time is right\", particularly the unreleased tracks. \"If it happens, it won't be from a place of sadness and longing for what I wish I could have,\" Swift said. How Swift's stance changed the music industry In the music industry, the owner of a master controls all rights to their artists' recordings. This is usually agreed in contracts with artists, and allows them to recoup the financial investment they make in stars, including funding production, marketing and promotion. It also means they can distribute it to new streaming services or license the songs to be used in movies. Swift, as co-writer of her music, had always maintained publishing rights. \"I do want my music to live on. I do want it to be in movies. I do want it to be in commercials. But I only want that if I own it,\" she told Billboard in 2019. Swift said today she had been \"heartened by the conversations this saga had reignited within my industry among artists and fans\". \"Every time a new artist tells me they negotiated to own their master recordings in their record contract because of this right, I'm reminded of how important it was for all of this to happen.\""
    },
    {
        "title": "Man killed after waste container he was sleeping in was emptied into bin lorry",
        "description": "A man has been killed and another was injured in the US after a waste container they were sleeping in was emptied into a bin lorry.",
        "url": "https://news.sky.com/story/man-killed-after-waste-container-he-was-sleeping-in-was-emptied-into-bin-lorry-13376799",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-bin-lorry-new-york_6931037.png?20250530102054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-30 08:24:00",
        "Headline": "Two men had been in the container outside a shopping centre on Long Island, New York, on Thursday, police said.",
        "Content": "A man has been killed and another was injured in the US after a waste container they were sleeping in was emptied into a bin lorry. The two men had been in the large bin outside a shopping centre on Long Island in New York on Thursday, according to Suffolk County police. Someone spotted a person inside the back of the lorry when the truck stopped outside a school nearly six miles away around 6.30am. The person was removed and taken to hospital to be treated for a leg injury. The other man was pronounced dead at the scene. Police said the medical examiner's office will establish the cause of death, but they do not believe the man was dead before he ended up in the lorry. Officers did not identify either man, but said they were believed to have both been sleeping in the container at the time. Read more from Sky News:How melting ice is boosting Russia's militaryHamas says Gaza ceasefire plan 'under discussion' School officials sent a message to parents to reassure them that the emergency response at the school was \"completely unrelated\" to the school, adding there was no threat to students or staff and classes were operating as normal."
    },
    {
        "title": "'Absolutely gutted': £16,500 Glastonbury packages won't be fulfilled after company goes bust",
        "description": "Glastonbury ticket holders have been left thousands of pounds out of pocket after a luxury glamping company went bust. ",
        "url": "https://news.sky.com/story/absolutely-gutted-16316500-glastonbury-packages-wont-be-fulfilled-after-company-goes-bust-13376966",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-istock-stock-file-glastonbury_6930501.jpg?20250529160956",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-05-30 13:28:00",
        "Headline": "Festival-goers who booked their tickets and accommodation with Yurtel have been told the company can no longer fulfil its orders and has ceased trading with immediate effect.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n Glastonbury ticket holders have been left thousands of pounds out of pocket after a luxury glamping company went bust.  Festival-goers who booked their tickets and accommodation with Yurtel have been told the company can no longer fulfil its orders and has ceased trading with immediate effect. Money: Read all the latest news here Some had spent more than £16,500 through Yurtel, with hospitality packages starting at £10,000. In an email, Yurtel said it was unable to provide customers with any refunds, advising them to go through a third party to claim back the money once the liquidation process had started. To add insult to injury, customers found out that Yurtel had failed to purchase the tickets for the 25 -29 June festival that they thought had been booked as part of their packages. In a letter to customers, Yurtel's founder Mickey Luke said: \"I am deeply sorry that you have received this devastating news and am writing to apologise. \n                  Glastonbury 2025 line-up revealed \n                 \n                  Neil Young confirmed as Glastonbury headliner - days after saying he was pulling out\n                 \n                  Neil Young pulls out of Glastonbury over BBC 'corporate control'\n                 \"Yurtel is a hospitality business who pride themselves on looking after our customers, delivering a unique product and striving to create a better client experience year on year. Due to a culmination of factors over the past years, we have failed to be able to continue to do so and are heartbroken.\" The Money blog has contacted Yurtel to see if the business has anything to add. Several people have also reported that they were unable to pay by credit card at the time of booking, with the company instead asking for a bank transfer. This means they are unable to use chargeback to get a refund. You can read more about that here... 'I feel really ripped off' One of those customers was Lydia, who told Money she was \"absolutely gutted\" after spending thousands. This year's festival was \"really important\" to her as she was forced to miss out last year despite having tickets due to a health issue that left her needing an operation. \"We tried to get Glastonbury tickets through the normal kind of route and couldn't get them,\" the accountant said. She ended up booking with Yurtel in November, sending over all the funds a month later. \"It's super expensive. It was really, really important to us. Last year was gutting with the surgery and the whole situation around that was very traumatic, so it was a very special thing to then get the opportunity to go this year. It's really gutting,\" she said. \"I feel really ripped off and I'm really disappointed in the festival, to be honest. I think that response is just pretty rubbish.\" More from Money:Chef's top steak tipSecrets of a London cabbieHow roaming fees compare by network Yurtel did not pay for festival tickets, Glastonbury says Glastonbury said Yurtel was one of a small number of campsites local to the festival site - Worthy Farm - with limited access to purchase hospitality tickets for their guests in certain circumstances. But, it had not paid for any tickets for the 2025 festival before going into liquidation, and so no tickets were secured for its guests, it added. Every year, Glastonbury's website says that ticketing firm See Tickets is the only official source for buying tickets for the festival. \"As such we have no records of their bookings and are unable to take any responsibility for the services and the facilities they offer,\" the festival said. \"Anyone who has paid Yurtel for a package including Glastonbury 2025 tickets will need to pursue any potential recompense available from them via the liquidation process as outlined in their communication to you. \"We are not able to incur the cost or responsibility of their loss or replacement.\" Instead, the festival has urged Yurtel customers to contact Yurtel@btguk.com to confirm their consent for personal data and details of their party to be shared with Glastonbury. \"We will then be able to provide details of alternative potential sources for those customers to purchase tickets and accommodation for this year's festival,\" the festival added. 'Only option' on offer is 'pretty weak' Lydia said she agreed for her details to be passed on to Glastonbury, and the festival has told her the only option is to pay for the tickets again from another provider. \"They are not giving us the opportunity to buy the tickets at face value. We would then have to go again and spend another stupidly unreasonable amount of money to be able to go. It's pretty disappointing,\" she added. \"It's pretty weak that the only option they're giving people who've already lost out on huge amounts of money is to go and spend huge amounts more money.\" It's left her feeling like she won't go to the festival this year - and she's not hopeful about getting her money back. She said: \"To be honest, I just don't think I can afford it. \"It's already so much money wasted, and I'm not at all optimistic we'll get anything back.\""
    },
    {
        "title": "From Tesla tequila to Iron Man inspiration: 7 things you may not know about Elon Musk",
        "description": "The name Elon Musk is perhaps one of the most recognisable in the modern day.",
        "url": "https://news.sky.com/story/from-tesla-tequila-to-iron-man-inspiration-7-things-you-may-not-know-about-elon-musk-13376358",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-elon-musk_6827946.jpg?20250213175145",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-30 06:45:00",
        "Headline": "Elon Musk has made numerous headlines for his work in (and out of) Donald Trump's government. But here are some things you might not know about the world's richest man.",
        "Content": "The name Elon Musk is perhaps one of the most recognisable in the modern day. The richest man in the world is known for being the owner of various companies including electric vehicle maker Tesla and Space X, his takeover of social media company Twitter - which he renamed X - and, until most recently, his work within the US government. After nearly 130 days as head of the Department of Government Efficiency - known as DOGE for short - Musk announced he is leaving his role within Donald Trump's administration. His work within the department and his close relationship with Mr Trump led to Musk being in the headlines more than ever, but there is much to the billionaire businessman that is rarely reported.  Here are seven things you may not know about Musk. Child video game creator In the early 1980s, at the age of 12, Musk created the video game Blastar. He created the game, which tasks players to use their keyboards to shoot at alien fighter spaceships, through his knowledge of coding and programming, which he picked up at the age of nine, according to Ashlee Vance's 2015 biography of the tech mogul. By 1984 the game was so good, Musk sold it to PC and Office Technology magazine for $500 (£371), where it featured in the publication's December issue. First big pay cheque From the get-go, it was clear Musk had a talent for business. In 1995, age 24, he set up his first company, Zip2 with his brother, Kimbal. The pair set up the company, which created online city guides for newspapers, for around $28,000 (£20,000). It was sold for around $300m (£222m) four years later in 1999. Before cashing in on the success of Zip2, Musk said he and his brother were pretty much broke and both slept in the office where they worked - a behaviour he reportedly replicated in the early days of Tesla. From the sale of the company, Musk walked away from Zip2 with a cool $22m, and the first thing he bought was a McLaren F1. He told CNN at the time: \"Just three years ago I was sleeping on the office floor, and now I've got a million-dollar car.\"  Musk's musk  Despite having huge success, some of Musk's ideas have not proved to be as long-lasting. In 2022, he launched a perfume called Burnt Hair, which is described on his The Boring Company website as \"the essence of repugnant desire\". The scent, which cost $100 (£74) a bottle, was a smash hit, according to Musk, who said it had sold 10,000 bottles in just a few hours, earning him a million dollars.  \"With a name like mine, getting into the fragrance business was inevitable - why did I even fight it for so long!?\" Musk said at the time. It is unknown if the product was serious, and (sadly) is no longer available on The Boring Company website. In addition to perfume, Tesla launched its own tequila in 2020, and in the same year, Musk followed through on a joke to sell limited edition pairs of Tesla short shorts as a way to prove investors who bet against the electric vehicle maker wrong. The original PayPal Long before Twitter became X, Musk created X.com, an online banking and financial services company. The platform quickly attracted a large customer base, and in the year 2000, it merged with Confinity, which was co-founded by tech entrepreneurs Peter Thiel and Max Levchin. The platform was later renamed PayPal. Musk went on to become chief executive of PayPal, but was later ousted from the position as arguments over the company's name and overall direction emerged. In 2002, the banking site was bought by eBay for $1.5bn (£1.4bn). Years later, in 2017, eBay sold the domain X.com back to Musk.  Inspiration for Iron Man Musk's life as a billionaire entrepreneur sounds like the start of a Hollywood blockbuster. And in reality, Musk's personality and accomplishments were partly used as inspiration for Robert Downey Jr's portrayal of Iron Man in the Marvel Cinematic Universe. In a 2022 interview, Iron Man screenwriter Mark Fergus said his version of Tony Stark was based on a culmination of Musk, Mr Trump and Apple creator Steve Jobs. \"Musk took the brilliance of Jobs with the showmanship of Trump. He was the only one who had the fun factor and the celebrity vibe and actual business substance,\" Mr Fergus told New York Magazine. Musk's unusual connection to the fictionalised billionaire was played out on camera when he made a cameo in Iron Man 2 in 2010. The real Tesla founder? Contrary to belief, Musk did not start Tesla. He was actually an early investor in the company and was the fourth chief executive when he took over the role in 2008 - shortly after the company released its first car - the Roadster sports car. It was in fact, Martin Eberhard and Marc Tarpenning who founded the company in 2003, albeit Musk was the one to propel it on to a global stage. Desire for the 'everything app' After taking over social media platform X for $44bn in 2022, Musk became one step closer to achieving his goal of creating an \"everything app\". The tech mogul has previously said he wishes for X to become similar to WeChat - a Chinese app that offers a wide range of features beyond messaging, including payments, ordering taxis, sharing social media posts and conducting business - think of it as a mix between Facebook, Apple Pay, WhatsApp and Google. Read more from Sky News:US court blocks Trump from imposing sweeping global tariffsTrump administration halts international student visa applications  Musk's vision of this \"super app\" seems to be shared by those at X, including chief executive Linda Yaccarino, who said at the end of last year that 2025 would be the year that X \"connect[s] you in ways never thought possible. X TV, X Money, Grok and more\". And this appears to be somewhat coming true. In January, Musk announced X had partnered with payment giant Visa, which will allow users to move funds between traditional banks and a digital X wallet and make payments to friends."
    },
    {
        "title": "Schroders chair Corley to join board of London Stock Exchange-owner",
        "description": "Dame Elizabeth Corley, the chair of asset management giant Schroders, is joining the board of London Stock Exchange Group (LSEG) - a move which puts her in a strong position to take the helm there in the coming years.",
        "url": "https://news.sky.com/story/schroders-chair-corley-to-join-board-of-london-stock-exchange-owner-13376768",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-stock-exchange-london_6631680.jpg?20240719092126",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-30 06:57:00",
        "Headline": "Dame Elizabeth Corley's appointment as a non-executive director of LSEG puts her in the frame to be an eventual successor to chairman Don Robert, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Dame Elizabeth Corley, the chair of asset management giant Schroders, is joining the board of London Stock Exchange Group (LSEG) - a move which puts her in a strong position to take the helm there in the coming years. Sky News has learnt that LSEG plans to announce later on Friday that Dame Elizabeth will become a non-executive director of the company. While there is no process under way to find a successor to Don Robert, who has chaired LSEG since May 2019, people close to the exchange-owner speculated that she would be an obvious candidate to do so. Money blog: Glastonbury fan to miss out despite spending more than £16,500 on stay One fund manager also suggested that her dual roles on the boards of Schroders and LSEG could raise questions about potential conflicts of interest given that Schroders is itself listed on the LSE and is a significant user of its services. That idea was rejected by insiders at LSEG on Friday morning. The issue of leadership succession at LSEG is coming into sharper focus for investors because David Schwimmer, its chief executive, has led the company since 2018. \n                  Money blog: Retailer cancels Nintendo Switch 2 pre-orders\n                 \n                  'Absolutely gutted': £16,500 Glastonbury packages won't be fulfilled after company goes bust\n                 \n                  Ask Us Anything\n                 Leading shareholders are likely to prefer the appointment of a new chair ahead of Mr Schwimmer's eventual departure. LSEG now has a market capitalisation of over £60bn, with the London bourse representing only a small proportion of its income. The exchange is facing searching questions about its ability to attract new flotation candidates, with those doubts likely to be exacerbated by this week's reports that Shein, the Chinese-founded online fashion giant, is switching its focus to a listing in Hong Kong. LSEG declined to comment."
    },
    {
        "title": "Hundreds face imminent eviction as Merseyside tower blocks condemned by firefighters",
        "description": "Hundreds of people are facing imminent homelessness after their Merseyside flat blocks were condemned by the fire service as being unsafe.",
        "url": "https://news.sky.com/story/hundreds-face-imminent-eviction-as-merseyside-tower-blocks-condemned-by-firefighters-13376884",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-street-view-google_6931191.png?20250530130958",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-05-30 10:55:00",
        "Headline": "Residents of Beech Rise and Willow Rise in Kirkby, Merseyside have been told they need to find somewhere else to live \"immediately\" after the fire service condemned their buildings due to issues like broken lifts, poorly fitted doors and malfunctioning fire alarms.",
        "Content": "\n          Political reporter\n       Hundreds of people are facing imminent homelessness after their Merseyside flat blocks were condemned by the fire service as being unsafe. Residents of Beech Rise and Willow Rise in Kirkby, Merseyside - consisting of 160 flats in total - have been told they need to find somewhere else to live \"immediately\". Sky News understands a meeting took place this morning involving the government to discuss the situation, although one source described the circumstances as a \"waiting game\" to see what other parties do next. Due to the worsening condition of the buildings, Merseyside Fire and Rescue Service told building managers a round-the-clock \"waking watch\" - a fire safety system where trained personnel continuously patrol a building - was required as a safety measure. However, the money to pay for the waking watch has run out, and with no money for repairs, the fire service has told inhabitants to leave using a rarely employed power known as a prohibition notice which will be issued when the watch stops. Among the issues are broken lifts, poorly fitted doors and malfunctioning fire alarms. Knowsley Council says it is funding a short-term extension to the watch - understood to cost thousands of pounds per day - while people search for accommodation, but only has the money to do this \"for a short period\". Anneliese Midgley, the MP for Knowsley, says she is working with the council and government to support the impacted families. She said the situation is \"nothing short of a scandal\". But there remains the prospect of an \"emergency evacuation\" if a watch is not in place. There are allegations of mismanagement against previous owners and management firms, including around finances, made by the buildings' current managers, the Parklands Management, in which residents are shareholders. Dempster Management, the most recent firm appointed to run and maintain the buildings, is understood to be continuing to help with operations as Parklands has run out of money. Graham Morgan, the leader of Knowsley Council, said the residents have been \"let down and neglected for years\" by private owners of the blocks.  Vulnerable residents have been contacted by the council, and some could receive emergency rehousing if necessary. Mr Morgan added that the council has asked the government for help with funding - and help potentially going after the private companies \"to recover costs\". The buildings were previously council properties but were taken over by the private sector in the mid-2000s. Read more on housing:Labour propose strict new demandsHomelessness pushes councils to 'breaking point' Merseyside Fire and Rescue Service said: \"MFRS officers have worked tirelessly alongside Knowsley Council for several years to engage with successive management agents to ensure responsible persons fulfil their obligations under fire safety law, including issuing enforcement notices requiring remediation work to be carried out. \"A waking watch has been in place in both Beech Rise and Willow Rise to ensure the safety of residents while works are carried out, however, it has become evident that the work required has not progressed and is unlikely to be carried out. \"The management company would not fund the waking watch beyond 21 May 2025. The funding of the waking watch has been extended by Knowsley Council for a short period at their cost, despite them not owning the buildings, but this is not sustainable. \"This means the buildings will no longer be safe for residents to live in after the current waking watch ends, and MFRS will have no choice but to issue a prohibition notice. When the prohibition notice is served, residents must leave immediately, and they will need to be rehoused. \"We understand that this is disruptive and unpleasant for residents, however, all other options have been exhausted and the safety of residents is of paramount importance.\" Parklands Management told Sky News: \"The situation at Parklands has become appalling for all involved. Residents and leaseholders are facing an unprecedented and deeply distressing crisis that stems from years of systemic neglect and mismanagement.\" They added: \"The scale of investment now required to bring Parklands up to standard is in the multi-millions, and yet those bearing the burden are ordinary leaseholders, many with no financial capacity to contribute further.\" Dempster, who took over the management of the towers in late 2023, told Sky News: \"Upon our appointment, we inherited a development that had suffered from years of serious neglect. The scale of disrepair was significant, requiring substantial investment that could only be funded through service charges payable by leaseholders\" The statement added: \"Despite our brief tenure, we have faced exceptionally difficult circumstances, largely due to the dire financial position and structural issues left behind by previous directors and managing agents.\" The decision of Dempster to resign in April 2025 was a \"commercial\" one because conditions were \"impossible\". \"We remain hopeful that the residents and leaseholders of Parklands will find justice and a lasting resolution. In today's society, no one should be left to face the threat of homelessness, especially due to failures beyond their control,\" the company added. 👉 Listen to Sky News Daily on your podcast app 👈 A spokesperson for the head lessor, the Virgin Island registered company Rockwell FC100, said the requirement to keep the buildings safe rested with Parklands Management, and said it was \"extremely disappointing that due to a combination of factors including their non-collection of significant essential funding, the buildings have been allowed to deteriorate to the extent which they have\". They added they were \"investigating how best to move forward\". Parklands said they have spent more than £170,000 on safety works and service charge arrears are at more than £700,000, with £250,000 also owed to creditors. They claim that, because post-Grenfell cladding work has not been completed, recovering service charges is \"virtually impossible\" and, due to disrepair, flats can be worth as little as £10,000."
    },
    {
        "title": "Reform UK to accept crypto donations, Farage says",
        "description": "Reform UK will start accepting donations in cryptocurrency, making it the \"first\" British party to do so, its leader Nigel Farage has said - but the move has sparked concern from some experts.",
        "url": "https://news.sky.com/story/reform-uk-to-accept-crypto-donations-farage-says-13377162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-nigel-farage-doncaster_6878714.jpg?20250407115544",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-30 20:03:00",
        "Headline": "The party claims it is the \"first\" in Britain to do this – but experts are warning that digital currencies are harder to trace, and so offer donors increased anonymity.",
        "Content": "Reform UK will start accepting donations in cryptocurrency, making it the \"first\" British party to do so, its leader Nigel Farage has said - but the move has sparked concern from some experts. The announcement came as Mr Farage spoke at a Bitcoin Conference in Las Vegas on Thursday, and as his party pledged to cut taxes on cryptocurrencies if elected. \"My message to the British public, my message particularly to young people, is help us to help you bring our country properly into the 21st century,\" he said. \"Let's recognise that crypto, Bitcoin, digital assets, are here to stay.\" The MP for Clacton also introduced a 'Cryptoassets and Digital Finance Bill' - which he described as a \"bold, post-Brexit roadmap\" to make London a \"world-leading trading centre\". However, experts have warned against the idea of allowing political donations to be made via cryptocurrency. Financial crime expert Steve Goodrich told Politico's Playbook: \"The anonymity offered by digital currencies makes it nearly impossible for political parties to have confidence in their donors' identities. He added that the growth of crypto threatens a \"widening loophole that could allow unlimited anonymous donations to flow into British politics.\" News reporter Donald Trump, who called Bitcoin a \"scam\" in 2021, changed course before the presidential election last year - and ended up receiving millions in donations from deep-pocketed investors. Mr Farage appears to be following the same playbook, and has pledged to create a \"sovereign Bitcoin reserve fund\" so taxpayers can benefit if this cryptocurrency's price rises. The Trump administration unveiled a similar policy in March - meaning Bitcoin seized from criminals would no longer be auctioned off, but held in case its value grows. Data from Arkham Intelligence shows the UK currently holds £4.7bn worth of Bitcoin - but Labour has ruled out treating it as an investment, arguing that this asset is too volatile. The government is yet to sell off these crypto holdings, despite the fact that it could comfortably pay for a U-turn on winter fuel payments - with plenty of change left over. Mr Farage announced his policy at the Bitcoin conference in Las Vegas. Pro-Bitcoin policies are unlikely to be front of mind for many British voters, who are still grappling with a cost-of-living crisis. But Reform's stance marks another point of difference from both Labour and the Conservatives, who are yet to take a definitive stance on crypto. Read more on Sky News:Retailer cancels Nintendo Switch 2 pre-ordersDid Brexit make Britain better or worse off? It came as Reform chairman Zia Yusuf told reporters on Friday that if the party were elected to government, the party would allow people to pay their taxes through Bitcoin. He also said Reform would reduce capital gains tax on assets like Bitcoin to 10% - with the hope of generating up to £1bn for the Treasury in 10 years. Currently, cryptocurrencies incur a capital gains tax of either 18% or 24%. He added that the cut may encourage additional use of the currency, and encourage people to move their assets to Britain. Cryptocurrencies - like Bitcoin - have become increasingly popular over recent years, with research suggesting that around 12% of adults in the UK currently, or once, owned cryptoassets - compared to 4% in 2021. Last month, the chancellor announced plans to regulate cryptoassets in order to make Britain a \"world leader\"."
    },
    {
        "title": "Adam Price: Former Plaid Cymru leader's re-election uncertain under new voting system",
        "description": "There is uncertainty whether the former leader of Plaid Cymru will be re-elected under the Senedd's new voting system.",
        "url": "https://news.sky.com/story/adam-price-former-plaid-cymru-leaders-re-election-uncertain-under-new-voting-system-13376903",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wales-plaid-cymru-adam-price_6931187.jpg?20250530130838",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-05-30 11:24:00",
        "Headline": "The way people in Wales vote will change for next year's Senedd election, when voters will elect 96 members for the first time.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n There is uncertainty whether the former leader of Plaid Cymru will be re-elected under the Senedd's new voting system. People in Wales will be heading to the polls next May to vote in the Senedd election for the first time since 2021. Plaid Cymru has published its candidate list for the new constituency of Sir Gaerfyrddin, which puts Adam Price in third place. For the first time, voters will be electing 96 members to the Welsh parliament - an increase of more than 50%. The 32 Welsh constituencies at UK general elections will be paired to form 16 larger constituencies. Six candidates will be elected to represent each constituency, under a more proportional voting system. The order of candidates on each party's list is decided by party members. \n                  Sir Keir Starmer apologises for being 'overly rude' to Plaid Cymru MP Liz Saville Roberts\n                 \n                  Plaid Cymru 'ready to form' next government in Wales, says leader Rhun ap Iorwerth\n                 \n                  Plaid Cymru: Former leader Dafydd Elis-Thomas dies aged 78\n                 The lower a candidate's position on each party's list, the lower their chances of being elected. In a statement to local members, seen by Sky News, the party confirmed that Cefin Campbell, its education spokesperson, had topped the list. Former Senedd member Nerys Evans was placed second, followed by former leader Adam Price in third. Mari Arthur, who the party describes as a social entrepreneur and sustainability campaigner, completes the party's top four candidates. After the result, Mr Price said he would \"like to thank the members that showed [him] support during this process and congratulate Cefin on topping the list\". Read more from Sky News:Wynne Evans leaves BBC radio show after controversyMan who made and sold poisonous diet pills jailed Mr Price quit as leader of the Welsh independence-supporting party in May 2023. His departure came after a report into a \"toxic\" culture within Plaid Cymru, which found a \"lack of collective leadership and governance\" in responding to the issues. The party commissioned the report by a working group, chaired by Mrs Evans, who now hopes to be re-elected to the Senedd after an initial stint between 2007 and 2011. Mr Price was ultimately replaced as leader by Rhun ap Iorwerth, who currently represents Ynys Môn in the Senedd. A Senedd poll published earlier this month placed Plaid Cymru as the party with the highest vote share, ahead of Reform UK, Labour and the Conservatives. After its publication, Mr ap Iorwerth told Sky News his party was \"ready to form\" the next government in Wales."
    },
    {
        "title": "Why stockpiling vapes could be dangerous - as ban on disposables nears",
        "description": "A ban on disposable vapes comes into force tomorrow, with a warning issued about the \"life-threatening dangers\" of stockpiling.",
        "url": "https://news.sky.com/story/why-stockpiling-vapes-could-be-dangerous-as-ban-on-disposables-nears-13376796",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-disposable-vapes_6931044.jpg?20250530103321",
        "type": "Technology",
        "Author": "Megan Harwood-Baynes",
        "Date Published": "2025-05-30 08:23:00",
        "Headline": "From Sunday it will be illegal for any businesses to sell or supply disposable vapes, but an online nicotine retailer says an alarming number of customers have said they will stockpile. ",
        "Content": "\n          Social affairs and health reporter\n              @megbaynes\n A ban on disposable vapes comes into force tomorrow, with a warning issued about the \"life-threatening dangers\" of stockpiling. From Sunday it will be illegal for any business to sell or supply, or have in their possession for sale, all single-use or disposable vapes. Online nicotine retailer Haypp said 82% of the 369 customers they surveyed plan to bulk purchase the vapes before they are no longer available. But the vapes contain lithium batteries and could catch fire if not stored correctly. While more than a third (34%) of people surveyed by Haypp said they would consider buying an illegal vape after the ban, the overall number of people using disposable products has fallen from 30% to to 24% of vapers, according to Action on Smoking and Health. Shops selling vapes are required to offer a \"take back\" service, where they accept vapes and vape parts that customers return for recycling - including single use products. Read more: Everything you need to know about the ban \n                  Man appears in court over Liverpool trophy parade incident\n                 \n                  Search for girl missing in Thames suspended\n                 \n                  Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges\n                 The Local Government Association (LGA) led the call for a ban two years ago, due to environmental and wellbeing concerns, and is warning people not to stockpile. Cllr David Fothergill, chairman of the LGA's Community Wellbeing Board, said: \"Failing to store disposable vapes correctly could cost lives, given the significant fire risk they pose.\" How disposable vapes catch fire - or even explode Figures obtained by the Electric Tobacconist, via Freedom of Information requests, found an increase in vape related fires - from 89 in 2020 to 399 in 2024. Many disposable vapes use cheap, or even unregulated lithium-ion batteries, to keep the costs down. These batteries often lack proper safety features, like thermal cut offs, making them more prone to overheating and catching fire. If the battery is damaged, or overheats in any way it can cause thermal runaway - a chain reaction where the battery's temperature rapidly increases, causing it to overheat uncontrollably.  Read more:Ban may not curb e-cig useToddler filmed vapingIllegal vapes found in WW2 bunker Then, once these fires start start, they are very hard to stop. Water alone can make things worse if the battery is still generating heat, so they require specialised fire suppressants to put them out. Batteries can then re-ignite hours, or even days later, making them a persistent hazard. Disposable vapes are a hazard for waste and litter collection and cause fires in bin lorries, even though customers have been warned not to throw them away in household waste. They are almost impossible to recycle because they are designed as one unit so the batteries cannot be separated from plastic. Some 8.2 million units were thrown away, or recycled incorrectly, every week prior to the ban. The Department for Environment, Food and Rural Affairs (Defra) said usage among young vapers remained too high, and the ban would \"put an end to their alarming rise in school playgrounds and the avalanche of rubbish flooding the nation's streets\". Circular economy minister Mary Creagh said: \"For too long, single-use vapes have blighted our streets as litter and hooked our children on nicotine. That ends today. \"The government calls time on these nasty devices.\" 'One in five say they will return to cigarettes' Separate research by life insurance experts at Confused.com found two in five people (37%) planned to stop vaping when the ban starts. Nearly one in five (19%) said they would return to cigarettes once the ban comes into force. The research was based on the answers of 500 UK adults who currently vape. Vaping and smoking also appears to be on the rise, with Confused.com saying there was a 44% increase in the number of people declaring they smoke or vape on their life insurance policy since 2019."
    },
    {
        "title": "More than 90 wildfires are out of control in Canada",
        "description": "Dozens of enormous wildfires have erupted across Canada, already forcing 21,000 evacuations and spewing toxic smoke into the air.",
        "url": "https://news.sky.com/story/more-than-90-wildfires-are-out-of-control-in-canada-13377002",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-canada-wildfire_6931683.jpg?20250530223713",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-05-30 14:37:00",
        "Headline": "Canada was battling 175 wildfires on Friday, of which 95 were uncontained, prompting evacuations and a military response. Officials warned that worse is probably still yet to come.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Dozens of enormous wildfires have erupted across Canada, already forcing 21,000 evacuations and spewing toxic smoke into the air. The provinces of Manitoba and Saskatchewan have both declared a state of emergency, as several separate blazes raged out of control. Canada's Prime Minister Mark Carney is sending in the military to help move residents and fight fires in Manitoba, where 17,000 people have been forced to evacuate. Manitoba Premier Wab Kinew called it the province's largest such exodus in living memory. In Saskatchewan, where 4,000 people have fled their homes, the conditions are \"as severe\" as \"anything that we have faced for quite some period of time, if not ever\", premier Scott Moe said. With no rain in the forecast, and a hot and dry summer on the horizon, the blazes are expected to balloon. Mr Moe added: \"I think there's an admission here that things are going to get worse before they get better.\" Much of the country is currently exceptionally dry and warm. On Friday, 175 active fires were burning, of which 95 were out of control, according to the Canadian Interagency Forest Fire Centre. In recent years, Canadian fires have billowed dirty smoke across North America, famously spreading ominous, orange-tinted skies and filthy air across New York in 2023. Air quality in Arrowhead, Minnesota, is deemed unhealthy for people and animals sensitive to pollution and other airborne particles, according to the Environmental Protection Agency's AirNow page. Daniel Swain, climate scientist and meteorologist at University of California, Los Angeles (UCLA), said smoke from Canada was already visible in the western US state of Colorado today, carried by favourable winds. The intense fires early in the year will likely \"have knock-on effects in the US later this fire season\", he warned. The countries share firefighting resources and will likely have to battle strong wildfire seasons at the same time later this year, creating competition for supplies. This challenge will be \"compounded by recent severe cuts to emergency response, wildland firefighting, and weather prediction\" by the Trump administration, added Dr Swain. In response, White House spokeswoman Abigail Jackson described Mr Swain as a \"longtime Democrat donor who has spent hundreds of dollars supporting liberal politicians, including loser Kamala Harris, with radical climate policies that the American people have repeatedly rejected\". \"President Trump is remaking our disaster response to keep all Americans safe by ending the ineffective ways of the past and working with state and local governments to invest in their own resilience before disaster strikes.\" Figures from the Federal Election Commission show Dr Swain's contributions since 2018 add up to less than $1,000. What causes Canada's wildfires? Canada is no stranger to wildfires, which can be sparked by human or natural causes like lightning, and are also influenced by the way the land is managed. But climate change is creating more fuel for them, as hotter air dries out the land. Fire-friendly weather that created exceptional blazes in eastern Canada in 2023 was made at least seven times more likely by climate change, scientists at World Weather Attribution found. Justin Murgai, CEO of WaterAid Canada, told Sky News: \"The growing scale and severity of wildfires in Canada are a stark reminder of our changing climate.\" He said the fires \"threaten air quality, displace families, and stretch essential services to breaking point, often contaminating water sources and cutting off communities from safe water\"."
    },
    {
        "title": "More than 40% of Europe slides into drought, including pockets of Greece, southern Italy and Spain",
        "description": "Well over a third of Europe, including parts of holiday destinations like Spain, Greece and Italy, are now in drought.",
        "url": "https://news.sky.com/story/more-than-40-of-europe-slides-into-drought-including-pockets-of-greece-southern-italy-and-spain-13376787",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-walchensee-water-low_6931001.jpg?20250530094407",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-05-30 08:07:00",
        "Headline": "More than 40% of Europe is now in some form of drought, brewing trouble for farmers in northern Europe and firefighters in Greece, where \"overtourism\" is making matters worse.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Well over a third of Europe, including parts of holiday destinations like Spain, Greece and Italy, are now in drought. March was Europe's warmest on record - a trend driven by climate change - and also saw below average rain across large parts of the north and east of the continent. Now 41.2% of Europe finds itself in some form of drought, according to the latest update from the EU's European Drought Observatory, which covers 11 to 20 May. It is most acute in pockets of south-eastern Spain, Cyprus, Greece and Albania, where the strongest \"alert\" category has been issued, as well as parts of Poland and Ukraine. But broad stretches of northern and eastern Europe through France, Germany, Poland and Ukraine also drying up, sowing concerns about crop yields. On Thursday, the UK's Environment Agency officially declared a drought in North West England after river and reservoir levels were licked away by a dry spring. Greece tourism is 'unsustainable' In Greece, \"overtourism\" from millions flocking to its beaches adds further pressure to water supplies, said Nikitas Mylopoulos, professor of water resource management at Thessaly University. \"The tourist sector is unsustainable and there is no planning... leading to a tremendous rise in water demand in summer,\" he told Sky News. \"The islands have an intense problem of drought and water scarcity.\" Islands like Santorini and Mykonos are now forced to ship in water from Athens or desalination plants to provide for showers and swimming pools. In the past, many residents could make do with local methods like rainwater harvesting. But agriculture is a far bigger drain on the country's water, with waste rife and policies lacking, said Prof Mylopoulos.  Wildfire season could be 'particularly difficult'  This year's hot and dry conditions are also fuelling the risk of yet another fierce wildfire season in Greece. Last week civil protection minister Ioannis Kefalogiannis warned of a \"particularly difficult\" summer. He said a record 18,000 firefighters have been deployed and the drone fleet almost doubled in a bid to combat fires being fuelled by a hotter climate. Droughts and their causes are more complicated, but scientists at World Weather Attribution say global warming is exacerbating drought in some parts of the world, including around the Mediterranean. They found the drought of 2022, which spread across the Northern Hemisphere, was made 20 times more likely by climate change. The International Hydropower Association said drought and intense rain in Europe are pushing power plants to \"operate at the limits of their existing equipment\". Extreme weather costs the EU about €28.3bn (£23.8bn) in lost crops and livestock per year, according to insurance firm Howden. Hayley Fowler, professor of climate change impacts at Newcastle University, said: \"With global warming, we expect more prolonged and intense droughts and heatwaves punctuated by more intense rainfall, possibly causing flash floods. \"In recent years, we have experienced more of these atmospheric blocks, causing record heat and persistent drought, as well as severe flooding in other locations in Europe. \"Recent months have been no different, with prolonged dry conditions and heatwaves in northern Europe and floods in southern Europe.\""
    },
    {
        "title": "Elon Musk reveals when he hopes to launch mission crewed by robots to Mars",
        "description": "Elon Musk has said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of next year.",
        "url": "https://news.sky.com/story/elon-musk-reveals-when-he-hopes-to-launch-mission-crewed-by-robots-to-mars-13376914",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-spacex-starship_6931174.jpg?20250530125808",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-30 11:50:00",
        "Headline": "In a video update, the tech billionaire said meeting the schedule depended on overcoming technical challenges, and gave SpaceX a 50-50 chance of success.",
        "Content": "Elon Musk has said he wants to send a spacecraft crewed by humanoid robots on a voyage to Mars by the end of next year. The tech billionaire outlined his latest schedule for Starship in a video presented at the project's Starbase home in Texas and posted online on Thursday. The SpaceX founder had been set to give a presentation, called The Road to Making Life Multiplanetary, on Tuesday night, following a ninth test flight of the spacecraft earlier that evening. But the speech was cancelled after the vehicle spun out of control about 30 minutes into the launch, having not achieved some of its most important test goals.  And on Wednesday, Musk confirmed his brief but tumultuous spell in the Trump administration as head of the Department of Government Efficiency (DOGE) was ending. Musk warned there was no guarantee he would be able to meet the Starship timeframe he set out and much depended on overcoming a number of technical challenges, during flight-test development, especially a post-launch refuelling operation while orbiting Earth. He previously said he aimed to send an unmanned vehicle to the red planet as early as 2018 and had targeted 2024 to launch a first crewed mission there. \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Humans would land on Mars as part of the second or third flights, he said on Thursday, but the first trip would be in the hands of one or more humanoid Optimus design robots built by Tesla, the electric vehicle and battery maker he leads. The current target to land a human on Mars using Starship is 2028, but it has yet to make an orbit of Earth. Musk said he wants to make it so that \"anyone who wants to move to Mars and help build a new civilisation can do so. Anyone out there. How cool would that be?\". At the end of 2026, Mars and Earth align around the sun, reducing the distance between the two planets to its shortest, but still seven to nine months' travelling time by spacecraft. Musk said they had a 50-50 chance of meeting that deadline and if Starship isn't ready by then, SpaceX would wait another two years before trying again. NASA, which hopes to land astronauts on Mars sometime in the 2030s, is planning to use Starship to return humans to the surface of the moon as early as 2027 - more than 50 years after the last lunar landings of the Apollo era. Read more:What latest Starship failure means'Unique' bacteria found on space stationHow long before the UK is launching rockets? Starship's previous test flights in January and March also failed, with the spacecraft exploding moments after lift-off, raining debris over parts of the Caribbean and forcing scores of commercial jets to change course as a precaution. Musk shrugged off the latest mishap on Tuesday with a brief post on X, saying it produced a lot of \"good data to review\" and promising a faster launch \"cadence\" for the next several test flights."
    },
    {
        "title": "From Tesla tequila to Iron Man inspiration: 7 things you may not know about Elon Musk",
        "description": "The name Elon Musk is perhaps one of the most recognisable in the modern day.",
        "url": "https://news.sky.com/story/from-tesla-tequila-to-iron-man-inspiration-7-things-you-may-not-know-about-elon-musk-13376358",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-elon-musk_6827946.jpg?20250213175145",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-30 06:45:00",
        "Headline": "Elon Musk has made numerous headlines for his work in (and out of) Donald Trump's government. But here are some things you might not know about the world's richest man.",
        "Content": "The name Elon Musk is perhaps one of the most recognisable in the modern day. The richest man in the world is known for being the owner of various companies including electric vehicle maker Tesla and Space X, his takeover of social media company Twitter - which he renamed X - and, until most recently, his work within the US government. After nearly 130 days as head of the Department of Government Efficiency - known as DOGE for short - Musk announced he is leaving his role within Donald Trump's administration. His work within the department and his close relationship with Mr Trump led to Musk being in the headlines more than ever, but there is much to the billionaire businessman that is rarely reported.  Here are seven things you may not know about Musk. Child video game creator In the early 1980s, at the age of 12, Musk created the video game Blastar. He created the game, which tasks players to use their keyboards to shoot at alien fighter spaceships, through his knowledge of coding and programming, which he picked up at the age of nine, according to Ashlee Vance's 2015 biography of the tech mogul. By 1984 the game was so good, Musk sold it to PC and Office Technology magazine for $500 (£371), where it featured in the publication's December issue. First big pay cheque From the get-go, it was clear Musk had a talent for business. In 1995, age 24, he set up his first company, Zip2 with his brother, Kimbal. The pair set up the company, which created online city guides for newspapers, for around $28,000 (£20,000). It was sold for around $300m (£222m) four years later in 1999. Before cashing in on the success of Zip2, Musk said he and his brother were pretty much broke and both slept in the office where they worked - a behaviour he reportedly replicated in the early days of Tesla. From the sale of the company, Musk walked away from Zip2 with a cool $22m, and the first thing he bought was a McLaren F1. He told CNN at the time: \"Just three years ago I was sleeping on the office floor, and now I've got a million-dollar car.\"  Musk's musk  Despite having huge success, some of Musk's ideas have not proved to be as long-lasting. In 2022, he launched a perfume called Burnt Hair, which is described on his The Boring Company website as \"the essence of repugnant desire\". The scent, which cost $100 (£74) a bottle, was a smash hit, according to Musk, who said it had sold 10,000 bottles in just a few hours, earning him a million dollars.  \"With a name like mine, getting into the fragrance business was inevitable - why did I even fight it for so long!?\" Musk said at the time. It is unknown if the product was serious, and (sadly) is no longer available on The Boring Company website. In addition to perfume, Tesla launched its own tequila in 2020, and in the same year, Musk followed through on a joke to sell limited edition pairs of Tesla short shorts as a way to prove investors who bet against the electric vehicle maker wrong. The original PayPal Long before Twitter became X, Musk created X.com, an online banking and financial services company. The platform quickly attracted a large customer base, and in the year 2000, it merged with Confinity, which was co-founded by tech entrepreneurs Peter Thiel and Max Levchin. The platform was later renamed PayPal. Musk went on to become chief executive of PayPal, but was later ousted from the position as arguments over the company's name and overall direction emerged. In 2002, the banking site was bought by eBay for $1.5bn (£1.4bn). Years later, in 2017, eBay sold the domain X.com back to Musk.  Inspiration for Iron Man Musk's life as a billionaire entrepreneur sounds like the start of a Hollywood blockbuster. And in reality, Musk's personality and accomplishments were partly used as inspiration for Robert Downey Jr's portrayal of Iron Man in the Marvel Cinematic Universe. In a 2022 interview, Iron Man screenwriter Mark Fergus said his version of Tony Stark was based on a culmination of Musk, Mr Trump and Apple creator Steve Jobs. \"Musk took the brilliance of Jobs with the showmanship of Trump. He was the only one who had the fun factor and the celebrity vibe and actual business substance,\" Mr Fergus told New York Magazine. Musk's unusual connection to the fictionalised billionaire was played out on camera when he made a cameo in Iron Man 2 in 2010. The real Tesla founder? Contrary to belief, Musk did not start Tesla. He was actually an early investor in the company and was the fourth chief executive when he took over the role in 2008 - shortly after the company released its first car - the Roadster sports car. It was in fact, Martin Eberhard and Marc Tarpenning who founded the company in 2003, albeit Musk was the one to propel it on to a global stage. Desire for the 'everything app' After taking over social media platform X for $44bn in 2022, Musk became one step closer to achieving his goal of creating an \"everything app\". The tech mogul has previously said he wishes for X to become similar to WeChat - a Chinese app that offers a wide range of features beyond messaging, including payments, ordering taxis, sharing social media posts and conducting business - think of it as a mix between Facebook, Apple Pay, WhatsApp and Google. Read more from Sky News:US court blocks Trump from imposing sweeping global tariffsTrump administration halts international student visa applications  Musk's vision of this \"super app\" seems to be shared by those at X, including chief executive Linda Yaccarino, who said at the end of last year that 2025 would be the year that X \"connect[s] you in ways never thought possible. X TV, X Money, Grok and more\". And this appears to be somewhat coming true. In January, Musk announced X had partnered with payment giant Visa, which will allow users to move funds between traditional banks and a digital X wallet and make payments to friends."
    },
    {
        "title": "Mountainhead: Succession writer Jesse Armstrong's new film takes aim at tech billionaires",
        "description": "Succession writer Jesse Armstrong says he hopes his new film about toxic tech billionaires can be a receptacle for anyone who is \"feeling wonky about the world\".",
        "url": "https://news.sky.com/story/mountainhead-succession-writer-jesse-armstrongs-new-film-takes-aim-at-tech-billionaires-13377010",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-jesse-armstrong-steve-carell_6931325.jpg?20250530155249",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-05-30 14:45:00",
        "Headline": "Satire Mountainhead centres on a bunch of tech bros meeting up to compare bank balances, as an international crisis they appear to have stoked rages, and it could help lower viewers' anxiety, according to its writer.",
        "Content": "\n          Arts and entertainment correspondent\n       Succession writer Jesse Armstrong says he hopes his new film about toxic tech billionaires can be a receptacle for anyone who is \"feeling wonky about the world\". Now making his film directorial debut with Mountainhead, starring Steve Carell and Jason Schwartzman, Armstrong has shifted his focus from cut-throat media moguls to a group of billionaire friends meeting up to compare bank balances against the backdrop of a rolling international crisis they appear to have stoked. Speaking to Sky News about the project, he said: \"For a little while I poured some of my anxieties and feelings into it… and I hope it can be a receptacle for other people if they're feeling wonky about the world, maybe this can be somewhere they put some of their anxieties for a while.\" Few television writers achieve widespread recognition beyond their work, but Armstrong - the man behind Succession, one of the most critically acclaimed TV shows of the past decade - has become a household name and is today one of the world's hottest properties in high-end drama. \"If there was more self-reflection and self-knowledge, there probably wouldn't be such amenable targets for comedy and satire,\" he admits. Long before he gifted viewers with the likes of manipulative Logan Roy and sycophantically ambitious Tom Wambsgans, back in the beginning, there was selfish slacker Jez and the perennially insecure Mark on his breakthrough hit Peep Show. \"I love comedy, you know, it's my way in,\" he explains. \"I think I like it because… the mixture that you get of tragedy and absurdity strikes me as a sort of a true portrayal of the world… and I just like jokes, you know, that's probably the basic reason.\" \n                  Taylor Swift buys back rights to all master recordings - but it's bad news for Reputation fans\n                 \n                  Loretta Swit, Emmy-winning actress and star of M*A*S*H, dies aged 87\n                 \n                  Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges\n                 After putting his pen down on the finale of Succession, walking away with 19 Emmys and nine Golden Globes, attention was always going to be drawn to what Armstrong did next. \"I had a couple of other things that I thought I would write first and this kind of snuck up on me as an area of interest,\" Armstrong says. \"After I'd listened to a bunch of tech podcasts and Ted talks, I sort of needed somewhere to put the tone of voice that was increasingly in my head.\" Tapping into the unease surrounding big tech, he wrote, shot and edited Mountainhead in less than six months. Capturing the audience mood Explaining why he worked so fast, he said he \"wanted to be in the same sort of mood as my audience, if possible\". While he insists there aren't \"any direct map-ons\" to the billionaire tech moguls, which frequently make headlines in real life, he joked he's \"happy… to play a game of 'where did I steal what from who?'\" with viewers. \"You know… Elon Musk… I think at least people would see some Mark Zuckerberg and, I don't know, some Sam Altman, there is a bunch of those people in all the [film's] different characters… and we've stolen liberally from the world in terms of the stories we've given them.\" Steve Carell is tasked with delivering some of the film's most memorable lines as the satire explores the dynamic between those holding the power and those pulling the strings. Read more on Sky News:Brand denies sex chargesWynne Evans leaves radio showTom Daley on LGBT rights Lack of self-knowledge 'good for comedy' \"People who lack a certain degree of self-knowledge are good for comedy….and if there was more self-reflection and self-knowledge, there probably wouldn't be such amenable targets for comedy and satire. \"You know, living in a gated community and travelling by private jet certainly doesn't help you to understand what life is like for most people.\" Armstrong's gift for using humour to savagely dramatic ends is arguably what makes him one of the most sought-after writers working today. Behind his ability to craft some of the sharpest and scathing dialogue on our screens, he views what he does as more than getting a laugh. \"I do believe in the sort of nobility of the idea, that this is a good way to portray the world because this is how it feels a lot of the time.\" Mountainhead will air on Sky and streaming service NOW on 1 June."
    },
    {
        "title": "Taylor Swift buys back rights to all master recordings - but it's bad news for Reputation fans",
        "description": "Taylor Swift has bought back all the rights to her master recordings - but has suggested she won't be re-releasing her Reputation album. ",
        "url": "https://news.sky.com/story/taylor-swift-buys-back-rights-to-all-master-recordings-but-its-bad-news-for-reputation-fans-13377026",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-taylor-swift-eras-tour_6801775.jpg?20250116225711",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-30 15:35:00",
        "Headline": "Taylor Swift shared the news with fans saying, \"you belong with me\", as she clutched vinyl copies of her first six albums. ",
        "Content": "Taylor Swift has bought back all the rights to her master recordings - but has suggested she won't be re-releasing her Reputation album.  \"All the music I've ever made now belongs to me,\" the star announced on her official website. \"I've been bursting tears of joy... ever since I found out this is really happening.\" The pop star had originally lost the rights to her first six albums in 2019 when her first record label, Big Machine, sold them to music executive Scooter Braun. After she learned Braun had acquired her musical catalogue, she opened up about it in a lengthy Tumblr post, blaming him for being complicit in Kanye West's \"incessant, manipulative bullying\" of her. Swift said she was not given the opportunity to buy her work outright, and so, in a bid to diminish the value of the master tapes, she set about re-recording them. She had re-released four \"Taylor's Version\" albums to date. Just her self-titled debut album and Reputation remained. Braun later sold his stake in her albums to Shamrock Holdings, a Los Angeles investment fund, in a deal reported to be worth £222 million. It is not known how much Swift paid Shamrock to re-acquire the rights to her songs. Swift said she was \"forever grateful\" to Shamrock for allowing her to buy the rights to her music back. \"This was a business deal to them, but I really felt like they saw it for what it was to me: My memories and my sweat and my handwriting and my decades of dreams,\" Swift wrote on her website. \"I am endlessly thankful. My first tattoo might just be a huge shamrock in the middle of my forehead.\" By Arts and Entertainment producer Jayson Mansaray Such is the power Swift has over her fanbase, by re-recording almost identical songs and encouraging Swifties to stream the new versions, it is likely to have devalued the rights that had been sold without her.  This means Taylor Swift potentially acquired the back catalogue for a fraction of what Scooter or Shamrock paid.   How much it cost to re-acquire her song rights has not been disclosed but it looks like she won't be re-recording the Debut and Reputation albums.  So the good news comes with a cruel summer for fans who had particularly been anticipating the latter’s re-release. What it means for Reputation fans Just two albums remained to be re-released by Swift - her self-titled debut album and Reputation. The latter was a particularly strong source of speculation among fans, who would look for clues in her outfits during her record-breaking Era's tour. But this announcement could spell the end of that. \"Full transparency: I haven't even re-recorded a quarter of it,\" Swift said.  She said Reputation was \"so specific\" to a certain time in her life, that she kept hitting a block when she tried to re-record it. She also said she felt it was the first album she could not improve by re-recording it. Debut has been re-recorded, with Swift saying she \"loves how it sounds now\". Read more about Taylor Swift:Swift's final London show was the 'best'The impact of the 'excruciating' Era's tourHer new chart record But both albums could still \"re-emerge when the time is right\", particularly the unreleased tracks. \"If it happens, it won't be from a place of sadness and longing for what I wish I could have,\" Swift said. How Swift's stance changed the music industry In the music industry, the owner of a master controls all rights to their artists' recordings. This is usually agreed in contracts with artists, and allows them to recoup the financial investment they make in stars, including funding production, marketing and promotion. It also means they can distribute it to new streaming services or license the songs to be used in movies. Swift, as co-writer of her music, had always maintained publishing rights. \"I do want my music to live on. I do want it to be in movies. I do want it to be in commercials. But I only want that if I own it,\" she told Billboard in 2019. Swift said today she had been \"heartened by the conversations this saga had reignited within my industry among artists and fans\". \"Every time a new artist tells me they negotiated to own their master recordings in their record contract because of this right, I'm reminded of how important it was for all of this to happen.\""
    },
    {
        "title": "Loretta Swit, Emmy-winning actress and star of M*A*S*H, dies aged 87",
        "description": "Loretta Swit, who won Emmy Awards for her role on the comedy series M*A*S*H, has died aged 87.",
        "url": "https://news.sky.com/story/loretta-swit-emmy-winning-actress-and-star-of-mash-dies-aged-87-13377161",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-loretta-swit-1971-celebrity_6931642.jpg?20250530211035",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-30 19:58:00",
        "Headline": "Loretta Swit was best known for her star turn as Major Margaret Houlihan on CBS' M*A*S*H, which aired for 11 years from 1972 to 1983 and saw her win two Emmy Awards.",
        "Content": "Loretta Swit, who won Emmy Awards for her role on the comedy series M*A*S*H, has died aged 87. Her publicist, Harlan Boll, said the actress passed away at her home in New York City just after midday on Friday, likely from natural causes. She was best known for her star turn as Major Margaret Houlihan on CBS' M*A*S*H, which aired for 11 years from 1972 to 1983. Based on Robert Altman's 1970 film of the same name, M*A*S*H has been ranked as one of the greatest shows of all time by Rolling Stone and Time Out, with the finale watched by more than 100 million viewers - the most-watched episode of any scripted series ever. In the film, Major Margaret Houlihan was a one-dimensional, promiscuous character nicknamed Hot Lips, but the character was developed and deepened in the show. Swit told Suzy Kalter, author of \"The Complete Book of M*A*S*H,\" that as the show went on, \"I decided to try to play her as a real person, in an intelligent fashion, even if it meant hurting the jokes\". She won Emmy Awards for Outstanding Supporting Actress in a Comedy Series in 1980 and 1982 for her role in the show. \n                  Trump to double tariffs on steel imports - as he threatens China\n                 \n                  Painfully soft and inane questions for Musk's White House swan song\n                 \n                  Musk appears with black eye at White House farewell - as Trump says he's 'not really leaving'\n                 Born Loretta Jane Szwed in Passaic, New Jersey, in 1937, she was the daughter of Polish immigrants. She enrolled in the American Academy of Dramatic Arts before arriving in Hollywood in 1969. Along with M*A*S*H, she made appearances in shows like Gunsmoke, Hawaii Five-O, Mission Impossible and Bonanza. Swit also made regular appearances in theatre, starring on Broadway in 1975 in Same Time, Next Year, and The Mystery of Edwin Drood in 1986. Swit also appeared in a number of TV musical specials, including The Muppet Show and the Broadway musical It's a Bird, It's a Plane, It's Superman."
    },
    {
        "title": "Russell Brand: Comedian and actor pleads not guilty to rape and sexual assault charges",
        "description": "Russell Brand has pleaded not guilty to rape and sexual assault charges as he appeared in court in London.",
        "url": "https://news.sky.com/story/russell-brand-comedian-and-actor-pleads-not-guilty-to-rape-and-sexual-assault-charges-13376737",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-russell-brand-court_6931009.jpg?20250530095514",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-30 05:29:00",
        "Headline": "The British comedian and actor has denied five charges related to alleged incidents which took place between 1999 and 2005. ",
        "Content": " Russell Brand has pleaded not guilty to rape and sexual assault charges as he appeared in court in London. The British comedian and actor, from Hambleden in Buckinghamshire, was charged by post last month with one count each of rape, indecent assault and oral rape as well as two counts of sexual assault. The charges relate to alleged incidents involving four separate women between 1999 and 2005. The 49-year-old, who has been living in the US, was flanked by two officers as he pleaded not guilty to all the charges at Southwark Crown Court today. Brand stood completely still and looked straight ahead as he delivered his pleas. The comedian, who has consistently denied having non-consensual sex since allegations were first aired two years ago, is due to stand trial in June 2026. Read more from Sky NewsMan who sold poisonous diet pills jailedFraudster who sold fake Scottish tea jailedTom Daley on LGBT rights  \n                  Man appears in court over Liverpool trophy parade incident\n                 \n                  Search for girl missing in Thames suspended\n                 \n                  NatWest boss thanks British taxpayer for 2008 bailout after government sells remaining shares\n                 He previously told his 11.2 million followers on X that he welcomed the opportunity to prove his innocence. The allegations were first made in a joint investigation by The Sunday Times, The Times and Channel 4 Dispatches in September 2023. As Friday's hearing finished, Brand replaced his sunglasses before exiting the dock and calmly walking past reporters."
    },
    {
        "title": "Comedian facing case brought by antisemitism charity over 'messages he sent to woman'",
        "description": "US comedian Reginald D Hunter is being privately prosecuted by the Campaign Against Antisemitism (CAA) over posts he sent to a woman, a court heard.",
        "url": "https://news.sky.com/story/comedian-facing-case-brought-by-antisemitism-charity-over-messages-he-sent-to-woman-13376818",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-reginald-d-hunter-comedy_6931167.jpg?20250530125555",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-30 09:13:00",
        "Headline": "No subtitle found",
        "Content": "US comedian Reginald D Hunter is being privately prosecuted by the Campaign Against Antisemitism (CAA) over posts he sent to a woman, a court heard. The 56-year-old stand-up is accused of three counts of sending an offensive communication to Heidi Bachram on X on 24 August, 10 September and 11 September last year. He was due to appear at Westminster Magistrates' Court on Friday but Deputy Chief Magistrate Tan Ikram issued a warrant for him to attend court on 7 July in his absence. Prosecutor Donal Lawler told the court that Hunter is a \"well-known comedian\" who is being privately prosecuted by the charity. It is alleged Hunter sent a computer-generated sexual image to Ms Bachram in August last year, with the charges claiming it was \"grossly offensive\". It's alleged that he then sent two antisemitic messages in the following days. Hunter regularly tours the UK and has appeared on comedy panel shows Never Mind The Buzzcocks, Have I Got News For You and 8 Out Of 10 Cats. \n                  Mountainhead: Succession writer Jesse Armstrong's new film takes aim at tech billionaires\n                 \n                  Taylor Swift buys back rights to all master recordings - but it's bad news for Reputation fans\n                 \n                  Loretta Swit, Emmy-winning actress and star of M*A*S*H, dies aged 87\n                 Mr Lawler told the court on Friday that the comedian was due to begin a tour of England and Wales tomorrow. The prosecutor said Hunter was scheduled to do a gig in London on 6 July, adding that his legal team may be able to serve him his court summons in person at the venue on that date. The CAA describes itself as an organisation of volunteers which works to \"expose and counter antisemitism through education and zero-tolerance enforcement of the law\". Stephen Silverman, the group's director of investigations and enforcement, said: \"This is one of a number of private prosecutions that we are bringing, and there will be more to say on the case in due course.\" Hunter's representatives have been approached for comment."
    },
    {
        "title": "Wynne Evans leaves BBC radio show after controversy",
        "description": "Opera singer Wynne Evans has left his BBC radio show, several months after he made \"inappropriate and unacceptable\" comments at the Strictly Come Dancing live tour launch.",
        "url": "https://news.sky.com/story/wynne-evans-leaves-bbc-radio-show-after-controversy-13376953",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wynne-evans-strictly-come-dancing_6812560.jpg?20250128112627",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-30 14:14:00",
        "Headline": "The opera singer and Strictly star announced he would now launch a new show online after the BBC decided \"not to renew\" his contract.",
        "Content": "Opera singer Wynne Evans has left his BBC radio show, several months after he made \"inappropriate and unacceptable\" comments at the Strictly Come Dancing live tour launch. The 53-year-old, known for his role in GoCompare insurance adverts, was part of the tour in January, having competed on last year's series. In a video filmed during the launch, reported by the Mail On Sunday, he was heard making the remark, for which he apologised at the time. Since January, a number of guest presenters have filled his programme on BBC Radio Wales during his absence. On Friday, Mr Evans announced that the BBC had \"decided not to renew [his] contract\". \"That show wasn't just work - it was home. It was us,\" he said. \"We laughed, we cried, we sang like nobody was listening. And somehow, through the airwaves, we became a family. \n                  Gerry Adams libel victory: 'Putting manners' on the BBC or 'hindering freedom of expression'?\n                 \n                  Former Sinn Fein leader awarded thousands in damages after winning libel action against BBC\n                 \n                  Gary Lineker bows out from Match Of The Day\n                 \"Thank you for welcoming me into your homes. Into your hearts.\" The singer from Carmarthen, West Wales, announced he would now launch The Wynne Evans Show online between 9am and 12pm every day. During last year's series, Mr Evans and his professional dance partner, Katya Jones, apologised for a \"joke\" which saw her move his hand from her waist during the show. Read more from Sky News:Man in court over Liverpool trophy parade incidentFormer Sinn Fein leader wins libel case against the BBC The 36-year-old dancer also appeared not to want to high-five her celebrity partner, which they called \"a running joke\" between them. A BBC spokesperson said Mr Evans \"is not under contract with the BBC\". \"He is not returning to the mid-morning show on BBC Radio Wales and there are currently no plans to work with him,\" they added."
    }
]