[
    {
        "title": "'Russian' drone smashes hole in Chernobyl protective shield and starts fire",
        "description": "A drone with an explosive warhead has smashed a hole in the radiation shield at the Chernobyl nuclear plant in Ukraine.",
        "url": "https://news.sky.com/story/russian-drone-smashes-hole-in-chernobyl-protective-shield-and-starts-fire-13309629",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-chernobyl-drone-attack_6829094.jpg?20250214215306",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-14 23:52:00",
        "Headline": "President Zelenskyy says the strike was a \"very clear greeting from Putin and Russian Federation\" - a claim Moscow denies.",
        "Content": " A drone with an explosive warhead has smashed a hole in the radiation shield at the Chernobyl nuclear plant in Ukraine. The plant's chief engineer, Alexander Titarchuk, said there was a \"possibility of a leak of radioactive substances, but the situation is under control\". \"The barrier which was supposed to prevent the spread of radioactive substances has ceased to function according to its original design,\" he added. Ukraine war latest: Anger after Vance's Munich speech Emergency crews were seen scaling the roof to repair the damage after a fire briefly broke out. However, Ukraine's President Volodymyr Zelenskyy and the UN International Atomic Energy Agency (IAEA) said radiation levels hadn't increased after Friday's incident. The agency also said there was no damage to the plant's inner containment shell. \n                  Chernobyl's mutant wolves appear to have developed resistance to cancer, study finds\n                 \n                  Why Europe's wild boars are radioactive\n                 \n                  Ukraine war: Russian troops have dug up Chernobyl's poisonous legacy - and they may have taken it into their own country \n                 Mr Zelenskyy told the Munich Security Conference the strike was a \"very clear greeting from Putin and Russian Federation to the security conference\". Chernobyl was famously the site of the world's worst nuclear accident in 1986, with radioactive fallout spewing over a large part of Europe. Its reactors are now encased in a huge protective structure resembling an aircraft hangar. Ukraine blamed Russia for the drone strike - but Kremlin spokesman Dmitry Peskov denied the claim, saying \"our military doesn't do that\". The IAEA did not attribute blame and only said its team stationed there had heard an explosion. It has not been possible to independently confirm who was behind the strike. Ukraine's Zaporizhzhia nuclear power plant, the largest in Europe, has also been occasionally hit by drones during the war - but fears of a major accident have so far not materialised. The Chernobyl strike came a few days after Donald Trump said he would meet Vladimir Putin to start peace negotiations after talking to the Russian leader on the phone.  US defence secretary Pete Hegseth cautioned this week any peace deal would be unlikely to see Ukraine regain all the territory taken by Russia since 2014 and also poured cold water on the prospect of it joining NATO. Getting back the stolen land is something President Zelenskyy has long insisted on - and the statement raised concerns over Ukraine being sidelined in negotiations. Read more:Ukraine still on 'irreversible path to joining NATO' - StarmerHorror for allies as Trump's shift puts security in doubt 👉 Follow Trump 100 on your podcast app 👈 Mr Zelenskyy told the Munich conference on Friday he would not negotiate with Mr Putin until the US and Europe had agreed a common plan. But he said he didn't believe the US had a clear way forward yet. He also said he thinks his country should have an army of one and a half million, with modern weapons, if its ambition to join NATO is denied."
    },
    {
        "title": "Meghan's Valentine's Day message to Harry after William and Kate share romantic photo",
        "description": "The Prince and Princess of Wales and the Duke and Duchess of Sussex have marked Valentine's Day by sharing romantic pictures.",
        "url": "https://news.sky.com/story/meghan-markle-shares-photo-kissing-prince-harry-after-the-prince-and-princess-of-wales-uploaded-similar-13309116",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harry-william-meghan_6828886.jpg?20250214184202",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-14 10:05:00",
        "Headline": "Meghan's post says she's \"missing\" her Valentine as Harry works at The Invictus Games, while William and Kate share a poignant picture with a heart emoji.",
        "Content": "The Prince and Princess of Wales and the Duke and Duchess of Sussex have marked Valentine's Day by sharing romantic pictures. William and Kate posted an image of themselves holding hands, and sitting on a blanket in the woods, as William kisses Kate on the cheek. The picture is a still taken from the video released last year when the Princess of Wales announced her cancer treatment had ended. It was posted to their X account with a heart emoji. Meghan, on her new Instagram account, has posted a black and white photo of her and Prince Harry kissing. The caption reads: \"Back home taking care of our babies, and missing my Valentine, as he continues on at the Invictus Games, changing lives and reminding all of us of the power of healing and resilience through these incredible veterans and their families. \"Beyond proud of my husband and what he's created.\" She added: \"My love, I will eat burgers & fries and fish & chips with you forever. Thank you for you. #lovewins.\" She also uploaded a video of strawberries being cut into heart shapes. The Prince and Princess of Wales's photo is the first time the couple, who were married in 2011, have released a photograph to mark Valentine's Day. Over the last year, Kate has undergone abdominal surgery, as well as chemotherapy for an undisclosed form of cancer. She has been returning to public engagements after publishing a deeply personal video to announce that her chemotherapy had come to an end in November. The video showed her spending time with her husband, Prince William, and their three children, as she said her focus was on \"staying cancer free\". Read more from Sky News:Will 'city killer' asteroid hit Earth?Pope Francis admitted to hospitalWhere is modern dating going wrong? William described 2024 as \"brutal\" and probably \"the hardest year\" of his life. The pair met at St Andrews University in Scotland and have now been together for more than 20 years."
    },
    {
        "title": "Fire breaks out at Chiltern Firehouse two days before Netflix BAFTA party",
        "description": "Around 100 people have been evacuated after a fire broke out at a luxury London hotel.  ",
        "url": "https://news.sky.com/story/fire-breaks-out-at-chiltern-firehouse-luxury-hotel-popular-with-celebrities-13309385",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-chiltern-firehouse_6828973.jpg?20250214200837",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-14 18:01:00",
        "Headline": "The celebrity haunt was due to host an after-party at the weekend, with some of the stars reportedly booked to stay.",
        "Content": " Around 100 people have been evacuated after a fire broke out at a luxury London hotel.   Twenty fire engines and around 125 firefighters were on the scene at the Chiltern Firehouse, near Baker Street. London Fire Brigade said it was called out at 2.52pm - with the cause so far unknown. The blaze at the hotel was under control on Friday night but was still going on at a building next door. The £760-a-night venue was due to host Netflix's BAFTA Awards party on Sunday. The Firehouse's bar and restaurant are popular with British stars, as well as celebrities visiting the capital. Taylor Swift chose it for a night out after finishing her Wembley shows last year, while the likes of Tom Cruise and Kate Moss have also been spotted over the years. However, it's now likely to remain shut for some time and need extensive repairs. Speaking on Friday evening, one firefighter said: \"It's completely under control in there now, but the hotel is probably going to need a large refurbishment.\" An earlier brigade statement said the fire was in \"ducting which leads from the ground floor to the roof\" and that a \"plant room at roof level is also alight\". A cordon preventing access from nearby streets was in place around the hotel, located in the upmarket Marylebone area of central London. Owner Andre Balazs, who also has Hollywood's Chateau Marmont in his portfolio, confirmed no one had been hurt and thanked firefighters. \"We know in fact one of those who rushed to the Chiltern Firehouse this evening had been stationed in the building when it was a fire station 30 years ago,\" he said in a statement. \"I am truly grateful to all of them as I am sure that this is not the Valentine's Day evening they had in mind.\" He said the cause was under investigation and the venue would be closed until further notice."
    },
    {
        "title": "Driver charged over death of girl, 9, who was hit by bus in Bexleyheath",
        "description": "A man has been charged over the death of a nine-year-old girl hit by a bus in southeast London. ",
        "url": "https://news.sky.com/story/driver-charged-over-death-of-girl-9-who-was-hit-by-london-bus-13309329",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-ada-bicakci-bexleyheath_6657371.jpg?20240815153752",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-14 17:50:00",
        "Headline": "Ada's family said she was a keen gymnast and swimmer and that her organs had been donated to help six other children.",
        "Content": "A man has been charged over the death of a nine-year-old girl hit by a bus in southeast London.  Ada Bicakci died in hospital on 5 August last year, two days after the incident in Bexleyheath. Martin Asolo-Agogua, 23, has now been charged with causing death by dangerous driving and causing death by careless driving when under influence of drink or drugs. He's also been charged with driving while over the drug limit, said Metropolitan Police. Asolo-Agogua - who was arrested on the day of the incident - has been bailed and is due to appear at Bromley Magistrates' Court on 24 March. Ada's brother, five, was also taken to hospital after the collision on Watling Street. The children were with a family member when it happened. Read more from Sky News:One of UK's most wanted men jailed after Algarve arrestMan found guilty of rape and murder of Irish backpacker  In a statement after her death, her family said Ada was a keen gymnast and swimmer. They also said her organs had been donated to help six other children. Lorna Murphy, Director of Buses at Transport for London, said: \"Our thoughts remain with the family and friends of Ada Bicakci who tragically died after a bus collision in Bexley. \"This was an appalling incident, and we have support available for everyone affected.\""
    },
    {
        "title": "Warning of sleet, snow and rare freezing rain in parts of England this weekend",
        "description": "Rare freezing rain and snow could hit parts of England this weekend.",
        "url": "https://news.sky.com/story/warning-of-sleet-snow-and-rare-freezing-rain-in-parts-of-england-this-weekend-13309429",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rain-cambridge_6828952.jpg?20250214201934",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-14 19:07:00",
        "Headline": "The Met Office has also said that there may be heavy rain over parts of southern Wales and southwest England.",
        "Content": "Rare freezing rain and snow could hit parts of England this weekend. A yellow weather warning for snow and ice is in place across parts of northern England for Saturday - covering the North East and parts of Yorkshire, from 6am to 2pm, according to the Met Office. Up to two inches of snow could fall in parts of the north, including Scotland - with passengers told to expect some travel disruption. More: Get the forecast where you are Rare freezing rain - when cold rain droplets freeze on cool surfaces and create ice - is also expected in the north. The Met Office has also said that there may be heavy rain over parts of southern Wales and southwest England. Weather forecasters say that so far this winter, we have experienced 69% of sunshine - when we should have experienced around 83%. This month alone, they say we have experienced 35% of sunshine - when we should have had 46% by this point in February. Read more on Sky News:Chancellor responds to expenses allegationsMeghan's Valentine's Day message to Harry Controversy over Stormzy's 'Free Palestine' post Broadcast meteorologist Our weather has been cold and grey day after day thanks to a blocked weather pattern and a nagging easterly wind - although parts of northern Scotland and the Northern Isles have enjoyed some winter sunshine.  Finally, though, things are slowly changing as weather fronts push in from the Atlantic. But it's a messy transition. And that means a risk of snow and ice for some of us this weekend, before wetter, windier and milder weather moves in from the west. The greatest risk of snow and freezing rain (where rain falls onto frozen surfaces and forms dangerous black ice) will be across the hills of northern England during Saturday, with parts of Scotland also at risk of sleet and snow. But once the milder and more unsettled weather does make it across the UK, we should finally see some brighter conditions later next week. 'Some snow likely' Met Office meteorologist Matthew Lehnert said: \"Through Saturday the rain will move further east and as it does it'll bump into the colder air, meaning some snow is likely, mainly for parts of northern England, covered by the snow and ice warning. \"Two to five centimetres is possible over the Cheviots and North Yorks Moors, and it's possible we could see some localised accumulations to lower levels. \"Some freezing rain could affect higher parts of the Pennines for a time too, leading to icy conditions. Some snow is possible outside the warning area, although amounts are likely to be small.\""
    },
    {
        "title": "Southport killer's sentence not unduly lenient, Attorney General says",
        "description": "The Southport child killer's sentence will not be referred to the Court of Appeal under the unduly lenient sentence scheme, the Attorney General has said.",
        "url": "https://news.sky.com/story/southport-killers-sentence-not-unduly-lenient-attorney-general-says-13309595",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:55:00",
        "Headline": "\"Rudakubana will likely never be released and will spend the rest of his life in jail\", the Attorney General said.",
        "Content": "The Southport child killer's sentence will not be referred to the Court of Appeal under the unduly lenient sentence scheme, the Attorney General has said. Axel Rudakubana, 18, was jailed for a minimum of 52 years in January, after murdering three girls at a Taylor Swift-themed dance class in July last year. However, the sentence brought criticism from a family involved in the attack and MPs, alongside calls for changes in the law. Rudakubana, who was 17 at the time, killed Alice da Silva Aguiar, nine, Bebe King, six, and Elsie Dot Stancombe, seven, and attempted to murder eight other children, who cannot be named for legal reasons, class instructor Leanne Lucas and businessman John Hayes. He received one of the highest minimum custody terms on record for the attack. Lord Hermer KC said on Friday: \"It was understandable that we received multiple requests to review the sentence under the unduly lenient sentence scheme, which is designed to identify and remedy gross errors made by judges. \"After careful consideration of independent legal advice and consultation with leading criminal barristers and the Crown Prosecution Service, I have concluded that this case cannot properly be referred to the Court of Appeal. \"No one would want the families to be put through an unnecessary further court process where there is no realistic legal basis for an increased sentence. \"The 52-year sentence imposed by the judge was the second longest sentence imposed by the courts in English history. \"Rudakubana will likely never be released and will spend the rest of his life in jail.\" Southport MP, Patrick Hurley, previously asked Lord Hermer KC to review Rudakubana's sentence, saying it is \"not severe enough\". Prime Minister Sir Keir Starmer said at the time the 18-year-old \"vile offender will likely never be released\". Read more on Sky News:Fire at London celebrity hangoutMeghan's Valentine's Day message to HarryStormzy's deleted pro-Palestine post controversy Rudakubana's sentence may be the longest imposed on a killer of his age. He cannot receive a whole-life order - reserved for those aged 21 and over - as he was 17 at the time of the attack."
    },
    {
        "title": "Children's surgeon suspended after nine surgeries fall 'below expected standards'",
        "description": "An orthopaedic surgeon who specialises in treating children has been suspended from a hospital in Cambridge after nine surgeries were found to fall \"below expected standards\".",
        "url": "https://news.sky.com/story/childrens-surgeon-suspended-after-nine-surgeries-fall-below-expected-standards-13309253",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-addenbrookes-hospital_6828807.jpg?20250214170810",
        "type": "Home",
        "Author": "Megan Harwood-Baynes, Laura Bundock, and Mark Thompson, Sky News health team",
        "Date Published": "2025-02-14 14:06:00",
        "Headline": "A helpline was launched on Friday afternoon for any parents concerned their children may have been impacted. Within two hours of it going live, the chief executive of the NHS Trust said it had already received seven phone calls. ",
        "Content": "By Megan Harwood-Baynes, Laura Bundock, and Mark Thompson, Sky News health team  An orthopaedic surgeon who specialises in treating children has been suspended from a hospital in Cambridge after nine surgeries were found to fall \"below expected standards\". A review was commissioned in October after colleagues raised concerns about the doctor. The review was completed in January and looked at a number of complex paediatric hip surgery cases performed at Addenbrookes Hospital over two and a half years. It found the outcomes of treatment provided to nine children were \"below the standard we would expect\", Cambridge University Hospitals chief executive Roland Sinker said. The impacted families were approached by the hospital. The outcomes were not life-threatening, but children's mobility was found to be affected, with \"challenges around their hips and where the upper parts of their legs meet their hips\", Mr Sinker said, adding the review started the \"moment that concerns were raised\" last year. A helpline was launched on Friday afternoon for any parents concerned their children may have been impacted. Within two hours of it going live, it had already received seven phone calls. Mr Sinker said the trust was committed to being \"utterly transparent\" about what had happened and encouraged any families who had pediatric orthopaedic surgery at Addenbrookes to reach out to the helpline, or email address, so they could identify everyone affected. \"I'm desperately sorry that we've let these nine children and their families down in this way. They deserve and should expect better than this,\" Mr Sinker said. Any patients or families who are concerned about their care can contact 0808 175 6331 or email CUH.helpline@nhs.net. Reviewing all surgeries The surgeon was put on restricted duties while an initial review took place, undertaken by an independent expert. After the review, the surgeon was suspended and is \"fully co-operating with the trust's process\", Mr Sinker said. Now the trust is undertaking a retrospective review into all of the planned surgical operations carried out by the individual during their employment. This will review the quality of care received by those patients and schedule any further clinic assessments. The trust said it had also informed the General Medical Council, NHS England and the Care Quality Commission. \"We will identify whether there were any opportunities to have identified these concerns earlier as well as any wider learning and changes required in the immediate and longer term,\" Mr Sinker said. Have you been affected? Email NHSstories@sky.uk "
    },
    {
        "title": "Fire breaks out at Chiltern Firehouse two days before Netflix BAFTA party",
        "description": "Around 100 people have been evacuated after a fire broke out at a luxury London hotel.  ",
        "url": "https://news.sky.com/story/fire-breaks-out-at-chiltern-firehouse-luxury-hotel-popular-with-celebrities-13309385",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-chiltern-firehouse_6828973.jpg?20250214200837",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-14 18:01:00",
        "Headline": "The celebrity haunt was due to host an after-party at the weekend, with some of the stars reportedly booked to stay.",
        "Content": " Around 100 people have been evacuated after a fire broke out at a luxury London hotel.   Twenty fire engines and around 125 firefighters were on the scene at the Chiltern Firehouse, near Baker Street. London Fire Brigade said it was called out at 2.52pm - with the cause so far unknown. The blaze at the hotel was under control on Friday night but was still going on at a building next door. The £760-a-night venue was due to host Netflix's BAFTA Awards party on Sunday. The Firehouse's bar and restaurant are popular with British stars, as well as celebrities visiting the capital. Taylor Swift chose it for a night out after finishing her Wembley shows last year, while the likes of Tom Cruise and Kate Moss have also been spotted over the years. However, it's now likely to remain shut for some time and need extensive repairs. Speaking on Friday evening, one firefighter said: \"It's completely under control in there now, but the hotel is probably going to need a large refurbishment.\" An earlier brigade statement said the fire was in \"ducting which leads from the ground floor to the roof\" and that a \"plant room at roof level is also alight\". A cordon preventing access from nearby streets was in place around the hotel, located in the upmarket Marylebone area of central London. Owner Andre Balazs, who also has Hollywood's Chateau Marmont in his portfolio, confirmed no one had been hurt and thanked firefighters. \"We know in fact one of those who rushed to the Chiltern Firehouse this evening had been stationed in the building when it was a fire station 30 years ago,\" he said in a statement. \"I am truly grateful to all of them as I am sure that this is not the Valentine's Day evening they had in mind.\" He said the cause was under investigation and the venue would be closed until further notice."
    },
    {
        "title": "Trump says he and Starmer will meet 'very soon'",
        "description": "Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US.",
        "url": "https://news.sky.com/story/trump-says-he-and-starmer-will-meet-very-soon-13309546",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:19:00",
        "Headline": "In an off-handed comment to reporters, the president said he will meet the prime minister in the coming weeks.",
        "Content": " Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US. Mr Trump discussed details of his phone call with Sir Keir while taking questions from the media in the White House's Oval Office on Friday. \"He asked for a meeting, and I agreed to the meeting,\" the US president told reporters. \"We're going to have a friendly meeting - very good.\" He added: \"We have a lot of good things going on. But he asked to come and see me and I just accepted his asking.\" The date for their meeting is unknown. When pressed, Mr Trump said it will happen \"very soon\". \"I think he wants to come next week… or the week after,\" he added. When asked by a reporter what they will discuss, Mr Trump said: \"I don't know. It was his request, not mine.\" \"I met him twice already, we get along very well, he's a very nice guy,\" the president said of Sir Keir. The call between the president and prime minister is understood to have happened on Thursday during Sir Keir's meeting with Mark Burnett, Washington's special envoy to the UK. The prime minister and Mr Burnett discussed the UK-US 'special relationship', and potential \"further collaboration\" on trade, technology, and culture. An Instagram story for the US Embassy in London said that, during the dinner, President Trump called Mr Burnett, who \"passed the phone to the PM\". Read more on Sky News:Risk of sleet, snow, and freezing rainMeghan's Valentine's Day message to HarryStormzy slammed for deleting 'Free Palestine' post A Downing Street spokeswoman said: \"The prime minister was pleased to host President Trump's special envoy to the United Kingdom, Mark Burnett, at Downing Street last night, during which he took a call from President Trump and discussed his forthcoming visit to the US.\" She added: \"Mr Burnett and the prime minister agreed on the unique and special nature of the UK-US relationship, the strength of our alliance, and the warmth of the connection between the two countries.\" Sir Keir's upcoming trip comes as the United Kingdom faces the potential threat of trade tariffs set by the US. Mr Trump announced plans to impose \"reciprocal tariffs\" on all countries that impose extra costs on goods from the US, including countries which charge VAT on goods, like the UK."
    },
    {
        "title": "Meghan's Valentine's Day message to Harry after William and Kate share romantic photo",
        "description": "The Prince and Princess of Wales and the Duke and Duchess of Sussex have marked Valentine's Day by sharing romantic pictures.",
        "url": "https://news.sky.com/story/meghan-markle-shares-photo-kissing-prince-harry-after-the-prince-and-princess-of-wales-uploaded-similar-13309116",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harry-william-meghan_6828886.jpg?20250214184202",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-14 10:05:00",
        "Headline": "Meghan's post says she's \"missing\" her Valentine as Harry works at The Invictus Games, while William and Kate share a poignant picture with a heart emoji.",
        "Content": "The Prince and Princess of Wales and the Duke and Duchess of Sussex have marked Valentine's Day by sharing romantic pictures. William and Kate posted an image of themselves holding hands, and sitting on a blanket in the woods, as William kisses Kate on the cheek. The picture is a still taken from the video released last year when the Princess of Wales announced her cancer treatment had ended. It was posted to their X account with a heart emoji. Meghan, on her new Instagram account, has posted a black and white photo of her and Prince Harry kissing. The caption reads: \"Back home taking care of our babies, and missing my Valentine, as he continues on at the Invictus Games, changing lives and reminding all of us of the power of healing and resilience through these incredible veterans and their families. \"Beyond proud of my husband and what he's created.\" She added: \"My love, I will eat burgers & fries and fish & chips with you forever. Thank you for you. #lovewins.\" She also uploaded a video of strawberries being cut into heart shapes. The Prince and Princess of Wales's photo is the first time the couple, who were married in 2011, have released a photograph to mark Valentine's Day. Over the last year, Kate has undergone abdominal surgery, as well as chemotherapy for an undisclosed form of cancer. She has been returning to public engagements after publishing a deeply personal video to announce that her chemotherapy had come to an end in November. The video showed her spending time with her husband, Prince William, and their three children, as she said her focus was on \"staying cancer free\". Read more from Sky News:Will 'city killer' asteroid hit Earth?Pope Francis admitted to hospitalWhere is modern dating going wrong? William described 2024 as \"brutal\" and probably \"the hardest year\" of his life. The pair met at St Andrews University in Scotland and have now been together for more than 20 years."
    },
    {
        "title": "Manchester City score legal win over Premier League - as financial rules ruled void and unenforceable",
        "description": "Manchester City have scored a legal victory over the Premier League in a long-running battle over financial rules - but both sides have conflicting interpretations of the ruling's significance.",
        "url": "https://news.sky.com/story/manchester-city-score-legal-win-over-premier-league-as-financial-rules-ruled-void-and-unenforceable-13309463",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-manchester-city-football_6754426.jpg?20241122105840",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-02-14 19:34:00",
        "Headline": "The financial rules were first introduced in December 2021 after the Saudi takeover of Newcastle.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Manchester City have scored a legal victory over the Premier League in a long-running battle over financial rules - but both sides have conflicting interpretations of the ruling's significance. In a case brought by City, an independent panel is understood to have informed clubs that Associated Party Transaction (APT) rules are void and unenforceable, Sky News understands. The rules were first introduced in December 2021 after the Saudi takeover of Newcastle to ensure commercial deals with companies linked to clubs' ownership were at a fair market value. They also targeted the revenue that could be raised by Abu Dhabi-backed City from state entities through sponsorship. City brought the legal challenge after being blocked by the Premier League from advancing new more lucrative deals with Etihad Airways and First Abu Dhabi Bank. The Premier League champions are owned by UAE vice president Sheikh Mansour. This new arbitration panel ruling found fault with the Premier League's ability as a regulator to create rules. It follows an initial verdict in October. The league responded to that by rewriting three areas of the rules found to be illegal and the revisions were passed by a majority of clubs in November. Most notably, the fair market value of shareholder loans now has to be factored into assessments about the profit and sustainability of clubs which determine how legitimate income is. The league also ensured clubs would have earlier access to a databank with comparable sponsorship values to assess their deals against. So Premier League chief executive Richard Masters believes those new rules replaced the ones now found to be void by the tribunal - attempting to underplay the impact of this ruling. In a statement after the ruling, the Premier League said: \"The tribunal's decision has found that the three narrow aspects of the old APT rules, previously found to be unlawful, cannot be separated from the rest of the previous rules as a matter of law. The result, the tribunal has determined, is that the previous APT rules, as a whole, are unenforceable. \"However, the previous APT rules are no longer in place, as clubs voted new APT rules into force in November 2024. This decision expressly does not impact the valid operation of the new rules.\" The Premier League added: \"The League continues to believe that the new APT Rules are valid and enforceable and is pressing for an expeditious resolution of this matter.\" But City are also challenging the legality of the new rules that are designed to prevent the wealthiest clubs from inflating the value of deals to spend more on players and comply with Profit and Sustainability rules (PSR). Clubs can only lose £105m over three years under PSR - which will remain in place into next season amid legal challenges blocking new regulations. Read more:Etihad boss denies paying over odds for City sponsorshipWhy Manchester City are suing Premier League City are hoping a panel rules for the third time in their favour, arguing that the Premier League amended rules in November that it has now been decided should never have been in place. And this is all before the verdict is delivered on a far bigger and more consequential case. A verdict is due imminently into more than 100 alleged breaches of financial rules stretching back to 2009."
    },
    {
        "title": "Southport killer's sentence not unduly lenient, Attorney General says",
        "description": "The Southport child killer's sentence will not be referred to the Court of Appeal under the unduly lenient sentence scheme, the Attorney General has said.",
        "url": "https://news.sky.com/story/southport-killers-sentence-not-unduly-lenient-attorney-general-says-13309595",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-axel-rudakubana-southport_6805095.jpg?20250127132536",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:55:00",
        "Headline": "\"Rudakubana will likely never be released and will spend the rest of his life in jail\", the Attorney General said.",
        "Content": "The Southport child killer's sentence will not be referred to the Court of Appeal under the unduly lenient sentence scheme, the Attorney General has said. Axel Rudakubana, 18, was jailed for a minimum of 52 years in January, after murdering three girls at a Taylor Swift-themed dance class in July last year. However, the sentence brought criticism from a family involved in the attack and MPs, alongside calls for changes in the law. Rudakubana, who was 17 at the time, killed Alice da Silva Aguiar, nine, Bebe King, six, and Elsie Dot Stancombe, seven, and attempted to murder eight other children, who cannot be named for legal reasons, class instructor Leanne Lucas and businessman John Hayes. He received one of the highest minimum custody terms on record for the attack. Lord Hermer KC said on Friday: \"It was understandable that we received multiple requests to review the sentence under the unduly lenient sentence scheme, which is designed to identify and remedy gross errors made by judges. \"After careful consideration of independent legal advice and consultation with leading criminal barristers and the Crown Prosecution Service, I have concluded that this case cannot properly be referred to the Court of Appeal. \"No one would want the families to be put through an unnecessary further court process where there is no realistic legal basis for an increased sentence. \"The 52-year sentence imposed by the judge was the second longest sentence imposed by the courts in English history. \"Rudakubana will likely never be released and will spend the rest of his life in jail.\" Southport MP, Patrick Hurley, previously asked Lord Hermer KC to review Rudakubana's sentence, saying it is \"not severe enough\". Prime Minister Sir Keir Starmer said at the time the 18-year-old \"vile offender will likely never be released\". Read more on Sky News:Fire at London celebrity hangoutMeghan's Valentine's Day message to HarryStormzy's deleted pro-Palestine post controversy Rudakubana's sentence may be the longest imposed on a killer of his age. He cannot receive a whole-life order - reserved for those aged 21 and over - as he was 17 at the time of the attack."
    },
    {
        "title": "Russian ships filmed carrying military hardware through the English Channel",
        "description": "New video captured by the Sky News helicopter shows Russian ships carrying military equipment through the English Channel.&#160;",
        "url": "https://news.sky.com/story/russian-ships-filmed-carrying-military-hardware-through-the-english-channel-13309518",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-royal-navy-channel_6828716.jpg?20250214152825",
        "type": "UK",
        "Author": "Sam Doak, OSINT producer",
        "Date Published": "2025-02-14 20:53:00",
        "Headline": "The ships, Sparta and Sparta 2, are currently carrying military equipment from Syria, where the country was forced to close its naval base after the fall of Bashar al Assad.",
        "Content": "By Sam Doak, OSINT producer   New video captured by the Sky News helicopter shows Russian ships carrying military equipment through the English Channel.  The ships, Sparta and Sparta 2, are currently carrying military equipment from Syria, where the country was forced to close its naval base following the recent fall of dictator Bashar al Assad. Both ships are owned by Oboronlogistika LLC, a company that operates on behalf of the Russian Ministry of Defence. In 2022, the US government sanctioned both vessels. Location data from Marine Traffic shows that the ships entered the English Channel at around 9.30am on 13 February. While passing through the waterway, they have been closely shadowed by the British naval vessel RFA Tideforce, which began tailing the ships on 12 February. While it does not appear to have been broadcasting its location, Sky News was also able to capture footage of the Russian Naval ship RFS Aleksandr Otrakovskiy as it accompanied Sparta and Sparta 2. RFS Aleksandr Otrakovskiy is a Ropucha class ship, which is armed and designed to facilitate beach landings. \n                  Horror, unease and questions for US allies as Trump's big shift puts European security in doubt\n                 \n                  Donald Trump calls for Russia to return to G7 - as European defence minister warns NATO of 'darkest times' since WW2  \n                 \n                  Ukraine has every reason to be worried after Trump's comments\n                 Russia's base in the Syrian town of Tartus was its only naval foothold in the Mediterranean. Established by the Soviet Union in the 1970s and modernised in 2012, it served as an important outpost for refuelling and repairs. Read more:Outside Russia's military base in SyriaJD Vance takes aim at UK and Europe After the fall of the Assad regime, the base was hurriedly evacuated. Satellite imagery from the time showed large amounts of military equipment and vehicles assembled along its pier, awaiting transport."
    },
    {
        "title": "Warning of sleet, snow and rare freezing rain in parts of England this weekend",
        "description": "Rare freezing rain and snow could hit parts of England this weekend.",
        "url": "https://news.sky.com/story/warning-of-sleet-snow-and-rare-freezing-rain-in-parts-of-england-this-weekend-13309429",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-rain-cambridge_6828952.jpg?20250214201934",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-14 19:07:00",
        "Headline": "The Met Office has also said that there may be heavy rain over parts of southern Wales and southwest England.",
        "Content": "Rare freezing rain and snow could hit parts of England this weekend. A yellow weather warning for snow and ice is in place across parts of northern England for Saturday - covering the North East and parts of Yorkshire, from 6am to 2pm, according to the Met Office. Up to two inches of snow could fall in parts of the north, including Scotland - with passengers told to expect some travel disruption. More: Get the forecast where you are Rare freezing rain - when cold rain droplets freeze on cool surfaces and create ice - is also expected in the north. The Met Office has also said that there may be heavy rain over parts of southern Wales and southwest England. Weather forecasters say that so far this winter, we have experienced 69% of sunshine - when we should have experienced around 83%. This month alone, they say we have experienced 35% of sunshine - when we should have had 46% by this point in February. Read more on Sky News:Chancellor responds to expenses allegationsMeghan's Valentine's Day message to Harry Controversy over Stormzy's 'Free Palestine' post Broadcast meteorologist Our weather has been cold and grey day after day thanks to a blocked weather pattern and a nagging easterly wind - although parts of northern Scotland and the Northern Isles have enjoyed some winter sunshine.  Finally, though, things are slowly changing as weather fronts push in from the Atlantic. But it's a messy transition. And that means a risk of snow and ice for some of us this weekend, before wetter, windier and milder weather moves in from the west. The greatest risk of snow and freezing rain (where rain falls onto frozen surfaces and forms dangerous black ice) will be across the hills of northern England during Saturday, with parts of Scotland also at risk of sleet and snow. But once the milder and more unsettled weather does make it across the UK, we should finally see some brighter conditions later next week. 'Some snow likely' Met Office meteorologist Matthew Lehnert said: \"Through Saturday the rain will move further east and as it does it'll bump into the colder air, meaning some snow is likely, mainly for parts of northern England, covered by the snow and ice warning. \"Two to five centimetres is possible over the Cheviots and North Yorks Moors, and it's possible we could see some localised accumulations to lower levels. \"Some freezing rain could affect higher parts of the Pennines for a time too, leading to icy conditions. Some snow is possible outside the warning area, although amounts are likely to be small.\""
    },
    {
        "title": "Sources close to Stormzy say 'Free Palestine' Instagram post was not deleted because of rapper's work with McDonald's",
        "description": "Stormzy did not delete an Instagram post in support of Palestinian liberation because of his recent collaboration with McDonald's, sources close to the rapper have told Sky News.",
        "url": "https://news.sky.com/story/sources-close-to-stormzy-say-free-palestine-instagram-post-was-not-deleted-because-of-rappers-work-with-mcdonalds-13309260",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-stormzy-reading-festival_6828763.jpg?20250214161436",
        "type": "UK",
        "Author": "Sabah Choudhry",
        "Date Published": "2025-02-14 14:17:00",
        "Headline": "The grime artist faced a backlash from fans for removing a pro-Palestine post from his Instagram profile, with some linking it to a recent brand deal with McDonald's.",
        "Content": "\n          News correspondent\n       Stormzy did not delete an Instagram post in support of Palestinian liberation because of his recent collaboration with McDonald's, sources close to the rapper have told Sky News. The 31-year-old grime artist has faced a backlash for removing an old post that said \"Free Palestine\" after working on a campaign with the fast-food chain. But sources close to the Vossi Bop rapper exclusively told Sky News that it \"is simply not true\" that the \"archiving\" of his Instagram post and the release of the McDonald's campaign are linked. Stormzy's recent McDonald's partnership packages his \"go-to\" order as a limited meal option, which the chain has dubbed \"The Stormzy Meal\" - containing chicken nuggets, fries, BBQ sauce, a Sprite drink, and an Oreo McFlurry. Critics of Israel called for a global boycott of McDonald's last year, when McDonald's Israel announced it donated thousands of free meals to Israel Defence Forces troops fighting in Gaza. The campaign, led by the Boycott, Divestment and Sanctions (BDS) movement, dented sales at McDonald's. The deletion of Stormzy's \"Free Palestine\" post was part of a \"mass archiving effort\" last year, the sources close to him add. They said it was \"categorically not\" linked to his involvement with McDonald's. Sky News has contacted McDonald's for comment. The now-removed Instagram post read: \"I hope everyone is good, some fleeting thoughts. \"1. Free Palestine \"2. In the future, if there is ever a clear injustice in the world, no matter how big or small, 100 times out of 100 I will be on the side of the oppressed. Unequivocally. As I always have been. Social media is a brilliant way to stand up for what is right, there are also a whole load of other ways to do this.\" After the post was deleted, many of Stormzy's fans shared that they were \"disappointed\" by the rapper's \"hypocrisy\". One person on X criticised Stormzy's McDonald's campaign, writing it was done \"for a bit of money that you don't even need\". They added: \"You deleted this post to do a McDonald's commercial.\" The Palestinian Campaign for the Academic and Cultural Boycott of Israel (PACBI), a founding member of the BDS movement, said: \"Stormzy's call for Palestinian freedom in the early stages of Israel's genocide against 2.3 million Palestinians in Gaza, when few artists were speaking out, displayed a clear stance in support of all oppressed people.\" But it added: \"Partnering with corporations that are implicated in genocide, apartheid and military occupation can only whitewash those crimes.\" In an open letter to Stormzy, the Peace and Justice Project - founded by former Labour leader Jeremy Corbyn in 2021 - also said his work with McDonald's is \"hugely disappointing, especially given the musician's otherwise proud and solid record in supporting great causes and campaigns for social justice\". The group added: \"We are therefore asking Stormzy to stand in solidarity with the Palestinian people in their hour of need and respect the BDS committee's call for a global boycott of McDonald's by ending his new partnership with them.\" Much of Gaza lies in ruins after Israel's war to destroy Hamas. More than 48,000 Palestinians have been killed, according to the Hamas-run Gaza health ministry, which does not differentiate between civilians and combatants in its count. At least 1,200 people were killed and more than 250 taken hostage when Hamas launched its massacre in Israel on 7 October 2023. Read more from Sky News:Grimes criticises MuskOne of UK's most wanted men jailed'City killer' asteroid could hit Earth Stormzy has previously supported several social justice issues - including launching a scholarship to help Black students access top universities and dedicating his Brit Award performance in 2018 to the 72 victims of the Grenfell Tower tragedy. His Instagram biography tags pro-Palestine rapper Lowkey - inviting fans to click on his account and learn about activists' calls for Palestinian liberation."
    },
    {
        "title": "Children's surgeon suspended after nine surgeries fall 'below expected standards'",
        "description": "An orthopaedic surgeon who specialises in treating children has been suspended from a hospital in Cambridge after nine surgeries were found to fall \"below expected standards\".",
        "url": "https://news.sky.com/story/childrens-surgeon-suspended-after-nine-surgeries-fall-below-expected-standards-13309253",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-addenbrookes-hospital_6828807.jpg?20250214170810",
        "type": "UK",
        "Author": "Megan Harwood-Baynes, Laura Bundock, and Mark Thompson, Sky News health team",
        "Date Published": "2025-02-14 14:06:00",
        "Headline": "A helpline was launched on Friday afternoon for any parents concerned their children may have been impacted. Within two hours of it going live, the chief executive of the NHS Trust said it had already received seven phone calls. ",
        "Content": "By Megan Harwood-Baynes, Laura Bundock, and Mark Thompson, Sky News health team  An orthopaedic surgeon who specialises in treating children has been suspended from a hospital in Cambridge after nine surgeries were found to fall \"below expected standards\". A review was commissioned in October after colleagues raised concerns about the doctor. The review was completed in January and looked at a number of complex paediatric hip surgery cases performed at Addenbrookes Hospital over two and a half years. It found the outcomes of treatment provided to nine children were \"below the standard we would expect\", Cambridge University Hospitals chief executive Roland Sinker said. The impacted families were approached by the hospital. The outcomes were not life-threatening, but children's mobility was found to be affected, with \"challenges around their hips and where the upper parts of their legs meet their hips\", Mr Sinker said, adding the review started the \"moment that concerns were raised\" last year. A helpline was launched on Friday afternoon for any parents concerned their children may have been impacted. Within two hours of it going live, it had already received seven phone calls. Mr Sinker said the trust was committed to being \"utterly transparent\" about what had happened and encouraged any families who had pediatric orthopaedic surgery at Addenbrookes to reach out to the helpline, or email address, so they could identify everyone affected. \"I'm desperately sorry that we've let these nine children and their families down in this way. They deserve and should expect better than this,\" Mr Sinker said. Any patients or families who are concerned about their care can contact 0808 175 6331 or email CUH.helpline@nhs.net. Reviewing all surgeries The surgeon was put on restricted duties while an initial review took place, undertaken by an independent expert. After the review, the surgeon was suspended and is \"fully co-operating with the trust's process\", Mr Sinker said. Now the trust is undertaking a retrospective review into all of the planned surgical operations carried out by the individual during their employment. This will review the quality of care received by those patients and schedule any further clinic assessments. The trust said it had also informed the General Medical Council, NHS England and the Care Quality Commission. \"We will identify whether there were any opportunities to have identified these concerns earlier as well as any wider learning and changes required in the immediate and longer term,\" Mr Sinker said. Have you been affected? Email NHSstories@sky.uk "
    },
    {
        "title": "Ukraine still on 'irreversible path to joining NATO' Starmer tells Zelenskyy",
        "description": "Ukraine is still on an \"irreversible path\" to joining NATO, Sir Keir Starmer has told Volodymyr Zelenskyy.",
        "url": "https://news.sky.com/story/ukraine-still-on-irreversible-path-to-joining-nato-starmer-tells-zelenskyy-13309097",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6801254.jpg?20250116130957",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-02-14 09:38:00",
        "Headline": "Sir Keir Starmer's position appears to put him at odds with the White House, after Donald Trump said he does not think Russia would allow Ukraine to join NATO.",
        "Content": "\n          Political reporter\n       Ukraine is still on an \"irreversible path\" to joining NATO, Sir Keir Starmer has told Volodymyr Zelenskyy. The UK and Ukrainian leaders spoke on the phone early on Friday, according to Downing Street. The conversation came less than 24 hours after Donald Trump told reporters at the White House that he didn't see any way \"that a country in Russia's position\" could allow Ukraine to join NATO. Ukraine war latest: Russian drone strikes Chernobyl site Mr Trump's deputy Ukraine envoy John Coale also said on Thursday that NATO membership for Ukraine was still \"on the table\". The US president has repeatedly said he wants to end the war in Ukraine, and has said he wants to start negotiations. He is also pushing for Europe to provide more support for Kyiv, and the US to spend less.  A Downing Street spokesperson said Sir Keir began the conversation by \"reiterating the UK's concrete support for Ukraine, for as long as it's needed\". They added: \"He was unequivocal that there could be no talks about Ukraine, without Ukraine. \"Ukraine needed strong security guarantees, further lethal aid and a sovereign future, and it could count on the UK to step up, he added. \"The prime minister reiterated the UK's commitment to Ukraine being on an irreversible path to NATO, as agreed by allies at the Washington summit last year. \"Discussing the upcoming third anniversary of Ukraine's courageous defence of its sovereignty in the face of Russia's barbaric full-scale invasion, the leaders agreed that it would be an important moment to demonstrate international unity and support for Ukraine. \"The leaders also reflected on the prime minister's visit to Kyiv last month, and the president updated on his plans at Munich Security Conference. \"They agreed to stay in close contact.\" Read more:Peace talks risk rewarding PutinDo Russians believe Trump can stop the war?Ukraine has every reason to be worried A statement on Mr Zelenskyy's social media said: \"I informed Prime Minister Starmer about my discussion with President Trump and contacts with the American side. The Ukrainian and American teams must work together with Europeans and all our global partners to achieve concrete results. \"The security of each nation depends on strengthening our collective security. It is crucial that every new week brings tangible results that will ensure a lasting and reliable peace. \"We also discussed an action plan for the near future to shape a common strategy on security, economic cooperation, and political partnership.\" Political correspondent After weeks of Donald Trump overturning long-established geopolitical relationships and exploding diplomatic expectations – the UK government is finally pushing back.\n Abandoning our promises to Ukraine is a red line, even for a prime minister who has recently seemed more focused on getting back in the new president's good books - in the hopes of avoiding punishing trade tariffs - than standing up for our old alliances. \n Sir Keir Starmer's early morning phone call with President Volodymyr Zelenskyy, expressing his \"concrete support\" for Ukraine, the promise of \"strong security guarantees, further lethal aid and a sovereign future\" and insistence that there should be no talks \"about Ukraine without Ukraine\" is a restatement of a long-held position not just for the UK but for all the western allies. \n But earlier this week Mr Trump ripped up that consensus with his chummy 90-minute phone call with President Vladimir Putin, suggesting that Ukraine would have to give up territory and forsake its NATO ambitions in return for any peace deal.\n Sir Keir's strategy up to now has been to tip toe around his bombastic US counterpart, hoping that the rhetoric will ultimately become detached from reality. The UK didn't utter a peep of complaint in response to the aggressive tariffs slapped on our close ally Canada.\n Yet on Ukraine the PM is finally taking a more muscular stance - not just in his broader expression of support but specifically in his commitment to the country being on an \"irreversible path to NATO, as agreed by allies at the Washington Summit last year\".\n Joining NATO – where an attack on one is treated as an attack on all – would be the ultimate security guarantee for Ukraine. The Russians see it as the ultimate provocation.\n Clearly NATO membership for Ukraine – without the support of its biggest member – would be nigh on impossible. But now the PM has shown he is willing to burn through his capital with Donald Trump in the interests of Ukraine. We don't yet know what the mercurial president's response will be; but it's a decision which will be broadly supported in Westminster and beyond.\n US officials appear set to meet with Russian counterparts at the Munich Security Conference to discuss an end to the fighting in Ukraine. While Mr Trump said Ukraine is also invited to the talks, Kyiv has said it does not expect to have a discussion with Moscow today. Mr Trump's pronouncements on the talks - that Ukraine would not be able to return to its 2014 borders nor join NATO - have drawn criticism from Russia hawks and supporters of Ukraine. 👉 Follow Trump 100 on your podcast app 👈 John Bolton, who was the president's national security adviser in his first term, said: \"Endless concessions to Moscow are a threat to American national security. \"This week the Trump [administration] blew up the NATO position on Ukraine and the Belovezha Accords, which broke up the Soviet Union. This puts every other former republic of the Soviet Union at risk of Russian aggression.\" According to the readout of the call between Sir Keir and Mr Zelenskyy, it does not appear that they discussed the missile strike on the Chernobyl nuclear powerstation overnight."
    },
    {
        "title": "'Russian' drone smashes hole in Chernobyl protective shield and starts fire",
        "description": "A drone with an explosive warhead has smashed a hole in the radiation shield at the Chernobyl nuclear plant in Ukraine.",
        "url": "https://news.sky.com/story/russian-drone-smashes-hole-in-chernobyl-protective-shield-and-starts-fire-13309629",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-chernobyl-drone-attack_6829094.jpg?20250214215306",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-14 23:52:00",
        "Headline": "President Zelenskyy says the strike was a \"very clear greeting from Putin and Russian Federation\" - a claim Moscow denies.",
        "Content": " A drone with an explosive warhead has smashed a hole in the radiation shield at the Chernobyl nuclear plant in Ukraine. The plant's chief engineer, Alexander Titarchuk, said there was a \"possibility of a leak of radioactive substances, but the situation is under control\". \"The barrier which was supposed to prevent the spread of radioactive substances has ceased to function according to its original design,\" he added. Ukraine war latest: Anger after Vance's Munich speech Emergency crews were seen scaling the roof to repair the damage after a fire briefly broke out. However, Ukraine's President Volodymyr Zelenskyy and the UN International Atomic Energy Agency (IAEA) said radiation levels hadn't increased after Friday's incident. The agency also said there was no damage to the plant's inner containment shell. \n                  Chernobyl's mutant wolves appear to have developed resistance to cancer, study finds\n                 \n                  Why Europe's wild boars are radioactive\n                 \n                  Ukraine war: Russian troops have dug up Chernobyl's poisonous legacy - and they may have taken it into their own country \n                 Mr Zelenskyy told the Munich Security Conference the strike was a \"very clear greeting from Putin and Russian Federation to the security conference\". Chernobyl was famously the site of the world's worst nuclear accident in 1986, with radioactive fallout spewing over a large part of Europe. Its reactors are now encased in a huge protective structure resembling an aircraft hangar. Ukraine blamed Russia for the drone strike - but Kremlin spokesman Dmitry Peskov denied the claim, saying \"our military doesn't do that\". The IAEA did not attribute blame and only said its team stationed there had heard an explosion. It has not been possible to independently confirm who was behind the strike. Ukraine's Zaporizhzhia nuclear power plant, the largest in Europe, has also been occasionally hit by drones during the war - but fears of a major accident have so far not materialised. The Chernobyl strike came a few days after Donald Trump said he would meet Vladimir Putin to start peace negotiations after talking to the Russian leader on the phone.  US defence secretary Pete Hegseth cautioned this week any peace deal would be unlikely to see Ukraine regain all the territory taken by Russia since 2014 and also poured cold water on the prospect of it joining NATO. Getting back the stolen land is something President Zelenskyy has long insisted on - and the statement raised concerns over Ukraine being sidelined in negotiations. Read more:Ukraine still on 'irreversible path to joining NATO' - StarmerHorror for allies as Trump's shift puts security in doubt 👉 Follow Trump 100 on your podcast app 👈 Mr Zelenskyy told the Munich conference on Friday he would not negotiate with Mr Putin until the US and Europe had agreed a common plan. But he said he didn't believe the US had a clear way forward yet. He also said he thinks his country should have an army of one and a half million, with modern weapons, if its ambition to join NATO is denied."
    },
    {
        "title": "Horror, unease and questions for US allies as Trump's big shift puts European security in doubt",
        "description": "We are witnessing one of the biggest shifts in geopolitics since the Second World War.",
        "url": "https://news.sky.com/story/horror-unease-and-questions-for-us-allies-as-trumps-big-shift-puts-european-security-in-doubt-13309375",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-orikhiv-ukraine-russia_6828958.jpg?20250214194154",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-02-14 17:48:00",
        "Headline": "Donald Trump has made clear that the American military might that has underwritten Europe's defence since the end of the Second World War can no longer be the US's primary focus. The way European governments respond will affect all our futures.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  We are witnessing one of the biggest shifts in geopolitics since the Second World War. This week one of the fundamental assumptions underpinning European security was put in doubt. American military might has underwritten the defence of Europe since 1945 - Donald Trump says that can no longer be America's primary focus. Follow latest: Ukraine casts doubt on US peace plan But there is a lot more to give America's European allies grounds for profound unease. The most immediate concern is over Ukraine. Trump has surrendered much of his leverage over Russia before potential peace talks even begin - in a way that rips up his own rules of negotiation. Observers are horrified. Nigel Gould-Davies, a Russia expert at the International Institute for Strategic Studies (IISS) thinktank, put it this way: \"A major shift in US policy towards a dangerous war appears to be driven by impulse and instinct rather than a disciplined, coordinated inter-agency process - a product not of careful thought, but of the last person to have the president's ear. Putin will work hard to make sure this person is him.\" His misgivings are shared many times over in Kyiv. One Ukrainian put it like this: \"It is terrifying to think what Russia could do with a fully mobilised war machine after accumulating military strength for two or three years. \"They have already learned from their mistakes in Ukraine.\" Should Putin agree to a ceasefire it seems highly likely he would use it to rearm and recover - then come back for more. Few defence experts believe an international deterrence force shorn of American troops and NATO Article 5 protection would put him off. It is not just European security and Ukraine straining US-European relations. There's Trump's threat to slap massive tariffs on our economies, which would make us all a lot poorer, his decision to pull out of climate change agreements, and his outlandish plans for Gaza - not to mention shutting down US aid which will no doubt cost huge numbers of lives. All of that puts him at odds with European leaders. They must now decide - do they dare stand up for their values against this president and risk being punished? Or turn a blind eye, hunker down and try to weather four more years of this? But there are more fundamental questions for America's allies now. Is the US a reliable partner anymore under such an unpredictable president? Would China be a less capricious choice perhaps? Read more:Starmer contradicts Trump on Ukraine and NATODo Russians believe Trump can stop war?Ukraine has every reason to be worried It is a hugely momentous moment for what is called the \"rules-based post-war world order\" that has kept us relatively safe and prosperous for the last 80 years. The way European governments respond will affect all our futures."
    },
    {
        "title": "Ukraine still on 'irreversible path to joining NATO' Starmer tells Zelenskyy",
        "description": "Ukraine is still on an \"irreversible path\" to joining NATO, Sir Keir Starmer has told Volodymyr Zelenskyy.",
        "url": "https://news.sky.com/story/ukraine-still-on-irreversible-path-to-joining-nato-starmer-tells-zelenskyy-13309097",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6801254.jpg?20250116130957",
        "type": "World",
        "Author": "Tim Baker",
        "Date Published": "2025-02-14 09:38:00",
        "Headline": "Sir Keir Starmer's position appears to put him at odds with the White House, after Donald Trump said he does not think Russia would allow Ukraine to join NATO.",
        "Content": "\n          Political reporter\n       Ukraine is still on an \"irreversible path\" to joining NATO, Sir Keir Starmer has told Volodymyr Zelenskyy. The UK and Ukrainian leaders spoke on the phone early on Friday, according to Downing Street. The conversation came less than 24 hours after Donald Trump told reporters at the White House that he didn't see any way \"that a country in Russia's position\" could allow Ukraine to join NATO. Ukraine war latest: Russian drone strikes Chernobyl site Mr Trump's deputy Ukraine envoy John Coale also said on Thursday that NATO membership for Ukraine was still \"on the table\". The US president has repeatedly said he wants to end the war in Ukraine, and has said he wants to start negotiations. He is also pushing for Europe to provide more support for Kyiv, and the US to spend less.  A Downing Street spokesperson said Sir Keir began the conversation by \"reiterating the UK's concrete support for Ukraine, for as long as it's needed\". They added: \"He was unequivocal that there could be no talks about Ukraine, without Ukraine. \"Ukraine needed strong security guarantees, further lethal aid and a sovereign future, and it could count on the UK to step up, he added. \"The prime minister reiterated the UK's commitment to Ukraine being on an irreversible path to NATO, as agreed by allies at the Washington summit last year. \"Discussing the upcoming third anniversary of Ukraine's courageous defence of its sovereignty in the face of Russia's barbaric full-scale invasion, the leaders agreed that it would be an important moment to demonstrate international unity and support for Ukraine. \"The leaders also reflected on the prime minister's visit to Kyiv last month, and the president updated on his plans at Munich Security Conference. \"They agreed to stay in close contact.\" Read more:Peace talks risk rewarding PutinDo Russians believe Trump can stop the war?Ukraine has every reason to be worried A statement on Mr Zelenskyy's social media said: \"I informed Prime Minister Starmer about my discussion with President Trump and contacts with the American side. The Ukrainian and American teams must work together with Europeans and all our global partners to achieve concrete results. \"The security of each nation depends on strengthening our collective security. It is crucial that every new week brings tangible results that will ensure a lasting and reliable peace. \"We also discussed an action plan for the near future to shape a common strategy on security, economic cooperation, and political partnership.\" Political correspondent After weeks of Donald Trump overturning long-established geopolitical relationships and exploding diplomatic expectations – the UK government is finally pushing back.\n Abandoning our promises to Ukraine is a red line, even for a prime minister who has recently seemed more focused on getting back in the new president's good books - in the hopes of avoiding punishing trade tariffs - than standing up for our old alliances. \n Sir Keir Starmer's early morning phone call with President Volodymyr Zelenskyy, expressing his \"concrete support\" for Ukraine, the promise of \"strong security guarantees, further lethal aid and a sovereign future\" and insistence that there should be no talks \"about Ukraine without Ukraine\" is a restatement of a long-held position not just for the UK but for all the western allies. \n But earlier this week Mr Trump ripped up that consensus with his chummy 90-minute phone call with President Vladimir Putin, suggesting that Ukraine would have to give up territory and forsake its NATO ambitions in return for any peace deal.\n Sir Keir's strategy up to now has been to tip toe around his bombastic US counterpart, hoping that the rhetoric will ultimately become detached from reality. The UK didn't utter a peep of complaint in response to the aggressive tariffs slapped on our close ally Canada.\n Yet on Ukraine the PM is finally taking a more muscular stance - not just in his broader expression of support but specifically in his commitment to the country being on an \"irreversible path to NATO, as agreed by allies at the Washington Summit last year\".\n Joining NATO – where an attack on one is treated as an attack on all – would be the ultimate security guarantee for Ukraine. The Russians see it as the ultimate provocation.\n Clearly NATO membership for Ukraine – without the support of its biggest member – would be nigh on impossible. But now the PM has shown he is willing to burn through his capital with Donald Trump in the interests of Ukraine. We don't yet know what the mercurial president's response will be; but it's a decision which will be broadly supported in Westminster and beyond.\n US officials appear set to meet with Russian counterparts at the Munich Security Conference to discuss an end to the fighting in Ukraine. While Mr Trump said Ukraine is also invited to the talks, Kyiv has said it does not expect to have a discussion with Moscow today. Mr Trump's pronouncements on the talks - that Ukraine would not be able to return to its 2014 borders nor join NATO - have drawn criticism from Russia hawks and supporters of Ukraine. 👉 Follow Trump 100 on your podcast app 👈 John Bolton, who was the president's national security adviser in his first term, said: \"Endless concessions to Moscow are a threat to American national security. \"This week the Trump [administration] blew up the NATO position on Ukraine and the Belovezha Accords, which broke up the Soviet Union. This puts every other former republic of the Soviet Union at risk of Russian aggression.\" According to the readout of the call between Sir Keir and Mr Zelenskyy, it does not appear that they discussed the missile strike on the Chernobyl nuclear powerstation overnight."
    },
    {
        "title": "Trump says he and Starmer will meet 'very soon'",
        "description": "Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US.",
        "url": "https://news.sky.com/story/trump-says-he-and-starmer-will-meet-very-soon-13309546",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:19:00",
        "Headline": "In an off-handed comment to reporters, the president said he will meet the prime minister in the coming weeks.",
        "Content": " Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US. Mr Trump discussed details of his phone call with Sir Keir while taking questions from the media in the White House's Oval Office on Friday. \"He asked for a meeting, and I agreed to the meeting,\" the US president told reporters. \"We're going to have a friendly meeting - very good.\" He added: \"We have a lot of good things going on. But he asked to come and see me and I just accepted his asking.\" The date for their meeting is unknown. When pressed, Mr Trump said it will happen \"very soon\". \"I think he wants to come next week… or the week after,\" he added. When asked by a reporter what they will discuss, Mr Trump said: \"I don't know. It was his request, not mine.\" \"I met him twice already, we get along very well, he's a very nice guy,\" the president said of Sir Keir. The call between the president and prime minister is understood to have happened on Thursday during Sir Keir's meeting with Mark Burnett, Washington's special envoy to the UK. The prime minister and Mr Burnett discussed the UK-US 'special relationship', and potential \"further collaboration\" on trade, technology, and culture. An Instagram story for the US Embassy in London said that, during the dinner, President Trump called Mr Burnett, who \"passed the phone to the PM\". Read more on Sky News:Risk of sleet, snow, and freezing rainMeghan's Valentine's Day message to HarryStormzy slammed for deleting 'Free Palestine' post A Downing Street spokeswoman said: \"The prime minister was pleased to host President Trump's special envoy to the United Kingdom, Mark Burnett, at Downing Street last night, during which he took a call from President Trump and discussed his forthcoming visit to the US.\" She added: \"Mr Burnett and the prime minister agreed on the unique and special nature of the UK-US relationship, the strength of our alliance, and the warmth of the connection between the two countries.\" Sir Keir's upcoming trip comes as the United Kingdom faces the potential threat of trade tariffs set by the US. Mr Trump announced plans to impose \"reciprocal tariffs\" on all countries that impose extra costs on goods from the US, including countries which charge VAT on goods, like the UK."
    },
    {
        "title": "Pope Francis 'stable' in hospital after being admitted with 'slight fever'",
        "description": "The Pope is stable in hospital with a slight fever after he was admitted for bronchitis treatment, the Vatican has said.",
        "url": "https://news.sky.com/story/pope-francis-admitted-to-hospital-for-bronchitis-treatment-13309020",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-vatican_6828507.jpg?20250214163314",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-14 07:04:00",
        "Headline": "The Pope has long battled health problems, including previous bouts of bronchitis.",
        "Content": " The Pope is stable in hospital with a slight fever after he was admitted for bronchitis treatment, the Vatican has said. After daily audiences he was taken to Rome's Gemelli Polyclinic, the Vatican said in a short statement on Friday morning. \"Pope Francis will be admitted to the Agostino Gemelli Polyclinic for necessary diagnostic tests and to continue hospital treatment for his ongoing bronchitis,\" it said. It later added: \"The Holy Father... has undergone specialist examinations and has started hospital drug therapy.\" \"The initial tests showed a respiratory tract infection,\" the Vatican said. \"His clinical condition is fair; he has a slight fever.\" It is still not clear how long the Pope will stay in hospital. His public meetings have been cancelled until at least Monday. The 88-year-old leader of the Catholic Church was diagnosed with bronchitis last Thursday, but since then has continued his activities and audiences. However, during his last two Wednesday general audiences at the Vatican, Pope Francis asked an aide to read his prepared remarks. \"Me, with my bronchitis, I cannot (read) still,\" the Pope said on Wednesday. \"I hope that next time I can.\" Before going to hospital on Friday, the Pope met with Slovak Prime Minister Robert Fico and the head of CNN Mark Thompson. Francis had part of one lung removed as a young man and has long battled health problems - including long bouts of bronchitis in the winter. He uses a wheelchair, walker or cane when moving around and recently fell twice, hurting his arm and chin. Read more from Sky News:One Briton dead in New Zealand crashKayaker swallowed by humpback whaleIs a 'city killer' asteroid going to hit Earth? Rome's Gemelli hospital, the largest in the city, has a special suite for treating popes. Francis spent nine days there in June 2023, when he had surgery to repair an abdominal hernia."
    },
    {
        "title": "Sources close to Stormzy say 'Free Palestine' Instagram post was not deleted because of rapper's work with McDonald's",
        "description": "Stormzy did not delete an Instagram post in support of Palestinian liberation because of his recent collaboration with McDonald's, sources close to the rapper have told Sky News.",
        "url": "https://news.sky.com/story/sources-close-to-stormzy-say-free-palestine-instagram-post-was-not-deleted-because-of-rappers-work-with-mcdonalds-13309260",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-stormzy-reading-festival_6828763.jpg?20250214161436",
        "type": "World",
        "Author": "Sabah Choudhry",
        "Date Published": "2025-02-14 14:17:00",
        "Headline": "The grime artist faced a backlash from fans for removing a pro-Palestine post from his Instagram profile, with some linking it to a recent brand deal with McDonald's.",
        "Content": "\n          News correspondent\n       Stormzy did not delete an Instagram post in support of Palestinian liberation because of his recent collaboration with McDonald's, sources close to the rapper have told Sky News. The 31-year-old grime artist has faced a backlash for removing an old post that said \"Free Palestine\" after working on a campaign with the fast-food chain. But sources close to the Vossi Bop rapper exclusively told Sky News that it \"is simply not true\" that the \"archiving\" of his Instagram post and the release of the McDonald's campaign are linked. Stormzy's recent McDonald's partnership packages his \"go-to\" order as a limited meal option, which the chain has dubbed \"The Stormzy Meal\" - containing chicken nuggets, fries, BBQ sauce, a Sprite drink, and an Oreo McFlurry. Critics of Israel called for a global boycott of McDonald's last year, when McDonald's Israel announced it donated thousands of free meals to Israel Defence Forces troops fighting in Gaza. The campaign, led by the Boycott, Divestment and Sanctions (BDS) movement, dented sales at McDonald's. The deletion of Stormzy's \"Free Palestine\" post was part of a \"mass archiving effort\" last year, the sources close to him add. They said it was \"categorically not\" linked to his involvement with McDonald's. Sky News has contacted McDonald's for comment. The now-removed Instagram post read: \"I hope everyone is good, some fleeting thoughts. \"1. Free Palestine \"2. In the future, if there is ever a clear injustice in the world, no matter how big or small, 100 times out of 100 I will be on the side of the oppressed. Unequivocally. As I always have been. Social media is a brilliant way to stand up for what is right, there are also a whole load of other ways to do this.\" After the post was deleted, many of Stormzy's fans shared that they were \"disappointed\" by the rapper's \"hypocrisy\". One person on X criticised Stormzy's McDonald's campaign, writing it was done \"for a bit of money that you don't even need\". They added: \"You deleted this post to do a McDonald's commercial.\" The Palestinian Campaign for the Academic and Cultural Boycott of Israel (PACBI), a founding member of the BDS movement, said: \"Stormzy's call for Palestinian freedom in the early stages of Israel's genocide against 2.3 million Palestinians in Gaza, when few artists were speaking out, displayed a clear stance in support of all oppressed people.\" But it added: \"Partnering with corporations that are implicated in genocide, apartheid and military occupation can only whitewash those crimes.\" In an open letter to Stormzy, the Peace and Justice Project - founded by former Labour leader Jeremy Corbyn in 2021 - also said his work with McDonald's is \"hugely disappointing, especially given the musician's otherwise proud and solid record in supporting great causes and campaigns for social justice\". The group added: \"We are therefore asking Stormzy to stand in solidarity with the Palestinian people in their hour of need and respect the BDS committee's call for a global boycott of McDonald's by ending his new partnership with them.\" Much of Gaza lies in ruins after Israel's war to destroy Hamas. More than 48,000 Palestinians have been killed, according to the Hamas-run Gaza health ministry, which does not differentiate between civilians and combatants in its count. At least 1,200 people were killed and more than 250 taken hostage when Hamas launched its massacre in Israel on 7 October 2023. Read more from Sky News:Grimes criticises MuskOne of UK's most wanted men jailed'City killer' asteroid could hit Earth Stormzy has previously supported several social justice issues - including launching a scholarship to help Black students access top universities and dedicating his Brit Award performance in 2018 to the 72 victims of the Grenfell Tower tragedy. His Instagram biography tags pro-Palestine rapper Lowkey - inviting fans to click on his account and learn about activists' calls for Palestinian liberation."
    },
    {
        "title": "White House criticised for 'disgusting' Instagram Valentine's Day post",
        "description": "The White House Instagram account has caused a stir after posting a Valentine's message - targeting illegal immigrants.",
        "url": "https://news.sky.com/story/white-house-criticised-for-disgusting-instagram-valentines-day-post-13309579",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-white-house-donald-trump_6829088.jpg?20250214214808",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:40:00",
        "Headline": "\"Whoever runs this page needs to be fired,\" one person wrote in response to the post that mirrors the Trump administration's hardline immigration policy.",
        "Content": "The White House Instagram account has caused a stir after posting a Valentine's message - targeting illegal immigrants. On a day set aside for love and romance, the post came with the less-than-pleasant message: \"Rose are red, violets are blue, come here illegally and we will deport you.\" It featured the faces of President Donald Trump and his border czar Tom Homan on a pink background. However, it did not go down particularly well with many people on the social platform. \"Whoever runs this page needs to be fired,\" one person wrote. \"So unprofessional and disgusting,\" another posted. \"I'm so disgusted and disappointed. How could anyone think this is okay? The White House!? What a country.\" Read more from Sky News:JD Vance takes aim at UK and EuropeBig questions as Trump puts security in doubt Despite being seemingly unpopular, the message matches the administration's hardline immigration policy."
    },
    {
        "title": "Man found guilty of rape and murder of Irish backpacker in India",
        "description": "A man&#160;has been found guilty&#160;of the rape and murder of Irish backpacker Danielle McLaughlin in 2017.",
        "url": "https://news.sky.com/story/man-found-guilty-of-rape-and-murder-of-irish-backpacker-in-india-13309131",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-danielle-mclaughlin_6828496.jpg?20250214110458",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-14 10:35:00",
        "Headline": "Danielle McLaughlin's body was found in March 2017 in a remote spot in south Goa, an area popular with holidaymakers. She had been raped and strangled.",
        "Content": "A man has been found guilty of the rape and murder of Irish backpacker Danielle McLaughlin in 2017. A local man, Vikat Bhagat, was convicted at the District and Sessions Court in south Goa on Friday. Ms McLaughlin's naked body was found by a farmer in March 2017 in a secluded spot in Deobagh, south Goa, an area popular with holidaymakers. The 28-year-old County Donegal woman had been raped and strangled, a post-mortem examination found. In a statement, Ms McLaughlin's mother and a sister said justice had \"finally been achieved\". \"There was no other suspect or gang involved in Danielle's death and (Vikat) Bhagat was solely responsible for cruelly ending her beautiful life,\" her mother Andrea Brannigan and sister Joleen McLaughlin Brannigan said. \"We have endured what has been effectively an eight-year murder trial with many delays and problems, right until the end, all taking place thousands of miles away from Danielle's home. \n                  'Russian' drone smashes hole in Chernobyl protective shield and starts fire\n                 \n                  Horror, unease and questions for US allies as Trump's big shift puts European security in doubt\n                 \n                  JD Vance takes centre stage at Munich Security Conference - but fears of wider European war persist\n                 \"We are content now with the judicial confirmation in public of what we already sadly knew. What further legal processes now take place we will observe.\" Read more from Sky News:Munich attack suspect had 'religious' motiveOne Briton dead and three injured in New Zealand crash Ireland's deputy premier, Simon Harris, paid tribute to her mother for what he called her \"determination and resilience\" and said he hoped the verdict \"represents some closure for the family\". Ms McLaughlin had travelled to the southern Indian state with a female Australian friend, and the pair were staying in a beach hut."
    },
    {
        "title": "Trump says he and Starmer will meet 'very soon'",
        "description": "Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US.",
        "url": "https://news.sky.com/story/trump-says-he-and-starmer-will-meet-very-soon-13309546",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:19:00",
        "Headline": "In an off-handed comment to reporters, the president said he will meet the prime minister in the coming weeks.",
        "Content": " Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US. Mr Trump discussed details of his phone call with Sir Keir while taking questions from the media in the White House's Oval Office on Friday. \"He asked for a meeting, and I agreed to the meeting,\" the US president told reporters. \"We're going to have a friendly meeting - very good.\" He added: \"We have a lot of good things going on. But he asked to come and see me and I just accepted his asking.\" The date for their meeting is unknown. When pressed, Mr Trump said it will happen \"very soon\". \"I think he wants to come next week… or the week after,\" he added. When asked by a reporter what they will discuss, Mr Trump said: \"I don't know. It was his request, not mine.\" \"I met him twice already, we get along very well, he's a very nice guy,\" the president said of Sir Keir. The call between the president and prime minister is understood to have happened on Thursday during Sir Keir's meeting with Mark Burnett, Washington's special envoy to the UK. The prime minister and Mr Burnett discussed the UK-US 'special relationship', and potential \"further collaboration\" on trade, technology, and culture. An Instagram story for the US Embassy in London said that, during the dinner, President Trump called Mr Burnett, who \"passed the phone to the PM\". Read more on Sky News:Risk of sleet, snow, and freezing rainMeghan's Valentine's Day message to HarryStormzy slammed for deleting 'Free Palestine' post A Downing Street spokeswoman said: \"The prime minister was pleased to host President Trump's special envoy to the United Kingdom, Mark Burnett, at Downing Street last night, during which he took a call from President Trump and discussed his forthcoming visit to the US.\" She added: \"Mr Burnett and the prime minister agreed on the unique and special nature of the UK-US relationship, the strength of our alliance, and the warmth of the connection between the two countries.\" Sir Keir's upcoming trip comes as the United Kingdom faces the potential threat of trade tariffs set by the US. Mr Trump announced plans to impose \"reciprocal tariffs\" on all countries that impose extra costs on goods from the US, including countries which charge VAT on goods, like the UK."
    },
    {
        "title": "White House criticised for 'disgusting' Instagram Valentine's Day post",
        "description": "The White House Instagram account has caused a stir after posting a Valentine's message - targeting illegal immigrants.",
        "url": "https://news.sky.com/story/white-house-criticised-for-disgusting-instagram-valentines-day-post-13309579",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-white-house-donald-trump_6829088.jpg?20250214214808",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:40:00",
        "Headline": "\"Whoever runs this page needs to be fired,\" one person wrote in response to the post that mirrors the Trump administration's hardline immigration policy.",
        "Content": "The White House Instagram account has caused a stir after posting a Valentine's message - targeting illegal immigrants. On a day set aside for love and romance, the post came with the less-than-pleasant message: \"Rose are red, violets are blue, come here illegally and we will deport you.\" It featured the faces of President Donald Trump and his border czar Tom Homan on a pink background. However, it did not go down particularly well with many people on the social platform. \"Whoever runs this page needs to be fired,\" one person wrote. \"So unprofessional and disgusting,\" another posted. \"I'm so disgusted and disappointed. How could anyone think this is okay? The White House!? What a country.\" Read more from Sky News:JD Vance takes aim at UK and EuropeBig questions as Trump puts security in doubt Despite being seemingly unpopular, the message matches the administration's hardline immigration policy."
    },
    {
        "title": "California hit by heavy rainfall, flash floods and mudslides",
        "description": "Just over a month after thousands fled their homes as California saw the most destructive wildfires in its history, communities across the south of the state have now been hit by flash flooding and mudslides.",
        "url": "https://news.sky.com/story/california-hit-by-heavy-rainfall-flash-floods-and-mudslides-13309109",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-floods-california_6828487.jpg?20250214105224",
        "type": "US",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-02-14 09:54:00",
        "Headline": "Southern California has been hit by heavy floods which have caused mudslides and prompted evacuation calls. It comes just over a month after the devastating wildfires in Los Angeles which saw thousands fleeing their homes.",
        "Content": "By Claire Gilbody Dickerson, news reporter  Just over a month after thousands fled their homes as California saw the most destructive wildfires in its history, communities across the south of the state have now been hit by flash flooding and mudslides. As the region is hit by what has been described as its largest storm of the season, pictures have emerged of cars being swept away in mudslides following heavy rainfall. Authorities urged people to evacuate Felton Grove, a small community along the central coast, as the San Lorenzo River threatened to break its banks. Southern California could get as much as six inches (about 15cm) of rain in the mountains and three inches (nearly 8cm) in coastal areas and valleys before the system moves out on Friday, said Brent Bower, a weather service hydrologist. Powerful gusts have also threatened to bring down trees, cause power outages and delay flights. In Altadena, mud flowed down a road during a flash flood in front of a bulldozer clearing debris in the Eaton Fire zone, while in the Pacific Palisades images showed a police officer stood at a junction in ankle-high flood waters. Both areas were badly hit by the deadly wildfires last month as more than 18,000 structures were damaged or destroyed in the Eaton and Palisades blazes. In the Hollywood Hills, a large debris flow left about eight inches (about 20cm) of mud across a road. A swift flow of debris saw a Los Angeles Fire Department vehicle being swept off the Pacific Coast Highway and into the ocean in Malibu on Thursday. One member of the fire department was in the vehicle and was able to exit with minor injuries, department spokesman Erik Scott said on X. In Pacific Palisades, one of the affected areas in last month's wildfires, one intersection of the highway was submerged in at least three feet of sludge. Some drivers tried to force their way through and police officers pushed one vehicle through the mud. In the San Francisco Bay Area, there were blackouts and small landslides. To the north in wine country, concerns were high along the flood-prone Russian River. Read more from Sky News:Pope Francis admitted to hospitalMan guilty of murder and rape of backpacker in India2024 YR4: What we know about asteroid that could hit Earth In Altadena, where a road in the north was also submerged by three feet of mud, vegetation and trees, Mehran Daoudian prepared by laying a sheet over a hole in his home's roof where fire had burned through it last month. Mr Daoudian said he was grateful city workers had arranged sandbags and concrete barriers in his neighbourhood. \"I did not leave the cars on the street because with the mudslide, (they) might go down,\" he said."
    },
    {
        "title": "TikTok returns to major US app stores after Trump reassures tech giants",
        "description": "TikTok is back on Apple and Google's US app stories after President Trump said the tech giants would not be fined if they reactivated it.",
        "url": "https://news.sky.com/story/tiktok-returns-to-major-us-app-stores-after-trump-reassures-tech-giants-13308989",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-14 04:15:00",
        "Headline": "As it considers its future in North America, TikTok still needs to convince US officials it does not threaten national security.",
        "Content": "TikTok is back on Apple and Google's US app stories after President Trump said the tech giants would not be fined if they reactivated it. They removed the hugely popular video-sharing app after a law came into effect on 19 January - the day before Mr Trump was inaugurated - requiring its Chinese owner ByteDance to sell up or face a ban. There were concerns that Beijing could use TikTok to spy on American users and the app, used by almost half of all Americans, briefly went dark. But the service was restored after Mr Trump said he would sign an executive order delaying the ban's enforcement, which he duly did, with a 75-day deadline. Both Apple and Google kept it off their app stores, however.  Now, the president has provided reassurances that neither firm will face penalties if they offer TikTok for download. He has also said his two-and-a-half month deadline could be extended, but doubts that will be necessary. As it considers its future in North America, TikTok still needs to convince US officials it does not threaten national security. One way to do that would be to find a US owner for its American operation. There is speculation it could be valued at around $100bn (£80bn) if it is sold with its algorithm. \"We will work with President Trump on a long-term solution that keeps TikTok in the United States,\" it previously said in a statement. Read more:What we know about the asteroid that could hit EarthThe Bank of England gold rush In the UK, TikTok remains banned on all UK government phones - despite ministers launching an official account. The 'UK Gov' account was created last week and has so far posted a series of public service messages on topics including digital driving licences and Labour's plan to boost neighbourhood policing. There were more than 52 million downloads of TikTok in 2024, according to market intelligence firm Sensor Tower, in a 52/48 split between Apple and Google respectively."
    },
    {
        "title": "Baby formula prices and branding leading to 'poor outcomes' for parents, watchdog says ",
        "description": "Regulators have proposed sweeping changes for the baby formula industry, saying high prices and branding are leading to \"poor outcomes\" for parents.",
        "url": "https://news.sky.com/story/baby-formula-parents-can-save-163300-annually-by-shopping-around-regulator-13309007",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-baby-milk-formula-generic_5987714.jpg?20230515204209",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-14 06:00:00",
        "Headline": "Regulators have proposed sweeping changes for the baby formula industry,  two years after Sky News revealed how a black market for baby formula had evolved as desperate families struggled to feed their children.",
        "Content": " Regulators have proposed sweeping changes for the baby formula industry, saying high prices and branding are leading to \"poor outcomes\" for parents. The Competition and Markets Authority (CMA) found many brands cost more than the weekly value of people's benefits, leading some parents to forgo food to buy formula. The report was released nearly two years after Sky News revealed how a black market for baby formula had evolved as desperate families struggled to feed their children. Parents openly described having no choice but to steal products, no longer able to afford formula as prices soared above inflation. Read more:Desperate parents are stealing baby formulaWhere to get help if you're struggling to buy baby formula  In its final report on surging prices in recent years, the CMA said parents could be saving £300 annually by switching to lower-priced brands that offered the same nutritional benefits. The CMA said the NHS could have its own non-brand baby formula, in a bid to help drive prices down. But the watchdog stopped short of recommending a price cap, which it had said it was looking into last year. National correspondent This is a moment of vindication for every parent who has struggled to afford baby formula. It's the same for every charity that has picked up the pieces of a family in crisis because they can't safely feed their baby. Their long-held suspicions that parents were getting a poor deal from the baby formula market were right. The CMA has scrutinised the industry and recommended the biggest shake-up in decades. The changes they propose are far-reaching and could help end the stigma and shame that many families feel because of the difficulties of feeding their babies. Better information, clearer labelling and greater efforts to empower parents are all long overdue. Nobody should have to feel like their only option is to steal baby milk but that is exactly what Sky News found when our investigation started two years ago. It was described to us then as a \"national scandal\" that was putting the health and development of babies at risk. Baby banks still report a never-ending demand from families needing help even though prices have started to come down and new budget formula milk brands are entering the market. The measures recommended to ministers today represent a huge opportunity for change - it is down to governments and the industry itself to make it happen. The CMA has previously reported a 25% increase in prices over the past two years, with just three companies - Nestle, Kendamil and Danone - controlling 90% of the market. The watchdog had determined that the lack of manufacturers meant there was no incentive to compete on prices, which meant additional factory costs had been passed on \"quickly\" and in full to shoppers. The CMA, which has no powers to bolster competition by increasing the number of formula producers, said its four main recommendations were aimed at delivering better outcomes for parents on both choice and price.  It said formula provided in hospitals should come in plain packaging to reduce brand influence while parents are in a \"vulnerable\" setting. Formula sold in shops should display nutritional information and not carry any claims that cannot easily be checked by parents, it said. It also recommended extending the ban on advertising to include follow-on formula, and allowing parents to use vouchers and loyalty points to buy infant formula. Sarah Cardell, chief executive of the CMA, said many parents \"pick a brand at a vulnerable moment, based on incomplete information, often believing that higher prices must mean better quality\". \"This is despite NHS advice stating that all brands will meet your baby's nutritional needs, regardless of brand or price.\" Public health minister Ashley Dalton responded: \"I welcome this report and would like to thank the Competition and Markets Authority for their thorough investigation. \"There are many benefits of breastfeeding but for those families that cannot or choose not to breastfeed, it is vital that they can access formula that is affordable and high quality. Families should not be paying over the odds to feed their babies because of outdated regulation. \"As part of our Plan for Change, we're determined to ensure every child has the best start to life. We will carefully consider these recommendations and respond fully in due course.\" A Danone UK spokesperson said: \"We agree that not currently being able to collect loyalty card points when purchasing infant formula - or use them to purchase infant formula - penalises parents unjustifiably. \"It will now be important for Government to consider how to take forward the CMA's recommendations and we look forward to engaging with all stakeholders to ensure parents in the UK are supported as much as possible.\""
    },
    {
        "title": "Thames Water launches appeal over bill limits",
        "description": "Crisis-hit Thames Water has launched a bid to charge its customers more over the next five years than the industry regulator will allow, arguing it has been unfairly treated.",
        "url": "https://news.sky.com/story/thames-water-launches-appeal-over-bill-limits-13309052",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-thames-water-maintenance_6777656.jpg?20241216120341",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-02-14 07:49:00",
        "Headline": "The UK's largest household supplier gives several reasons for seeking even higher hikes to its bills from April for the next five years.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Crisis-hit Thames Water has launched a bid to charge its customers more over the next five years than the industry regulator will allow, arguing it has been unfairly treated. Britain's biggest household supplier, which is in a battle for survival as it grapples a £19bn debt pile, had sought a 53% hike to bills from 2025-30. That demand was rejected in December by the industry regulator Ofwat, which settled on a 35% rise as part of a price determination for all suppliers across England and Wales. The level of the inflation-busting increases granted to many firms are designed to unlock record investment in infrastructure, including sewage outflows, amid widespread outrage over pollution. Thames is also under intense pressure to rake in all it can get because of the perilous state of its finances. Money latest: The £202 plane ticket refund you probably didn't know about Thames, and other suppliers, have until next week to launch an appeal process with the Competition and Markets Authority (CMA). It is understood the company's customer bills will rise, from April, in line with Ofwat's curbs until the appeals process is completed. That is expected to take months. It means the average annual bill for its 16 million households will rise to £639, according to industry data.  Read more:Water bills in England and Wales set to rise by £10 per monthThames Water faces investigation over environmental scheme delaysOctopus Energy wades into battle over Thames Water future Thames said in a statement: \"The Board of the UK's largest water and wastewater services company made this unanimous decision after concluding that the Final Determination for the regulatory period 2025 to 2030 does not appropriately support the investment and improvement that is required for Thames Water to deliver for its customers, communities and the environment for the next five years.\" The company argued Ofwat failed to take full account of the challenges within its area of operations, including London. It also complained the ruling failed to strike the right balance between risk and return. It is in talks over new investment, but is waiting to hear if the High Court will approve a £3bn rescue deal to ward off the possibility of collapse. Thames has previously said it will run out of cash by the end of March. Chairman, Sir Adrian Montague, added: \"We have taken the decision to refer our Final Determination to the Competition and Markets Authority in the interests of our customers and the environment. \"We are focused on putting the business on a long-term stable footing so we can succeed in our turnaround, and build and maintain an infrastructure that supports growth and can withstand the effects of climate change.\""
    },
    {
        "title": "The Bank of England gold rush that's pushing up the price",
        "description": "Deep under the Bank of England, in a network of vaults into which cameras are rarely admitted, sits the world's second biggest known trove of gold.",
        "url": "https://news.sky.com/story/the-bank-of-england-gold-rush-thats-pushing-up-the-price-13308406",
        "image_url": "https://e3.365dm.com/20/08/1920x1080/skynews-gold-bar-bullion_5058580.jpg?20200805094103",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-02-14 00:01:00",
        "Headline": "Sky's Ed Conway explains why the Bank's vaults have been seeing heavy outflows of the precious metal and what the consequences of this exodus are.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Deep under the Bank of England, in a network of vaults into which cameras are rarely admitted, sits the world's second biggest known trove of gold. Once upon a time the Bank's vaults stored bullion owned by the Crown but these days they serve mostly as a repository for other central banks and private banks that want to hold on to this critical asset. But in recent weeks fears have been raised that the vaults are slowly being emptied - leading to other fears, that the Bank is struggling to keep up with the outflow. All of which raises a somewhat ominous question: is the Bank of England running out of gold? Well, now the governor has told Sky News that there is no shortage of gold left inside the central bank's vaults, though he acknowledged that billions of pounds of bullion had left and been flown across the Atlantic in recent months. The movements are a symptom of a deeper financial issue. Traders are fretting about the possibility of Donald Trump imposing tariffs on movements of precious metals into the US. The pre-emptive trades have seen a sudden sharp rise in the amount of gold held in New York, not just from London but also from elsewhere around the world. However, repatriating gold is no simple matter. Moving it in and out of vaults takes time, not to mention security, and the gold rush has led to a shortage of logistics options. Adding to the complexity is the fact that the Bank's vaults are not really designed to cater for large-scale inflows and outflows - so simply getting bars isn't easy. Last week, deputy governor Dave Ramsden said: \"Gold is a physical asset. So there are real logistical constraints and security constraints. It takes time and the stuff is also quite heavy, as you know.\" \n                  Bank of England rate-setter sees no repeat of extended inflation spike ahead\n                 \n                  Interest rate path is tricky to navigate in tougher economy\n                 \n                  Bank of England governor to join Reeves on key China visit\n                 The upshot is there is a multi-week wait for anyone wanting to remove gold from the Bank, which in turn has pushed up the price of gold in London. Talking to Sky News last week, Andrew Bailey said: \"London is a very important gold market. We have seen a movement in the relative price of gold in London and New York in recent times. And that is causing some gold to be moved to New York. Not vast: it's under 2% of our stock. \"Obviously you have to have a lot of security and a lot of insurance around moving gold. So you can't just put it all on the back of a lorry and take it away. So it has to be planned. \"So there are constraints, because of physical constraints. But we've got slots for all the gold people want to move in and out.\" Asked where there was still plenty of gold left in the Bank of England, the governor said: \"There's still plenty of gold.\" Adrian Ash, director of research at precious metals marketplace BullionVault, said: \"There is a shortage in London's bullion market, but it's a shortage of manpower and trucks. New York, in contrast, now has a glut of gold. \"This is a financial market phenomenon. It's helped juice prices higher, but it hasn't had any real impact on the availability of metal. And it will, most likely in due course, all come back out again. \"London remains the centre of the world's gold trading and storage network. Short-term bottlenecks are nothing new, and they just to serve to highlight the underlying physical reality of the global gold market. \"Longer-term however, the Bank of England's role as a custody for foreign central banks wanting to tap the London market may be dented. It's already seen stockpiles edge lower in recent years, even amid a surge of emerging-market central bank buying, as reserves managers worry over sanctions and other political risks vis-à-vis the West versus the Rest.\""
    },
    {
        "title": "TikTok returns to major US app stores after Trump reassures tech giants",
        "description": "TikTok is back on Apple and Google's US app stories after President Trump said the tech giants would not be fined if they reactivated it.",
        "url": "https://news.sky.com/story/tiktok-returns-to-major-us-app-stores-after-trump-reassures-tech-giants-13308989",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-14 04:15:00",
        "Headline": "As it considers its future in North America, TikTok still needs to convince US officials it does not threaten national security.",
        "Content": "TikTok is back on Apple and Google's US app stories after President Trump said the tech giants would not be fined if they reactivated it. They removed the hugely popular video-sharing app after a law came into effect on 19 January - the day before Mr Trump was inaugurated - requiring its Chinese owner ByteDance to sell up or face a ban. There were concerns that Beijing could use TikTok to spy on American users and the app, used by almost half of all Americans, briefly went dark. But the service was restored after Mr Trump said he would sign an executive order delaying the ban's enforcement, which he duly did, with a 75-day deadline. Both Apple and Google kept it off their app stores, however.  Now, the president has provided reassurances that neither firm will face penalties if they offer TikTok for download. He has also said his two-and-a-half month deadline could be extended, but doubts that will be necessary. As it considers its future in North America, TikTok still needs to convince US officials it does not threaten national security. One way to do that would be to find a US owner for its American operation. There is speculation it could be valued at around $100bn (£80bn) if it is sold with its algorithm. \"We will work with President Trump on a long-term solution that keeps TikTok in the United States,\" it previously said in a statement. Read more:What we know about the asteroid that could hit EarthThe Bank of England gold rush In the UK, TikTok remains banned on all UK government phones - despite ministers launching an official account. The 'UK Gov' account was created last week and has so far posted a series of public service messages on topics including digital driving licences and Labour's plan to boost neighbourhood policing. There were more than 52 million downloads of TikTok in 2024, according to market intelligence firm Sensor Tower, in a 52/48 split between Apple and Google respectively."
    },
    {
        "title": "Trump says he and Starmer will meet 'very soon'",
        "description": "Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US.",
        "url": "https://news.sky.com/story/trump-says-he-and-starmer-will-meet-very-soon-13309546",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-donald-trump-keir-starmer_6725403.jpg?20241023150903",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-14 21:19:00",
        "Headline": "In an off-handed comment to reporters, the president said he will meet the prime minister in the coming weeks.",
        "Content": " Donald Trump has confirmed he will meet Sir Keir Starmer \"very soon\" after the prime minister \"asked to come\" to the US. Mr Trump discussed details of his phone call with Sir Keir while taking questions from the media in the White House's Oval Office on Friday. \"He asked for a meeting, and I agreed to the meeting,\" the US president told reporters. \"We're going to have a friendly meeting - very good.\" He added: \"We have a lot of good things going on. But he asked to come and see me and I just accepted his asking.\" The date for their meeting is unknown. When pressed, Mr Trump said it will happen \"very soon\". \"I think he wants to come next week… or the week after,\" he added. When asked by a reporter what they will discuss, Mr Trump said: \"I don't know. It was his request, not mine.\" \"I met him twice already, we get along very well, he's a very nice guy,\" the president said of Sir Keir. The call between the president and prime minister is understood to have happened on Thursday during Sir Keir's meeting with Mark Burnett, Washington's special envoy to the UK. The prime minister and Mr Burnett discussed the UK-US 'special relationship', and potential \"further collaboration\" on trade, technology, and culture. An Instagram story for the US Embassy in London said that, during the dinner, President Trump called Mr Burnett, who \"passed the phone to the PM\". Read more on Sky News:Risk of sleet, snow, and freezing rainMeghan's Valentine's Day message to HarryStormzy slammed for deleting 'Free Palestine' post A Downing Street spokeswoman said: \"The prime minister was pleased to host President Trump's special envoy to the United Kingdom, Mark Burnett, at Downing Street last night, during which he took a call from President Trump and discussed his forthcoming visit to the US.\" She added: \"Mr Burnett and the prime minister agreed on the unique and special nature of the UK-US relationship, the strength of our alliance, and the warmth of the connection between the two countries.\" Sir Keir's upcoming trip comes as the United Kingdom faces the potential threat of trade tariffs set by the US. Mr Trump announced plans to impose \"reciprocal tariffs\" on all countries that impose extra costs on goods from the US, including countries which charge VAT on goods, like the UK."
    },
    {
        "title": "'No one raised concerns with me': Chancellor Rachel Reeves responds to expenses allegations",
        "description": "Rachel Reeves says \"no one ever raised any concerns\" about her expenses when she worked at HBOS, as she responds to reports she was investigated while working for the bank.",
        "url": "https://news.sky.com/story/no-one-raised-concerns-with-me-chancellor-rachel-reeves-responds-to-expenses-allegations-13309275",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-rachel-reeves-labour_6800978.jpg?20250116085239",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-14 14:36:00",
        "Headline": "Sir Keir Starmer has given his full backing to Chancellor Rachel Reeves following reports she was investigated over her expenses while working for a bank. A former HR partner for the bank said he did not recognise the allegations.",
        "Content": "Rachel Reeves says \"no one ever raised any concerns\" about her expenses when she worked at HBOS, as she responds to reports she was investigated while working for the bank. The chancellor was accused by former employees of being involved in an \"expenses scandal\" while working at Halifax Bank of Scotland (HBOS) from 2006 to 2009, according to the BBC. Politics latest: Starmer discusses visit with Trump Speaking for the first time in public after the reports, Ms Reeves said: \"No one ever raised any concerns about my expenses when I worked for Halifax Bank of Scotland. \"I submitted, had processed and had my expenses signed off in the proper way as you would expect, and no issues were ever raised during my time at Halifax Bank of Scotland.\" She added: \"I was never questioned, never asked to pay back any expenses.\" Yesterday, Ms Reeves' spokesperson said she was \"not aware of an investigation, nor was she interviewed\". Her lawyer has denied the allegations. Jayne Wayper, former HR business partner for HBOS, said: \"I do not recognise any of the accusations or claims that have been made against Rachel Reeves.\"  Ms Reeves added that people will judge her on how well she does at her job as chancellor, rather than on her LinkedIn profile. Her career history was changed following reports from the BBC that the amount of time that she claimed to have worked for the Bank of England was inaccurate. The chancellor said: \"I worked as an economist at the Bank of England between 2000 and 2006 before going to work in financial services for Halifax Bank of Scotland. \"And I'm really proud of the work that I did before I became an MP, but in the end, people are going to judge me on the job that I'm doing now as chancellor of the exchequer to grow the economy and put more money in the pockets of working people.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Leader of the opposition Kemi Badenoch had earlier said that Ms Reeves had \"very, very serious questions to answer\" over the reports. She said: \"Keir Starmer said that he was bringing in a government of integrity. \"He's lost one minister due to corruption allegations. Another one has had to resign because of fraud that was committed while she was working - and this is pretty close to that.\"  Sir Keir Starmer has given his full backing to his chancellor."
    },
    {
        "title": "Ukraine still on 'irreversible path to joining NATO' Starmer tells Zelenskyy",
        "description": "Ukraine is still on an \"irreversible path\" to joining NATO, Sir Keir Starmer has told Volodymyr Zelenskyy.",
        "url": "https://news.sky.com/story/ukraine-still-on-irreversible-path-to-joining-nato-starmer-tells-zelenskyy-13309097",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-keir-starmer-volodymyr-zelenskyy_6801254.jpg?20250116130957",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-02-14 09:38:00",
        "Headline": "Sir Keir Starmer's position appears to put him at odds with the White House, after Donald Trump said he does not think Russia would allow Ukraine to join NATO.",
        "Content": "\n          Political reporter\n       Ukraine is still on an \"irreversible path\" to joining NATO, Sir Keir Starmer has told Volodymyr Zelenskyy. The UK and Ukrainian leaders spoke on the phone early on Friday, according to Downing Street. The conversation came less than 24 hours after Donald Trump told reporters at the White House that he didn't see any way \"that a country in Russia's position\" could allow Ukraine to join NATO. Ukraine war latest: Russian drone strikes Chernobyl site Mr Trump's deputy Ukraine envoy John Coale also said on Thursday that NATO membership for Ukraine was still \"on the table\". The US president has repeatedly said he wants to end the war in Ukraine, and has said he wants to start negotiations. He is also pushing for Europe to provide more support for Kyiv, and the US to spend less.  A Downing Street spokesperson said Sir Keir began the conversation by \"reiterating the UK's concrete support for Ukraine, for as long as it's needed\". They added: \"He was unequivocal that there could be no talks about Ukraine, without Ukraine. \"Ukraine needed strong security guarantees, further lethal aid and a sovereign future, and it could count on the UK to step up, he added. \"The prime minister reiterated the UK's commitment to Ukraine being on an irreversible path to NATO, as agreed by allies at the Washington summit last year. \"Discussing the upcoming third anniversary of Ukraine's courageous defence of its sovereignty in the face of Russia's barbaric full-scale invasion, the leaders agreed that it would be an important moment to demonstrate international unity and support for Ukraine. \"The leaders also reflected on the prime minister's visit to Kyiv last month, and the president updated on his plans at Munich Security Conference. \"They agreed to stay in close contact.\" Read more:Peace talks risk rewarding PutinDo Russians believe Trump can stop the war?Ukraine has every reason to be worried A statement on Mr Zelenskyy's social media said: \"I informed Prime Minister Starmer about my discussion with President Trump and contacts with the American side. The Ukrainian and American teams must work together with Europeans and all our global partners to achieve concrete results. \"The security of each nation depends on strengthening our collective security. It is crucial that every new week brings tangible results that will ensure a lasting and reliable peace. \"We also discussed an action plan for the near future to shape a common strategy on security, economic cooperation, and political partnership.\" Political correspondent After weeks of Donald Trump overturning long-established geopolitical relationships and exploding diplomatic expectations – the UK government is finally pushing back.\n Abandoning our promises to Ukraine is a red line, even for a prime minister who has recently seemed more focused on getting back in the new president's good books - in the hopes of avoiding punishing trade tariffs - than standing up for our old alliances. \n Sir Keir Starmer's early morning phone call with President Volodymyr Zelenskyy, expressing his \"concrete support\" for Ukraine, the promise of \"strong security guarantees, further lethal aid and a sovereign future\" and insistence that there should be no talks \"about Ukraine without Ukraine\" is a restatement of a long-held position not just for the UK but for all the western allies. \n But earlier this week Mr Trump ripped up that consensus with his chummy 90-minute phone call with President Vladimir Putin, suggesting that Ukraine would have to give up territory and forsake its NATO ambitions in return for any peace deal.\n Sir Keir's strategy up to now has been to tip toe around his bombastic US counterpart, hoping that the rhetoric will ultimately become detached from reality. The UK didn't utter a peep of complaint in response to the aggressive tariffs slapped on our close ally Canada.\n Yet on Ukraine the PM is finally taking a more muscular stance - not just in his broader expression of support but specifically in his commitment to the country being on an \"irreversible path to NATO, as agreed by allies at the Washington Summit last year\".\n Joining NATO – where an attack on one is treated as an attack on all – would be the ultimate security guarantee for Ukraine. The Russians see it as the ultimate provocation.\n Clearly NATO membership for Ukraine – without the support of its biggest member – would be nigh on impossible. But now the PM has shown he is willing to burn through his capital with Donald Trump in the interests of Ukraine. We don't yet know what the mercurial president's response will be; but it's a decision which will be broadly supported in Westminster and beyond.\n US officials appear set to meet with Russian counterparts at the Munich Security Conference to discuss an end to the fighting in Ukraine. While Mr Trump said Ukraine is also invited to the talks, Kyiv has said it does not expect to have a discussion with Moscow today. Mr Trump's pronouncements on the talks - that Ukraine would not be able to return to its 2014 borders nor join NATO - have drawn criticism from Russia hawks and supporters of Ukraine. 👉 Follow Trump 100 on your podcast app 👈 John Bolton, who was the president's national security adviser in his first term, said: \"Endless concessions to Moscow are a threat to American national security. \"This week the Trump [administration] blew up the NATO position on Ukraine and the Belovezha Accords, which broke up the Soviet Union. This puts every other former republic of the Soviet Union at risk of Russian aggression.\" According to the readout of the call between Sir Keir and Mr Zelenskyy, it does not appear that they discussed the missile strike on the Chernobyl nuclear powerstation overnight."
    },
    {
        "title": "UK waiting to see if Trump follows through with tariffs plan",
        "description": "A waiting game on tariffs is beginning to play out between the UK and the United States on tariffs, amid warnings that Donald Trump's latest strategy could hit the UK especially hard.",
        "url": "https://news.sky.com/story/uk-waiting-to-see-if-trump-follows-through-with-tariffs-plan-13309057",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-uk-united-kingdom-england_6744874.jpg?20241110161606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-14 08:12:00",
        "Headline": "Donald Trump's latest plan for tariffs includes taking into account the sales tax levied on US goods around the world. According to one analysis, this leaves the UK as one of the most exposed nations.",
        "Content": "A waiting game on tariffs is beginning to play out between the UK and the United States on tariffs, amid warnings that Donald Trump's latest strategy could hit the UK especially hard. The US president on Thursday revealed he has asked his government to consider what tariffs should be applied to other nations - and to include the VAT applied to US goods in those countries in the calculations. It is the latest step in Mr Trump's attempts to bring production back to the US and charge other nations for access to the American market. He has asked for a report to be completed by April. Politics latest: UK won't 'overreact' to Trump tariff announcement Chancellor of the Duchy of Lancaster Pat McFadden told the Politics Hub with Sophy Ridge the UK was waiting to see how it would react. He told Sky News: \"Sometimes tariffs are announced, a couple of days later, they are unannounced.\" Mr Trump's latest announcement was made just before Mr McFadden spoke to Sky News. Sir Keir Starmer also spoke to Mr Trump on Thursday afternoon by phone, with a Downing Street spokesperson saying the conversation happened during a meeting between the prime minister and the president's special envoy to the UK, Mark Burnett. Mr Burnett and Sir Keir \"emphasised the huge potential for even stronger collaboration on trade, tech and cultural matters between the US and the UK\", the spokesperson added. Kemi Badenoch, the leader of the Conservative Party, urged Sir Keir to reopen trade negotiations with the US to secure a agreement that would avoid tariffs. Paul Ashworth, the chief North America analyst at Capital Economics, estimated that the UK would be the fourth most impacted country if Mr Trump's regime imposes the minimum WTO tariffs across the board added to each nation's VAT rate. India would get a 29% tariff, Brazil a 28% rate, followed by the EU on 25% and then the UK on 24%. Read more:Trump triggers prospect of global trade warRisk of raising prices in US could stop plan  The Trump administration is also looking at subsidies, \"burdensome regulatory requirements\" on US businesses and restrictions on animal and plant products. This could include the UK's food safety regime that has seen US chlorine-washed chicken prevented from being sold in Britain. Mr McFadden told Sky News that the government policy is not to react to every announcement Mr Trump makes. \"We took the decision… that we wouldn't breathlessly chase every headline that was coming out over the last month,\" he said. \"I think that's the right decision.\" Mr McFadden added: \"We will always stand up for the national interest, it's a government's duty to do that, but the best thing in the national interest is to maintain a good trading relationship with everybody that we need to maintain that with, right across the world.\" 👉 Follow Trump 100 on your podcast app 👈 Speaking to Sky News on Friday morning, Science Secretary Peter Kyle said: \"We will assess any changes and challenges that come down the line from any part of the global economy, and we will act appropriately in the best interest of Britain.\""
    },
    {
        "title": "MPs in controversial Labour WhatsApp group should never have been in parliament, says Harman",
        "description": "People who believe the things posted in a controversial Labour WhatsApp group shouldn't have been MPs in the first place, according to Harriet Harman.",
        "url": "https://news.sky.com/story/mps-in-controversial-labour-whatsapp-group-should-never-have-been-in-parliament-says-harman-13308434",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-andrew-gwynne-electoral_6827523.png?20250213120717",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-14 00:01:00",
        "Headline": "Harriet Harman was a Labour MP for 42 years. Speaking to Sky News' Electoral Dysfunction podcast, she said that Andrew Gwynne and Oliver Ryan would not have been selected to stand as MPs if the contents of the \"Trigger Me Timbers\" WhatsApp group were known.",
        "Content": "People who believe the things posted in a controversial Labour WhatsApp group shouldn't have been MPs in the first place, according to Harriet Harman. Speaking on the Electoral Dysfunction podcast, the veteran Labour parliamentarian said the scandal was \"very serious\" as the public already thinks MPs are \"contemptuous of their voters\". Politics live: Follow the latest updatesElectoral Dysfunction: Listen where you get your podcasts Ms Harman was a Labour MP for 42 years and now sits in the House of Lords. The scandal over the \"Trigger Me Timbers\" WhatsApp group has seen former health minister Andrew Gwynne sacked from the government and suspended from the Labour Party. Fellow MP Oliver Ryan has also been suspended from the party. Both men are still MPs. And 11 councillors in Manchester have also been suspended, including Mr Gwynne's wife.  Speaking on the podcast, Ms Harman said: \"I think it's very serious. One of the things that people think about MPs is that they talk nicely in public, but actually they're contemptuous of their voters in private. \"And they say one thing publicly, but they believe something completely different. \"And what this WhatsApp group has shown is exactly that. \"A lot of people have said, 'oh, how stupid they were to write this down', but I think it's much more profound than that. \"I think if you have got racist thoughts, and you have got antisemitic beliefs, and if you've got contempt for the people you're supposed to be representing, you shouldn't be an MP. \"It's not that you shouldn't write it down in a WhatsApp group. \"You shouldn't be an MP in the first place.\" Read more:The alleged messages and who sent them11 councillors suspended over scandalMP 'deeply regrets' comments he made Ms Harman said that Mr Ryan and Mr Gwynne would not have been selected by their local Labour branch to run as MPs if the contents of the WhatsApp group were known. She added: \"Keir Starmer was absolutely right to not miss a beat, but to say all of these people - they shouldn't be in the Labour Party. \"And that comes with political risks, because if there are by-elections, those will be very difficult by-elections.\" Former Scottish Tory leader Ruth Davidson reckons that the likelihood of voluntary by-elections was unlikely. She told the podcast: \"We're about six months into a parliament. \"There's four and a half years of collecting a £90,000 plus salary that they can both have, whether they've got the Labour whip or not. \"I don't think they're going to voluntarily resign and refight their seat.\" She also pointed out that, as both men represent seats in and around Greater Manchester, Sir Keir Starmer and Labour would be competing against Reform more than the Conservative Party, which he will want to avoid as it could give Nigel Farage's party momentum."
    },
    {
        "title": "2024 YR4: What we know about the asteroid that could hit Earth",
        "description": "This is not a drill. There is a chance - albeit a small one - that an asteroid could hit planet Earth within the next decade.",
        "url": "https://news.sky.com/story/2024-yr4-what-we-know-about-the-asteroid-that-could-hit-earth-13307919",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-asteroid-earth-space_6826746.jpg?20250212165816",
        "type": "Technology",
        "Author": "Jake Levison",
        "Date Published": "2025-02-14 00:01:00",
        "Headline": "There is an estimated 2.3% chance that the 2024 YR4 asteroid is heading our way. Here's everything you need to know about the space rock - including how much damage it could actually cause.",
        "Content": "\n          News reporter\n        This is not a drill. There is a chance - albeit a small one - that an asteroid could hit planet Earth within the next decade. The 2024 YR4 asteroid set off automated asteroid warning systems after it was spotted through advanced telescopes in Rio Hurtado, Chile, last December. Since then, the asteroid has jumped to the top of the risk list - a catalogue of all space objects which could possibly clash with our planet. It's far from panic stations - but experts say the probability of an impact with Earth has almost doubled from 1.2% in January to about 2.3% now. But how much do we know about the asteroid, and when will we know for sure if we're safe? Plus: what could happen if it really is heading our way? When could it hit - and where? If there is impact, it's estimated to be at 2.02pm on 22 December 2032 - though the precise time is prone to change, as is the exact probability of its collision with Earth. NASA says the asteroid would likely hit somewhere across the eastern Pacific Ocean, northern South America, the Atlantic Ocean, Africa, the Arabian Sea, or South Asia. What we know about the asteroid 2024 YR4 is estimated to be between 40m to 90m wide - or 130ft to 300ft. It's made of a rocky substance rather than more robust materials like iron, which is significant because it means it could break into smaller pieces if it enters Earth's atmosphere, says Doctor Luca Conversi, who is the manager of the European Space Agency's (ESA) Near-Earth Object Coordination Centre (NEOCC), which is heavily involved in monitoring 2024 YR4. The asteroid is currently at level three on the Torino Impact Hazard Scale, which is a system used to determine how big a threat an asteroid or comet is to planet Earth. Level 3 is defined as a \"close encounter meriting attention by astronomers\", because it has a 1% or greater chance of collision capable of localised destruction. The Torino Scale is the reason we know about the asteroid, because level 3 determines that the public and public officials should be notified when the encounter is less than a decade away. For context: level 0 is when there is no chance or almost no chance of collision, and level 10 is reserved for when a collision capable of causing global catastrophe is certain. Size matters - here's why There is a big difference between an asteroid that's 40m wide or 90m wide - but experts aren't yet sure how big this one is. Determining its rough size was important, because it is the size which reveals how big a threat we might be facing. Earth is bombarded with more than 100 tons of dust and sand-sized particles every day, according to NASA - but they are small enough that they typically burn up in the atmosphere before they can cause any damage. This means an asteroid or comet can have a 100% chance of reaching Earth but still be a 0 on the Torino Scale because its size doesn't pose a threat. But 2024 YR4 is a level 3 threat because it is definitely larger than the 20m (65ft) threshold. Its rough size has been estimated through the use of powerful telescopes, which are being used mainly to determine its orbit and whether it could be on course for Earth. But those telescopes only allow astronomers to study the asteroid via the visible light it reflects from the sun. The general rule is that the brighter an asteroid is, the larger it is, but it all depends on how reflective the asteroid is. 2024 YR4 could be 40m across and very reflective, or 90m across and not very reflective, the ESA says. Without knowing its exact size, experts can't determine how significant the impact could be. That's where NASA's powerful James Webb Space Telescope comes in. The device, which has previously been used to capture unprecedented pictures of stars being born and dying, is now studying the asteroid using infrared light - or heat - which will lead to a better estimate of its size. How much damage could it do? If it does hit Earth, NASA says it would impact at a high velocity, roughly 17 kilometres per second - about 38,000mph. \"At about 40m it could be something that would be like an air blast - it might shatter some windows - wouldn't do too much damage,\" space journalist Kate Arkless Gray told presenter Wilfred Frost on Sky News Breakfast. \"If it was on the 90m end of the scale, we're looking at what they would call a city killer, where if it was to land on a major city - and there are a few in the potential hit zone - that would be disastrous.\"  What is happening now?  The asteroid is currently tens of millions of miles away from Earth, and is moving further away as it's set to go around the Sun. It means scientists only have another few months to observe the asteroid until it disappears behind the Sun. \"We will be able to observe the asteroid until April,\" Dr Conversi tells Sky News. \"In the worst-case scenario, the probability can go as high as about 20%. But most likely, it will go to 0% by then,\" he adds. So scientists will more likely than not rule out a collision with Earth by this April. If they can't, though, they will have to wait until the asteroid becomes visible again in 2028 to find out how likely it really is to head our way. Behind the scenes there is collaboration between the likes of NASA and the ESA, which both have planetary defence offices, to gather as much information as possible before the asteroid disappears from view. \"It is really fascinating to see how the worldwide community is coming together in a unique and coordinated effort to understand as much as possible about this object in a very limited amount of time,\" says Dr Conversi. There are still seven years between now and potential impact, but that time frame is a bit deceiving - because if scientists have not ruled out a collision by the time they lose sight of the asteroid in April, then they will have decisions to make before they can see it again in 2028. What could be done about it? It is only with more of a grasp on the orbit and size of the asteroid that scientists will start recommending action be taken - if it is needed. If it is heading this way, one option is to launch a spacecraft to smash into the asteroid and change its trajectory - something NASA successfully did in 2022 to the 160m-wide asteroid Dimorphos. It was called the Double Asteroid Redirection Test (DART), and was intended as a dress rehearsal should such an object ever threaten Earth. It was a success in that it reached the asteroid and hit it, shifting its orbit by around 32 minutes - but another probe called HERA is on its way to that asteroid now to assess how successful the mission really was, and it isn't due to arrive until January next year. Speaking to Kay Burley on Sky News, astronomer Dr David Whitehouse suggested scientists may need to take it a step further when it comes to 2024 YR4.  \"We might even have to consider the severe measures of sending up a nuclear weapon to the surface of this asteroid in order to deflect it further,\" he said. Prominent physicist Brian Cox has suggested that preparing to carry out a deflection mission is a good investment \"even if we don't need to use it this time\". \"It's as if the Universe has decided to do an experiment to see if Planet Earth is still capable of taking rational decisions,\" he wrote on X. Dr Conversi says it is very plausible that experts will start \"planning and actually building a mission\" to deal with the asteroid while it is orbiting the Sun, before there is confirmation that it is heading towards Earth. That's only if the risk isn't ruled out before April, when they'll lose sight of it. The Space Mission Planning Advisory Group (SMPAG), chaired by the ESA, will be issuing a recommendation about further action to the United Nations Office for Outer Space Affairs should the threat not be ruled out by the time 2024 YR4 disappears from view. Dr Conversi has told Sky News that launching something to smash into 2024 YR4 will only be considered if the asteroid is confirmed to be bigger than 50m. He added launching such a mission would not be guaranteed success. \"There will also be some uncertainty: the launch could fail, or it might be that the asteroid would not be deviated from its orbit as we predicted,\" he said. The alternative, he said, will be to take no \"active\" mitigation and instead let it hit Earth, evacuating the area it is set to hit. \"I always like to remind people that less than 5% of the Earth's surface is inhabited, so it is unlikely that the impact would occur in a populated area,\" he said when asked why this might be a viable option. He also says that while allowing it to hit Earth is a possibility, \"it'd be better to have no impact at all\". Should we actually be worried about 2024 YR4? The likes of NASA and the ESA are continually playing down the threat level, insisting that there is still an \"extremely low possibility\" of impact, and that the asteroid can be dealt with effectively even if it is heading our way. Astronomers such as Dr Whitehouse have voiced their concerns. He told Sky News the chances of the asteroid hitting Earth are \"unacceptable to ignore\" and means \"we've got some very serious decisions to make\". He claimed it could turn out to be \"the most dangerous thing in space\" and added: \"I can't stress strongly enough that this is a threat that's not a bit of astro fun, that it's not a bit of 'gosh, isn't it amazing?' \"This actually could turn out to be a serious threat to our planet.\" Read more:Scientists spot rare ring of light from far-away galaxyThe new space race to the moon heats up But Dr Conversi, when asked how the scientists behind the scenes are feeling, says there is a sense of \"hype\" because this is a rare event that allows them to \"exercise all our systems and knowledge on a real case\". \"Yet, the impact probability is low... so we aren't worried nor in any life-threatening scenarios,\" he adds. He says he tells his family and friends that \"we are not worried, quite the opposite: we know that, in all likelihood, the impact will not occur\". He adds: \"I also try to transmit the excitement this object is causing in the community and explain all the steps we have taken - and are taking.\" Has this happened before? It's very rare that an asteroid of this size has such a high probability of colliding with Earth. Comparisons have been drawn between the 2024 YR4 and the Apophis asteroid, discovered in 2004, which was briefly estimated to have a 2.7% chance of impacting Earth in 2029. But that impact probability dropped to nearly 0% within a couple of days. It was the extreme size of the Apophis - 300m - which drew the most attention to it. Earth does take direct hits from asteroids of a similar size to 2024 YR4, but only once every few thousand years. In 1908, a slightly smaller asteroid - thought to have measured 60m across - exploded over Siberia. The incident, which became known as the Tunguska Event, saw 80 million trees flattened over a remote area spanning 830 square miles. Local eyewitnesses in the sparsely populated region reported seeing a fireball and hearing a large explosion, according to NASA, but no one was harmed. Asteroids are ancient space rocks left over from the formation of the Solar System which are thought to have brought complex molecules, and possibly early life, to Earth billions of years ago."
    },
    {
        "title": "British astronaut cleared to become first disabled person to join space station mission",
        "description": "A British astronaut has been cleared to become the first person with a physical disability to take part in a mission on the International Space Station, the European Space Agency (ESA) has said.",
        "url": "https://news.sky.com/story/british-astronaut-cleared-to-become-first-disabled-person-to-join-space-station-mission-13309096",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-john-mcfall-astronaut_6828427.jpg?20250214093011",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-14 09:31:00",
        "Headline": "The former paralympian sprinter said is was \"great\" to demonstrate \"there is no technical showstopper for me flying to the International Space Station\", as he said the milestone signified a lot more than just him being found fit to travel to space.",
        "Content": " A British astronaut has been cleared to become the first person with a physical disability to take part in a mission on the International Space Station, the European Space Agency (ESA) has said. John McFall, a former paralympian sprinter from Cardiff, has been medically certified to undertake a long-duration space mission, the agency said at a news conference on Friday. Mr McFall told Sky News' science and medical correspondent Thomas Moore: \"It's great to have completed the feasibility study and demonstrated there is no technical showstopper for me flying to the International Space Station.\" He went on to say \"today's announcement is not just about me personally getting medically certified to to fly long-duration missions\". \"It's much more than that,\" he said while pointing to what he described as a culture shift in how people with disabilities are treated. \"I think it should give people faith that's it is possible to change things and people are listening and with the right support, and the right work, it is possible to change mindsets. \"And whilst this just happens to be in the space industry, it doesn't mean that it's not possible in many, many other sectors.\" \n                  2024 YR4: What we know about the asteroid that could hit Earth\n                 \n                  NASA's stuck astronaut steps out for a spacewalk after seven months in orbit\n                 \n                  Double moonshot mission begins as lunar landers blast off on SpaceX Falcon 9 rocket \n                 He also said in the news conference that he was mostly \"passive\" during the testing process, which lasted around a month and involved medical exams. He said he \"just had to demonstrate I could do the required tasks\". In 2022, the ESA launched the Fly! feasibility study to look at the challenges of getting a disabled astronaut to the ISS and Mr McFall, a father of three, was selected for the programme as a member of the ESA astronaut reserve. Science correspondent Space is not a natural place for a human being.  We would all be disabled by microgravity.\n So it's long overdue that someone with a prosthesis should be certified as medically fit to live and work on the International Space Station. John McFall has shown with the European Space Agency (ESA) that he is just as able as the other reserve astronauts waiting for the call-up for launch. A two-year feasibility study has been so successful that he even rows back on the title originally given to him of \"parastronaut\".  He's not a para-dad or a para-surgeon, his NHS job before joining the astronaut corps, he told me.  So why create an artificial divide with his potential crewmates? It’s a big moment for inclusivity. \nThere will be people living with the belief that their physical disability means space travel is just an impossible dream. But Mr McFall's journey blazes a trail for others to follow. One can't ignore the possibility that President Trump’s rage against diversity and inclusion may be a new hurdle for Mr McFall's ambition. But for ESA this is about European values. No longer should disability be an automatic no-go for a mission. Instead, make a judgement on what individuals can offer humanity's extra-terrestrial exploration. Daniel Neuenschwander, ESA's director of human and robotic exploration, told Sky News: \"John is part of the pool of astronauts who are eligible to fly to the International Space Station despite political considerations from any of our international partners. \"So this box is ticked. And I'm very proud because Europe stands for its values inclusiveness is the value of Europe. \"It's also a strong value at the European Space Agency. We stand for responsible, sustainable and sustained exploration. \"And John is just a marvellous example.\" He did not say when Mr McFall might join a mission but said: \"This is only the beginning.\" Read more on Sky News:The asteroid that could destroy EarthRing of light from far-away galaxy seenNew space race to moon heats up Experts from ESA, NASA & SpaceX helped with the feasibility study, which looked at more than 80 different areas, including medical aspects, the ESA said. Asked about the possibility of taking part in a British mission in the future, Mr McFall told the news conference that was a \"very interesting prospect\", but said there was \"nothing proposed at the moment\". The surgeon, who lost his right leg in a motorcycle accident at the age of 19, learned to run again and became a professional track and field athlete in 2005. He represented Great Britain and Northern Ireland as a Paralympic 100m sprinter and won more than a dozen medals, including bronze at the 2008 Paralympics, before leaving the sport to become an orthopaedic surgeon. Liz Johns, interim head of space exploration at the UK Space Agency, said: \"It is fantastic to see that John and the team at ESA have proved it is technically possible for someone with a physical disability like his to live and work on the International Space Station. \"This is ground-breaking work that no other space agency has done before. \"Now we are looking forward to supporting John during the next phase: Fly! Mission Ready. \"This is an essential step towards the first long-term mission for an astronaut with a physical disability.\""
    },
    {
        "title": "Ancient Egyptian mummies smell 'sweet' and 'spicy', researchers say",
        "description": "Ancient Egyptian mummies smell \"woody,\" \"spicy\" and \"sweet\", according to researchers who took part in a unique new study.",
        "url": "https://news.sky.com/story/ancient-egyptian-mummies-smell-sweet-and-spicy-researchers-say-13309255",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mummies-mummy-ancient-egypt_6828667.jpg?20250214142224",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-14 15:09:00",
        "Headline": "Researchers used what they described as \"trained, human sniffers\" to study the scent of nine mummified bodies.",
        "Content": "Ancient Egyptian mummies smell \"woody,\" \"spicy\" and \"sweet\", according to researchers who took part in a unique new study. Researchers used what they described as \"trained, human sniffers\" and equipment like an electronic, artificial nose of sorts to study the scent of nine mummified bodies. They said smell was a key consideration for ancient Egyptians when it came to the mummification process, meaning that even 5,000 years later, conservators widely consider the aroma \"pleasant\" due to the use of resins and oils such as pine, cedar, and juniper. The findings, researchers said, which were published in the Journal of the American Chemical Society, show that smell can be used as a way of analysing the preserved bodies in a non-invasive way, but they also want to find a way to recreate the smells in museums to give visitors the full mummy experience. The research was carried out by teams at the University College London (UCL) and the University of Ljubljana in Slovenia in collaboration with conservators and curators at the Egyptian Museum in Cairo. Lead author professor Matija Strlic said: \"The smell of mummified bodies has for years attracted significant interest from experts and the general public, but no combined chemical and perceptual scientific study has been conducted until now. \"This ground-breaking research really helps us better plan conservation and understand the ancient embalming materials. It adds another layer of data to enrich the museum exhibition of mummified bodies.\" \n                  Donald Trump repeats pledge to take over Gaza - as Hamas says Palestinians will foil all displacement plans\n                 \n                  Divers tell of 'corner-cutting' and life jacket shortage on tourist boat owned by same firm as sunken Red Sea vessel\n                 \n                  Egypt: Two Britons believed to be among 16 missing as tourist boat sinks after being 'hit by large wave'\n                 Read more:Kayaker swallowed by humpback whaleCare home resident, 104, enters New York prison Professor Ali Abdelhalim, co-author and director of the Egyptian Museum in Cairo, said: \"To the ancient Egyptians, mummification was an important mortuary practice aimed at preserving the body and soul for the afterlife through a detailed ritual of embalming of the deceased using oils, waxes and balms. \"The practice evolved over time, and identifying different techniques and materials used offers insights into the era, location and socioeconomic status of the individual being mummified.\" The researchers used various techniques and scientific equipment to identify the chemicals emitted by the mummified bodies, then the panel of human \"sniffers\" described the smells in terms of quality, intensity, and pleasantness. They said they would now attempt to create \"smellscapes\" in museums with ancient mummy exhibits to \"enable audiences to experience this important aspect of ancient Egyptian heritage\"."
    },
    {
        "title": "'It's not you, it's dating': Where is modern love going wrong?",
        "description": "It's more than 10 years since Tinder launched its way into our phones - and our love lives - promising romance at the swipe of a thumb. ",
        "url": "https://news.sky.com/story/its-not-you-its-dating-where-is-modern-love-going-wrong-13307076",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-digital-dating_6825358.png?20250214081255",
        "type": "Technology",
        "Author": "Charline Bou Mansour, news reporter",
        "Date Published": "2025-02-14 00:01:00",
        "Headline": "Usage of the biggest dating apps is starting to drop, and I want to find out just where we are going wrong with modern dating.",
        "Content": "By Charline Bou Mansour, news reporter   It's more than 10 years since Tinder launched its way into our phones - and our love lives - promising romance at the swipe of a thumb.  Just under five million adults in the UK visited an online dating service (app and websites) last year, according to Ofcom's Online Nation Report. But analysts are questioning whether the novelty is starting to wear off, as usage of the 10 biggest apps dropped 16% between 2023 and 2024. Tinder revolutionised romance as the first dating app in 2012 - and it is still the largest one in Match group's portfolio. But even it lost more than half a million users in the last year. \"Dating fatigue\" appears to dominate the cultural landscape - some 78% of dating app users say they feel \"emotionally, mentally, or physically exhausted\" by them, according to a 2024 study by Forbes Health, and a 2023 YouGov survey found that 46% of Brits say their dating app experiences have been bad.  I have stayed off the apps entirely, except for one impulsive evening with Hinge - one of the more popular ones among my age group. I'm not sure love can be found through swiping on a screen, and it seems I'm not alone. So what exactly has gone wrong with finding modern love - and how can we hope to find a connection? Frogs and filters With 10% of adults visiting a dating site - and almost 4% visiting one daily according to Ofcom - there is no sign they are going anywhere fast, even if numbers are dropping. Among the newcomers is Cherry. It categorises users into three \"vibes\" - casual, go-with-the-flow and meaningful - to match intentions and ensure genuine connections. There are also coaches available on the app because CEO Jo Mason believes people need to work on themselves before embarking on relationships with others. \"They're hiding behind filtered photos, they're hiding behind a phone, they're hiding behind something all the time,\" Jo says. The app's slogan is \"kiss fewer frogs\", and the brand ambassador - a frog's mask - is sitting on the table next to us. According to a Cherry study, 58% of people dating feel exhausted by the process of swiping and superficial interactions, while 40% say their motivation to meet someone has decreased as a result. Jo tells me she built Cherry out of \"frustration\", adding: \"Your options of trying to meet someone are either at the gym, bump into them at the supermarket, or through work, other than that it's apps.\" 'Dating just seems to be all admin' Thursday, an app launched in 2021, operates exclusively one day a week on - you guessed it, Thursdays - to encourage quick decision-making and in-person meetings. Co-founder George Rawlings and I meet as we head to an over-30s singles event for users of the app in London at The Shard. \"We're trying to destigmatise that whole thing around speed dating to make it normal,\" George tells me. \"Is it awkward?\" I ask, letting my intrusive thoughts win. He laughs. \"This is a different way of dating, we have obviously become so reliant on the apps for years but we're giving people new opportunities to meet people in an 'IRL' way'.\" I still can't believe how that phrase - in real life - has become an acronym, but at the same time, it is not surprising. \"My resolution for this year is to meet someone organically,\" one man tells me at the event. \"[Dating] isn't as fun as it used to be, now it just seems to be all admin,\" another says. A family member told me the same thing that week - going through the apps these days is like reading and responding to emails. One person likens it to a networking event: \"There is an unspoken pressure that everyone is single.\" As I finish speaking to someone, a man approaches me and asks what I am filming. When I tell him anyone who hasn't given consent won't be identified, he looks relieved. \"Phew,\" he says, laughing. \"Because my wife will kill me if she finds out I am here.\" So what happens if you ditch the apps? On the theme of meeting in real life, my friends and I - over 30 and single - decided to go out one evening in London to see the dating scene for ourselves. Perhaps the future of dating isn't found in an app but in the world right in front of us. But we were wrong. We didn't get approached once. People are glued to their phones - from texting in the middle of conversations to scrolling through dating apps while sitting across from someone at dinner, it seems we are physically present but mentally elsewhere. It felt like a brave act just going up to people and talking or asking dating questions. \"I feel a woman should never go look for a man,\" one of my friends tells me afterwards. \"That is probably why I am still single - because a lot of girls do shoot their shot now, they have the confidence to ask guys out. \"I even see girls getting on one knee.\" Charlene Douglas, a relationship expert, specialising in psychodynamic counselling, who is a regular guest on the TV show Married At First Sight, admits then \"men don't always know where they fit in\" when it comes to modern dating. \"To wait for a guy to approach us, I think it is a bit...1950s,\" she says. \"I think in 2025, we can say hi to a guy or we can just strike up a conversation. We're good at talking, us women, right?\" From online to artificial  It's clear the emotional toll of online dating is becoming harder to ignore - so it comes as no surprise that some daters are turning to AI chatbots to help them respond to messages from strangers. One woman, who wanted to remain anonymous, told me that she even inputs messages from men she is speaking to into ChatGPT because it offers reassurance and clarity when she feels in doubt. Rather than speaking to friends about relationships, AI can suggest possible interpretations in a \"non-biased\" and \"simplified\" way, she says. \"I over analyse things a lot anyway. So ChatGPT just simplifies it for me.\" Apps such as Replika and Blush are designed to provide AI companions for emotional support, and in some cases, even mimic romantic or intimate human relationships. It's been reported that loneliness can be as damaging to health as smoking 15 cigarettes a day, according to the World Health Organisation - but is AI just a sticking plaster on a larger problem? Read more:My AI girlfriend saved my marriageCan AI help with dating app success? Do people know what they want? Milly has created a Singles' Society group on Instagram where she posts daily affirmations. Her videos have reached millions of people - including me. \"I felt so alone in this whole dating world,\" she says. \"I was honestly so surprised that everyone else was having similar experiences.\" She plans to start events, including speed dating. But Milly has a theory when it comes to the problem with modern dating - \"It all comes down to people not knowing what they want.\" Relationship expert Charlene thinks the answer is more education in school. \"Young people try and work out how to do relationships themselves based on what they have seen at home and what they have seen around them,\" she says. \"But they don't really always know how to have healthy relationships.\" So, despite the dating fatigue, I doubt dating apps are going anywhere, with new versions cropping up every day. And for some people, they can work. Alex met her girlfriend Molly unexpectedly on one of the more popular apps, Hinge - they are now celebrating three years together: \"We are currently in the flat we bought together, so I think you could say it is going quite well.\" Molly adds: \"I think it's quite good we had the option of online dating - I don't think our paths would have crossed otherwise.\" Alex agrees: \"With online dating, you get so many people, it almost feels like a numbers game, but it really does give you the opportunity to meet so many people that you wouldn't otherwise. \"There are people out there - there are fabulous people out there, and you will find your person one day.\""
    },
    {
        "title": "TikTok returns to major US app stores after Trump reassures tech giants",
        "description": "TikTok is back on Apple and Google's US app stories after President Trump said the tech giants would not be fined if they reactivated it.",
        "url": "https://news.sky.com/story/tiktok-returns-to-major-us-app-stores-after-trump-reassures-tech-giants-13308989",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tiktok-video-app_6828276.jpg?20250214042558",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-14 04:15:00",
        "Headline": "As it considers its future in North America, TikTok still needs to convince US officials it does not threaten national security.",
        "Content": "TikTok is back on Apple and Google's US app stories after President Trump said the tech giants would not be fined if they reactivated it. They removed the hugely popular video-sharing app after a law came into effect on 19 January - the day before Mr Trump was inaugurated - requiring its Chinese owner ByteDance to sell up or face a ban. There were concerns that Beijing could use TikTok to spy on American users and the app, used by almost half of all Americans, briefly went dark. But the service was restored after Mr Trump said he would sign an executive order delaying the ban's enforcement, which he duly did, with a 75-day deadline. Both Apple and Google kept it off their app stores, however.  Now, the president has provided reassurances that neither firm will face penalties if they offer TikTok for download. He has also said his two-and-a-half month deadline could be extended, but doubts that will be necessary. As it considers its future in North America, TikTok still needs to convince US officials it does not threaten national security. One way to do that would be to find a US owner for its American operation. There is speculation it could be valued at around $100bn (£80bn) if it is sold with its algorithm. \"We will work with President Trump on a long-term solution that keeps TikTok in the United States,\" it previously said in a statement. Read more:What we know about the asteroid that could hit EarthThe Bank of England gold rush In the UK, TikTok remains banned on all UK government phones - despite ministers launching an official account. The 'UK Gov' account was created last week and has so far posted a series of public service messages on topics including digital driving licences and Labour's plan to boost neighbourhood policing. There were more than 52 million downloads of TikTok in 2024, according to market intelligence firm Sensor Tower, in a 52/48 split between Apple and Google respectively."
    },
    {
        "title": "Sources close to Stormzy say 'Free Palestine' Instagram post was not deleted because of rapper's work with McDonald's",
        "description": "Stormzy did not delete an Instagram post in support of Palestinian liberation because of his recent collaboration with McDonald's, sources close to the rapper have told Sky News.",
        "url": "https://news.sky.com/story/sources-close-to-stormzy-say-free-palestine-instagram-post-was-not-deleted-because-of-rappers-work-with-mcdonalds-13309260",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-stormzy-reading-festival_6828763.jpg?20250214161436",
        "type": "Entertainment",
        "Author": "Sabah Choudhry",
        "Date Published": "2025-02-14 14:17:00",
        "Headline": "The grime artist faced a backlash from fans for removing a pro-Palestine post from his Instagram profile, with some linking it to a recent brand deal with McDonald's.",
        "Content": "\n          News correspondent\n       Stormzy did not delete an Instagram post in support of Palestinian liberation because of his recent collaboration with McDonald's, sources close to the rapper have told Sky News. The 31-year-old grime artist has faced a backlash for removing an old post that said \"Free Palestine\" after working on a campaign with the fast-food chain. But sources close to the Vossi Bop rapper exclusively told Sky News that it \"is simply not true\" that the \"archiving\" of his Instagram post and the release of the McDonald's campaign are linked. Stormzy's recent McDonald's partnership packages his \"go-to\" order as a limited meal option, which the chain has dubbed \"The Stormzy Meal\" - containing chicken nuggets, fries, BBQ sauce, a Sprite drink, and an Oreo McFlurry. Critics of Israel called for a global boycott of McDonald's last year, when McDonald's Israel announced it donated thousands of free meals to Israel Defence Forces troops fighting in Gaza. The campaign, led by the Boycott, Divestment and Sanctions (BDS) movement, dented sales at McDonald's. The deletion of Stormzy's \"Free Palestine\" post was part of a \"mass archiving effort\" last year, the sources close to him add. They said it was \"categorically not\" linked to his involvement with McDonald's. Sky News has contacted McDonald's for comment. The now-removed Instagram post read: \"I hope everyone is good, some fleeting thoughts. \"1. Free Palestine \"2. In the future, if there is ever a clear injustice in the world, no matter how big or small, 100 times out of 100 I will be on the side of the oppressed. Unequivocally. As I always have been. Social media is a brilliant way to stand up for what is right, there are also a whole load of other ways to do this.\" After the post was deleted, many of Stormzy's fans shared that they were \"disappointed\" by the rapper's \"hypocrisy\". One person on X criticised Stormzy's McDonald's campaign, writing it was done \"for a bit of money that you don't even need\". They added: \"You deleted this post to do a McDonald's commercial.\" The Palestinian Campaign for the Academic and Cultural Boycott of Israel (PACBI), a founding member of the BDS movement, said: \"Stormzy's call for Palestinian freedom in the early stages of Israel's genocide against 2.3 million Palestinians in Gaza, when few artists were speaking out, displayed a clear stance in support of all oppressed people.\" But it added: \"Partnering with corporations that are implicated in genocide, apartheid and military occupation can only whitewash those crimes.\" In an open letter to Stormzy, the Peace and Justice Project - founded by former Labour leader Jeremy Corbyn in 2021 - also said his work with McDonald's is \"hugely disappointing, especially given the musician's otherwise proud and solid record in supporting great causes and campaigns for social justice\". The group added: \"We are therefore asking Stormzy to stand in solidarity with the Palestinian people in their hour of need and respect the BDS committee's call for a global boycott of McDonald's by ending his new partnership with them.\" Much of Gaza lies in ruins after Israel's war to destroy Hamas. More than 48,000 Palestinians have been killed, according to the Hamas-run Gaza health ministry, which does not differentiate between civilians and combatants in its count. At least 1,200 people were killed and more than 250 taken hostage when Hamas launched its massacre in Israel on 7 October 2023. Read more from Sky News:Grimes criticises MuskOne of UK's most wanted men jailed'City killer' asteroid could hit Earth Stormzy has previously supported several social justice issues - including launching a scholarship to help Black students access top universities and dedicating his Brit Award performance in 2018 to the 72 victims of the Grenfell Tower tragedy. His Instagram biography tags pro-Palestine rapper Lowkey - inviting fans to click on his account and learn about activists' calls for Palestinian liberation."
    },
    {
        "title": "Anora to Wicked: Award-tipped films you need to know about and where to watch them",
        "description": "Awards season is underway - and in a year with few clear-cut front runners, and lots of the movies out late in the day in the UK, the race is looking pretty unpredictable.",
        "url": "https://news.sky.com/story/anora-to-wicked-award-tipped-films-you-need-to-know-about-and-where-to-watch-them-13306786",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-films-awards-movies_6824928.png?20250210162428",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-02-14 00:01:00",
        "Headline": "Can Emilia Perez still win anything? Will The Brutalist's Adrien Brody nab his second Oscar? And following its BAFTA promise, will Ralph Fiennes rule and Conclave clean-up? The award-season movies you need to know about. ",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Awards season is underway - and in a year with few clear-cut front runners, and lots of the movies out late in the day in the UK, the race is looking pretty unpredictable. Here's a whistle-stop tour of some of the movies you'll be hearing lots more about and where to watch them. It's 22 years since a musical took best picture at the Oscars but now, like buses, two come along at once. First there's Emilia Perez - a mostly Spanish musical from a French director about a Mexican drug lord who changes gender, played by trans actress Karla Sofia Gascon. The most nominated foreign-language film in Oscar history with a whopping 13 nods - just one short of the all-time record - Gascon's personal bid for Oscar glory has nose-dived after problematic tweets she sent resurfaced. The movie also stars Zoe Saldana, who as a darling of blockbusters including Guardians Of The Galaxy, Avengers: Infinity War and the Avatar franchise, is taking a punt on a more unusual film this time around. She told Sky News: \"We understood the assignment. We felt like, OK, it's the niche of the niche of the niche film.\" \n                  Demi Moore continues winning streak at Critics Choice Awards - as Zoe Saldana and Adrien Brody also take home top prizes\n                 \n                  Emilia Perez breaks records as it leads Oscar nominations\n                 \n                  The Brutalist director insists lead actors' performances 'their own' after use of AI for Hungarian accents\n                 Selena Gomez, who also stars, told Sky News that acting in Spanish was a joyful challenge: \"Doing this movie has given me a little bit of a pat on the back and I felt encouraged,\" she said.  While the movie won four Golden Globes earlier this year, including best motion picture in the musical and comedy category, it's proved divisive for some Mexican viewers who say it reduces them to crude stereotypes. Large parts of the trans community have also said its treatment of transitioning feels regressive. Plus, its reported use of AI to tweak some of Gascon's high notes has not gone without comment. Emilia Perez is available to view on Netflix. Then there's Wicked - the Wizard Of Oz prequel starring Ariana Grande and Cynthia Erivo, whose press interviews were frequently emotional. It's been a box office hit, becoming the highest-grossing musical adaptation. But will it have the same magic touch at forthcoming awards? It took one Golden Globe, in the shiny new category of cinematic and box office achievement, joining last year's inaugural winner Barbie. Wicked is available to rent or own on demand, including on Sky Store. Chunky male-led dramas are awards season staples - and this year is no exception. The Brutalist stars Adrien Brody as Hungarian architect Laszlo Toth, attempting to rebuild his life in the US after the Second World War. You need staying power to sit through this one - it's over three and a half hours long and even has its own interval. Guy Pearce and Felicity Jones co-star, with Pearce crediting Brody's achievement in the role, noting he is \"almost intimidating he's so good\". Brody already has one best actor Oscar win under his belt - this might secure him a second. The movie took best motion picture in the drama category at the Globes, as well as wins for Brody and its director Brady Corbet. Meanwhile, a few eyebrows have been raised over the use of AI to \"refine\" the lead actors' Hungarian accents. The Brutalist is in cinemas now. Conclave is all about choosing a new Pope - a papal X Factor if you will. In the film, more than 100 high-ranking clergymen, each with their own chequered past, elect the next Catholic figurehead while sealed off from the public in the secretive voting process. The most nominated film at this year's BAFTAs, with plenty of star power and Ralph Fiennes at the helm, it's a study of the Catholic Church - warts and all.  But as Fiennes told Sky News: \"It's not a facile takedown of the Catholic Church. I think it approaches it with curiosity… \"There's obviously corruption. There are all kinds of transgressions we know about that have taken place, but it exists because the Catholic Church also offers, I think, a sort of support to communities. It's a foundational place to go where the community has a structure, so I think it's a big thing to sort of open up and discuss.\" Conclave, which also stars Stanley Tucci and Isabella Rossellini, is available to rent or own on demand, including on Sky Store. Nickel Boys, about abuse at a US reform school in the 1960s, is the film with perhaps the most unique visual style, shot almost entirely from the two lead characters' point of view. It's a disorientating drama that will stay with you long after the credits roll. The film's director, RaMell Ross, told Sky News it was a \"multiple fold\" movie, exploring the conventional representation of black people as victims in cinema as well as an expression of trauma.  Ethan Herisse who plays Elwood, one of the film's two leads, told Sky News: \"While we were making it, it felt like we were doing something special and there was so much love from all the people that were working on that set. So, I was just hoping that it was able to come across when it was all said and done.\" Nickel Boys is in cinemas now. We'll call this the Timothée Chalamet section - flying the flag for two very different films. Firstly, saving the universe in sci-fi sequel Dune: Part Two. Directed by Denis Villeneuve, Chalamet steps back into the role of Paul Atreides, who, following the first movie, is now seeking revenge against those who decimated his family. The third film is due out next year. Villeneuve previously told Sky News he couldn't have made the franchise without Chalamet's talent. Dune Two, which also stars Zendaya and Florence Pugh, is available to rent or own on demand, including on Sky Store. Chalamet's second punt in the awards offerings sees him pick up the guitar and give it some mumbling Bob Dylan energy in A Complete Unknown, playing the Nobel prize-winning folk hero regarded by many as a lyrical genius. Chalamet spent five years working on his singing, harmonica and guitar skills. Will the awards reward him for his efforts? Or will he be on his bike? A Complete Unknown is in cinemas now. And then there's the female-led movies - from gritty, to horror, to devastating real life. Anora stars newcomer Mikey Madison as a sex worker from Brooklyn who marries into money. Think Pretty Woman but without the sugar coating.  Madison told Sky News she was \"grateful\" to have had the experience, adding that the \"sex work community is amazing and I've made so many incredible friends\". Anora is available to rent or own on demand, including on Sky Store. I'm Still Here sees a mother of five fighting Brazil's authoritarian military regime in the 1970s after her husband is forcibly \"disappeared\", leaving her to search for the truth and rebuild her life. Based on a true story, this Portuguese-language film is creating an unexpected buzz, with three Oscar nods and one Golden Globe win for its star, Fernanda Torres. The Brazilian drama's chances in the international category at the Oscars is better than fair. I'm Still Here is due to go on limited release in cinemas on Friday 21 February. Lastly, body horror movie The Substance has given its star Demi Moore a career reboot like no other. The timely narrative about an older actress refusing to fade into obscurity, with horrifying consequences, is one voters are likely to lap up. It saw Moore take best actress in a musical or comedy at the Golden Globes, and her acceptance speech in which she spoke about being written off as a \"popcorn actress\" early on in her career laid the ground for further wins including a Critics' Choice gong. Will Moore win best actress at the BAFTAs and Oscars? If the buzz is to be believed, she may well nab them. The Substance, which also stars Margaret Qualley, is available to rent or own on demand, including on Sky Store. The competition's wide open - may the best movies win! The BAFTA ceremony will be held at the Southbank Centre's Royal Festival Hall in London on Sunday, 16 February. The Academy Awards ceremony will be held at the Dolby Theatre in Hollywood on Sunday, 2 March."
    },
    {
        "title": "Dame Edna's glasses sell for 25 times their expected value as auction smashes estimates",
        "description": "A pair of Dame Edna Everage's glasses have sold at auction for &#163;37,800, 25 times their estimated value.",
        "url": "https://news.sky.com/story/dame-ednas-glasses-sell-for-25-times-their-expected-value-as-auction-smashes-estimates-13309076",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dame-edna-humphries_6828501.jpg?20250214112428",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-14 09:06:00",
        "Headline": "A pair of yellow-lacquered possum spectacles was one of a number of items sold during the auction which lasted nine hours and totalled over £4.6m.",
        "Content": "A pair of Dame Edna Everage's glasses have sold at auction for £37,800, 25 times their estimated value. The glasses were expected to sell for between £1,000-£1,500, according to Christie's auction house, who facilitated the sale. They were being sold as part of the personal collection of Barry Humphries. Dame Edna was one of Humphries' best-known characters and became a hit in the UK in the 1970s. The Australian star, who was known for his satirical characters including Dame Edna and the offensive Sir Les Patterson, died in April 2023 at the age of 89, following complications suffered during hip surgery. The yellow-lacquered possum spectacles were one of a number of items sold during the auction, which was opened to bidders with Dame Edna's much-loved phrase \"Hello Possums\". Christie's described the sale as evidence of \"Edna's enduring appeal\". A first edition of Oscar Wilde's The Importance Of Being Earnest, signed by Wilde to his publisher, sold for £138,600, and a Charles Conder painting sold for almost £240,000. Meanwhile, two dresses worn by Dame Edna sold for £21,420 each, eight times their pre-sale high estimates. Read more from Sky News:What if 'city killer' asteroid hits Earth?One Briton dead and three injured in New Zealand crashWhere did it all go wrong for Emilia Perez? A number of other pieces of art, books and highlights of Humphries' collection were also sold during the auction which saw bidders from 41 countries and lasted nine hours. The total sale value reached £4,627,224, exceeding the pre-sale estimate. \"These fantastic results are a testament to Barry's unique vision and lifelong passion for collecting,\" Benedict Winter, head of sale, private & iconic collections at Christie's London said."
    },
    {
        "title": "Ancient Egyptian mummies smell 'sweet' and 'spicy', researchers say",
        "description": "Ancient Egyptian mummies smell \"woody,\" \"spicy\" and \"sweet\", according to researchers who took part in a unique new study.",
        "url": "https://news.sky.com/story/ancient-egyptian-mummies-smell-sweet-and-spicy-researchers-say-13309255",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mummies-mummy-ancient-egypt_6828667.jpg?20250214142224",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-14 15:09:00",
        "Headline": "Researchers used what they described as \"trained, human sniffers\" to study the scent of nine mummified bodies.",
        "Content": "Ancient Egyptian mummies smell \"woody,\" \"spicy\" and \"sweet\", according to researchers who took part in a unique new study. Researchers used what they described as \"trained, human sniffers\" and equipment like an electronic, artificial nose of sorts to study the scent of nine mummified bodies. They said smell was a key consideration for ancient Egyptians when it came to the mummification process, meaning that even 5,000 years later, conservators widely consider the aroma \"pleasant\" due to the use of resins and oils such as pine, cedar, and juniper. The findings, researchers said, which were published in the Journal of the American Chemical Society, show that smell can be used as a way of analysing the preserved bodies in a non-invasive way, but they also want to find a way to recreate the smells in museums to give visitors the full mummy experience. The research was carried out by teams at the University College London (UCL) and the University of Ljubljana in Slovenia in collaboration with conservators and curators at the Egyptian Museum in Cairo. Lead author professor Matija Strlic said: \"The smell of mummified bodies has for years attracted significant interest from experts and the general public, but no combined chemical and perceptual scientific study has been conducted until now. \"This ground-breaking research really helps us better plan conservation and understand the ancient embalming materials. It adds another layer of data to enrich the museum exhibition of mummified bodies.\" \n                  Donald Trump repeats pledge to take over Gaza - as Hamas says Palestinians will foil all displacement plans\n                 \n                  Divers tell of 'corner-cutting' and life jacket shortage on tourist boat owned by same firm as sunken Red Sea vessel\n                 \n                  Egypt: Two Britons believed to be among 16 missing as tourist boat sinks after being 'hit by large wave'\n                 Read more:Kayaker swallowed by humpback whaleCare home resident, 104, enters New York prison Professor Ali Abdelhalim, co-author and director of the Egyptian Museum in Cairo, said: \"To the ancient Egyptians, mummification was an important mortuary practice aimed at preserving the body and soul for the afterlife through a detailed ritual of embalming of the deceased using oils, waxes and balms. \"The practice evolved over time, and identifying different techniques and materials used offers insights into the era, location and socioeconomic status of the individual being mummified.\" The researchers used various techniques and scientific equipment to identify the chemicals emitted by the mummified bodies, then the panel of human \"sniffers\" described the smells in terms of quality, intensity, and pleasantness. They said they would now attempt to create \"smellscapes\" in museums with ancient mummy exhibits to \"enable audiences to experience this important aspect of ancient Egyptian heritage\"."
    }
]