[
    {
        "title": "Police investigating Madeleine McCann case to conduct new searches in Portugal",
        "description": "Police investigating the disappearance of Madeleine McCann will carry out fresh searches in Portugal.",
        "url": "https://news.sky.com/story/german-police-investigating-madeleine-mccanns-disappearance-carrying-out-new-searches-in-portugal-uk-police-say-13378252",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-madeleine-mccann-missing_6511268.jpg?20240405141820",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-02 14:39:00",
        "Headline": "Madeleine McCann was asleep with her younger twin siblings in the family's Portuguese rented holiday apartment before their mother Kate discovered her missing at around 10pm on 3 May 2007.",
        "Content": " Police investigating the disappearance of Madeleine McCann will carry out fresh searches in Portugal. The Metropolitan Police said it was \"aware\" of the searches set to be conducted by German federal police in Portugal - where Madeleine disappeared while on holiday with her family in the resort of Praia da Luz 18 years ago. A spokesperson for the force said: \"We are aware of the searches being carried out by the BKA (German federal police) in Portugal as part of their investigation into the disappearance of Madeleine McCann. \"The Metropolitan Police Service is not present at the search, we will support our international colleagues where necessary.\" German prosecutor Hans Christian Wolters also said in a statement that as part of the investigation, \"criminal proceedings are currently taking place in Portugal\". Later, Portuguese police said it was carrying out a European Investigation Order issued by German authorities, with the search being conducted between Monday and Friday. It comes as Portuguese police sources told Sky's partner in the country, SIC Noticias, that the search was expected to start on Tuesday morning. The three-year-old British girl was asleep with her younger twin siblings in the family's Portuguese rented holiday apartment before their mother Kate discovered her missing at around 10pm on 3 May 2007. Kate and Gerry McCann were dining nearby on the complex with friends and taking turns to check on all their sleeping children every half an hour. Officers are set to scour more than 20 rustic plots of land in the easternmost part of Praia da Luz - near the house where suspect Christian B lived at the time and close to where Madeleine disappeared. SIC Noticias also reports that German and Portuguese authorities are looking for either Madeleine's body or for an indication that she may have been there at the time. Her disappearance is one of the most high-profile cases of a missing person in British history. Christian B, who cannot be fully identified under Germany's privacy law, is currently in jail and coming to the end of his sentence for the rape of an elderly American woman in the resort. He has not been charged or indicted in relation to the disappearance of Madeleine, and he denies any involvement. A German prosecutor told Sky News in January that he will not face any charges in the foreseeable future. In October, Christian B was acquitted on a series of rape and indecent assault charges after a non-jury trial in Germany, in which several references were made to his status as the main suspect in the Madeleine case. German authorities last carried out searches in 2023 near the Barragem do Arade reservoir, about 30 miles from Praia da Luz. It had previously been searched in 2008 after Portuguese lawyer Marcos Aragao Correia paid for specialist divers to search it over claims her body was there. Read more from Sky News:Mount Etna erupts, sending tourists fleeingPersonal trainer jailed over 'first date' chaseRussia and Ukraine agree prisoner swap Last month, Madeleine's parents marked the 18th anniversary of her disappearance, vowing they would keep searching. \"No matter how near or far she is, she continues to be right here with us, every day, but especially on her special day,\" they said ahead of her 22nd birthday. \"We continue to 'celebrate' her as the very beautiful and unique person she is. We miss her.\""
    },
    {
        "title": "AI, robots, lasers and gap years in armed forces: Key details as UK to become 'battle ready'",
        "description": "The UK must rebuild its military and get the whole country ready for war as the threat of conflict with a nuclear power like Russia or China is real, a major defence review warns.",
        "url": "https://news.sky.com/story/ai-robots-lasers-and-gap-years-in-armed-forces-key-details-as-uk-to-become-battle-ready-13378251",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-british-army_6834246.jpg?20250220015606",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-02 14:27:00",
        "Headline": "Sir Keir Starmer warns of a \"new era of threats\" that demands a \"new era for defence and security\", as the Strategic Defence Review is published.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK must rebuild its military and get the whole country ready for war as the threat of conflict with a nuclear power like Russia or China is real, a major defence review warns. It described what might happen should a hostile state start a fight, saying this could include missile strikes against military sites and power stations across the UK, sabotage of railway lines and other critical infrastructure and attacks on the armed forces. Politics latest:  Britain must be 'battle-ready', says PM  In a devastating verdict on the state of Britain's defences, the Strategic Defence Review (SDR) said today's armed forces are \"not currently optimised for warfare\", with inadequate stockpiles of weapons, poor recruitment and crumbling morale. \"The international chessboard has been tipped over,\" a team of three experts that led the review wrote in a foreword to their 140-page document. \"In a world where the impossible today is becoming the inevitable tomorrow, there can be no complacency about defending our country.\" Sir Keir Starmer, who commissioned the review, described a \"new era\" of threat that required a \"new era for defence and security\". \"Every part of society, every citizen of this country, has a role to play because we have to recognise that things have changed,\" the prime minister said. The review made a list of more than 60 recommendations to enable the UK to \"pivot to a new way of war\". They include: General Sir Richard Barrons, part of the review team and a former senior military officer, described the vision as \"the most profound change\" to UK defences in 150 years.  But there were some notable gaps - likely caused by limited finances. This includes only a brief mention of bolstering the UK's ability to defend against cruise and ballistic missiles - a key weakness but one that would be very expensive to fix. Earlier, Sir Keir said the review was a \"blueprint to make Britain safer and stronger, a battle-ready armour-clad nation, with the strongest alliances and the most advanced capabilities, equipped for the decades to come\". Defence Secretary John Healey, writing in a foreword to the document, said \"up to\" £1bn would be invested in \"homeland air and missile defence\" as well as the creation of a new cyber and electromagnetic warfare command. The review was drawn up with the expectation that defence spending would rise to 2.5% of GDP this parliament - up from around 2.3% now - and then to 3% by 2034. The government has pledged to hit 2.5% by 2027 but is yet to make 3% a cast iron commitment. Read more:UK to build weapons factoriesRussian-linked hackers targeted MoD The reviewers said their recommendations could be delivered in 10 years if that spending target is reached but they gave a strong signal that they would like this to happen much sooner. \"As we live in such turbulent times it may be necessary to go faster,\" the team said. \"The plan we have put forward can be accelerated for either greater assurance or for mobilisation of defence in a crisis.\" The review described the threat posed by Russia as \"immediate and pressing\". It said China, by contrast, is a \"sophisticated and persistent challenge\". It pointed to Beijing's growing missile capability that can reach the UK and said the Chinese military's nuclear arsenal is expected to double to 1,000 nuclear warheads by 2030. The other two reviewers were Lord George Robertson, a former Labour defence secretary, and Fiona Hill, a Russia expert and former foreign policy adviser to Donald Trump. 👉Search for The Wargame on your podcast app👈 The review team warned the post Cold War-era of relative peace has ended and a time of contest, tension and conflict has returned. Adding to the pressure, the US - by far the most powerful member of the NATO alliance - is focusing more on the threat it sees from China. \"Changes in the strategic context mean that NATO allies may be drawn into war with - or be subject to coercion by - another nuclear armed state,\" the review said. \"With the US clear that the security of Europe is no longer its primary international focus, the UK and European allies must step up their efforts\". The review set out how defence is not only the responsibility of the armed forces because countries - not just the professional military - fight wars. It said: \"Everyone has a role to play and a national conversation on how we do it is required… As the old saying goes, 'If you want peace, prepare for war'.\" Sky News and Tortoise will launch a new podcast series - The Wargame - on 10 June that simulates a Russian attack on the UK to test Britain's defences, with former ministers and military chiefs playing the part of the British government."
    },
    {
        "title": "Colorado petrol bomb suspect charged with 16 counts of attempted murder ",
        "description": "The suspect in the Colorado petrol bomb attack has been charged with 16 counts of attempted murder.",
        "url": "https://news.sky.com/story/colorado-petrol-bomb-suspect-charged-with-16-counts-of-attempted-murder-and-federal-hate-crime-13378400",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-colorado-mohamed-soliman_6933246.png?20250602161009",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-02 21:42:00",
        "Headline": "Mohamed Soliman is in custody and has been charged with several counts of attempted murder, first-degree assault, and attempted use of an incendiary device.",
        "Content": " The suspect in the Colorado petrol bomb attack has been charged with 16 counts of attempted murder. Mohamed Soliman is accused of throwing Molotov cocktails and using a makeshift flamethrower on a group of people at a rally in support of Israeli hostages - with the FBI describing the incident as a targeted \"act of terrorism\". The 45-year-old, from El Paso County, Colorado, shouted \"Free Palestine\" during the attack, it is alleged. A total of 12 victims were injured and taken to hospitals, authorities said. One of those was at one point said to be in a critical condition. A federal criminal complaint (court filing) said Soliman confessed to the attack, told investigators that he had planned it for a year, said he \"wanted to kill all Zionist people and wished they were all dead\", and that \"he would do it again\".  At a press conference on Monday evening, 20th judicial district attorney Michael Dougherty said \"Boulder is a beautiful and special place, but we're not immune from mass violence or hate crimes\" as he explained the charges against Soliman. He said that the suspect faces 16 counts of attempted murder in the first-degree, with eight of those for attempted murder with intent and after deliberation, meaning he had time to consider his crimes. \n                  Colorado latest: Suspected petrol bomb attacker 'had no regrets', say officials\n                 \n                  Eight injured in petrol bomb and 'flamethrower' attack at rally for Hamas-held hostages in Colorado\n                 \n                  More than 100 immigrants detained at illegal after-hours nightclub in Colorado\n                 The other eight counts relate to attempted murder with extreme indifference, meaning he acted without regard to others' lives. Read more:Mount Etna erupts, sending tourists fleeingUK has warmest spring on recordRussians react to Ukraine's drone attack Soliman is also charged with eight counts of first-degree assault, two counts of use of an incendiary device, and 16 counts of attempted use of an incendiary device. If convicted on all charges pursued by the state prosecutor, and if they run consecutively, Soliman faces a maximum sentence of 624 years in prison. Mr Dougherty added that the US attorney's office \"will be prosecuting the hate crime against the defendant,\" which relates to the federal crime of causing bodily injury because of actual or perceived race, colour, religion, or national origin. Suspect appears in court After the press conference, Soliman made his first appearance in court, appearing via web link from Boulder County Jail. During the brief hearing, Judge Nancy Salomone asked the suspect if received the protection order issued by the court preventing him from contacting the victims, to which he said \"yes\". She then said she will see legal representatives on Thursday for the filing of the charges."
    },
    {
        "title": "Russians react to Ukraine's unprecedented drone attack - as Kremlin's silence speaks volumes",
        "description": "Ukraine's drone attack on Russia's long-range bombers was unprecedented, not that you'd know it from reading the Russian papers. Nor from watching the news bulletins here.",
        "url": "https://news.sky.com/story/russians-react-to-ukraines-unprecedented-drone-attack-as-kremlins-silence-speaks-volumes-13378372",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukraine-russia_6932581.jpg?20250601151715",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-02 19:33:00",
        "Headline": "Moscow wants to play down the assault, which was a hugely embarrassing breach of Russia's defences.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Ukraine's drone attack on Russia's long-range bombers was unprecedented, not that you'd know it from reading the Russian papers. Nor from watching the news bulletins here. Monday's front pages were dominated by photos of the wreckage of a road bridge collapsing on to a passenger train in the Bryansk region, after it was blown up late on Saturday night.  Meanwhile, the flagship talk show on state TV here on Monday morning didn't even mention the attack. Instead, there was just a breathless build-up to the latest round of peace talks in Istanbul. The lack of visual coverage of the drone attack is partly because of the sensitivities around publishing images of Russian military infrastructure. But I think it's also because the Kremlin wants to play down the assault, which was a hugely embarrassing breach of Russia's defences. So where the attack is mentioned in the papers, it's done in a way to reinforce Moscow's narrative - that Ukraine is the aggressor out to derail the peace process.  The Izvestia newspaper, for example, describes it as a terrorist attack, and says it \"calls into question Kyiv's readiness for de-escalation\". There's no reference to the scale of the damage, and there's certainly no sense of alarm. It's a similar vibe on the streets of Moscow, where we meet Irina. She believes the reports of the attack are \"exaggerated\". \"These planes are very old and hardly anyone needs them,\" she says. Another passer-by, called Vladimir, says he trusts his namesake Mr Putin to respond when the time is right. \"This must be done systematically, confidently, and without any kind of nervous breakdowns, or any shows of soul,\" he says. There is plenty of soul on show on social media, though, where Russia's influential military bloggers are calling for a rapid retaliation. One popular channel, called Dva Mayora or \"Two Majors\", even said it was \"a reason to launch nuclear strikes on Ukraine\". Others are directing their anger at Russia's military command, accusing the leadership of complacency for storing the planes out in the open. Read more:Putin humiliated by 'Russia's Pearl Harbor' - analysisZelenskyy: Strikes will go 'in history books' It all served to overshadow the latest round of peace talks in Istanbul, where the only concrete outcome was another prisoner exchange and the return of 6,000 dead soldiers from each side. And if anything, the outlook for peace now is even more bleak than it was before the talks began. That's because Russia has now presented its blueprint for a settlement, and it seemingly offers no sign of compromise at all. According to Russian media reports, the document is a list of Moscow's maximalist demands, including neutrality for Ukraine, limits to its army, surrender of territory and the lifting of sanctions. Only then, Russia says, would it agree to end the war. The Kremlin itself still hasn't commented on the drone attack - a silence that speaks volumes. Can you imagine Downing Street doing the same if something similar happened in the UK? There will undoubtedly be repercussions at some point, both externally and internally. So, despite the talk being of peace at the talks in Turkey, the mood is still very much one of war."
    },
    {
        "title": "Rachel Reeves threatens to sue Roman Abramovich over Chelsea FC sale proceeds",
        "description": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale.",
        "url": "https://news.sky.com/story/rachel-reeves-threatens-to-sue-roman-abramovich-over-chelsea-fc-sale-proceeds-13378386",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-roman-abramovich-chelsea_5249883.jpg?20210125130045",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-02 20:39:00",
        "Headline": "The £2.5bn proceeds from the sanctioned Russian oligarch's sale of Chelsea FC are meant to help Ukraine but remain in a UK bank account.",
        "Content": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale. The Russian oligarch, who is sanctioned by the UK government over his alleged links to Vladimir Putin, sold Chelsea for £2.5bn to an American consortium in 2022, after Russia's invasion of Ukraine. Those funds remain in a frozen UK bank account but are meant to be used for humanitarian causes linked to the Ukraine war. Chancellor Rachel Reeves and Foreign Secretary David Lammy have now said they are \"deeply frustrated\" an agreement cannot be reached with the oligarch and will take him to court if it cannot be dealt with soon. In a joint statement, they said: \"The government is determined to see the proceeds from the sale of Chelsea Football Club reach humanitarian causes in Ukraine, following Russia's illegal full-scale invasion. \"We are deeply frustrated that it has not been possible to reach agreement on this with Mr Abramovich so far. \"While the door for negotiations will remain open, we are fully prepared to pursue this through the courts if required, to ensure people suffering in Ukraine can benefit from these proceeds as soon as possible.\" Read more:Russians react to Ukraine's drone attackPutin humiliated by 'Russia's Pearl Harbor' - analysisZelenskyy: Strikes will go 'in history books' Abramovich was forced to sell Chelsea - which he bought for a reported £140m - after 19 years of ownership, after being sanctioned by the government over his alleged close ties to the Russian president - something he denies. The sale was made under the supervision of the Office of Financial Sanctions Implementation, under the proviso the proceeds go to humanitarian aid in Ukraine. They cannot be moved or used without a licence from the office.  In March, the Foreign Office said officials were in talks with Abramovich's representatives, but multiple sources told the BBC there had been no meetings between any Labour ministers and members of the foundation set up to oversee the funds since last July's general election. They said there was a deadlock and a political decision by a minister is needed to negotiate and sign off an agreement. It is not known if there has been meetings in the three months since then. The £2.5bn - and interest accrued - would make up for some of the reduction in the aid budget, announced in February."
    },
    {
        "title": "Human remains found in search for Izabela Zablocka who disappeared 15 years ago",
        "description": "Human remains have been found as part of an investigation into the disappearance of a Polish woman 15 years ago.",
        "url": "https://news.sky.com/story/human-remains-found-in-search-for-izabela-zablocka-who-disappeared-15-years-ago-13378413",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-izabela-helena-zablocka_6933491.jpg?20250602235547",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-02 23:11:00",
        "Headline": "Crimestoppers is offering a £20,000 reward until 27 August if it receives exclusive information that leads to a conviction. ",
        "Content": "Human remains have been found as part of an investigation into the disappearance of a Polish woman 15 years ago. Izabela Zablocka was living in the Normanton area of Derby but lost contact with her family in August 2010, when she was 30, and has never been found. However, new information came to light last week and a murder investigation was launched. Derbyshire Police said remains believed to belong to Ms Zablocka had now been discovered in the garden of a property on Princes Street in Normanton. A 39-year-old woman who was arrested on suspicion of murder was re-arrested on Monday. Two other women, aged 39 and 43, and a 41-year-old man arrested last week remain on bail. Detective Inspector Kane Martin said formal identification hadn't yet taken place but it's believed the remains belong to Ms Zablocka. \"As such, we have spoken with Izabela's family in Poland, and they are aware. Our thoughts are with them at this extremely difficult time,\" he said. \"Identification of the remains is likely to be a lengthy process, but we will issue updates when we are able.\" Police will remain at the address for now as they try to gather more evidence on Ms Zablocka's death. A £20,000 reward is being offered until 27 August for information that leads to a conviction. Anyone who wants to get in touch is urged to contact the Crimestoppers charity. Read more from Sky News:New search to begin in Madeleine McCann caseChancellor threatens to sue Roman Abramovich DI Martin added: \"We know that someone out there will have information about Izabela that may help us understand what happened to her, and urge anyone who saw, spoke to, or heard anything about Izabela in July or August 2010 to come forward. \"You may hold the key piece of information that we need to understand the full circumstances of Izabela's disappearance, and to give her family answers on what happened to their loved one.\""
    },
    {
        "title": "'I might not make it': Sarah Jessica Parker on the stress of reading two books a day",
        "description": "Sarah Jessica Parker was the subject of some unwanted headlines over the past few weeks after saying she reads two books a day.",
        "url": "https://news.sky.com/story/i-might-not-make-it-sarah-jessica-parker-on-the-stress-of-reading-two-books-a-day-13378279",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sarah-jessica-parker_6933345.jpg?20250602181837",
        "type": "Home",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-06-02 15:47:00",
        "Headline": "Sarah Jessica Parker, Cynthia Nixon, Kristin Davis, Nicole Ari Parker and Sarita Choudhury return for the third season of And Just Like That, the spin-off to the hit franchise Sex And The City.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Sarah Jessica Parker was the subject of some unwanted headlines over the past few weeks after saying she reads two books a day. While speculation of her reading capabilities circulates, the actress continues the challenging mountain of novels she has to get through in order to be a judge for the Booker Prize. The actress is part of a panel of judges for the literary award which announces the \"Booker Dozen\" of 12 or 13 books on 29 July, its shortlist on 23 September and the overall winner on 10 November. The winner receives £50,000. \"I have one by my side now,\" Sarah Jessica tells Sky News during an interview for her show And Just Like That. \"It's been hard these last two weeks because we've been promoting the show and I thought I would be able to read between interviews, but you can read two words. You can read these three sentences, so I'm feeling very anxious about how many books I have yet to read for our next deliberation,\" she says. The Sex And The City actress compares the workload to preparing to take an exam. \"I've not ever felt this behind, including in high school. Like, I really am not entirely sure how I'm going to read the required amount of books by our next deliberation,\" she says. \n                  King Of The Hill and Parks And Recreation actor Jonathan Joss shot dead in Texas\n                 \n                  Race Across The World contestant Sam Gardiner dies aged 24 \n                 \n                  Mountainhead: Succession writer Jesse Armstrong's new film takes aim at tech billionaires\n                 \"I thought about this last night in bed, that even if I stay up every day and don't sleep, I might not make it. So I'm not sure how. I have to not make dinner for anybody, not do anybody's laundry. I have cut out all tasks. So we'll see. It's pretty fantastic, this burden is pretty wonderful.\" Turning to her spin-off series, she says she never paid much attention to the cultural impact Sex And The City had on portraying women in their 30s on screen without a rose-tinted lens. \"I think we're just always wanting to tell interesting stories,\" she says. \"And the rule in the writing room has been, for as long as I've known, the story can only be as far removed as one person from the writer, so every single story told has either happened to a writer or to a friend or family member or colleague of the writer.\" She says what makes it real is that the show deals with real moments that happen to women as they age, from children flying the nest to navigating the dating pool. \"You don't flat line at 50 or 60. People are living pretty colourful, interesting, exciting lives and they have influence and authority. They're trying new things. They're leaving marriages. They're saying goodbye to kids. They're starting new jobs, they're leaving jobs, and they're getting married, they are widows, there's just endless amounts to talk about and it should be,\" she says. 'It is insane there aren't more shows like us' Her co-star Kristin Davis agrees and states her main hope for returning was to break certain taboos for women now in their 50s. \"It is insane that there aren't more shows like us, you know? I'm hoping that there will be,\" she says. \"It's very interesting that somehow women, especially at a certain age, you're just supposed to just vanish. I don't know where we're supposed to be and that just makes no sense.\" Sex And The City was 'incredibly white', says Cynthia Nixon For Cynthia Nixon, playing Miranda now as a lesbian character allowed the show to explore the challenges that face people coming out later in life and navigating the world they find themselves in. She says although Sex And The City broke taboos for white women in their 30s, she felt the original iteration of their show wasn't as reflective of the real world as it could have been. \"The one thing that didn't really sit well with me in the past was how incredibly white the show was,\" she says. \"So, I think to expand the universe of, you know, who gets to be centred in the show has been a tremendous boon. Whether you're talking about people of colour, whether you're talk about queer people, people of different ages. We used to have a wonderfully fascinating lens, but it was fairly narrow. \"We've moved in our view of queer people… for so long, if you wanted to put a gay person on screen, one of the ways to make them palatable was to really emphasise their funniness and I think we have many very funny gay characters, but we're able to, I think, have a more well-rounded view of them.\" And Just Like That is available on Sky and NOW."
    },
    {
        "title": "Disabled woman took her own life after benefits wrongly stopped, coroner finds",
        "description": "A disabled mother took her own life after her benefits were incorrectly stopped, a coroner has concluded.",
        "url": "https://news.sky.com/story/disabled-woman-took-her-own-life-after-benefits-wrongly-stopped-coroner-finds-13378390",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jodey-whiting-suicide_6933448.png?20250602221255",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-02 21:04:00",
        "Headline": "Jodey Whiting's mother fought a long legal battle for a second inquest into her daughter's death.",
        "Content": "A disabled mother took her own life after her benefits were incorrectly stopped, a coroner has concluded. Jodey Whiting, 42, left notes to her family members, saying she had no food, could not afford her bills, and that she had \"had enough\", an inquest heard. The mother-of-nine had a hospital stay in December 2016, after contracting pneumonia, that meant she missed a letter about her benefits, saying she needed to be medically assessed. In January 2017, Ms Whiting was told she had missed the medical assessment and she was therefore judged to be fit to work. As well as losing her Employment and Support Allowance, she would also lose housing and council tax benefits. An initial inquest into her death in Stockton-on-Tees, County Durham, in 2017 did not consider the Department for Work and Pensions' (DWP) role in ending her benefits. Ms Whiting's mother Joy Dove fought a long legal battle for a second inquest, going all the way to the Court of Appeal. Ms Dove said when she saw her daughter two days before her death in February 2017, she was \"shaking and crying\" and threatened to kill herself. She told the hearing at Teesside Magistrates' Court the loss of benefits contributed to her daughter's death. \"I know my daughter and I know it was (that),\" she said. \"It was the fact she couldn't find a job, the worry of paying bills, and being pushed out after being so vulnerable all those years and years.\" Wrongly withdrawn benefits 'was trigger' Ms Dove told the inquest that her daughter - who had six grandchildren - had a brain cyst, chronic pains, a drug dependency, and poor mental health. She added that Ms Whiting became increasingly housebound in the last years of her life. Read more from Sky News:New police searches in Madeleine McCann caseToddler suffers serious burns in boat explosion On Monday, coroner Clare Bailey concluded that Ms Whiting's death was suicide \"in the context of a deteriorating mental state, precipitated by the withdrawal of state benefits\". The coroner added: \"Her actions were in the context of her benefits having been wrongly withdrawn by the DWP in circumstances where there had been five missed opportunities to avoid the significant errors. \"This had the effect of negatively impacting upon her mental health, and was the trigger to her taking a fatal overdose.\" 'It should not have taken an eight-year fight' After the hearing, Ms Dove said she \"always believed that Jodey took her life due to failings by the DWP\" and the coroner had \"confirmed that mistakes made by the DWP in the way they handled Jodey's case caused her death\". \"It should not have taken an eight-year fight for justice to get where we are today,\" she said. \"It has been an uphill battle trying to get answers and accountability, but I would never give up. \"I was determined to keep fighting for justice for Jodey.\" An Independent Case Examiner report into the judgment to remove Ms Whiting's benefits discovered several mistakes were made, that her payments should not have been cut, and recommended the government compensate her family with £10,000. Helga Swidenbank - a DWP director for disability services - said: \"I was not in post at the time, but those who I have spoken to are deeply regretful and sorry about what happened. \"There were a number of opportunities to have picked up concerns about Jodey, and we are very sorry about that.\" She added that the DWP has \"more work to do\" in regard to focusing more on people's vulnerabilities. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "AI, robots, lasers and gap years in armed forces: Key details as UK to become 'battle ready'",
        "description": "The UK must rebuild its military and get the whole country ready for war as the threat of conflict with a nuclear power like Russia or China is real, a major defence review warns.",
        "url": "https://news.sky.com/story/ai-robots-lasers-and-gap-years-in-armed-forces-key-details-as-uk-to-become-battle-ready-13378251",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-british-army_6834246.jpg?20250220015606",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-02 14:27:00",
        "Headline": "Sir Keir Starmer warns of a \"new era of threats\" that demands a \"new era for defence and security\", as the Strategic Defence Review is published.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK must rebuild its military and get the whole country ready for war as the threat of conflict with a nuclear power like Russia or China is real, a major defence review warns. It described what might happen should a hostile state start a fight, saying this could include missile strikes against military sites and power stations across the UK, sabotage of railway lines and other critical infrastructure and attacks on the armed forces. Politics latest:  Britain must be 'battle-ready', says PM  In a devastating verdict on the state of Britain's defences, the Strategic Defence Review (SDR) said today's armed forces are \"not currently optimised for warfare\", with inadequate stockpiles of weapons, poor recruitment and crumbling morale. \"The international chessboard has been tipped over,\" a team of three experts that led the review wrote in a foreword to their 140-page document. \"In a world where the impossible today is becoming the inevitable tomorrow, there can be no complacency about defending our country.\" Sir Keir Starmer, who commissioned the review, described a \"new era\" of threat that required a \"new era for defence and security\". \"Every part of society, every citizen of this country, has a role to play because we have to recognise that things have changed,\" the prime minister said. The review made a list of more than 60 recommendations to enable the UK to \"pivot to a new way of war\". They include: General Sir Richard Barrons, part of the review team and a former senior military officer, described the vision as \"the most profound change\" to UK defences in 150 years.  But there were some notable gaps - likely caused by limited finances. This includes only a brief mention of bolstering the UK's ability to defend against cruise and ballistic missiles - a key weakness but one that would be very expensive to fix. Earlier, Sir Keir said the review was a \"blueprint to make Britain safer and stronger, a battle-ready armour-clad nation, with the strongest alliances and the most advanced capabilities, equipped for the decades to come\". Defence Secretary John Healey, writing in a foreword to the document, said \"up to\" £1bn would be invested in \"homeland air and missile defence\" as well as the creation of a new cyber and electromagnetic warfare command. The review was drawn up with the expectation that defence spending would rise to 2.5% of GDP this parliament - up from around 2.3% now - and then to 3% by 2034. The government has pledged to hit 2.5% by 2027 but is yet to make 3% a cast iron commitment. Read more:UK to build weapons factoriesRussian-linked hackers targeted MoD The reviewers said their recommendations could be delivered in 10 years if that spending target is reached but they gave a strong signal that they would like this to happen much sooner. \"As we live in such turbulent times it may be necessary to go faster,\" the team said. \"The plan we have put forward can be accelerated for either greater assurance or for mobilisation of defence in a crisis.\" The review described the threat posed by Russia as \"immediate and pressing\". It said China, by contrast, is a \"sophisticated and persistent challenge\". It pointed to Beijing's growing missile capability that can reach the UK and said the Chinese military's nuclear arsenal is expected to double to 1,000 nuclear warheads by 2030. The other two reviewers were Lord George Robertson, a former Labour defence secretary, and Fiona Hill, a Russia expert and former foreign policy adviser to Donald Trump. 👉Search for The Wargame on your podcast app👈 The review team warned the post Cold War-era of relative peace has ended and a time of contest, tension and conflict has returned. Adding to the pressure, the US - by far the most powerful member of the NATO alliance - is focusing more on the threat it sees from China. \"Changes in the strategic context mean that NATO allies may be drawn into war with - or be subject to coercion by - another nuclear armed state,\" the review said. \"With the US clear that the security of Europe is no longer its primary international focus, the UK and European allies must step up their efforts\". The review set out how defence is not only the responsibility of the armed forces because countries - not just the professional military - fight wars. It said: \"Everyone has a role to play and a national conversation on how we do it is required… As the old saying goes, 'If you want peace, prepare for war'.\" Sky News and Tortoise will launch a new podcast series - The Wargame - on 10 June that simulates a Russian attack on the UK to test Britain's defences, with former ministers and military chiefs playing the part of the British government."
    },
    {
        "title": "Starmer couldn't be clearer: Britain must prepare for war",
        "description": "Clement Attlee was the Labour prime minister credited with creating the welfare state.",
        "url": "https://news.sky.com/story/starmer-wants-uk-to-be-a-warfare-ready-state-but-how-does-that-balance-with-the-welfare-state-13378208",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-beth-rigby_6933158.jpg?20250602133605",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-02 12:53:00",
        "Headline": "To spend 3% of GDP on defence, the PM needs to find an extra £13bn. That's difficult, especially when the government could U-turn on some welfare cuts.",
        "Content": "\n          Political editor\n              @BethRigby\n  Clement Attlee was the Labour prime minister credited with creating the welfare state. On Monday, at a shipbuilding yard in Glasgow, Sir Keir Starmer presented himself as a Labour prime minister who wants to be credited with turning the UK into a warfare-ready state, as he spoke of the need for the UK to be prepared for the possibility of war at the launch of his government's Strategic Defence Review. The rhetoric couldn't be clearer: Britain is on a wartime footing. The UK's armed forces must move to \"war-fighting readiness\" over the coming years, the UK faces a \"more serious and immediate\" threat than anytime since the Cold War, and \"every citizen must play their part\". Politics latest: Britain must be 'battle-ready' The prime minister promised to fulfil the recommendations of the 10-year strategic defence plan, which will be published in full on Monday afternoon. But what he refused to do was explain when he would deliver on spending 3% of GDP on defence - the commitment necessary to deliver the recommendations in the Strategic Defence Review.  PM is sticking plasters over wounds His refusal to do so blunts his argument. On the one hand, the prime minister insists there is no greater necessity than protecting citizens, while on the other hand, he says his ability to deliver 3% of spending on defence is \"subject to economic and fiscal conditions\". This is a prime minister who promised an end to \"sticking plaster politics\", who promised to take difficult decisions in the interest of the country. One of those difficult decisions could well be deciding, if necessary, to cut other budgets in order to find the 3% needed for defence spending. Instead, the prime minister is sticking plasters over wounds. After voters lashed out at Labour in the local elections, the Starmer government announced it was going to look again at the cut to pensioners' winter fuel allowance. There is an expectation, too, that Sir Keir is planning to lift the two-child cap on benefits. Refusing to lift the cap was one of his hard choices going into the election, but now he is looking soft on it.  👉Listen to Politics at Sam and Anne's on your podcast app👈 What choices is Starmer prepared to make? That's why I asked him on Monday what the choices are that he's going to make as prime minister. Is his choice properly-funded defence, or is it to reverse winter fuel cuts, or lift the two-child benefit cap? If he needs to be the prime minister creating the warfare state, can he also deliver what voters and his own MPs want when it comes to the welfare state? Read more:PM won't set 'arbitrary date' for defence spending boostBritain has 'lost control' of its bordersFarage has 'grabbed the mic' to dominate media agenda To hit the 3% target, Sir Keir would have to find an extra £13bn. That's difficult to find, and especially difficult when the government is reversing on difficult decisions its made on cuts. For now, the prime minister doesn't want to answer the question about the choices he's perhaps going to make. But if he is really clear-eyed about the security threat and what is required for the UK to become ready for war, it is question he is going to have to answer."
    },
    {
        "title": "Rachel Reeves threatens to sue Roman Abramovich over Chelsea FC sale proceeds",
        "description": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale.",
        "url": "https://news.sky.com/story/rachel-reeves-threatens-to-sue-roman-abramovich-over-chelsea-fc-sale-proceeds-13378386",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-roman-abramovich-chelsea_5249883.jpg?20210125130045",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-02 20:39:00",
        "Headline": "The £2.5bn proceeds from the sanctioned Russian oligarch's sale of Chelsea FC are meant to help Ukraine but remain in a UK bank account.",
        "Content": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale. The Russian oligarch, who is sanctioned by the UK government over his alleged links to Vladimir Putin, sold Chelsea for £2.5bn to an American consortium in 2022, after Russia's invasion of Ukraine. Those funds remain in a frozen UK bank account but are meant to be used for humanitarian causes linked to the Ukraine war. Chancellor Rachel Reeves and Foreign Secretary David Lammy have now said they are \"deeply frustrated\" an agreement cannot be reached with the oligarch and will take him to court if it cannot be dealt with soon. In a joint statement, they said: \"The government is determined to see the proceeds from the sale of Chelsea Football Club reach humanitarian causes in Ukraine, following Russia's illegal full-scale invasion. \"We are deeply frustrated that it has not been possible to reach agreement on this with Mr Abramovich so far. \"While the door for negotiations will remain open, we are fully prepared to pursue this through the courts if required, to ensure people suffering in Ukraine can benefit from these proceeds as soon as possible.\" Read more:Russians react to Ukraine's drone attackPutin humiliated by 'Russia's Pearl Harbor' - analysisZelenskyy: Strikes will go 'in history books' Abramovich was forced to sell Chelsea - which he bought for a reported £140m - after 19 years of ownership, after being sanctioned by the government over his alleged close ties to the Russian president - something he denies. The sale was made under the supervision of the Office of Financial Sanctions Implementation, under the proviso the proceeds go to humanitarian aid in Ukraine. They cannot be moved or used without a licence from the office.  In March, the Foreign Office said officials were in talks with Abramovich's representatives, but multiple sources told the BBC there had been no meetings between any Labour ministers and members of the foundation set up to oversee the funds since last July's general election. They said there was a deadlock and a political decision by a minister is needed to negotiate and sign off an agreement. It is not known if there has been meetings in the three months since then. The £2.5bn - and interest accrued - would make up for some of the reduction in the aid budget, announced in February."
    },
    {
        "title": "Human remains found in search for Izabela Zablocka who disappeared 15 years ago",
        "description": "Human remains have been found as part of an investigation into the disappearance of a Polish woman 15 years ago.",
        "url": "https://news.sky.com/story/human-remains-found-in-search-for-izabela-zablocka-who-disappeared-15-years-ago-13378413",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-izabela-helena-zablocka_6933491.jpg?20250602235547",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-02 23:11:00",
        "Headline": "Crimestoppers is offering a £20,000 reward until 27 August if it receives exclusive information that leads to a conviction. ",
        "Content": "Human remains have been found as part of an investigation into the disappearance of a Polish woman 15 years ago. Izabela Zablocka was living in the Normanton area of Derby but lost contact with her family in August 2010, when she was 30, and has never been found. However, new information came to light last week and a murder investigation was launched. Derbyshire Police said remains believed to belong to Ms Zablocka had now been discovered in the garden of a property on Princes Street in Normanton. A 39-year-old woman who was arrested on suspicion of murder was re-arrested on Monday. Two other women, aged 39 and 43, and a 41-year-old man arrested last week remain on bail. Detective Inspector Kane Martin said formal identification hadn't yet taken place but it's believed the remains belong to Ms Zablocka. \"As such, we have spoken with Izabela's family in Poland, and they are aware. Our thoughts are with them at this extremely difficult time,\" he said. \"Identification of the remains is likely to be a lengthy process, but we will issue updates when we are able.\" Police will remain at the address for now as they try to gather more evidence on Ms Zablocka's death. A £20,000 reward is being offered until 27 August for information that leads to a conviction. Anyone who wants to get in touch is urged to contact the Crimestoppers charity. Read more from Sky News:New search to begin in Madeleine McCann caseChancellor threatens to sue Roman Abramovich DI Martin added: \"We know that someone out there will have information about Izabela that may help us understand what happened to her, and urge anyone who saw, spoke to, or heard anything about Izabela in July or August 2010 to come forward. \"You may hold the key piece of information that we need to understand the full circumstances of Izabela's disappearance, and to give her family answers on what happened to their loved one.\""
    },
    {
        "title": "Disabled woman took her own life after benefits wrongly stopped, coroner finds",
        "description": "A disabled mother took her own life after her benefits were incorrectly stopped, a coroner has concluded.",
        "url": "https://news.sky.com/story/disabled-woman-took-her-own-life-after-benefits-wrongly-stopped-coroner-finds-13378390",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jodey-whiting-suicide_6933448.png?20250602221255",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-02 21:04:00",
        "Headline": "Jodey Whiting's mother fought a long legal battle for a second inquest into her daughter's death.",
        "Content": "A disabled mother took her own life after her benefits were incorrectly stopped, a coroner has concluded. Jodey Whiting, 42, left notes to her family members, saying she had no food, could not afford her bills, and that she had \"had enough\", an inquest heard. The mother-of-nine had a hospital stay in December 2016, after contracting pneumonia, that meant she missed a letter about her benefits, saying she needed to be medically assessed. In January 2017, Ms Whiting was told she had missed the medical assessment and she was therefore judged to be fit to work. As well as losing her Employment and Support Allowance, she would also lose housing and council tax benefits. An initial inquest into her death in Stockton-on-Tees, County Durham, in 2017 did not consider the Department for Work and Pensions' (DWP) role in ending her benefits. Ms Whiting's mother Joy Dove fought a long legal battle for a second inquest, going all the way to the Court of Appeal. Ms Dove said when she saw her daughter two days before her death in February 2017, she was \"shaking and crying\" and threatened to kill herself. She told the hearing at Teesside Magistrates' Court the loss of benefits contributed to her daughter's death. \"I know my daughter and I know it was (that),\" she said. \"It was the fact she couldn't find a job, the worry of paying bills, and being pushed out after being so vulnerable all those years and years.\" Wrongly withdrawn benefits 'was trigger' Ms Dove told the inquest that her daughter - who had six grandchildren - had a brain cyst, chronic pains, a drug dependency, and poor mental health. She added that Ms Whiting became increasingly housebound in the last years of her life. Read more from Sky News:New police searches in Madeleine McCann caseToddler suffers serious burns in boat explosion On Monday, coroner Clare Bailey concluded that Ms Whiting's death was suicide \"in the context of a deteriorating mental state, precipitated by the withdrawal of state benefits\". The coroner added: \"Her actions were in the context of her benefits having been wrongly withdrawn by the DWP in circumstances where there had been five missed opportunities to avoid the significant errors. \"This had the effect of negatively impacting upon her mental health, and was the trigger to her taking a fatal overdose.\" 'It should not have taken an eight-year fight' After the hearing, Ms Dove said she \"always believed that Jodey took her life due to failings by the DWP\" and the coroner had \"confirmed that mistakes made by the DWP in the way they handled Jodey's case caused her death\". \"It should not have taken an eight-year fight for justice to get where we are today,\" she said. \"It has been an uphill battle trying to get answers and accountability, but I would never give up. \"I was determined to keep fighting for justice for Jodey.\" An Independent Case Examiner report into the judgment to remove Ms Whiting's benefits discovered several mistakes were made, that her payments should not have been cut, and recommended the government compensate her family with £10,000. Helga Swidenbank - a DWP director for disability services - said: \"I was not in post at the time, but those who I have spoken to are deeply regretful and sorry about what happened. \"There were a number of opportunities to have picked up concerns about Jodey, and we are very sorry about that.\" She added that the DWP has \"more work to do\" in regard to focusing more on people's vulnerabilities. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Liverpool victory parade incident: Number of people injured rises to more than 100",
        "description": "The number of people reported injured in the Liverpool victory parade incident has risen to more than 100, police say.",
        "url": "https://news.sky.com/story/liverpool-victory-parade-incident-number-of-people-injured-rises-to-more-than-100-13378228",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-forensic-officers-liverpool_6930625.jpg?20250529183127",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-02 13:36:00",
        "Headline": "Police previously said 79 people had been injured when a car was driven into a crowd in the city centre.",
        "Content": "The number of people reported injured in the Liverpool victory parade incident has risen to more than 100, police say. Four people are still in hospital after a car was driven into a crowd on Water Street in the city centre last Monday. Merseyside Police have said 109 people were reported injured in the collision at Liverpool FC's Premier League trophy parade. Police had previously said 79 people had been injured. They had also said that the youngest victim was aged nine, and the oldest was a 78-year-old. Paul Doyle, 53, has been charged with seven offences and appeared in court on Friday. Doyle, from the West Derby area of Liverpool, is accused of two counts of unlawful and malicious wounding with intent to cause grievous bodily harm, and two counts of causing unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm. The father-of-three is also accused of two counts of attempted unlawful and malicious grievous bodily harm with intent to cause grievous bodily harm, and one count of dangerous driving. The charges relate to six people, including two children. Doyle was remanded in custody at Liverpool Crown Court last Friday and is due to appear for a plea hearing on 14 August. Specialist officers are supporting those who have been injured, including their families, police say. In a statement on Monday, Detective Superintendent Rachel Wilson said: \"This is a complex and constantly evolving investigation, and we are still working through and assessing those reporting being injured, and our enquiries remain ongoing.\" She added: \"We have had more than 500 submissions to the Major Incident Police Portal (MIPP), and a team of detectives are currently working through the information provided. \"I would continue to appeal for anyone who has information and is yet to come forward to please get in touch as a matter of urgency.\""
    },
    {
        "title": "Police investigating Madeleine McCann case to conduct new searches in Portugal",
        "description": "Police investigating the disappearance of Madeleine McCann will carry out fresh searches in Portugal.",
        "url": "https://news.sky.com/story/german-police-investigating-madeleine-mccanns-disappearance-carrying-out-new-searches-in-portugal-uk-police-say-13378252",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-madeleine-mccann-missing_6511268.jpg?20240405141820",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-02 14:39:00",
        "Headline": "Madeleine McCann was asleep with her younger twin siblings in the family's Portuguese rented holiday apartment before their mother Kate discovered her missing at around 10pm on 3 May 2007.",
        "Content": " Police investigating the disappearance of Madeleine McCann will carry out fresh searches in Portugal. The Metropolitan Police said it was \"aware\" of the searches set to be conducted by German federal police in Portugal - where Madeleine disappeared while on holiday with her family in the resort of Praia da Luz 18 years ago. A spokesperson for the force said: \"We are aware of the searches being carried out by the BKA (German federal police) in Portugal as part of their investigation into the disappearance of Madeleine McCann. \"The Metropolitan Police Service is not present at the search, we will support our international colleagues where necessary.\" German prosecutor Hans Christian Wolters also said in a statement that as part of the investigation, \"criminal proceedings are currently taking place in Portugal\". Later, Portuguese police said it was carrying out a European Investigation Order issued by German authorities, with the search being conducted between Monday and Friday. It comes as Portuguese police sources told Sky's partner in the country, SIC Noticias, that the search was expected to start on Tuesday morning. The three-year-old British girl was asleep with her younger twin siblings in the family's Portuguese rented holiday apartment before their mother Kate discovered her missing at around 10pm on 3 May 2007. Kate and Gerry McCann were dining nearby on the complex with friends and taking turns to check on all their sleeping children every half an hour. Officers are set to scour more than 20 rustic plots of land in the easternmost part of Praia da Luz - near the house where suspect Christian B lived at the time and close to where Madeleine disappeared. SIC Noticias also reports that German and Portuguese authorities are looking for either Madeleine's body or for an indication that she may have been there at the time. Her disappearance is one of the most high-profile cases of a missing person in British history. Christian B, who cannot be fully identified under Germany's privacy law, is currently in jail and coming to the end of his sentence for the rape of an elderly American woman in the resort. He has not been charged or indicted in relation to the disappearance of Madeleine, and he denies any involvement. A German prosecutor told Sky News in January that he will not face any charges in the foreseeable future. In October, Christian B was acquitted on a series of rape and indecent assault charges after a non-jury trial in Germany, in which several references were made to his status as the main suspect in the Madeleine case. German authorities last carried out searches in 2023 near the Barragem do Arade reservoir, about 30 miles from Praia da Luz. It had previously been searched in 2008 after Portuguese lawyer Marcos Aragao Correia paid for specialist divers to search it over claims her body was there. Read more from Sky News:Mount Etna erupts, sending tourists fleeingPersonal trainer jailed over 'first date' chaseRussia and Ukraine agree prisoner swap Last month, Madeleine's parents marked the 18th anniversary of her disappearance, vowing they would keep searching. \"No matter how near or far she is, she continues to be right here with us, every day, but especially on her special day,\" they said ahead of her 22nd birthday. \"We continue to 'celebrate' her as the very beautiful and unique person she is. We miss her.\""
    },
    {
        "title": "Fourth man arrested over fires at properties and car linked to Keir Starmer",
        "description": "A fourth man has been arrested over a series of fires at properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/fourth-man-arrested-over-fires-at-properties-and-car-linked-to-keir-starmer-13377582",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250520091039",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-02 09:00:00",
        "Headline": "The 48-year-old man was detained at London Stansted Airport and is being questioned on suspicion of conspiracy to commit arson with intent to endanger life, the Metropolitan Police says.",
        "Content": "A fourth man has been arrested over a series of fires at properties and a car linked to Prime Minister Sir Keir Starmer. The 48-year-old man was detained at London Stansted Airport on Monday and is being questioned on suspicion of conspiracy to commit arson with intent to endanger life, the Metropolitan Police said. Three other men have been charged over the fires: Ukrainians Petro Pochynok, 34, and Roman Lavrynovych, 21, and Ukrainian-born Romanian national Stanislav Carpiuc, 26. Lavrynovych is charged with three counts of arson with intent to endanger life, while Pochynok and Carpiuc are accused of conspiring to commit arson with intent to endanger life. They are due to appear at the Old Bailey on Friday. It comes after a fire in the early hours of 12 May at a house in Kentish Town, north London, where Sir Keir lived with his family before the election.  Damage was caused to the property's entrance, but nobody was hurt. A car was also set alight in the same street on 8 May. Read more from Sky News:Mount Etna erupts, sending tourists fleeingNew searches in Madeleine McCann case Another fire took place on 11 May at the front door of a house linked to Sir Keir that was converted into flats in Islington. One person was taken to safety by crews wearing breathing apparatus."
    },
    {
        "title": "Former Biden official Matthew Miller Israel has 'without doubt' committed war crimes in Gaza",
        "description": "A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.&#160;",
        "url": "https://news.sky.com/story/former-biden-official-matthew-miller-says-he-believes-israel-has-committed-war-crimes-in-gaza-13378081",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-state-department-matthew_6933044.jpg?20250602110332",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-06-02 08:58:00",
        "Headline": "In a wide-ranging interview for Sky News' Trump 100 podcast, Matthew Miller also said if he was \"outside of government\" he would have preferred a \"better candidate\" for the 2024 presidential election than Mr Biden.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.  Speaking to the Trump 100 podcast, Matthew Miller, who, as a state department spokesman, was the voice and face of the US government's foreign policy under Mr Biden, revealed disagreements, tensions and challenges within the former administration. In the wide-ranging conversation, he said: • It was \"without a doubt true that Israel has committed war crimes\";• That Israeli soldiers were not being \"held accountable\";• That there were \"disagreements all along the way\" about how to handle policy;• And that he \"would have wanted to have a better candidate\" than Mr Biden for the 2024 election. Mr Miller served as the state department spokesman from 2023 until the end of Mr Biden's presidential term. From the podium, his job was to explain and defend foreign policy decisions - from Ukraine to Gaza. \"Look, one of the things about being a spokesperson is you're not a spokesperson for yourself. You are a spokesperson for the president, the administration, and you espouse the positions of the administration. And when you're not in the administration, you can just give your own opinions.\" Now out of office, he offered a candid reflection of a hugely challenging period in foreign policy and US politics.  Gaza disagreements Asked about Gaza, he revealed there were \"small and big\" disagreements within the Biden administration over the US-Israeli relationship. \"There were disagreements all along the way about how to handle policy. Some of those were big disagreements, some of those were little disagreements,\" he said. Pushed on rumours that then-secretary of state Antony Blinken had frustrations with Mr Biden over both Gaza and Ukraine policy, Mr Miller hinted at the tensions. 👉 Follow Trump100 on your podcast app 👈 \"I'll probably wait and let the secretary speak for himself… but I will say, speaking generally, look, it is true about every senior official in government that they don't win every policy fight that they enter into. And what you do is you make your best case to the president. \"The administration did debate, at times, whether and when to cut off weapons to Israel. You saw us in the spring of 2024 stop the shipment of 2,000-pound bombs to Israel because we did not believe they would use those in a way that was appropriate in Gaza.\" Through the spring and summer of 2024, the Biden administration was caught between its bedrock policy of the unconditional defence of its ally Israel and the reality of what that ally was doing in Gaza, with American weapons. Mr Mill said: \"There were debates about whether to suspend other arms deliveries, and you saw at times us hold back certain arms while we negotiated the use of those arms… \"But we found ourselves in this really tough position, especially in that time period when it really came to a head… We were at a place where - I'm thinking of the way I can appropriately say this - the decisions and the thinking of Hamas leadership were not always secret to the United States and to our partners.\" Read more from Sky News:What did Musk achieve at DOGE?Trump to double tariffs on steel importsTrans athlete wins two golds after controversy He continued: \"And it was clear to us in that period that there was a time when our public discussion of withholding weapons from Israel, as well as the protests on college campuses in the United States, and the movement of some European countries to recognise the state of Palestine - appropriate discussions, appropriate decisions - protests are appropriate - but all of those things together were leading the leadership of Hamas to conclude that they didn't need to agree to a ceasefire, they just needed to hold out for a little bit longer, and they could get what they always wanted.\" \"Now, the thing that I look back on, that I will always ask questions of myself about, and I think this is true for others in government, is in that intervening period between the end of May and the middle of January [2025], when thousands of Palestinians were killed, innocent civilians who didn't want this war, had nothing to do with it, was there more that we could, could have done to pressure the Israeli government to agree to that ceasefire? I think at times there probably was,\" Mr Miller said. Asked for his view on the accusation of genocide in Gaza, he said: \"I don't think it's a genocide, but I think it is without a doubt true that Israel has committed war crimes.\" Challenged on why he didn't make these points while in government, he said: \"When you're at the podium, you're not expressing your personal opinion. You're expressing the conclusions of the United States government. The United States government had not concluded that they committed war crimes, still have not concluded [that].\" He went on to offer a qualification to his accusation. \"There are two ways to think about the commission of war crimes,\" he said. \"One is if the state has pursued a policy of deliberately committing war crimes or is acting recklessly in a way that aids and abets war crimes. Is the state committing war crimes? \"That, I think, is an open question. I think what is almost certainly not an open question is that there have been individual incidents that have been war crimes where Israeli soldiers, members of the Israeli military, have committed war crimes.\" The Israeli government continues to strongly deny all claims that it has committed war crimes in Gaza. On Joe Biden's election hopes Mr Miller also offered a candid reflection on the suitability of Mr Biden as a candidate in the 2024 US election. While Mr Biden initially ran to extend his stay in the White House, he stepped aside, with Kamala Harris taking his place as the Democratic candidate. \"Had I not been inside the government, had I been outside the government acting kind of in a political role, of course, I would have wanted to have a better candidate,\" he said. \"It's that collective action problem where no one wants to be the first to speak out and stand up alone. You stand up by yourself and get your head chopped off, stand up together, you can take action. \"But there was never really a consensus position in the party, and there was no one that was willing to stand up and rally the party to say this isn't going to work. \"I don't think there is anyone on the White House staff, including the most senior White House staffers, who could have gone to Joe Biden in the spring of 2023 or at any time after that and told him: 'Mr President, you are not able to do the duties of this job. And you will not win re-election.' He would have rejected that outright.\"  The Trump presidency On the Donald Trump presidency so far, he offered a nuanced view. He described Mr Trump's Middle East envoy Steve Witkoff as \"an extremely capable individual\" but expressed his worry that he was being manipulated by Russian President Vladimir Putin. \"I know the people in the Biden administration who worked with him during the first negotiations for Gaza ceasefire thought that he was capable. \"I think at times he doesn't know what he doesn't know. And you see that especially in the negotiations to end the war in Ukraine, where you see him go into a meeting with Vladimir Putin and come out spouting Russian propaganda… I think he would benefit from a little diplomatic savvy and some experienced diplomats around him.\" He continued: \"But I do think it's extremely important that when people sit down with an envoy of the United States they know that that envoy speaks for the President of the United States and it is very clear that Witkoff has that and that's an extremely valuable asset to bring to the table.\" On the months and years ahead under Mr Trump, Mr Miller said: \"The thing that worries me most is that Donald Trump may squander the position that the United States has built around the world over successive administrations of both parties over a course of decades. \"I don't think most Americans understand the benefits that they get to their daily lives by the United States being the indispensable nation in the world. \"The open question is: will the damage that he's doing be recoverable or not?\""
    },
    {
        "title": "Mount Etna erupts in Sicily, sending huge plume of ash into sky and tourists fleeing",
        "description": "Mount Etna in Sicily has erupted, sending a huge plume of ash into the sky.",
        "url": "https://news.sky.com/story/mount-etna-erupts-in-sicily-sending-huge-plume-of-ash-into-sky-and-tourists-fleeing-13378143",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-mount-etna-sicily_6933116.jpg?20250602125101",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-02 10:58:00",
        "Headline": "Social media footage showed tourists running down the slopes as the highest active volcano in Europe erupted.",
        "Content": " Mount Etna in Sicily has erupted, sending a huge plume of ash into the sky. Social media footage showed tourists running down the slopes as the highest active volcano in Europe erupted. Italy's National Institute of Geophysics and Volcanology said it expected the erupting ash cloud to disperse in a west-southwest direction. The monitoring institute said the \"amplitude values of volcanic tremors are currently high\" and were \"showing a tendency to increase\". It added the eruptive activity has \"continued with strombolian explosions of increasing intensity that, at the moment, are to be considered to be very intense and almost continuous\". \"In the last few hours there's been reports of [a] little thin ash in Piano Vetore,\" the institute said. The Volcanic Ash Advisory Centre Toulouse has issued a \"code red\" aviation warning, advising planes that a significant volume of ash in the atmosphere is likely. Mount Etna is one of the world's most active volcanoes. It was added to the list of UNESCO World Heritage Sites in 2013."
    },
    {
        "title": "Russians react to Ukraine's unprecedented drone attack - as Kremlin's silence speaks volumes",
        "description": "Ukraine's drone attack on Russia's long-range bombers was unprecedented, not that you'd know it from reading the Russian papers. Nor from watching the news bulletins here.",
        "url": "https://news.sky.com/story/russians-react-to-ukraines-unprecedented-drone-attack-as-kremlins-silence-speaks-volumes-13378372",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukraine-russia_6932581.jpg?20250601151715",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-06-02 19:33:00",
        "Headline": "Moscow wants to play down the assault, which was a hugely embarrassing breach of Russia's defences.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  Ukraine's drone attack on Russia's long-range bombers was unprecedented, not that you'd know it from reading the Russian papers. Nor from watching the news bulletins here. Monday's front pages were dominated by photos of the wreckage of a road bridge collapsing on to a passenger train in the Bryansk region, after it was blown up late on Saturday night.  Meanwhile, the flagship talk show on state TV here on Monday morning didn't even mention the attack. Instead, there was just a breathless build-up to the latest round of peace talks in Istanbul. The lack of visual coverage of the drone attack is partly because of the sensitivities around publishing images of Russian military infrastructure. But I think it's also because the Kremlin wants to play down the assault, which was a hugely embarrassing breach of Russia's defences. So where the attack is mentioned in the papers, it's done in a way to reinforce Moscow's narrative - that Ukraine is the aggressor out to derail the peace process.  The Izvestia newspaper, for example, describes it as a terrorist attack, and says it \"calls into question Kyiv's readiness for de-escalation\". There's no reference to the scale of the damage, and there's certainly no sense of alarm. It's a similar vibe on the streets of Moscow, where we meet Irina. She believes the reports of the attack are \"exaggerated\". \"These planes are very old and hardly anyone needs them,\" she says. Another passer-by, called Vladimir, says he trusts his namesake Mr Putin to respond when the time is right. \"This must be done systematically, confidently, and without any kind of nervous breakdowns, or any shows of soul,\" he says. There is plenty of soul on show on social media, though, where Russia's influential military bloggers are calling for a rapid retaliation. One popular channel, called Dva Mayora or \"Two Majors\", even said it was \"a reason to launch nuclear strikes on Ukraine\". Others are directing their anger at Russia's military command, accusing the leadership of complacency for storing the planes out in the open. Read more:Putin humiliated by 'Russia's Pearl Harbor' - analysisZelenskyy: Strikes will go 'in history books' It all served to overshadow the latest round of peace talks in Istanbul, where the only concrete outcome was another prisoner exchange and the return of 6,000 dead soldiers from each side. And if anything, the outlook for peace now is even more bleak than it was before the talks began. That's because Russia has now presented its blueprint for a settlement, and it seemingly offers no sign of compromise at all. According to Russian media reports, the document is a list of Moscow's maximalist demands, including neutrality for Ukraine, limits to its army, surrender of territory and the lifting of sanctions. Only then, Russia says, would it agree to end the war. The Kremlin itself still hasn't commented on the drone attack - a silence that speaks volumes. Can you imagine Downing Street doing the same if something similar happened in the UK? There will undoubtedly be repercussions at some point, both externally and internally. So, despite the talk being of peace at the talks in Turkey, the mood is still very much one of war."
    },
    {
        "title": "Rachel Reeves threatens to sue Roman Abramovich over Chelsea FC sale proceeds",
        "description": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale.",
        "url": "https://news.sky.com/story/rachel-reeves-threatens-to-sue-roman-abramovich-over-chelsea-fc-sale-proceeds-13378386",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-roman-abramovich-chelsea_5249883.jpg?20210125130045",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-02 20:39:00",
        "Headline": "The £2.5bn proceeds from the sanctioned Russian oligarch's sale of Chelsea FC are meant to help Ukraine but remain in a UK bank account.",
        "Content": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale. The Russian oligarch, who is sanctioned by the UK government over his alleged links to Vladimir Putin, sold Chelsea for £2.5bn to an American consortium in 2022, after Russia's invasion of Ukraine. Those funds remain in a frozen UK bank account but are meant to be used for humanitarian causes linked to the Ukraine war. Chancellor Rachel Reeves and Foreign Secretary David Lammy have now said they are \"deeply frustrated\" an agreement cannot be reached with the oligarch and will take him to court if it cannot be dealt with soon. In a joint statement, they said: \"The government is determined to see the proceeds from the sale of Chelsea Football Club reach humanitarian causes in Ukraine, following Russia's illegal full-scale invasion. \"We are deeply frustrated that it has not been possible to reach agreement on this with Mr Abramovich so far. \"While the door for negotiations will remain open, we are fully prepared to pursue this through the courts if required, to ensure people suffering in Ukraine can benefit from these proceeds as soon as possible.\" Read more:Russians react to Ukraine's drone attackPutin humiliated by 'Russia's Pearl Harbor' - analysisZelenskyy: Strikes will go 'in history books' Abramovich was forced to sell Chelsea - which he bought for a reported £140m - after 19 years of ownership, after being sanctioned by the government over his alleged close ties to the Russian president - something he denies. The sale was made under the supervision of the Office of Financial Sanctions Implementation, under the proviso the proceeds go to humanitarian aid in Ukraine. They cannot be moved or used without a licence from the office.  In March, the Foreign Office said officials were in talks with Abramovich's representatives, but multiple sources told the BBC there had been no meetings between any Labour ministers and members of the foundation set up to oversee the funds since last July's general election. They said there was a deadlock and a political decision by a minister is needed to negotiate and sign off an agreement. It is not known if there has been meetings in the three months since then. The £2.5bn - and interest accrued - would make up for some of the reduction in the aid budget, announced in February."
    },
    {
        "title": "Police investigating Madeleine McCann case to conduct new searches in Portugal",
        "description": "Police investigating the disappearance of Madeleine McCann will carry out fresh searches in Portugal.",
        "url": "https://news.sky.com/story/german-police-investigating-madeleine-mccanns-disappearance-carrying-out-new-searches-in-portugal-uk-police-say-13378252",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-madeleine-mccann-missing_6511268.jpg?20240405141820",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-02 14:39:00",
        "Headline": "Madeleine McCann was asleep with her younger twin siblings in the family's Portuguese rented holiday apartment before their mother Kate discovered her missing at around 10pm on 3 May 2007.",
        "Content": " Police investigating the disappearance of Madeleine McCann will carry out fresh searches in Portugal. The Metropolitan Police said it was \"aware\" of the searches set to be conducted by German federal police in Portugal - where Madeleine disappeared while on holiday with her family in the resort of Praia da Luz 18 years ago. A spokesperson for the force said: \"We are aware of the searches being carried out by the BKA (German federal police) in Portugal as part of their investigation into the disappearance of Madeleine McCann. \"The Metropolitan Police Service is not present at the search, we will support our international colleagues where necessary.\" German prosecutor Hans Christian Wolters also said in a statement that as part of the investigation, \"criminal proceedings are currently taking place in Portugal\". Later, Portuguese police said it was carrying out a European Investigation Order issued by German authorities, with the search being conducted between Monday and Friday. It comes as Portuguese police sources told Sky's partner in the country, SIC Noticias, that the search was expected to start on Tuesday morning. The three-year-old British girl was asleep with her younger twin siblings in the family's Portuguese rented holiday apartment before their mother Kate discovered her missing at around 10pm on 3 May 2007. Kate and Gerry McCann were dining nearby on the complex with friends and taking turns to check on all their sleeping children every half an hour. Officers are set to scour more than 20 rustic plots of land in the easternmost part of Praia da Luz - near the house where suspect Christian B lived at the time and close to where Madeleine disappeared. SIC Noticias also reports that German and Portuguese authorities are looking for either Madeleine's body or for an indication that she may have been there at the time. Her disappearance is one of the most high-profile cases of a missing person in British history. Christian B, who cannot be fully identified under Germany's privacy law, is currently in jail and coming to the end of his sentence for the rape of an elderly American woman in the resort. He has not been charged or indicted in relation to the disappearance of Madeleine, and he denies any involvement. A German prosecutor told Sky News in January that he will not face any charges in the foreseeable future. In October, Christian B was acquitted on a series of rape and indecent assault charges after a non-jury trial in Germany, in which several references were made to his status as the main suspect in the Madeleine case. German authorities last carried out searches in 2023 near the Barragem do Arade reservoir, about 30 miles from Praia da Luz. It had previously been searched in 2008 after Portuguese lawyer Marcos Aragao Correia paid for specialist divers to search it over claims her body was there. Read more from Sky News:Mount Etna erupts, sending tourists fleeingPersonal trainer jailed over 'first date' chaseRussia and Ukraine agree prisoner swap Last month, Madeleine's parents marked the 18th anniversary of her disappearance, vowing they would keep searching. \"No matter how near or far she is, she continues to be right here with us, every day, but especially on her special day,\" they said ahead of her 22nd birthday. \"We continue to 'celebrate' her as the very beautiful and unique person she is. We miss her.\""
    },
    {
        "title": "Colorado petrol bomb suspect charged with 16 counts of attempted murder ",
        "description": "The suspect in the Colorado petrol bomb attack has been charged with 16 counts of attempted murder.",
        "url": "https://news.sky.com/story/colorado-petrol-bomb-suspect-charged-with-16-counts-of-attempted-murder-and-federal-hate-crime-13378400",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-colorado-mohamed-soliman_6933246.png?20250602161009",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-02 21:42:00",
        "Headline": "Mohamed Soliman is in custody and has been charged with several counts of attempted murder, first-degree assault, and attempted use of an incendiary device.",
        "Content": " The suspect in the Colorado petrol bomb attack has been charged with 16 counts of attempted murder. Mohamed Soliman is accused of throwing Molotov cocktails and using a makeshift flamethrower on a group of people at a rally in support of Israeli hostages - with the FBI describing the incident as a targeted \"act of terrorism\". The 45-year-old, from El Paso County, Colorado, shouted \"Free Palestine\" during the attack, it is alleged. A total of 12 victims were injured and taken to hospitals, authorities said. One of those was at one point said to be in a critical condition. A federal criminal complaint (court filing) said Soliman confessed to the attack, told investigators that he had planned it for a year, said he \"wanted to kill all Zionist people and wished they were all dead\", and that \"he would do it again\".  At a press conference on Monday evening, 20th judicial district attorney Michael Dougherty said \"Boulder is a beautiful and special place, but we're not immune from mass violence or hate crimes\" as he explained the charges against Soliman. He said that the suspect faces 16 counts of attempted murder in the first-degree, with eight of those for attempted murder with intent and after deliberation, meaning he had time to consider his crimes. \n                  Colorado latest: Suspected petrol bomb attacker 'had no regrets', say officials\n                 \n                  Eight injured in petrol bomb and 'flamethrower' attack at rally for Hamas-held hostages in Colorado\n                 \n                  More than 100 immigrants detained at illegal after-hours nightclub in Colorado\n                 The other eight counts relate to attempted murder with extreme indifference, meaning he acted without regard to others' lives. Read more:Mount Etna erupts, sending tourists fleeingUK has warmest spring on recordRussians react to Ukraine's drone attack Soliman is also charged with eight counts of first-degree assault, two counts of use of an incendiary device, and 16 counts of attempted use of an incendiary device. If convicted on all charges pursued by the state prosecutor, and if they run consecutively, Soliman faces a maximum sentence of 624 years in prison. Mr Dougherty added that the US attorney's office \"will be prosecuting the hate crime against the defendant,\" which relates to the federal crime of causing bodily injury because of actual or perceived race, colour, religion, or national origin. Suspect appears in court After the press conference, Soliman made his first appearance in court, appearing via web link from Boulder County Jail. During the brief hearing, Judge Nancy Salomone asked the suspect if received the protection order issued by the court preventing him from contacting the victims, to which he said \"yes\". She then said she will see legal representatives on Thursday for the filing of the charges."
    },
    {
        "title": "Former Biden official Matthew Miller Israel has 'without doubt' committed war crimes in Gaza",
        "description": "A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.&#160;",
        "url": "https://news.sky.com/story/former-biden-official-matthew-miller-says-he-believes-israel-has-committed-war-crimes-in-gaza-13378081",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-state-department-matthew_6933044.jpg?20250602110332",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-02 08:58:00",
        "Headline": "In a wide-ranging interview for Sky News' Trump 100 podcast, Matthew Miller also said if he was \"outside of government\" he would have preferred a \"better candidate\" for the 2024 presidential election than Mr Biden.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  A senior official in former president Joe Biden's administration has told Sky News that he has no doubt that Israel has committed war crimes in Gaza.  Speaking to the Trump 100 podcast, Matthew Miller, who, as a state department spokesman, was the voice and face of the US government's foreign policy under Mr Biden, revealed disagreements, tensions and challenges within the former administration. In the wide-ranging conversation, he said: • It was \"without a doubt true that Israel has committed war crimes\";• That Israeli soldiers were not being \"held accountable\";• That there were \"disagreements all along the way\" about how to handle policy;• And that he \"would have wanted to have a better candidate\" than Mr Biden for the 2024 election. Mr Miller served as the state department spokesman from 2023 until the end of Mr Biden's presidential term. From the podium, his job was to explain and defend foreign policy decisions - from Ukraine to Gaza. \"Look, one of the things about being a spokesperson is you're not a spokesperson for yourself. You are a spokesperson for the president, the administration, and you espouse the positions of the administration. And when you're not in the administration, you can just give your own opinions.\" Now out of office, he offered a candid reflection of a hugely challenging period in foreign policy and US politics.  Gaza disagreements Asked about Gaza, he revealed there were \"small and big\" disagreements within the Biden administration over the US-Israeli relationship. \"There were disagreements all along the way about how to handle policy. Some of those were big disagreements, some of those were little disagreements,\" he said. Pushed on rumours that then-secretary of state Antony Blinken had frustrations with Mr Biden over both Gaza and Ukraine policy, Mr Miller hinted at the tensions. 👉 Follow Trump100 on your podcast app 👈 \"I'll probably wait and let the secretary speak for himself… but I will say, speaking generally, look, it is true about every senior official in government that they don't win every policy fight that they enter into. And what you do is you make your best case to the president. \"The administration did debate, at times, whether and when to cut off weapons to Israel. You saw us in the spring of 2024 stop the shipment of 2,000-pound bombs to Israel because we did not believe they would use those in a way that was appropriate in Gaza.\" Through the spring and summer of 2024, the Biden administration was caught between its bedrock policy of the unconditional defence of its ally Israel and the reality of what that ally was doing in Gaza, with American weapons. Mr Mill said: \"There were debates about whether to suspend other arms deliveries, and you saw at times us hold back certain arms while we negotiated the use of those arms… \"But we found ourselves in this really tough position, especially in that time period when it really came to a head… We were at a place where - I'm thinking of the way I can appropriately say this - the decisions and the thinking of Hamas leadership were not always secret to the United States and to our partners.\" Read more from Sky News:What did Musk achieve at DOGE?Trump to double tariffs on steel importsTrans athlete wins two golds after controversy He continued: \"And it was clear to us in that period that there was a time when our public discussion of withholding weapons from Israel, as well as the protests on college campuses in the United States, and the movement of some European countries to recognise the state of Palestine - appropriate discussions, appropriate decisions - protests are appropriate - but all of those things together were leading the leadership of Hamas to conclude that they didn't need to agree to a ceasefire, they just needed to hold out for a little bit longer, and they could get what they always wanted.\" \"Now, the thing that I look back on, that I will always ask questions of myself about, and I think this is true for others in government, is in that intervening period between the end of May and the middle of January [2025], when thousands of Palestinians were killed, innocent civilians who didn't want this war, had nothing to do with it, was there more that we could, could have done to pressure the Israeli government to agree to that ceasefire? I think at times there probably was,\" Mr Miller said. Asked for his view on the accusation of genocide in Gaza, he said: \"I don't think it's a genocide, but I think it is without a doubt true that Israel has committed war crimes.\" Challenged on why he didn't make these points while in government, he said: \"When you're at the podium, you're not expressing your personal opinion. You're expressing the conclusions of the United States government. The United States government had not concluded that they committed war crimes, still have not concluded [that].\" He went on to offer a qualification to his accusation. \"There are two ways to think about the commission of war crimes,\" he said. \"One is if the state has pursued a policy of deliberately committing war crimes or is acting recklessly in a way that aids and abets war crimes. Is the state committing war crimes? \"That, I think, is an open question. I think what is almost certainly not an open question is that there have been individual incidents that have been war crimes where Israeli soldiers, members of the Israeli military, have committed war crimes.\" The Israeli government continues to strongly deny all claims that it has committed war crimes in Gaza. On Joe Biden's election hopes Mr Miller also offered a candid reflection on the suitability of Mr Biden as a candidate in the 2024 US election. While Mr Biden initially ran to extend his stay in the White House, he stepped aside, with Kamala Harris taking his place as the Democratic candidate. \"Had I not been inside the government, had I been outside the government acting kind of in a political role, of course, I would have wanted to have a better candidate,\" he said. \"It's that collective action problem where no one wants to be the first to speak out and stand up alone. You stand up by yourself and get your head chopped off, stand up together, you can take action. \"But there was never really a consensus position in the party, and there was no one that was willing to stand up and rally the party to say this isn't going to work. \"I don't think there is anyone on the White House staff, including the most senior White House staffers, who could have gone to Joe Biden in the spring of 2023 or at any time after that and told him: 'Mr President, you are not able to do the duties of this job. And you will not win re-election.' He would have rejected that outright.\"  The Trump presidency On the Donald Trump presidency so far, he offered a nuanced view. He described Mr Trump's Middle East envoy Steve Witkoff as \"an extremely capable individual\" but expressed his worry that he was being manipulated by Russian President Vladimir Putin. \"I know the people in the Biden administration who worked with him during the first negotiations for Gaza ceasefire thought that he was capable. \"I think at times he doesn't know what he doesn't know. And you see that especially in the negotiations to end the war in Ukraine, where you see him go into a meeting with Vladimir Putin and come out spouting Russian propaganda… I think he would benefit from a little diplomatic savvy and some experienced diplomats around him.\" He continued: \"But I do think it's extremely important that when people sit down with an envoy of the United States they know that that envoy speaks for the President of the United States and it is very clear that Witkoff has that and that's an extremely valuable asset to bring to the table.\" On the months and years ahead under Mr Trump, Mr Miller said: \"The thing that worries me most is that Donald Trump may squander the position that the United States has built around the world over successive administrations of both parties over a course of decades. \"I don't think most Americans understand the benefits that they get to their daily lives by the United States being the indispensable nation in the world. \"The open question is: will the damage that he's doing be recoverable or not?\""
    },
    {
        "title": "Ex-BT chief Patterson sounded out about £300m Waves Audio float",
        "description": "A former BT Group chief is being lined up to steer an audio technology business used by many of the world's leading musicians through a &#163;300m London flotation.",
        "url": "https://news.sky.com/story/ex-bt-chief-patterson-sounded-out-about-163300m-waves-audio-float-13378257",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gavin-patterson-bt_6933212.jpg?20250602145106",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-02 15:15:00",
        "Headline": "Gavin Patterson, who sits on boards including Ocado Group, is being lined up as chairman of the audio technology company as it eyes a London float as soon as next month, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A former BT Group chief is being lined up to steer an audio technology business used by many of the world's leading musicians through a £300m London flotation. Sky News has learnt that Gavin Patterson, who now sits on various boards including Ocado Group, is in talks to chair Waves Audio ahead of a listing which could come as soon as next month. City sources said an agreement between the company and Mr Patterson had yet to be finalised. Sky News revealed several weeks ago that Waves Audio, which is headquartered in Israel, had hired bankers from Panmure Liberum to oversee an initial public offering (IPO). The company, which is majority-owned by founders Meir Sha'ashua and Gilad Keren, is expected to raise millions of pounds from the sale of new shares, although the details have yet to be finalised. Waves Audio makes professional digital audio signal processing technology and audio effects used in recordings, mixing, mastering, post-production, broadcasting and live sound. It employs more than 200 people, and has a major international presence, including in Europe and the US. \n                  Newly re-privatised NatWest names Chamberlain as retail bank chief\n                 \n                  Money blog: Change to mortgage rules could drive up house prices and first-time buyers\n                 \n                  SME lender Tide eyes $1bn valuation in Apis funding talks\n                 A successful float on London's main market would be a relative rarity given the depressed level of IPO activity in the last couple of years. Data compiled by EY, the professional services firm, showed that there were just five new listings on the London market in the first quarter of the year. Pessimism about the outlook for flotations has been compounded by a steady trickle of companies cancelling their London listings or shifting them overseas - with drugmaker Indivior the latest to abandon the City on Monday. The UK market's biggest hope - that Shein, the Chinese-founded online fashion retailer, would defy the impact of US President Donald Trump's tariffs and list in London - appears to have been dashed, with reports last week suggesting that it would float in Hong Kong instead. A spokesman for Waves Audio declined to comment."
    },
    {
        "title": "Newly re-privatised NatWest names Chamberlain as retail bank chief",
        "description": "NatWest Group has picked a new head of its high street branch network in the lender's first significant appointment since ending its 17-year tenure in partial taxpayer ownership.",
        "url": "https://news.sky.com/story/newly-re-privatised-natwest-names-chamberlain-as-retail-bank-chief-13378215",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-natwest-bank_6816102.jpg?20250201101426",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-02 12:58:00",
        "Headline": "Solange Chamberlain will this week be announced as the chief executive of NatWest's retail bank, three days after the lender returned to full private ownership, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n NatWest Group has picked a new head of its high street branch network in the lender's first significant appointment since ending its 17-year tenure in partial taxpayer ownership. Sky News has learnt that Solange Chamberlain has been chosen as NatWest's new retail bank chief executive, nearly six months after predecessor David Lindberg's departure was announced. Ms Chamberlain, who has worked for NatWest since 2019, will take up her new role on 1 July, subject to regulatory approval. A former investment banker, she will report to Paul Thwaite, the bank's group chief executive. Her previous roles at NatWest include chief operating officer of its commercial bank and more recently as group director of strategic development. NatWest's retail bank has more than 18 million customers across Britain, making it one of the industry's four biggest retail banks alongside Barclays, HSBC and Lloyds Banking Group. The recent acquisition of Sainsbury's Bank added 1 million accounts to NatWest's retail customer base. Responding to an enquiry from Sky News, NatWest confirmed the appointment on Monday afternoon. Mr Thwaite said in a statement that Ms Chamberlain's \"knowledge of our customers, sharp strategic thinking, and track record of transformation delivery will help us to grow our retail business and succeed with customers\". On Friday, the Treasury sold the last of its shareholding in NatWest, having bailed out the then Royal Bank of Scotland with £45.5bn of taxpayers' money during the 2008 financial crisis. On Monday, shares in the bank were trading at around 524.6p, giving it a market value of more than £42bn."
    },
    {
        "title": "SME lender Tide eyes $1bn valuation in Apis funding talks",
        "description": "Tide, the business banking services platform, is in advanced talks to raise new funding in a deal expected to make it Britain's latest technology unicorn.",
        "url": "https://news.sky.com/story/sme-lender-tide-eyes-1bn-valuation-in-apis-funding-talks-13378046",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-tide-bank_6474400.jpg?20240301114724",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-02 07:00:00",
        "Headline": "Tide is hoping to join the ranks of British technology unicorns amid talks about an investment from Apis Partners, a prolific backer of fintech businesses, Sky News learns",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Tide, the business banking services platform, is in advanced talks to raise new funding in a deal expected to make it Britain's latest technology unicorn. Sky News has learnt that Tide has been negotiating the terms of an investment from Apis Partners, a prolific investor in the fintech sector, for some time. City sources cautioned that a deal between the two was not yet certain to take place, and that other investors were also in discussions. Apis Partners has backed early-stage companies such as Moneybox, the UK-based digital wealth manager, and Thunes, a digital payments infrastructure provider. Significantly, the firm has made a string of investments in India, which is overtaking the UK as Tide's single-biggest geography. Tide now has roughly 650,000 SME customers in both Britain and India, with the latter market expanding at a faster rate. The precise terms of a deal between Apis and Tide were unclear on Monday. \n                  Ex-BT chief Patterson sounded out about £300m Waves Audio float\n                 \n                  Newly re-privatised NatWest names Chamberlain as retail bank chief\n                 \n                  Money blog: Change to mortgage rules could drive up house prices and first-time buyers\n                 Morgan Stanley, the Wall Street bank, has been advising Tide on the fundraising, which is expected to comprise a combination of primary and secondary shares. Tide was founded in 2015 by George Bevis and Errol Damelin, before launching two years later. It describes itself as the leading business financial platform in the UK, offering business accounts and related banking services. The company also provides its SME 'members' in the UK a set of connected administrative solutions from invoicing to accounting. It now boasts a roughly 11% SME banking market share in Britain. Tide, which employs about 2,000 people, also launched in Germany last May. The company's investors include Apax Partners, Augmentum Fintech and LocalGlobe. Chaired by the City grandee Sir Donald Brydon, Tide declined to comment on Monday. Apis Partners also declined to comment."
    },
    {
        "title": "Buyout firm EQT revs up £500m bid for World Rally promoter",
        "description": "The private equity giant EQT Partners is exploring an offer to buy the promoter of the World Rally Championship (WRC) as an auction valuing the business at close to &#163;500m finally gets off the starting grid.",
        "url": "https://news.sky.com/story/buyout-firm-eqt-revs-up-163500m-bid-for-world-rally-promoter-13378163",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-world-rally-championship_6933081.jpg?20250602121253",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-02 11:33:00",
        "Headline": "The Swedish-based private equity firm is among the suitors circling WRC Promoter, which is owned by Red Bull and German investment firm KW25, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity giant EQT Partners is exploring an offer to buy the promoter of the World Rally Championship (WRC) as an auction valuing the business at close to £500m finally gets off the starting grid. Sky News has learnt that Stockholm-based EQT is among a number of buyout firms preparing to bid for WRC Promoter, which owns the commercial rights to the WRC and the European Rally Championship. Both series are sanctioned by the FIA, world motorsport's governing body. A sale of the promoter has been on the cards since last summer, when the news agency Reuters reported that bankers from JP Morgan had been hired to oversee an auction. WRC Promoter is owned by the Austrian drinks behemoth Red Bull and KW25, a German investment company. After five rounds of the 2025 WRC series, the championship standings are headed by British driver Elfyn Evans. The next race takes place in northern Sardinia, Italy, later this week. \n                  Ex-BT chief Patterson sounded out about £300m Waves Audio float\n                 \n                  Newly re-privatised NatWest names Chamberlain as retail bank chief\n                 \n                  Money blog: Change to mortgage rules could drive up house prices and first-time buyers\n                 EQT has not been among the private equity industry's most prolific investor in sports-related assets, but in recent months it has intensified its interest in the sector. It recently took a stake in Baller League, a six-a-side football format which counts Gary Lineker among its backers, and was one of the bidders in auction of the commercial rights to Germany's Bundesliga in 2023. A spokesman for EQT declined to comment."
    },
    {
        "title": "The rise of the prenup - and why so many of us are now getting one",
        "description": "The number of couples deciding to get a prenup is increasing, with one law firm telling Money it has seen requests double in the last year.&#160;",
        "url": "https://news.sky.com/story/the-rise-of-the-prenup-and-why-so-many-of-us-are-now-getting-one-13378059",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-prenup-money_6932963.jpg?20250602085858",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-06-02 07:51:00",
        "Headline": "It is estimated that more than 20% of all married couples in the country have signed a prenup. But what are they, and do they hold any legal weight?",
        "Content": "\n          Money live reporter\n              @JournoJess97\n The number of couples deciding to get a prenup is increasing, with one law firm telling Money it has seen requests double in the last year.  It is estimated that more than 20% of all married couples in the country have signed one of these agreements. So, what are they, and why are so many of us opting for one? The Money team took a look... A prenup is a legal arrangement made by a couple before they marry or enter a civil partnership, which sets out plans for how their assets should be divided if they divorce or have their civil partnership dissolved. They are not legally binding, but thanks to a landmark ruling in 2010, courts are expected to uphold prenups that have been entered into freely. However, courts are still able to make decisions on a case-by-case basis, meaning prenups that appear to have been entered under pressure or written up particularly unfairly might not be given as much weight.   The landmark ruling Prenups used to be associated with the ultra wealthy and famous, but after the Radmacher v Granatino ruling, people became more aware of them, Charlotte Lanning from Edward's Family Law told Money. After that decision, prenups agreed by celebrity couples made headlines across the country, making them appear \"glitzy\" and desirable, she said. \"When I was first starting out, I would do prenups on the odd occasion, whereas now we always have a couple on the go each,\" the associate solicitor said. Getting married later While the ruling was a factor, Lanning thinks the more recent increase in prenups has been driven by changes in society. People are getting married later and are less worried about looking unromantic. \"The fact that people are getting married a lot later in life... means there is more to argue over,\" Lanning said, explaining that the older people are, the more likely they are to own businesses, properties or other assets. The bank of mum and dad A lot of her clients were also relying more on the \"bank of mum and dad\" to fund big purchases, such as the deposit on a first home. Lanning said this made wealth inequities more obvious, putting prenups at the \"forefront of people's minds\" before they get married. Changing attitudes The Marriage Foundation thinktank has been looking at prenups for years, and its founder and former judge Sir Paul Coleridge told Money that changing attitudes were a big driver in the uptick. \"The old Victorian view was that it was wrong to have people talking about what should happen when a marriage broke down when the clear intention was to stay married for life,\" he said. \"I'm a convert. I felt quite strongly that it was wrong to start discussing divorce before marriage, but I have completely changed my mind. \"People do quite often want to have a discussion about what should happen in the worst case.\" He explained that despite the stereotype of a rich man paying off a younger, poorer wife, that was no longer the case either. \"You find people getting married now are very established financially and have made a great deal of money on their own, and this is men and women,\" he said. \"It's certainly not only applicable to men paying women. Nowadays, it's very frequent to be the other way around.\" Lanning said a typical client was often a high net worth individual, but it was becoming more common for young people who are in line to receive a large inheritance to get a prenup. \"A lot of the ones I have done recently have been quite interesting because it is more to do with future inheritance,\" she said. \"One of the parties that is getting married won't necessarily have the money yet, but the prenup is to make sure that if they do receive it during the marriage, that it is protected.\" Read the latest Money news live She explained that parents can be the driving force of these agreements, with many wanting to make sure their child keeps hold of their inheritance. Then there are divorcees. Lanning said people who used her firm for their divorce proceedings will return when they're considering getting married for a second time. \"We see it often with second marriages, particularly if the parties have children from a previous marriage or relationship. Obviously, the older you are, the more money you've got because you've had longer to build it up.\" Sir Paul stressed that prenups were not necessary for every couple, so people should consider them carefully before signing one. A prenup can cover a range of topics, with Sir Paul saying he has seen some in the US that set out bizarre requirements such as the number of times a couple must have sex. Typically, it will cover property, savings, inheritance, stocks and shares, income, business interests, pension pots, and premium bonds. In the UK, a prenup cannot include child custody arrangements, personal matters, illegal activities, or lifestyle issues. When writing up a prenup, Lanning said property was the most common point of contention. \"It might specify that a home becomes joint property or it will stay separate,\" she said. \"When there's not a lot of money involved, the court will normally be looking at what the weaker financial party needs in order to rehouse. \"You will quite often have a clause in there that says after a certain number of years, you can have a specific amount to rehouse, or you can have a property in a certain area, with a set number of bedrooms. \"It just provides a bit of structure to try to temper down people's needs,\" she explained. \"There is a broad spectrum of what you can assert. The whole point of it is to try to stop arguments later down the line.\" The simple answer to both questions is that it completely depends on how complex the agreement is. Lanning said the general rule is that a prenup should be signed 28 days before a couple gets married. She said it's \"absolutely great\" if people contact a solicitor about a prenup around six months before their wedding. \"That way, you can get the advice on what they do, what the process is, and then a lot of couples discuss it among themselves to decide what they want to achieve. Then they come with their practical realities, and we basically make it legal,\" she said. Read more from Money:Fans lose £16,500 on Glastonbury ticketsSeven things you might not know about Elon MuskWhat happens now to Trump's tariffs? \"Any earlier and you risk the financial disclosure then being out of date, which doesn't help.\" Sir Paul said that when dealing with a high net worth family, the whole process could cost upwards of £10,000. But in typical cases, people should be thinking \"in terms of thousands\" for the final cost. While people are less likely to find conversations around prenups uncomfortable nowadays, talking about money can still be difficult. Amy Harris, legal director at advisory firm Brabners Personal, said having a chat about prenups tends to be easier when the issue is family money or inherited wealth. \"A prenup is sometimes a condition of them receiving any gifts or inheritance at all; it therefore comes across less personal between the couple themselves,\" she said. \"We find that having full and frank financial discussions at the start of marriage can be enlightening and a good basis upon which to start their future together - with openness and transparency and a commitment to dealing with separation as amicably as possible. \"It is also important to remember that these agreements often work both ways in terms of any provisions that protect the prior assets of one party, which can also protect the prior assets of the other.\""
    },
    {
        "title": "AI, robots, lasers and gap years in armed forces: Key details as UK to become 'battle ready'",
        "description": "The UK must rebuild its military and get the whole country ready for war as the threat of conflict with a nuclear power like Russia or China is real, a major defence review warns.",
        "url": "https://news.sky.com/story/ai-robots-lasers-and-gap-years-in-armed-forces-key-details-as-uk-to-become-battle-ready-13378251",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-british-army_6834246.jpg?20250220015606",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-06-02 14:27:00",
        "Headline": "Sir Keir Starmer warns of a \"new era of threats\" that demands a \"new era for defence and security\", as the Strategic Defence Review is published.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The UK must rebuild its military and get the whole country ready for war as the threat of conflict with a nuclear power like Russia or China is real, a major defence review warns. It described what might happen should a hostile state start a fight, saying this could include missile strikes against military sites and power stations across the UK, sabotage of railway lines and other critical infrastructure and attacks on the armed forces. Politics latest:  Britain must be 'battle-ready', says PM  In a devastating verdict on the state of Britain's defences, the Strategic Defence Review (SDR) said today's armed forces are \"not currently optimised for warfare\", with inadequate stockpiles of weapons, poor recruitment and crumbling morale. \"The international chessboard has been tipped over,\" a team of three experts that led the review wrote in a foreword to their 140-page document. \"In a world where the impossible today is becoming the inevitable tomorrow, there can be no complacency about defending our country.\" Sir Keir Starmer, who commissioned the review, described a \"new era\" of threat that required a \"new era for defence and security\". \"Every part of society, every citizen of this country, has a role to play because we have to recognise that things have changed,\" the prime minister said. The review made a list of more than 60 recommendations to enable the UK to \"pivot to a new way of war\". They include: General Sir Richard Barrons, part of the review team and a former senior military officer, described the vision as \"the most profound change\" to UK defences in 150 years.  But there were some notable gaps - likely caused by limited finances. This includes only a brief mention of bolstering the UK's ability to defend against cruise and ballistic missiles - a key weakness but one that would be very expensive to fix. Earlier, Sir Keir said the review was a \"blueprint to make Britain safer and stronger, a battle-ready armour-clad nation, with the strongest alliances and the most advanced capabilities, equipped for the decades to come\". Defence Secretary John Healey, writing in a foreword to the document, said \"up to\" £1bn would be invested in \"homeland air and missile defence\" as well as the creation of a new cyber and electromagnetic warfare command. The review was drawn up with the expectation that defence spending would rise to 2.5% of GDP this parliament - up from around 2.3% now - and then to 3% by 2034. The government has pledged to hit 2.5% by 2027 but is yet to make 3% a cast iron commitment. Read more:UK to build weapons factoriesRussian-linked hackers targeted MoD The reviewers said their recommendations could be delivered in 10 years if that spending target is reached but they gave a strong signal that they would like this to happen much sooner. \"As we live in such turbulent times it may be necessary to go faster,\" the team said. \"The plan we have put forward can be accelerated for either greater assurance or for mobilisation of defence in a crisis.\" The review described the threat posed by Russia as \"immediate and pressing\". It said China, by contrast, is a \"sophisticated and persistent challenge\". It pointed to Beijing's growing missile capability that can reach the UK and said the Chinese military's nuclear arsenal is expected to double to 1,000 nuclear warheads by 2030. The other two reviewers were Lord George Robertson, a former Labour defence secretary, and Fiona Hill, a Russia expert and former foreign policy adviser to Donald Trump. 👉Search for The Wargame on your podcast app👈 The review team warned the post Cold War-era of relative peace has ended and a time of contest, tension and conflict has returned. Adding to the pressure, the US - by far the most powerful member of the NATO alliance - is focusing more on the threat it sees from China. \"Changes in the strategic context mean that NATO allies may be drawn into war with - or be subject to coercion by - another nuclear armed state,\" the review said. \"With the US clear that the security of Europe is no longer its primary international focus, the UK and European allies must step up their efforts\". The review set out how defence is not only the responsibility of the armed forces because countries - not just the professional military - fight wars. It said: \"Everyone has a role to play and a national conversation on how we do it is required… As the old saying goes, 'If you want peace, prepare for war'.\" Sky News and Tortoise will launch a new podcast series - The Wargame - on 10 June that simulates a Russian attack on the UK to test Britain's defences, with former ministers and military chiefs playing the part of the British government."
    },
    {
        "title": "Rachel Reeves threatens to sue Roman Abramovich over Chelsea FC sale proceeds",
        "description": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale.",
        "url": "https://news.sky.com/story/rachel-reeves-threatens-to-sue-roman-abramovich-over-chelsea-fc-sale-proceeds-13378386",
        "image_url": "https://e3.365dm.com/21/01/1920x1080/skynews-roman-abramovich-chelsea_5249883.jpg?20210125130045",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-02 20:39:00",
        "Headline": "The £2.5bn proceeds from the sanctioned Russian oligarch's sale of Chelsea FC are meant to help Ukraine but remain in a UK bank account.",
        "Content": "The chancellor and foreign secretary are threatening to take Roman Abramovich to court to seize the proceeds of his Chelsea FC sale. The Russian oligarch, who is sanctioned by the UK government over his alleged links to Vladimir Putin, sold Chelsea for £2.5bn to an American consortium in 2022, after Russia's invasion of Ukraine. Those funds remain in a frozen UK bank account but are meant to be used for humanitarian causes linked to the Ukraine war. Chancellor Rachel Reeves and Foreign Secretary David Lammy have now said they are \"deeply frustrated\" an agreement cannot be reached with the oligarch and will take him to court if it cannot be dealt with soon. In a joint statement, they said: \"The government is determined to see the proceeds from the sale of Chelsea Football Club reach humanitarian causes in Ukraine, following Russia's illegal full-scale invasion. \"We are deeply frustrated that it has not been possible to reach agreement on this with Mr Abramovich so far. \"While the door for negotiations will remain open, we are fully prepared to pursue this through the courts if required, to ensure people suffering in Ukraine can benefit from these proceeds as soon as possible.\" Read more:Russians react to Ukraine's drone attackPutin humiliated by 'Russia's Pearl Harbor' - analysisZelenskyy: Strikes will go 'in history books' Abramovich was forced to sell Chelsea - which he bought for a reported £140m - after 19 years of ownership, after being sanctioned by the government over his alleged close ties to the Russian president - something he denies. The sale was made under the supervision of the Office of Financial Sanctions Implementation, under the proviso the proceeds go to humanitarian aid in Ukraine. They cannot be moved or used without a licence from the office.  In March, the Foreign Office said officials were in talks with Abramovich's representatives, but multiple sources told the BBC there had been no meetings between any Labour ministers and members of the foundation set up to oversee the funds since last July's general election. They said there was a deadlock and a political decision by a minister is needed to negotiate and sign off an agreement. It is not known if there has been meetings in the three months since then. The £2.5bn - and interest accrued - would make up for some of the reduction in the aid budget, announced in February."
    },
    {
        "title": "Fourth man arrested over fires at properties and car linked to Keir Starmer",
        "description": "A fourth man has been arrested over a series of fires at properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/fourth-man-arrested-over-fires-at-properties-and-car-linked-to-keir-starmer-13377582",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250520091039",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-02 09:00:00",
        "Headline": "The 48-year-old man was detained at London Stansted Airport and is being questioned on suspicion of conspiracy to commit arson with intent to endanger life, the Metropolitan Police says.",
        "Content": "A fourth man has been arrested over a series of fires at properties and a car linked to Prime Minister Sir Keir Starmer. The 48-year-old man was detained at London Stansted Airport on Monday and is being questioned on suspicion of conspiracy to commit arson with intent to endanger life, the Metropolitan Police said. Three other men have been charged over the fires: Ukrainians Petro Pochynok, 34, and Roman Lavrynovych, 21, and Ukrainian-born Romanian national Stanislav Carpiuc, 26. Lavrynovych is charged with three counts of arson with intent to endanger life, while Pochynok and Carpiuc are accused of conspiring to commit arson with intent to endanger life. They are due to appear at the Old Bailey on Friday. It comes after a fire in the early hours of 12 May at a house in Kentish Town, north London, where Sir Keir lived with his family before the election.  Damage was caused to the property's entrance, but nobody was hurt. A car was also set alight in the same street on 8 May. Read more from Sky News:Mount Etna erupts, sending tourists fleeingNew searches in Madeleine McCann case Another fire took place on 11 May at the front door of a house linked to Sir Keir that was converted into flats in Islington. One person was taken to safety by crews wearing breathing apparatus."
    },
    {
        "title": "Starmer couldn't be clearer: Britain must prepare for war",
        "description": "Clement Attlee was the Labour prime minister credited with creating the welfare state.",
        "url": "https://news.sky.com/story/starmer-wants-uk-to-be-a-warfare-ready-state-but-how-does-that-balance-with-the-welfare-state-13378208",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-beth-rigby_6933158.jpg?20250602133605",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-02 12:53:00",
        "Headline": "To spend 3% of GDP on defence, the PM needs to find an extra £13bn. That's difficult, especially when the government could U-turn on some welfare cuts.",
        "Content": "\n          Political editor\n              @BethRigby\n  Clement Attlee was the Labour prime minister credited with creating the welfare state. On Monday, at a shipbuilding yard in Glasgow, Sir Keir Starmer presented himself as a Labour prime minister who wants to be credited with turning the UK into a warfare-ready state, as he spoke of the need for the UK to be prepared for the possibility of war at the launch of his government's Strategic Defence Review. The rhetoric couldn't be clearer: Britain is on a wartime footing. The UK's armed forces must move to \"war-fighting readiness\" over the coming years, the UK faces a \"more serious and immediate\" threat than anytime since the Cold War, and \"every citizen must play their part\". Politics latest: Britain must be 'battle-ready' The prime minister promised to fulfil the recommendations of the 10-year strategic defence plan, which will be published in full on Monday afternoon. But what he refused to do was explain when he would deliver on spending 3% of GDP on defence - the commitment necessary to deliver the recommendations in the Strategic Defence Review.  PM is sticking plasters over wounds His refusal to do so blunts his argument. On the one hand, the prime minister insists there is no greater necessity than protecting citizens, while on the other hand, he says his ability to deliver 3% of spending on defence is \"subject to economic and fiscal conditions\". This is a prime minister who promised an end to \"sticking plaster politics\", who promised to take difficult decisions in the interest of the country. One of those difficult decisions could well be deciding, if necessary, to cut other budgets in order to find the 3% needed for defence spending. Instead, the prime minister is sticking plasters over wounds. After voters lashed out at Labour in the local elections, the Starmer government announced it was going to look again at the cut to pensioners' winter fuel allowance. There is an expectation, too, that Sir Keir is planning to lift the two-child cap on benefits. Refusing to lift the cap was one of his hard choices going into the election, but now he is looking soft on it.  👉Listen to Politics at Sam and Anne's on your podcast app👈 What choices is Starmer prepared to make? That's why I asked him on Monday what the choices are that he's going to make as prime minister. Is his choice properly-funded defence, or is it to reverse winter fuel cuts, or lift the two-child benefit cap? If he needs to be the prime minister creating the warfare state, can he also deliver what voters and his own MPs want when it comes to the welfare state? Read more:PM won't set 'arbitrary date' for defence spending boostBritain has 'lost control' of its bordersFarage has 'grabbed the mic' to dominate media agenda To hit the 3% target, Sir Keir would have to find an extra £13bn. That's difficult to find, and especially difficult when the government is reversing on difficult decisions its made on cuts. For now, the prime minister doesn't want to answer the question about the choices he's perhaps going to make. But if he is really clear-eyed about the security threat and what is required for the UK to become ready for war, it is question he is going to have to answer."
    },
    {
        "title": "Will Scotland ride the 'Farage tsunami' at the Hamilton by-election like England has with Reform?",
        "description": "Nigel Farage has a track record of noisy, messy campaign visits to Scotland.&#160;",
        "url": "https://news.sky.com/story/will-scotland-ride-the-farage-tsunami-at-the-hamilton-by-election-like-england-has-with-reform-13378248",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nigel-farage-connor-gillies_6933231.jpg?20250602154543",
        "type": "Politics",
        "Author": "Connor Gillies",
        "Date Published": "2025-06-02 14:27:00",
        "Headline": "Reform, Labour and the Conservatives are all battling against the SNP in this Thursday's by-election on the outskirts of Glasgow.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  Nigel Farage has a track record of noisy, messy campaign visits to Scotland.  After being famously hounded out of an Edinburgh pub in 2013, on Monday came the Aberdeen media conference in a fish restaurant to the soundtrack of \"Farage is a racist\" chants outside from the small, but vocal crowd. \"We've not had this (protests) for a long time,\" Mr Farage tells me while the cameras are setting up for our Sky News interview. Politics latest: Britain must be 'battle ready', PM says Mr Farage came to northeast Scotland with a spring in his step as Reform UK surges in the Scottish polls. One even suggests his party could become the official opposition to the SNP in Holyrood in 2026. A humiliating prospect for Labour and the Conservatives. The Reform leader has notably pivoted his attacks on the \"Scottish establishment\" in recent weeks ahead of a by-election in Hamilton, Larkhall and Stonehouse this Thursday. SNP chief John Swinney is churning out almost daily press releases about Mr Farage claiming he \"doesn't care about Scotland\". Meanwhile Scottish Labour leader Anas Sarwar branded the Reform boss a \"pathetic little man\". \n                  Reform UK to accept crypto donations, Farage says\n                 \n                  Farage steps in while parliament is out\n                 \n                  Nigel Farage's 'fantasy' policies will lead to Liz Truss-style economic meltdown, Sir Keir Starmer to warn\n                 This week's by-election will be a barometer of where Reform support potentially sits more nationally. The SNP and Labour are privately nervous. But Scotland, it seems, is not riding the same \"Farage tsunami\" as England. He alleges he is capitalising on the disenfranchisement in Scottish politics at the moment, yet the polls suggest the SNP could still storm to power again next year and enter their third decade in power. Mr Sarwar and Mr Farage have been at loggerheads in a bitter war of words over an old speech the Scottish Labour leader gave, where he talked about minority communities. There is no doubt that Reform has taken that footage out of context as part of a political game. Read more:Starmer warns about Farage's 'fantasy policies'Farage says it's 'utterly ludicrous' to allow abortion up to 24 weeks  Mr Farage is playing down Reform's chances, saying his party is a \"teenager that hasn't reached maturity yet\". Is that code for dodging scrutiny on policy detail? Sir Keir Starmer would be humiliated by defeat from a \"teenager\" this week in Scotland. It would have been inconceivable Mr Farage would have been taking up so much political bandwidth even a year ago in Scotland, given the country notoriously rejected his politics for more than a decade. It is a remarkable charge in narrative, but Reform is yet to win any major seat north of the border. The full list of candidates: • Collette Bradley, Scottish Socialist Party• Andy Brady, Scottish Family Party• Ross Lambie, Reform UK• Katy Loudon, SNP• Janice MacKay, UKIP• Ann McGuinness, Scottish Greens• Aisha Mir, Scottish Lib Dems• Richard Nelson, Scottish Conservatives• Davy Russell, Scottish Labour• Marc Wilkinson, independent The by-election takes place on 5 June."
    },
    {
        "title": "Defence review: 'War ready' - but for what war?  ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/defence-review-war-ready-but-for-what-war-13378213",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-daily-podcast-submarine_6933085.jpg?20250602121604",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-02 12:53:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 The prime minister has launched a 10-year Strategic Defence Review setting out how Britain will operate in an ever-more worrying geopolitical environment. Sir Keir Starmer said \"every citizen has a role to play\" in \"defence of the realm\", but do we know what kind of war we're preparing for? On today's Sky News Daily, Niall Paterson is joined by Sky's defence editor Deborah Haynes and military analyst Michael Clarke to discuss whether the defence review meets the mark. Producer: Emily HulmeEditor: Philly Beaumont"
    },
    {
        "title": "Starmer says he won't set 'arbitrary date' for spending 3% of GDP on defence",
        "description": "Sir Keir Starmer has refused to say when the government could hit its \"ambition\" to spend 3% of GDP on defence amid questions over where the money will come from.",
        "url": "https://news.sky.com/story/starmer-says-he-wont-set-arbitrary-date-for-spending-3-of-gdp-on-defence-13378107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-sdr-defence_6933048.jpg?20250602110820",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-02 09:52:00",
        "Headline": "The prime minister said he will set out a timeline for further spending on defence when he knows how he will achieve it.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has refused to say when the government could hit its \"ambition\" to spend 3% of GDP on defence amid questions over where the money will come from. The prime minister told a news conference in Glasgow that he is \"not going to put arbitrary dates\" on that figure and a timeline will only be set out when he knows how he will achieve it. Politics live: 'Every citizen has a role to play' in putting UK on war footing, says PM Sir Keir was speaking ahead of the publication of the Strategic Defence Review (SDR), which will recommend moving the armed forces to \"warfighting readiness\" to deter growing threats facing the UK. Sky News understands the recommendations require investment to rise to at least 3% of national income by 2034. The government has described this as its \"ambition\" but its current target is only 2.5% by 2027. Sir Keir on Monday said that 3% is \"what we want to achieve\" and the government will set a date \"when we know exactly how we could achieve it\". \n                  Strategic Defence Review: UK 'moving to warfighting readiness' as it commits to build attack submarines\n                 \n                  Britain has 'lost control' of its borders, defence secretary tells Sky News\n                 \n                  New UK weapons factories to be built 'very soon', Defence Secretary John Healey reveals\n                 \"I'm not going to put arbitrary dates on that percentage,\" he said. He refused to rule out further reductions to the aid budget to fund the extra increase, only saying: \"The best way to pay for an increase in any public spending is to grow our economy, and that is the focus when it comes to defence, or any other spending.\" Sir Keir faced a backlash in February when he slashed the foreign aid budget by £6bn per year to meet the 2.5% GDP defence spending target, which was in Labour's manifesto. Justifying more money for defence poses a challenge as the government has made a number of controversial spending cuts to balance the books, including axing universal winter fuel payments and reducing eligibility for disability benefits. However, defence chiefs have expressed concerns about the preparedness and resilience of the UK's armed forces amid growing threats from hostile states.  Sir Keir also faces international pressure, as President Trump wants Washington's NATO allies to spend 5% of GDP on their armed forces while Mark Rutte, the head of the alliance, is pushing for 3.5% by 2032. '100% confident plans can be delivered' The SDR was commissioned by Labour shortly after it took office and carried out by external experts outside of government. Read more:Britain has 'lost control' of its borders, defence secretary tells Sky NewsNew UK weapons factories to be built 'very soon' 👉Listen to Politics at Sam and Anne's on your podcast app👈 The government has said it will build six new munitions factories and \"up to\" 12 new nuclear attack submarines, spending £15bn on the nuclear programme in total.  Sir Keir said he is \"100% confident\" the SDR could be delivered on current funding plans, saying its terms of reference were set \"on the premise that we would be spending 2.5% of GDP on our defence\". He called the document a \"blueprint to make Britain safer and stronger, a battle-ready armour-clad nation, with the strongest alliances and the most advanced capabilities, equipped for the decades to come\". He also spoke about a \"defence dividend\" of the extra billions being spent, saying the plans will create thousands of highly skilled jobs. However, shadow defence secretary James Cartilage said a \"vague\" promise to reach 3% \"is not good enough... and it calls into question all the promises we're going to hear today on the SDR\". The Liberal Democrats' leader Ed Davey accused the prime minister of showing a \"concerning lack of urgency on reaching 3%\". He called for \"cross-party talks to allow us to get to 3% as soon as possible, and faster than 2034\"."
    },
    {
        "title": "Starmer puts UK on war footing",
        "description": "  <a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/june-2025-the-month-that-will-shape-the-course-of-labours-power-13378019",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-02 05:02:00",
        "Headline": "No subtitle found",
        "Content": " 👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. This time last year, Labour and the Conservatives were in the throes of an era-defining election campaign that would end in Sir Keir Starmer winning an extraordinarily large majority. The Reform Party was little more than a buzzing bee amid the backdrop of the UK political landscape. Spin forward 12 months, and how much things have changed. June 2025 marks the start of a crucial month for Sir Keir's Labour Party, with decisions due across a number of departments that will shape the course of this political era. In the coming weeks, we'll see a security strategy, a 10-year NHS strategy, an industrial strategy, and much more - all tied to next week's spending review. Today, it's the turn of military spending, as Defence Secretary John Healey reveals his 'first of a kind' Strategic Defence Review. But does it live up to the billing, and will this make the UK war-ready if Russia's invasion of Ukraine goes further?"
    },
    {
        "title": "UK has warmest spring on record, Met Office says",
        "description": "The UK has had its warmest spring on record - and its driest for 50 years, the Met Office has said.",
        "url": "https://news.sky.com/story/uk-has-warmest-spring-on-record-met-office-says-13378253",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-weather-southend-warm_6902759.jpg?20250501161746",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-02 14:44:00",
        "Headline": "Temperature records are broken in all four UK nations - as the Met Office says the country's climate \"continues to change\".",
        "Content": "The UK has had its warmest spring on record - and its driest for 50 years, the Met Office has said. Provisional figures showed spring temperatures surpassed the long-term average by 1.4C - with a mean temperature of 9.5C (49.1F). That beat the previous warmest spring recorded in 2024. Temperature records were broken in all four nations in the UK - with 1.64C above the long-term average in Northern Ireland, 1.56C above average in Scotland, 1.39C in Wales and 1.35C in England. In records dating back to 1884, the Met Office said eight of the 10 warmest springs had occurred since 2000 - and the three warmest had been since 2017, in a sign of the changing climate. Find out the forecast for your area Last week, the Met Office revealed the UK had recorded its sunniest spring on record - with 630 hours of sunshine from 1 March to 27 May, beating 2020's record by four hours. In an update on Monday, the weather forecaster said there had been a total of 653.3 hours of sunshine in March, April and May - 43% above average, and sunnier than all springs since records began in 1910. \"To put this into context, Spring 2025 is now the fourth sunniest season overall for the UK, with only three summers sunnier since 1910,\" it added.  Conditions were also incredibly dry with an average of 128.2mm of rain falling in the UK across March, April and May - the lowest spring total since 1974, which saw 123.2mm. Met Office scientist Emily Carlisle said \"the UK's climate continues to change\". \"This spring shows some of the changes we're seeing in our weather patterns, with more extreme conditions, including prolonged dry, sunny weather, becoming more frequent,\" she said. \"The data clearly shows that recent decades have been warmer, sunnier, and often drier than the 20th century average, although natural variation will continue to play a role in the UK's weather.\" Read more from Sky News:Mount Etna erupts, sending tourists fleeing'One in six species at risk of extinction' in this UK nation It comes after the Met Office warned the UK is set for a hotter than usual summer - with an increased risk of heatwaves over the next three months."
    },
    {
        "title": "Exercise may benefit colon cancer patients as much as some drugs, study finds",
        "description": "Regular exercise after treatment cuts the risk of death in cancer patients by more than a third, a new study has found.",
        "url": "https://news.sky.com/story/exercise-may-benefit-colon-cancer-patients-as-much-as-some-drugs-study-finds-13378099",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-park-run-running-exercise_6933063.jpg?20250602113315",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-02 09:33:00",
        "Headline": "The large trial has been hailed as an \"exciting breakthrough\" that could \"transform\" medical practice. But its recommendations may not be adopted.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Regular exercise after treatment cuts the risk of death in cancer patients by more than a third, a new study has found. Sports and movement could help stop the disease from coming back, as well as boosting mood, energy levels and strength, researchers found in a trial which could \"transform\" medical practice. Various types of moderate intensity exercise met the bar, including 40 minutes of brisk walking, a half-hour jog, circuit classes, cycling, or swimming. What did the study involve? The CO21 Challenge trial recruited 889 people with colon cancer from six countries, including the UK. All patients had had surgery and chemotherapy for their cancer and were deemed well enough to exercise, but were not very active. One group was given a highly tailored three-year exercise programme, which included in-person coaching sessions for the first six months, and regular meetings with a physical activity consultant. The other group were simply offered materials promoting exercise and nutrition. After five years, the risk of dying, relapse or developing a new cancer was 28% lower in the group with bespoke exercise plans - even though adherence to the programme decreased. And after eight years, the risk of death had fallen to 37%.  Margaret Tubridy from North Belfast said she was \"chuffed to bits\" after taking part in the study. \"I had never been to a gym before, but once I was shown how to use the machines and do the exercises, I loved it,\" the 69-year-old said. \"Now I do weight training twice a week, pole walking, and I'm in a walking group... I am stronger, fitter, and my anxiety is better.\" The paper adds to a stash of evidence of the multifarious benefits of exercise, from treating depression to reducing the chances of dementia. Read more from Sky News:Gangs using rented houses and flats for cannabis farmsEight injured in petrol bomb and 'flamethrower' attack at rally Professor David Sebag-Montefiore from Leeds University, who was not involved with the new study, called it an \"exciting breakthrough\". The \"great appeal\" of such exercise is that it \"offers the benefits without the downside of the well-known side effects of our other treatments\". Why recommendations might not be adopted Colon cancer kills around 9,500 people a year in the UK. Dr Marco Gerlinger, professor of gastrointestinal cancer medicine at Queen Mary University of London, said the results indicate that \"exercise has a similarly strong effect as previously shown for chemotherapy, which is really quite impressive\". \"The exercise is after patients have completed their chemotherapy, so it can't replace it,\" he told Sky News. \"But the effect size of exercise is similar to what chemo achieves. So it's not a replacement, but further reduces the risk.\" Patients are usually keen to know what they can do to reduce the chances of the cancer returning, he added. \"Oncologists can now make a very clear evidence-based recommendation.\" But he said support from a professional would very likely be necessary, and other experts raised concerns about the costs of labour-intensive programmes. Caroline Geraghty, senior specialist information nurse at Cancer Research UK, which part-funded the CO21 Challenge through Stand Up To Cancer, said: \"This trial has the potential to transform clinical practice, but only if health services have the necessary funding and staff to make it a reality for patients.\" Dr Joe Henson, associate professor in lifestyle medicine at the University of Leicester, said: \"Leading the exercise sessions in Leicester, I saw first-hand that this reduced fatigue, lifted people's mood, and boosted their physical strength. \"We know that physical activity regulates several key biological processes that could explain these results, and further research will help us uncover why exercise is having such a positive impact.\" The findings were published yesterday in the New England Journal of Medicine."
    },
    {
        "title": "New law to tackle 'nature emergency' in Wales - where 'one in six species at risk of extinction'",
        "description": "A new independent body could be created to oversee how environmental law is implemented in Wales, bringing the country in line with the rest of the UK.",
        "url": "https://news.sky.com/story/new-law-to-tackle-nature-emergency-in-wales-where-one-in-six-species-at-risk-of-extinction-13378220",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wales-pembrokeshire_6933254.jpg?20250602162457",
        "type": "Technology",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-02 12:52:00",
        "Headline": "However campaigners say the legislation, which must first be approved by the Senedd, doesn't go far enough.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n A new independent body could be created to oversee how environmental law is implemented in Wales, bringing the country in line with the rest of the UK. The Office of Environmental Governance Wales will be tasked with making sure public authorities, such as the Welsh government, Natural Resources Wales and councils are complying with the law. But campaigners say the legislation, which must first be approved by the Senedd, doesn't go far enough. England and Northern Ireland have been covered by the Office for Environmental Protection since 2021. The Scottish government set up Environmental Standards Scotland in the same year, leaving Wales as the only UK nation without a similar body. The Environment (Principles, Governance and Biodiversity Targets) (Wales) Bill has been laid before the Senedd on Monday. The bill is also set to enable Welsh government ministers to set \"ambitious biodiversity targets\".  Deputy first minister Huw Irranca-Davies said the bill was \"crucial legislation that will empower us to address climate and nature emergencies\". \"With one in six species now at risk of extinction in Wales, it has never been more important to restore nature and preserve the natural environment for future generations,\" he added. The RSPB has said the bill is a \"good start\" but that it would like to see the government \"go even further\". Read more from Sky News:Mount Etna erupts as tourists fleeRace Across The World contestant dies aged 24 Annie Smith, RSPB Cymru's head of nature policy and casework, said the bill \"must drive the urgent actions needed to clean up the environment and restore nature in Wales\". \"Having declared a nature emergency, this Senedd must ensure its legacy includes a strong response for nature,\" she added."
    },
    {
        "title": "'I might not make it': Sarah Jessica Parker on the stress of reading two books a day",
        "description": "Sarah Jessica Parker was the subject of some unwanted headlines over the past few weeks after saying she reads two books a day.",
        "url": "https://news.sky.com/story/i-might-not-make-it-sarah-jessica-parker-on-the-stress-of-reading-two-books-a-day-13378279",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sarah-jessica-parker_6933345.jpg?20250602181837",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-06-02 15:47:00",
        "Headline": "Sarah Jessica Parker, Cynthia Nixon, Kristin Davis, Nicole Ari Parker and Sarita Choudhury return for the third season of And Just Like That, the spin-off to the hit franchise Sex And The City.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Sarah Jessica Parker was the subject of some unwanted headlines over the past few weeks after saying she reads two books a day. While speculation of her reading capabilities circulates, the actress continues the challenging mountain of novels she has to get through in order to be a judge for the Booker Prize. The actress is part of a panel of judges for the literary award which announces the \"Booker Dozen\" of 12 or 13 books on 29 July, its shortlist on 23 September and the overall winner on 10 November. The winner receives £50,000. \"I have one by my side now,\" Sarah Jessica tells Sky News during an interview for her show And Just Like That. \"It's been hard these last two weeks because we've been promoting the show and I thought I would be able to read between interviews, but you can read two words. You can read these three sentences, so I'm feeling very anxious about how many books I have yet to read for our next deliberation,\" she says. The Sex And The City actress compares the workload to preparing to take an exam. \"I've not ever felt this behind, including in high school. Like, I really am not entirely sure how I'm going to read the required amount of books by our next deliberation,\" she says. \n                  King Of The Hill and Parks And Recreation actor Jonathan Joss shot dead in Texas\n                 \n                  Race Across The World contestant Sam Gardiner dies aged 24 \n                 \n                  Mountainhead: Succession writer Jesse Armstrong's new film takes aim at tech billionaires\n                 \"I thought about this last night in bed, that even if I stay up every day and don't sleep, I might not make it. So I'm not sure how. I have to not make dinner for anybody, not do anybody's laundry. I have cut out all tasks. So we'll see. It's pretty fantastic, this burden is pretty wonderful.\" Turning to her spin-off series, she says she never paid much attention to the cultural impact Sex And The City had on portraying women in their 30s on screen without a rose-tinted lens. \"I think we're just always wanting to tell interesting stories,\" she says. \"And the rule in the writing room has been, for as long as I've known, the story can only be as far removed as one person from the writer, so every single story told has either happened to a writer or to a friend or family member or colleague of the writer.\" She says what makes it real is that the show deals with real moments that happen to women as they age, from children flying the nest to navigating the dating pool. \"You don't flat line at 50 or 60. People are living pretty colourful, interesting, exciting lives and they have influence and authority. They're trying new things. They're leaving marriages. They're saying goodbye to kids. They're starting new jobs, they're leaving jobs, and they're getting married, they are widows, there's just endless amounts to talk about and it should be,\" she says. 'It is insane there aren't more shows like us' Her co-star Kristin Davis agrees and states her main hope for returning was to break certain taboos for women now in their 50s. \"It is insane that there aren't more shows like us, you know? I'm hoping that there will be,\" she says. \"It's very interesting that somehow women, especially at a certain age, you're just supposed to just vanish. I don't know where we're supposed to be and that just makes no sense.\" Sex And The City was 'incredibly white', says Cynthia Nixon For Cynthia Nixon, playing Miranda now as a lesbian character allowed the show to explore the challenges that face people coming out later in life and navigating the world they find themselves in. She says although Sex And The City broke taboos for white women in their 30s, she felt the original iteration of their show wasn't as reflective of the real world as it could have been. \"The one thing that didn't really sit well with me in the past was how incredibly white the show was,\" she says. \"So, I think to expand the universe of, you know, who gets to be centred in the show has been a tremendous boon. Whether you're talking about people of colour, whether you're talk about queer people, people of different ages. We used to have a wonderfully fascinating lens, but it was fairly narrow. \"We've moved in our view of queer people… for so long, if you wanted to put a gay person on screen, one of the ways to make them palatable was to really emphasise their funniness and I think we have many very funny gay characters, but we're able to, I think, have a more well-rounded view of them.\" And Just Like That is available on Sky and NOW."
    }
]