[
    {
        "title": "New photos of Jeffrey Epstein's circle among thousands of files released",
        "description": "New photos of the people in Jeffrey Epstein's circle are among thousands of documents released by the US Department of Justice. ",
        "url": "https://news.sky.com/story/new-photos-of-jeffrey-epsteins-circle-among-tranche-of-300000-pages-released-13485744",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-michael-jackson-jeffrey-epstein_7115395.png?20251219215335",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 21:29:00",
        "Headline": "The documents, which include a host of famous faces, such as Michael Jackson, were made public hours before a legal deadline in the US following the passing of the Epstein Files Transparency Act.",
        "Content": "New photos of the people in Jeffrey Epstein's circle are among thousands of documents released by the US Department of Justice.  The tranche of material relating to the dead paedophile financier was made public shortly after 9pm UK time - hours before a legal deadline in the US following the passing of the Epstein Files Transparency Act. They include images of his former girlfriend Ghislaine Maxwell, who is serving a prison sentence after she was found guilty of child sex trafficking and other offences in connection with Epstein in 2021. Follow live updates: What's in latest documents  In one picture, she is seen posing outside 10 Downing Street, while in another, she is pictured in a swimming pool with Bill Clinton and a woman, whose face has been obscured. The former US president is also pictured in a hot tub with an unidentified woman in another picture, while a separate image shows a painting of Mr Clinton wearing a blue dress with red high heels. The context of the photos is unknown and being identified in the files does not suggest any wrongdoing. In his 2024 memoir, Citizen: My Life After The White House, Mr Clinton wrote: \"The bottom line is, even though it allowed me to visit the work of my foundation, travelling on Epstein's plane was not worth the years of questioning afterward. I wish I had never met him.\" Mr Clinton's former deputy chief of staff, Angel Urena, issued a statement after the files were released, saying the White House had been \"hiding\" the files to \"shield themselves\". \"This isn't about Bill Clinton. Never has, never will be,\" he said. \"There are two types of people here. The first group knew nothing and cut Epstein off before his crimes came to light. The second group continued relationships with him after. We're in the first.\" 'Masseuse list' Many of the documents in the release have been heavily redacted, including a \"masseuse list\", in which all 254 entries have been blacked out. All 119 pages of a grand jury document are redacted in their entirety, while scores of women's portraits, many of which appear to show them in sexual positions or are titled \"nude\", are blacked out. There are also handwritten notes, flight logs, and a contact book. Another file features a scrapbook featuring pictures of Epstein and redacted pictures of women, with the caption on one page: \"Is my cover blown?\" The US deputy attorney general, Todd Blanche, said in a letter to Congress that more than 1,200 victims and their families were identified during a review of the records, which have been redacted to protect victims. Celebrities including the late Michael Jackson, Rolling Stones frontman Sir Mick Jagger, Motown singer Diana Ross and comedian Chris Tucker are among those pictured in the files. There is no suggestion of any wrongdoing by them. Andrew Mountbatten-Windsor, who was stripped of his royal titles following controversy over his relationship with Epstein, and his ex-wife Sarah Ferguson, also appear. The former duke has been dogged by allegations that he sexually assaulted then 17-year-old Virginia Giuffre after she was trafficked by Epstein. He has always denied the accusations and any wrongdoing. He paid millions to Ms Giuffre, whom he claims to have never met, to settle a civil sexual assault claim in 2022. Andrew photo was taken inside a royal residence In one picture from the newly released files, the former prince is seen lying across five women, whose faces have been redacted, while Maxwell is stood behind smiling. The photo was taken from inside a royal residence. Sky News teams identified the location by comparing the fireplace in the background to previous photos taken in the castle. Several charities cut ties with Ms Ferguson after it emerged she had written a gushing message to Epstein, describing him as her \"supreme friend\". Her spokesperson said she wrote the note because he had threatened to sue her. Another Epstein associate, Lord Mandelson, is pictured with the late sex offender blowing the candles out on a birthday cake. It is a picture that has been published before. Lord Mandelson was fired as the ambassador to the US in September over his links to Epstein. Among the hundreds of photos included in the files is one of Epstein holding a copy of the Strange Case Of Dr Jekyll And Mr Hyde by Robert Louis Stevenson. Epstein appears to be lying on a sun lounger with the book resting on his chest, with part of the photo redacted by the justice department. The released files also included a complaint form issued against Epstein in September 1996, in which he is accused of threatening to \"burn [the complainant's] house down\". The character of the case is listed as \"child pornography\". The complainant stated that she is a professional artist and took pictures of her sisters aged 12 and 14 for her own personal art work. She said that Jeffrey Epstein stole the photos and negatives \"and is believed to have sold the pictures to potential buyers\". \"Epstein at one time requested to take pictures of young girls at swimming pools,\" the document states. \"Epstein is now threatening [redacted] that if she tells anyone about the photos he will burn her house down.\" There is \"strikingly\" little to no mention of Donald Trump in this initial drop, according to Sky News' US correspondent James Matthews. \"We know he is in the files - we've been told that by his chief of staff. But stick Donald Trump into the search engine and it comes back with nothing,\" Matthews said. \"So I assume we have to wait until tranche number two at least before we learn about Trump's involvement.\" Mr Trump denies knowledge and involvement in Epstein's criminality."
    },
    {
        "title": "US launches 'large-scale' strikes to 'eliminate' Islamic State fighters in Syria after US citizens killed in desert",
        "description": "The US has launched strikes to \"eliminate ISIS fighters, infrastructure, and weapons sites\" in Syria, according to defence secretary Pete Hegseth.",
        "url": "https://news.sky.com/story/us-launches-large-scale-strikes-to-eliminate-islamic-state-fighters-in-syria-after-us-citizens-killed-in-desert-13485788",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-syria-us-soldiers_7115506.jpg?20251219232918",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 22:48:00",
        "Headline": "The announcement came after three US citizens - two National Guard members and a civilian interpreter - were killed in an attack in the Syrian desert on 13 December.",
        "Content": "The US has launched strikes to \"eliminate ISIS fighters, infrastructure, and weapons sites\" in Syria, according to defence secretary Pete Hegseth. A US official described it as \"a large-scale\" strike that hit 70 targets in areas across central Syria that had IS infrastructure and weapons. \"This is not the beginning of a war - it is a declaration of vengeance. The United States of America, under President Trump's leadership, will never hesitate and never relent to defend our people,\" Mr Hegseth said in a social media post. The announcement came after three US citizens - two National Guard members and a civilian interpreter - were killed in an attack in the Syrian desert on 13 December. Three US personnel were also wounded, the Pentagon's chief spokesperson said on X. Donald Trump blamed the killings on Islamic State fighters. \"Because of ISIS's vicious killing of brave American Patriots in Syria, whose beautiful souls I welcomed home to American soil earlier this week in a very dignified ceremony, I am hereby announcing that the United States is inflicting very serious retaliation, just as I promised, on the murderous terrorists responsible,\" President Trump wrote on Truth Social. \"We are striking very strongly against ISIS strongholds in Syria, a place soaked in blood which has many problems, but one that has a bright future if ISIS can be eradicated.\" \n                  Counterterrorism review calls for Shamima Begum and other British-linked people in Syria to be repatriated\n                 \n                  Explosives and weapons seized - with 71 arrests - as Syria launches clampdown on Islamic State cells \n                 \n                  Historic al Nuri mosque reopens eight years after it was destroyed by IS\n                 He said the Syrian government was fully supportive of the US strikes against the Islamic State, warning that fighters \"will be hit harder than you have ever been hit before\". A US official said the US strike on Islamic State fighters on Friday was conducted using F-15 Eagle jets, A-10 Thunderbolt ground attack aircraft and AH-64 Apache helicopters. The official, who spoke on condition of anonymity to discuss sensitive operations, said more strikes should be expected."
    },
    {
        "title": "David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour",
        "description": "David Walliams has been dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women.",
        "url": "https://news.sky.com/story/david-walliams-dropped-by-publisher-harpercollins-uk-13485653",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/david-walliams-author-comedian_7115245.jpg?20251219185419",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 16:26:00",
        "Headline": "A spokesperson for the comedian and children's author said he \"strongly denies\" the claims. They also said the 54-year-old was taking legal advice.",
        "Content": "David Walliams has been dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women. A spokesperson for the company said it had decided not to release any new titles by Walliams \"after careful consideration, and under the leadership of its new CEO\". \"HarperCollins takes employee well-being extremely seriously and has processes in place for reporting and investigating concerns,\" they added. \"To respect the privacy of individuals, we do not comment on internal matters.\" In a statement later on Friday, a spokesperson for the comedian and children's author said: \"David has never been informed of any allegations raised against him by HarperCollins. \"He was not party to any investigation or given any opportunity to answer questions. David strongly denies that he has behaved inappropriately and is taking legal advice.\" It follows a report from The Telegraph that Walliams was dropped after an investigation into allegations of inappropriate behaviour towards young women. The 54-year-old, who shot to fame with the BBC sketch show Little Britain, is one of the country's best-selling children's writers. He has written more than 40 books, which have sold more than 60 million copies worldwide and been translated into 55 languages, according to his website. His first children's book, The Boy in the Dress, was published by HarperCollins in 2008, and he was awarded an OBE in 2017 for services to charity and the arts. Walliams is also known for Come Fly With Me, another BBC sketch show, and was formerly part of the judging panel for ITV's Britain's Got Talent. He left the show in 2022 after a recording of him making disparaging comments about contestants was leaked. The remarks were understood to have been both derogatory and sexually explicit, referring to one contestant as a \"c***\" and saying of another: \"She thinks you want to f*** her, but you don't\". Walliams later released a statement apologising for the \"disrespectful comments\" and saying they were private conversations that were never meant to be shared. HarperCollins UK announced in October that it had appointed Kate Elton as its new chief executive, following the departure of former boss Charlie Redmayne."
    },
    {
        "title": "Ukraine 'hits Russian tanker in Mediterranean Sea for first time'",
        "description": "Ukraine has struck a Russian tanker in the Mediterranean Sea for the first time, a Kyiv intelligence source has said.",
        "url": "https://news.sky.com/story/ukraine-hits-russian-tanker-in-mediterranean-sea-for-first-time-13485687",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-qendil-russian-tanker_7114978.jpg?20251219125225",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 18:23:00",
        "Headline": "Vladimir Putin claimed the attack would not disrupt supplies, but vowed that the Kremlin's forces would still retaliate. A Ukrainian intelligence source alleged the ship was being used to circumvent international sanctions.",
        "Content": "Ukraine has struck a Russian tanker in the Mediterranean Sea for the first time, a Kyiv intelligence source has said. The ship, called the Qendil, suffered \"critical damage\" in the attack, according to a member of the SBU, Ukraine's internal security agency. The tanker is said to be part of Russia's so-called \"shadow fleet\" - a group of ageing vessels that Kyiv alleges helps Moscow exports large quantities of crude oil despite Western sanctions. The ‌SBU source said Ukrainian ​drones hit the ship in neutral waters more than 2,000 kilometres (1,243 miles) ‌from Ukraine. They said: \"Russia used this tanker to circumvent sanctions and earn money that went to the war against Ukraine. \"Therefore, from the point of view of international law and the laws and customs of war, this is an absolutely legitimate target for the SBU. \"The enemy must understand that Ukraine will not stop and will strike it anywhere in the world, wherever it may be.\" The vessel ‍was empty at the time of the attack, the Ukrainian source added. Speaking during a live TV event, Vladimir Putin, the Russian president, claimed the attack would not disrupt supplies, but vowed that Russia would retaliate nonetheless. He added that Russia regularly responded with \"much stronger strikes\" against Ukraine. Putin also warned against any threat to blockade Russia's coastal exclave Kaliningrad, which he said would \"just lead to unseen escalation of the conflict\" and could trigger a \"large-scale international conflict\". Read more:The mercenaries fighting for RussiaBritish man who fought for Ukraine jailed Sky military analyst Michael Clarke said Ukraine's claim about causing significant damage to the ship was \"probably true\". He added: \"The Ukrainians obviously feel that they can legitimise this sort of operation.\" The attack comes after the European Union announced it would provide a €90bn (£79bn) interest-free loan to Ukraine. Oleksandr Merezhko, the chairman of the foreign affairs committee in the Ukrainian parliament, told Sky News that the money would \"tremendously enhance\" Kyiv's defensive capabilities. However, he said the International Monetary Fund estimated that Ukraine needed $137bn to \"keep running\". \"The aggressor should be punished\", Mr Merezhko added, as he argued that frozen Russian assets in Europe should be used to help fund his country's defence. He vowed that Ukraine would \"continue to fight\" for the move, adding that it was \"a matter of justice\"."
    },
    {
        "title": "Kylie Minogue secures her first Christmas number one in UK",
        "description": "Kylie Minogue has secured her first Christmas number one in the UK with her hit track XMAS.",
        "url": "https://news.sky.com/story/kylie-minogue-secures-her-first-christmas-number-one-in-uk-13485669",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kylie-minogue-christmas-number-one_7115103.jpg?20251219192806",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 17:13:00",
        "Headline": "The Australian pop star said that being top of the festive chart was \"the most wonderful gift\" and that she was grateful for everyone who had listened to her song and shared \"the love\".",
        "Content": "Kylie Minogue has secured her first Christmas number one in the UK with her hit track XMAS. The Australian pop star, 57, is the first solo female artist in 12 years to secure the coveted festive spot, after Sam Bailey with Skyscraper in 2013, according to The Official Charts Company. Minogue has also become the first woman to have number one singles across four different decades. Her success comes after two consecutive years in which Last Christmas by Wham! was top. Minogue said it was \"hard to put into words\" how special it felt to lead the singles chart. She said: \"Being Christmas number one really is the most wonderful gift. I'm so thankful to everyone who's been listening and sharing the love and I'm wishing you all a very Merry Christmas.\" Her single - pronounced X-M-A-S - is accompanied by a music video that shows Minogue teaching a dance to a group of children and adults. \n                  Will there be a white Christmas in the UK this year? \n                 \n                  Queen hosts festive tea for children with severe illnesses\n                 \n                  GCHQ releases annual Christmas puzzle - can you solve it?\n                 It also features a special appearance from Abba's Bjorn Ulvaeus. Xmas is followed in the singles chart by Last Christmas, with Mariah Carey's All I Want For Christmas Is You at three. The top five is completed by Brenda Lee's Rockin' Around The Christmas Tree at four and charity single Lullaby by Together For Palestine at number five - this week's highest new entry. Read more:The recipe for a Christmas number oneWham! make chart history Kylie has previously topped the singles chart on seven other occasions. Her other bestselling songs were I Should Be So Lucky (1988), Especially For You (1988), Hand On Your Heart (1989), Tears On My Pillow (1990), Spinning Around (2000), Can't Get You Out Of My Head (2001) and Slow (2003). Martin Talbot, chief executive of the Official Charts Company, said Minogue may now be placed to challenge Mariah Carey as the \"queen of Christmas\". He said: \"Congratulations to Kylie - what an amazing achievement by our adopted national treasure.\" The last Australian artist to earn the Christmas number one title was Oscar-winning actress Nicole Kidman, who collaborated with Robbie Williams on Somethin' Stupid in 2001."
    },
    {
        "title": "Woman jailed for plotting with lover to murder husband in caravan and make it look like suicide",
        "description": "A woman and her lover who plotted to kill her husband so they could continue their affair have both been jailed for 19 years.",
        "url": "https://news.sky.com/story/woman-who-plotted-with-lover-to-murder-her-husband-jailed-13485441",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-michelle-mills-geraint-berry_7114996.jpg?20251219131054",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 12:30:00",
        "Headline": "Police found gas masks, imitation guns and a fake suicide note purporting to be from Michelle Mills' husband.",
        "Content": "A woman and her lover who plotted to kill her husband so they could continue their affair have both been jailed for 19 years. Michelle Mills and Geraint Berry planned to murder Christopher Mills and make it look like suicide. They were found guilty of conspiracy to murder after a trial at Swansea Crown Court in October. A third person, Steven Thomas, was found not guilty of conspiracy to murder but pleaded guilty to a firearms charge. Police were called on 20 September last year to reports that masked men carrying guns, later found to be Berry and Thomas, had raided a static caravan in Cenarth, Ceredigion. Despite being badly beaten, Mr Mills was able to fight them off and they fled. Michelle Mills, 46, called 999 to say her husband had a head injury and claimed she did not know the armed men who broke in. Armed officers and a dog unit responded, and a police helicopter soon spotted Berry, 46, and Thomas, 47, hiding in undergrowth. While searching Berry and Thomas, officers found gas masks and a typed suicide note addressed to Mills purporting to have been written by her husband. Police quickly established that Mills, of Llangennech in Carmarthenshire, was linked to the plot. Digital evidence revealed she and Berry - a former Royal Marine - had been in a secret relationship for around three months and had discussed ways to kill Mr Mills. These included killing him with sleeping tablets, suffocating him in his sleep and poisoning him with antifreeze. Berry also looked into how to make his victim's Mini explode on start up. Police said when Berry told Mills he was meeting with some \"boys\" to plan \"what they are going to do with him\", she responded: \"Yes, lovely, thank you.\" Gas masks were 'to set up a fake suicide' Detective Inspector Sam Gregory said: \"Berry and Mills had previously discussed using gas to kill Mr Mills, while making it look like he had taken his own life. \"Berry had asked Mills where the boiler was, and he and Thomas carried gas masks that would have protected themselves while Mr Mills suffocated. \"No explanation has been given by any of the three defendants for the fake suicide note or the gas masks in the rucksack. \"What's clear is that these were not being used to frighten Mr Mills - they were there to set up a fake suicide.\" DI Gregory said the victim had no idea his wife of 10 years wanted him dead and believed they had a happy marriage. 'Your intention was to kill' Judge Mr Justice Nicklin KC said the pair had not shown any remorse and they were only concerned with not getting caught. \"You devised the plan and led its execution,\" he told Berry. \"You recruited Steven Thomas to assist you and while intoxicated, you equipped yourself with items that demonstrated your intention to kill Mr Mills and make it appear to be a suicide. \"However incompetent the plan was and how unlikely it was to be achieved, your intention was to kill.\" Read more from Sky News:Teen to face trial over murder of nine-year-old Aria Thorpe'Alien battleship' reaches closest point to Earth The judge told Michelle Mills she had encouraged her lover. He said: \"The evidence strongly suggests in the weeks leading up to the incident, you cultivated and exploited Geraint Berry's animosity towards your husband and encouraged him to find a way to get rid of your husband, not in fantasy but reality.\" The judge also praised Mr Mills' \"remarkable fortitude and courage\" in fighting off the pair. Steven Thomas was sentenced to 12 months but will be released immediately due to time served on remand."
    },
    {
        "title": "Jake Paul vs Anthony Joshua: All you need to know",
        "description": "YouTube star Jake Paul will step into the ring with British heavyweight world champion Anthony Joshua in a highly anticipated (and highly criticised) boxing event. ",
        "url": "https://news.sky.com/story/jake-paul-vs-anthony-joshua-all-you-need-to-know-13485512",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jake-paul-anthony-joshua_7114962.jpg?20251219123827",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 10:33:00",
        "Headline": "The British former two-time heavyweight champion is taking on the YouTube influencer turned boxing star in Miami - and we've got everything you need to know. ",
        "Content": "YouTube star Jake Paul will step into the ring with British heavyweight world champion Anthony Joshua in a highly anticipated (and highly criticised) boxing event.  The event in Florida marks the end of a 14-month hiatus for Joshua, 36, while for 28-year-old Paul it will be the biggest and potentially most dangerous fight since his boxing career began in 2020. Here's everything you need to know, from timings to who's on the undercard and how to watch it. The event is taking place on Friday 19 December at the Kaseya Center in Miami - but the time difference means it will be early on Saturday 20 December for viewers in the UK. It is due to begin around 8pm local time, meaning for those in the UK, the main event will start at 1am. Ringwalks for Paul and Joshua are scheduled for 10.30pm local time, which will be 3.30am in the UK. Once in the ring, the fight will consist of eight three-minute rounds with regulation 10oz gloves being used. • Alycia Baumgardner v Leila Beaudoin - unified super-featherweight world championship • Anderson Silva v Tyron Woodley - six-round cruiserweight • Jahmal Harvey v Kevin Cervantes - six-round super-featherweight Preliminary fights, which start from 4.45pm local time and 9.45pm UK time include:  • Cherneka Johnson v Amanda Galle - undisputed bantamweight championship • Caroline Dubois v Camila Panatta - WBC lightweight world championship • Yokasta Valle v Yadira Bustillos - WBC strawweight world championship • Avious Griffin v Justin Cardona - welterweight • Keno Marley v Diarra Davis Jr - cruiserweight The main event will stream live on Netflix with no additional purchase or pay-per-view needed. All that's required is a subscription to the streaming service. Joshua, Britain's two-time world heavyweight champion, will boast an almost two-stone advantage over Paul, who has regularly fought at cruiserweight since he entered the world of boxing. At the official weigh-in on 18 December, Joshua came in at 17st 5lbs (243.4lbs) to Paul's 15st 6lbs (216lbs) - a hefty 1.9st difference. Joshua, who could not weigh more than 245Ibs, is the lightest he has been since his first fight against Oleksandr Usyk in September 2021 when he was 240lbs. For his last fight against Daniel Dubois he weighed 252.5Ibs. It is also only the second time that Paul has weighed in over cruiserweight limit - the other time was when he fought 58-year-old Mike Tyson. \"I'm going to outclass this kid, I'm just going to outclass him,\" Joshua said at the event in Miami, shrugging off confrontation as the pair raised their fists to each other. \"I'm a serious fighter, that's the difference, I'm a serious, serious fighter.\" Paul yelled that he was \"dialled in\" as he flexed his muscles on stage. He said he had told Joshua he smelled fear. \"I see something in his eyes, I truly do,\" he said. \"The pressure is on him. I'm fighting free, I've already won. This is a lose-lose situation for him.\" Given Paul's 13-fight career consists mainly of former UFC stars or faded boxing greats, this contest and Joshua's involvement has sparked a backlash in the boxing world. One of those to speak out was Tyson Fury, the British former world champion who fans want to take on Joshua in a heavyweight battle. In a post on social media Fury called Joshua a \"classless loser\" for agreeing to fight Paul. \"He's a 37-year-old at the end of his career fighting a YouTuber, a Disney Channel guy who Tommy (Fury) beat,\" he said. \"You are a classless loser coming off a 15-month knockout defeat to a local lad. Imagine if someone from Morecambe knocked me out.\" Equally, Paul's career and past fights have been criticised, particularly his win over boxing veteran Mike Tyson in November last year. Amid widespread speculation the fight was rigged, Paul's promotions company was forced to issue a statement, labelling rumours as \"incorrect and baseless\". Read more from Sky News:Actors vote for industrial action over AI concernsWarner Bros set to rebuff hostile takeover bid The odds at the time of writing put Paul at roughly a 10% chance of winning, according to Oddschecker, with Joshua at an 88.9% chance and 2.8% for a draw. However, to prepare for the showdown, Paul has been sparring with some top heavyweight contenders, including former world champion Lawrence Okolie. Okolie, who has won world titles at cruiserweight and bridgerweight, admitted he was surprised by Paul's boxing skills after spending a training camp with him. He told Sky Sports News: \"He's way better now than when I first saw him. Genuinely I was scared for him when they said he was going to fight AJ. \"If he boxes how he sparred, he's got a good chance of looking really good. \"Jake is a lot better than I thought. I think he's got a very good boxing brain, good application, and good grit.\""
    },
    {
        "title": "Pensioner spared jail after smothering wife at Bath home",
        "description": "An 88-year-old man has been spared jail after smothering his wife to death in their Bath home.",
        "url": "https://news.sky.com/story/pensioner-spared-jail-after-smothering-wife-at-bath-home-13485658",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-safi-dawood-police-van_7066808.jpg?20251030112942",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-19 16:44:00",
        "Headline": "Judge orders two years of supervision and medical treatment after finding William Haxworth, 88, unfit to stand trial for killing his wife of 60 years. ",
        "Content": "An 88-year-old man has been spared jail after smothering his wife to death in their Bath home. William Haxworth killed his wife Delia Haxworth, who was 87 at the time, in June last year. The two had been married for more than 60 years. At Bristol Crown Court on Friday, Judge William Hart handed down a two-year supervision order and ordered Haxworth to undergo medical treatment. Haxworth, who was 87 when he committed the crime, was spotted by members of the public threatening to jump from scaffolding on 18 June 2024. He told those trying to help him that he had murdered his wife and that she had been \"very ill\", adding: \"I had to kill her and now it's my turn.\" Mrs Haxworth was taken to hospital around three weeks before her death after a fall in which she struck her head, but those injuries are not believed to have played a role in her death. She had previously been treated for bowel cancer, but but there was no evidence of it recurring. \n                  Family of nine-year-old Aria Thorpe pay tribute to 'beautiful soul' as teen appears in court charged with murder\n                 \n                  David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour\n                 \n                  Driver guilty of murder in Christmas Day West End rampage \n                 When police went to the couple's home in Upper Lansdown Mews, Bath, they found Mrs Haxworth, 85, \"lifeless\" on a bed. The court heard a note was found, apparently written by her husband, which said: \"It all became too much. \"Please forgive me and wonderful Dil. \"It all seemed lacking in point. You've all been so wonderful too. And so many kind neighbours. \"Forgive. Forgive. Will.\" Read more from Sky News:Woman jailed for plotting with lover to murder husband in caravanFamily of murdered nine-year-old pay tribute to 'beautiful soul' The court heard a post-mortem examination revealed that Mrs Haxworth had been smothered. Judge Hart told the jurors that he had determined the defendant was unfit to stand trial and they did not have to decide whether he was guilty or not guilty of murder. Judge Hart described the case as \"tragic\" and said Haxworth had a \"genuine belief\" that his wife was suffering from a terminal illness. \"I know that during the period since these proceedings started you made another attempt on your life, which has led to spending some time in hospital,\" he told the defendant. \"I want to express my condolences to all who cared for and loved Delia, and indeed to all those who care for and love you.\" He made a two-year supervision order, under which Haxworth will be overseen by both a probation officer and a clinical supervisor."
    },
    {
        "title": "David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour",
        "description": "David Walliams has been dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women.",
        "url": "https://news.sky.com/story/david-walliams-dropped-by-publisher-harpercollins-uk-13485653",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/david-walliams-author-comedian_7115245.jpg?20251219185419",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 16:26:00",
        "Headline": "A spokesperson for the comedian and children's author said he \"strongly denies\" the claims. They also said the 54-year-old was taking legal advice.",
        "Content": "David Walliams has been dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women. A spokesperson for the company said it had decided not to release any new titles by Walliams \"after careful consideration, and under the leadership of its new CEO\". \"HarperCollins takes employee well-being extremely seriously and has processes in place for reporting and investigating concerns,\" they added. \"To respect the privacy of individuals, we do not comment on internal matters.\" In a statement later on Friday, a spokesperson for the comedian and children's author said: \"David has never been informed of any allegations raised against him by HarperCollins. \"He was not party to any investigation or given any opportunity to answer questions. David strongly denies that he has behaved inappropriately and is taking legal advice.\" It follows a report from The Telegraph that Walliams was dropped after an investigation into allegations of inappropriate behaviour towards young women. The 54-year-old, who shot to fame with the BBC sketch show Little Britain, is one of the country's best-selling children's writers. He has written more than 40 books, which have sold more than 60 million copies worldwide and been translated into 55 languages, according to his website. His first children's book, The Boy in the Dress, was published by HarperCollins in 2008, and he was awarded an OBE in 2017 for services to charity and the arts. Walliams is also known for Come Fly With Me, another BBC sketch show, and was formerly part of the judging panel for ITV's Britain's Got Talent. He left the show in 2022 after a recording of him making disparaging comments about contestants was leaked. The remarks were understood to have been both derogatory and sexually explicit, referring to one contestant as a \"c***\" and saying of another: \"She thinks you want to f*** her, but you don't\". Walliams later released a statement apologising for the \"disrespectful comments\" and saying they were private conversations that were never meant to be shared. HarperCollins UK announced in October that it had appointed Kate Elton as its new chief executive, following the departure of former boss Charlie Redmayne."
    },
    {
        "title": "Driver guilty of murder in Christmas Day West End rampage ",
        "description": "A driver has been found guilty of murder after killing one man and ploughing into several others during a drink-fuelled spree in London's West End on Christmas Day.",
        "url": "https://news.sky.com/story/driver-guilty-of-murder-in-christmas-day-west-end-rampage160-13485689",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gilheaney-west-end_7115242.jpg?20251219184937",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 19:53:00",
        "Headline": "Anthony Gilheaney, 31, was convicted of killing 25-year-old Aidan Chapman and attempting to murder others after deliberately driving at pedestrians following a series of racist and homophobic attacks",
        "Content": "A driver has been found guilty of murder after killing one man and ploughing into several others during a drink-fuelled spree in London's West End on Christmas Day. Anthony Gilheaney, 31, went on trial at the Old Bailey, accused of carrying out a string of unprovoked, violent attacks on five people in the early hours of 25 December 2024, including using his high-powered Mercedes to strike and kill 25-year-old Aidan Chapman. He also knocked down Arif Khan with his car, then got out and physically assaulted him after shouting a racial slur. The jury heard he later deliberately drove at three others: Marcelo Basbus-Garcia and his partner, Miguel Waihrich, as well as Mr Chapman's friend, Tyrone Itorho. The prosecution alleged Gilheaney targeted people for racist and homophobic reasons, but he told jurors he was not in control of the vehicle after he had been attacked by a group of men earlier that night, and he did not intend to hurt anyone. Gilheaney, from Harlow, Essex, had admitted the manslaughter of Mr Chapman, as well as unlawfully wounding Mr Khan, causing grievous bodily harm to Mr Basbus-Garcia and Mr Waihrich and assault occasioning actual bodily harm against Mr Itorho. He previously pleaded guilty to causing death by dangerous driving, dangerous driving and possessing a bladed article in a public place. But he denied murder, wounding with intent, three counts of attempted murder, two counts of causing grievous bodily harm with intent and one count of attempting to cause grievous bodily harm throughout. On Friday, the jury convicted Gilheaney of murdering Mr Chapman, attempting to murder Mr Basbus-Garcia and Mr Itorho and wounding Mr Khan with intent. Gilheaney was cleared of attempting to murder Mr Waihrich but convicted of the alternative charge of causing him grievous bodily harm with intent. He will be sentenced on 30 January. After the conviction, Mr Chapman's family said: \"No parent should have to go through the hellish trauma of losing a child, words cannot describe the pain and anguish Anthony Gilheaney has caused us by his evil actions. \"He took our only son from us. Something we will never get over. Something we will never forgive.\" The trial heard that Gilheaney left a nightclub in the early hours of Christmas Day 2024 and got into an argument with a stranger, assaulted another unknown man, and then attacked Hardeep Singh, a Sikh man, without provocation as he walked along Shaftesbury Avenue. He then got into his car and began hurling abuse at Mr Khan, calling him a \"P***\". When Mr Khan went to confront Gilheaney, the defendant knocked him to the ground with the car. Gilheaney then got out of the car and threw Mr Khan to the ground and kicked him. Mr Singh came back with friends and saw Gilheaney attacking Mr Khan in Archer Street, before he and his group beat the defendant up. The confrontation was captured on an Uber driver's dashcam, after which Gilheaney got into his own car and deliberately rammed the Uber vehicle. He then drove back and forth along the street, mounting the kerb and sending pedestrians running in panic. Gilheaney drove at Mr Basbus-Garcia and Mr Waihrich, who were walking along the street holding hands after attending midnight mass and, further along Shaftesbury Avenue, driving into Mr Chapman and Mr Itorho. Mr Chapman was hit full on, suffering catastrophic brain damage, and died in hospital on New Year's Eve. Following the attacks, police spotted Gilheaney's erratic driving and gave chase. Read more from Sky News:Foreign prison staff 'offered emergency extension to visa'Woman jailed for plotting with lover to murder husband He eventually jumped out of his moving car and ran off and police later found him passed out in Holborn, central London. Gilheaney was said to have been tearful and apologetic to police at the scene, telling one officer: \"I am sorry for everything I have ever done. I will admit to everything. I am guilty. I am sorry.\" When he was formally interviewed later, he claimed he could not remember anything. He told jurors he had drunk up to six cans of a vodka cocktail mix before arriving at a bar that night. Gilheaney had never held a driving licence but told the court he had \"always\" liked being at the wheel of powerful cars. He used false plates to conceal his identity. Detective Chief Inspector Wayne Jolley said: \"Throughout the investigation, he has refused to acknowledge the seriousness of his offences, making every attempt to portray himself as a troubled victim. \"I commend the jury for seeing through this act.\""
    },
    {
        "title": "Pensioner spared jail after smothering wife at Bath home",
        "description": "An 88-year-old man has been spared jail after smothering his wife to death in their Bath home.",
        "url": "https://news.sky.com/story/pensioner-spared-jail-after-smothering-wife-at-bath-home-13485658",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-safi-dawood-police-van_7066808.jpg?20251030112942",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 16:44:00",
        "Headline": "Judge orders two years of supervision and medical treatment after finding William Haxworth, 88, unfit to stand trial for killing his wife of 60 years. ",
        "Content": "An 88-year-old man has been spared jail after smothering his wife to death in their Bath home. William Haxworth killed his wife Delia Haxworth, who was 87 at the time, in June last year. The two had been married for more than 60 years. At Bristol Crown Court on Friday, Judge William Hart handed down a two-year supervision order and ordered Haxworth to undergo medical treatment. Haxworth, who was 87 when he committed the crime, was spotted by members of the public threatening to jump from scaffolding on 18 June 2024. He told those trying to help him that he had murdered his wife and that she had been \"very ill\", adding: \"I had to kill her and now it's my turn.\" Mrs Haxworth was taken to hospital around three weeks before her death after a fall in which she struck her head, but those injuries are not believed to have played a role in her death. She had previously been treated for bowel cancer, but but there was no evidence of it recurring. \n                  Family of nine-year-old Aria Thorpe pay tribute to 'beautiful soul' as teen appears in court charged with murder\n                 \n                  David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour\n                 \n                  Driver guilty of murder in Christmas Day West End rampage \n                 When police went to the couple's home in Upper Lansdown Mews, Bath, they found Mrs Haxworth, 85, \"lifeless\" on a bed. The court heard a note was found, apparently written by her husband, which said: \"It all became too much. \"Please forgive me and wonderful Dil. \"It all seemed lacking in point. You've all been so wonderful too. And so many kind neighbours. \"Forgive. Forgive. Will.\" Read more from Sky News:Woman jailed for plotting with lover to murder husband in caravanFamily of murdered nine-year-old pay tribute to 'beautiful soul' The court heard a post-mortem examination revealed that Mrs Haxworth had been smothered. Judge Hart told the jurors that he had determined the defendant was unfit to stand trial and they did not have to decide whether he was guilty or not guilty of murder. Judge Hart described the case as \"tragic\" and said Haxworth had a \"genuine belief\" that his wife was suffering from a terminal illness. \"I know that during the period since these proceedings started you made another attempt on your life, which has led to spending some time in hospital,\" he told the defendant. \"I want to express my condolences to all who cared for and loved Delia, and indeed to all those who care for and love you.\" He made a two-year supervision order, under which Haxworth will be overseen by both a probation officer and a clinical supervisor."
    },
    {
        "title": "Trio guilty of killing man who jumped from Dundee flat window in bid to escape their clutches",
        "description": "Three criminals have been convicted of killing a man who jumped from a window in a bid to escape their attempts to extort money from him.",
        "url": "https://news.sky.com/story/trio-guilty-of-killing-man-who-jumped-from-dundee-flat-window-in-bid-to-escape-their-clutches-13485619",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-edinburgh-high-court_6983341.jpg?20251219150341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 15:00:00",
        "Headline": "The trio created an \"atmosphere of absolute terror, menace and threats\" at the flat where they abducted Ryan Munro in an attempt to extort money from him, a court heard.",
        "Content": "Three criminals have been convicted of killing a man who jumped from a window in a bid to escape their attempts to extort money from him. Stephen Stewart, 52, Jennifer Souter, 40, and Victoria McGowan, 43, were found guilty on Friday of the culpable homicide of 36-year-old Ryan Munro last year. The trio created an \"atmosphere of absolute terror, menace and threats\" at the Morgan Street flat in Dundee where they abducted Mr Munro in an attempt to obtain cash, the High Court in Edinburgh heard. They placed him in such an \"extreme state of fear and alarm\" that he jumped to his death from a window at the property on 10 January 2024. The trio stood trial alongside the brother-in-law of former first minister Humza Yousaf, Ramsay El-Nakla. Mr El-Nakla, 37, was originally charged alongside the others of extorting money from Mr Munro at the flat and with drugs offences but was acquitted last week after the prosecution accepted his not guilty pleas to the allegations facing him. He was not charged with the alleged culpable homicide of Mr Munro. \n                  Former first minister Humza Yousaf's brother-in-law gives evidence in case of man who fell to his death from Dundee flat window\n                 \n                  Boy tells trial of Humza Yousaf's brother-in-law he 'can't remember' police interview\n                 \n                  Brother-in-law of Scotland's former leader, Humza Yousaf, facing extortion and drug charges\n                 On Friday afternoon, jurors returned guilty verdicts on the remaining trio on all charges. Stewart, Souter and McGowan were found to have threatened and intimidated Mr Munro, causing him to escape the flat from a \"window at height\" which led to him falling and striking the ground. 'Atmosphere of absolute terror' The trio had earlier abducted Mr Munro on 9 and 10 January 2024 at the flat by intimidating and threatening him and detaining him against his will. The jury also found the trio did \"with the intention of menacing Mr Munro\" put him in a \"state of fear and alarm and apprehension of physical harm to his well-being and safety\", intimidated him and did \"extort a sum of money\" from him by threats. In his closing speech, prosecutor Alex Prentice KC told jurors: \"There was an atmosphere of absolute terror, menace and threats.\" Trio 'can expect significant custodial sentences' Stewart was also convicted of drugs charges, while his co-accused pleaded guilty to narcotics offences earlier in proceedings. Judge Lady Drummond remanded the trio and called for reports into their backgrounds. She told them: \"You can all expect a significant custodial sentence for these offences.\" The trio will be sentenced at the High Court in Glasgow in February. Read more from Sky News:Woman jailed for plotting with lover to murder husbandHow online sleuths are making life hell for families of the missing Following conviction, it emerged that prosecutors intend to launch proceeds of crime action against Stewart and McGowan in relation to criminal assets made from drug dealing. That is expected to call at the High Court in Edinburgh sometime in the near future."
    },
    {
        "title": "Woman jailed for plotting with lover to murder husband in caravan and make it look like suicide",
        "description": "A woman and her lover who plotted to kill her husband so they could continue their affair have both been jailed for 19 years.",
        "url": "https://news.sky.com/story/woman-who-plotted-with-lover-to-murder-her-husband-jailed-13485441",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-michelle-mills-geraint-berry_7114996.jpg?20251219131054",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 12:30:00",
        "Headline": "Police found gas masks, imitation guns and a fake suicide note purporting to be from Michelle Mills' husband.",
        "Content": "A woman and her lover who plotted to kill her husband so they could continue their affair have both been jailed for 19 years. Michelle Mills and Geraint Berry planned to murder Christopher Mills and make it look like suicide. They were found guilty of conspiracy to murder after a trial at Swansea Crown Court in October. A third person, Steven Thomas, was found not guilty of conspiracy to murder but pleaded guilty to a firearms charge. Police were called on 20 September last year to reports that masked men carrying guns, later found to be Berry and Thomas, had raided a static caravan in Cenarth, Ceredigion. Despite being badly beaten, Mr Mills was able to fight them off and they fled. Michelle Mills, 46, called 999 to say her husband had a head injury and claimed she did not know the armed men who broke in. Armed officers and a dog unit responded, and a police helicopter soon spotted Berry, 46, and Thomas, 47, hiding in undergrowth. While searching Berry and Thomas, officers found gas masks and a typed suicide note addressed to Mills purporting to have been written by her husband. Police quickly established that Mills, of Llangennech in Carmarthenshire, was linked to the plot. Digital evidence revealed she and Berry - a former Royal Marine - had been in a secret relationship for around three months and had discussed ways to kill Mr Mills. These included killing him with sleeping tablets, suffocating him in his sleep and poisoning him with antifreeze. Berry also looked into how to make his victim's Mini explode on start up. Police said when Berry told Mills he was meeting with some \"boys\" to plan \"what they are going to do with him\", she responded: \"Yes, lovely, thank you.\" Gas masks were 'to set up a fake suicide' Detective Inspector Sam Gregory said: \"Berry and Mills had previously discussed using gas to kill Mr Mills, while making it look like he had taken his own life. \"Berry had asked Mills where the boiler was, and he and Thomas carried gas masks that would have protected themselves while Mr Mills suffocated. \"No explanation has been given by any of the three defendants for the fake suicide note or the gas masks in the rucksack. \"What's clear is that these were not being used to frighten Mr Mills - they were there to set up a fake suicide.\" DI Gregory said the victim had no idea his wife of 10 years wanted him dead and believed they had a happy marriage. 'Your intention was to kill' Judge Mr Justice Nicklin KC said the pair had not shown any remorse and they were only concerned with not getting caught. \"You devised the plan and led its execution,\" he told Berry. \"You recruited Steven Thomas to assist you and while intoxicated, you equipped yourself with items that demonstrated your intention to kill Mr Mills and make it appear to be a suicide. \"However incompetent the plan was and how unlikely it was to be achieved, your intention was to kill.\" Read more from Sky News:Teen to face trial over murder of nine-year-old Aria Thorpe'Alien battleship' reaches closest point to Earth The judge told Michelle Mills she had encouraged her lover. He said: \"The evidence strongly suggests in the weeks leading up to the incident, you cultivated and exploited Geraint Berry's animosity towards your husband and encouraged him to find a way to get rid of your husband, not in fantasy but reality.\" The judge also praised Mr Mills' \"remarkable fortitude and courage\" in fighting off the pair. Steven Thomas was sentenced to 12 months but will be released immediately due to time served on remand."
    },
    {
        "title": "Kylie Minogue secures her first Christmas number one in UK",
        "description": "Kylie Minogue has secured her first Christmas number one in the UK with her hit track XMAS.",
        "url": "https://news.sky.com/story/kylie-minogue-secures-her-first-christmas-number-one-in-uk-13485669",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kylie-minogue-christmas-number-one_7115103.jpg?20251219192806",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 17:13:00",
        "Headline": "The Australian pop star said that being top of the festive chart was \"the most wonderful gift\" and that she was grateful for everyone who had listened to her song and shared \"the love\".",
        "Content": "Kylie Minogue has secured her first Christmas number one in the UK with her hit track XMAS. The Australian pop star, 57, is the first solo female artist in 12 years to secure the coveted festive spot, after Sam Bailey with Skyscraper in 2013, according to The Official Charts Company. Minogue has also become the first woman to have number one singles across four different decades. Her success comes after two consecutive years in which Last Christmas by Wham! was top. Minogue said it was \"hard to put into words\" how special it felt to lead the singles chart. She said: \"Being Christmas number one really is the most wonderful gift. I'm so thankful to everyone who's been listening and sharing the love and I'm wishing you all a very Merry Christmas.\" Her single - pronounced X-M-A-S - is accompanied by a music video that shows Minogue teaching a dance to a group of children and adults. \n                  Will there be a white Christmas in the UK this year? \n                 \n                  Queen hosts festive tea for children with severe illnesses\n                 \n                  GCHQ releases annual Christmas puzzle - can you solve it?\n                 It also features a special appearance from Abba's Bjorn Ulvaeus. Xmas is followed in the singles chart by Last Christmas, with Mariah Carey's All I Want For Christmas Is You at three. The top five is completed by Brenda Lee's Rockin' Around The Christmas Tree at four and charity single Lullaby by Together For Palestine at number five - this week's highest new entry. Read more:The recipe for a Christmas number oneWham! make chart history Kylie has previously topped the singles chart on seven other occasions. Her other bestselling songs were I Should Be So Lucky (1988), Especially For You (1988), Hand On Your Heart (1989), Tears On My Pillow (1990), Spinning Around (2000), Can't Get You Out Of My Head (2001) and Slow (2003). Martin Talbot, chief executive of the Official Charts Company, said Minogue may now be placed to challenge Mariah Carey as the \"queen of Christmas\". He said: \"Congratulations to Kylie - what an amazing achievement by our adopted national treasure.\" The last Australian artist to earn the Christmas number one title was Oscar-winning actress Nicole Kidman, who collaborated with Robbie Williams on Somethin' Stupid in 2001."
    },
    {
        "title": "UK hopes new German law will cut migrant small boats",
        "description": "The British government is hoping a change in German law will help stop small boat crossings to the UK.",
        "url": "https://news.sky.com/story/uk-hopes-new-german-law-will-cut-migrant-small-boats-13485589",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-keir-starmer-boat-crossings_6988547.jpg?20250812031009",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 13:54:00",
        "Headline": "Ministers say the new measures will stop people-smuggling gangs storing small boats or engines in Germany before using them in Channel crossings.",
        "Content": "The British government is hoping a change in German law will help stop small boat crossings to the UK. The measures to criminalise the facilitation of migrant smuggling towards the UK, agreed more than a year ago, have now been passed by German legislators. British ministers say they mean gangs will no longer be able to store small boats or engines in Germany before transporting them into France to cross the Channel. It will also strengthen existing UK-German law enforcement cooperation and information sharing, they say. Home Secretary Shabana Mahmood said: \"Together with our German allies, we are cracking down on the criminal gangs operating the illegal migration trade. \"I thank minister [of the interior] Alexander Dobrindt for Germany's strong cooperation with the UK in tackling this issue. \"This government is restoring order at our borders by scaling up removals and removing the incentives that draw people here illegally.\" \n                  Keir Starmer belatedly defends Sadiq Khan after 'horrible mayor' jibe - and calls out Donald Trump comments\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Budget 2025: Rachel Reeves calls for Labour MPs to unite - but admits they might not like everything\n                 The law passed on Friday is set to be in force by the end of the year, the government said. 👉Listen to Politics at Sam and Anne's on your podcast app👈 The first 10 months of 2025 saw record numbers of people crossing in small boats, although the total number of people arriving across the Channel has since fallen below the peak seen in 2022. For 28 days no crossings were recorded in official figures before hundreds of people made the journey last weekend. Illegal small boat migration has become one of the most contentious issues in British politics, symbolising frustration with migration levels and a perceived lack of control from multiple prime ministers. Prime Minister Keir Starmer moved away from the Rwanda deportation scheme and pledged instead to \"smash the gangs\" before his election victory. However, the failure to make a substantial difference to the number of people crossing has been seized upon by both the Conservatives and Reform. Others, like the Green Party's Zack Polanski, have called for safe asylum routes to be opened to discourage people crossing clandestinely. Read more:Inside the route to the ChannelFrance to intercept suspected taxi boats soon Foreign Secretary Yvette Cooper said: \"Criminal smuggler gangs operate across borders, so governments and law enforcement need to cooperate across borders to bring them down. \"This major change in German law is the result of our close partnership working to tackle illegal migration and organised immigration crime. We will continue to ramp up our international cooperation to strengthen our own border security. These are the partnerships we build abroad to make us stronger at home.\" Adrian Matthews, director of intelligence at the National Crime Agency, said: \"We welcome the legislative change in Germany. \"It will help boost our efforts against the small boats threat and it builds on our close working relationships with German partners who are key to helping disrupt organised crime groups operating from the continent.\" Chris Philp MP, shadow home secretary, said: \"Immigrants don't cross the Channel because of laws in Berlin. They cross because Labour refuse to deport them once they get here - since Labour took office, just 5 per cent of illegal arrivals have been removed. That is the pull factor, and until deportations start, the crossings will keep coming. \"Labour are outsourcing responsibility to foreign governments while doing nothing at home. Germany may close a warehouse, but Starmer still won't close the door.\""
    },
    {
        "title": "Earthquake strikes Lancashire village for second time this month",
        "description": "A seaside village has been hit by a second earthquake in a month, with locals reporting windows rattling, rumbling and shaking overnight.",
        "url": "https://news.sky.com/story/earthquake-strikes-lancashire-village-for-second-time-this-month-13485582",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-silverdale-lancashire_7115006.jpg?20251219132148",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 13:45:00",
        "Headline": "A 2.5 magnitude earthquake hit Silverdale, a seaside village on Morecambe Bay, at around 5am on Friday, the British Geological Survey has reported.",
        "Content": "A seaside village has been hit by a second earthquake in a month, with locals reporting windows rattling, rumbling and shaking overnight. The 2.5 magnitude quake hit Silverdale, Lancashire, on Morecambe Bay, near the border with Cumbria at around 5am on Friday at a depth of 2.6km, the British Geological Survey (BGS) reported. There have been no reports of injuries or damage and the tremor was an aftershock of the 3.3 magnitude \"Great Quake\" of 3 December, the BGS said. It said tremors were felt around the Morecambe Bay area, with reports of \"a quick sharp shaking jolt\" with a \"thunder noise\" and pictures and radiators rattling. On the Volcano Discovery website, which tracks earthquakes across the globe and compiles comments, locals in the Silverdale area reported, \"very weak shaking... rattling, vibrating\". Read more from Sky News:'Alien battleship' reaches closest point to EarthUnsafe meat warning after butchered geese dumped by roadside A resident in Arnside, around three miles from Silverdale, said: \"Woke me up. Sounded like a short rumbling in the distance, like it happened a few streets away. Only lasted a couple of seconds.\" A spokesperson from the BGS told Sky News that \"whilst nationally, earthquakes are spread throughout the year, it is common for small groupings of earthquakes to occur regionally\". \"Whilst the events in Lancashire were not small by British standards, they are nowhere near the magnitude of earthquakes found in other parts of the world,\" the spokesperson added. The 3.3 magnitude quake earlier this month was \"felt across the South Lakes and Lancashire, mainly within 20km of the epicentre\", including Kendal and Ulverston in neighbouring Cumbria, the BGS said. Each year, the BGS detects between 200 and 300 earthquakes in the UK, but only about 20 to 30 are strong enough to be felt. "
    },
    {
        "title": "BMA resident doctors in Scotland vote to strike in January",
        "description": "Resident doctors in Scotland have voted to go on strike in January &#8211; as their union called on the devolved government to present a \"credible\" pay offer.",
        "url": "https://news.sky.com/story/bma-resident-doctors-in-scotland-vote-to-strike-in-january-13485684",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-strikes-bma-junior-doctors_6496070.jpg?20240320162410",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-19 18:15:00",
        "Headline": "The Scottish health secretary said he was \"disappointed\" by the decision, as he offered to meet with union officials for talks on Monday.",
        "Content": "Resident doctors in Scotland have voted to go on strike in January – as their union called on the devolved government to present a \"credible\" pay offer. The British Medical Association (BMA) Scotland announced on Friday that 92% of its members who voted in the ballot were in favour of the industrial action. The turnout was 58%. The strikes are scheduled to start at 7am on Tuesday 13 January, and end at 7am on Saturday 17 January – unless progress is made in pay talks. The announcement comes amid an ongoing strike action by resident doctors in England, which began on Wednesday and will last until Monday. Chris Smith, chair of the BMA Scottish resident doctors committee, said its members were \"united in anger\", and claimed the Scottish government had reneged on a pay deal it agreed two years ago. He said: \"We are simply asking for the government to deliver on what they previously promised, an offer which will provide a meaningful, continued and crucially credible step on the path towards addressing the pay erosion which resident doctors have suffered from since 2008. \"If they had kept to their commitment, and the trajectory towards pay restoration, this dispute could have been averted. \"And there is still time to avoid strikes – BMA Scotland resident doctors remain committed to the deal when it is being upheld in its entirety.\" In 2023, junior doctors – as resident doctors used to be called – in Scotland agreed to a new pay deal, and to further talks in each year \"to make credible progress on the path towards pay restoration\", the union said. BMA Scotland said in October that resident doctors were offered a 4.25% uplift for 2025/26, which it said broke the agreement with the Scottish government. Mr Smith said at the time: \"We are already 17% worse off than our peers were in 2008 and this would have made that worse\". The Scottish health secretary said on Friday that he was \"disappointed\" in the vote, and offered to meet with Mr Smith for talks on Monday. Neil Gray said the 4.25% uplift was \"part of a two-year deal\" and was \"the same as accepted by nurses and other NHS staff\". \"This means by 2027, we will have delivered a cumulative pay rise of 35% in four years,\" he added. \"Our top priority for our patients and the workforce is to improve waiting times, access to the NHS and positive outcomes. Industrial action will put all that progress at risk.\" Read more from Sky News:UK Christmas number 1 revealedDavid Walliams dropped by publisher Meanwhile, resident doctors' strikes in England are set to enter their fourth day, after the BMA said 83% of English members had rejected a fresh proposal from the Labour government. Sir Keir Starmer called the action \"irresponsible\", while Health Secretary Wes Streeting accused the union of a \"shocking disregard for patient safety\". The BMA said the strike was \"entirely avoidable\" and has demanded a \"credible offer\" for English doctors to avert \"real-terms pay cuts\". Sky News has contacted the Scottish government for comment."
    },
    {
        "title": "Ukraine 'hits Russian tanker in Mediterranean Sea for first time'",
        "description": "Ukraine has struck a Russian tanker in the Mediterranean Sea for the first time, a Kyiv intelligence source has said.",
        "url": "https://news.sky.com/story/ukraine-hits-russian-tanker-in-mediterranean-sea-for-first-time-13485687",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-qendil-russian-tanker_7114978.jpg?20251219125225",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-19 18:23:00",
        "Headline": "Vladimir Putin claimed the attack would not disrupt supplies, but vowed that the Kremlin's forces would still retaliate. A Ukrainian intelligence source alleged the ship was being used to circumvent international sanctions.",
        "Content": "Ukraine has struck a Russian tanker in the Mediterranean Sea for the first time, a Kyiv intelligence source has said. The ship, called the Qendil, suffered \"critical damage\" in the attack, according to a member of the SBU, Ukraine's internal security agency. The tanker is said to be part of Russia's so-called \"shadow fleet\" - a group of ageing vessels that Kyiv alleges helps Moscow exports large quantities of crude oil despite Western sanctions. The ‌SBU source said Ukrainian ​drones hit the ship in neutral waters more than 2,000 kilometres (1,243 miles) ‌from Ukraine. They said: \"Russia used this tanker to circumvent sanctions and earn money that went to the war against Ukraine. \"Therefore, from the point of view of international law and the laws and customs of war, this is an absolutely legitimate target for the SBU. \"The enemy must understand that Ukraine will not stop and will strike it anywhere in the world, wherever it may be.\" The vessel ‍was empty at the time of the attack, the Ukrainian source added. Speaking during a live TV event, Vladimir Putin, the Russian president, claimed the attack would not disrupt supplies, but vowed that Russia would retaliate nonetheless. He added that Russia regularly responded with \"much stronger strikes\" against Ukraine. Putin also warned against any threat to blockade Russia's coastal exclave Kaliningrad, which he said would \"just lead to unseen escalation of the conflict\" and could trigger a \"large-scale international conflict\". Read more:The mercenaries fighting for RussiaBritish man who fought for Ukraine jailed Sky military analyst Michael Clarke said Ukraine's claim about causing significant damage to the ship was \"probably true\". He added: \"The Ukrainians obviously feel that they can legitimise this sort of operation.\" The attack comes after the European Union announced it would provide a €90bn (£79bn) interest-free loan to Ukraine. Oleksandr Merezhko, the chairman of the foreign affairs committee in the Ukrainian parliament, told Sky News that the money would \"tremendously enhance\" Kyiv's defensive capabilities. However, he said the International Monetary Fund estimated that Ukraine needed $137bn to \"keep running\". \"The aggressor should be punished\", Mr Merezhko added, as he argued that frozen Russian assets in Europe should be used to help fund his country's defence. He vowed that Ukraine would \"continue to fight\" for the move, adding that it was \"a matter of justice\"."
    },
    {
        "title": "Trapped journalists rescued after mob sets fire to Bangladesh newspaper offices",
        "description": "Protesters have stormed the headquarters of two major newspapers in Bangladesh, amid widespread unrest following the death of a political activist.&#160;",
        "url": "https://news.sky.com/story/trapped-journalists-rescued-after-mob-sets-fire-to-bangladesh-newspaper-offices-13485471",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bangladesh-dhaka_7114756.jpg?20251219085750",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-19 08:23:00",
        "Headline": "The protests in Dhaka were sparked by the death of prominent political activist, Sharif Osman Hadi, from gunshot wounds",
        "Content": "Protesters have stormed the headquarters of two major newspapers in Bangladesh, amid widespread unrest following the death of a political activist.  A mob set fire to the offices of the Bengali-language Prothom Alo daily newspaper and the English-language Daily Star in the capital Dhaka, leaving journalists and other staff stuck inside. One of the Daily Star's journalists, Zyma Islam, wrote on Facebook: \"I can't breathe anymore. There's too much smoke.\" Both dailies stopped updating their online editions after the attacks and did not publish broadsheets on Friday. Troops were deployed to the Star building and firefighters had to rescue the journalists trapped inside. The blaze was brought under control early on Friday. Political activist Sharif Osman Hadi died in hospital late on Thursday, six days after the youth leader was shot while riding on a rickshaw in Dhaka. Bangladesh's interim government urged people on Friday to resist violence as police and paramilitary troops fanned outacross the capital and other cities following the protests overnight. They have sparked concerns of fresh unrest ahead of national elections, which Mr Hadi had been due to stand in. \n                  Labour MP Tulip Siddiq sentenced to two years in prison at corruption trial in Bangladesh\n                 \n                  Tokyo overtaken as world's biggest city\n                 \n                  Tulip Siddiq: Lawyers and former ministers warn of 'profound concerns' over Labour MP's trial\n                 He was a prominent activist in the political uprising last year that forced the then Prime Minister Sheikh Hasina to flee the country. Mr Hadi spent six days on life support in a hospital in Singapore before he succumbed to his injuries. Hundreds of protesters took to the streets following news of Mr Hadi's death on Thursday night, where they rallied at Shahbagh Square near the Dhaka University campus, according to media reports. A group of demonstrators gathered outside the head office of the Muslim-majority country's leading Bengali-language Prothom Alo daily, before vandalising the building and setting it on fire. A few hundred yards away, another group of protesters pushed into the Daily Star offices and set fire to the building. The protesters are believed to have targeted the papers for their alleged links with India and closeness to Bangladesh's interim leader, Nobel Peace Prize laureate Muhammad Yunus. Read more:Ex-Bangladesh PM Sheikh Hasina sentenced to deathUK MP Tulip Siddiq sentenced by Bangladeshi court Although calm had returned to much of the ⁠country on Friday morning, protesters carrying national flags and placardscontinued demonstrating at Shahbagh Square in Dhaka, chanting slogans and vowing not to return until justice was served. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Last year's mass uprising erupted from student protests against a quota system that awarded 30% of government jobs to relatives of veterans. The July 2024 protest, which resulted in as many as 1,400 deaths according to the United Nations, was dubbed the first \"Gen Z\" revolution. Bangladesh's former prime minister Sheikh Hasina Wazed was forced to resign in August 2024 and fled to India. She was later sentenced to death in absentia. Dr Yunus was then sworn in as interim leader. The country's Islamists and other opponents of Ms Hasida have accused her government for being subservient to India. Mr Hadi was a fierce critic of Ms Hasina and neighbouring India. He had planned to run as an independent candidate in a constituency in Dhaka at the next national elections due to be held in February. Authorities said they had identified the suspects in Mr Hadi's shooting, and the assassin was also likely to have fled to India. Two men on a motorbike followed Hadi and one opened fire before they fled the scene. "
    },
    {
        "title": "TikTok faces legal action over moderator cuts",
        "description": "TikTok is being threatened with legal action over cuts to its UK online safety teams.",
        "url": "https://news.sky.com/story/tiktok-faces-legal-action-over-moderator-cuts-13485485",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tiktok-protest-moderator_7024625.jpg?20251219095538",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-19 09:21:00",
        "Headline": "TikTok is being accused of threatening safety workers with redundancy days before they were due to vote on forming a union.",
        "Content": "\n          Science and technology reporter\n       TikTok is being threatened with legal action over cuts to its UK online safety teams. In August, the social media company announced more than 400 workers would lose their jobs, with AI replacing some of the workers and other jobs being rehired abroad. TikTok is being accused of threatening those safety workers with redundancy days before they were due to vote on forming a union. Read more: TikTok moderators warn users may be at risk Now, two moderators have sent a legal letter to TikTok laying out the terms of a potential legal case on grounds of unlawful detriment and automatic unfair dismissal. Unlawful detriment is when an employer treats a worker unfairly because they used a protected employment right, for example, being a union representative, asking for flexible working or whistleblowing about the company. \"In June, TikTok said it was going to hire hundreds more content moderators, then two months later, they fired everyone,\" said Stella Caram, head of legal at Foxglove, a non-profit supporting the moderators. \n                  Porn provider fined £1m by Ofcom as impact of new online safety rules revealed\n                 \n                  OpenAI denies allegations ChatGPT is responsible for teenager's death\n                 \n                  TikTok to alert parents when teens post public videos\n                 \"What changed? Workers exercised their legal right to try to form a trade union. This is obvious, blatant and unlawful union-busting,\" she said. TikTok has been given one month to respond to the legal claim. A TikTok spokesperson said: \"We once again strongly reject this baseless claim. \"These changes were part of a wider global reorganisation, as we evolve our global operating model for Trust and Safety with the benefit of technological advancements to continue maximising safety for our users.\" As well as Foxglove, the two moderators launching the case are working with the United Tech & Allied Workers (UTAW), part of the Communication Workers' Union, and law firm Leigh Day. In exclusive interviews last month, three whistleblowers told Sky News the cuts would put UK users at risk, a claim repeated by Julio Miguel Franco, one of the moderators behind the legal action. \"TikTok needs to tell the truth,\" he said. \"When it says AI can do our job of keeping people safe on TikTok, it knows that's rubbish. \"Instead, they want to steal our jobs and send them to other countries where they can pay people less and treat them worse. The end result is TikTok becomes less safe for everyone.\" Read more on social media:Online sleuths and fake news: The world of missing peopleParents of sextortion victim who took his own life sue Meta Internal documents seen by Sky News show that TikTok planned to keep its human moderators in London for at least the rest of 2025. The documents lay out the increasing need for dedicated moderators because of the growing volume and complexity of moderation. TikTok's head of governance, Ali Law, also told MPs in February that \"human moderators ... have to use their nuance, skills and training\" to be able to moderate hateful behaviour, misinformation and misleading information. After a series of letters between TikTok and MPs, Dame Chi Onwurah, chair of the science and technology select committee, said she was \"deeply\" concerned about the cuts. \"There is a real risk to the lives of TikTok users,\" she said. Last month, in an exclusive sitdown with Sky News, however, Mr Law said user safety would not be compromised. \"We set a high benchmark when it comes to rolling out new moderation technology. \"In particular, we make sure that we satisfy ourselves that the output of existing moderation processes is either matched or exceeded by anything that we're doing on a new basis. \"We also make sure the changes are introduced on a gradual basis with human oversight so that if there isn't a level of delivery in line with what we expect, we can address that.\""
    },
    {
        "title": "Vladimir Putin didn't sound like he will alter his course anytime soon in annual TV address",
        "description": "It is the day when President Putin becomes Primetime Putin.",
        "url": "https://news.sky.com/story/vladimir-putin-didnt-sound-like-he-will-alter-his-course-anytime-soon-in-annual-tv-address-13485699",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vladimir-putin-russian-president_7115295.jpg?20251219203437",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-12-19 19:06:00",
        "Headline": "The president claimed that he wanted peace with Ukraine but also indicated that he is not ready to compromise in what he refers to as the \"root causes\" of the conflict.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n It is the day when President Putin becomes Primetime Putin. For a marathon four-and-a-half hours, his annual end-of-year TV address was given uninterrupted coverage on all of Russia's main channels. The questions come from both the press and the public. The point is to reassure Russians that their leader has everything under control. That he's plugged into their problems, and will find a solution. The first question came from the moderator, and said a lot about the current mood here: \"When will there be peace?\" Judging by Putin's answer, not anytime soon. Although he said Russia wants peace and is willing to agree to a deal, he also said any deal must \"address the root causes\" of the conflict. In other words, still no sign of compromise. \n                  Ukraine 'hits Russian tanker in Mediterranean Sea for first time'\n                 \n                  Vladimir Putin's spymaster 'has telephone call with MI6 chief' as EU leaders meet to discuss Ukraine funding\n                 \n                  A British man who fought for Ukraine is jailed for 13 years by Russia\n                 According to him, the ball is in Kyiv's court. He blames Ukraine for the lack of a settlement. Unsurprisingly, he sounded smug when he spoke about the EU's decision to borrow cash to help fund Ukraine rather than use frozen Russian assets. He accused Brussels of trying to commit \"daylight robbery\" and gloated that the bloc's image as an asset safe haven had now been damaged. But not everything is going his way when it comes to the war. During his address, news broke of Ukraine's unprecedented drone attack on a Russian oil tanker in the Mediterranean. Only moments earlier, he was talking about his forces' supremacy and the possibility of new successes on the battlefield. But Kyiv continues to find new ways to cause Moscow problems, in this case more than 1,000 miles from the fighting. Read more:Russia trying to 'bully' UK, says new MI6 chiefPutin preparing for more war At home, too, there was more than a hint of discontent from the ordinary citizens who sent in questions for the \"Direct Line\" event. One text message that flashed up on the big screen read \"not a direct line but a circus\". The most common theme the public asked about was the cost of living. From the price of chicken to stagnating wages, from rising VAT to state support for young families, it's clear the creaking economy is a major concern. So did Putin succeed? Do Russians feel reassured? It didn't sound like it, listening to those questions. Nearly four years of war have clearly come at a cost. But it also didn't sound like Russia's leader will alter his course anytime soon."
    },
    {
        "title": "German court jails man for drugging, raping wife and posting videos online",
        "description": "A German man has been jailed for repeatedly drugging and sexually assaulting his wife and posting videos of the attacks online, in a case that has drawn comparisons with a high-profile French trial last year.",
        "url": "https://news.sky.com/story/german-court-jails-man-for-drugging-raping-wife-and-posting-videos-online-13485729",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-aachen-north-rhine-westphalia_7115328.jpg?20251219205249",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-19 20:43:00",
        "Headline": "Fernando P., 61, was sentenced to eight-and-a-half years in prison by a court in western Germany in a case compared to France’s Pelicot trial and its influence on consent laws.",
        "Content": "A German man has been jailed for repeatedly drugging and sexually assaulting his wife and posting videos of the attacks online, in a case that has drawn comparisons with a high-profile French trial last year. The defendant, identified as 61-year-old Fernando P in line with German privacy laws, was sentenced to eight-and-a-half years in prison by a regional court in the western city of Aachen. He was found ​guilty of aggravated rape and bodily harm. The man was ​also convicted of violating his wife's privacy for making recordings and distributing them online, ‍the court said. A spokesperson for the court in Aachen said: \"Between 2018 and 2024, the defendant repeatedly sedated his wife in ​their former home and then sexually abused her. \"He is also alleged to have uploaded videos of these acts to chat groups and internet platforms, thereby making ‍them available to other users.\" Read more from Sky News:Driver guilty of murder in Christmas Day West End rampageForeign prison staff 'offered emergency extension to visa' \n                  Epstein files latest: Famous faces, handwritten notes and flights logs - what's in latest documents\n                 \n                  Ukraine 'hits Russian tanker in Mediterranean Sea for first time'\n                 \n                  Trapped journalists rescued after mob sets fire to Bangladesh newspaper offices\n                 The man's court-appointed defence lawyer has declined to comment. The ‍verdict in Aachen was delivered in open session, but most of the trial was held behind closed doors to protect the victim's privacy. A lawyer representing the victim said the court had handled the case in a highly sensitive manner, adding that ​her client \"really has had a voice in this trial\". The lawyer, however, declined to comment on the sentence, as she had not yet discussed it with her client. Similarities to French trial  German media have compared the case to the 2024 trial of Dominique Pelicot in Avignon, France, who was sentenced to 20 years for drugging and repeatedly raping his wife and for inviting dozens of strangers to abuse her while she was unconscious. The Pelicot case led France to reform its rape laws this year, adding a clear requirement for \"freely given and informed\" consent - a standard similar to legislation in Sweden, Spain and the UK. Germany updated its rape law in 2016 to lower the threshold for prosecution, but some campaigners argue it still falls short of a fully consent-based model."
    },
    {
        "title": "Australia plans gun buyback scheme in response to Bondi Beach killings ",
        "description": "Australia is set to launch a national gun buyback scheme in response to the Bondi Beach terrorist shootings.",
        "url": "https://news.sky.com/story/australia-plans-gun-buyback-scheme-in-response-to-bondi-beach-killings-13485480",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-swimmers_7114812.jpg?20251219095722",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-19 09:07:00",
        "Headline": "Gun reforms promised as hundreds of surfers and swimmers paddled out from the Sydney beach to honour victims of the terrorist attack by forming a circle in the sea. ",
        "Content": "Australia is set to launch a national gun buyback scheme in response to the Bondi Beach terrorist shootings. Fifteen people were killed and dozens wounded on Sunday at the Sydney beach after two gunmen opened fire at people celebrating Hanukkah, the Jewish festival of lights. In the aftermath of the shooting, which authorities say appears to have been inspired by the Islamic State, patrols and policing across the country have been ramped up in an effort to prevent further violence. Both the federal government and the state government of New South Wales, where Sydney is located, have pledged reforms, including tightening gun control laws, to prevent the threat of further violence in a nation with an estimated four million firearms. Prime Minister Anthony Albanese has said the government would also strengthen hate laws. Announcing the gun buyback scheme, he cited the response to a previous Australian mass shooting - when a lone gunman killed 35 people in Tasmania's Port Arthur in 1996. \"Australia's gun laws were last substantially reformed in the wake of the Port Arthur tragedy,\" Mr Albanese said on Friday. \"The terrible events at Bondi show we need to get more guns off our streets.\" On Friday, Australia's Jewish community gathered at Bondi Beach for prayers, while hundreds of swimmers and surfers made a huge circle in the sea to honour the victims. \"Over the past two years, there's been a lot of people who have been questioning whether we're still welcome here in Australia because we saw people calling for our death on the streets on a weekly basis,\" Rabbi Yosef Eichenblatt from Sydney's Central Synagogue told ABC News, after attending the paddle-out tribute. Funerals for the victims also continued today, with Boris and Sofia Gurman, a couple killed after attempting to stop one of the gunmen, being laid to rest. Meanwhile, Ahmed al Ahmed, the hero who wrestled a gun from one of the alleged gunmen, was handed a cheque for more than A$2.5m (£1.23m) from an online fundraiser. Read more from Sky News:Democrats release more Epstein photos'All Jewish hearts are broken' says UK Chief Rabbi on Bondi visit One of the Bondi terrorists - Sajid Akram, 50, who was killed at the scene - held a firearm licence and had six guns registered. If a man in Sydney's suburbs needs \"six high-powered rifles and is able to get them under existing licensing schemes, then there's something wrong,\" Mr Albanese said. He said the government would work with states to target surplus, newly banned and illegal firearms, adding that the costs would be shared between the federal and state governments.New South Wales Premier Chris Minns announced on Friday the state government would be recalled next week to enact the \"toughest gun law reforms in the country\". Changes would include limiting firearms to four per person, tightening licensing requirements and restricting access to high-risk weapons and components. Following the 1996 Port Arthur massacre, Australia secured the surrender of about 640,000 prohibited firearms nationwide. The total cost of compensation to owners was about A$304m (£150m). Mr Albanese has faced pressure from critics who say his centre-left government has not done enough to deal with a surge in antisemitism since the start of the war in Gaza. The government said it had consistently called out antisemitism over the last two years and passed legislation to criminalise hate speech."
    },
    {
        "title": "New photos of Jeffrey Epstein's circle among thousands of files released",
        "description": "New photos of the people in Jeffrey Epstein's circle are among thousands of documents released by the US Department of Justice. ",
        "url": "https://news.sky.com/story/new-photos-of-jeffrey-epsteins-circle-among-tranche-of-300000-pages-released-13485744",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-michael-jackson-jeffrey-epstein_7115395.png?20251219215335",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-19 21:29:00",
        "Headline": "The documents, which include a host of famous faces, such as Michael Jackson, were made public hours before a legal deadline in the US following the passing of the Epstein Files Transparency Act.",
        "Content": "New photos of the people in Jeffrey Epstein's circle are among thousands of documents released by the US Department of Justice.  The tranche of material relating to the dead paedophile financier was made public shortly after 9pm UK time - hours before a legal deadline in the US following the passing of the Epstein Files Transparency Act. They include images of his former girlfriend Ghislaine Maxwell, who is serving a prison sentence after she was found guilty of child sex trafficking and other offences in connection with Epstein in 2021. Follow live updates: What's in latest documents  In one picture, she is seen posing outside 10 Downing Street, while in another, she is pictured in a swimming pool with Bill Clinton and a woman, whose face has been obscured. The former US president is also pictured in a hot tub with an unidentified woman in another picture, while a separate image shows a painting of Mr Clinton wearing a blue dress with red high heels. The context of the photos is unknown and being identified in the files does not suggest any wrongdoing. In his 2024 memoir, Citizen: My Life After The White House, Mr Clinton wrote: \"The bottom line is, even though it allowed me to visit the work of my foundation, travelling on Epstein's plane was not worth the years of questioning afterward. I wish I had never met him.\" Mr Clinton's former deputy chief of staff, Angel Urena, issued a statement after the files were released, saying the White House had been \"hiding\" the files to \"shield themselves\". \"This isn't about Bill Clinton. Never has, never will be,\" he said. \"There are two types of people here. The first group knew nothing and cut Epstein off before his crimes came to light. The second group continued relationships with him after. We're in the first.\" 'Masseuse list' Many of the documents in the release have been heavily redacted, including a \"masseuse list\", in which all 254 entries have been blacked out. All 119 pages of a grand jury document are redacted in their entirety, while scores of women's portraits, many of which appear to show them in sexual positions or are titled \"nude\", are blacked out. There are also handwritten notes, flight logs, and a contact book. Another file features a scrapbook featuring pictures of Epstein and redacted pictures of women, with the caption on one page: \"Is my cover blown?\" The US deputy attorney general, Todd Blanche, said in a letter to Congress that more than 1,200 victims and their families were identified during a review of the records, which have been redacted to protect victims. Celebrities including the late Michael Jackson, Rolling Stones frontman Sir Mick Jagger, Motown singer Diana Ross and comedian Chris Tucker are among those pictured in the files. There is no suggestion of any wrongdoing by them. Andrew Mountbatten-Windsor, who was stripped of his royal titles following controversy over his relationship with Epstein, and his ex-wife Sarah Ferguson, also appear. The former duke has been dogged by allegations that he sexually assaulted then 17-year-old Virginia Giuffre after she was trafficked by Epstein. He has always denied the accusations and any wrongdoing. He paid millions to Ms Giuffre, whom he claims to have never met, to settle a civil sexual assault claim in 2022. Andrew photo was taken inside a royal residence In one picture from the newly released files, the former prince is seen lying across five women, whose faces have been redacted, while Maxwell is stood behind smiling. The photo was taken from inside a royal residence. Sky News teams identified the location by comparing the fireplace in the background to previous photos taken in the castle. Several charities cut ties with Ms Ferguson after it emerged she had written a gushing message to Epstein, describing him as her \"supreme friend\". Her spokesperson said she wrote the note because he had threatened to sue her. Another Epstein associate, Lord Mandelson, is pictured with the late sex offender blowing the candles out on a birthday cake. It is a picture that has been published before. Lord Mandelson was fired as the ambassador to the US in September over his links to Epstein. Among the hundreds of photos included in the files is one of Epstein holding a copy of the Strange Case Of Dr Jekyll And Mr Hyde by Robert Louis Stevenson. Epstein appears to be lying on a sun lounger with the book resting on his chest, with part of the photo redacted by the justice department. The released files also included a complaint form issued against Epstein in September 1996, in which he is accused of threatening to \"burn [the complainant's] house down\". The character of the case is listed as \"child pornography\". The complainant stated that she is a professional artist and took pictures of her sisters aged 12 and 14 for her own personal art work. She said that Jeffrey Epstein stole the photos and negatives \"and is believed to have sold the pictures to potential buyers\". \"Epstein at one time requested to take pictures of young girls at swimming pools,\" the document states. \"Epstein is now threatening [redacted] that if she tells anyone about the photos he will burn her house down.\" There is \"strikingly\" little to no mention of Donald Trump in this initial drop, according to Sky News' US correspondent James Matthews. \"We know he is in the files - we've been told that by his chief of staff. But stick Donald Trump into the search engine and it comes back with nothing,\" Matthews said. \"So I assume we have to wait until tranche number two at least before we learn about Trump's involvement.\" Mr Trump denies knowledge and involvement in Epstein's criminality."
    },
    {
        "title": "US launches 'large-scale' strikes to 'eliminate' Islamic State fighters in Syria after US citizens killed in desert",
        "description": "The US has launched strikes to \"eliminate ISIS fighters, infrastructure, and weapons sites\" in Syria, according to defence secretary Pete Hegseth.",
        "url": "https://news.sky.com/story/us-launches-large-scale-strikes-to-eliminate-islamic-state-fighters-in-syria-after-us-citizens-killed-in-desert-13485788",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-syria-us-soldiers_7115506.jpg?20251219232918",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-19 22:48:00",
        "Headline": "The announcement came after three US citizens - two National Guard members and a civilian interpreter - were killed in an attack in the Syrian desert on 13 December.",
        "Content": "The US has launched strikes to \"eliminate ISIS fighters, infrastructure, and weapons sites\" in Syria, according to defence secretary Pete Hegseth. A US official described it as \"a large-scale\" strike that hit 70 targets in areas across central Syria that had IS infrastructure and weapons. \"This is not the beginning of a war - it is a declaration of vengeance. The United States of America, under President Trump's leadership, will never hesitate and never relent to defend our people,\" Mr Hegseth said in a social media post. The announcement came after three US citizens - two National Guard members and a civilian interpreter - were killed in an attack in the Syrian desert on 13 December. Three US personnel were also wounded, the Pentagon's chief spokesperson said on X. Donald Trump blamed the killings on Islamic State fighters. \"Because of ISIS's vicious killing of brave American Patriots in Syria, whose beautiful souls I welcomed home to American soil earlier this week in a very dignified ceremony, I am hereby announcing that the United States is inflicting very serious retaliation, just as I promised, on the murderous terrorists responsible,\" President Trump wrote on Truth Social. \"We are striking very strongly against ISIS strongholds in Syria, a place soaked in blood which has many problems, but one that has a bright future if ISIS can be eradicated.\" \n                  Counterterrorism review calls for Shamima Begum and other British-linked people in Syria to be repatriated\n                 \n                  Explosives and weapons seized - with 71 arrests - as Syria launches clampdown on Islamic State cells \n                 \n                  Historic al Nuri mosque reopens eight years after it was destroyed by IS\n                 He said the Syrian government was fully supportive of the US strikes against the Islamic State, warning that fighters \"will be hit harder than you have ever been hit before\". A US official said the US strike on Islamic State fighters on Friday was conducted using F-15 Eagle jets, A-10 Thunderbolt ground attack aircraft and AH-64 Apache helicopters. The official, who spoke on condition of anonymity to discuss sensitive operations, said more strikes should be expected."
    },
    {
        "title": "Suspect in Brown University shooting found dead",
        "description": "The suspect in the fatal shooting at Brown University in the US has been found dead.",
        "url": "https://news.sky.com/story/suspect-in-brown-university-shooting-found-dead-13485424",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-neves-valente-brown-university_7114634.jpg?20251219041527",
        "type": "US",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-12-19 02:05:00",
        "Headline": "Police named their suspect for the double murder as Claudio Manuel Neves Valente and revealed a Reddit post helped find the ex Brown student, who officials say also murdered academic Nuno Loureiro.",
        "Content": "By Miriam Kuepper, news reporter  The suspect in the fatal shooting at Brown University in the US has been found dead. Two students, Mukhammad Aziz Umurzokov and Ella Cook, were killed and nine were injured during the shooting inside a classroom building at the Ivy League university in Providence, Rhode Island, on Saturday. Speaking at a news conference on Thursday in Providence, police said the suspect had been found dead. He is a 48-year-old Portuguese man called Claudio Manuel Neves Valente whose last known address was in Miami, Florida, police chief Oscar Perez said. US attorney for the district of Massachusetts Leah Foley, has also named Neves Valente, as the murderer of Massachusetts Institute of Technology (MIT) professor Nuno Loureiro. The 47 year-old academic had been found dead with gunshot wounds on Monday evening, in Brookline, Massachusetts - a town 50 miles north of Boston. Neves Valente attended the same academic programme as Mr Loureiro at a university in Lisbon, Portugal, between 1995 and 2000, according to Ms Foley. He also used to be a PhD student in physics at Brown University, according to the institution's president. Neves Valente received a green card under the diversity lottery immigrant visa programme (DV1) in 2017, which Mr Trump halted with immediate effect on Friday. He was found dead in a storage facility in Salem, New Hampshire, seemingly from a self-inflicted gunshot wound. \"He may have been dead for a bit of time,\" a senior official said. Rhode Island's attorney general Peter Neronha said the suspect was found \"with a satchel, with two firearms and evidence in the car that matches exactly what we see at the scene here in Providence\". Reddit post blew case wide open Neves Valente was found after officers received a tip pointing them to a witness account posted on the social media platform Reddit. On Wednesday, police released a picture of a \"person of interest\" they wanted to speak to as part of the investigation - this person was behind the Reddit post and had encountered Neves Valente less than two hours before the shooting. \"We had that picture of that second individual, and within an hour, no more than two, that person came forward to two Providence police officers. He blew this case right open,\" Mr Neronha said. There are still \"a lot of unknowns\" regarding the motive for the Brown University shooting, Mr Neronha said, adding: \"We don't know why now, why Brown, why these students and why this classroom.\" Neves Valente was a PhD student in physics at Brown from 2000 until the spring of 2001, when he took a leave of absence before formally withdrawing effective July 2003, according to Brown University president Christina Paxson. She said that as a physics student, Neves Valente would have spent \"a great deal of time\" in the Barus and Holley building, where the shooting took place, for classes. Visa scheme that granted the murderer entry to US is suspended Neves Valente entered the US after being issued a diversity lottery immigrant visa (DV1) in 2017 and was granted a green card. On his visa, he listed Brown University as the name of his institution and the Barus and Holley building, where the physics department is located, as the address of the institution. Neves Valente also listed \"None-Dropout\" as his degree or diploma, and dates of attendance from 1 September 2001 to 1 May 2001. After Neves Valente's identity and visa status were revealed, the Trump administration immediately paused the DV1 programme, according to secretary of homeland security Kristi Noem. \"In 2017, President Trump fought to end this program, following the devastating NYC truck ramming by an ISIS terrorist, who entered under the DV1 program, and murdered eight people,\" Ms Noem wrote on X. At President Trump's direction, I am immediately directing USCIS to pause the DV1 program to ensure no more Americans are harmed by this disastrous program.\""
    },
    {
        "title": "How a Reddit post blew Brown University shooting investigation wide open",
        "description": "The suspect in the Brown University shooting was found after police received a tip referencing a post on the social media platform Reddit, they have revealed.",
        "url": "https://news.sky.com/story/how-a-reddit-post-blew-brown-university-shooting-investigation-wide-open-13485440",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brown-university-shooting_7114718.jpg?20251219074207",
        "type": "US",
        "Author": "Miriam Kuepper, news reporter",
        "Date Published": "2025-12-19 06:20:00",
        "Headline": "Frustration had mounted that the murderer had managed to get away and that a clear image of his face hadn't emerged - until a Reddit post finally put police on his trail.",
        "Content": "By Miriam Kuepper, news reporter  The suspect in the Brown University shooting was found after police received a tip referencing a post on the social media platform Reddit, they have revealed. Two students, Mukhammad Aziz Umurzokov and Ella Cook, were killed and nine were injured during the shooting inside a classroom building at the Ivy League university in Providence, Rhode Island, on Saturday. Frustration had mounted in Providence that the murderer had managed to get away and that a clear image of his face hadn't emerged - until a Reddit post finally put police on the trail of the suspect later identified as Portuguese national Claudio Manuel Neves Valente, 48. In the post on the social media platform, a witness said he saw the suspect opening a grey Nissan sedan with Florida plates parked behind the Rhode Island Historical Society, just down the road from the Barus and Holley building where the shooting happened. \"I'm being dead serious. The police need to look into a grey Nissan with Florida plates, possibly a rental,\" the poster wrote, according to an affidavit seen by Sky News. Police subsequently found the grey Nissan in CCTV footage. Officers said the information provided by the Reddit poster \"was consistent with and corroborated\" the earlier CCTV footage of the suspect - wearing a face covering - encountering another man less than two hours before the shooting. So they released still images of the second man, hoping they would be able to identify him. \"We had that picture of that second individual, and within an hour, no more than two, that person came forward to two Providence police officers. He blew this case right open,\" Rhode Island's attorney general Peter Neronha said during a news conference on Thursday. \"When you crack it, you crack it,\" he added. 'A game of cat and mouse' The witness, given the pseudonym John in the affidavit, said he first saw the masked suspect in toilets inside the Barus and Holley building at around 1.45pm, before the shooting. John said he made eye contact with the suspect. John said the suspect left the building, after which \"a game of cat and mouse\" began between them as John followed the suspect around the area, including to the parking spot of the grey Nissan. John approached the car and saw \"two fanny style bags on the rear floorboard on the passenger side\". He continued to follow the suspect, who eventually started to run away from John. When John caught up with the man, he asked him why he was \"circling the block\". The suspect did not reply, instead accusing John of \"harassing\" him. Identifying rental car was key John said he saw the suspect approach the grey Nissan one more time before walking away. The shooting inside the Barus and Holley building happened less than two hours later. The car seen on footage located due to John's Reddit post led detectives to a car rental company in Boston, Massachusetts, where officers secured video footage showing the suspect's face and a rental document identifying the suspect as Neves Valente. John later identified the vehicle in CCTV images. Police also matched the clothes Neves Valente was seen wearing at the car rental office on 1 December to those worn by the suspect on the day of the shooting on 13 December. Neves Valente was seen wearing a two-tone lighter jacket with the same colour combination and design as the subject, the same or similar black shoes with dark soles, black trousers, a blue shirt poking out from below his jacket, and glasses. Suspect 'killed another man' Police said earlier that they were also investigating a possible link between the Brown University shooting suspect and the murder of Massachusetts Institute of Technology (MIT) professor Nuno Loureiro, 47, two days later in a town 50 miles north of Boston. Mr Loureiro was found dead with gunshot wounds on Monday evening. Officials confirmed the link in the latest news conference. \"On 15 December, he murdered Nuno Loureiro at Loureiro's home in Brookline, Massachusetts,\" Leah B. Foley, US attorney for the district of Massachusetts, said. Neves Valente attended the same academic programme as Mr Loureiro at a university in Lisbon, Portugal, between 1995 and 2000, according to Ms Foley. How police found suspect's body After leaving Rhode Island for Massachusetts, Neves Valente put a Maine number plate over the rental car's plate to help conceal his identity. CCTV footage showed Neves Valente entering a flat building near Mr Loureiro's. About one hour later, he was seen entering the storage facility in New Hampshire where he was found dead, Ms Foley said. When Neves Valente's body was discovered, police also found \"a satchel, with two firearms and evidence in the car that matches exactly what we see at the scene here in Providence\", Mr Neronha said. \"[John] led us to the car, which led us to the name, which led us to the photographs of that individual renting the car, which matched the clothing of our shooter here in Providence, that matched the satchel,\" Mr Neronha added. But there are still \"a lot of unknowns\" regarding the motive, Mr Neronha said, adding: \"We don't know why now, why Brown, why these students and why this classroom.\" It was unclear whether John would receive the $50,000 reward the FBI had offered for information about the Brown shooting. Ted Docks, special agent in charge of the FBI, said it was possible when asked by reporters. \"It would be logical to think that, absolutely, that individual would be entitled to that,\" he said."
    },
    {
        "title": "Jake Paul vs Anthony Joshua: All you need to know",
        "description": "YouTube star Jake Paul will step into the ring with British heavyweight world champion Anthony Joshua in a highly anticipated (and highly criticised) boxing event. ",
        "url": "https://news.sky.com/story/jake-paul-vs-anthony-joshua-all-you-need-to-know-13485512",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jake-paul-anthony-joshua_7114962.jpg?20251219123827",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-19 10:33:00",
        "Headline": "The British former two-time heavyweight champion is taking on the YouTube influencer turned boxing star in Miami - and we've got everything you need to know. ",
        "Content": "YouTube star Jake Paul will step into the ring with British heavyweight world champion Anthony Joshua in a highly anticipated (and highly criticised) boxing event.  The event in Florida marks the end of a 14-month hiatus for Joshua, 36, while for 28-year-old Paul it will be the biggest and potentially most dangerous fight since his boxing career began in 2020. Here's everything you need to know, from timings to who's on the undercard and how to watch it. The event is taking place on Friday 19 December at the Kaseya Center in Miami - but the time difference means it will be early on Saturday 20 December for viewers in the UK. It is due to begin around 8pm local time, meaning for those in the UK, the main event will start at 1am. Ringwalks for Paul and Joshua are scheduled for 10.30pm local time, which will be 3.30am in the UK. Once in the ring, the fight will consist of eight three-minute rounds with regulation 10oz gloves being used. • Alycia Baumgardner v Leila Beaudoin - unified super-featherweight world championship • Anderson Silva v Tyron Woodley - six-round cruiserweight • Jahmal Harvey v Kevin Cervantes - six-round super-featherweight Preliminary fights, which start from 4.45pm local time and 9.45pm UK time include:  • Cherneka Johnson v Amanda Galle - undisputed bantamweight championship • Caroline Dubois v Camila Panatta - WBC lightweight world championship • Yokasta Valle v Yadira Bustillos - WBC strawweight world championship • Avious Griffin v Justin Cardona - welterweight • Keno Marley v Diarra Davis Jr - cruiserweight The main event will stream live on Netflix with no additional purchase or pay-per-view needed. All that's required is a subscription to the streaming service. Joshua, Britain's two-time world heavyweight champion, will boast an almost two-stone advantage over Paul, who has regularly fought at cruiserweight since he entered the world of boxing. At the official weigh-in on 18 December, Joshua came in at 17st 5lbs (243.4lbs) to Paul's 15st 6lbs (216lbs) - a hefty 1.9st difference. Joshua, who could not weigh more than 245Ibs, is the lightest he has been since his first fight against Oleksandr Usyk in September 2021 when he was 240lbs. For his last fight against Daniel Dubois he weighed 252.5Ibs. It is also only the second time that Paul has weighed in over cruiserweight limit - the other time was when he fought 58-year-old Mike Tyson. \"I'm going to outclass this kid, I'm just going to outclass him,\" Joshua said at the event in Miami, shrugging off confrontation as the pair raised their fists to each other. \"I'm a serious fighter, that's the difference, I'm a serious, serious fighter.\" Paul yelled that he was \"dialled in\" as he flexed his muscles on stage. He said he had told Joshua he smelled fear. \"I see something in his eyes, I truly do,\" he said. \"The pressure is on him. I'm fighting free, I've already won. This is a lose-lose situation for him.\" Given Paul's 13-fight career consists mainly of former UFC stars or faded boxing greats, this contest and Joshua's involvement has sparked a backlash in the boxing world. One of those to speak out was Tyson Fury, the British former world champion who fans want to take on Joshua in a heavyweight battle. In a post on social media Fury called Joshua a \"classless loser\" for agreeing to fight Paul. \"He's a 37-year-old at the end of his career fighting a YouTuber, a Disney Channel guy who Tommy (Fury) beat,\" he said. \"You are a classless loser coming off a 15-month knockout defeat to a local lad. Imagine if someone from Morecambe knocked me out.\" Equally, Paul's career and past fights have been criticised, particularly his win over boxing veteran Mike Tyson in November last year. Amid widespread speculation the fight was rigged, Paul's promotions company was forced to issue a statement, labelling rumours as \"incorrect and baseless\". Read more from Sky News:Actors vote for industrial action over AI concernsWarner Bros set to rebuff hostile takeover bid The odds at the time of writing put Paul at roughly a 10% chance of winning, according to Oddschecker, with Joshua at an 88.9% chance and 2.8% for a draw. However, to prepare for the showdown, Paul has been sparring with some top heavyweight contenders, including former world champion Lawrence Okolie. Okolie, who has won world titles at cruiserweight and bridgerweight, admitted he was surprised by Paul's boxing skills after spending a training camp with him. He told Sky Sports News: \"He's way better now than when I first saw him. Genuinely I was scared for him when they said he was going to fight AJ. \"If he boxes how he sparred, he's got a good chance of looking really good. \"Jake is a lot better than I thought. I think he's got a very good boxing brain, good application, and good grit.\""
    },
    {
        "title": "Retail rues tough Black Friday amid consumer caution ahead of Christmas",
        "description": "Black Friday sales do not appear to have provided much cheer for retailers amid continued consumer caution, according to official figures.",
        "url": "https://news.sky.com/story/retail-rues-tough-black-friday-amid-consumer-caution-ahead-of-christmas-13485427",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-oxford-street-shopping_6774606.jpg?20241213073303",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-19 05:31:00",
        "Headline": "Official figures suggest retail sales momentum petered out as we headed towards autumn and the government's second budget.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Black Friday sales do not appear to have provided much cheer for retailers amid continued consumer caution, according to official figures. The Office for National Statistics (ONS) reported a 0.1% decline in sales volumes during November, compared to the previous month, when the data is adjusted for seasonal effects due to the pre-Christmas shopping bonanza falling in December last year. Economists polled by the Reuters news agency had expected growth of 0.4%. The dip was worse when the effects of fuel sales were excluded. Rolling three-month data showed positive sales volumes were only propped up by strength in September. Money latest: The graduates who may want to pay off their student loan early ONS senior statistician Hannah Finselbach said: \"Retail continued to grow in the three months to November, helped by a strong performance from clothing and tech shops. \"This year November's Black Friday discounts did not boost sales as much as in some recent years, meaning that once we adjust for usual seasonality, our headline figures fell a little on the month. \n                  Bank of England rate cut to 3.75% following fall in inflation\n                 \n                  Out of a job and on benefits: Why Britain isn't working\n                 \n                  UK economy shrank by 0.1% in October, official figures show\n                 \"Meanwhile, our separate household survey showed that although some people said they were planning to do more shopping... this Black Friday than last, almost twice as many said they were planning to do less.\" The data was released against a backdrop of widespread consumer and business caution in the run-up to the budget on 26 November - held just two days before Black Friday - although promotional activity was already well underway before Rachel Reeves's speech. That period was dominated by on-off signals over income tax hikes and black holes in the public finances, but the budget itself largely backdated many of the most painful measures towards the end of the parliament. While the ONS data does little to boost retailers' expectations for the Christmas season, there was a crumb of comfort to take from a closely-watched survey released just beforehand. GfK's consumer confidence index nudged up to its joint-highest level this year - though it remained deep in negative territory. The biggest upwards contribution came from a willingness to make major purchases, despite perceptions for personal finances weighing amid continuing cost-of-living pressures in the economy. Neil Bellamy, GfK's consumer insights director, said: \"Consumers resemble a family on a festive winter hike, crossing a boggy field - plodding along stoically, getting stuck in the mud and hoping that easier conditions are not far off.\" We have had better economic news since the survey was completed. It was revealed this week that a much larger decline in the rate of inflation, to 3.2% from 3.6%, had allowed the Bank of England to cut interest rates to 3.75%. It promises a boost to spending power as borrowing costs come down further, with wage growth still rising above that pace for price growth. It is now hoped that the end of the budget circus will spark some life into the economy following two consecutive monthly contractions for output and a surge in the unemployment rate. Much of the increase has been attributed to the retail and hospitality sectors reacting to sharp rises in employment costs under the Labour government. Consumer spending accounts for around 60% of the UK economy. Richard Carter, head of fixed interest research at Quilter Cheviot, said of the outlook: \"Markets do not believe growth is coming to the UK anytime soon. \"Indeed, the UK is likely to slip into recession if the latest GDP figures are anything to go by, and there is little sign of positive momentum being generated.\""
    },
    {
        "title": "WH Smith faces City watchdog investigation over accounting woes",
        "description": "WH Smith is being investigated by the City watchdog after the company revealed accounting failures in its US operations.",
        "url": "https://news.sky.com/story/wh-smith-faces-city-watchdog-investigation-over-accounting-woes-13485464",
        "image_url": "https://e3.365dm.com/22/06/1920x1080/skynews-wh-smith-store_5805224.jpg?20220615073348",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-19 07:44:00",
        "Headline": "The Financial Conduct Authority probe relates to accounting problems uncovered in the travel-focused retailer's US operations, which have weighed heavily on its share price.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n WH Smith is being investigated by the City watchdog after the company revealed accounting failures in its US operations. The Financial Conduct Authority (FCA) said: \"The investigation concerns potential breaches of UK Listing Principles and Rules and Disclosure and Transparency Rules in relation to the matters announced by WH Smith PLC on 19 November 2025.\" On that day WH Smith revealed that Carl Cowling, its chief executive of six years who had presided over the sale of the company's UK high street business earlier in the year, had resigned after an independent review into an overstatement of earnings. Money latest: The graduates who may want to pay off their student loan early Experts from Deloitte found WH Smith's North America division - its key area for growth - had been recognising supplier income incorrectly. Profit forecasts were revised sharply lower as a result - its second such move during a year that has seen shares tumble by more than 40%. The company said on Friday that it expected profitability next year to be static on 2025 financial year levels - reported at £108m - as it reviews some of its North American businesses in the wake of the accounting problems. \n                  Chain of cricket venues backed by Ben Stokes collapses into administration | Money\n                 \n                  Retail rues tough Black Friday amid consumer caution ahead of Christmas\n                 \n                  Contactless card £100 limit to rise\n                 Its annual results were delayed twice as it got to grips with the issues. WH Smith plans to recover overpaid bonuses from its former senior executives following previous profit restatements. The company's North American review includes its InMotion business, which sells electronic and digital accessories primarily in airports. Interim boss Andrew Harrison told investors: \"The Board and I are acutely aware that we have much to do to rebuild confidence in WH Smith and deliver stronger returns as we move forward.\" The stock was a further 6% down at the market open, but that decline later petered out."
    },
    {
        "title": "Contactless card £100 limit to rise",
        "description": "The &#163;100 cap on contactless card payments is to be lifted &#8211; under changes that will allow some shoppers to set their own limits.",
        "url": "https://news.sky.com/story/contactless-card-163100-limit-to-rise-13485548",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-card-contactless-payment_7115024.jpg?20251219134346",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-12-19 12:02:00",
        "Headline": "The shake-up was among dozens of proposals suggested by the financial regulator in a letter to the Prime Minister after the government asked for ideas to boost economic growth.",
        "Content": "The £100 cap on contactless card payments is to be lifted – under changes that will allow some shoppers to set their own limits. Under the plans, from the Financial Conduct Authority (FCA), banks and other card providers with strong fraud controls will be able to set their own rules for such transactions from 19 March. They are also being encouraged to let consumers set their own limits or be granted the ability to turn off contactless payments altogether, as many banks already do. The shake-up aims to make it easier for shoppers to pay larger sums by tapping their card without using a pin code. Money latest: HMRC urges workers to check payslips over festive season The current rules set the limit for contactless card payments at £100 per transaction. The FCA said the method had become consumers' preferred way to pay. It hopes that the greater flexibility will \"incentivise firms to step up their fraud prevention, giving consumers greater protection and peace of mind\". The reforms will also allow firms to better respond to changing consumer demands, inflation and new technology, the regulator said. The popularity of paying with the tap of a card has surged in recent years. Consumer spending data from Barclays showed that 94.6% of eligible in-store card transactions were contactless in 2024. There were also 10 times more contactless transactions per month last year than there were in 2015, the bank said. Changes to such limits were among about 50 proposals suggested by the regulator in a letter to Prime Minster Sir Keir Starmer in January after the government asked for ideas to boost economic growth. Changes 'make life easier for consumers' David Geale, the FCA's executive director of payments and digital finance, said: \"Contactless is people's favoured way to pay. We want to make sure our rules provide flexibility for the future, and choice for both firms and consumers.\" Kate Nicholls, chairwoman of UKHospitality, said: \"Making life easier for consumers is a positive for any hospitality and high street business. \"Contactless has increasingly become the preferred payment method of choice for many people, and lifting the limit can mean quicker and easier experiences for consumers.\" Read more from Sky News:WH Smith faces watchdog probeRetailers rues tough Black Friday Ms Nicholls added: \"While many people still prefer to use cash or chip and pin, this change adds much-needed flexibility for providers and consumers.\" Jana Mackintosh, from industry body UK Finance, also backed the reforms. She said: \"Contactless is a very popular and secure way to pay. \"While we do not expect to see any immediate change to the £100 contactless limit, any changes made in the future will be done carefully and ensure strong security and fraud controls remain in place.\" Under current rules, banks and card providers also impose a £300 cumulative limit for contactless transactions, with the number of tap-only payments capped at five consecutively. Firms will have the scope to change the cumulative cap as well under the shake-up. The FCA said existing protections would remain in place, requiring banks to reimburse consumers in unauthorised fraud cases, such as if their card is lost or stolen."
    },
    {
        "title": "Esports team Fnatic aims to score with $100m sale",
        "description": "One of the world's biggest esports organisations is exploring a sale that could value it at about $100m (&#163;74.7m) after receiving approaches from potential buyers.",
        "url": "https://news.sky.com/story/esports-team-fnatic-aims-to-score-with-100m-sale-13485469",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vct-fnatic_7114735.jpg?20251219081343",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-19 08:12:00",
        "Headline": "Fnatic, which was founded in 2004, has hired the sports advisory firm Oakwell to explore a potential sale after receiving expressions of interest from potential bidders, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the world's biggest esports organisations is exploring a sale that could value it at about $100m (£74.7m) after receiving approaches from potential buyers. Sky News has learnt that Fnatic, which is based in east London, is working with advisers to field interest from third parties in a minority investment or full takeover of the business. Founded in 2004 by Sam Mathews and his mother Anne, Fnatic won the first-ever League of Legends World Championship seven years later, establishing it as one of the biggest names in the esports arena. Money latest: The graduates who may want to pay off their student loan early The company has appointed Oakwell Advisory, which is currently advising on deals in sports, including cycling and wrestling, to oversee talks with bidders. Sources said that interest had been expressed by investors in sports and media, seeking a flagship esports brand, as well as major media companies exploring ways to reach younger audiences. In addition to League of Legends, Fnatic has become known for its pedigree in titles including Valorant, Counter-Strike 2 and Rainbow Six. \n                  Chain of cricket venues backed by Ben Stokes collapses into administration | Money\n                 \n                  Retail rues tough Black Friday amid consumer caution ahead of Christmas\n                 \n                  WH Smith faces City watchdog investigation over accounting woes\n                 It was the first esports team to launch a professional-grade hardware division, called Fnatic Gear, which produced keyboards and mice used by elite competitors. The division sold more than one million products before disposing of the performance product line to Sony. Fnatic, which is close to breaking even, has collaborations with Gucci and other multinational brands such as Hello Kitty. The company has offices in London, Berlin and Tokyo, and was among the first Western teams to establish a dedicated training facility in South Korea. \"As a global leader in competitive gaming, we are constantly evaluating strategic opportunities to scale our international footprint and enhance our performance capabilities,\" Mr Mathews said. \"We remain open to exploring various financing options that align with our long-term vision for the continuous growth of esports and gaming.\" Fnatic has had a successful year competitively after qualifying for its ninth League of Legends World Championship and reaching the Valorant Champions 2025 Grand Final in Paris in front of more than 15,000 fans."
    },
    {
        "title": "Watchdog criticises 'unprecedented' government offer to delay local elections – as five councils confirm requests for postponement",
        "description": "The elections watchdog has criticised the government for offering to consider delaying 63 local council elections next year - as five authorities confirmed to Sky News that they would ask for a postponement.",
        "url": "https://news.sky.com/story/watchdog-criticises-unprecedented-government-offer-to-delay-local-elections-8211-as-five-councils-confirm-requests-for-postponement-13485625",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-polling-station-election_7115135.jpg?20251219153953",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-12-19 15:19:00",
        "Headline": "The Electoral Commission said voting should only be deferred in exceptional circumstances and that the move risked \"damaging public confidence\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n The elections watchdog has criticised the government for offering to consider delaying 63 local council elections next year - as five authorities confirmed to Sky News that they would ask for a postponement. On Thursday, hours before parliament began its Christmas recess, the government revealed that councils were being sent a letter asking if they thought elections should be delayed in their areas due to challenges around delivering local government reorganisation plans. The chief executive of the Electoral Commission, Vijay Rangarajan, hit out at the announcement on Friday, saying he was \"concerned\" that some elections could be postponed, with some having already been deferred from 2025. \"We are disappointed by both the timing and substance of the statement. Scheduled elections should, as a rule, go ahead as planned, and only be postponed in exceptional circumstances,\" he said in a statement. \"Decisions on any postponements will not be taken until mid-January, less than three months before the scheduled May 2026 elections are due to begin. \"This uncertainty is unprecedented and will not help campaigners and administrators who need time to prepare for their important roles.\" Mr Rangarajan added: \"We very much recognise the pressures on local government, but these late changes do not help administrators. Parties and candidates have already been preparing for some time, and will be understandably concerned.\" He said \"capacity constraints\" were not a \"legitimate reason for delaying long planned elections\", which risked \"affecting the legitimacy of local decision-making and damaging public confidence\". The watchdog chief also said there was \"a clear conflict of interest in asking existing councils to decide how long it will be before they are answerable to voters\". Sky News contacted the 63 councils that have been sent the letter about potentially delaying their elections. At the time of publication, 17 authorities had replied with their decisions, while 33 said they would make up their minds before the government's deadline of 15 January. Many councils told Sky News they were surprised at yesterday's announcement, saying that they had been fully intending to hold their polls as scheduled. They said they were now working to understand the appropriate democratic mechanism for deciding whether to request a postponement of elections. Some local authorities believe it should be a decision made by their full council, while others will leave it up to council leaders or cabinet members to decide. Multiple councils also emphasised in statements to Sky News that the ultimate decision to delay elections lay with the government. Reform UK has threatened legal action against ministers, accusing Labour and the Tories of \"colluding\" to postpone elections in order to lock other parties out of power - a sentiment echoed by Liberal Democrat leader Sir Ed Davey. But shadow local government secretary Sir James Cleverly told Sky News this morning that the Conservative Party \"wants these elections to go ahead\". Sky News understands that the national party is making that position clear to local leaders. A spokesperson for the Ministry of Housing, Communities, and Local Government, said it was taking a \"locally-led approach\", and emphasised that \"councils are in the best position to judge the impact of postponements on their area\". They added: \"These are exceptional circumstances where councils have told us they're struggling to prepare for resource-intensive elections to councils that will shortly be abolished, while also reorganising into more efficient authorities that can better serve local residents. \"There is a clear precedent for postponing local elections where local government reorganisation is in progress, as happened in 2019 and 2022.\" The five councils that confirmed they would be seeking postponements were: The councils in Chorley, and East and West Sussex, had decided prior to Thursday's government announcement that they would request a delay. An East Sussex County Council spokesperson told Sky News: \"It is welcome that the government is listening to local leaders and has heard the case for focussing our resources on delivery in East Sussex, particularly with devolution and reorganisation of local government, as well as delivering services to residents, such high priorities.\" They also pointed to the cost of electing councillors for a term of just one year, and argued that it would be \"more prudent for just one set of elections to be held in 2027\". Read more from Sky News:David Walliams dropped by publisherWoman jailed for plotting to murder husbandChristmas number one revealed West Sussex County Council echoed those reasons and said it would cost taxpayers across the county £9m to hold elections in 2026, 2027, and 2028, as currently planned. Chorley and Blackburn councils also cited the cost of delivering elections, and said they would prefer that money be spent on delivering the local government reorganisation and delivering services to local residents. Meanwhile, 12 councils confirmed to Sky News that they would not be requesting delays:"
    },
    {
        "title": "UK hopes new German law will cut migrant small boats",
        "description": "The British government is hoping a change in German law will help stop small boat crossings to the UK.",
        "url": "https://news.sky.com/story/uk-hopes-new-german-law-will-cut-migrant-small-boats-13485589",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-keir-starmer-boat-crossings_6988547.jpg?20250812031009",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-19 13:54:00",
        "Headline": "Ministers say the new measures will stop people-smuggling gangs storing small boats or engines in Germany before using them in Channel crossings.",
        "Content": "The British government is hoping a change in German law will help stop small boat crossings to the UK. The measures to criminalise the facilitation of migrant smuggling towards the UK, agreed more than a year ago, have now been passed by German legislators. British ministers say they mean gangs will no longer be able to store small boats or engines in Germany before transporting them into France to cross the Channel. It will also strengthen existing UK-German law enforcement cooperation and information sharing, they say. Home Secretary Shabana Mahmood said: \"Together with our German allies, we are cracking down on the criminal gangs operating the illegal migration trade. \"I thank minister [of the interior] Alexander Dobrindt for Germany's strong cooperation with the UK in tackling this issue. \"This government is restoring order at our borders by scaling up removals and removing the incentives that draw people here illegally.\" \n                  Keir Starmer belatedly defends Sadiq Khan after 'horrible mayor' jibe - and calls out Donald Trump comments\n                 \n                  PM issues China warning - and hits out at Brexit\n                 \n                  Budget 2025: Rachel Reeves calls for Labour MPs to unite - but admits they might not like everything\n                 The law passed on Friday is set to be in force by the end of the year, the government said. 👉Listen to Politics at Sam and Anne's on your podcast app👈 The first 10 months of 2025 saw record numbers of people crossing in small boats, although the total number of people arriving across the Channel has since fallen below the peak seen in 2022. For 28 days no crossings were recorded in official figures before hundreds of people made the journey last weekend. Illegal small boat migration has become one of the most contentious issues in British politics, symbolising frustration with migration levels and a perceived lack of control from multiple prime ministers. Prime Minister Keir Starmer moved away from the Rwanda deportation scheme and pledged instead to \"smash the gangs\" before his election victory. However, the failure to make a substantial difference to the number of people crossing has been seized upon by both the Conservatives and Reform. Others, like the Green Party's Zack Polanski, have called for safe asylum routes to be opened to discourage people crossing clandestinely. Read more:Inside the route to the ChannelFrance to intercept suspected taxi boats soon Foreign Secretary Yvette Cooper said: \"Criminal smuggler gangs operate across borders, so governments and law enforcement need to cooperate across borders to bring them down. \"This major change in German law is the result of our close partnership working to tackle illegal migration and organised immigration crime. We will continue to ramp up our international cooperation to strengthen our own border security. These are the partnerships we build abroad to make us stronger at home.\" Adrian Matthews, director of intelligence at the National Crime Agency, said: \"We welcome the legislative change in Germany. \"It will help boost our efforts against the small boats threat and it builds on our close working relationships with German partners who are key to helping disrupt organised crime groups operating from the continent.\" Chris Philp MP, shadow home secretary, said: \"Immigrants don't cross the Channel because of laws in Berlin. They cross because Labour refuse to deport them once they get here - since Labour took office, just 5 per cent of illegal arrivals have been removed. That is the pull factor, and until deportations start, the crossings will keep coming. \"Labour are outsourcing responsibility to foreign governments while doing nothing at home. Germany may close a warehouse, but Starmer still won't close the door.\""
    },
    {
        "title": "Foreign Office has been hacked - ministers 'fairly confident' individual data not at risk",
        "description": "Foreign Office data has been compromised by hackers, a minister has confirmed to Sky News, but he said the government is \"fairly confident\" that no individual data has been accessed.",
        "url": "https://news.sky.com/story/foreign-office-has-been-hacked-but-ministers-fairly-confident-individual-data-not-at-risk-13485472",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-foreign-office-fcdo_7114757.jpg?20251219085817",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-19 08:19:00",
        "Headline": "Chris Bryant says the breach was in October but he can share \"remarkably little\" because investigation takes a long time. He won't confirm report the hackers were Chinese.",
        "Content": "Foreign Office data has been compromised by hackers, a minister has confirmed to Sky News, but he said the government is \"fairly confident\" that no individual data has been accessed. Trade minister Sir Chris Bryant told Sky's Mornings with Jones and Melbourne that the government first became aware of the hack in October, and was now \"on top of it\". Sky News understands that the data stolen was on systems operated on the Home Office's behalf by the Foreign Office, which detected the breach. The Sun reported last night that a Chinese groups of hackers known as Storm 1949 targeted Foreign Office servers and had accessed information relating to visa details, with \"thousands\" of confidential documents and data stolen. But the minister told Sky News that it is \"not entirely clear\" who is responsible for the hack, and he could share \"remarkably little detail\". The Conservatives are accusing ministers of failing to protect the UK from Chinese interference. Sir Chris said: \"There certainly has been a hack at the FCDO [Foreign, Commonwealth, and Development Office], and we've been aware of that since October.\" \n                  The families of British citizens detained abroad have called for more support\n                 \n                  UK summons Russian ambassador over 'utterly unacceptable' violations into NATO airspace\n                 \n                  UK advises against all travel to Israel\n                 Pointing to high-profile hacks this year of Marks and Spencer, Jaguar Land Rover, and the British Library, the minister added: \"All of these are really important things for us to tackle and be aware of and prevent wherever possible. \"Some of the reporting has, I think, been a bit more speculation than accurate.\" He said he could share \"remarkably little\" in the way of facts about the hack because \"quite often the investigation takes quite a long time\". \"We managed to close the hole, as it were, very quickly,\" Sir Chris said. \"It was a technical issue in one of our sites, I gather. And we're fairly confident that there's a low risk of any individual actually being affected by this. \"I know that some of the reports have said, potentially, various things could happen. I think that that's a bit more speculation than is helpful. So I don't want to scaremonger about this. We are on top of it. \"And also it's not entirely clear where this has come from. I know everybody's speculating about that as well. That is not entirely clear either.\" Conservative shadow foreign secretary Dame Priti Patel shared a report that said the hack was Chinese and wrote on X: \"China undermines our security, institutions and democracy but Labour is failing to protect Britain from China's foreign interference in our country. \"[Sir Keir] Starmer kowtows to China at every opportunity and cannot be trusted to protect our national interest.\""
    },
    {
        "title": "Too late to investigate Farage election expenses, Essex Police say",
        "description": "It is too late to investigate whether Nigel Farage broke election law on spending at the general election, Essex Police has said.",
        "url": "https://news.sky.com/story/too-late-to-investigate-farage-election-expenses-essex-police-say-13485447",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-nigel-farage-reporters_6595057.jpg?20240630145054",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-19 06:46:00",
        "Headline": "Allegations that Nigel Farage broke spending rules happened more than a year ago and can't be probed, the force has said. Election financing crimes must be reported within a year",
        "Content": "It is too late to investigate whether Nigel Farage broke election law on spending at the general election, Essex Police has said. The Reform UK leader had been referred to the police following claims by a former member of his campaign team that the campaign to get Mr Farage elected in Clacton last year overspent. There are tight rules on campaign spending in the UK, including separating what is spent as part of a national campaign and what is spent directly in a constituency. However, there is a one-year statutory time limit to begin any investigation, which Essex Police said has now elapsed. The force said: \"We have assessed a report relating to an allegation around misreported expenditure by a political candidate in connection with the general election in July 2024. \"Having regard to the Representation of the People Act 1983, which states any prosecution for such an offence must commence within one year, it has been concluded that this report falls outside of the stated statutory time limit, and no investigation can take place.\" Read more:Farage's ex-school mate on claims of racist commentsReform get record £9m donation from ex-Tory donor The allegations of overspending on Mr Farage's campaign were first reported at the start of last week, with Richard Everett - also a former Reform councillor - claiming he had passed information to the Metropolitan Police. Reform was quick to deny the allegations, and accused Mr Everett of being a \"disgruntled former councillor\" who was expelled from the party \"several months ago\". The overspending reportedly included failing to declare spending on leaflets, banners, utility bills and the refurbishment of a bar in its Clacton campaign office - although Mr Everett said Mr Farage was \"blissfully unaware\" as others managed the finances. Labour Party chair Anna Turley had also written to the Electoral Commission about the claims. Responding yesterday, the elections watchdog said: \"We have responded to Anna Turley MP's correspondence, which raised questions about Reform UK's spending at the 2024 general election. \"After carefully considering the information presented in the letter, we did not identify any expenditure relating to Mr Farage's election campaign in Clacton that should have been declared in Reform UK's national expenditure.\""
    },
    {
        "title": "BMA resident doctors in Scotland vote to strike in January",
        "description": "Resident doctors in Scotland have voted to go on strike in January &#8211; as their union called on the devolved government to present a \"credible\" pay offer.",
        "url": "https://news.sky.com/story/bma-resident-doctors-in-scotland-vote-to-strike-in-january-13485684",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-strikes-bma-junior-doctors_6496070.jpg?20240320162410",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-19 18:15:00",
        "Headline": "The Scottish health secretary said he was \"disappointed\" by the decision, as he offered to meet with union officials for talks on Monday.",
        "Content": "Resident doctors in Scotland have voted to go on strike in January – as their union called on the devolved government to present a \"credible\" pay offer. The British Medical Association (BMA) Scotland announced on Friday that 92% of its members who voted in the ballot were in favour of the industrial action. The turnout was 58%. The strikes are scheduled to start at 7am on Tuesday 13 January, and end at 7am on Saturday 17 January – unless progress is made in pay talks. The announcement comes amid an ongoing strike action by resident doctors in England, which began on Wednesday and will last until Monday. Chris Smith, chair of the BMA Scottish resident doctors committee, said its members were \"united in anger\", and claimed the Scottish government had reneged on a pay deal it agreed two years ago. He said: \"We are simply asking for the government to deliver on what they previously promised, an offer which will provide a meaningful, continued and crucially credible step on the path towards addressing the pay erosion which resident doctors have suffered from since 2008. \"If they had kept to their commitment, and the trajectory towards pay restoration, this dispute could have been averted. \"And there is still time to avoid strikes – BMA Scotland resident doctors remain committed to the deal when it is being upheld in its entirety.\" In 2023, junior doctors – as resident doctors used to be called – in Scotland agreed to a new pay deal, and to further talks in each year \"to make credible progress on the path towards pay restoration\", the union said. BMA Scotland said in October that resident doctors were offered a 4.25% uplift for 2025/26, which it said broke the agreement with the Scottish government. Mr Smith said at the time: \"We are already 17% worse off than our peers were in 2008 and this would have made that worse\". The Scottish health secretary said on Friday that he was \"disappointed\" in the vote, and offered to meet with Mr Smith for talks on Monday. Neil Gray said the 4.25% uplift was \"part of a two-year deal\" and was \"the same as accepted by nurses and other NHS staff\". \"This means by 2027, we will have delivered a cumulative pay rise of 35% in four years,\" he added. \"Our top priority for our patients and the workforce is to improve waiting times, access to the NHS and positive outcomes. Industrial action will put all that progress at risk.\" Read more from Sky News:UK Christmas number 1 revealedDavid Walliams dropped by publisher Meanwhile, resident doctors' strikes in England are set to enter their fourth day, after the BMA said 83% of English members had rejected a fresh proposal from the Labour government. Sir Keir Starmer called the action \"irresponsible\", while Health Secretary Wes Streeting accused the union of a \"shocking disregard for patient safety\". The BMA said the strike was \"entirely avoidable\" and has demanded a \"credible offer\" for English doctors to avert \"real-terms pay cuts\". Sky News has contacted the Scottish government for comment."
    },
    {
        "title": "TikTok faces legal action over moderator cuts",
        "description": "TikTok is being threatened with legal action over cuts to its UK online safety teams.",
        "url": "https://news.sky.com/story/tiktok-faces-legal-action-over-moderator-cuts-13485485",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-tiktok-protest-moderator_7024625.jpg?20251219095538",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-12-19 09:21:00",
        "Headline": "TikTok is being accused of threatening safety workers with redundancy days before they were due to vote on forming a union.",
        "Content": "\n          Science and technology reporter\n       TikTok is being threatened with legal action over cuts to its UK online safety teams. In August, the social media company announced more than 400 workers would lose their jobs, with AI replacing some of the workers and other jobs being rehired abroad. TikTok is being accused of threatening those safety workers with redundancy days before they were due to vote on forming a union. Read more: TikTok moderators warn users may be at risk Now, two moderators have sent a legal letter to TikTok laying out the terms of a potential legal case on grounds of unlawful detriment and automatic unfair dismissal. Unlawful detriment is when an employer treats a worker unfairly because they used a protected employment right, for example, being a union representative, asking for flexible working or whistleblowing about the company. \"In June, TikTok said it was going to hire hundreds more content moderators, then two months later, they fired everyone,\" said Stella Caram, head of legal at Foxglove, a non-profit supporting the moderators. \n                  Porn provider fined £1m by Ofcom as impact of new online safety rules revealed\n                 \n                  OpenAI denies allegations ChatGPT is responsible for teenager's death\n                 \n                  TikTok to alert parents when teens post public videos\n                 \"What changed? Workers exercised their legal right to try to form a trade union. This is obvious, blatant and unlawful union-busting,\" she said. TikTok has been given one month to respond to the legal claim. A TikTok spokesperson said: \"We once again strongly reject this baseless claim. \"These changes were part of a wider global reorganisation, as we evolve our global operating model for Trust and Safety with the benefit of technological advancements to continue maximising safety for our users.\" As well as Foxglove, the two moderators launching the case are working with the United Tech & Allied Workers (UTAW), part of the Communication Workers' Union, and law firm Leigh Day. In exclusive interviews last month, three whistleblowers told Sky News the cuts would put UK users at risk, a claim repeated by Julio Miguel Franco, one of the moderators behind the legal action. \"TikTok needs to tell the truth,\" he said. \"When it says AI can do our job of keeping people safe on TikTok, it knows that's rubbish. \"Instead, they want to steal our jobs and send them to other countries where they can pay people less and treat them worse. The end result is TikTok becomes less safe for everyone.\" Read more on social media:Online sleuths and fake news: The world of missing peopleParents of sextortion victim who took his own life sue Meta Internal documents seen by Sky News show that TikTok planned to keep its human moderators in London for at least the rest of 2025. The documents lay out the increasing need for dedicated moderators because of the growing volume and complexity of moderation. TikTok's head of governance, Ali Law, also told MPs in February that \"human moderators ... have to use their nuance, skills and training\" to be able to moderate hateful behaviour, misinformation and misleading information. After a series of letters between TikTok and MPs, Dame Chi Onwurah, chair of the science and technology select committee, said she was \"deeply\" concerned about the cuts. \"There is a real risk to the lives of TikTok users,\" she said. Last month, in an exclusive sitdown with Sky News, however, Mr Law said user safety would not be compromised. \"We set a high benchmark when it comes to rolling out new moderation technology. \"In particular, we make sure that we satisfy ourselves that the output of existing moderation processes is either matched or exceeded by anything that we're doing on a new basis. \"We also make sure the changes are introduced on a gradual basis with human oversight so that if there isn't a level of delivery in line with what we expect, we can address that.\""
    },
    {
        "title": "Esports team Fnatic aims to score with $100m sale",
        "description": "One of the world's biggest esports organisations is exploring a sale that could value it at about $100m (&#163;74.7m) after receiving approaches from potential buyers.",
        "url": "https://news.sky.com/story/esports-team-fnatic-aims-to-score-with-100m-sale-13485469",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-vct-fnatic_7114735.jpg?20251219081343",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-19 08:12:00",
        "Headline": "Fnatic, which was founded in 2004, has hired the sports advisory firm Oakwell to explore a potential sale after receiving expressions of interest from potential bidders, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the world's biggest esports organisations is exploring a sale that could value it at about $100m (£74.7m) after receiving approaches from potential buyers. Sky News has learnt that Fnatic, which is based in east London, is working with advisers to field interest from third parties in a minority investment or full takeover of the business. Founded in 2004 by Sam Mathews and his mother Anne, Fnatic won the first-ever League of Legends World Championship seven years later, establishing it as one of the biggest names in the esports arena. Money latest: The graduates who may want to pay off their student loan early The company has appointed Oakwell Advisory, which is currently advising on deals in sports, including cycling and wrestling, to oversee talks with bidders. Sources said that interest had been expressed by investors in sports and media, seeking a flagship esports brand, as well as major media companies exploring ways to reach younger audiences. In addition to League of Legends, Fnatic has become known for its pedigree in titles including Valorant, Counter-Strike 2 and Rainbow Six. \n                  Chain of cricket venues backed by Ben Stokes collapses into administration | Money\n                 \n                  Retail rues tough Black Friday amid consumer caution ahead of Christmas\n                 \n                  WH Smith faces City watchdog investigation over accounting woes\n                 It was the first esports team to launch a professional-grade hardware division, called Fnatic Gear, which produced keyboards and mice used by elite competitors. The division sold more than one million products before disposing of the performance product line to Sony. Fnatic, which is close to breaking even, has collaborations with Gucci and other multinational brands such as Hello Kitty. The company has offices in London, Berlin and Tokyo, and was among the first Western teams to establish a dedicated training facility in South Korea. \"As a global leader in competitive gaming, we are constantly evaluating strategic opportunities to scale our international footprint and enhance our performance capabilities,\" Mr Mathews said. \"We remain open to exploring various financing options that align with our long-term vision for the continuous growth of esports and gaming.\" Fnatic has had a successful year competitively after qualifying for its ninth League of Legends World Championship and reaching the Valorant Champions 2025 Grand Final in Paris in front of more than 15,000 fans."
    },
    {
        "title": "David Walliams dropped by publisher HarperCollins UK after allegations of inappropriate behaviour",
        "description": "David Walliams has been dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women.",
        "url": "https://news.sky.com/story/david-walliams-dropped-by-publisher-harpercollins-uk-13485653",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/david-walliams-author-comedian_7115245.jpg?20251219185419",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-19 16:26:00",
        "Headline": "A spokesperson for the comedian and children's author said he \"strongly denies\" the claims. They also said the 54-year-old was taking legal advice.",
        "Content": "David Walliams has been dropped by his publisher HarperCollins UK following allegations of inappropriate behaviour towards women. A spokesperson for the company said it had decided not to release any new titles by Walliams \"after careful consideration, and under the leadership of its new CEO\". \"HarperCollins takes employee well-being extremely seriously and has processes in place for reporting and investigating concerns,\" they added. \"To respect the privacy of individuals, we do not comment on internal matters.\" In a statement later on Friday, a spokesperson for the comedian and children's author said: \"David has never been informed of any allegations raised against him by HarperCollins. \"He was not party to any investigation or given any opportunity to answer questions. David strongly denies that he has behaved inappropriately and is taking legal advice.\" It follows a report from The Telegraph that Walliams was dropped after an investigation into allegations of inappropriate behaviour towards young women. The 54-year-old, who shot to fame with the BBC sketch show Little Britain, is one of the country's best-selling children's writers. He has written more than 40 books, which have sold more than 60 million copies worldwide and been translated into 55 languages, according to his website. His first children's book, The Boy in the Dress, was published by HarperCollins in 2008, and he was awarded an OBE in 2017 for services to charity and the arts. Walliams is also known for Come Fly With Me, another BBC sketch show, and was formerly part of the judging panel for ITV's Britain's Got Talent. He left the show in 2022 after a recording of him making disparaging comments about contestants was leaked. The remarks were understood to have been both derogatory and sexually explicit, referring to one contestant as a \"c***\" and saying of another: \"She thinks you want to f*** her, but you don't\". Walliams later released a statement apologising for the \"disrespectful comments\" and saying they were private conversations that were never meant to be shared. HarperCollins UK announced in October that it had appointed Kate Elton as its new chief executive, following the departure of former boss Charlie Redmayne."
    },
    {
        "title": "Kylie Minogue secures her first Christmas number one in UK",
        "description": "Kylie Minogue has secured her first Christmas number one in the UK with her hit track XMAS.",
        "url": "https://news.sky.com/story/kylie-minogue-secures-her-first-christmas-number-one-in-uk-13485669",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kylie-minogue-christmas-number-one_7115103.jpg?20251219192806",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-19 17:13:00",
        "Headline": "The Australian pop star said that being top of the festive chart was \"the most wonderful gift\" and that she was grateful for everyone who had listened to her song and shared \"the love\".",
        "Content": "Kylie Minogue has secured her first Christmas number one in the UK with her hit track XMAS. The Australian pop star, 57, is the first solo female artist in 12 years to secure the coveted festive spot, after Sam Bailey with Skyscraper in 2013, according to The Official Charts Company. Minogue has also become the first woman to have number one singles across four different decades. Her success comes after two consecutive years in which Last Christmas by Wham! was top. Minogue said it was \"hard to put into words\" how special it felt to lead the singles chart. She said: \"Being Christmas number one really is the most wonderful gift. I'm so thankful to everyone who's been listening and sharing the love and I'm wishing you all a very Merry Christmas.\" Her single - pronounced X-M-A-S - is accompanied by a music video that shows Minogue teaching a dance to a group of children and adults. \n                  Will there be a white Christmas in the UK this year? \n                 \n                  Queen hosts festive tea for children with severe illnesses\n                 \n                  GCHQ releases annual Christmas puzzle - can you solve it?\n                 It also features a special appearance from Abba's Bjorn Ulvaeus. Xmas is followed in the singles chart by Last Christmas, with Mariah Carey's All I Want For Christmas Is You at three. The top five is completed by Brenda Lee's Rockin' Around The Christmas Tree at four and charity single Lullaby by Together For Palestine at number five - this week's highest new entry. Read more:The recipe for a Christmas number oneWham! make chart history Kylie has previously topped the singles chart on seven other occasions. Her other bestselling songs were I Should Be So Lucky (1988), Especially For You (1988), Hand On Your Heart (1989), Tears On My Pillow (1990), Spinning Around (2000), Can't Get You Out Of My Head (2001) and Slow (2003). Martin Talbot, chief executive of the Official Charts Company, said Minogue may now be placed to challenge Mariah Carey as the \"queen of Christmas\". He said: \"Congratulations to Kylie - what an amazing achievement by our adopted national treasure.\" The last Australian artist to earn the Christmas number one title was Oscar-winning actress Nicole Kidman, who collaborated with Robbie Williams on Somethin' Stupid in 2001."
    },
    {
        "title": "Jake Paul vs Anthony Joshua: All you need to know",
        "description": "YouTube star Jake Paul will step into the ring with British heavyweight world champion Anthony Joshua in a highly anticipated (and highly criticised) boxing event. ",
        "url": "https://news.sky.com/story/jake-paul-vs-anthony-joshua-all-you-need-to-know-13485512",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-jake-paul-anthony-joshua_7114962.jpg?20251219123827",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-19 10:33:00",
        "Headline": "The British former two-time heavyweight champion is taking on the YouTube influencer turned boxing star in Miami - and we've got everything you need to know. ",
        "Content": "YouTube star Jake Paul will step into the ring with British heavyweight world champion Anthony Joshua in a highly anticipated (and highly criticised) boxing event.  The event in Florida marks the end of a 14-month hiatus for Joshua, 36, while for 28-year-old Paul it will be the biggest and potentially most dangerous fight since his boxing career began in 2020. Here's everything you need to know, from timings to who's on the undercard and how to watch it. The event is taking place on Friday 19 December at the Kaseya Center in Miami - but the time difference means it will be early on Saturday 20 December for viewers in the UK. It is due to begin around 8pm local time, meaning for those in the UK, the main event will start at 1am. Ringwalks for Paul and Joshua are scheduled for 10.30pm local time, which will be 3.30am in the UK. Once in the ring, the fight will consist of eight three-minute rounds with regulation 10oz gloves being used. • Alycia Baumgardner v Leila Beaudoin - unified super-featherweight world championship • Anderson Silva v Tyron Woodley - six-round cruiserweight • Jahmal Harvey v Kevin Cervantes - six-round super-featherweight Preliminary fights, which start from 4.45pm local time and 9.45pm UK time include:  • Cherneka Johnson v Amanda Galle - undisputed bantamweight championship • Caroline Dubois v Camila Panatta - WBC lightweight world championship • Yokasta Valle v Yadira Bustillos - WBC strawweight world championship • Avious Griffin v Justin Cardona - welterweight • Keno Marley v Diarra Davis Jr - cruiserweight The main event will stream live on Netflix with no additional purchase or pay-per-view needed. All that's required is a subscription to the streaming service. Joshua, Britain's two-time world heavyweight champion, will boast an almost two-stone advantage over Paul, who has regularly fought at cruiserweight since he entered the world of boxing. At the official weigh-in on 18 December, Joshua came in at 17st 5lbs (243.4lbs) to Paul's 15st 6lbs (216lbs) - a hefty 1.9st difference. Joshua, who could not weigh more than 245Ibs, is the lightest he has been since his first fight against Oleksandr Usyk in September 2021 when he was 240lbs. For his last fight against Daniel Dubois he weighed 252.5Ibs. It is also only the second time that Paul has weighed in over cruiserweight limit - the other time was when he fought 58-year-old Mike Tyson. \"I'm going to outclass this kid, I'm just going to outclass him,\" Joshua said at the event in Miami, shrugging off confrontation as the pair raised their fists to each other. \"I'm a serious fighter, that's the difference, I'm a serious, serious fighter.\" Paul yelled that he was \"dialled in\" as he flexed his muscles on stage. He said he had told Joshua he smelled fear. \"I see something in his eyes, I truly do,\" he said. \"The pressure is on him. I'm fighting free, I've already won. This is a lose-lose situation for him.\" Given Paul's 13-fight career consists mainly of former UFC stars or faded boxing greats, this contest and Joshua's involvement has sparked a backlash in the boxing world. One of those to speak out was Tyson Fury, the British former world champion who fans want to take on Joshua in a heavyweight battle. In a post on social media Fury called Joshua a \"classless loser\" for agreeing to fight Paul. \"He's a 37-year-old at the end of his career fighting a YouTuber, a Disney Channel guy who Tommy (Fury) beat,\" he said. \"You are a classless loser coming off a 15-month knockout defeat to a local lad. Imagine if someone from Morecambe knocked me out.\" Equally, Paul's career and past fights have been criticised, particularly his win over boxing veteran Mike Tyson in November last year. Amid widespread speculation the fight was rigged, Paul's promotions company was forced to issue a statement, labelling rumours as \"incorrect and baseless\". Read more from Sky News:Actors vote for industrial action over AI concernsWarner Bros set to rebuff hostile takeover bid The odds at the time of writing put Paul at roughly a 10% chance of winning, according to Oddschecker, with Joshua at an 88.9% chance and 2.8% for a draw. However, to prepare for the showdown, Paul has been sparring with some top heavyweight contenders, including former world champion Lawrence Okolie. Okolie, who has won world titles at cruiserweight and bridgerweight, admitted he was surprised by Paul's boxing skills after spending a training camp with him. He told Sky Sports News: \"He's way better now than when I first saw him. Genuinely I was scared for him when they said he was going to fight AJ. \"If he boxes how he sparred, he's got a good chance of looking really good. \"Jake is a lot better than I thought. I think he's got a very good boxing brain, good application, and good grit.\""
    }
]