[
    {
        "title": "Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse",
        "description": "Ten child protection organisations have written an urgent letter to the home secretary expressing concern about the omission of child sexual abuse from the government's violence against women and girls strategy, following a Sky News report.&#160;",
        "url": "https://news.sky.com/story/urgent-letter-to-home-secretary-over-violence-against-women-and-girls-strategy-as-it-omits-child-abuse-13417619",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-child-sexual-abuse_7000042.jpg?20250824150627",
        "type": "Home",
        "Author": "Mollie Malone",
        "Date Published": "2025-08-24 23:01:00",
        "Headline": "Groups including the NSPCC, Barnardo's and The Children's Society wrote to Yvette Cooper to say that violence against women and girls and child sexual abuse are \"inherently and deeply connected\".",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Ten child protection organisations have written an urgent letter to the home secretary expressing concern about the omission of child sexual abuse from the government's violence against women and girls strategy, following a Sky News report.  Groups including the NSPCC, Barnardo's and The Children's Society wrote to Yvette Cooper to say that violence against women and girls (VAWG) and child sexual abuse are \"inherently and deeply connected\", suggesting any \"serious strategy\" to address VAWG needs to focus on child sexual abuse and exploitation. The letter comes after Sky News revealed an internal Home Office document, titled Our draft definition of VAWG, which said that child sexual abuse and exploitation is not \"explicitly within the scope\" of their strategy, due to be published in September. Responding to Sky News' original report, Poppy Eyre, who was sexually abused and raped by her grandfather when she was four, said: \"VAWG is - violence against women and girls. If you take child sexual abuse out of it, where are the girls?\" The Centre of Expertise on Child Sexual Abuse, which is funded by the Home Office and a signatory to the letter, estimates 500,000 children in England and Wales are sexually abused every year. The NSPCC \"welcome\" the government's pledge to halve VAWG in a decade, but is \"worried that if they are going to fulfil this commitment, the strategy absolutely has to include clear deliverable objectives to combat child sexual abuse and exploitation too\", the head of policy, Anna Edmundson, told Sky News. She warned the government \"will miss a golden opportunity\" and the needs of thousands of girls will be \"overlooked\" if child sexual abuse and exploitation is not \"at the heart of its flagship strategy\". The government insists the VAWG programme will include action to tackle child sexual abuse, but says it also wants to create a distinctive plan to \"ensure those crimes get the specialist response they demand\". \"My message to the government is that if you're going to make child sexual abuse a separate thing, we need it now,\" Poppy told Sky News. Read more from Sky News:Why Donald Trump believes he 'deserves the Nobel Peace Prize'Bank holiday temperatures to climb close to 30C before rain arrives Rape Crisis, which is one of the largest organisations providing support to women in England and Wales, shares these concerns. It wants plans to tackle child sexual abuse to be part of the strategy, and not to sit outside it. \"If a violence against women and girls strategy doesn't include sexual violence towards girls, then it runs the risk of being a strategy for addressing some violence towards some females, but not all,\" chief executive Ciara Bergman said. A Home Office spokesperson said the government is \"working tirelessly to tackle the appalling crimes of violence against women and girls and child sexual exploitation and abuse, as part of our Safer Streets mission\". \"We are already investing in new programmes and introducing landmark laws to overhaul the policing and criminal justice response to these crimes, as well as acting on the recommendations of Baroness Casey's review into group-based Child Sexual Exploitation, and the Independent Inquiry into Child Sexual Abuse,\" they added."
    },
    {
        "title": "Resistance to racism - the reason behind Notting Hill Carnival as important as ever",
        "description": "For those who have never been to the Notting Hill Carnival, undoubtedly, there is a level of hysteria surrounding what happens here.",
        "url": "https://news.sky.com/story/resistance-to-racism-the-reason-behind-notting-hill-carnival-as-important-as-ever-13417918",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-carnival-notting-hill_7000565.jpg?20250824213518",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-24 18:43:00",
        "Headline": "This is a place where community comes together. You don't walk around constantly looking over your shoulder. The reasons for marking this - resistance against racism - are important to mark today as they ever were.",
        "Content": "\n          Arts and entertainment correspondent\n        For those who have never been to the Notting Hill Carnival, undoubtedly, there is a level of hysteria surrounding what happens here. From its 60s roots in resistance against racism, it has snowballed in size. The challenge for organisers nowadays is that fundamentally, what it's grown into is at odds with what this event stands for. How do you control and manage something which, at its heart, is about recognising and representing freedom? In reality, that requires police. A lot of police. They are everywhere. Largely keeping a respectful distance. Positioned like chess pieces ready to be moved to wherever those watching on from CCTV might dictate they're needed.  Does it feel any unsafer than being at, say, Glastonbury? Not particularly. But arguably, being stuck in a bottleneck of crowds on a small city road on a sweaty day in August, you can certainly feel more hemmed in than if you were out in a field in Somerset. For the young kids, dancing and dressing up to take part in Sunday's official parades, the appeal is obvious. \n                  Notting Hill Carnival: Streets filled with colourful costumes and music for annual west London event\n                 \n                  Family of mother killed at Notting Hill Carnival say it's an 'unmanageable event' and is 'unsafe'\n                 \n                  100 arrests ahead of Notting Hill Carnival in 'intelligence-led interventions', Met Police say\n                 The joy and pride you see from those taking part is heartwarming, and it is a glorious spectacle. Common sense dictates that few parents should or do attempt to drag little ones past the roads where blaring sound systems are set up, where you will find those intent on being inebriated from early on. This being family day, you will find balloons, but they are not being held by children. Nos is openly inhaled, yes, Carnival has an edgy side. That crime and violence is the conversation that surrounds this Carnival is frustrating to say the least for those who've grown up coming here. I spend some time talking to Michelle, who used to live in Chiswick. She's since moved to the north of England but comes back each year especially. I ask if she welcomes the number of police, and she says no. \"I'd like more….I saw someone get bottled in front of me, pouring out with blood….and it's quite scary to be around that kind of, you know, aura.\" Why come then?, I ask. \"I get to see my family, my nephews, my nieces, my aunties and it's all about culture, history and heritage.\" As I walk around with Ian Comfort, chair of Notting Hill Carnival, he makes the point that all two million people who will come here over two days are never here at once. Ironically, after offering to guide me to a different location, we get stuck in a very slow-moving crowd of revellers. Out the other side, he apologises but says: \"That was fine though, you're alright? And didn't you find everyone is so happy?\". It's true, they were. Read more from Sky News:Bank holiday temperatures to climb close to 30C before rain arrivesBridgerton creator reacts to claims of 'woke' casting While critics have suggested it might be safer all around to shift this entire event to a location like Hyde Park, one woman tells me absolutely not. \"It's a convenient way to box off black people, so no.\" And that's the point. This is a place where community comes together. You don't walk around constantly looking over your shoulder. The reasons for marking this - resistance against racism - are important to mark today as they ever were."
    },
    {
        "title": "Is it time for gunboats to help stop the people smugglers?",
        "description": "Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem.",
        "url": "https://news.sky.com/story/is-it-time-for-gunboats-to-help-stop-the-people-smugglers-13417741",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-france-small-boats_6932334.jpg?20250601093505",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-08-24 15:14:00",
        "Headline": "With the PM's and Labour's poll numbers tanking as the latest official figures confirm the numbers of migrants and small boat crossings are increasing at a shocking rate, is it now time for a different approach?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem. The former director of public prosecutions would appear to see overhauling court procedures and the legal process as the answer to any tricky situation. Yes, the proposed fast-track asylum appeals process is fine as far as it goes. But for a government confronted with a massive migrant crisis, opponents claim it's mere tinkering. And welcome and worthy as it is, it isn't going to \"smash the gangs\", stop the boats or act as a powerful deterrent to the people smugglers plying their trade in the Channel. As protests outside migrant hotels grow noisier and clashes between rival demonstrators become potentially violent, do we hear this cry from the voters: \"What do we want? An independent commission of professional adjudicators! When do we want it? As soon as legislative time allows!\" Of course not. Even those who don't agree with Nigel Farage's apparent indifference - in his Times interview this weekend, to asylum seekers sent back to Afghanistan being killed or tortured by the Taliban - are demanding bolder and more radical measures from the government. \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 And those who tire of the shadow home secretary Chris Philp's constant criticisms of the government would probably accept that attempts to stop the boats in the Channel are not just useless but farcical. On a visit to the Channel earlier this month, Mr Philp said: \"There's a boat full of illegal immigrants crossing right in front of me. The French warship is escorting it and making no attempt at all to stop it.\" Later, assessing his trip, Mr Philp said: \"The people-smuggling conveyor belt is now a round trip, paid for by British taxpayers. \"We were in the middle of the Channel, just on the UK side of the border, witnessing the French handing over two boatloads of illegal migrants, Border Force picking them out, providing a taxi service back to the UK.\" So is Border Force fit for purpose? The Sunday Express reports that Martin Hewitt, Labour's Border Security Commander, is the highest-paid civil servant in the Home Office, with a salary of £200,000, more than the prime minister. Some top officials have also received bonuses. Philip Douglas, director general of the Border Force, received bonuses of up to £15,000 in 2024-25 on top of his £140,000-£145,000 salary. Why, given the force's lamentable performance? Given that Border Force clearly cannot cope with the small boat crossings, is it time to bring in the Royal Navy and some gunboat diplomacy, since the French government clearly is not helping to stop the boats? It's happened before, after all. In January 2022, former Prime Minister Boris Johnson announced the Royal Navy would take command of counter-migration operations in the Channel to deter migrant crossings and intercept boats before they reached British shores. It was called Operation Isotrope. But after squabbling between the Home Office and the Ministry of Defence (MoD) and the mayor of Calais attacking a \"declaration of maritime war\", Rishi Sunak's government handed control back to the Home Office. Is it time for a rethink? Earlier this month, the Labour peer Lord Glasman, founder of the socially conservative Blue Labour group, urged the PM to use the Navy and drones in the Channel to stop small boat crossings. In May, however, armed forces minister Luke Pollard slapped down the former Reform UK, now independent, MP Rupert Lowe in the Commons when he asked what assessment had been made of the Navy's capacity to intercept small boats. \"Defence assets are procured for defence tasks,\" Mr Pollard said, dismissively. The Navy's primary role, he added, was to safeguard maritime security, including monitoring and shadowing foreign warships in British waters. But at the very least, the Royal Navy could provide better surveillance, since Border Force seems to be failing in that role, and just the sight of naval vessels in the Channel could be a deterrent. Sir Keir has put his faith in his \"one in, one out\" deportation deal with French President Emmanuel Macron and now in his asylum appeals shake-up. The government's opponents claim neither will be an effective deterrent, however. Farage is proposing \"mass deportation\" of hundreds of thousands of asylum seekers who come to the UK on small boats. Labour says he's \"plucking numbers out of the air\". But with the PM's and Labour's poll numbers tanking as the latest official figures confirm the numbers of migrants and small boat crossings are increasing at a shocking rate, is it now time for a different approach? Another Starmer U-turn, given the MoD's hostility to the Navy's involvement up to now? Gunboats, anyone?"
    },
    {
        "title": "Family pay tribute to 'beloved' man who died in 'accident while working on fairground ride'",
        "description": "A man who died after suffering \"serious head injuries\" while \"working on a fairground ride\" has been named as Corrie Lee Stavers.",
        "url": "https://news.sky.com/story/family-pay-tribute-to-beloved-man-who-died-in-accident-while-working-on-fairground-ride-13417781",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-corrie-lee-stavers_7000320.jpg?20250824174427",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-24 16:00:00",
        "Headline": "The Spanish City Summer Funfair, which is in Whitley Bay's Spanish City Plaza area, has been shut \"until further notice\" and the Health and Safety Executive has been informed.",
        "Content": "A man who died after suffering \"serious head injuries\" while \"working on a fairground ride\" has been named as Corrie Lee Stavers. Emergency services were called to the Spanish City Summer Funfair in Whitley Bay in North Tyneside after reports that a man, in his 20s, had been injured around 2.15pm on Saturday, police said. Mr Stavers, 28, was treated at the scene but was declared dead a short time later. In a statement issued by the police, his family said: \"It's with broken hearts that we share the devastating news that our beloved Corrie has passed away. \"He was tragically taken from us in an accident while working on a fairground ride. None of us were prepared for this, and the pain of losing him so suddenly is impossible to put into words. \"Our lives will never be the same without him, but his memory will live on in our hearts forever. \"We love you endlessly Corrie, and we miss you more than words can ever say. \n                  Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 \n                  Resistance to racism - the reason behind Notting Hill Carnival as important as ever\n                 \"You're with our mam now - rest in peace Corrie.\" The funfair, which is in Whitley Bay's Spanish City Plaza area, has been shut \"until further notice\" and the Health and Safety Executive has been informed. The annual funfair had opened on Thursday and had been due to run until Bank Holiday Monday. Read more from Sky News:Man and boy arrested after restaurant fireFast-track asylum appeals process to be introduced A Northumbria Police spokesman said: \"Emergency services attended and a man in his 20s was found to have suffered serious head injuries. \"Despite the best efforts of medical staff, a short time later the man was sadly declared dead. \"His next of kin have been contacted and are being supported by specialist officers.\" The spokesman added: \"Our thoughts are with the man's family at this extremely difficult time. \"We have contacted the Health and Safety Executive and are working with them to establish exactly what happened. \"The fair has been closed to the public and will remain closed until further notice.\""
    },
    {
        "title": "Flesh-eating screwworm parasite detected in person in US for first time",
        "description": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time.",
        "url": "https://news.sky.com/story/flesh-eating-screwworm-parasite-detected-in-person-in-us-for-first-time-13418013",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-screw-worm_7000663.jpg?20250825001602",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-24 22:49:00",
        "Headline": "The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year.",
        "Content": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time. The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year. It is ultimately fatal if left untreated. The case in the US was identified in a person from Maryland who had travelled from Guatemala. Beth Thompson, South Dakota's state veterinarian, told Reuters on Sunday that she was notified of the case within thelast week. A Maryland state government official also confirmed the case. The person was treated and prevention measures were implemented, Reuters reports. The Centres for Disease Control and Prevention (CDC) and the Maryland Department of Health did not immediately respond to requests for comment.  What is screwworm? The female screwworm fly lays eggs in the wounds of warm-blooded animals and once hatched, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh. It can be devastating in cattle and wildlife, and has also been known to infect humans. Treatment is onerous, and involves removing hundreds of larvae and thoroughly disinfecting wounds. They are largely survivable if treated early enough. The confirmed case is likely to rattle the beef and cattle futures market, which has seen record-high prices because of tight supplies. The US typically imports more than a million cattle from Mexico each year to process into beef. The screwworm outbreak could cost Texas - the biggest cattle-producing state - $1.8bn (£1.3bn) in livestock deaths, labour costs and medicationexpenses. The United States Department of Agriculture (USDA) has set traps and sent mounted officers along the border, but it has faced criticism from some cattle producers and market analysts for not acting faster to pursue increased fly production via a sterile fly facility. What is a sterile fly facility? The case also comes just one week after the US agriculture secretary, Brooke Rollins, travelled to Texas to announce plans to build a sterile fly facility there in a bid to combat the pest. Ms Rollins had pledged repeatedly to keep screwworm out of the country. Read more:Trump seeking to 'manufacture a crisis' in ChicagoMenendez brothers denied parole A sterile fly facility produces a large number of male flies and sterilises them - these males are then released to mate with wild female insects, which collapses the wild population over time. This method eradicated screwworm from the US in the 1960s. Mexico has also taken efforts to limit the spread of the pest, which can kill livestock within weeks if not treated. It had started to build a $51m sterile fly production facility. The USDA has previously said 500 million flies would need to be released weekly to push the fly back to the Darien Gap, the stretch of rainforest between Panama and Colombia."
    },
    {
        "title": "Three children taken to hospital after being 'hit by car as they played on pavement'",
        "description": "Three children have been taken to hospital after they were hit by a car while playing on the pavement.",
        "url": "https://news.sky.com/story/three-children-taken-to-hospital-after-being-hit-by-car-as-they-played-on-pavement-13417978",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-northern-ireland-police_7000583.jpg?20250824215036",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-24 20:41:00",
        "Headline": "A man has been arrested following the road traffic collision in Black View Ridge, west Belfast.",
        "Content": "Three children have been taken to hospital after they were hit by a car while playing on the pavement. The Police Service of Northern Ireland was called just before 5pm on Sunday following a report that a vehicle struck two girls and a boy as it reversed in west Belfast. The youngsters were treated in hospital and a man has been arrested following the road traffic collision in Black View Ridge. He was held on suspicion of driving with excess alcohol in breath, causing grievous bodily injury by dangerous driving and failing to stop, failing to report and failing to remain where an accident occurred causing injury. The suspect remains in custody. Officers are urging anyone who saw what happened or had dashcam or CCTV footage of the incident to contact them."
    },
    {
        "title": "Bank holiday temperatures to climb close to 30C today before rain arrives",
        "description": "Bank holiday temperatures are set to soar close to 30C, offering a final burst of summer sunshine before wind and rain arrive.",
        "url": "https://news.sky.com/story/bank-holiday-temperatures-to-climb-close-to-30c-before-rain-arrives-13417557",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-heatwave-london-weather_6999944.jpg?20250824140841",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-24 12:35:00",
        "Headline": "Temperatures are expected to reach nearly 30C on Monday, with the area around Chester likely to be the hottest place.",
        "Content": "Bank holiday temperatures are set to soar close to 30C, offering a final burst of summer sunshine before wind and rain arrive. Maximum temperatures will reach around 28C (82F) or 29C (84F) today, with widespread sunshine expected for most areas, the Met Office said. \"There's around a 30% chance of temperatures reaching 30C somewhere over southern Britain... with the area around Chester likely to be the hottest place,\" said Sky News meteorologist Dr Christopher England. \"Given the location, it's looking likely that the Welsh August Bank Holiday record high of 26.5C, set at Crossway in 1991, will be exceeded, and by a considerable amount.\" The Northern Ireland record high of 23.8C, set in Banagher in 1983, may also be broken, he said. But later today, the remnants of Hurricane Erin will approach from the west, bringing periods of wind and rain to the UK-conditions that are expected to persist through the week, Met Office meteorologist Craig Snell said. For the remainder of the week, temperatures will return to seasonal norms - hovering in the low 20s across the south and the high teens in the north. \n                  What the weather's going to be like this bank holiday weekend - and the roads set to face the worst delays\n                 \n                  Hurricane Erin makes for an uncertain weather forecast\n                 \n                  Why wildfires in Spain and Portugal are having an impact on weather in the UK\n                 Mr Snell said: \"On Monday, it will be a very warm and sunny picture for most. \"It will start to go downhill and rain will start to move in for Northern Ireland into the afternoon.\" Those planning to visit the coast on Monday or Tuesday are advised to choose beaches with lifeguards, as large waves are expected to arrive during this period. Read more from Sky News:Criminals could be banned from pubs and sports groundsFast-track asylum appeals process to be introduced Beginning Tuesday, periods of rain will spread across all regions of the country, with the heaviest downpours expected in western areas, according to Mr Snell. \"It will be heavy at times in the west, but at the moment we're not expecting too many impacts, and it may for farmers or anyone who needs the rain be welcome,\" he said. On Wednesday, a band of rain will sweep across the entire country, and low pressure is expected to persist through the weekend, bringing further periods of rainfall."
    },
    {
        "title": "Notting Hill Carnival: Streets filled with colourful costumes and music for annual west London event",
        "description": "The two-day Notting Hill Carnival is under way in west London as the streets are filled with colourful costumes, dancing and music.",
        "url": "https://news.sky.com/story/notting-hill-carnival-streets-filled-with-colourful-costumes-and-music-for-annual-west-london-event-13417902",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-notting-hill-carnival_7000468.jpg?20250824192106",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-24 18:06:00",
        "Headline": "About one million people are expected to attend the extravaganza, and around 7,000 police officers will be on duty across the capital on Sunday and Monday.",
        "Content": " The two-day Notting Hill Carnival is under way in west London as the streets are filled with colourful costumes, dancing and music. Europe's biggest street party, which has been running for more than 50 years, is an annual event over the summer bank holiday weekend and helps celebrate Caribbean culture and history. About one million people are expected to attend the extravaganza, and around 7,000 police officers will be on duty across the capital on Sunday and Monday. In the run-up to the event, the Metropolitan Police arrested more than 100 people who had planned to go, and seized dozens of knives and firearms. On Sunday, the force said there had been 140 arrests, including 105 at the event itself while 35 took place \"on the approaches to carnival as a result of proactive policing interventions\". Of those 35 arrests, 13 came after positive identifications using live facial recognition (LFR) technology which captures people's faces in real-time CCTV cameras. LFR is being used on the approach to and from the carnival as well as outside the boundaries of the event. The arrests included 15 for alleged assaults of police officers, and 21 for allegedly having offensive weapons. Of the officers who were assaulted, one had injuries to their hand which needed hospital treatment. \n                  Resistance to racism - the reason behind Notting Hill Carnival as important as ever\n                 \n                  Family of mother killed at Notting Hill Carnival say it's an 'unmanageable event' and is 'unsafe'\n                 \n                  100 arrests ahead of Notting Hill Carnival in 'intelligence-led interventions', Met Police say\n                 Last year, there were 334 arrests in total. All major music and sound systems were switched off at 3pm for three minutes to honour those killed in the 2017 Grenfell Tower fire, and Kelso Cochrane, who was murdered in a racially motivated attack in Notting Hill in 1959. Children's day took place on Sunday and is followed by the main event on Monday. The festival began early with the J'ouvert celebration, where people covered each other in paint, coloured powder and chocolate. And the colourful float procession then began in Great Western Road. Festival chairman Ian Comfort told the crowd he was pleased the carnival was happening after its future was in jeopardy because of funding challenges earlier this year. The Mayor of Kensington and Chelsea, Tom Bennett, welcomed \"friends\" from across the Caribbean and said: \"It's one of the greatest street parties in the world...celebrating today Caribbean culture - from dancing, music, costumes but also everything the Caribbean community has done in this borough and country.\" During the parade, there was fast-paced drumming along with flutes, brass instruments, steel drums, dancers and costumes including giant colourful wings. Flags from Venezuela to Trinidad were draped across the shoulders of people who danced and cheered down the road. A mixture of adults and children wearing jewels, glittery wings, belts and headdresses danced down the street, followed by floats. Along the side streets were rows of food and drink stalls serving fragrant jerk chicken, goat curry, and rum punch cocktails. TV chef and personality Big Zuu, 30, said he had been coming to the carnival since he was a year old and has taken part in the floats. When asked what he liked about carnival, he said: \"Everything. It's a celebration of black culture in England which we need right now. We have got these idiots putting up English flags. We're all British, we are part of Britain, this is a multicultural country. \"This is the best celebration of multiculturalism in the country.\" He also said: \"Multiculturalism is important.\" Read more from Sky News:Family of mother killed at carnival say it's 'unsafe'Face-recognition tech will be used without bias at festival - Met boss  Sabina Challenger, 47, from Hackney, took part in a float with her child and said: \"Carnival is about unity and about bringing people together, about reminding the community what the West Indian community has brought to the UK. \"This is something to be celebrated and it should remain in place.\" Alongside the use of LFR technology, the Met also said it planned to install screening arches at some of the busiest entry points to the carnival, where stop-and-search powers will be used in a bid to keep weapons out."
    },
    {
        "title": "More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars",
        "description": "Hundreds of shoplifting cases have gone unsolved every day, with the number of unsolved incidents rising by more than 40,000 over the past year.",
        "url": "https://news.sky.com/story/more-than-80-of-shoplifting-offences-result-in-no-charge-as-number-of-unsolved-cases-soars-13417713",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-istock-stock-file-generic_6959515.jpg?20250707162524",
        "type": "Home",
        "Author": "Will Charley",
        "Date Published": "2025-08-24 23:01:00",
        "Headline": "While the data has shown the number of unsolved cases is on the rise, it also revealed that the total number of shoplifting offences has increased dramatically, too.",
        "Content": "\n          Political reporter\n              @WillCharley1\n Hundreds of shoplifting cases have gone unsolved every day, with the number of unsolved incidents rising by more than 40,000 over the past year. New figures show that 289,464 cases of shoplifting were shut by police without a suspect in England and Wales in the year to March 2025, according to House of Commons library analysis. Of all shoplifting cases, more than half (55%) were closed without a suspect identified, while fewer than one in five (18%) led to someone being charged. Politics latest: Ministers announce new measures to clear asylum backlog The data shows the number of cases closed without a suspect has also risen significantly on the previous 12 months, with 245,337 cases shut by police forces without a suspect being identified in 2023-24, a rise of more than 40,000. The analysis, produced for the Liberal Democrats, suggests that on average, 793 shoplifting offences went unsolved every day. Senior Conservative politicians have told Sky News that the figures \"explain why Britain feels lawless\", and are urging ministers to scrap plans to largely end the use of short prison sentences, in favour of people serving time in the community. \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 What else does the data show? The data covered all police forces in England and Wales, except for Humberside, but also included the British Transport Police. It revealed the Metropolitan Police had the worst record, with 76.9% of its 93,705 shoplifting cases being closed with nobody identified as a suspect. Just 5.9% of shoplifting incidents recorded in the capital and the wider region resulted in a charge. While the data has shown the number of unsolved cases is on the rise, it also revealed that the total number of shoplifting offences has increased dramatically, too.  In 2023-24, 444,022 cases of shoplifting were recorded. But in 2024-25, this rose to 530,643, a record high since the practice of recording the data nationally began in 2002-03. Overall, 2,071,156 offences of all types went unsolved in the 2024-25 year. This means, on average each day, 5,674 crimes were committed that went on to be closed without a suspect. Only 7.3% of all crimes recorded resulted in somebody being charged or summoned.  The Lib Dems have repeated their calls for police and crime commissioners - elected politicians who have authority over each police force - to be scrapped. They believe the money spent on these would be better invested in frontline policing, and that police boards, made up of local councillors and other individuals, could replace them. Lisa Smart, the party's home affairs spokesperson, said that the data reveals an \"absolute scandal\" because it shows that \"thousands of innocent victims are being left without the justice they deserve\" every day. She added: \"The previous Conservative government left behind a legacy of failure, but the Labour government has not been quick enough to address the unsolved crime epidemic - particularly as shoplifting spirals out of control.\" Tories: There should be a 'zero tolerance approach' to shoplifting Meanwhile, the shadow home secretary pointed out that shoplifting has risen by 20% under Labour, and that ministers show \"no signs of gripping it\". Chris Philp told Sky News: \"The vast majority of criminals aren't even caught - and Labour are now proposing to abolish prison sentences of under a year, so even the few that get caught won't suffer any real punishment.\" He has called for a \"zero tolerance approach\" and the greater use of technology, such as facial recognition technology, so that \"Labour's shoplifting epidemic can be stopped\". Read mores:Workers say shoplifting is 'out of control' after surge in brazen theftsWhy legion of shoplifters is causing an explosion in crimeTheft and fraud costs Co-op nearly £40m in just 6 months Earlier this month, Home Secretary Yvette Cooper announced a significant expansion of the use of facial recognition tech by police forces in England and Wales, with 10 new vans being rolled out - though the move was criticised by civil liberties groups.  Robert Jenrick, the shadow justice secretary, said the \"damning stats explain why Britain feels lawless\". He told Sky News: \"Starmer's plan to scrap prison sentences for shoplifters will only make this worse. We need the authorities to go after these criminals and lock them up for much longer to keep the public safe.\" The government has defended the proposals to largely end the use of shorter sentences, as recommended by the independent sentencing review, carried out earlier this year by former Conservative justice secretary David Gauke. A Ministry of Justice spokesperson said: \"Without further action, we will run out of prison places in months, courts would halt trials and the police [would] cancel arrests. That is why we are overhauling sentencing to make sure we always have the prison places needed to keep the country safe.\""
    },
    {
        "title": "Man and boy arrested on suspicion of arson after restaurant fire leaves two in critical condition",
        "description": "A 54-year-old man and a 15-year-old boy have been arrested on suspicion of arson with intent to endanger life after a restaurant fire in east London on Friday.",
        "url": "https://news.sky.com/story/man-and-boy-arrested-on-suspicion-of-arson-after-restaurant-fire-leaves-three-in-critical-conditition-13417520",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ilford-arson_6998580.jpg?20250823123205",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-24 11:41:00",
        "Headline": "Two people remained in a critical condition on Sunday morning, according to the Metropolitan Police.",
        "Content": "A 54-year-old man and a 15-year-old boy have been arrested on suspicion of arson with intent to endanger life after a restaurant fire in east London on Friday. Three people were taken to hospital in a life-threatening condition after the fire at the Indian Aroma in Ilford. Two remained in a critical condition on Sunday morning, according to the Metropolitan Police. The restaurant suffered extensive damage in the blaze. Two further victims are thought to have left the scene before officers arrived, Scotland Yard said. Police are still trying to identify them. CCTV footage seen by the PA news agency appears to show a group of people wearing face coverings walk into the restaurant and pour liquid on the floor. \n                  Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse\n                 \n                  Family pay tribute to 'beloved' man who died in 'accident while working on fairground ride'\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 Seconds later, the inside of the restaurant is engulfed in flames. \"While we have made two arrests, our investigation continues at pace so we can piece together what happened on Friday evening,\" said the Met Police's DCI Mark Rogers. \"I know the community [is] concerned and shocked by this incident. \"I would urge anyone with any information or concerns to come forward and speak to police.\" Hospital porter Edward Thawe went to help after hearing screams from his nearby home. He described the scene as \"horrible\" and \"more than scary and the sort of thing that you don't want to look at twice.\" He said: \"I heard screaming and people saying they had called the police.\" Read more from Sky News:Pro-Palestine Australians protest after week of tension with Israel'I'm deprived of my UK citizenship but I'm not a convicted terrorist'Ghislaine Maxwell was given 'platform to rewrite history' The 43-year-old said he saw a woman and a severely burned man who may have been customers. Another witness, who did not want to be named, said he saw three \"severely burned\" people being doused by the emergency services and given oxygen. \"I can only imagine the pain they were going through,\" he said. On Saturday, the London Ambulance Service told Sky News: \"We sent resources to the scene, including ambulance crews, an advanced paramedic, an incident response officer and paramedics from our hazardous area response team. \"We treated five people for burns and smoke inhalation. We took two patients to a major trauma centre and three others to local hospitals.\" The police investigation is continuing."
    },
    {
        "title": "Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse",
        "description": "Ten child protection organisations have written an urgent letter to the home secretary expressing concern about the omission of child sexual abuse from the government's violence against women and girls strategy, following a Sky News report.&#160;",
        "url": "https://news.sky.com/story/urgent-letter-to-home-secretary-over-violence-against-women-and-girls-strategy-as-it-omits-child-abuse-13417619",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-child-sexual-abuse_7000042.jpg?20250824150627",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-08-24 23:01:00",
        "Headline": "Groups including the NSPCC, Barnardo's and The Children's Society wrote to Yvette Cooper to say that violence against women and girls and child sexual abuse are \"inherently and deeply connected\".",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Ten child protection organisations have written an urgent letter to the home secretary expressing concern about the omission of child sexual abuse from the government's violence against women and girls strategy, following a Sky News report.  Groups including the NSPCC, Barnardo's and The Children's Society wrote to Yvette Cooper to say that violence against women and girls (VAWG) and child sexual abuse are \"inherently and deeply connected\", suggesting any \"serious strategy\" to address VAWG needs to focus on child sexual abuse and exploitation. The letter comes after Sky News revealed an internal Home Office document, titled Our draft definition of VAWG, which said that child sexual abuse and exploitation is not \"explicitly within the scope\" of their strategy, due to be published in September. Responding to Sky News' original report, Poppy Eyre, who was sexually abused and raped by her grandfather when she was four, said: \"VAWG is - violence against women and girls. If you take child sexual abuse out of it, where are the girls?\" The Centre of Expertise on Child Sexual Abuse, which is funded by the Home Office and a signatory to the letter, estimates 500,000 children in England and Wales are sexually abused every year. The NSPCC \"welcome\" the government's pledge to halve VAWG in a decade, but is \"worried that if they are going to fulfil this commitment, the strategy absolutely has to include clear deliverable objectives to combat child sexual abuse and exploitation too\", the head of policy, Anna Edmundson, told Sky News. She warned the government \"will miss a golden opportunity\" and the needs of thousands of girls will be \"overlooked\" if child sexual abuse and exploitation is not \"at the heart of its flagship strategy\". The government insists the VAWG programme will include action to tackle child sexual abuse, but says it also wants to create a distinctive plan to \"ensure those crimes get the specialist response they demand\". \"My message to the government is that if you're going to make child sexual abuse a separate thing, we need it now,\" Poppy told Sky News. Read more from Sky News:Why Donald Trump believes he 'deserves the Nobel Peace Prize'Bank holiday temperatures to climb close to 30C before rain arrives Rape Crisis, which is one of the largest organisations providing support to women in England and Wales, shares these concerns. It wants plans to tackle child sexual abuse to be part of the strategy, and not to sit outside it. \"If a violence against women and girls strategy doesn't include sexual violence towards girls, then it runs the risk of being a strategy for addressing some violence towards some females, but not all,\" chief executive Ciara Bergman said. A Home Office spokesperson said the government is \"working tirelessly to tackle the appalling crimes of violence against women and girls and child sexual exploitation and abuse, as part of our Safer Streets mission\". \"We are already investing in new programmes and introducing landmark laws to overhaul the policing and criminal justice response to these crimes, as well as acting on the recommendations of Baroness Casey's review into group-based Child Sexual Exploitation, and the Independent Inquiry into Child Sexual Abuse,\" they added."
    },
    {
        "title": "Family pay tribute to 'beloved' man who died in 'accident while working on fairground ride'",
        "description": "A man who died after suffering \"serious head injuries\" while \"working on a fairground ride\" has been named as Corrie Lee Stavers.",
        "url": "https://news.sky.com/story/family-pay-tribute-to-beloved-man-who-died-in-accident-while-working-on-fairground-ride-13417781",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-corrie-lee-stavers_7000320.jpg?20250824174427",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-24 16:00:00",
        "Headline": "The Spanish City Summer Funfair, which is in Whitley Bay's Spanish City Plaza area, has been shut \"until further notice\" and the Health and Safety Executive has been informed.",
        "Content": "A man who died after suffering \"serious head injuries\" while \"working on a fairground ride\" has been named as Corrie Lee Stavers. Emergency services were called to the Spanish City Summer Funfair in Whitley Bay in North Tyneside after reports that a man, in his 20s, had been injured around 2.15pm on Saturday, police said. Mr Stavers, 28, was treated at the scene but was declared dead a short time later. In a statement issued by the police, his family said: \"It's with broken hearts that we share the devastating news that our beloved Corrie has passed away. \"He was tragically taken from us in an accident while working on a fairground ride. None of us were prepared for this, and the pain of losing him so suddenly is impossible to put into words. \"Our lives will never be the same without him, but his memory will live on in our hearts forever. \"We love you endlessly Corrie, and we miss you more than words can ever say. \n                  Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 \n                  Resistance to racism - the reason behind Notting Hill Carnival as important as ever\n                 \"You're with our mam now - rest in peace Corrie.\" The funfair, which is in Whitley Bay's Spanish City Plaza area, has been shut \"until further notice\" and the Health and Safety Executive has been informed. The annual funfair had opened on Thursday and had been due to run until Bank Holiday Monday. Read more from Sky News:Man and boy arrested after restaurant fireFast-track asylum appeals process to be introduced A Northumbria Police spokesman said: \"Emergency services attended and a man in his 20s was found to have suffered serious head injuries. \"Despite the best efforts of medical staff, a short time later the man was sadly declared dead. \"His next of kin have been contacted and are being supported by specialist officers.\" The spokesman added: \"Our thoughts are with the man's family at this extremely difficult time. \"We have contacted the Health and Safety Executive and are working with them to establish exactly what happened. \"The fair has been closed to the public and will remain closed until further notice.\""
    },
    {
        "title": "More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars",
        "description": "Hundreds of shoplifting cases have gone unsolved every day, with the number of unsolved incidents rising by more than 40,000 over the past year.",
        "url": "https://news.sky.com/story/more-than-80-of-shoplifting-offences-result-in-no-charge-as-number-of-unsolved-cases-soars-13417713",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-istock-stock-file-generic_6959515.jpg?20250707162524",
        "type": "UK",
        "Author": "Will Charley",
        "Date Published": "2025-08-24 23:01:00",
        "Headline": "While the data has shown the number of unsolved cases is on the rise, it also revealed that the total number of shoplifting offences has increased dramatically, too.",
        "Content": "\n          Political reporter\n              @WillCharley1\n Hundreds of shoplifting cases have gone unsolved every day, with the number of unsolved incidents rising by more than 40,000 over the past year. New figures show that 289,464 cases of shoplifting were shut by police without a suspect in England and Wales in the year to March 2025, according to House of Commons library analysis. Of all shoplifting cases, more than half (55%) were closed without a suspect identified, while fewer than one in five (18%) led to someone being charged. Politics latest: Ministers announce new measures to clear asylum backlog The data shows the number of cases closed without a suspect has also risen significantly on the previous 12 months, with 245,337 cases shut by police forces without a suspect being identified in 2023-24, a rise of more than 40,000. The analysis, produced for the Liberal Democrats, suggests that on average, 793 shoplifting offences went unsolved every day. Senior Conservative politicians have told Sky News that the figures \"explain why Britain feels lawless\", and are urging ministers to scrap plans to largely end the use of short prison sentences, in favour of people serving time in the community. \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 What else does the data show? The data covered all police forces in England and Wales, except for Humberside, but also included the British Transport Police. It revealed the Metropolitan Police had the worst record, with 76.9% of its 93,705 shoplifting cases being closed with nobody identified as a suspect. Just 5.9% of shoplifting incidents recorded in the capital and the wider region resulted in a charge. While the data has shown the number of unsolved cases is on the rise, it also revealed that the total number of shoplifting offences has increased dramatically, too.  In 2023-24, 444,022 cases of shoplifting were recorded. But in 2024-25, this rose to 530,643, a record high since the practice of recording the data nationally began in 2002-03. Overall, 2,071,156 offences of all types went unsolved in the 2024-25 year. This means, on average each day, 5,674 crimes were committed that went on to be closed without a suspect. Only 7.3% of all crimes recorded resulted in somebody being charged or summoned.  The Lib Dems have repeated their calls for police and crime commissioners - elected politicians who have authority over each police force - to be scrapped. They believe the money spent on these would be better invested in frontline policing, and that police boards, made up of local councillors and other individuals, could replace them. Lisa Smart, the party's home affairs spokesperson, said that the data reveals an \"absolute scandal\" because it shows that \"thousands of innocent victims are being left without the justice they deserve\" every day. She added: \"The previous Conservative government left behind a legacy of failure, but the Labour government has not been quick enough to address the unsolved crime epidemic - particularly as shoplifting spirals out of control.\" Tories: There should be a 'zero tolerance approach' to shoplifting Meanwhile, the shadow home secretary pointed out that shoplifting has risen by 20% under Labour, and that ministers show \"no signs of gripping it\". Chris Philp told Sky News: \"The vast majority of criminals aren't even caught - and Labour are now proposing to abolish prison sentences of under a year, so even the few that get caught won't suffer any real punishment.\" He has called for a \"zero tolerance approach\" and the greater use of technology, such as facial recognition technology, so that \"Labour's shoplifting epidemic can be stopped\". Read mores:Workers say shoplifting is 'out of control' after surge in brazen theftsWhy legion of shoplifters is causing an explosion in crimeTheft and fraud costs Co-op nearly £40m in just 6 months Earlier this month, Home Secretary Yvette Cooper announced a significant expansion of the use of facial recognition tech by police forces in England and Wales, with 10 new vans being rolled out - though the move was criticised by civil liberties groups.  Robert Jenrick, the shadow justice secretary, said the \"damning stats explain why Britain feels lawless\". He told Sky News: \"Starmer's plan to scrap prison sentences for shoplifters will only make this worse. We need the authorities to go after these criminals and lock them up for much longer to keep the public safe.\" The government has defended the proposals to largely end the use of shorter sentences, as recommended by the independent sentencing review, carried out earlier this year by former Conservative justice secretary David Gauke. A Ministry of Justice spokesperson said: \"Without further action, we will run out of prison places in months, courts would halt trials and the police [would] cancel arrests. That is why we are overhauling sentencing to make sure we always have the prison places needed to keep the country safe.\""
    },
    {
        "title": "Resistance to racism - the reason behind Notting Hill Carnival as important as ever",
        "description": "For those who have never been to the Notting Hill Carnival, undoubtedly, there is a level of hysteria surrounding what happens here.",
        "url": "https://news.sky.com/story/resistance-to-racism-the-reason-behind-notting-hill-carnival-as-important-as-ever-13417918",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-carnival-notting-hill_7000565.jpg?20250824213518",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-24 18:43:00",
        "Headline": "This is a place where community comes together. You don't walk around constantly looking over your shoulder. The reasons for marking this - resistance against racism - are important to mark today as they ever were.",
        "Content": "\n          Arts and entertainment correspondent\n        For those who have never been to the Notting Hill Carnival, undoubtedly, there is a level of hysteria surrounding what happens here. From its 60s roots in resistance against racism, it has snowballed in size. The challenge for organisers nowadays is that fundamentally, what it's grown into is at odds with what this event stands for. How do you control and manage something which, at its heart, is about recognising and representing freedom? In reality, that requires police. A lot of police. They are everywhere. Largely keeping a respectful distance. Positioned like chess pieces ready to be moved to wherever those watching on from CCTV might dictate they're needed.  Does it feel any unsafer than being at, say, Glastonbury? Not particularly. But arguably, being stuck in a bottleneck of crowds on a small city road on a sweaty day in August, you can certainly feel more hemmed in than if you were out in a field in Somerset. For the young kids, dancing and dressing up to take part in Sunday's official parades, the appeal is obvious. \n                  Notting Hill Carnival: Streets filled with colourful costumes and music for annual west London event\n                 \n                  Family of mother killed at Notting Hill Carnival say it's an 'unmanageable event' and is 'unsafe'\n                 \n                  100 arrests ahead of Notting Hill Carnival in 'intelligence-led interventions', Met Police say\n                 The joy and pride you see from those taking part is heartwarming, and it is a glorious spectacle. Common sense dictates that few parents should or do attempt to drag little ones past the roads where blaring sound systems are set up, where you will find those intent on being inebriated from early on. This being family day, you will find balloons, but they are not being held by children. Nos is openly inhaled, yes, Carnival has an edgy side. That crime and violence is the conversation that surrounds this Carnival is frustrating to say the least for those who've grown up coming here. I spend some time talking to Michelle, who used to live in Chiswick. She's since moved to the north of England but comes back each year especially. I ask if she welcomes the number of police, and she says no. \"I'd like more….I saw someone get bottled in front of me, pouring out with blood….and it's quite scary to be around that kind of, you know, aura.\" Why come then?, I ask. \"I get to see my family, my nephews, my nieces, my aunties and it's all about culture, history and heritage.\" As I walk around with Ian Comfort, chair of Notting Hill Carnival, he makes the point that all two million people who will come here over two days are never here at once. Ironically, after offering to guide me to a different location, we get stuck in a very slow-moving crowd of revellers. Out the other side, he apologises but says: \"That was fine though, you're alright? And didn't you find everyone is so happy?\". It's true, they were. Read more from Sky News:Bank holiday temperatures to climb close to 30C before rain arrivesBridgerton creator reacts to claims of 'woke' casting While critics have suggested it might be safer all around to shift this entire event to a location like Hyde Park, one woman tells me absolutely not. \"It's a convenient way to box off black people, so no.\" And that's the point. This is a place where community comes together. You don't walk around constantly looking over your shoulder. The reasons for marking this - resistance against racism - are important to mark today as they ever were."
    },
    {
        "title": "Three children taken to hospital after being 'hit by car as they played on pavement'",
        "description": "Three children have been taken to hospital after they were hit by a car while playing on the pavement.",
        "url": "https://news.sky.com/story/three-children-taken-to-hospital-after-being-hit-by-car-as-they-played-on-pavement-13417978",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-northern-ireland-police_7000583.jpg?20250824215036",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-24 20:41:00",
        "Headline": "A man has been arrested following the road traffic collision in Black View Ridge, west Belfast.",
        "Content": "Three children have been taken to hospital after they were hit by a car while playing on the pavement. The Police Service of Northern Ireland was called just before 5pm on Sunday following a report that a vehicle struck two girls and a boy as it reversed in west Belfast. The youngsters were treated in hospital and a man has been arrested following the road traffic collision in Black View Ridge. He was held on suspicion of driving with excess alcohol in breath, causing grievous bodily injury by dangerous driving and failing to stop, failing to report and failing to remain where an accident occurred causing injury. The suspect remains in custody. Officers are urging anyone who saw what happened or had dashcam or CCTV footage of the incident to contact them."
    },
    {
        "title": "Is it time for gunboats to help stop the people smugglers?",
        "description": "Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem.",
        "url": "https://news.sky.com/story/is-it-time-for-gunboats-to-help-stop-the-people-smugglers-13417741",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-france-small-boats_6932334.jpg?20250601093505",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-08-24 15:14:00",
        "Headline": "With the PM's and Labour's poll numbers tanking as the latest official figures confirm the numbers of migrants and small boat crossings are increasing at a shocking rate, is it now time for a different approach?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem. The former director of public prosecutions would appear to see overhauling court procedures and the legal process as the answer to any tricky situation. Yes, the proposed fast-track asylum appeals process is fine as far as it goes. But for a government confronted with a massive migrant crisis, opponents claim it's mere tinkering. And welcome and worthy as it is, it isn't going to \"smash the gangs\", stop the boats or act as a powerful deterrent to the people smugglers plying their trade in the Channel. As protests outside migrant hotels grow noisier and clashes between rival demonstrators become potentially violent, do we hear this cry from the voters: \"What do we want? An independent commission of professional adjudicators! When do we want it? As soon as legislative time allows!\" Of course not. Even those who don't agree with Nigel Farage's apparent indifference - in his Times interview this weekend, to asylum seekers sent back to Afghanistan being killed or tortured by the Taliban - are demanding bolder and more radical measures from the government. \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 And those who tire of the shadow home secretary Chris Philp's constant criticisms of the government would probably accept that attempts to stop the boats in the Channel are not just useless but farcical. On a visit to the Channel earlier this month, Mr Philp said: \"There's a boat full of illegal immigrants crossing right in front of me. The French warship is escorting it and making no attempt at all to stop it.\" Later, assessing his trip, Mr Philp said: \"The people-smuggling conveyor belt is now a round trip, paid for by British taxpayers. \"We were in the middle of the Channel, just on the UK side of the border, witnessing the French handing over two boatloads of illegal migrants, Border Force picking them out, providing a taxi service back to the UK.\" So is Border Force fit for purpose? The Sunday Express reports that Martin Hewitt, Labour's Border Security Commander, is the highest-paid civil servant in the Home Office, with a salary of £200,000, more than the prime minister. Some top officials have also received bonuses. Philip Douglas, director general of the Border Force, received bonuses of up to £15,000 in 2024-25 on top of his £140,000-£145,000 salary. Why, given the force's lamentable performance? Given that Border Force clearly cannot cope with the small boat crossings, is it time to bring in the Royal Navy and some gunboat diplomacy, since the French government clearly is not helping to stop the boats? It's happened before, after all. In January 2022, former Prime Minister Boris Johnson announced the Royal Navy would take command of counter-migration operations in the Channel to deter migrant crossings and intercept boats before they reached British shores. It was called Operation Isotrope. But after squabbling between the Home Office and the Ministry of Defence (MoD) and the mayor of Calais attacking a \"declaration of maritime war\", Rishi Sunak's government handed control back to the Home Office. Is it time for a rethink? Earlier this month, the Labour peer Lord Glasman, founder of the socially conservative Blue Labour group, urged the PM to use the Navy and drones in the Channel to stop small boat crossings. In May, however, armed forces minister Luke Pollard slapped down the former Reform UK, now independent, MP Rupert Lowe in the Commons when he asked what assessment had been made of the Navy's capacity to intercept small boats. \"Defence assets are procured for defence tasks,\" Mr Pollard said, dismissively. The Navy's primary role, he added, was to safeguard maritime security, including monitoring and shadowing foreign warships in British waters. But at the very least, the Royal Navy could provide better surveillance, since Border Force seems to be failing in that role, and just the sight of naval vessels in the Channel could be a deterrent. Sir Keir has put his faith in his \"one in, one out\" deportation deal with French President Emmanuel Macron and now in his asylum appeals shake-up. The government's opponents claim neither will be an effective deterrent, however. Farage is proposing \"mass deportation\" of hundreds of thousands of asylum seekers who come to the UK on small boats. Labour says he's \"plucking numbers out of the air\". But with the PM's and Labour's poll numbers tanking as the latest official figures confirm the numbers of migrants and small boat crossings are increasing at a shocking rate, is it now time for a different approach? Another Starmer U-turn, given the MoD's hostility to the Navy's involvement up to now? Gunboats, anyone?"
    },
    {
        "title": "Ban passengers playing loud music on public transport, say Tories",
        "description": "Passengers could be banned from causing a \"nuisance\" by playing loud music on public transport under proposals to change the law set out by the Tories.",
        "url": "https://news.sky.com/story/ban-passengers-playing-loud-music-on-public-transport-say-tories-13417519",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-man-music-bus-listens_6999998.jpg?20250824143951",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-24 21:00:00",
        "Headline": "The Tories say they would change the law to so that nobody has to \"endure somebody else's choice of crap music\" while on the move.",
        "Content": "Passengers could be banned from causing a \"nuisance\" by playing loud music on public transport under proposals to change the law set out by the Tories. The Conservatives said there should be \"swift justice for those who make people's lives a misery\" by playing music loudly on buses and trains, and that they would introduce on-the-spot fines to tackle this. Politics latest: Ministers announce new measures to clear asylum backlog Under the plans, byelaws that already protect passengers on trains would be more rigorously enforced, while the equivalent would be brought in for those on buses - where currently there is no ban on music being played out loud. Currently, rules around train travel already make playing music out loud an offence - but like other issues, such as fare evasion, this is subject to being enforced by the British Transport Police or the train operators themselves. Under the proposals, when the government brings its Railways Bill to the Commons, the Tories will add an amendment to ensure that all train operators and nationalised services have a legal duty to enforce these, and have to publicly publish measurements of how well this is happening. As well as this, the amendment would introduce on-the-spot fines. The Conservatives say they would also introduce the same rules to buses through the government's Buses Bill, and that this will be a condition for all new bus partnerships, franchises and terms of service. \n                  Laws to largely abolish use of short prison sentences to be introduced within weeks\n                 \n                  Is it time for gunboats to help stop the people smugglers?\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 Richard Holden, the shadow transport secretary, said: \"Taking public transport shouldn't mean having to endure somebody else's choice of crap music blasted through a speaker at full blast. \"Rail passengers need to see enforcement and swift justice for those who make people's lives a misery, and bus passengers need the same laws to protect them against this nuisance. \"Our proposals and amendments will end the two-tier system and be an important step in making sure every journey is free from the blight of anti-social noise \"Only Conservatives will make sure passengers get the quiet, comfortable journeys they deserve.\" The Liberal Democrats have already pushed for similar action. Sir Ed Davey's party revealed in April that they would change the law to introduce £1,000 fines for those playing music or videos out loud on public transport, and pledged to take on \"headphone dodgers\". Speaking about the Tory announcement on Monday, Neil O'Brien, the shadow minister for policy renewal, said: \"People playing music or TikTok out loud on public transport is not just annoying but can create an atmosphere of intimidation, with passengers worried about what will happen if they intervene. \"We need to create a new national norm, as part of creating a more orderly environment and taking back our streets and public places.\" The government has previously said that there are already \"strict rules\" in place, to prevent anti-social behaviour on public transport, which already include fines of up to £1,000."
    },
    {
        "title": "Bank holiday temperatures to climb close to 30C today before rain arrives",
        "description": "Bank holiday temperatures are set to soar close to 30C, offering a final burst of summer sunshine before wind and rain arrive.",
        "url": "https://news.sky.com/story/bank-holiday-temperatures-to-climb-close-to-30c-before-rain-arrives-13417557",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-heatwave-london-weather_6999944.jpg?20250824140841",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-24 12:35:00",
        "Headline": "Temperatures are expected to reach nearly 30C on Monday, with the area around Chester likely to be the hottest place.",
        "Content": "Bank holiday temperatures are set to soar close to 30C, offering a final burst of summer sunshine before wind and rain arrive. Maximum temperatures will reach around 28C (82F) or 29C (84F) today, with widespread sunshine expected for most areas, the Met Office said. \"There's around a 30% chance of temperatures reaching 30C somewhere over southern Britain... with the area around Chester likely to be the hottest place,\" said Sky News meteorologist Dr Christopher England. \"Given the location, it's looking likely that the Welsh August Bank Holiday record high of 26.5C, set at Crossway in 1991, will be exceeded, and by a considerable amount.\" The Northern Ireland record high of 23.8C, set in Banagher in 1983, may also be broken, he said. But later today, the remnants of Hurricane Erin will approach from the west, bringing periods of wind and rain to the UK-conditions that are expected to persist through the week, Met Office meteorologist Craig Snell said. For the remainder of the week, temperatures will return to seasonal norms - hovering in the low 20s across the south and the high teens in the north. \n                  What the weather's going to be like this bank holiday weekend - and the roads set to face the worst delays\n                 \n                  Hurricane Erin makes for an uncertain weather forecast\n                 \n                  Why wildfires in Spain and Portugal are having an impact on weather in the UK\n                 Mr Snell said: \"On Monday, it will be a very warm and sunny picture for most. \"It will start to go downhill and rain will start to move in for Northern Ireland into the afternoon.\" Those planning to visit the coast on Monday or Tuesday are advised to choose beaches with lifeguards, as large waves are expected to arrive during this period. Read more from Sky News:Criminals could be banned from pubs and sports groundsFast-track asylum appeals process to be introduced Beginning Tuesday, periods of rain will spread across all regions of the country, with the heaviest downpours expected in western areas, according to Mr Snell. \"It will be heavy at times in the west, but at the moment we're not expecting too many impacts, and it may for farmers or anyone who needs the rain be welcome,\" he said. On Wednesday, a band of rain will sweep across the entire country, and low pressure is expected to persist through the weekend, bringing further periods of rainfall."
    },
    {
        "title": "Notting Hill Carnival: Streets filled with colourful costumes and music for annual west London event",
        "description": "The two-day Notting Hill Carnival is under way in west London as the streets are filled with colourful costumes, dancing and music.",
        "url": "https://news.sky.com/story/notting-hill-carnival-streets-filled-with-colourful-costumes-and-music-for-annual-west-london-event-13417902",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-notting-hill-carnival_7000468.jpg?20250824192106",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-24 18:06:00",
        "Headline": "About one million people are expected to attend the extravaganza, and around 7,000 police officers will be on duty across the capital on Sunday and Monday.",
        "Content": " The two-day Notting Hill Carnival is under way in west London as the streets are filled with colourful costumes, dancing and music. Europe's biggest street party, which has been running for more than 50 years, is an annual event over the summer bank holiday weekend and helps celebrate Caribbean culture and history. About one million people are expected to attend the extravaganza, and around 7,000 police officers will be on duty across the capital on Sunday and Monday. In the run-up to the event, the Metropolitan Police arrested more than 100 people who had planned to go, and seized dozens of knives and firearms. On Sunday, the force said there had been 140 arrests, including 105 at the event itself while 35 took place \"on the approaches to carnival as a result of proactive policing interventions\". Of those 35 arrests, 13 came after positive identifications using live facial recognition (LFR) technology which captures people's faces in real-time CCTV cameras. LFR is being used on the approach to and from the carnival as well as outside the boundaries of the event. The arrests included 15 for alleged assaults of police officers, and 21 for allegedly having offensive weapons. Of the officers who were assaulted, one had injuries to their hand which needed hospital treatment. \n                  Resistance to racism - the reason behind Notting Hill Carnival as important as ever\n                 \n                  Family of mother killed at Notting Hill Carnival say it's an 'unmanageable event' and is 'unsafe'\n                 \n                  100 arrests ahead of Notting Hill Carnival in 'intelligence-led interventions', Met Police say\n                 Last year, there were 334 arrests in total. All major music and sound systems were switched off at 3pm for three minutes to honour those killed in the 2017 Grenfell Tower fire, and Kelso Cochrane, who was murdered in a racially motivated attack in Notting Hill in 1959. Children's day took place on Sunday and is followed by the main event on Monday. The festival began early with the J'ouvert celebration, where people covered each other in paint, coloured powder and chocolate. And the colourful float procession then began in Great Western Road. Festival chairman Ian Comfort told the crowd he was pleased the carnival was happening after its future was in jeopardy because of funding challenges earlier this year. The Mayor of Kensington and Chelsea, Tom Bennett, welcomed \"friends\" from across the Caribbean and said: \"It's one of the greatest street parties in the world...celebrating today Caribbean culture - from dancing, music, costumes but also everything the Caribbean community has done in this borough and country.\" During the parade, there was fast-paced drumming along with flutes, brass instruments, steel drums, dancers and costumes including giant colourful wings. Flags from Venezuela to Trinidad were draped across the shoulders of people who danced and cheered down the road. A mixture of adults and children wearing jewels, glittery wings, belts and headdresses danced down the street, followed by floats. Along the side streets were rows of food and drink stalls serving fragrant jerk chicken, goat curry, and rum punch cocktails. TV chef and personality Big Zuu, 30, said he had been coming to the carnival since he was a year old and has taken part in the floats. When asked what he liked about carnival, he said: \"Everything. It's a celebration of black culture in England which we need right now. We have got these idiots putting up English flags. We're all British, we are part of Britain, this is a multicultural country. \"This is the best celebration of multiculturalism in the country.\" He also said: \"Multiculturalism is important.\" Read more from Sky News:Family of mother killed at carnival say it's 'unsafe'Face-recognition tech will be used without bias at festival - Met boss  Sabina Challenger, 47, from Hackney, took part in a float with her child and said: \"Carnival is about unity and about bringing people together, about reminding the community what the West Indian community has brought to the UK. \"This is something to be celebrated and it should remain in place.\" Alongside the use of LFR technology, the Met also said it planned to install screening arches at some of the busiest entry points to the carnival, where stop-and-search powers will be used in a bid to keep weapons out."
    },
    {
        "title": "Man and boy arrested on suspicion of arson after restaurant fire leaves two in critical condition",
        "description": "A 54-year-old man and a 15-year-old boy have been arrested on suspicion of arson with intent to endanger life after a restaurant fire in east London on Friday.",
        "url": "https://news.sky.com/story/man-and-boy-arrested-on-suspicion-of-arson-after-restaurant-fire-leaves-three-in-critical-conditition-13417520",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ilford-arson_6998580.jpg?20250823123205",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-24 11:41:00",
        "Headline": "Two people remained in a critical condition on Sunday morning, according to the Metropolitan Police.",
        "Content": "A 54-year-old man and a 15-year-old boy have been arrested on suspicion of arson with intent to endanger life after a restaurant fire in east London on Friday. Three people were taken to hospital in a life-threatening condition after the fire at the Indian Aroma in Ilford. Two remained in a critical condition on Sunday morning, according to the Metropolitan Police. The restaurant suffered extensive damage in the blaze. Two further victims are thought to have left the scene before officers arrived, Scotland Yard said. Police are still trying to identify them. CCTV footage seen by the PA news agency appears to show a group of people wearing face coverings walk into the restaurant and pour liquid on the floor. \n                  Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse\n                 \n                  Family pay tribute to 'beloved' man who died in 'accident while working on fairground ride'\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 Seconds later, the inside of the restaurant is engulfed in flames. \"While we have made two arrests, our investigation continues at pace so we can piece together what happened on Friday evening,\" said the Met Police's DCI Mark Rogers. \"I know the community [is] concerned and shocked by this incident. \"I would urge anyone with any information or concerns to come forward and speak to police.\" Hospital porter Edward Thawe went to help after hearing screams from his nearby home. He described the scene as \"horrible\" and \"more than scary and the sort of thing that you don't want to look at twice.\" He said: \"I heard screaming and people saying they had called the police.\" Read more from Sky News:Pro-Palestine Australians protest after week of tension with Israel'I'm deprived of my UK citizenship but I'm not a convicted terrorist'Ghislaine Maxwell was given 'platform to rewrite history' The 43-year-old said he saw a woman and a severely burned man who may have been customers. Another witness, who did not want to be named, said he saw three \"severely burned\" people being doused by the emergency services and given oxygen. \"I can only imagine the pain they were going through,\" he said. On Saturday, the London Ambulance Service told Sky News: \"We sent resources to the scene, including ambulance crews, an advanced paramedic, an incident response officer and paramedics from our hazardous area response team. \"We treated five people for burns and smoke inhalation. We took two patients to a major trauma centre and three others to local hospitals.\" The police investigation is continuing."
    },
    {
        "title": "Israel pounds outskirts of Gaza City overnight as military offensive plans continue",
        "description": "Israel pounded the outskirts of Gaza City overnight, as Benjamin Netanyahu's government vowed to press on with a planned offensive on the city.",
        "url": "https://news.sky.com/story/israel-pounds-outskirts-of-gaza-city-overnight-as-military-offensive-plans-continue-13417480",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-israel_6999789.jpg?20250824102856",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-24 09:21:00",
        "Headline": "Witnesses said overnight they heard nonstop explosions in Zeitoun and Shejaia.",
        "Content": "Israel pounded the outskirts of Gaza City overnight, as Benjamin Netanyahu's government vowed to press on with a planned offensive on the city. Families streamed out of the city as explosions hit this weekend. \"I stopped counting the times I had to take my wife and three daughters and leave my home in Gaza City,\" said Mohammad, 40. \"No place is safe, but I can't take the risk. If they suddenly begin the invasion, they will use heavy fire.\" Others said they would prefer to die and not leave. \"We are not leaving, let them bomb us at home,\" said Aya, 31, who has a family of eight, adding they could not afford to buy a tent or pay for the transportation. \"We are hungry, afraid and don't have money,\" she said. \n                  Pro-Palestine Australians protest after week of tension with Israel\n                 \n                  Israel is accused of allowing famine to fester in Gaza and global condemnation is deafening\n                 \n                  Famine declared in Gaza City - and projected to expand to two other areas in the next month\n                 Four people killed while seeking aid Al-Awda Hospital and two witnesses told the Associated Press that the four people were killed when troops opened fire on a crowd heading to a site run by the Israeli-backed American contractor Gaza Humanitarian Foundation, or GHF, in the Netzarim corridor area. It occurred hundreds of metres away from the site. \"The gunfire was indiscriminate,\" said Mohamed Abed, a father of two from the Bureij refugee camp. \"This incident didn't occur near our site nor as described,\" the GHF said in an email. The Israeli military did not immediately respond to a request for comment. More than 2,000 Palestinians have been killed and more than 13,500 wounded while seeking aid at distribution points or along convoy routes used by the United Nations and other aid groups, according to Gaza's Hamas-run health ministry. Parts of city shelled Witnesses said that overnight, they heard nonstop explosions in Zeitoun and Shejaia. Tanks shelled houses and roads in Sabra, and buildings were blown up in Jabalia. On Sunday, the IDF said its forces had returned to combat in Jabalia to strengthen its control of the area and dismantle militant tunnels. This month, Israel approved a plan to seize control of Gaza City. The offensive isn't expected to start for another few weeks. Read more from Sky News:Pro-Palestine Australians protest after week of tension with Israel'I'm deprived of my UK citizenship but I'm not a convicted terrorist'Ghislaine Maxwell was given 'platform to rewrite history', say Giuffre's family In the meantime, mediators in Egypt and Qatar are trying to resume ceasefire talks between the two sides. On Friday, Israel's defence minister Israel Katz said that Gaza City will be razed unless Hamas releases all its remaining hostages and ends the war on Israel's terms. Malnutrition deaths rise Eight more people died of malnutrition and starvation in Gaza, according to the Hamas-run Gaza health ministry on Saturday. 281 people, including 114 children, have now died of malnutrition and starvation since the war started, according to the ministry. Around half of Gaza's two million residents currently live in the city and on Friday a global hunger monitor said that Gaza City and its surrounding areas are officially suffering from famine that will likely spread. Israel said the monitor ignores steps Israel has taken since late July to increase aid supplies into and across Gaza. The war began on 7 October 2023, when Hamas-led gunmen killed around 1,200 people in southern Israel, mainly civilians, and took 251 hostages. Since then, Israel has killed at least 62,000 Palestinians, according to the Gaza health ministry, and internally displaced nearly its entire population."
    },
    {
        "title": "Pro-Palestine Australians protest after week of tension with Israel",
        "description": "Thousands of Australians protested in support of the Palestinian cause on Sunday, two weeks after the country announced it would recognise a Palestinian state.&#160;",
        "url": "https://news.sky.com/story/pro-palestine-australians-protest-after-week-of-tension-with-israel-13417435",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-australia-palestine_6999715.jpg?20250824081505",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-24 07:06:00",
        "Headline": "In the last week, Israel's prime minister Benjamin Netanyahu launched more personal attacks against Australia's Anthony Albanese.",
        "Content": " Thousands of Australians protested in support of the Palestinian cause on Sunday, two weeks after the country announced it would recognise a Palestinian state.  More than 40 protests took place across the country, according to Palestine Action Group, an Australian organisation. The group said around 350,000 people attended rallies nationwide, although police have estimated lower numbers in some cities. Organiser Josh Lees in Sydney said the protesters were marching to \"demand an end to this genocide in Gaza and to demand that our government sanction Israel\". A group representing Australia's Jewish community, the Executive Council of Australian Jewry, said the rallies created \"an unsafe environment and shouldn't be happening\". In the last week, Israel's prime minister Benjamin Netanyahu launched more personal attacks against Australia's Anthony Albanese. \"I think his record is forever tarnished by the weakness that he showed in the face of [these] Hamas terrorist monsters,\" he said on Wednesday, after earlier describing Mr Albanese as \"a weak politician who betrayed Israel and abandoned Australia's Jews.\" \n                  Emma Lovell: Killer of British mother in Australia eligible for earlier release after appeal\n                 \n                  British backpacker pleads guilty after fatally crashing into a father while under influence of alcohol in Australia\n                 \n                  Australian mushroom murderer allegedly served husband poisoned pasta, curry and sandwiches\n                 Mr Albanese said he did not \"take these things personally\" and that he treated the leaders of other countries with respect. His government's decision to formally recognise the Palestinian state in September, made on 11 August, came after tens of thousands of Australians marched over Sydney's iconic Harbour Bridge in support of Palestine."
    },
    {
        "title": "Legendary boxer Julio César Chávez Jr. to stand trial in Mexico over alleged cartel ties",
        "description": "Legendary boxer Julio C&#233;sar Ch&#225;vez Jr. will stand trial over alleged cartel ties and arms trafficking, his lawyer has said.&#160;",
        "url": "https://news.sky.com/story/legendary-boxer-julio-c233sar-ch225vez-jr-to-stand-trial-in-mexico-over-alleged-cartel-ties-13417445",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-julio-cesar-chavez-jr_6999725.jpg?20250824085434",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-24 07:35:00",
        "Headline": "Mexican prosecutors have been investigating the boxer since 2019, after US authorities filed a complaint against the Sinaloa Cartel.",
        "Content": "Legendary boxer Julio César Chávez Jr. will stand trial over alleged cartel ties and arms trafficking, his lawyer has said.  A Mexican court has granted a three-month extension for further investigation into the case, according to Chávez's lawyer, Rubén Fernando Benítez Alvarez. He said the claims against his client were \"speculation\" and \"urban legends\" after a court hearing on Saturday in the northern Mexican city of Hermosillo. If convicted, Chávez - who took part in the hearing virtually from a detention facility - could face a prison sentence of four to eight years, Mr Alvarez said. Chávez, 39, who has been living in the United States for several years, was arrested in early July by federal agents outside his Los Angeles home for overstaying his visa and providing inaccurate details on an application to obtain a green card. The arrest came just days after a fight he had with famed American boxer Jake Paul in Los Angeles. Mexican prosecutors have been investigating the boxer since 2019 after US authorities filed a complaint against the Sinaloa Cartel for organized crime, human trafficking, arms smuggling, and drug trafficking. \n                  Ukraine war latest: Trump, Pope Leo and Xi Jinping congratulate Ukraine on Independence Day | War latest\n                 \n                  Israel pounds outskirts of Gaza City overnight as military offensive plans continue\n                 \n                  Pro-Palestine Australians protest after week of tension with Israel\n                 The case prompted investigations into 13 individuals, including Ovidio Guzmán López - the son of convicted drug lord Joaquín \"El Chapo\" Guzmán - as well as several associates, hitmen, and accomplices of the criminal organization. Guzmán López was arrested in January 2023 and extradited to the US eight months later. Read more from Sky News:Criminals could be banned from pubs and sports grounds under new plansUK braces for more protests over the use of hotels to house asylum seekersFollowing the inquiry, the Federal Attorney General's Office issued several arrest warrants, including one against Chávez. The boxer was deported by the US on 9 August and handed over to agents of the Federal Attorney General's Office in Sonora state, who transferred him to the Federal Social Reintegration Center in Hermosillo. The high-profile case comes amid the Trump administration's efforts to pressure Mexico into cracking down on organized crime, including cancelling visas of prominent Mexican artists and celebrities, and increasing deportations. Chávez has struggled with drug addiction throughout his career and has been arrested multiple times. In 2012, he was found guilty of driving under the influence in Los Angeles and was sentenced to 13 days in jail. The boxer was arrested last year for weapons possession. Police said Chávez had two rifles. He was released shortly afterward upon posting $50,000 bail (£36,000), on the condition that he attend a facility to receive treatment for his addiction."
    },
    {
        "title": "Israeli military strikes Houthi regime in Yemen after 'repeated attacks'",
        "description": "Israel says it has carried out strikes against Houthi military targets in Yemen's capital Sanaa.",
        "url": "https://news.sky.com/story/israeli-military-strikes-houthi-regime-in-yemen-after-repeated-attacks-13417723",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israeli-attacks-yemen_7000165.jpg?20250824160338",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-24 14:53:00",
        "Headline": "The Israel Defence Forces (IDF) said on Sunday it struck the regime's \"military infrastructure\", including a site \"in which the presidency palace is located, the Asar and Hizaz power plants, and a site for storing fuel\".",
        "Content": "Israel says it has carried out strikes against Houthi military targets in Yemen's capital Sanaa. The attacks happened after the Iranian-backed militants said they fired a ballistic missile towards Israel on Friday. The Israel Defence Forces (IDF) said on Sunday it struck the regime's \"military infrastructure\", including a site \"in which the presidency palace is located, the Asar and Hizaz power plants, and a site for storing fuel\". The IDF also said the strikes were carried out in response to \"repeated attacks\" by the Houthis against Israel, such as \"the launching of surface-to-surface missiles and UAVs (Unmanned Aerial Vehicles) toward Israeli territory in recent days\". The presidential palace is within a military site where the Houthi regime operates, and the power plants were used as a \"significant electricity supply facility for military activities\", the IDF added. The Houthi-run health ministry said that at least two people were killed and 35 others were wounded. Referring to the missile fired at Israel on Friday, an Israeli air force official said the weapon most likely carried several sub-munitions \"intended to be detonated upon impact\". \n                  At least four killed and 'many' kidnapped after Houthi rebels sink cargo ship Eternity C in Red Sea\n                 \n                  Israel attacks Houthi targets at three ports and power plant in Yemen\n                 \n                  Where does Trump's Houthi announcement leave Israel?\n                 \"This is the first time that this kind of missile has been launched from Yemen\", the official said. The Israeli strikes were the first to hit Yemen since a week ago, when Israel said it targeted energy infrastructure it believed was used by the rebels. On Sunday, residents in Sanaa said they heard loud explosions near a closed military academy and the presidential palace. They said they saw smoke plumes near Sabeen Square, a central gathering place in the capital. \"The sound of explosions were very strong,\" said Hussein Mohamed, a Yemeni resident, who lives close to the presidential palace. Another resident, Ahmed al Mekhlafy, also said he felt the force of the strikes. \"The house was rocked, and the windows were shattered,\" he said. Nasruddin Amer, deputy head of the Houthi media office, claimed the Israeli strikes will not deter the rebels, and vowed to continue their attacks on Israel. Read more from Sky News:Israel hits outskirts of Gaza CityTwo married couples found dead after Germany crash Since Israel's war in Gaza against Hamas began in October 2023, the Houthis have attacked vessels in the Red Sea in what they describe as acts of solidarity with Palestinians. They have also frequently fired missiles towards Israel, most of which have been intercepted. Israel has responded with strikes on Houthi-controlled areas, including the vital Hodeidah port. In late 2014, a civil war erupted in Yemen when the Houthis seized Sanaa. The Houthis have established control over much of the north and other large population centres, while the internationally recognised government is based in the port city of Aden."
    },
    {
        "title": "Ghislaine Maxwell was given 'platform to rewrite history', say Virginia Giuffre's family",
        "description": "The family of Virginia Giuffre, who was one of Jeffrey Epstein's most prominent sex trafficking accusers, have said they are \"outraged\" over the US Department of Justice's release of an interview with Ghislaine Maxwell.",
        "url": "https://news.sky.com/story/ghislaine-maxwell-was-given-platform-to-rewrite-history-say-virginia-giuffres-family-13417404",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-giuffre-jeffery-epstein_6872288.jpg?20250331160500",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-24 01:03:00",
        "Headline": "Ms Giuffre, who died in April, had previously claimed that Maxwell introduced her to Jeffrey Epstein and hired her as his masseuse, before she was sex trafficked and sexually abused by him and associates.",
        "Content": " The family of Virginia Giuffre, who was one of Jeffrey Epstein's most prominent sex trafficking accusers, have said they are \"outraged\" over the US Department of Justice's release of an interview with Ghislaine Maxwell. Maxwell - a convicted sex trafficker and ex-girlfriend of the deceased paedophile financier Epstein - refuted several claims of child sex trafficking and abuse during the two-day-long interview with Deputy Attorney General Todd Blanche in July. Reacting after the transcripts of the interview were released on Friday, Ms Giuffre's family said it gave Maxwell the \"platform to rewrite history\" and showed she was \"never challenged about her court-proven lies\". \"As the family of one of the most prominent survivors, Virginia Roberts Giuffre, we are outraged,\" they said in a statement. \"The content of these transcripts is in direct contradiction with felon Ghislaine Maxwell's conviction for child sex trafficking.\" Ms Giuffre's family added: \"This travesty of justice entirely invalidates the experiences of the many brave survivors who put their safety, security, and lives on the line to ensure her conviction, including our sister.\" Referencing Maxwell's move to a minimum-security facility in Texas earlier this month, they said it \"sends a disturbing message that child sex trafficking is acceptable and will be rewarded\". \n                  US Justice Department releases Ghislaine Maxwell interview transcript\n                 \n                  Trump says 'nobody has asked' him to pardon Ghislaine Maxwell - but he has 'right to do it'\n                 \n                  Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says\n                 \"We continue to call upon the DOJ (Department of Justice) to do its job by investigating and holding accountable the many rich and powerful people who enabled Ghislaine Maxwell's and Jeffrey Epstein's crimes,\" they concluded. Ms Giuffre, who died by suicide in April, had previously claimed that Maxwell introduced her to Epstein and hired her as his masseuse, before she was sex trafficked and sexually abused by him and associates around the world.  She sued Prince Andrew for sexual abuse in August 2021 - saying he had sex with her when she was 17 and had been trafficked by Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\". During her interview with Mr Blanche last month, Maxwell said Ms Giuffre's allegation against the duke \"doesn't hold water\", and denied ever introducing Epstein to him or Sarah Ferguson. She insisted Epstein and Andrew met separately, and said \"I think Sarah [Ferguson] is the one that pushed that\", before saying that allegations Andrew had sex with Ms Giuffre were untrue, as she was at her mother's 80th birthday celebrations in the countryside outside the city. Maxwell then claimed Ms Giuffre's allegation that she and Andrew had sexual contact in the bathroom of her London flat was not true, as the room was not big enough. She also claimed that an image of her standing alongside Andrew with his arm around Ms Giuffre's waist was \"literally a fake photo\". During the interview with Mr Blanche, Maxwell denied ever seeing US President Donald Trump in an \"inappropriate setting\" and insisted she was not aware of any Epstein 'client list'. Read more:All we know about Trump and Epstein's 'friendship'Trump told in May his name appears in Epstein files - reportVirginia Giuffre wanted Epstein files released, her family say Under growing pressure to release files related to Epstein, as he promised to do during his 2024 presidential campaign, Mr Trump has made a series of denials and claims about the paedophile financier. In July, the president told reporters on Air Force One that Epstein \"stole\" Ms Giuffre and other young women from his Mar-a-Lago resort in Florida.  Mr Trump has also floated a pardon for Maxwell, saying earlier this month that \"nobody\" had asked to but insisted that he has \"the right to do it\". \"I'm allowed to do it, but nobody's asked me to do it. I know nothing about it,\" he added. \"I don't know anything about the case, but I know I have the right to do it. \"I have the right to give pardons, I've given pardons to people before, but nobody's even asked me to do it.\" Maxwell was sentenced in the US in June 2022 to 20 years in prison following her conviction on five counts of sex trafficking for luring young girls to massage rooms for Epstein to abuse. She has asked the US Supreme Court to overturn her conviction. Epstein, 66, was found dead in his cell at a Manhattan federal jail in August 2019 as he awaited trial on sex trafficking charges. His death was ruled a suicide. Read more from Sky News:Man wrongly sent to El Salvador threatened with deportation to UgandaWhy Donald Trump believes he 'deserves the Nobel Peace Prize' His case has generated endless attention and conspiracy theories due to his and Maxwell's links to famous people like royals, presidents and billionaires, including Mr Trump. No one other than Epstein and Maxwell has been charged with any criminal offences."
    },
    {
        "title": "'I'm deprived of my UK citizenship but I'm not a convicted terrorist'",
        "description": "Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria.",
        "url": "https://news.sky.com/story/im-deprived-of-my-uk-citizenship-but-im-not-a-convicted-terrorist-13415693",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tauqir-sharif-uk-citizenship-stripped_6999685.jpg?20250824022103",
        "type": "World",
        "Author": "Tom Cheshire",
        "Date Published": "2025-08-24 11:29:00",
        "Headline": "The UK uses deprivation of citizenship orders \"more than almost any country in the world\" - but there are now questions over what it means for those who travelled to Syria.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n  Hayat Tahrir al Sham (HTS) went from a jihadist movement once aligned to al Qaeda to forming the official government of Syria. It was a monumental transformation for them, their country and the wider Middle East. But potentially too for British people who went to Syria - and who were stripped of their citizenship as a result, on the grounds of national security. Tauqir Sharif, better known as Tox, went to Syria in 2012 as an aid worker. He was accused of being part of a group affiliated with al Qaeda, which he denies, and the then-home secretary Amber Rudd deprived him of his British citizenship in 2017. \"As of now, I am deprived of my UK citizenship but I'm not a convicted terrorist - and the reason for that is because we refused, we boycotted, the SIAC [Special Immigration Appeals Commission] secret courts, which don't allow you to see any of the evidence presented against you,\" he said. \"And one of the things that I always called for was, look, put me in front of a jury, let's have an open hearing.\" HTS is still a proscribed terrorist organisation but the British government has now established relations with it. \n                  'You just need a bad day to get killed': Defusing death in the former IS terror capital\n                 \n                  CCTV shows men in combat clothing shooting hospital volunteer at point-blank range in Syria\n                 \n                  Young British girl returns to UK from IS detention camp in Syria, authorities say\n                 Foreign Secretary David Lammy travelled to Damascus to meet the jihadist-turned-Syrian interim president - the man who swapped his nom de guerre of al Jolani for Ahmed al Sharaa. If the UK government takes HTS off the terror list, what does that mean for those who lost their citizenship after being accused of being part of it? People who joined HTS are only a subset among the scores of people who have had their citizenship revoked - a tool the UK government has been quick to use. According to a report by the Parliamentary Joint Human Rights Committee, the UK \"uses deprivation of citizenship orders more than almost any country in the world\". The peak of that was in 2017, and mainly in relation to Syria - especially in the case of people joining Islamic State, perhaps most famously Shamima Begum. And because people cannot be made entirely stateless, and need to have a second nationality, or be potentially eligible for one, there are worries of racism in who the orders apply to. Countries like Pakistan and Bangladesh offer dual nationality, whereas other nations do not. In 2022, the Institute of Race Relations said \"the vast majority of those deprived are Muslim men with South Asian or Middle Eastern/North African heritage\". Legal grey areas Sky News submitted Freedom of Information requests to the Home Office asking for a breakdown of second nationalities of those deprived of citizenship, but was refused twice on national security grounds. The independent reviewer of terrorism legislation, Jonathan Hall KC, told Sky News there are issues around transparency. \"I do think there is a problem when you have people whose relationship with the country that they're left with is really technical and they may never have realised that they had that citizenship before and may never gone to that country,\" he said. \"Me and my predecessors have all said, owing to how frequently this power is used, it should be something that the independent reviewer should have the power to review. I asked, my predecessor asked, we've both been told no, so I agree there's a lack of transparency.\" Read more from Sky News:Menendez brothers denied parole - but they could still taste freedomWhat Epstein's right-hand woman said about Trump and Prince AndrewUK set to bask in 30C sunshine over bank holiday weekend No automatic reversal Even if the government does remove HTS from the terror list, it would not automatically invalidate decisions to deprive people of their citizenship. Macer Gifford gave up a career as a banker in London to join the Kurdish People's Protection Units (YPG) as a foreign volunteer between 2015 and 2017. He told Sky News that decisions \"made years ago in the interest of the British public have to remain\". \"We can't sort of go through previous cases nitpicking through it, wasting time and money to bring it up to date,\" he added. \"We can't be naive because the intent to go out, the decision to go in itself is a huge decision for them. So it shows commitment when they're there, they then, if they take an active participation in the organisations that they've been accused of joining, again, that involves training and perseverance and dedication to the cause.\" But those born and raised in Britain, who joined the same cause, and lost their citizenship as a result, might reasonably ask why that should remain the case."
    },
    {
        "title": "Bands pull out from festival after group 'cut off' over Palestine flag",
        "description": "Several bands have pulled out from the Victorious music festival just hours before their scheduled performances,&#160;following claims by Irish folk group The Mary Wallopers that they were \"cut off\" for displaying a Palestinian flag.",
        "url": "https://news.sky.com/story/bands-pull-out-from-festival-after-group-claims-it-was-cut-off-over-palestine-flag-13417474",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-victoirious-victorious-festiva_6999782.jpg?20250824101547",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-24 13:32:00",
        "Headline": "Several bands have pulled out from the Victorious music festival just hours before their scheduled performances, after Irish folk group The Mary Wallopers had their set cut short. ",
        "Content": "Several bands have pulled out from the Victorious music festival just hours before their scheduled performances, following claims by Irish folk group The Mary Wallopers that they were \"cut off\" for displaying a Palestinian flag. The Last Dinner Party, Cliffords, and The Academic announced on Saturday that they would no longer be performing at the annual music festival in Portsmouth following Friday's incident. The organisers, who said the band's set was cut short for using a \"discriminatory\" chant, have since apologised and promised to make \"a substantial donation to humanitarian relief efforts for the Palestinian people\". Rock band The Last Dinner Party said they are \"outraged\" by the incident and would boycott the festival. \"We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today,\" they said in a statement shared on their Instagram page. \"As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause. \"To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\" \n                  Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse\n                 \n                  Family pay tribute to 'beloved' man who died in 'accident while working on fairground ride'\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 The Last Dinner Party said that throughout the summer, they have used their performances to encourage their audiences to make donations to a medical charity supporting Palestinians and urged their fans \"more than ever to do the same\". The band said they are \"devastated to be put in this position\" and apologised to those who were hoping to see them perform. Following The Mary Wallopers' set, a spokesperson for Victorious said: \"We spoke to the artist before the performance regarding the festival's long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show. \"Although a flag was displayed on stage contrary to our policy, and this was raised with the artist's crew, the show was not ended at this point, and it was the artist's decision to stop the song.\" Read more from Sky News:Criminals could be banned from pubs and sports grounds under new plansLegendary boxer to stand trial in Mexico over alleged cartel ties The Mary Wallopers claimed the festival had released a \"misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band's call to Free Palestine\". The band said their video \"clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of 'Free Palestine'\". \"The same crew member is later heard in the video saying 'you aren't playing until the flag is removed',\" the band added. Rock band The Academic have also pulled out of the festival, saying they could not \"in good conscience\" perform at \"a festival that silences free speech\", while Irish band Cliffords said they \"refuse to play if we are to be censored for showing our support to the people of Palestine\". After the bands' announcements that they were pulling out of the festival, the organisers released another statement, saying that they did not handle \"the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached\", and issued an apology."
    },
    {
        "title": "Flesh-eating screwworm parasite detected in person in US for first time",
        "description": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time.",
        "url": "https://news.sky.com/story/flesh-eating-screwworm-parasite-detected-in-person-in-us-for-first-time-13418013",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-screw-worm_7000663.jpg?20250825001602",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-24 22:49:00",
        "Headline": "The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year.",
        "Content": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time. The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year. It is ultimately fatal if left untreated. The case in the US was identified in a person from Maryland who had travelled from Guatemala. Beth Thompson, South Dakota's state veterinarian, told Reuters on Sunday that she was notified of the case within thelast week. A Maryland state government official also confirmed the case. The person was treated and prevention measures were implemented, Reuters reports. The Centres for Disease Control and Prevention (CDC) and the Maryland Department of Health did not immediately respond to requests for comment.  What is screwworm? The female screwworm fly lays eggs in the wounds of warm-blooded animals and once hatched, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh. It can be devastating in cattle and wildlife, and has also been known to infect humans. Treatment is onerous, and involves removing hundreds of larvae and thoroughly disinfecting wounds. They are largely survivable if treated early enough. The confirmed case is likely to rattle the beef and cattle futures market, which has seen record-high prices because of tight supplies. The US typically imports more than a million cattle from Mexico each year to process into beef. The screwworm outbreak could cost Texas - the biggest cattle-producing state - $1.8bn (£1.3bn) in livestock deaths, labour costs and medicationexpenses. The United States Department of Agriculture (USDA) has set traps and sent mounted officers along the border, but it has faced criticism from some cattle producers and market analysts for not acting faster to pursue increased fly production via a sterile fly facility. What is a sterile fly facility? The case also comes just one week after the US agriculture secretary, Brooke Rollins, travelled to Texas to announce plans to build a sterile fly facility there in a bid to combat the pest. Ms Rollins had pledged repeatedly to keep screwworm out of the country. Read more:Trump seeking to 'manufacture a crisis' in ChicagoMenendez brothers denied parole A sterile fly facility produces a large number of male flies and sterilises them - these males are then released to mate with wild female insects, which collapses the wild population over time. This method eradicated screwworm from the US in the 1960s. Mexico has also taken efforts to limit the spread of the pest, which can kill livestock within weeks if not treated. It had started to build a $51m sterile fly production facility. The USDA has previously said 500 million flies would need to be released weekly to push the fly back to the Darien Gap, the stretch of rainforest between Panama and Colombia."
    },
    {
        "title": "Trump seeking to 'manufacture a crisis' in Chicago, says Illinois governor",
        "description": "The governor of Illinois has accused Donald Trump of \"attempting to manufacture a crisis\" over reports the US president was considering deploying the military in the state.",
        "url": "https://news.sky.com/story/trump-seeking-to-manufacture-a-crisis-in-chicago-says-illinois-governor-13417405",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-us-president_6997923.jpg?20250822181512",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-24 02:19:00",
        "Headline": "Donald Trump said on Friday that \"Chicago is a mess\" and hinted the federal government could get involved, saying \"we'll straighten that one out probably next\".",
        "Content": "The governor of Illinois has accused Donald Trump of \"attempting to manufacture a crisis\" over reports the US president was considering deploying the military in the state. US newspaper The Washington Post reported on Saturday that the Pentagon was drafting plans to deploy the US army in Chicago, the largest city in the state. It comes as part of Mr Trump's crackdown on crime, homelessness, and illegal immigration in mainly Democrat-run cities. He recently deployed the National Guard in Washington DC. In a statement responding to the report, governor JB Pritzker said Illinois had \"received no requests or outreach from the federal government asking if we need assistance, and we have made no requests for federal intervention\". He added: \"The safety of the people of Illinois is always my top priority. \"There is no emergency that warrants the President of the United States federalising the Illinois National Guard, deploying the National Guard from other states, or sending active duty military within our own borders.\" The governor then said: \"Donald Trump is attempting to manufacture a crisis, politicise Americans who serve in uniform, and continue abusing his power to distract from the pain he is causing working families. \n                  From Chicago's south suburbs to Rome: Dolton's faithful say 'Bob' was the boy destined to be pope\n                 \n                  Streets empty in Chicago over fears of arrest under Donald Trump's immigration crackdown\n                 \n                  Four people shot dead 'execution-style as they slept in their seats' on Chicago area train\n                 \"We will continue to follow the law, stand up for the sovereignty of our state, and protect the people of Illinois.\" Officials familiar with the proposals told the Post that several options were being weighed up by the US defence department, including mobilising thousands of National Guard troops in Chicago as early as September. The Pentagon said it would not comment on planned operations, adding: \"The department is a planning organisation and is continuously working with other agency partners on plans to protect federal assets and personnel.\" Mr Trump, however, told reporters on Friday that \"Chicago is a mess,\" before attacking the city's mayor Brandon Johnson and hinting \"we'll straighten that one out probably next\". Mr Johnson has not yet commented on Saturday's reports, but said on Friday that the president's approach to tackling crime has been \"uncoordinated, uncalled for and unsound\". \"There are many things the federal government could do to help us reduce crime and violence in Chicago, but sending in the military is not one of them,\" he added. Read more from Sky News:'I'm deprived of my UK citizenship but I'm not a convicted terrorist'Analysis: Farage has finally embraced Trump-style rhetoricWhat Epstein's right-hand woman says about Trump and Prince Andrew It comes after around 800 National Guard troops were deployed in Washington DC earlier this month, despite the US capital's mayor revealing crime in the capital was at its \"lowest level in 30 years\".  According to preliminary figures from Washington DC's Metropolitan Police, violent crime is down 26% in 2025 - after dropping 35% in 2024 compared with 2023. In June Mr Trump ordered 700 US Army marines and 4,000 National Guard troops to Los Angeles in California, during protests over mass immigration raids. The deployment came against the wishes of state governor Gavin Newsom, who said: \"The federal government is sowing chaos so they can have an excuse to escalate. \"That is not the way any civilised country behaves.\""
    },
    {
        "title": "Ghislaine Maxwell was given 'platform to rewrite history', say Virginia Giuffre's family",
        "description": "The family of Virginia Giuffre, who was one of Jeffrey Epstein's most prominent sex trafficking accusers, have said they are \"outraged\" over the US Department of Justice's release of an interview with Ghislaine Maxwell.",
        "url": "https://news.sky.com/story/ghislaine-maxwell-was-given-platform-to-rewrite-history-say-virginia-giuffres-family-13417404",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-giuffre-jeffery-epstein_6872288.jpg?20250331160500",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-24 01:03:00",
        "Headline": "Ms Giuffre, who died in April, had previously claimed that Maxwell introduced her to Jeffrey Epstein and hired her as his masseuse, before she was sex trafficked and sexually abused by him and associates.",
        "Content": " The family of Virginia Giuffre, who was one of Jeffrey Epstein's most prominent sex trafficking accusers, have said they are \"outraged\" over the US Department of Justice's release of an interview with Ghislaine Maxwell. Maxwell - a convicted sex trafficker and ex-girlfriend of the deceased paedophile financier Epstein - refuted several claims of child sex trafficking and abuse during the two-day-long interview with Deputy Attorney General Todd Blanche in July. Reacting after the transcripts of the interview were released on Friday, Ms Giuffre's family said it gave Maxwell the \"platform to rewrite history\" and showed she was \"never challenged about her court-proven lies\". \"As the family of one of the most prominent survivors, Virginia Roberts Giuffre, we are outraged,\" they said in a statement. \"The content of these transcripts is in direct contradiction with felon Ghislaine Maxwell's conviction for child sex trafficking.\" Ms Giuffre's family added: \"This travesty of justice entirely invalidates the experiences of the many brave survivors who put their safety, security, and lives on the line to ensure her conviction, including our sister.\" Referencing Maxwell's move to a minimum-security facility in Texas earlier this month, they said it \"sends a disturbing message that child sex trafficking is acceptable and will be rewarded\". \n                  US Justice Department releases Ghislaine Maxwell interview transcript\n                 \n                  Trump says 'nobody has asked' him to pardon Ghislaine Maxwell - but he has 'right to do it'\n                 \n                  Ghislaine Maxwell answered justice department questions 'about 100 different people', her lawyer says\n                 \"We continue to call upon the DOJ (Department of Justice) to do its job by investigating and holding accountable the many rich and powerful people who enabled Ghislaine Maxwell's and Jeffrey Epstein's crimes,\" they concluded. Ms Giuffre, who died by suicide in April, had previously claimed that Maxwell introduced her to Epstein and hired her as his masseuse, before she was sex trafficked and sexually abused by him and associates around the world.  She sued Prince Andrew for sexual abuse in August 2021 - saying he had sex with her when she was 17 and had been trafficked by Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\". During her interview with Mr Blanche last month, Maxwell said Ms Giuffre's allegation against the duke \"doesn't hold water\", and denied ever introducing Epstein to him or Sarah Ferguson. She insisted Epstein and Andrew met separately, and said \"I think Sarah [Ferguson] is the one that pushed that\", before saying that allegations Andrew had sex with Ms Giuffre were untrue, as she was at her mother's 80th birthday celebrations in the countryside outside the city. Maxwell then claimed Ms Giuffre's allegation that she and Andrew had sexual contact in the bathroom of her London flat was not true, as the room was not big enough. She also claimed that an image of her standing alongside Andrew with his arm around Ms Giuffre's waist was \"literally a fake photo\". During the interview with Mr Blanche, Maxwell denied ever seeing US President Donald Trump in an \"inappropriate setting\" and insisted she was not aware of any Epstein 'client list'. Read more:All we know about Trump and Epstein's 'friendship'Trump told in May his name appears in Epstein files - reportVirginia Giuffre wanted Epstein files released, her family say Under growing pressure to release files related to Epstein, as he promised to do during his 2024 presidential campaign, Mr Trump has made a series of denials and claims about the paedophile financier. In July, the president told reporters on Air Force One that Epstein \"stole\" Ms Giuffre and other young women from his Mar-a-Lago resort in Florida.  Mr Trump has also floated a pardon for Maxwell, saying earlier this month that \"nobody\" had asked to but insisted that he has \"the right to do it\". \"I'm allowed to do it, but nobody's asked me to do it. I know nothing about it,\" he added. \"I don't know anything about the case, but I know I have the right to do it. \"I have the right to give pardons, I've given pardons to people before, but nobody's even asked me to do it.\" Maxwell was sentenced in the US in June 2022 to 20 years in prison following her conviction on five counts of sex trafficking for luring young girls to massage rooms for Epstein to abuse. She has asked the US Supreme Court to overturn her conviction. Epstein, 66, was found dead in his cell at a Manhattan federal jail in August 2019 as he awaited trial on sex trafficking charges. His death was ruled a suicide. Read more from Sky News:Man wrongly sent to El Salvador threatened with deportation to UgandaWhy Donald Trump believes he 'deserves the Nobel Peace Prize' His case has generated endless attention and conspiracy theories due to his and Maxwell's links to famous people like royals, presidents and billionaires, including Mr Trump. No one other than Epstein and Maxwell has been charged with any criminal offences."
    },
    {
        "title": "Legendary boxer Julio César Chávez Jr. to stand trial in Mexico over alleged cartel ties",
        "description": "Legendary boxer Julio C&#233;sar Ch&#225;vez Jr. will stand trial over alleged cartel ties and arms trafficking, his lawyer has said.&#160;",
        "url": "https://news.sky.com/story/legendary-boxer-julio-c233sar-ch225vez-jr-to-stand-trial-in-mexico-over-alleged-cartel-ties-13417445",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-julio-cesar-chavez-jr_6999725.jpg?20250824085434",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-24 07:35:00",
        "Headline": "Mexican prosecutors have been investigating the boxer since 2019, after US authorities filed a complaint against the Sinaloa Cartel.",
        "Content": "Legendary boxer Julio César Chávez Jr. will stand trial over alleged cartel ties and arms trafficking, his lawyer has said.  A Mexican court has granted a three-month extension for further investigation into the case, according to Chávez's lawyer, Rubén Fernando Benítez Alvarez. He said the claims against his client were \"speculation\" and \"urban legends\" after a court hearing on Saturday in the northern Mexican city of Hermosillo. If convicted, Chávez - who took part in the hearing virtually from a detention facility - could face a prison sentence of four to eight years, Mr Alvarez said. Chávez, 39, who has been living in the United States for several years, was arrested in early July by federal agents outside his Los Angeles home for overstaying his visa and providing inaccurate details on an application to obtain a green card. The arrest came just days after a fight he had with famed American boxer Jake Paul in Los Angeles. Mexican prosecutors have been investigating the boxer since 2019 after US authorities filed a complaint against the Sinaloa Cartel for organized crime, human trafficking, arms smuggling, and drug trafficking. \n                  Ukraine war latest: Trump, Pope Leo and Xi Jinping congratulate Ukraine on Independence Day | War latest\n                 \n                  Israel pounds outskirts of Gaza City overnight as military offensive plans continue\n                 \n                  Pro-Palestine Australians protest after week of tension with Israel\n                 The case prompted investigations into 13 individuals, including Ovidio Guzmán López - the son of convicted drug lord Joaquín \"El Chapo\" Guzmán - as well as several associates, hitmen, and accomplices of the criminal organization. Guzmán López was arrested in January 2023 and extradited to the US eight months later. Read more from Sky News:Criminals could be banned from pubs and sports grounds under new plansUK braces for more protests over the use of hotels to house asylum seekersFollowing the inquiry, the Federal Attorney General's Office issued several arrest warrants, including one against Chávez. The boxer was deported by the US on 9 August and handed over to agents of the Federal Attorney General's Office in Sonora state, who transferred him to the Federal Social Reintegration Center in Hermosillo. The high-profile case comes amid the Trump administration's efforts to pressure Mexico into cracking down on organized crime, including cancelling visas of prominent Mexican artists and celebrities, and increasing deportations. Chávez has struggled with drug addiction throughout his career and has been arrested multiple times. In 2012, he was found guilty of driving under the influence in Los Angeles and was sentenced to 13 days in jail. The boxer was arrested last year for weapons possession. Police said Chávez had two rifles. He was released shortly afterward upon posting $50,000 bail (£36,000), on the condition that he attend a facility to receive treatment for his addiction."
    },
    {
        "title": "New Look owners pick bankers to fashion sale process",
        "description": "The owners of New Look, the high street fashion retailer, have picked bankers to oversee a strategic review which is expected to see the company change hands next year.",
        "url": "https://news.sky.com/story/new-look-owners-pick-bankers-to-fashion-sale-process-13417489",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-new-look-money_6999797.jpg?20250824105557",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-24 09:39:00",
        "Headline": "Alcentra and Brait, which have owned the high street clothing chain since 2020, have selected Rothschild to orchestrate a strategic review, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of New Look, the high street fashion retailer, have picked bankers to oversee a strategic review which is expected to see the company change hands next year. Sky News has learnt that Rothschild has been appointed in recent days to advise New Look and its shareholders on a potential exit. The investment bank's appointment follows a number of unsolicited approaches for the business from unidentified suitors. New Look, which trades from almost 340 stores and employs about 10,000 people across the UK, is the country's second-largest womenswear retailer in the 18-to-44 year-old age group. It has been owned by its current shareholders - Alcentra and Brait - since October 2020. In April, Sky News reported that the investors were injecting £30m of fresh equity into the business to aid its digital transformation. Last year, the chain reported sales of £769m, with an improvement in gross margins and a statutory loss before tax of £21.7m - down from £88m the previous year. \n                  Coca-Cola brews up sale of high street coffee giant Costa\n                 \n                  Money latest: Why experts are getting worried about the UK being able to feed itself\n                 \n                  TikTok puts hundreds of UK jobs at risk\n                 Like most high street retailers, it endured a torrid Covid-19 and engaged in a formal financial restructuring through a company voluntary arrangement. In the autumn of 2023, it completed a £100m refinancing deal with Blazehill Capital and Wells Fargo. A spokesperson for New Look declined to comment specifically on the appointment of Rothschild, but said: \"Management are focused on running the business and executing the strategy for long-term growth. \"The company is performing well, with strong momentum driven by a successful summer trading period and notable online market share gains.\" Roughly 40% of New Look's sales are now generated through digital channels, while recent data from the market intelligence firm Kantar showed it had moved into second place in the online 18-44 category, overtaking Shein and ASOS."
    },
    {
        "title": "Laws to largely abolish use of short prison sentences to be introduced within weeks",
        "description": "New laws to reduce the use of short prison sentences and toughen up community punishments are expected to be introduced within weeks.",
        "url": "https://news.sky.com/story/laws-to-largely-abolish-use-of-short-prison-sentences-to-be-introduced-within-weeks-13417589",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prisons-prison_6932009.jpg?20250531160650",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-24 13:18:00",
        "Headline": "The changes will also make community sentences tougher, and introduce many of the measures recommended by the sentencing review.",
        "Content": "New laws to reduce the use of short prison sentences and toughen up community punishments are expected to be introduced within weeks. Ministers are expected to introduce the new legislation to the Commons after the summer recess. The changes will abolish most short-term prison sentences and introduce an earned release scheme, based on a model used in Texas, where prisoners who demonstrate good behaviour can be freed earlier - while those who disobey prison rules are detained for longer. This will include some prisoners jailed for violent offences, although those convicted of the most dangerous crimes and for terrorism will be excluded. The new bill will introduce many of the changes recommended by the independent sentencing review, carried out by former Conservative justice minister David Gauke earlier this year. It represents one of the largest overhauls of sentencing in a generation and marks a cornerstone of the government's effort to reduce the size of the prison population in England and Wales. As well as reducing the use of short custodial sentences, the changes will also toughen up community sentences, introducing a wider range of punishments for those serving time outside of prison. This could include bans on going to stadiums to watch sports or music events, as well as restrictions on visiting pubs, and the wider use of drug testing.  Other punishments could include driving and travel bans, as well as restriction zones - confining them to certain areas. Some of these can already be imposed for certain crimes, but the new laws will mean that these could be handed down by a judge for any offence. \n                  Is it time for gunboats to help stop the people smugglers?\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 \n                  Ban passengers playing loud music on public transport, say Tories\n                 Under the legislation, which it is understood will be introduced in September, prison sentences of 12 months or less will be scrapped, except for in exceptional circumstances such as domestic abuse cases. Meanwhile, the length of suspended sentences - where an offender is not sent to prison immediately unless they commit a further crime - will be extended from two years to three. The justice secretary is believed to have been inspired by the earned release scheme during a visit to the States, where she learned about the model being used in Texas to cut crime and bring their prison population under control.  Shabana Mahmood said that criminals who break the rules \"must be punished\" and that those serving their sentences in the community \"must have their freedom restricted there, too\". She added: \"Rightly, the public expect the government to do everything in its power to keep Britain safe, and that's what we're doing.\" A spokesperson for the Ministry of Justice added: \"This government inherited a prison system days away from collapse. \"That is why we are building 14,000 more prison places, with 2,500 already delivered, but we know we can't build our way out of this crisis. \"Without further action, we will run out of prison places in months, courts would halt trials and the police [would] cancel arrests. That is why we are overhauling sentencing to make sure we always have the prison places needed to keep the country safe.\""
    },
    {
        "title": "Is it time for gunboats to help stop the people smugglers?",
        "description": "Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem.",
        "url": "https://news.sky.com/story/is-it-time-for-gunboats-to-help-stop-the-people-smugglers-13417741",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-migrants-france-small-boats_6932334.jpg?20250601093505",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-08-24 15:14:00",
        "Headline": "With the PM's and Labour's poll numbers tanking as the latest official figures confirm the numbers of migrants and small boat crossings are increasing at a shocking rate, is it now time for a different approach?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Curbing the power of judges in asylum cases to tackle the migrant hotel crisis is a typical Keir Starmer response to a problem. The former director of public prosecutions would appear to see overhauling court procedures and the legal process as the answer to any tricky situation. Yes, the proposed fast-track asylum appeals process is fine as far as it goes. But for a government confronted with a massive migrant crisis, opponents claim it's mere tinkering. And welcome and worthy as it is, it isn't going to \"smash the gangs\", stop the boats or act as a powerful deterrent to the people smugglers plying their trade in the Channel. As protests outside migrant hotels grow noisier and clashes between rival demonstrators become potentially violent, do we hear this cry from the voters: \"What do we want? An independent commission of professional adjudicators! When do we want it? As soon as legislative time allows!\" Of course not. Even those who don't agree with Nigel Farage's apparent indifference - in his Times interview this weekend, to asylum seekers sent back to Afghanistan being killed or tortured by the Taliban - are demanding bolder and more radical measures from the government. \n                  Fast-track asylum appeals process to be introduced - as average time for decisions is more than one year\n                 \n                  Reform UK's new immigration plans would have been seen as extreme just a few years ago\n                 \n                  Asylum hotel protests expected to swell this weekend - as Farage unveils 'mass deportation' plan\n                 And those who tire of the shadow home secretary Chris Philp's constant criticisms of the government would probably accept that attempts to stop the boats in the Channel are not just useless but farcical. On a visit to the Channel earlier this month, Mr Philp said: \"There's a boat full of illegal immigrants crossing right in front of me. The French warship is escorting it and making no attempt at all to stop it.\" Later, assessing his trip, Mr Philp said: \"The people-smuggling conveyor belt is now a round trip, paid for by British taxpayers. \"We were in the middle of the Channel, just on the UK side of the border, witnessing the French handing over two boatloads of illegal migrants, Border Force picking them out, providing a taxi service back to the UK.\" So is Border Force fit for purpose? The Sunday Express reports that Martin Hewitt, Labour's Border Security Commander, is the highest-paid civil servant in the Home Office, with a salary of £200,000, more than the prime minister. Some top officials have also received bonuses. Philip Douglas, director general of the Border Force, received bonuses of up to £15,000 in 2024-25 on top of his £140,000-£145,000 salary. Why, given the force's lamentable performance? Given that Border Force clearly cannot cope with the small boat crossings, is it time to bring in the Royal Navy and some gunboat diplomacy, since the French government clearly is not helping to stop the boats? It's happened before, after all. In January 2022, former Prime Minister Boris Johnson announced the Royal Navy would take command of counter-migration operations in the Channel to deter migrant crossings and intercept boats before they reached British shores. It was called Operation Isotrope. But after squabbling between the Home Office and the Ministry of Defence (MoD) and the mayor of Calais attacking a \"declaration of maritime war\", Rishi Sunak's government handed control back to the Home Office. Is it time for a rethink? Earlier this month, the Labour peer Lord Glasman, founder of the socially conservative Blue Labour group, urged the PM to use the Navy and drones in the Channel to stop small boat crossings. In May, however, armed forces minister Luke Pollard slapped down the former Reform UK, now independent, MP Rupert Lowe in the Commons when he asked what assessment had been made of the Navy's capacity to intercept small boats. \"Defence assets are procured for defence tasks,\" Mr Pollard said, dismissively. The Navy's primary role, he added, was to safeguard maritime security, including monitoring and shadowing foreign warships in British waters. But at the very least, the Royal Navy could provide better surveillance, since Border Force seems to be failing in that role, and just the sight of naval vessels in the Channel could be a deterrent. Sir Keir has put his faith in his \"one in, one out\" deportation deal with French President Emmanuel Macron and now in his asylum appeals shake-up. The government's opponents claim neither will be an effective deterrent, however. Farage is proposing \"mass deportation\" of hundreds of thousands of asylum seekers who come to the UK on small boats. Labour says he's \"plucking numbers out of the air\". But with the PM's and Labour's poll numbers tanking as the latest official figures confirm the numbers of migrants and small boat crossings are increasing at a shocking rate, is it now time for a different approach? Another Starmer U-turn, given the MoD's hostility to the Navy's involvement up to now? Gunboats, anyone?"
    },
    {
        "title": "More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars",
        "description": "Hundreds of shoplifting cases have gone unsolved every day, with the number of unsolved incidents rising by more than 40,000 over the past year.",
        "url": "https://news.sky.com/story/more-than-80-of-shoplifting-offences-result-in-no-charge-as-number-of-unsolved-cases-soars-13417713",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-istock-stock-file-generic_6959515.jpg?20250707162524",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-08-24 23:01:00",
        "Headline": "While the data has shown the number of unsolved cases is on the rise, it also revealed that the total number of shoplifting offences has increased dramatically, too.",
        "Content": "\n          Political reporter\n              @WillCharley1\n Hundreds of shoplifting cases have gone unsolved every day, with the number of unsolved incidents rising by more than 40,000 over the past year. New figures show that 289,464 cases of shoplifting were shut by police without a suspect in England and Wales in the year to March 2025, according to House of Commons library analysis. Of all shoplifting cases, more than half (55%) were closed without a suspect identified, while fewer than one in five (18%) led to someone being charged. Politics latest: Ministers announce new measures to clear asylum backlog The data shows the number of cases closed without a suspect has also risen significantly on the previous 12 months, with 245,337 cases shut by police forces without a suspect being identified in 2023-24, a rise of more than 40,000. The analysis, produced for the Liberal Democrats, suggests that on average, 793 shoplifting offences went unsolved every day. Senior Conservative politicians have told Sky News that the figures \"explain why Britain feels lawless\", and are urging ministers to scrap plans to largely end the use of short prison sentences, in favour of people serving time in the community. \n                  Criminals could be banned from pubs and sports grounds under new plans\n                 \n                  Man admits murdering customer in Derby bank branch knife attack\n                 \n                  Ex-lawyer can be extradited to Moldova over 'murder of Tottenham Turks gang boss', judge rules \n                 What else does the data show? The data covered all police forces in England and Wales, except for Humberside, but also included the British Transport Police. It revealed the Metropolitan Police had the worst record, with 76.9% of its 93,705 shoplifting cases being closed with nobody identified as a suspect. Just 5.9% of shoplifting incidents recorded in the capital and the wider region resulted in a charge. While the data has shown the number of unsolved cases is on the rise, it also revealed that the total number of shoplifting offences has increased dramatically, too.  In 2023-24, 444,022 cases of shoplifting were recorded. But in 2024-25, this rose to 530,643, a record high since the practice of recording the data nationally began in 2002-03. Overall, 2,071,156 offences of all types went unsolved in the 2024-25 year. This means, on average each day, 5,674 crimes were committed that went on to be closed without a suspect. Only 7.3% of all crimes recorded resulted in somebody being charged or summoned.  The Lib Dems have repeated their calls for police and crime commissioners - elected politicians who have authority over each police force - to be scrapped. They believe the money spent on these would be better invested in frontline policing, and that police boards, made up of local councillors and other individuals, could replace them. Lisa Smart, the party's home affairs spokesperson, said that the data reveals an \"absolute scandal\" because it shows that \"thousands of innocent victims are being left without the justice they deserve\" every day. She added: \"The previous Conservative government left behind a legacy of failure, but the Labour government has not been quick enough to address the unsolved crime epidemic - particularly as shoplifting spirals out of control.\" Tories: There should be a 'zero tolerance approach' to shoplifting Meanwhile, the shadow home secretary pointed out that shoplifting has risen by 20% under Labour, and that ministers show \"no signs of gripping it\". Chris Philp told Sky News: \"The vast majority of criminals aren't even caught - and Labour are now proposing to abolish prison sentences of under a year, so even the few that get caught won't suffer any real punishment.\" He has called for a \"zero tolerance approach\" and the greater use of technology, such as facial recognition technology, so that \"Labour's shoplifting epidemic can be stopped\". Read mores:Workers say shoplifting is 'out of control' after surge in brazen theftsWhy legion of shoplifters is causing an explosion in crimeTheft and fraud costs Co-op nearly £40m in just 6 months Earlier this month, Home Secretary Yvette Cooper announced a significant expansion of the use of facial recognition tech by police forces in England and Wales, with 10 new vans being rolled out - though the move was criticised by civil liberties groups.  Robert Jenrick, the shadow justice secretary, said the \"damning stats explain why Britain feels lawless\". He told Sky News: \"Starmer's plan to scrap prison sentences for shoplifters will only make this worse. We need the authorities to go after these criminals and lock them up for much longer to keep the public safe.\" The government has defended the proposals to largely end the use of shorter sentences, as recommended by the independent sentencing review, carried out earlier this year by former Conservative justice secretary David Gauke. A Ministry of Justice spokesperson said: \"Without further action, we will run out of prison places in months, courts would halt trials and the police [would] cancel arrests. That is why we are overhauling sentencing to make sure we always have the prison places needed to keep the country safe.\""
    },
    {
        "title": "Ban passengers playing loud music on public transport, say Tories",
        "description": "Passengers could be banned from causing a \"nuisance\" by playing loud music on public transport under proposals to change the law set out by the Tories.",
        "url": "https://news.sky.com/story/ban-passengers-playing-loud-music-on-public-transport-say-tories-13417519",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-man-music-bus-listens_6999998.jpg?20250824143951",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-24 21:00:00",
        "Headline": "The Tories say they would change the law to so that nobody has to \"endure somebody else's choice of crap music\" while on the move.",
        "Content": "Passengers could be banned from causing a \"nuisance\" by playing loud music on public transport under proposals to change the law set out by the Tories. The Conservatives said there should be \"swift justice for those who make people's lives a misery\" by playing music loudly on buses and trains, and that they would introduce on-the-spot fines to tackle this. Politics latest: Ministers announce new measures to clear asylum backlog Under the plans, byelaws that already protect passengers on trains would be more rigorously enforced, while the equivalent would be brought in for those on buses - where currently there is no ban on music being played out loud. Currently, rules around train travel already make playing music out loud an offence - but like other issues, such as fare evasion, this is subject to being enforced by the British Transport Police or the train operators themselves. Under the proposals, when the government brings its Railways Bill to the Commons, the Tories will add an amendment to ensure that all train operators and nationalised services have a legal duty to enforce these, and have to publicly publish measurements of how well this is happening. As well as this, the amendment would introduce on-the-spot fines. The Conservatives say they would also introduce the same rules to buses through the government's Buses Bill, and that this will be a condition for all new bus partnerships, franchises and terms of service. \n                  Laws to largely abolish use of short prison sentences to be introduced within weeks\n                 \n                  Is it time for gunboats to help stop the people smugglers?\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 Richard Holden, the shadow transport secretary, said: \"Taking public transport shouldn't mean having to endure somebody else's choice of crap music blasted through a speaker at full blast. \"Rail passengers need to see enforcement and swift justice for those who make people's lives a misery, and bus passengers need the same laws to protect them against this nuisance. \"Our proposals and amendments will end the two-tier system and be an important step in making sure every journey is free from the blight of anti-social noise \"Only Conservatives will make sure passengers get the quiet, comfortable journeys they deserve.\" The Liberal Democrats have already pushed for similar action. Sir Ed Davey's party revealed in April that they would change the law to introduce £1,000 fines for those playing music or videos out loud on public transport, and pledged to take on \"headphone dodgers\". Speaking about the Tory announcement on Monday, Neil O'Brien, the shadow minister for policy renewal, said: \"People playing music or TikTok out loud on public transport is not just annoying but can create an atmosphere of intimidation, with passengers worried about what will happen if they intervene. \"We need to create a new national norm, as part of creating a more orderly environment and taking back our streets and public places.\" The government has previously said that there are already \"strict rules\" in place, to prevent anti-social behaviour on public transport, which already include fines of up to £1,000."
    },
    {
        "title": "MP says she's received 'death threats' after 'misleading' video put out by neighbouring MP",
        "description": "An MP says she has received \"threats of death and violence\" over a video posted by a neighbouring MP, which she labelled \"misleading\" and \"irresponsible\".",
        "url": "https://news.sky.com/story/mp-says-shes-received-death-threats-after-misleading-video-put-out-by-neighbouring-mp-13417458",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anna-dixon-shipley-mp_6999748.jpg?20250824093111",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-08-24 08:16:00",
        "Headline": "Anna Dixon said her neighbouring MP has \"personally inflamed hatred against me\" in a video he posted on his social media.",
        "Content": "\n          Political reporter\n              @WillCharley1\n An MP says she has received \"threats of death and violence\" over a video posted by a neighbouring MP, which she labelled \"misleading\" and \"irresponsible\". Anna Dixon has accused her constituency neighbour of having \"personally inflamed hatred against me\" in a video he posted on Facebook, regarding her position on calls for local and national inquiries into grooming gangs. The Labour MP for Shipley, who was first elected last year, said Robbie Moore, a Conservative, had demonstrated \"irresponsible behaviour\" by posting \"blatant misinformation about a colleague\". In a lengthy message on social media, Ms Dixon wrote: \"I want local residents to be aware that I have received threats of death and violence directly posted in response to a misleading video recently shared by the MP for Keighley and Ilkley, Robbie Moore. \"These have been reported to the police, and an investigation is currently underway. \"Other responses to his post have subjected me to misogynistic abuse and made deeply offensive claims against me - he has chosen to let these remain public in the comments section on his social media.\" What does the video say? \n                  Laws to largely abolish use of short prison sentences to be introduced within weeks\n                 \n                  Is it time for gunboats to help stop the people smugglers?\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 Mr Moore first posted the video on social media on Wednesday, 20 August. Above the video, he wrote: \"Wow. Shipley's Labour MP Anna Dixon is 'misleading public' [sic] on grooming gangs inquiry. \"Anna is telling constituents she voted against an inquiry because it was a 'political stunt'. But a closer look at the facts shows Anna has been dismissing calls for an inquiry since day one... Your voice - or just another voice protecting Bradford's Labour Party?\"  The film is a little under two minutes long and examines Ms Dixon's position in the style of a news video, with a voice-over referring to \"our investigation\" and starts by announcing that she \"isn't telling you the truth\". It also uses clips from a BBC Politics North episode, which Ms Dixon appeared on, as well as extracts from an email. The video claims that Ms Dixon has been misleading the public about her reasons for voting against plans for a national inquiry into grooming gangs, and alleges that she has always been opposed to one from when she was first elected. Responding to the video on Saturday, Ms Dixon wrote: \"In putting out misleading information online in relationship to my position on child grooming gangs he has personally inflamed hatred against me, and in responding to constituents he has doubled down and repeated the attacks against me. \"We must always put victims and survivors first when it comes to tackling the horrific crime of child sexual exploitation - this issue should never be used to make personal attacks based on party politics.\" The Labour backbencher added: \"Group-based child sexual exploitation, committed by grooming gangs, is one of the most despicable and damaging crimes imaginable. I fully support all efforts by [the] government and West Yorkshire Police to bring perpetrators of these crimes to justice.\" She referenced how she has sought to tackle the issue by speaking about it in the Commons and meeting with survivors.  Ms Dixon added that she has \"always been transparent and direct with constituents\", and that she was \"shocked by the claim made in the video\" that she would oppose a focus on the Bradford district in any national inquiry into grooming gangs. She stated that the Tory MP's video selectively quotes an email she wrote, leaving out the sentence: \"If the national inquiry deems that another local inquiry is needed in Bradford, this is something I and the Local Authority will fully support.\" What is the argument fundamentally about? It appears the origin of the argument is Ms Dixon's decision in January 2025 to vote against an amendment to the Children's Wellbeing and Schools Bill. The Conservatives scheduled what Ms Dixon has called a \"wrecking amendment\" to the bill, which called for a national inquiry into grooming gangs. But voting for this amendment would have \"effectively killed the bill, which aimed to enhance safeguards for children\", Ms Dixon said.  Mr Moore, who is the shadow farming secretary, has said this is not the real reason that Ms Dixon voted against the amendment, and claims that instead, she is opposed to a national inquiry altogether. Sir Keir Starmer announced in June that there would be a national inquiry into grooming gangs, after spending several months resisting calls to do so. Ms Dixon has said she believes Mr Moore has disrespected her and fallen below the standards expected of MPs. She said: \"It is one thing to engage in lively debate on party policies in parliament or on TV, but to launch such a personal attack against a neighbouring MP falls well below the standards expected of parliamentarians. \"I am disturbed by Robbie Moore’s seeming willingness to spread misinformation on this scale with his constituents and beyond, particularly when it pertains to such a serious issue.\" She has called on both her own constituents and Mr Moore's to condemn \"these actions in the strongest possible terms\". The video is 'not a personal attack' but highlights 'legitimate concerns' Mr Moore has told Sky News that he \"utterly condemns any threats of violence\" and has previously had armed police come to his house in the middle of the night due to a death threat. He said his video is \"not a personal attack\", but \"raises legitimate concerns\" about her public position on a grooming inquiry in Bradford. He added: \"I have been fighting for an inquiry since being elected in 2019 and have been clear that this is not a political issue.\" The shadow minister continued: \"We are now in a situation in Bradford where victims and survivors and leading child abuse lawyers are desperately calling for a focus on Bradford in the grooming gangs inquiry, with a sitting Labour peer explicitly saying there has been a cover-up inside Bradford Council. \"The fact that the MP for Shipley does not and, from her public comments today, still does not unequivocally support a focus on Bradford in this national inquiry is both a newsworthy and legitimate concern.\""
    },
    {
        "title": "Flesh-eating screwworm parasite detected in person in US for first time",
        "description": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time.",
        "url": "https://news.sky.com/story/flesh-eating-screwworm-parasite-detected-in-person-in-us-for-first-time-13418013",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-screw-worm_7000663.jpg?20250825001602",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-24 22:49:00",
        "Headline": "The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year.",
        "Content": "A case of the flesh-eating screwworm parasite has been detected in a person in the United States for the first time. The parasitic flies eat cattle and other warm-blooded animals alive, with an outbreak beginning in Central America and southern Mexico late last year. It is ultimately fatal if left untreated. The case in the US was identified in a person from Maryland who had travelled from Guatemala. Beth Thompson, South Dakota's state veterinarian, told Reuters on Sunday that she was notified of the case within thelast week. A Maryland state government official also confirmed the case. The person was treated and prevention measures were implemented, Reuters reports. The Centres for Disease Control and Prevention (CDC) and the Maryland Department of Health did not immediately respond to requests for comment.  What is screwworm? The female screwworm fly lays eggs in the wounds of warm-blooded animals and once hatched, hundreds of screwworm larvae use their sharp mouths to burrow through living flesh. It can be devastating in cattle and wildlife, and has also been known to infect humans. Treatment is onerous, and involves removing hundreds of larvae and thoroughly disinfecting wounds. They are largely survivable if treated early enough. The confirmed case is likely to rattle the beef and cattle futures market, which has seen record-high prices because of tight supplies. The US typically imports more than a million cattle from Mexico each year to process into beef. The screwworm outbreak could cost Texas - the biggest cattle-producing state - $1.8bn (£1.3bn) in livestock deaths, labour costs and medicationexpenses. The United States Department of Agriculture (USDA) has set traps and sent mounted officers along the border, but it has faced criticism from some cattle producers and market analysts for not acting faster to pursue increased fly production via a sterile fly facility. What is a sterile fly facility? The case also comes just one week after the US agriculture secretary, Brooke Rollins, travelled to Texas to announce plans to build a sterile fly facility there in a bid to combat the pest. Ms Rollins had pledged repeatedly to keep screwworm out of the country. Read more:Trump seeking to 'manufacture a crisis' in ChicagoMenendez brothers denied parole A sterile fly facility produces a large number of male flies and sterilises them - these males are then released to mate with wild female insects, which collapses the wild population over time. This method eradicated screwworm from the US in the 1960s. Mexico has also taken efforts to limit the spread of the pest, which can kill livestock within weeks if not treated. It had started to build a $51m sterile fly production facility. The USDA has previously said 500 million flies would need to be released weekly to push the fly back to the Darien Gap, the stretch of rainforest between Panama and Colombia."
    },
    {
        "title": "Bands pull out from festival after group 'cut off' over Palestine flag",
        "description": "Several bands have pulled out from the Victorious music festival just hours before their scheduled performances,&#160;following claims by Irish folk group The Mary Wallopers that they were \"cut off\" for displaying a Palestinian flag.",
        "url": "https://news.sky.com/story/bands-pull-out-from-festival-after-group-claims-it-was-cut-off-over-palestine-flag-13417474",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-victoirious-victorious-festiva_6999782.jpg?20250824101547",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-24 13:32:00",
        "Headline": "Several bands have pulled out from the Victorious music festival just hours before their scheduled performances, after Irish folk group The Mary Wallopers had their set cut short. ",
        "Content": "Several bands have pulled out from the Victorious music festival just hours before their scheduled performances, following claims by Irish folk group The Mary Wallopers that they were \"cut off\" for displaying a Palestinian flag. The Last Dinner Party, Cliffords, and The Academic announced on Saturday that they would no longer be performing at the annual music festival in Portsmouth following Friday's incident. The organisers, who said the band's set was cut short for using a \"discriminatory\" chant, have since apologised and promised to make \"a substantial donation to humanitarian relief efforts for the Palestinian people\". Rock band The Last Dinner Party said they are \"outraged\" by the incident and would boycott the festival. \"We are outraged by the decision made to silence The Mary Wallopers yesterday at Victorious. As a band we cannot cosign political censorship and will therefore be boycotting the festival today,\" they said in a statement shared on their Instagram page. \"As Gazans are deliberately plunged into catastrophic famine after two years of escalating violence, it is urgent and obvious that artists use their platform to draw attention to the cause. \"To see an attempt to direct attention away from the genocide in order to maintain an apolitical image is immensely disappointing.\" \n                  Urgent letter to home secretary over violence against women and girls strategy - as it omits child abuse\n                 \n                  Family pay tribute to 'beloved' man who died in 'accident while working on fairground ride'\n                 \n                  More than 80% of shoplifting offences result in no charge - as number of unsolved cases soars\n                 The Last Dinner Party said that throughout the summer, they have used their performances to encourage their audiences to make donations to a medical charity supporting Palestinians and urged their fans \"more than ever to do the same\". The band said they are \"devastated to be put in this position\" and apologised to those who were hoping to see them perform. Following The Mary Wallopers' set, a spokesperson for Victorious said: \"We spoke to the artist before the performance regarding the festival's long-standing policy of not allowing flags of any kind at the event, but that we respect their right to express their views during the show. \"Although a flag was displayed on stage contrary to our policy, and this was raised with the artist's crew, the show was not ended at this point, and it was the artist's decision to stop the song.\" Read more from Sky News:Criminals could be banned from pubs and sports grounds under new plansLegendary boxer to stand trial in Mexico over alleged cartel ties The Mary Wallopers claimed the festival had released a \"misleading statement to the press claiming they cut our sound because of a discriminatory chant, and not the band's call to Free Palestine\". The band said their video \"clearly shows a Victorious crew member coming on stage, interfering with our show, removing the flag from the stage and then the sound being cut following a chant of 'Free Palestine'\". \"The same crew member is later heard in the video saying 'you aren't playing until the flag is removed',\" the band added. Rock band The Academic have also pulled out of the festival, saying they could not \"in good conscience\" perform at \"a festival that silences free speech\", while Irish band Cliffords said they \"refuse to play if we are to be censored for showing our support to the people of Palestine\". After the bands' announcements that they were pulling out of the festival, the organisers released another statement, saying that they did not handle \"the explanation of our policies sensitively or far enough in advance to allow a sensible conclusion to be reached\", and issued an apology."
    }
]