[
    {
        "title": "Cost of living calculator: See how much your bills are going up",
        "description": "Households across the country face higher bills from 1 April. Use our calculator to find out how you'll be affected.",
        "url": "https://news.sky.com/story/cost-of-living-calculator-see-how-much-your-bills-are-going-up-13339515",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ill-calculator-cost-of-living_6872523.png?20250331211936",
        "type": "Home",
        "Author": "Hanna Schnitzer, specialist producer, and Joely Santa Cruz, data journalist",
        "Date Published": "2025-03-31 20:10:00",
        "Headline": "Council tax, gas, water and electricity bills, broadband, mobile phone, TV and transport costs are all rising. The increases are being introduced to coincide with the new financial year and are likely to hit the finances of almost everyone in the country.",
        "Content": "By Hanna Schnitzer, specialist producer, and Joely Santa Cruz, data journalist  Households across the country face higher bills from 1 April. Use our calculator to find out how you'll be affected. Council tax, gas, water and electricity bills, broadband, mobile phone, TV and transport costs are all rising. The increases are being introduced to coincide with the new financial year and are likely to hit the finances of almost everyone in the country. Many of the increases are higher than the rate of inflation and are coming into effect with households already struggling with price rises and cost of living pressures. Salaries will also be increasing, but some will gain more than others depending on their rate of salary increase and the amount of additional tax some will be paying as a result of \"fiscal drag\", where frozen tax bands bring them over higher tax thresholds. Enter your details into our calculator to see how much the changes could cost you. Greg Marsh, household finance expert and chief executive of household money-saving tool Nous.co, said: \"This year's April price rises are a nasty blow to households. \"The combination of water, energy, council tax and more all rising on the same day adds up to serious money. \"Plus we're seeing yet more cynical price hikes from mobile and broadband suppliers. The crackdown on inflation-linked increases hasn't stopped them from charging consumers more. \"With all this going on, it's crucial none of us is overpaying. Unfortunately, nine out of 10 of us are doing just that. \"At Nous.co, we typically save customers hundreds of pounds a year on bills because they let things slip, and just didn't realise they were paying far more than they needed to.\" Figures for average bill increases and salary and tax changes were provided by Nous and analysed by Sky News with additional government data."
    },
    {
        "title": "Disabled, autistic and homeless: Who will care for Chloe?",
        "description": "Chloe Leighton is crammed into the disabled toilet of a busy pub, pleading on the phone with her social worker to find her a place to stay for the night. ",
        "url": "https://news.sky.com/story/disabled-autistic-and-homeless-who-will-care-for-chloe-13339380",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-chloe-leighton_6872374.png?20250331182717",
        "type": "Home",
        "Author": "Nick Martin",
        "Date Published": "2025-03-31 14:56:00",
        "Headline": "Sky News witnesses what happens when those with complex needs and disabilities come face to face with a social care system that struggles to help them. ",
        "Content": "\n          People and politics correspondent\n              @NickMartinSKY\n  Chloe Leighton is crammed into the disabled toilet of a busy pub, pleading on the phone with her social worker to find her a place to stay for the night.  She records the conversation because she doesn't trust anyone anymore. What makes her situation even more perilous is that Chloe is disabled and autistic. Until recently, the 33-year-old's life was happy and stable. Then last November, her father had a stroke and was unable to care for her, leaving her alone. \"Dad would keep me safe from all these people. He was the barrier,\" she says. Due to her vulnerabilities, her local council in Buckinghamshire had a legal duty to find her emergency accommodation and social care support - except she says that hasn't happened. At first, the council, then friends and family paid for hotel accommodation, but the money ran out and now Chloe has nowhere to go.  \"Nobody knows what to do with me,\" she explains. \"I fall through the gaps.\" 'Mould and antisocial behaviour' The law says that any accommodation must be suitable for Chloe's needs, but if she refuses somewhere, the council doesn't have to do anymore to house her - but it can still support her. So when the council offered her a place in a hostel with a bad reputation in a rural location she refused it. Around 160,000 households live in temporary accommodation in the UK - and even though it costs councils £2.3bn per year - the quality of it is often poor. Sky News saw the hostel Chloe was offered. Residents there told us there was mould and antisocial behaviour. They urged anyone offered a place there to turn it down. Chloe struggled to arrange a visit to the hostel and wasn't confident her social care needs would be met there. A few weeks after she refused the hostel, the council wrote to her, explaining that they no longer have an obligation to find her accommodation. The pub she was sheltering in had closed. Her friends and family could no longer pay for hotels. With neither side backing down, Chloe faced her first night on the streets.  That's where I found her, scared and alone in the cold. \"I don't know what to do, I've never been like this before,\" she said. I decided to phone the police. While I was on hold, Chloe received a call from the out-of-hours housing department, who were made aware that we were filming the exchange. Chloe's disability needs not met After weeks of refusing to give her alternative accommodation, she was offered a place at a hotel a short distance away and she accepted. But when she arrived, there was a problem. The room wasn't wheelchair accessible. She couldn't use the toilet in the room or anywhere else in the hotel. Her fears of not being given suitable accommodation were realised. It was 3am. Read more from Sky News:Children facing housing insecurity 'less likely to pass GCSEs''It feels like we don't exist': The human cost of social care cutsHow a vulnerable man was failed by his carer A Buckinghamshire Council spokesperson said: \"We stand by the actions of our staff and as an organisation in regard to the content featured in this piece. We take our duty of care extremely seriously in regard to any resident who presents to us with housing and/or social care need and follow process and procedures rigorously and to the letter. \"We cannot discuss details of any individual case but do recognise the incredibly difficult circumstances any individual or household will be experiencing if they have come to us for help. We keep the person at the heart of all we do, doing what we can to tailor our support offer to their individual needs. \"Some cases can be long and complex, involving various stages that may include an emergency response, other offers of support and ultimately, we aim to provide a long-term solution that meets the needs of the individual or household. At all points in the process, any individual or household has a right to decline any support or options put to them. In such circumstances the council continues to work with the individual or household to seek a solution to meet their needs, within our statutory duties and the resources available to us.\" Last year council adult social care budgets were overspent by nearly £600m, according to the Association of Directors of Adult Social Services.  A government spokesperson told us they had \"inherited a devastating housing crisis and a social care system\" that they are committed to fixing. They pointed to their provision of the \"largest-ever cash boost in homeless prevention services\", adding that they were also \"delivering £26bn for health and social care\" and had appointed Baroness Louise Casey to lead an independent commission \"to build a social care system that is fair and affordable for all\". Our few days with Chloe reveal a complicated story. It's about what happens when someone with complex needs comes face to face with a social care system that is chronically underfunded. Understanding autism requires time, resources, money - something councils don't have. And for Chloe, it's about trying to find some calm amid the chaos, so she can live her life."
    },
    {
        "title": "Motorists who fail drug tests able to drive for up to six months due to backlog in processing results",
        "description": "Motorists who fail roadside drug tests are being allowed to continue to drive for up to six months because of a backlog in testing confirmatory blood samples.",
        "url": "https://news.sky.com/story/motorists-who-fail-drug-tests-able-to-drive-for-up-to-six-months-due-to-backlog-in-processing-results-13339345",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jane-hickson_6872251.jpg?20250331151102",
        "type": "Home",
        "Author": "Greg Milam",
        "Date Published": "2025-03-31 13:54:00",
        "Headline": "Linzi Stewart, whose brother was killed by a motorist who was free to drive while awaiting the result of a positive drug test, is calling for a change in the law to prevent similar deaths.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  Motorists who fail roadside drug tests are being allowed to continue to drive for up to six months because of a backlog in testing confirmatory blood samples. Some of those drivers have gone on to kill behind the wheel while their results are pending. The backlog and delay have been described as \"unacceptable\" by the families of some of those who have died in accidents caused by drug-drivers on bail. Mother-of-two Jane Hickson died at a junction just metres from her home in Chester when her car was hit by a motorist who had gone through a red light. It was later revealed that the driver Paul Wright had been on bail for drug-driving at that time, having been arrested six months earlier after testing positive at the roadside. Police were still waiting for the blood test results at the time of the accident in which Ms Hickson died. \"The fact is that those people are out there, driving under the influence of drugs as we're sat here now. People are at risk, and I don't think that's acceptable,\" her husband John told Sky News. \n                  Every household bill rising in April - and how you can beat the hikes\n                 \n                  Cost of living calculator: See how much your bills are going up\n                 \n                  Disabled, autistic and homeless: Who will care for Chloe?\n                 \"It's hard to move on from something that was such a senseless way for Jane to die. I think it's also completely avoidable. I think, as a society, we have to do something about it. They need to be off the roads as soon as possible.\" Like many, Mr Hickson believes the system for dealing with drug-drivers has not kept pace with the way drink-drivers are caught. They are generally banned within days as the result of confirmatory breath tests at police stations. This comes at a time when many police forces across the UK report they now are regularly arresting more people for drug-driving than drink-driving. Experts point to the system used in France and Australia which tests saliva rather than blood and provides a confirmatory, evidential sample within days. Ean Lewin, the founder of D.tec International, which provides roadside drug tests to police forces across the country, told Sky News: \"Saliva is a perfectly acceptable solution, and it can be processed in the laboratory much quicker. \"If we could have an evidential confirmation within a week, we could maybe get them in court the week after, which is the same timescale as is acceptable at the moment for alcohol.\" In January, the minister for the future of roads, Lilian Greenwood, told the Commons she had heard concerns about the issue first-hand while on patrol with police. Any action now would come too late for the family of Tim Burgess. He was killed in a collision in July which also left his partner with life-changing injuries. The other driver, Joshua Eldred, was two-and-a-half times the cocaine limit and 16 times over the limit for a compound which shows recent cocaine usage. Eldred had been in another crash ten days earlier but had been bailed pending a blood test, meaning he was free to drive. That test later confirmed he'd been taking cocaine. Mr Burgess's sister Linzi Stewart has launched a campaign calling for a change in the law. \"I think people just think they can take drugs and get behind the wheel and get away with it because there isn't an effective system in prosecuting and charging them. There isn't enough deterrent. \"Road deaths have almost become normalised and there's so much complacency in the UK around road deaths.\" The National Police Chiefs' Council declined our request for an interview. Last year it called for new powers to allow officers to instantly disqualify drink or drug-drivers at the side of the road. Read more:Officers should be allowed to ban drug-drivers at roadside - police chiefsDrug-driving warning as footage shows crash On the backlog of blood tests for drug-drivers, it said: \"The NPCC has been aware in the past of difficulties in the processing of drug-drive blood samples, with backlogs and delays up to six months in some cases. \"However, currently the position is much different with the majority of cases now being processed within six months.\" Months-long delays though, families say, are putting lives at risk. \"I don't feel angry with the offender because I feel that, if he had been dealt with ten days previously, he hopefully would have learned his lesson,\" said Ms Stewart. \"His family's life has been destroyed, his life's destroyed, our lives are destroyed. If it had been dealt with at the time, then we wouldn't be where we are now.\""
    },
    {
        "title": "Devastation in Myanmar: how the earthquake has left some areas almost completely destroyed",
        "description": "Even with thousands dead and entire neighbourhoods levelled, the ruling military junta in Myanmar maintains its long-term ban on international journalists entering the country.",
        "url": "https://news.sky.com/story/devastation-in-myanmar-how-the-earthquake-has-left-some-areas-almost-completely-destroyed-13339465",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-myanmar-destruction_6872435.png?20250331190005",
        "type": "Home",
        "Author": "Sky News Data &amp; Forensics Unit",
        "Date Published": "2025-03-31 17:52:00",
        "Headline": "Satellite images and maps expose scale of destruction in Myanmar after the earthquake that killed over 2,000 people and has all but flattened towns like Min Kun in the centre of the country.",
        "Content": "By Sky News Data & Forensics Unit  Even with thousands dead and entire neighbourhoods levelled, the ruling military junta in Myanmar maintains its long-term ban on international journalists entering the country. It cited a lack of guaranteed safety that could be provided to foreign media to report on the aftermath of the catastrophic earthquake that rocked the southeast Asian nation on Friday. That may also be because it is still pursuing its campaign against rebel forces amid the destruction. So open-source information from satellite imagery and social media is a vital tool. The picture is incomplete, but gives some sense of the true scale of damage from the quake. Mandalay, Myanmar's second city and just 20km from the epicentre, was hit especially hard. The largest monastery in the city had boasted a clock tower, now completely flattened. Sky's Data & Forensics Unit has analysed the destruction based on a combination of videos like these and satellite imagery. That is not a comprehensive picture of the destruction. For many areas, we don't yet have satellite imagery available - for example the city of Sagaing. But we have verified videos posted to social media which give some idea of the situation there: buildings toppled, flattened pagodas and even a collapsed bridge. \n                  Myanmar earthquake: Survivors' footage shows what it's like to be trapped in rubble\n                 \n                  Myanmar earthquake: Military regime targeting 'civilian areas' with airstrikes in wake of disaster, armed group claims\n                 \n                  Families of those trapped in rubble of collapsed Bangkok building after earthquake face agonising wait\n                 The country's military rulers issued a rare call for help after the disaster. Their allies - Russia, India and China - were some of the first to heed the call. On Saturday, a Russian plane registered to the Ministry for Emergency Situations (EMERCOM) arrived in Mawlamyine, southern Myanmar, from Moscow. EMERCOM said it had also flown 120 rescuers and supplies to Yangon, in the south of the country. In Mandalay, Russian and Chinese emergency workers have collaborated in efforts to rescue civilians trapped under rubble, according to a post on the official Telegram channel for EMERCOM. China said it sent more than 135 rescue personnel and pledged about $13.8m (£10.7m) in emergency aid. Chinese President Xi Jinping extended his condolences to the military junta leader Min Aung Hlaing. Other countries have pledged money too including the US, the EU and the UK. But many are worried if aid will be distributed fairly. \"Throughout history, the military uses denial of aid access as a counter-insurgency tactic,\" said Morgan Michaels, research fellow at the International Institute for Strategic Studies (IISS). \"So there is warranted concern that in this current crisis, the military could block aid to affected areas.\" Some 265 groups in Myanmar have signed a statement calling for aid to be directed to civil society, the National Unity Government, and ethnic resistance organisations, rather than the junta.  Khin Ohmar, spokesperson for the signatories to the statement, is concerned about aid not reaching areas like Sagaing, which was at the epicentre of the earthquake. She told Sky News: \"International rescue aid is not reaching people that need to be saved, and the junta keep bombing areas, including Sagaing, where people were most severely impacted.\" With an ongoing civil war and poor infrastructure, Myanmar was already one of the most challenging places in the world for aid organisations to operate. Some of the heaviest fighting has concentrated in the areas hit hardest by the earthquake, including Sagaing and Mandalay. Rebel groups in Myanmar that oppose the junta have called for a two-week pause in fighting to help with aid deliveries and rescue efforts, saying they would only take defensive action. But these calls have not stopped the violence. \"There were about 11 or so airstrikes [on Sunday],\" Mr Michaels told Sky News. \"One of these airstrikes happened in Nancho, which is in Shahn State. \"We already know that is the site of a major ongoing battle. So that looks more or less like a continuation of fighting with either side using the tools that they've been using all along.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "UK weather: Temperatures set to be higher than Greece and Spain as spring sunshine continues",
        "description": "Parts of the UK could be hotter than cities in Greece and Spain this week, as the country continues to bathe in spring sunshine.",
        "url": "https://news.sky.com/story/uk-weather-temperatures-set-to-be-higher-than-greece-and-spain-as-spring-sunshine-continues-13339507",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-somerset-weston-super-mare_6872214.jpg?20250331140441",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-31 19:50:00",
        "Headline": "The south of England could reach 21C on Thursday, the Met Office says, four degrees above the expected high in Athens and five degrees higher than Barcelona.",
        "Content": "Parts of the UK could be hotter than cities in Greece and Spain this week, as the country continues to bathe in spring sunshine. Dry, sunny conditions could see temperatures rise as high as 21C (70C) on Thursday in the south of England, while Athens is set to peak at 17C (63F), the Met Office has said. On the same day, South Wales and Somerset could reach 20C (68F) and may be hotter than Barcelona, where 16C (61F) is the expected high. Latest weather forecast where you are Northern Ireland and northwest Scotland had some rain and cloud on Monday morning, but the weather is generally expected to remain dry and sunny across the country throughout the rest of the week and into the weekend. Met Office spokesman Stephen Dixon said many in the UK had \"a fine dry and sunny day\" with temperatures that were \"well above average for the time of year and that theme is set to continue for much of the week. Predicting a \"settled period\" for the UK's weather, he said it will \"possibly get as high as 21C on Thursday\". \n                  UK weather: Spring sunshine set to return on Mother's Day, forecasters say\n                 \n                  Swirling polar vortex linked to deadly cluster of storms in 2022, say UK scientists\n                 \n                  Watch today's partial solar eclipse \n                 Mr Dixon said high pressure is set to be near or over the UK in the coming week and into the weekend, leading to warm and dry conditions. \"Through the middle of the week it will be a touch breezier in the South West, but it will still feel much warmer than average.\" Although temperatures are likely to gradually drop on Saturday, they will still hover around the mid-teens and are likely to be higher than the average maximum temperature of 12C (54F) for the UK in April, forecasters said. April's record high was a summery 29.4C (84F), recorded in Camden Square, London, in 1949, Met Office records show. Many headed for the beach to make the most of this year's unseasonal sunshine. Katy Alston, who has been selling ice cream in Bognor Regis for more than 20 years, said business was booming at the weekend. Ms Alston, 57, said the weather has been \"absolutely wonderful. Everything has been so tough and this weekend it's like we have seen light again\". Read more on Sky News:Le Pen's response to guilty verdictTrapped under Myanmar rubblePrince's accuser 'close to death' She said the mild weather was \"perfect timing\" with Mother's Day on Sunday and added she is \"really excited and feeling really positive (about the forecast)\". The dry spell should last into the weekend and early next week, though there is less certainty when forecasting much further into April, the Met Office said. On Friday, the office said this week might see the highest temperature of the year so far."
    },
    {
        "title": "'Extensive search' under way for 11-year-old girl who fell into River Thames",
        "description": "An \"extensive search\" is under way to find an 11-year-old girl after she fell into the River Thames in east London.",
        "url": "https://news.sky.com/story/extensive-search-under-way-for-11-year-old-girl-who-fell-into-river-thames-13339353",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-google-pics-barge-way_6872372.jpg?20250331173813",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-31 14:08:00",
        "Headline": "All emergency services formed a \"large-scale response\" after the 11-year-old entered the river near Barge House Causeway, close to London City Airport.",
        "Content": "An \"extensive search\" is under way to find an 11-year-old girl after she fell into the River Thames in east London. The Metropolitan Police said it was called at around 1.15pm on Monday to reports the girl had entered the river near Barge House Causeway, close to London City Airport. All emergency services are forming a \"large-scale response\" to the incident. The girl's next of kin have been made aware and are being supported by officers. The London Ambulance Service was also called at a similar time, after receiving a report of a person in the water at Lowestoft Mews, which is close to the airport. \"We sent resources to the scene, including an ambulance crew, an advanced paramedic, an incident response officer and members of our hazardous area response team,\" a spokesperson said. \"Our crews assisted our emergency services partners at the scene but were later stood down.\" London Fire Brigade Deputy Assistant Commissioner Joseph Kenny added that \"firefighters responded to reports of a person in the River Thames near Lowestoft Mews, Newham\". He said crews from East Ham, Barking, Ilford and Bexley fire stations were sent to the scene alongside other emergency services. \"The brigade also deployed its drone team and fire boat as part of its response, with crews carrying out a systematic search of the area,\" he added. \"The brigade was first called about the incident at 1.23pm. Search operations for firefighters were concluded at 3.49pm when responsibility for the incident was left with the police.\" Kerry Benadjaoud, a 62-year-old lifelong resident of the area, said she heard of the incident from her next-door neighbour, who \"was outside doing her garden and there was two little kids running, and they said 'my friend's in the water'\". When she arrived at the scene with a life ring, a man told her he had called the police, \"but he said at the time he could see her hands going down\". Read more: Major incident declared in Birmingham as '17,000 tonnes' of rubbish piles upEx-GCHQ employee pleads guilty to causing risk to national security Ms Benadjaoud then said a boy who was playing with the 11-year-old girl near the Thames \"said 'I tried to hold her hand but it slipped'\". She then added: \"Apparently, she was paddling, so her socks and shoes were off, her coat, then she must have slipped and gone down.\""
    },
    {
        "title": "Marine Le Pen speaks for first time after being barred from French presidential election",
        "description": "French far-right leader Marine&#160;Le&#160;Pen has said that barring her from running for public office for five years is a \"political decision\" aimed at preventing her from running in the next presidential election.",
        "url": "https://news.sky.com/story/french-national-rally-leader-marine-le-pen-found-guilty-in-embezzlement-case-13339142",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marine-le-pen-france_6872456.jpg?20250331192737",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-31 08:57:00",
        "Headline": "A guilty verdict followed a nine-week trial at the end of last year. Monday's ruling described the embezzlement as \"a democratic bypass\" that deceived voters.",
        "Content": " French far-right leader Marine Le Pen has said that barring her from running for public office for five years is a \"political decision\" aimed at preventing her from running in the next presidential election. The National Rally leader, who left court before the verdict was read out, was found guilty in an embezzlement case. She was also given a four-year jail sentence, with two years suspended and two which will be served with an electronic tag. She is not expected to serve any jail time. Le Pen, who also received a €100,000 (£83,635) fine, will make an appeal against her conviction, her lawyer Rodolphe Bosselut later said. The 56-year-old is a three-time presidential contender who has previously said the next election in 2027 would be her final run for top office. The ban, which comes into force immediately, ends those hopes unless she successfully appeals before the campaign. Speaking to French TV channel TF1 in her first reaction to the verdict, Le Pen said millions of French people \"are outraged\". Calling the verdict a violation of the rule of law, she said she would appeal it and asked that court proceedings take place before the 2027 campaign. \"If that's not a political decision, I don't know what is,\" Le Pen said. The ruling marked a \"fateful day for our democracy\", she added, as she vowed to keep pursuing what she called the now \"admittedly narrow\" path to the presidency. \"There are millions of French people who believe in me, millions of French people who trust me,\" she said, adding: \"For 30 years I've been fighting for you, and for 30 years I've been fighting against injustice, so I'm going to continue fighting.\" Read more from Sky News:King returns to official duties after hospital stayStock markets tumble as Trump tariffs loom Le Pen and 24 other National Rally officials were accused of diverting more than €3m (£2.51m) of European Parliament funds to pay France-based staff working for her party between 2004 and 2016. The judge also handed down guilty verdicts to eight other current or former members of Le Pen's party who, like her, previously served as MEPs in the European Parliament. Another 12 people, who served as parliamentary aides for Le Pen and her party, were also handed guilty verdicts. The ruling at a court in Paris described the embezzlement as \"a democratic bypass\" that deceived the parliament and voters. Judge Benedicte de Perthuis ruled: \"It was established that all these people were actually working for the party, that their (EU) lawmaker had not given them any tasks. \"The investigations also showed that these were not administrative errors... but embezzlement within the framework of a system put in place to reduce the party's costs.\" Le Pen left the court before the completion of the verdict and sentencing and did not address the media outside before being driven away in a car. She had denied accusations she was at the head of \"a system\" meant to siphon off EU funds to benefit her party. Hearings revealed how some EU money was used to pay for Le Pen's bodyguard - who was once her father's bodyguard - as well as for her personal assistant. The defendants denied any wrongdoing and claimed the money was used legitimately. The nine-week trial took place at the end of last year. Le Pen has been seen as one of the leading contenders to succeed President Emmanuel Macron at the end of his second and final term. She was the runner-up to Mr Macron in the 2017 and 2022 presidential elections. Reacting to the verdict, National Rally president Jordan Bardella said: \"Today it is not only Marine Le Pen who was unjustly condemned: It was French democracy that was killed.\" Kremlin spokesman Dmitry Peskov said Russia does \"not want to interfere in France's internal affairs\" but added: \"More and more European capitals are going down the path of trampling over democratic norms.\" Le Pen also serves in France's National Assembly - but there is no impact on the role by the court's ineligibility ruling. However, if parliament was dissolved for elections, she would not be able to stand. Europe correspondent Marine Le Pen's political career lies in tatters. After decades of plotting her ascent to the very pinnacle of French politics, she has now been pushed down the mountain, and her fall could be long and painful. Le Pen, who had been the narrow favourite to win the 2027 French presidential election, will now be banned from running as part of a criminal conviction. She, along with politicians and assistants from her RN party, has been found guilty of embezzlement – of taking millions of euros that were supposed to support work in the European Parliament and, instead, funnelling it to the party's work elsewhere. Le Pen will almost certainly appeal, but her ban has already come into effect. She left the court shortly before her punishment was announced, heading towards her party's headquarters for a meeting with its president, Jordan Bardella – the man most likely to take her place. \"Today, it is not just Marine Le Pen who is being condemned unjustifiably,\" said Mr Bardella. \"It is French democracy that is being executed.\" Her downfall will be welcomed by some in France as a sign that politicians are not above the law. Others, though, have already bemoaned the fact that a court has been given the power to disbar one of the nation's most popular political leaders. It hasn't taken long for the court's decision to be politicised. The Kremlin talked about European countries \"trampling democratic norms\". Hungarian prime minister Viktor Orban put out a short statement of support saying \"Je Suis Marine\". Assuming that Le Pen does not win her appeal, the favourite to win the 2027 election may now be Edouard Philippe, the former prime minister. Bardella may benefit from being Le Pen's anointed successor but he is, at 29, extremely youthful - a full decade younger than anyone who has ever won the presidency."
    },
    {
        "title": "Finnish president reveals Trump running out of patience with Putin over Ukraine ceasefire",
        "description": "The president of Finland says Donald Trump is running out of patience with Vladimir Putin and is frustrated with him.",
        "url": "https://news.sky.com/story/finnish-president-reveals-trump-running-out-of-patience-with-putin-over-ukraine-ceasefire-13339288",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-golf-alexander-stubb_6872062.jpg?20250331110427",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-31 12:07:00",
        "Headline": "Finland's president Alexander Stubb speaks to Sky News after spending the day playing golf with his US counterpart Donald Trump.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The president of Finland says Donald Trump is running out of patience with Vladimir Putin and is frustrated with him. The Finnish leader spoke to Sky News after spending the day with the US president and playing golf with him. Alexander Stubb said Donald Trump is \"the only person who can broker a peace, a ceasefire, because he's the only one that Putin is afraid of\" - but is tiring of the Russian leader's tactics. Kremlin responds to Trump's 'p***ed off' comments - Ukraine latest \"There was a combination of impatience and a tad of frustration,\" he said during their match in Florida over the weekend - and it wasn't with his golf swing. \"We were talking a lot about the ceasefire and the frustrations he had that Russia was not committing to it.\" Mr Stubb's comments confirm reports of a change in attitude by Mr Trump over the Russian leader.  He has until recently seemed more than happy to give Putin the benefit of the doubt, applying enormous pressure on Ukrainian President Volodymyr Zelenskyy instead. Putin's refusal to accept a 30-day ceasefire though is changing that, according to the Finnish leader. He said: \"If there was a pendulum of trust and distrust, certainly Russian activity in the past few weeks has proven that we're moving more towards the distrust side of things.\" Mr Stubb is urging the imposition of colossal sanctions on Russia if it does not accept the ceasefire by a deadline that he says should be set for Easter. The US is considering sanctions on Russian oil, he said. \"Oil, oil prices, serious caps on oil.\" Read moreCould Trump seek a third term?Trump 'p***ed off with Putin'Why Trump's golf course won't host Open Republican senator Lindsey Graham, who also played golf with Mr Stubb on Saturday, is proposing what he has called \"bone breaking sanctions\" if it does not comply with ceasefire demands. Sanctions failed to deter Russia from invading Ukraine in the first place or reverse its invasion since. But Mr Stubb insists Russia's economic pain is now reaching a critical point and sanctions could tip it over the brink. He said: \"You never underestimate the capacity of Russians to live through discomfort. I mean that's what the Soviet Union was really about. But at the same time, there has to be a wall at some stage. And I think that wall is approaching.\" If Donald Trump is losing patience with Russia, is he prepared to do anything about it? \"I think we need a colossal amount of sanctions on 20 April if the Russians don't abide by the ceasefire,\" said Mr Stubb. But is Donald Trump's Finnish golfing partner confident he is going to apply that pressure? \"Fairly confident,' he said. \"More confident than hopeful.\" It may take more than that to persuade Putin there is something to really worry about."
    },
    {
        "title": "Cost of living calculator: See how much your bills are going up",
        "description": "Households across the country face higher bills from 1 April. Use our calculator to find out how you'll be affected.",
        "url": "https://news.sky.com/story/cost-of-living-calculator-see-how-much-your-bills-are-going-up-13339515",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ill-calculator-cost-of-living_6872523.png?20250331211936",
        "type": "UK",
        "Author": "Hanna Schnitzer, specialist producer, and Joely Santa Cruz, data journalist",
        "Date Published": "2025-03-31 20:10:00",
        "Headline": "Council tax, gas, water and electricity bills, broadband, mobile phone, TV and transport costs are all rising. The increases are being introduced to coincide with the new financial year and are likely to hit the finances of almost everyone in the country.",
        "Content": "By Hanna Schnitzer, specialist producer, and Joely Santa Cruz, data journalist  Households across the country face higher bills from 1 April. Use our calculator to find out how you'll be affected. Council tax, gas, water and electricity bills, broadband, mobile phone, TV and transport costs are all rising. The increases are being introduced to coincide with the new financial year and are likely to hit the finances of almost everyone in the country. Many of the increases are higher than the rate of inflation and are coming into effect with households already struggling with price rises and cost of living pressures. Salaries will also be increasing, but some will gain more than others depending on their rate of salary increase and the amount of additional tax some will be paying as a result of \"fiscal drag\", where frozen tax bands bring them over higher tax thresholds. Enter your details into our calculator to see how much the changes could cost you. Greg Marsh, household finance expert and chief executive of household money-saving tool Nous.co, said: \"This year's April price rises are a nasty blow to households. \"The combination of water, energy, council tax and more all rising on the same day adds up to serious money. \"Plus we're seeing yet more cynical price hikes from mobile and broadband suppliers. The crackdown on inflation-linked increases hasn't stopped them from charging consumers more. \"With all this going on, it's crucial none of us is overpaying. Unfortunately, nine out of 10 of us are doing just that. \"At Nous.co, we typically save customers hundreds of pounds a year on bills because they let things slip, and just didn't realise they were paying far more than they needed to.\" Figures for average bill increases and salary and tax changes were provided by Nous and analysed by Sky News with additional government data."
    },
    {
        "title": "Disabled, autistic and homeless: Who will care for Chloe?",
        "description": "Chloe Leighton is crammed into the disabled toilet of a busy pub, pleading on the phone with her social worker to find her a place to stay for the night. ",
        "url": "https://news.sky.com/story/disabled-autistic-and-homeless-who-will-care-for-chloe-13339380",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-chloe-leighton_6872374.png?20250331182717",
        "type": "UK",
        "Author": "Nick Martin",
        "Date Published": "2025-03-31 14:56:00",
        "Headline": "Sky News witnesses what happens when those with complex needs and disabilities come face to face with a social care system that struggles to help them. ",
        "Content": "\n          People and politics correspondent\n              @NickMartinSKY\n  Chloe Leighton is crammed into the disabled toilet of a busy pub, pleading on the phone with her social worker to find her a place to stay for the night.  She records the conversation because she doesn't trust anyone anymore. What makes her situation even more perilous is that Chloe is disabled and autistic. Until recently, the 33-year-old's life was happy and stable. Then last November, her father had a stroke and was unable to care for her, leaving her alone. \"Dad would keep me safe from all these people. He was the barrier,\" she says. Due to her vulnerabilities, her local council in Buckinghamshire had a legal duty to find her emergency accommodation and social care support - except she says that hasn't happened. At first, the council, then friends and family paid for hotel accommodation, but the money ran out and now Chloe has nowhere to go.  \"Nobody knows what to do with me,\" she explains. \"I fall through the gaps.\" 'Mould and antisocial behaviour' The law says that any accommodation must be suitable for Chloe's needs, but if she refuses somewhere, the council doesn't have to do anymore to house her - but it can still support her. So when the council offered her a place in a hostel with a bad reputation in a rural location she refused it. Around 160,000 households live in temporary accommodation in the UK - and even though it costs councils £2.3bn per year - the quality of it is often poor. Sky News saw the hostel Chloe was offered. Residents there told us there was mould and antisocial behaviour. They urged anyone offered a place there to turn it down. Chloe struggled to arrange a visit to the hostel and wasn't confident her social care needs would be met there. A few weeks after she refused the hostel, the council wrote to her, explaining that they no longer have an obligation to find her accommodation. The pub she was sheltering in had closed. Her friends and family could no longer pay for hotels. With neither side backing down, Chloe faced her first night on the streets.  That's where I found her, scared and alone in the cold. \"I don't know what to do, I've never been like this before,\" she said. I decided to phone the police. While I was on hold, Chloe received a call from the out-of-hours housing department, who were made aware that we were filming the exchange. Chloe's disability needs not met After weeks of refusing to give her alternative accommodation, she was offered a place at a hotel a short distance away and she accepted. But when she arrived, there was a problem. The room wasn't wheelchair accessible. She couldn't use the toilet in the room or anywhere else in the hotel. Her fears of not being given suitable accommodation were realised. It was 3am. Read more from Sky News:Children facing housing insecurity 'less likely to pass GCSEs''It feels like we don't exist': The human cost of social care cutsHow a vulnerable man was failed by his carer A Buckinghamshire Council spokesperson said: \"We stand by the actions of our staff and as an organisation in regard to the content featured in this piece. We take our duty of care extremely seriously in regard to any resident who presents to us with housing and/or social care need and follow process and procedures rigorously and to the letter. \"We cannot discuss details of any individual case but do recognise the incredibly difficult circumstances any individual or household will be experiencing if they have come to us for help. We keep the person at the heart of all we do, doing what we can to tailor our support offer to their individual needs. \"Some cases can be long and complex, involving various stages that may include an emergency response, other offers of support and ultimately, we aim to provide a long-term solution that meets the needs of the individual or household. At all points in the process, any individual or household has a right to decline any support or options put to them. In such circumstances the council continues to work with the individual or household to seek a solution to meet their needs, within our statutory duties and the resources available to us.\" Last year council adult social care budgets were overspent by nearly £600m, according to the Association of Directors of Adult Social Services.  A government spokesperson told us they had \"inherited a devastating housing crisis and a social care system\" that they are committed to fixing. They pointed to their provision of the \"largest-ever cash boost in homeless prevention services\", adding that they were also \"delivering £26bn for health and social care\" and had appointed Baroness Louise Casey to lead an independent commission \"to build a social care system that is fair and affordable for all\". Our few days with Chloe reveal a complicated story. It's about what happens when someone with complex needs comes face to face with a social care system that is chronically underfunded. Understanding autism requires time, resources, money - something councils don't have. And for Chloe, it's about trying to find some calm amid the chaos, so she can live her life."
    },
    {
        "title": "Motorists who fail drug tests able to drive for up to six months due to backlog in processing results",
        "description": "Motorists who fail roadside drug tests are being allowed to continue to drive for up to six months because of a backlog in testing confirmatory blood samples.",
        "url": "https://news.sky.com/story/motorists-who-fail-drug-tests-able-to-drive-for-up-to-six-months-due-to-backlog-in-processing-results-13339345",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jane-hickson_6872251.jpg?20250331151102",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-03-31 13:54:00",
        "Headline": "Linzi Stewart, whose brother was killed by a motorist who was free to drive while awaiting the result of a positive drug test, is calling for a change in the law to prevent similar deaths.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n  Motorists who fail roadside drug tests are being allowed to continue to drive for up to six months because of a backlog in testing confirmatory blood samples. Some of those drivers have gone on to kill behind the wheel while their results are pending. The backlog and delay have been described as \"unacceptable\" by the families of some of those who have died in accidents caused by drug-drivers on bail. Mother-of-two Jane Hickson died at a junction just metres from her home in Chester when her car was hit by a motorist who had gone through a red light. It was later revealed that the driver Paul Wright had been on bail for drug-driving at that time, having been arrested six months earlier after testing positive at the roadside. Police were still waiting for the blood test results at the time of the accident in which Ms Hickson died. \"The fact is that those people are out there, driving under the influence of drugs as we're sat here now. People are at risk, and I don't think that's acceptable,\" her husband John told Sky News. \n                  Every household bill rising in April - and how you can beat the hikes\n                 \n                  Cost of living calculator: See how much your bills are going up\n                 \n                  Disabled, autistic and homeless: Who will care for Chloe?\n                 \"It's hard to move on from something that was such a senseless way for Jane to die. I think it's also completely avoidable. I think, as a society, we have to do something about it. They need to be off the roads as soon as possible.\" Like many, Mr Hickson believes the system for dealing with drug-drivers has not kept pace with the way drink-drivers are caught. They are generally banned within days as the result of confirmatory breath tests at police stations. This comes at a time when many police forces across the UK report they now are regularly arresting more people for drug-driving than drink-driving. Experts point to the system used in France and Australia which tests saliva rather than blood and provides a confirmatory, evidential sample within days. Ean Lewin, the founder of D.tec International, which provides roadside drug tests to police forces across the country, told Sky News: \"Saliva is a perfectly acceptable solution, and it can be processed in the laboratory much quicker. \"If we could have an evidential confirmation within a week, we could maybe get them in court the week after, which is the same timescale as is acceptable at the moment for alcohol.\" In January, the minister for the future of roads, Lilian Greenwood, told the Commons she had heard concerns about the issue first-hand while on patrol with police. Any action now would come too late for the family of Tim Burgess. He was killed in a collision in July which also left his partner with life-changing injuries. The other driver, Joshua Eldred, was two-and-a-half times the cocaine limit and 16 times over the limit for a compound which shows recent cocaine usage. Eldred had been in another crash ten days earlier but had been bailed pending a blood test, meaning he was free to drive. That test later confirmed he'd been taking cocaine. Mr Burgess's sister Linzi Stewart has launched a campaign calling for a change in the law. \"I think people just think they can take drugs and get behind the wheel and get away with it because there isn't an effective system in prosecuting and charging them. There isn't enough deterrent. \"Road deaths have almost become normalised and there's so much complacency in the UK around road deaths.\" The National Police Chiefs' Council declined our request for an interview. Last year it called for new powers to allow officers to instantly disqualify drink or drug-drivers at the side of the road. Read more:Officers should be allowed to ban drug-drivers at roadside - police chiefsDrug-driving warning as footage shows crash On the backlog of blood tests for drug-drivers, it said: \"The NPCC has been aware in the past of difficulties in the processing of drug-drive blood samples, with backlogs and delays up to six months in some cases. \"However, currently the position is much different with the majority of cases now being processed within six months.\" Months-long delays though, families say, are putting lives at risk. \"I don't feel angry with the offender because I feel that, if he had been dealt with ten days previously, he hopefully would have learned his lesson,\" said Ms Stewart. \"His family's life has been destroyed, his life's destroyed, our lives are destroyed. If it had been dealt with at the time, then we wouldn't be where we are now.\""
    },
    {
        "title": "UK weather: Temperatures set to be higher than Greece and Spain as spring sunshine continues",
        "description": "Parts of the UK could be hotter than cities in Greece and Spain this week, as the country continues to bathe in spring sunshine.",
        "url": "https://news.sky.com/story/uk-weather-temperatures-set-to-be-higher-than-greece-and-spain-as-spring-sunshine-continues-13339507",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-somerset-weston-super-mare_6872214.jpg?20250331140441",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-31 19:50:00",
        "Headline": "The south of England could reach 21C on Thursday, the Met Office says, four degrees above the expected high in Athens and five degrees higher than Barcelona.",
        "Content": "Parts of the UK could be hotter than cities in Greece and Spain this week, as the country continues to bathe in spring sunshine. Dry, sunny conditions could see temperatures rise as high as 21C (70C) on Thursday in the south of England, while Athens is set to peak at 17C (63F), the Met Office has said. On the same day, South Wales and Somerset could reach 20C (68F) and may be hotter than Barcelona, where 16C (61F) is the expected high. Latest weather forecast where you are Northern Ireland and northwest Scotland had some rain and cloud on Monday morning, but the weather is generally expected to remain dry and sunny across the country throughout the rest of the week and into the weekend. Met Office spokesman Stephen Dixon said many in the UK had \"a fine dry and sunny day\" with temperatures that were \"well above average for the time of year and that theme is set to continue for much of the week. Predicting a \"settled period\" for the UK's weather, he said it will \"possibly get as high as 21C on Thursday\". \n                  UK weather: Spring sunshine set to return on Mother's Day, forecasters say\n                 \n                  Swirling polar vortex linked to deadly cluster of storms in 2022, say UK scientists\n                 \n                  Watch today's partial solar eclipse \n                 Mr Dixon said high pressure is set to be near or over the UK in the coming week and into the weekend, leading to warm and dry conditions. \"Through the middle of the week it will be a touch breezier in the South West, but it will still feel much warmer than average.\" Although temperatures are likely to gradually drop on Saturday, they will still hover around the mid-teens and are likely to be higher than the average maximum temperature of 12C (54F) for the UK in April, forecasters said. April's record high was a summery 29.4C (84F), recorded in Camden Square, London, in 1949, Met Office records show. Many headed for the beach to make the most of this year's unseasonal sunshine. Katy Alston, who has been selling ice cream in Bognor Regis for more than 20 years, said business was booming at the weekend. Ms Alston, 57, said the weather has been \"absolutely wonderful. Everything has been so tough and this weekend it's like we have seen light again\". Read more on Sky News:Le Pen's response to guilty verdictTrapped under Myanmar rubblePrince's accuser 'close to death' She said the mild weather was \"perfect timing\" with Mother's Day on Sunday and added she is \"really excited and feeling really positive (about the forecast)\". The dry spell should last into the weekend and early next week, though there is less certainty when forecasting much further into April, the Met Office said. On Friday, the office said this week might see the highest temperature of the year so far."
    },
    {
        "title": "Major incident declared in Birmingham as '17,000 tonnes' of rubbish piles up",
        "description": "A major incident has been declared in Birmingham over an ongoing bin strike, which has left&#160;around 17,000 tonnes of waste on the streets of the city.",
        "url": "https://news.sky.com/story/major-incident-declared-in-birmingham-as-17000-tonnes-of-rubbish-piles-up-13339391",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-birmingham-bins-strikes_6871022.jpg?20250330024507",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-31 15:30:00",
        "Headline": "By declaring a major incident, the council will be able to increase the availability of street cleansing and fly-tip removal with an additional 35 vehicles and crews around the city.",
        "Content": "A major incident has been declared in Birmingham over an ongoing bin strike, which has left around 17,000 tonnes of waste on the streets of the city. Birmingham City Council said the \"regrettable\" step was taken in response to public health concerns, with picket lines blocking depots and preventing waste vehicles from collecting rubbish. Members of Unite have been on all-out strike since 11 March in a row over pay, which the union claims will leave some members of staff £8,000 worse off. A series of walkouts have also impacted refuse collections since January. Politics latest: Follow live updates By declaring a major incident, the council will be able to increase the availability of street cleansing and fly-tip removal with an additional 35 vehicles and crews around the city. This action will also allow the council to explore what further support is available from neighbouring authorities and the government to assist in the management of the situation. Council leader John Cotton said it was a \"regrettable\" step, but the situation was \"causing harm and distress\" to local people. News correspondent ‘We’re worried about our kids,\" says one man in Bordesley Green.  It’s a sentiment shared by many across Birmingham as the council declares a major incident due to concerns over public health. I’m standing on Fifth Avenue in the southeast of the city, which couldn’t be further from its glamorous namesake in New York.\n Piles of black bin liners, full to bursting, cover the pavements, forcing people to walk in the road. The recent warm weather makes the stench pervasive, as food waste openly rots outside homes. 17,000 tonnes of rubbish litters Birmingham, and the city council says declaring a major incident will initially increase the availability of street cleaning and fly-tip removal, with an additional 35 vehicles and crews deployed around the city. Many residents are taking matters into their own hands and driving their rubbish to nearby dumps, but for those without a car, all they can do is hope for some resolution between the council and Unite. \n\n  \"I respect the right to strike and protest, however actions on the picket line must be lawful and sadly the behaviour of some now means we are seeing a significant impact on residents and the city's environment,\" he said. Jim McMahon, the minister for local government, said the all-out strike by Unite members is causing \"misery and disruption\" to residents, as well as posing a \"public health risk to the city's most vulnerable and deprived\". He said the government \"stands ready\" to respond to any request for extra resources, but insisted that any deal to end the bin strike must \"maintain value for money\".  Mr McMahon told the Commons: \"This is causing a public health risk to the city's most vulnerable and deprived residents. As a result, I am aware that Birmingham has today declared a major incident to give them the mechanisms to better manage the impact on local residents. \"I support that decision, and I will back local leaders.\" The minister added that the government will \"not hesitate to give support in any way that Birmingham leaders need\". He said: \"If local leaders on the ground in Birmingham feel that tackling these issues goes beyond the resources available to them and they request national support, then of course we stand ready to respond to any such request.\" Members of the Unite union met with Birmingham City Council last Thursday, but talks have so far failed. Unite says the dispute will not end unless the \"hugely damaging\" cuts to bin collectors' wages are reversed. But Birmingham City Council says the aim of the restructuring is to create a \"modern, sustainable and consistently reliable waste collection service\"."
    },
    {
        "title": "'Extensive search' under way for 11-year-old girl who fell into River Thames",
        "description": "An \"extensive search\" is under way to find an 11-year-old girl after she fell into the River Thames in east London.",
        "url": "https://news.sky.com/story/extensive-search-under-way-for-11-year-old-girl-who-fell-into-river-thames-13339353",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-google-pics-barge-way_6872372.jpg?20250331173813",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-31 14:08:00",
        "Headline": "All emergency services formed a \"large-scale response\" after the 11-year-old entered the river near Barge House Causeway, close to London City Airport.",
        "Content": "An \"extensive search\" is under way to find an 11-year-old girl after she fell into the River Thames in east London. The Metropolitan Police said it was called at around 1.15pm on Monday to reports the girl had entered the river near Barge House Causeway, close to London City Airport. All emergency services are forming a \"large-scale response\" to the incident. The girl's next of kin have been made aware and are being supported by officers. The London Ambulance Service was also called at a similar time, after receiving a report of a person in the water at Lowestoft Mews, which is close to the airport. \"We sent resources to the scene, including an ambulance crew, an advanced paramedic, an incident response officer and members of our hazardous area response team,\" a spokesperson said. \"Our crews assisted our emergency services partners at the scene but were later stood down.\" London Fire Brigade Deputy Assistant Commissioner Joseph Kenny added that \"firefighters responded to reports of a person in the River Thames near Lowestoft Mews, Newham\". He said crews from East Ham, Barking, Ilford and Bexley fire stations were sent to the scene alongside other emergency services. \"The brigade also deployed its drone team and fire boat as part of its response, with crews carrying out a systematic search of the area,\" he added. \"The brigade was first called about the incident at 1.23pm. Search operations for firefighters were concluded at 3.49pm when responsibility for the incident was left with the police.\" Kerry Benadjaoud, a 62-year-old lifelong resident of the area, said she heard of the incident from her next-door neighbour, who \"was outside doing her garden and there was two little kids running, and they said 'my friend's in the water'\". When she arrived at the scene with a life ring, a man told her he had called the police, \"but he said at the time he could see her hands going down\". Read more: Major incident declared in Birmingham as '17,000 tonnes' of rubbish piles upEx-GCHQ employee pleads guilty to causing risk to national security Ms Benadjaoud then said a boy who was playing with the 11-year-old girl near the Thames \"said 'I tried to hold her hand but it slipped'\". She then added: \"Apparently, she was paddling, so her socks and shoes were off, her coat, then she must have slipped and gone down.\""
    },
    {
        "title": "Sentencing guidelines for ethnic minority suspects delayed after backlash",
        "description": "Controversial sentencing guidelines that were due to come into force on Tuesday have been delayed after a political backlash.",
        "url": "https://news.sky.com/story/sentencing-guidelines-for-ethnic-minority-suspects-delayed-after-backlash-13339357",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-shabana-mahmood-prisons_6869116.jpg?20250328003159",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-31 14:21:00",
        "Headline": "The Sentencing Council was due to bring in new rules around how judges should determine punishment for people from ethnic minority backgrounds from Tuesday.",
        "Content": "Controversial sentencing guidelines that were due to come into force on Tuesday have been delayed after a political backlash. The Sentencing Council, the independent body that sets out sentencing guidance to courts in England and Wales, was due to bring in new rules around how judges should determine punishment for people from ethnic minority backgrounds. The new guidance states that a pre-sentence report - the results of which are taken into account when considering a criminal's sentence - will \"usually be necessary\" before handing out punishment for someone from an ethnic, cultural or faith minority, alongside other groups such as young adults aged 18 to 25, women and pregnant women. Politics latest: Follow live updates  Shabana Mahmood, the justice secretary, had said the proposed guidance was \"unacceptable\" and amounted to \"differential treatment before the law\" as she urged the council to reverse it. When the Sentencing Council initially refused her request, Ms Mahmood threatened to legislate to overturn the guidance if necessary. \n                  What action has the justice secretary taken against the Sentencing Council?\n                 \n                  'Two-tier' justice row: Sentencing Council rejects minister's call for guidance rethink\n                 \n                  Government won't rule out shortening sentences of violent offenders to free up prison space as it opens new jail\n                  She confirmed on Monday evening that she would introduce legislation on Tuesday to block these guidelines coming into effect. The Sentencing Council has now delayed the \"in force date of the guideline pending such legislation taking effect\". It said in a statement that the council \"remains of the view that its guideline, imposition of community and custodial sentences, as drafted is necessary and appropriate\". However, in a meeting between the chairman Lord Justice Davis and Ms Mahmood on Monday, the minister \"indicated her intention to introduce legislation imminently that would have the effect of rendering the section on 'cohorts' in the guideline unlawful\". The council said it is unable to introduce a guideline when there is a draft bill due for introduction that would make it unlawful. Ms Mahmood said she was \"grateful\" to the Sentencing Council for delaying the implementation of its new guidelines. The minister said in a statement: \"These guidelines create a justice system where outcomes could be influenced by race, culture or religion. \"This differential treatment is unacceptable - equality before the law is the backbone of public confidence in our justice system.\" The Sentencing Council also attracted criticism from shadow justice secretary Robert Jenrick, who said its updated guidance was an example of \"two-tier justice\" that would lead to \"blatant bias\" against Christians and straight white men. He also argued that it would make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\" - something the council denied. The council previously rejected calls from the government to abandon the guidelines, which ask judges to consider offenders' racial, cultural and religious background when deciding a sentence. Lord Davis denied that pre-sentence reports reduced the prospect of a jail sentence. However, he said the council would provide \"some clarification of the language\" to avoid confusion."
    },
    {
        "title": "Virginia Giuffre, who accused Prince Andrew of sexual assault, says she has days to live after car crash",
        "description": "A woman who accused Prince Andrew of sexual assault says she has four days to live after a car accident.",
        "url": "https://news.sky.com/story/virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-says-she-has-four-days-to-live-after-car-crash-13339369",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-31 14:40:00",
        "Headline": "Virginia Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences.",
        "Content": "A woman who accused Prince Andrew of sexual assault says she has four days to live after a car accident. In a post on Instagram, Virginia Guiffre said she was in a car that was hit by a school bus \"driving 110km [68.3mph] as we were slowing for a turn\". Ms Giuffre then said: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time, but you know what they say about wishes. S**t in one hand and wish in the other & I guarantee it's still going to be s**t at the end of the day.\" A spokesperson for Ms Giuffre told Sky's US partner network in a statement: \"Virginia has been in a serious accident and is receiving medical care in the hospital. \"She greatly appreciates the support and well wishes people are sending.\" She sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. \n                  Buckingham Palace was involved in meeting about Prince Andrew's private funding, Sky News learns\n                 \n                  Prince Andrew's former senior adviser made 'bad decision' when he provided legal statement in alleged Chinese spy case, tribunal hears\n                 \n                  'We'll play some more soon': Emails believed to be from Prince Andrew to Epstein after he claimed to cut contact revealed\n                 The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\"."
    },
    {
        "title": "Devastation in Myanmar: how the earthquake has left some areas almost completely destroyed",
        "description": "Even with thousands dead and entire neighbourhoods levelled, the ruling military junta in Myanmar maintains its long-term ban on international journalists entering the country.",
        "url": "https://news.sky.com/story/devastation-in-myanmar-how-the-earthquake-has-left-some-areas-almost-completely-destroyed-13339465",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-myanmar-destruction_6872435.png?20250331190005",
        "type": "World",
        "Author": "Sky News Data &amp; Forensics Unit",
        "Date Published": "2025-03-31 17:52:00",
        "Headline": "Satellite images and maps expose scale of destruction in Myanmar after the earthquake that killed over 2,000 people and has all but flattened towns like Min Kun in the centre of the country.",
        "Content": "By Sky News Data & Forensics Unit  Even with thousands dead and entire neighbourhoods levelled, the ruling military junta in Myanmar maintains its long-term ban on international journalists entering the country. It cited a lack of guaranteed safety that could be provided to foreign media to report on the aftermath of the catastrophic earthquake that rocked the southeast Asian nation on Friday. That may also be because it is still pursuing its campaign against rebel forces amid the destruction. So open-source information from satellite imagery and social media is a vital tool. The picture is incomplete, but gives some sense of the true scale of damage from the quake. Mandalay, Myanmar's second city and just 20km from the epicentre, was hit especially hard. The largest monastery in the city had boasted a clock tower, now completely flattened. Sky's Data & Forensics Unit has analysed the destruction based on a combination of videos like these and satellite imagery. That is not a comprehensive picture of the destruction. For many areas, we don't yet have satellite imagery available - for example the city of Sagaing. But we have verified videos posted to social media which give some idea of the situation there: buildings toppled, flattened pagodas and even a collapsed bridge. \n                  Myanmar earthquake: Survivors' footage shows what it's like to be trapped in rubble\n                 \n                  Myanmar earthquake: Military regime targeting 'civilian areas' with airstrikes in wake of disaster, armed group claims\n                 \n                  Families of those trapped in rubble of collapsed Bangkok building after earthquake face agonising wait\n                 The country's military rulers issued a rare call for help after the disaster. Their allies - Russia, India and China - were some of the first to heed the call. On Saturday, a Russian plane registered to the Ministry for Emergency Situations (EMERCOM) arrived in Mawlamyine, southern Myanmar, from Moscow. EMERCOM said it had also flown 120 rescuers and supplies to Yangon, in the south of the country. In Mandalay, Russian and Chinese emergency workers have collaborated in efforts to rescue civilians trapped under rubble, according to a post on the official Telegram channel for EMERCOM. China said it sent more than 135 rescue personnel and pledged about $13.8m (£10.7m) in emergency aid. Chinese President Xi Jinping extended his condolences to the military junta leader Min Aung Hlaing. Other countries have pledged money too including the US, the EU and the UK. But many are worried if aid will be distributed fairly. \"Throughout history, the military uses denial of aid access as a counter-insurgency tactic,\" said Morgan Michaels, research fellow at the International Institute for Strategic Studies (IISS). \"So there is warranted concern that in this current crisis, the military could block aid to affected areas.\" Some 265 groups in Myanmar have signed a statement calling for aid to be directed to civil society, the National Unity Government, and ethnic resistance organisations, rather than the junta.  Khin Ohmar, spokesperson for the signatories to the statement, is concerned about aid not reaching areas like Sagaing, which was at the epicentre of the earthquake. She told Sky News: \"International rescue aid is not reaching people that need to be saved, and the junta keep bombing areas, including Sagaing, where people were most severely impacted.\" With an ongoing civil war and poor infrastructure, Myanmar was already one of the most challenging places in the world for aid organisations to operate. Some of the heaviest fighting has concentrated in the areas hit hardest by the earthquake, including Sagaing and Mandalay. Rebel groups in Myanmar that oppose the junta have called for a two-week pause in fighting to help with aid deliveries and rescue efforts, saying they would only take defensive action. But these calls have not stopped the violence. \"There were about 11 or so airstrikes [on Sunday],\" Mr Michaels told Sky News. \"One of these airstrikes happened in Nancho, which is in Shahn State. \"We already know that is the site of a major ongoing battle. So that looks more or less like a continuation of fighting with either side using the tools that they've been using all along.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open-source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Marine Le Pen speaks for first time after being barred from French presidential election",
        "description": "French far-right leader Marine&#160;Le&#160;Pen has said that barring her from running for public office for five years is a \"political decision\" aimed at preventing her from running in the next presidential election.",
        "url": "https://news.sky.com/story/french-national-rally-leader-marine-le-pen-found-guilty-in-embezzlement-case-13339142",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marine-le-pen-france_6872456.jpg?20250331192737",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-31 08:57:00",
        "Headline": "A guilty verdict followed a nine-week trial at the end of last year. Monday's ruling described the embezzlement as \"a democratic bypass\" that deceived voters.",
        "Content": " French far-right leader Marine Le Pen has said that barring her from running for public office for five years is a \"political decision\" aimed at preventing her from running in the next presidential election. The National Rally leader, who left court before the verdict was read out, was found guilty in an embezzlement case. She was also given a four-year jail sentence, with two years suspended and two which will be served with an electronic tag. She is not expected to serve any jail time. Le Pen, who also received a €100,000 (£83,635) fine, will make an appeal against her conviction, her lawyer Rodolphe Bosselut later said. The 56-year-old is a three-time presidential contender who has previously said the next election in 2027 would be her final run for top office. The ban, which comes into force immediately, ends those hopes unless she successfully appeals before the campaign. Speaking to French TV channel TF1 in her first reaction to the verdict, Le Pen said millions of French people \"are outraged\". Calling the verdict a violation of the rule of law, she said she would appeal it and asked that court proceedings take place before the 2027 campaign. \"If that's not a political decision, I don't know what is,\" Le Pen said. The ruling marked a \"fateful day for our democracy\", she added, as she vowed to keep pursuing what she called the now \"admittedly narrow\" path to the presidency. \"There are millions of French people who believe in me, millions of French people who trust me,\" she said, adding: \"For 30 years I've been fighting for you, and for 30 years I've been fighting against injustice, so I'm going to continue fighting.\" Read more from Sky News:King returns to official duties after hospital stayStock markets tumble as Trump tariffs loom Le Pen and 24 other National Rally officials were accused of diverting more than €3m (£2.51m) of European Parliament funds to pay France-based staff working for her party between 2004 and 2016. The judge also handed down guilty verdicts to eight other current or former members of Le Pen's party who, like her, previously served as MEPs in the European Parliament. Another 12 people, who served as parliamentary aides for Le Pen and her party, were also handed guilty verdicts. The ruling at a court in Paris described the embezzlement as \"a democratic bypass\" that deceived the parliament and voters. Judge Benedicte de Perthuis ruled: \"It was established that all these people were actually working for the party, that their (EU) lawmaker had not given them any tasks. \"The investigations also showed that these were not administrative errors... but embezzlement within the framework of a system put in place to reduce the party's costs.\" Le Pen left the court before the completion of the verdict and sentencing and did not address the media outside before being driven away in a car. She had denied accusations she was at the head of \"a system\" meant to siphon off EU funds to benefit her party. Hearings revealed how some EU money was used to pay for Le Pen's bodyguard - who was once her father's bodyguard - as well as for her personal assistant. The defendants denied any wrongdoing and claimed the money was used legitimately. The nine-week trial took place at the end of last year. Le Pen has been seen as one of the leading contenders to succeed President Emmanuel Macron at the end of his second and final term. She was the runner-up to Mr Macron in the 2017 and 2022 presidential elections. Reacting to the verdict, National Rally president Jordan Bardella said: \"Today it is not only Marine Le Pen who was unjustly condemned: It was French democracy that was killed.\" Kremlin spokesman Dmitry Peskov said Russia does \"not want to interfere in France's internal affairs\" but added: \"More and more European capitals are going down the path of trampling over democratic norms.\" Le Pen also serves in France's National Assembly - but there is no impact on the role by the court's ineligibility ruling. However, if parliament was dissolved for elections, she would not be able to stand. Europe correspondent Marine Le Pen's political career lies in tatters. After decades of plotting her ascent to the very pinnacle of French politics, she has now been pushed down the mountain, and her fall could be long and painful. Le Pen, who had been the narrow favourite to win the 2027 French presidential election, will now be banned from running as part of a criminal conviction. She, along with politicians and assistants from her RN party, has been found guilty of embezzlement – of taking millions of euros that were supposed to support work in the European Parliament and, instead, funnelling it to the party's work elsewhere. Le Pen will almost certainly appeal, but her ban has already come into effect. She left the court shortly before her punishment was announced, heading towards her party's headquarters for a meeting with its president, Jordan Bardella – the man most likely to take her place. \"Today, it is not just Marine Le Pen who is being condemned unjustifiably,\" said Mr Bardella. \"It is French democracy that is being executed.\" Her downfall will be welcomed by some in France as a sign that politicians are not above the law. Others, though, have already bemoaned the fact that a court has been given the power to disbar one of the nation's most popular political leaders. It hasn't taken long for the court's decision to be politicised. The Kremlin talked about European countries \"trampling democratic norms\". Hungarian prime minister Viktor Orban put out a short statement of support saying \"Je Suis Marine\". Assuming that Le Pen does not win her appeal, the favourite to win the 2027 election may now be Edouard Philippe, the former prime minister. Bardella may benefit from being Le Pen's anointed successor but he is, at 29, extremely youthful - a full decade younger than anyone who has ever won the presidency."
    },
    {
        "title": "Marine Le Pen's political career is in tatters after being found guilty of embezzlement",
        "description": "Marine Le Pen's political career lies in tatters.",
        "url": "https://news.sky.com/story/marine-le-pens-political-career-is-in-tatters-after-being-found-guilty-of-embezzlement-13339329",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marine-le-pen-courtroom_6872277.jpg?20250331155201",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-03-31 13:22:00",
        "Headline": "The far-right leader, who had been the narrow favourite to win the 2027 French presidential election, will now be banned from running as part of a criminal conviction.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Marine Le Pen's political career lies in tatters. After decades of plotting her ascent to the very pinnacle of French politics, she has now been pushed down the mountain, and her fall could be long and painful. The far-right leader, who had been the narrow favourite to win the 2027 French presidential election, will now be banned from running for public office for five years as part of a criminal conviction. Marine Le Pen latest: 'Catastrophic end of political career' Le Pen, along with politicians and assistants from her National Rally (RN) party, has been found guilty of embezzlement - of taking millions of euros that were supposed to support work in the European Parliament and instead funnelling it to the party's work elsewhere. She will almost certainly appeal, but her ban has already come into effect. Le Pen left the court in Paris shortly before her punishment was announced, heading towards her party's headquarters for a meeting with its president, Jordan Bardella - the man most likely to take her place. \n                  Marine Le Pen speaks for first time after being barred from French presidential election\n                 \n                  EU citizens told to stock up on supplies in case of a crisis\n                 \n                  Russia 'reinterpreting' agreements in Black Sea ceasefire talks, Emmanuel Macron says\n                 \"Today, it is not just Marine Le Pen who is being condemned unjustifiably,\" said Bardella. \"It is French democracy that is being executed.\" Read more:Who is 29-year-old far-right leader Jordan Bardella?What it's like to be trapped in rubble after Myanmar quake Her downfall will be welcomed by some in France as a sign that politicians are not above the law. Others, though, have already bemoaned the fact that a court has been given the power to disbar one of the nation's most popular political leaders. It hasn't taken long for the court's decision to be politicised. The Kremlin talked about European countries \"trampling democratic norms\". Hungarian Prime Minister Viktor Orban put out a short statement of support saying \"Je Suis Marine\". Assuming that Le Pen does not win her appeal, the favourite to win the 2027 election may now be Edouard Philippe, the former prime minister. Bardella may benefit from being Le Pen's anointed successor, but at 29, he is extremely youthful - a full decade younger than anyone who has ever won the presidency."
    },
    {
        "title": "Finnish president reveals Trump running out of patience with Putin over Ukraine ceasefire",
        "description": "The president of Finland says Donald Trump is running out of patience with Vladimir Putin and is frustrated with him.",
        "url": "https://news.sky.com/story/finnish-president-reveals-trump-running-out-of-patience-with-putin-over-ukraine-ceasefire-13339288",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-golf-alexander-stubb_6872062.jpg?20250331110427",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-31 12:07:00",
        "Headline": "Finland's president Alexander Stubb speaks to Sky News after spending the day playing golf with his US counterpart Donald Trump.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The president of Finland says Donald Trump is running out of patience with Vladimir Putin and is frustrated with him. The Finnish leader spoke to Sky News after spending the day with the US president and playing golf with him. Alexander Stubb said Donald Trump is \"the only person who can broker a peace, a ceasefire, because he's the only one that Putin is afraid of\" - but is tiring of the Russian leader's tactics. Kremlin responds to Trump's 'p***ed off' comments - Ukraine latest \"There was a combination of impatience and a tad of frustration,\" he said during their match in Florida over the weekend - and it wasn't with his golf swing. \"We were talking a lot about the ceasefire and the frustrations he had that Russia was not committing to it.\" Mr Stubb's comments confirm reports of a change in attitude by Mr Trump over the Russian leader.  He has until recently seemed more than happy to give Putin the benefit of the doubt, applying enormous pressure on Ukrainian President Volodymyr Zelenskyy instead. Putin's refusal to accept a 30-day ceasefire though is changing that, according to the Finnish leader. He said: \"If there was a pendulum of trust and distrust, certainly Russian activity in the past few weeks has proven that we're moving more towards the distrust side of things.\" Mr Stubb is urging the imposition of colossal sanctions on Russia if it does not accept the ceasefire by a deadline that he says should be set for Easter. The US is considering sanctions on Russian oil, he said. \"Oil, oil prices, serious caps on oil.\" Read moreCould Trump seek a third term?Trump 'p***ed off with Putin'Why Trump's golf course won't host Open Republican senator Lindsey Graham, who also played golf with Mr Stubb on Saturday, is proposing what he has called \"bone breaking sanctions\" if it does not comply with ceasefire demands. Sanctions failed to deter Russia from invading Ukraine in the first place or reverse its invasion since. But Mr Stubb insists Russia's economic pain is now reaching a critical point and sanctions could tip it over the brink. He said: \"You never underestimate the capacity of Russians to live through discomfort. I mean that's what the Soviet Union was really about. But at the same time, there has to be a wall at some stage. And I think that wall is approaching.\" If Donald Trump is losing patience with Russia, is he prepared to do anything about it? \"I think we need a colossal amount of sanctions on 20 April if the Russians don't abide by the ceasefire,\" said Mr Stubb. But is Donald Trump's Finnish golfing partner confident he is going to apply that pressure? \"Fairly confident,' he said. \"More confident than hopeful.\" It may take more than that to persuade Putin there is something to really worry about."
    },
    {
        "title": "Gaza aid workers 'targeted' by Israel, Palestinian Red Crescent says, as bodies recovered from 'mass grave'",
        "description": "Israel has been accused of targeting aid workers in Gaza after the remains of 15 people, including eight medics working for the Palestine Red Crescent Society (PRCS), were recovered following what the aid organisation called a \"war crime\".",
        "url": "https://news.sky.com/story/gaza-aid-workers-targeted-by-israel-palestinian-red-crescent-says-as-bodies-recovered-from-mass-grave-13339461",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-palestinians-red-crescent_6872437.jpg?20250331190055",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-31 17:49:00",
        "Headline": "The workers were attacked \"by the Israeli occupation forces\" while carrying out humanitarian work, the agency says, but, according to the IDF, their troops killed several militants in an active combat zone.",
        "Content": " Israel has been accused of targeting aid workers in Gaza after the remains of 15 people, including eight medics working for the Palestine Red Crescent Society (PRCS), were recovered following what the aid organisation called a \"war crime\". The PRCS said in a statement on Sunday the group, who came under fire more than a week ago, were attacked \"by the Israeli occupation forces while performing their humanitarian duties\". It said it also recovered the bodies of six civil defence members and one UN employee from the same area, while a ninth medic \"remains missing\".  It named the medics, calling them \"martyred\", and said the \"massacre\" was a tragedy \"for humanitarian work and humanity\". The \"targeting\" of aid workers \"despite their protected status and the Red Crescent emblem can only be considered a war crime\", the statement said. The Israeli military said on Monday that an inquiry had found that troops had opened fire on vehicles including ambulances and fire trucks that approached a position without prior coordination and without headlights or emergency signals. Several members of the militant groups Hamas and Palestinian Islamic Jihad were killed, it said. In a statement, the IDF said it condemned \"the repeated use of civilian infrastructure by the terrorist organisations in the Gaza Strip, including the use of medical facilities and ambulances for terrorist purposes\". Israel's military did not comment directly on the deaths of the Red Crescent workers but later told Reuters it had allowed the bodies to be recovered from the area, which it described as an active combat zone. The bodies were found in sand in the south of the Gaza Strip in what Jonathan Whittall, Gaza head of the UN Office for the Coordination of Humanitarian Affairs, called a \"mass grave\", marked with the emergency light from a crushed ambulance. Mr Whittall posted pictures and video of Red Crescent teams digging in the sand for the bodies and workers laying them out on the ground, covered in plastic sheets. Philippe Lazzarini, head of the UN agency for Palestinian Refugees (UNRWA), said on X on Monday that the bodies had been \"discarded in shallow graves\" in what he called \"a profound violation of human dignity\". In a statement late on Sunday, the International Committee of the Red Cross said it was \"appalled\" at the deaths of volunteers \"risking their own lives to provide support to others. It did not allocate blame for the attacks. The group went missing on 23 March, after Israel resumed an all-out offensive against Hamas earlier this month. Read more on Sky News:Le Pen's response to guilty verdictTrapped under Myanmar rubblePrince's accuser 'close to death' More than 400 aid workers have been killed in Gaza since the start of the Israel-Hamas war, Mr Lazzarini said. According to the UN, at least 1,060 healthcare workers have been killed in the 18 months since Israel launched its offensive in Gaza after Hamas fighters stormed southern Israel on 7 October 2023. The UN is reducing its international staff in Gaza by a third because of safety concerns. Palestinian health authorities say more than 50,000 people have been killed since Israel launched its campaign in Gaza in response to the 7 October assault, when Hamas militants crossed the border into southern Israel, killing more than 1,200 people, and taking some 250 hostage."
    },
    {
        "title": "Myanmar earthquake: Survivors' footage shows what it's like to be trapped in rubble",
        "description": "Video from the Myanmar earthquake has revealed the terrifying ordeal of being trapped in the rubble of a collapsed building.",
        "url": "https://news.sky.com/story/myanmar-earthquake-survivors-footage-shows-what-its-like-to-be-trapped-in-rubble-13339199",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mandalay-apartment_6872088.jpg?20250331113040",
        "type": "World",
        "Author": "Dan Cairns, news reporter",
        "Date Published": "2025-03-31 09:20:00",
        "Headline": "The three family members waited for hours to be rescued after their apartment block in Mandalay collapsed as they ran for the exit.",
        "Content": "By Dan Cairns, news reporter   Video from the Myanmar earthquake has revealed the terrifying ordeal of being trapped in the rubble of a collapsed building. The footage shows two girls, aged 13 and 16, and their bloodied grandmother in a debris-filled space after Friday's powerful 7.7-magnitude quake. They became trapped as they fled their sixth-floor apartment in the country's second biggest city of Mandalay - near the epicentre of the earthquake - and ran for the emergency stairs. The girls' father initially believed his daughters and mother had died and appealed for help on social media to retrieve their bodies. But they were alive - and had grabbed their phones in the moments before the building collapsed. Writing on Facebook, he said: \"My daughters recorded videos on their phones, thinking that if they and grandma died, their phones might be found, and their father and mother, would see them. \"They even unlocked their phones.\" He said his family could hear others trapped underneath them in the wreckage of the Sky Villa apartment block. \"They called out to each other from above and below, but there was no sound from the outside. As hours passed, they became disheartened and held hands with grandma, crying,\" he said. Rescuers eventually found them and used a hammer to make a small hole to pass them water, but they had to leave to get more equipment. Left alone for some time, the girls took matters into their own hands and used the hammer to make a gap for them to escape. \"They wanted to make a bigger opening for grandma, but the large stones were too heavy, and both sisters couldn't move them,\" said the man's post. Read more:Military regime 'targeting civilian areas with airstrikes'Families of those trapped face agonising wait  'Gasping for breath' Rescuers returned and managed to pull the girls out. Their 75-year-old grandmother was \"gasping for breath\" and could not fit through - but was also later rescued. \"I am deeply grateful to my mother and my two daughters for enduring this ordeal with such strong spirits,\" the man wrote. \"These are the words my daughters shared with me after their trauma had subsided. \"At a time when all hope was lost, I bow my head in reverence and gratitude to the Lord Buddha for allowing our family to survive together.\"  More than 2,000 people are now said to have died in Myanmar following the quake, according to state media on Monday. Eighteen were also killed in Thailand but dozens more remain unaccounted for. Hopes of people surviving in rubble diminish after 72 hours. The UN is rushing aid supplies to survivors in Myanmar but the rescue effort is complicated by the fact that many roads, bridges, rail lines and airports have been damaged. The country is also in the middle of an ongoing civil war that has taken a heavy toll on the health system and displaced more than three million people."
    },
    {
        "title": "British explorer Camilla Hempleman-Adams becomes first woman to complete solo traverse of Baffin Island",
        "description": "A British explorer has become the first woman to complete a solo traverse of Canada's Baffin Island.",
        "url": "https://news.sky.com/story/british-explorer-camilla-hempleman-adams-becomes-first-woman-to-complete-solo-traverse-of-baffin-island-13339107",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-camilla-hempleman-adams_6871855.jpg?20250331082438",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-31 06:32:00",
        "Headline": "The two-week challenge took place in biting sub-zero temperatures - but the 32-year-old managed to finish a day early.",
        "Content": "A British explorer has become the first woman to complete a solo traverse of Canada's Baffin Island. Camilla Hempleman-Adams, 32, pulled a sledge 150 miles in temperatures as low as -40C and winds as high as 47mph. She finished the trek from Qikiqtarjuaq to Pangnirtung in 13 days - a day ahead of schedule. The largely uninhabited Arctic island is the fifth largest in the world and is in far northwest Canada - between the mainland and Greenland. Speaking from the Inuit hamlet of Pangnirtung, Ms Hempleman-Adams said: \"I'm feeling pretty exhausted, I have very sore feet, but it's nice to be back in civilisation, just slowly settling back in. \"It's been a really tough two weeks, but an incredible two weeks.\" \"When you go in by yourself, you just have a mindset to keep going,\" she said. \"You adapt, you have the mindset that you can't give up. There is no giving up in those conditions.\" She admitted she had been looking forward to a hot shower. Her father, adventurer Sir David Hempleman-Adams, flew out to meet her at the finish line. He said he'd been \"really, really worried\" due to the strong winds - which increase the chance of frostbite. Read more from Sky News:First orbital rocket from Europe crashes in seaClocks go forward - but should it be scrapped? \"Being solo, you've got to be really on top of your game the whole time. If you just lose concentration for five minutes, it's a real problem,\" he said. Sir David added: \"It's a fantastic advertisement for females. I mean, we are big, ugly and strong, but she's half my weight and did it twice as fast as I did.\" Ms Hempleman-Adams also became the youngest British female to ski to the North Pole when she was just 15."
    },
    {
        "title": "JD Vance 'power move' marks him out as favourite to be presidential candidate",
        "description": "US vice president JD Vance has made a \"power move\" that marks him out as favourite to be the Republican's next presidential candidate, according to a former party chair.",
        "url": "https://news.sky.com/story/jd-vance-power-move-marks-him-out-as-favourite-to-be-presidential-candidate-13339063",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-usha-vance_6871911.jpg?20250331092605",
        "type": "World",
        "Author": "James Matthews",
        "Date Published": "2025-03-31 00:22:00",
        "Headline": "Former Republican chair Ronna McDaniel told Sky's Trump 100 podcast that her \"money would be on\" Vance becoming the party's next nominee.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  US vice president JD Vance has made a \"power move\" that marks him out as favourite to be the Republican's next presidential candidate, according to a former party chair. Ronna McDaniel told the Sky News Trump 100 podcast her \"money would be on\" Vance becoming the next nominee following his appointment as finance chair of the Republican National Committee (RNC). McDaniel, who was RNC chair for seven years until 2024, described it as a \"power move from a political standpoint and somebody who understands how the rules are made\". It's the first time a sitting vice president has served as finance chair. According to McDaniel, it reflects a political awareness and ambition. \"Understanding that process, which is boring and very technical - and most people don't understand how the RNC works - that was a huge move this week for JD to take over as finance chair,\" she told Trump 100. \"This has never happened in the history of the party, where the vice president said 'I'm gonna be the finance lead for the national party'. So what does that mean? It means he's gonna interact with all the major investors heading into 2028. He's gonna know them intimately. \"But more importantly, in the next two years, the Republican National Committee will be passing the rules that will govern the primary process for 2028. What states will be first? What primaries will be the first? \"That whole process will be passed in the two years by different state parties across the country. \"JD will have access to every single RNC member and Republican National Committee state chair who will be making those governing rules. That shows you, the power that he has right now.\" Read more: Could Trump run for a third term? Donald Trump has, previously, played down Vance's prospects for the top job. In a recent Fox News interview, he was asked if he viewed Vance as the 2028 Republican nominee and he replied: \"No, but he's very capable.\" He added: \"So far, I think he's doing a very fantastic job. It's too early; we're just starting.\" Trump himself has, once again, declined to rule out running for a third term in office, even though it's prohibited by the US Constitution, which stipulates a maximum of two. In an interview with NBC News, he was asked if he wanted another term and replied: \"I like working.\" When asked to clarify, he said: \"I'm not joking. But I'm not… it is far too early to think about it.\" Read more from Sky News:Trump 'p***** off' with Putin over Zelenskyy commentsStarmer and Trump agree to continue UK-US deal talks 👉 Follow Trump 100 on your podcast app 👈 McDaniel told Trump 100 she did not think President Trump would run for a third term but spoke of her admiration for his number two. She said: \"I know JD pretty well. I spent a lot of time with him in Ohio - I was chair when he ran for Senate in Ohio, so I campaigned with him a lot. \"I think what I appreciated about him the most was in smaller settings with business leaders or town halls with voters. He took every question. \"He's truly, truly, really brilliant. But right now his focus is to support President Trump and the administration that he's serving.\""
    },
    {
        "title": "'You can start with me': Commander of NASA flight that was stranded in space for more than nine months says he is partly to blame",
        "description": "One of the astronauts who was stranded on the International Space Station (ISS) has said some of the blame for what went wrong lies with him. ",
        "url": "https://news.sky.com/story/watch-as-nasa-astronauts-who-were-stranded-in-space-for-months-speak-to-media-13339448",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-suni-williams-butch-wilmore_6872508.png?20250331203035",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-31 17:22:00",
        "Headline": "While the responsibility for issues that left him and Suni Williams stranded on the ISS can be found \"throughout the chain\", Butch Wilmore says that as the commander, \"I should have asked\" questions about Boeing's Starliner.",
        "Content": " One of the astronauts who was stranded on the International Space Station (ISS) has said some of the blame for what went wrong lies with him.  Butch Wilmore and Suni Williams splashed down off the coast of Florida earlier this month after more than nine months onboard the ISS. The two astronauts docked at the ISS on 5 June last year, expecting to be there for just eight days. Instead, issues with Boeing's long-awaited Starliner meant NASA decided to leave them waiting in orbit for months.  Wilmore: 'Start with me' for blame Mr Wilmore was asked at a NASA news conference on Monday evening where he lays the blame for the issues with Starliner, to which he said, \"I'll start with me\". \"There were issues, of course, with what happened with Starliner,\" he added. \"There were some issues, of course, that happened that prevented us from returning on Starliner. \n                  Stranded astronauts have just returned to a very different world\n                 \n                  NASA news conference as astronauts return to Earth after months in space\n                 \n                  Stranded NASA astronauts have returned home - but what else has gone wrong in space?\n                 \"And I'll start with me because there were questions that, as the commander of the spacecraft that I should have asked. And I did not, I didn't know I needed to... \"Blame, that's a term - I don't like that term - certainly there's responsibility throughout all the programmes, and certainly you can start with me.\" He then added that responsibility for the issues with returning home can be found \"all throughout the chain\", including with NASA and Boeing. Williams: 'Life goes on up there' Ms Williams also said she was somewhat surprised by the interest in their prolonged space mission. \"Life goes on up there. I mentioned today that we pivoted and became [ISS] crew members,\" she said. \"You maybe sort of get tunnel visioned into doing your job. \"We were just really focused on what we were doing... 'the world doesn't revolve around us but we revolve around it'.\" Ms Williams then said: \"I don't think we were aware to the degree [people were interested], pretty honoured and humbled by the fact of when we came home, it was like 'wow there are a lot of people'.\" During their long wait in space, the two US navy veterans completed spacewalks, experiments and even helped sort out the plumbing onboard the ISS.  Sky's science and technology editor Tom Clarke asked the astronauts if the politics around their stay in the ISS made a difficult situation worse. Nick Hague - who also was onboard the Crew-9 flight - disagreed. After explaining the timeline from the launch of SpaceX's Falcon 9 to the return of the two astronauts, he said: \"That was never in question the entire time. \"The politics don't make it up there when we're making operational decisions. There were a lot of options that were discussed, and the team on the ground... is gigantic, and everyone was working with a singular focus.\" Read more:Stranded astronauts have just returned to a very different world Science and technology editor The life of an astronaut is all about preparation.  And as Butch and Suni faced questions for the first back on Earth time about how their \"stranding\" in space was treated like an orbital political football -  that really shone through. The astronauts looked healthy and relaxed, despite having spent 35 times longer in space than they had expected to. They were happy to answer questions about their safe return, the effects of their extended stay in space on their bodies.  But when it came to politics, the answers were much more guarded. When I asked them about whether politics had made their difficult situation worse, it was quickly picked up, not by the pair themselves, but by astronaut Nick Hague, their mission commander for the ride back to Earth. \"The politics don't make it up there when we're making operational decisions,\" he said.  \"There were a lot of options discussed by the ground team, and everyone worked with singular focus on how do we end the Crew 9 mission at the right time and maintain the safety and the success of the space station mission.\" Their reluctance to address the political questions around the mission is understandable.  They have returned to a NASA bracing itself, like many federally funded organisations, for possible budget cuts and the mercurial decision-making of Donald Trump and his close ally Elon Musk. Both men had suggested it was a political decision by the previous administration not to return them to Earth sooner.  Painting their already scheduled return as a \"rescue mission\" - despite presenting no evidence of the claim it put NASA in an embarrassing position. It has been maintained all along that the plan was for the pair to return to Earth with the next rotation of the space station crew. Which is what subsequently happened.  But in the current political climate, and still awaiting the confirmation of a new leader for NASA's administration, it's giving politics a wide berth. The crew were also asked about how weird it was to return to Earth in the SpaceX capsule - and about the welcome party of dolphins that swam around the vessel after splashdown. \"I can tell you that returning from space to Earth through the atmosphere inside of a 3000-degree fireball of plasma is weird, regardless of how you look at it,\" Mr Wilmore said. \"It's thrilling, it's amazing, I remember thinking about the structure of the capsule,\" as the Dragon Freedom capsule descended at pace toward our planet. \"And then the parachutes open and... it's exhilarating.\" Mr Hague then remarked, \"I had requested dolphins as kind of a joke\". "
    },
    {
        "title": "Wisconsin teenager charged with killing mother and stepfather - and living with bodies for weeks",
        "description": "A teenager has been charged with killing his mother and stepfather, as prosecutors say he lived with their bodies for weeks.",
        "url": "https://news.sky.com/story/wisconsin-teenager-charged-with-killing-mother-and-stepfather-and-living-with-bodies-for-weeks-13339527",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wisconsin-nikita-casap_6872577.png?20250331225208",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-31 20:55:00",
        "Headline": "Nikita Casap, 17, is facing two counts of first-degree intentional homicide and two counts of hiding a corpse.",
        "Content": "A teenager has been charged with killing his mother and stepfather, as prosecutors say he lived with their bodies for weeks. Nikita Casap, 17, from Wisconsin, faces two counts of first-degree intentional homicide and two counts of hiding a corpse, the Waukesha County Sheriff's Department said. He appeared in court on Thursday over the deaths of his mother, Tatiana Casap, 35, and stepfather, Donald Mayer, 51. Their bodies were found in a state of decay on 28 February after Mr Mayer's mother - who had not heard from him in weeks - called the sheriff's office for a welfare check.  Sky's US partner network NBC News reported that at around the start of March, Casap was arrested in Iowa - more than 800 miles away from where his parents' bodies were found. During his court appearance last week, prosecutors said Ms Casap was found in a hallway covered with blankets and a towel, and Mr Mayer was found in a first-floor office covered by a pile of clothing. NBC affiliate WTMJ of Milwaukee reported earlier this month that Waukesha County district attorney Lesli Boese said Casap allegedly shot his mother at least three times on 11 February - twice in the stomach and once in the neck. Prosecutors also said earlier this month that Casap allegedly killed his stepfather by shooting him in the back of the head, then went to school the next day and continued to live at home for nearly two weeks until 23 February. Police also found a camera memory card said to contain a video of Casap lighting candles in the office where his stepfather's body was, with him recording the corpse about a week after he was killed. Read more:Could Donald Trump run for a third term?Prince Andrew accuser says she has just days to live Mr Boese added Casap fled with $14,000 (£10,839) in cash, and was inquiring about how to get fake plates put on his stepfather's car to hide the fact that he was stealing it. Casap also faces a charge regarding theft of property over $10,000 (£7,741) and two charges of misappropriating ID to obtain money. A preliminary hearing has been set for 9 April."
    },
    {
        "title": "Finnish president reveals Trump running out of patience with Putin over Ukraine ceasefire",
        "description": "The president of Finland says Donald Trump is running out of patience with Vladimir Putin and is frustrated with him.",
        "url": "https://news.sky.com/story/finnish-president-reveals-trump-running-out-of-patience-with-putin-over-ukraine-ceasefire-13339288",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-golf-alexander-stubb_6872062.jpg?20250331110427",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-31 12:07:00",
        "Headline": "Finland's president Alexander Stubb speaks to Sky News after spending the day playing golf with his US counterpart Donald Trump.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  The president of Finland says Donald Trump is running out of patience with Vladimir Putin and is frustrated with him. The Finnish leader spoke to Sky News after spending the day with the US president and playing golf with him. Alexander Stubb said Donald Trump is \"the only person who can broker a peace, a ceasefire, because he's the only one that Putin is afraid of\" - but is tiring of the Russian leader's tactics. Kremlin responds to Trump's 'p***ed off' comments - Ukraine latest \"There was a combination of impatience and a tad of frustration,\" he said during their match in Florida over the weekend - and it wasn't with his golf swing. \"We were talking a lot about the ceasefire and the frustrations he had that Russia was not committing to it.\" Mr Stubb's comments confirm reports of a change in attitude by Mr Trump over the Russian leader.  He has until recently seemed more than happy to give Putin the benefit of the doubt, applying enormous pressure on Ukrainian President Volodymyr Zelenskyy instead. Putin's refusal to accept a 30-day ceasefire though is changing that, according to the Finnish leader. He said: \"If there was a pendulum of trust and distrust, certainly Russian activity in the past few weeks has proven that we're moving more towards the distrust side of things.\" Mr Stubb is urging the imposition of colossal sanctions on Russia if it does not accept the ceasefire by a deadline that he says should be set for Easter. The US is considering sanctions on Russian oil, he said. \"Oil, oil prices, serious caps on oil.\" Read moreCould Trump seek a third term?Trump 'p***ed off with Putin'Why Trump's golf course won't host Open Republican senator Lindsey Graham, who also played golf with Mr Stubb on Saturday, is proposing what he has called \"bone breaking sanctions\" if it does not comply with ceasefire demands. Sanctions failed to deter Russia from invading Ukraine in the first place or reverse its invasion since. But Mr Stubb insists Russia's economic pain is now reaching a critical point and sanctions could tip it over the brink. He said: \"You never underestimate the capacity of Russians to live through discomfort. I mean that's what the Soviet Union was really about. But at the same time, there has to be a wall at some stage. And I think that wall is approaching.\" If Donald Trump is losing patience with Russia, is he prepared to do anything about it? \"I think we need a colossal amount of sanctions on 20 April if the Russians don't abide by the ceasefire,\" said Mr Stubb. But is Donald Trump's Finnish golfing partner confident he is going to apply that pressure? \"Fairly confident,' he said. \"More confident than hopeful.\" It may take more than that to persuade Putin there is something to really worry about."
    },
    {
        "title": "Elon Musk's dad says Tesla protesters are 'bums'",
        "description": "Elon Musk's father has told Sky News that protesters targeting his son's cost-cutting work for the US government are \"bums\".",
        "url": "https://news.sky.com/story/elon-musks-dad-tesla-protesters-are-bums-13339272",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-cabinet-meeting_6865912.jpg?20250324174816",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-03-31 11:18:00",
        "Headline": "Errol Musk uses an interview with Sky News to hit out at Elon's critics, insisting he's doing a good job for the American taxpayer and insists Tesla is in good hands.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Elon Musk's father has told Sky News that protesters targeting his son's cost-cutting work for the US government are \"bums\". Errol Musk was responding, in an interview with Business Live, to a growing backlash among US taxpayers and Tesla customers against his son's role in the Trump administration-created Department of Government Efficiency (DOGE). The electric car firm has increasingly become the subject of sales boycotts and protests - neither of which have been consigned to the US though dealerships there have seen vehicles vandalised and even set alight. Money latest: Major car tax change on Tuesday - here's what you need to know  Musk Sr told presenter Darren McCaffrey: \"To take notice of the bums that are trying to hurt Tesla by damaging cars, well that's just plain silly. Nobody does that, you know, you use your brain... and (it) tells you these people are the problem, not the car.\" The anger directed at Elon Musk was \"media hype\", he said as he also dismissed growing unease among Tesla investors that his son's main business interest was suffering at a time when the challenges facing it are only rising. Earlier this month one of Tesla's earliest investors, Ross Gerber, told Sky News Mr Musk should step down as the electric carmaker's chief executive unless he quit his work for the Trump administration. \n                  Lib Dem leader Sir Ed Davey says he would not buy a Tesla - as he tries another way of getting around\n                 \n                  Elon Musk gives away million-dollar cheques to voters at Wisconsin rally\n                 \n                  Trump 100 Day 69: Vance visits Greenland - to a frosty reception\n                  His worries included bad publicity and Mr Musk's ability to devote enough time to Tesla. It was revealed last week that Tesla sales had fallen 40% in Europe and were behind those of cheaper Chinese rival BYD on an annual basis. Mr Musk himself has since warned he expects a \"significant\" hit to Tesla from Mr Trump's metal tariffs and looming duties on all US car imports and car parts. He also hinted at the weekend, in an interview with Fox News, that he could soon have more time on his hands as the bulk of his work at DOGE should be completed by late May. Errol Musk denied any suggestion that his son was overstretched, saying there were good people at Tesla to delegate day-to-day business while Elon completed \"vital work\" for US taxpayers, given the state of the country's mounting debt pile. \"He's got plenty of ability to do that. Don't worry about it,\" he said, while predicting that Tesla shares would recover to $600 per share by the year's end. They are currently changing hands for $254. \"There's no concern there whatsoever, not at all,\" he said."
    },
    {
        "title": "Virginia Giuffre, who accused Prince Andrew of sexual assault, says she has days to live after car crash",
        "description": "A woman who accused Prince Andrew of sexual assault says she has four days to live after a car accident.",
        "url": "https://news.sky.com/story/virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-says-she-has-four-days-to-live-after-car-crash-13339369",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-31 14:40:00",
        "Headline": "Virginia Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences.",
        "Content": "A woman who accused Prince Andrew of sexual assault says she has four days to live after a car accident. In a post on Instagram, Virginia Guiffre said she was in a car that was hit by a school bus \"driving 110km [68.3mph] as we were slowing for a turn\". Ms Giuffre then said: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time, but you know what they say about wishes. S**t in one hand and wish in the other & I guarantee it's still going to be s**t at the end of the day.\" A spokesperson for Ms Giuffre told Sky's US partner network in a statement: \"Virginia has been in a serious accident and is receiving medical care in the hospital. \"She greatly appreciates the support and well wishes people are sending.\" She sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. \n                  Buckingham Palace was involved in meeting about Prince Andrew's private funding, Sky News learns\n                 \n                  Prince Andrew's former senior adviser made 'bad decision' when he provided legal statement in alleged Chinese spy case, tribunal hears\n                 \n                  'We'll play some more soon': Emails believed to be from Prince Andrew to Epstein after he claimed to cut contact revealed\n                 The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\"."
    },
    {
        "title": "JD Vance 'power move' marks him out as favourite to be presidential candidate",
        "description": "US vice president JD Vance has made a \"power move\" that marks him out as favourite to be the Republican's next presidential candidate, according to a former party chair.",
        "url": "https://news.sky.com/story/jd-vance-power-move-marks-him-out-as-favourite-to-be-presidential-candidate-13339063",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-usha-vance_6871911.jpg?20250331092605",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-03-31 00:22:00",
        "Headline": "Former Republican chair Ronna McDaniel told Sky's Trump 100 podcast that her \"money would be on\" Vance becoming the party's next nominee.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  US vice president JD Vance has made a \"power move\" that marks him out as favourite to be the Republican's next presidential candidate, according to a former party chair. Ronna McDaniel told the Sky News Trump 100 podcast her \"money would be on\" Vance becoming the next nominee following his appointment as finance chair of the Republican National Committee (RNC). McDaniel, who was RNC chair for seven years until 2024, described it as a \"power move from a political standpoint and somebody who understands how the rules are made\". It's the first time a sitting vice president has served as finance chair. According to McDaniel, it reflects a political awareness and ambition. \"Understanding that process, which is boring and very technical - and most people don't understand how the RNC works - that was a huge move this week for JD to take over as finance chair,\" she told Trump 100. \"This has never happened in the history of the party, where the vice president said 'I'm gonna be the finance lead for the national party'. So what does that mean? It means he's gonna interact with all the major investors heading into 2028. He's gonna know them intimately. \"But more importantly, in the next two years, the Republican National Committee will be passing the rules that will govern the primary process for 2028. What states will be first? What primaries will be the first? \"That whole process will be passed in the two years by different state parties across the country. \"JD will have access to every single RNC member and Republican National Committee state chair who will be making those governing rules. That shows you, the power that he has right now.\" Read more: Could Trump run for a third term? Donald Trump has, previously, played down Vance's prospects for the top job. In a recent Fox News interview, he was asked if he viewed Vance as the 2028 Republican nominee and he replied: \"No, but he's very capable.\" He added: \"So far, I think he's doing a very fantastic job. It's too early; we're just starting.\" Trump himself has, once again, declined to rule out running for a third term in office, even though it's prohibited by the US Constitution, which stipulates a maximum of two. In an interview with NBC News, he was asked if he wanted another term and replied: \"I like working.\" When asked to clarify, he said: \"I'm not joking. But I'm not… it is far too early to think about it.\" Read more from Sky News:Trump 'p***** off' with Putin over Zelenskyy commentsStarmer and Trump agree to continue UK-US deal talks 👉 Follow Trump 100 on your podcast app 👈 McDaniel told Trump 100 she did not think President Trump would run for a third term but spoke of her admiration for his number two. She said: \"I know JD pretty well. I spent a lot of time with him in Ohio - I was chair when he ran for Senate in Ohio, so I campaigned with him a lot. \"I think what I appreciated about him the most was in smaller settings with business leaders or town halls with voters. He took every question. \"He's truly, truly, really brilliant. But right now his focus is to support President Trump and the administration that he's serving.\""
    },
    {
        "title": "Elon Musk gives away million-dollar cheques to voters at Wisconsin rally",
        "description": "Elon Musk has handed out million-dollar cheques to two voters in Wisconsin.",
        "url": "https://news.sky.com/story/elon-musk-gives-away-million-dollar-cheques-to-voters-at-wisconsin-rally-13339065",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-usa_6871741.jpg?20250331074621",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-31 02:47:00",
        "Headline": "Democratic attorney general Josh Kaul argues Wisconsin law prohibits the giveaway - but the state's supreme court refuses to hear an appeal, giving no rationale for its decision.",
        "Content": "Elon Musk has handed out million-dollar cheques to two voters in Wisconsin. Mr Musk, a senior adviser to the US president, made the donations (worth £772,000 each) ahead of a Wisconsin Supreme Court election. At a rally on Sunday, the tech billionaire framed the election as critical to President Donald Trump's agenda and \"the future of civilisation\". It is not the first time Mr Musk has given away money to voters, he offered a similar giveaway in battleground states ahead of November's US presidential elections. A judge ruled at the time that the giveaways could continue, despite legal efforts to stop them. Wearing a yellow foam cheese hat, synonymous with the state and the Green Bay Packers American football team, Mr Musk told the crowd the election was \"a super big deal\" as the Republican majority in the House of Representatives was \"razor thin\". \"And if the [Wisconsin] Supreme Court is able to redraw the districts, they will gerrymander the district and deprive Wisconsin of two seats on the Republican side,\" he said. \"Then they will try to stop all the government reforms we are getting done, for you the American people.\" A legal challenge to Musk's giveaway failed, with Wisconsin's Supreme Court refusing to hear an appeal by the state's Democratic attorney general Josh Kaul, minutes before the rally was due to start. Mr Kaul argued Wisconsin law \"prohibits offering anything of value to induce anyone to vote\", but the court declined to take the case as an original action, giving no rationale for its decision. Mr Musk's lawyers argued he was exercising his right to free speech and that the aim of the payments was to \"generate a grassroots movement in opposition to activist judges\". Wisconsin's hotly-contested election, on which Mr Musk and groups he supports have spent more than $20m (£15.4m), takes place on Tuesday. In a post on X on Friday, Mr Musk said he planned to \"personally hand over\" two million dollars to a pair of voters who had already cast their ballots. But he later clarified his position, and said that the money would instead go to people who will be \"spokesmen\" for an online petition against \"activist\" judges. Read more from Sky News:Trump 'p***** off' with Putin over Zelenskyy commentsStarmer and Trump agree to continue UK-US deal talks One of the recipients of a cheque at the rally was a Green Bay man who has donated to the state's Republican party and the conservative candidate in the court race, and who has a history of posting support for Mr Trump and his agenda. The ballot has broken national spending records for a judicial election, with more than $81m (£62.5m) spent."
    },
    {
        "title": "Cost of living calculator: See how much your bills are going up",
        "description": "Households across the country face higher bills from 1 April. Use our calculator to find out how you'll be affected.",
        "url": "https://news.sky.com/story/cost-of-living-calculator-see-how-much-your-bills-are-going-up-13339515",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ill-calculator-cost-of-living_6872523.png?20250331211936",
        "type": "Business",
        "Author": "Hanna Schnitzer, specialist producer, and Joely Santa Cruz, data journalist",
        "Date Published": "2025-03-31 20:10:00",
        "Headline": "Council tax, gas, water and electricity bills, broadband, mobile phone, TV and transport costs are all rising. The increases are being introduced to coincide with the new financial year and are likely to hit the finances of almost everyone in the country.",
        "Content": "By Hanna Schnitzer, specialist producer, and Joely Santa Cruz, data journalist  Households across the country face higher bills from 1 April. Use our calculator to find out how you'll be affected. Council tax, gas, water and electricity bills, broadband, mobile phone, TV and transport costs are all rising. The increases are being introduced to coincide with the new financial year and are likely to hit the finances of almost everyone in the country. Many of the increases are higher than the rate of inflation and are coming into effect with households already struggling with price rises and cost of living pressures. Salaries will also be increasing, but some will gain more than others depending on their rate of salary increase and the amount of additional tax some will be paying as a result of \"fiscal drag\", where frozen tax bands bring them over higher tax thresholds. Enter your details into our calculator to see how much the changes could cost you. Greg Marsh, household finance expert and chief executive of household money-saving tool Nous.co, said: \"This year's April price rises are a nasty blow to households. \"The combination of water, energy, council tax and more all rising on the same day adds up to serious money. \"Plus we're seeing yet more cynical price hikes from mobile and broadband suppliers. The crackdown on inflation-linked increases hasn't stopped them from charging consumers more. \"With all this going on, it's crucial none of us is overpaying. Unfortunately, nine out of 10 of us are doing just that. \"At Nous.co, we typically save customers hundreds of pounds a year on bills because they let things slip, and just didn't realise they were paying far more than they needed to.\" Figures for average bill increases and salary and tax changes were provided by Nous and analysed by Sky News with additional government data."
    },
    {
        "title": "Post Office interim boss Brocklehurst lined up for permanent role",
        "description": "The acting chief executive of the Post Office is being lined up to take the job on a permanent basis as the state-owned company continues talks with ministers over its long-term funding arrangements.",
        "url": "https://news.sky.com/story/post-office-interim-boss-brocklehurst-lined-up-for-permanent-role-13339403",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-31 15:56:00",
        "Headline": "Neil Brocklehurst, who was named acting CEO of the state-owned company last September, is expected to be appointed as its permanent boss next month, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The acting chief executive of the Post Office is being lined up to take the job on a permanent basis as the state-owned company continues talks with ministers over its long-term funding arrangements. Sky News has learnt that Neil Brocklehurst, who was named interim chief last September, is close to being handed the role. Whitehall sources said on Monday that an announcement about Mr Brocklehurst's appointment was likely to be made in April. Money latest: Major car tax change on Tuesday - here's what you need to know The decision, which requires the approval of business secretary Jonathan Reynolds, will bring a degree of stability to an organisation still grappling with the financial and reputational consequences of the Horizon IT scandal, which saw hundreds of sub-postmasters wrongly convicted of fraud and false accounting. Reliant on the government for its funding, the Post Office has been in negotiations with ministers about delivering a previously pledged pay uplift this year. Earlier this month, Sky News reported that Nigel Railton, the company's chairman, had informed thousands of Post Office managers that he had yet to gain certainty from Whitehall about a £120m increase for this year. \n                  Every household bill rising in April - and how you can beat the hikes\n                 \n                  Cost of living calculator: See how much your bills are going up\n                 \n                  Elon Musk's dad says Tesla protesters are 'bums'\n                 The sum was promised in November as part of a strategy to rebuild the Post Office in the wake of the Horizon scandal. The Post Office has outlined plans for an ambitious transformation which includes franchising more than 100 directly managed branches. A substantial number of jobs are also being cut at the company's head office as part of the restructuring. Several tranches of those have already taken place. Mr Brocklehurst replaced Nick Read at the Post Office's helm following a turbulent period for the outgoing boss. Mr Read was repeatedly accused of being obsessed with his pay arrangements and being at the centre of a series of rows with both board colleagues and his government employers. Like Mr Railton, Mr Brocklehurst is a former executive at Camelot, the previous National Lottery operator. A Post Office spokesman declined to comment, while the Department for Business and Trade has been contacted for comment."
    },
    {
        "title": "Elon Musk's dad says Tesla protesters are 'bums'",
        "description": "Elon Musk's father has told Sky News that protesters targeting his son's cost-cutting work for the US government are \"bums\".",
        "url": "https://news.sky.com/story/elon-musks-dad-tesla-protesters-are-bums-13339272",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-cabinet-meeting_6865912.jpg?20250324174816",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-31 11:18:00",
        "Headline": "Errol Musk uses an interview with Sky News to hit out at Elon's critics, insisting he's doing a good job for the American taxpayer and insists Tesla is in good hands.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n  Elon Musk's father has told Sky News that protesters targeting his son's cost-cutting work for the US government are \"bums\". Errol Musk was responding, in an interview with Business Live, to a growing backlash among US taxpayers and Tesla customers against his son's role in the Trump administration-created Department of Government Efficiency (DOGE). The electric car firm has increasingly become the subject of sales boycotts and protests - neither of which have been consigned to the US though dealerships there have seen vehicles vandalised and even set alight. Money latest: Major car tax change on Tuesday - here's what you need to know  Musk Sr told presenter Darren McCaffrey: \"To take notice of the bums that are trying to hurt Tesla by damaging cars, well that's just plain silly. Nobody does that, you know, you use your brain... and (it) tells you these people are the problem, not the car.\" The anger directed at Elon Musk was \"media hype\", he said as he also dismissed growing unease among Tesla investors that his son's main business interest was suffering at a time when the challenges facing it are only rising. Earlier this month one of Tesla's earliest investors, Ross Gerber, told Sky News Mr Musk should step down as the electric carmaker's chief executive unless he quit his work for the Trump administration. \n                  Lib Dem leader Sir Ed Davey says he would not buy a Tesla - as he tries another way of getting around\n                 \n                  Elon Musk gives away million-dollar cheques to voters at Wisconsin rally\n                 \n                  Trump 100 Day 69: Vance visits Greenland - to a frosty reception\n                  His worries included bad publicity and Mr Musk's ability to devote enough time to Tesla. It was revealed last week that Tesla sales had fallen 40% in Europe and were behind those of cheaper Chinese rival BYD on an annual basis. Mr Musk himself has since warned he expects a \"significant\" hit to Tesla from Mr Trump's metal tariffs and looming duties on all US car imports and car parts. He also hinted at the weekend, in an interview with Fox News, that he could soon have more time on his hands as the bulk of his work at DOGE should be completed by late May. Errol Musk denied any suggestion that his son was overstretched, saying there were good people at Tesla to delegate day-to-day business while Elon completed \"vital work\" for US taxpayers, given the state of the country's mounting debt pile. \"He's got plenty of ability to do that. Don't worry about it,\" he said, while predicting that Tesla shares would recover to $600 per share by the year's end. They are currently changing hands for $254. \"There's no concern there whatsoever, not at all,\" he said."
    },
    {
        "title": "Primark boss Paul Marchant resigns and admits 'error of judgement' after allegation over his behaviour towards woman",
        "description": "The boss of Primark has resigned after admitting an \"error of judgement\" in his behaviour towards a woman in a social environment.  ",
        "url": "https://news.sky.com/story/primark-boss-paul-marchant-resigns-and-admits-error-of-judgement-after-allegation-over-his-behaviour-towards-woman-13339092",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-paul-marchant-primark_6871834.jpg?20250331080343",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-31 05:30:00",
        "Headline": "Chief executive of Primark's parent firm Associated British Foods (ABF), George Weston, says he is \"immensely disappointed\" by Paul Marchant's actions.",
        "Content": "The boss of Primark has resigned after admitting an \"error of judgement\" in his behaviour towards a woman in a social environment.   Paul Marchant stepped down as chief executive of the high-street fashion brand with immediate effect following an investigation. Primark's parent firm, Associated British Foods (ABF), said he had co-operated with the investigation, and \"acknowledged his error of judgment and accepts that his actions fell below the standards expected by ABF\". \"He has made an apology to the individual concerned, the ABF board and also to his Primark colleagues and others connected to the business,\" the firm added. The group's overall chief executive, George Weston, said he is \"immensely disappointed\". \"At ABF, we believe that high standards of integrity are essential,\" he said in a statement. \"Acting responsibly is the only way to build and manage a business over the long term. \"Colleagues and others must be treated with respect and dignity. \"Our culture has to be, and is, bigger than any one individual.\" ABF's finance director, Eoin Tonge, will take over as chief executive on an \"interim basis\" - and his role will be taken up by Joana Edwards, the group's financial controller. Read more from Sky NewsWH Smith to disappear from High StreetBlackwall Tunnell charges to startWhat it's really like to be a bodyguard The group's statement added it \"seeks to provide a safe, respectful, and inclusive work environment where all employees and third parties are treated with dignity and respect\". \"Primark is committed to doing business the right way at all levels of the company,\" it said. ABF promised to continue supporting the woman who made the complaint. Primark results due soon The group will still publish its interim results for the financial year as planned on 29 April, according to its statement. In January, ABF reported an uncharacteristic decline in like-for-like sales at Primark across the UK and Ireland. Sales at the store fell by 6% - with Primark saying it expects \"low single-digit\" sales growth for 2025 as a result - down from mid single-digit levels in November 2024. Speaking at the time, Russ Mould, investment director at AJ Bell, said: \"If Primark is struggling, you know the UK retail sector is in trouble.\""
    },
    {
        "title": "Stock markets tumble as Trump tariffs loom",
        "description": "Stock markets have plummeted as the 2 April implementation day of US tariffs ticks closer.",
        "url": "https://news.sky.com/story/stock-markets-tumble-as-trump-tariffs-loom-13339103",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-nikkei-japan-stock-market_6872021.jpg?20250331103129",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-03-31 06:08:00",
        "Headline": "Values have tumbled globally as hopes of another delay or a solution fade. The FTSE 250 index slipped to a low not seen in nearly a year.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Stock markets have plummeted as the 2 April implementation day of US tariffs ticks closer. Benchmark stocks in Asia were rattled at the lack of progress in halting US President Donald Trump's taxes which are due to come into force on US imports from Wednesday. After delays, 25% tariffs are to be levied on all cars entering the US on what Mr Trump has called \"liberation day\". Trade barriers are also expected to be announced on countries deemed to be giving the US a bad deal on trade. In Japan, the Nikkei stock index lost nearly 4% at points before closing 3.86% down, while Korea's Kospi index dropped 2.83%. European markets followed suit with the UK's FTSE 100 list of most valuable London Stock Exchange companies down 1% at the open, falling to a more than two-week low. The larger FTSE 250, which contains more companies focused on the UK, fell 1.55%, dipping to a level last seen in nearly a year. It closed almost 2% down. \n                  Trump's tariff blueprint could transform America's industrial base or harm the poorest states\n                 \n                  Sir Keir Starmer says national interest 'must come first' amid Donald Trump trade wars\n                 \n                  'If VW disappears, people won't stay in the town': Fears over Trump's car tariffs\n                 Germany's Dax, France's CAC 40 and the European-wide Stoxx all shed more than 1% by the close while the FTSE 100 was just shy of 0.9% lower. The tech-focused Nasdaq was down by almost 2% when Wall Street opened but later erased many of those losses. Read more:What will happen on 'liberation day' and how does it affect UK? Concerns of a worsening trade war are rising - adding taxes to all goods entering the US would force manufacturers to increase their prices to pay the tariffs, raising the price for American consumers and making the products less competitive. The UK government has been trying to negotiate an exemption with the US government to prevent UK exports from being hit by the tariffs but has so far been unsuccessful. Gold has reached another record high price as investors put money into investments perceived as safer than some stocks. There's been little change in the pound as it has remained around the $1.29 mark, seen over the last 10 days. The pound slid against the euro, however, down to €1.195."
    },
    {
        "title": "Sentencing guidelines for ethnic minority suspects delayed after backlash",
        "description": "Controversial sentencing guidelines that were due to come into force on Tuesday have been delayed after a political backlash.",
        "url": "https://news.sky.com/story/sentencing-guidelines-for-ethnic-minority-suspects-delayed-after-backlash-13339357",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-shabana-mahmood-prisons_6869116.jpg?20250328003159",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-31 14:21:00",
        "Headline": "The Sentencing Council was due to bring in new rules around how judges should determine punishment for people from ethnic minority backgrounds from Tuesday.",
        "Content": "Controversial sentencing guidelines that were due to come into force on Tuesday have been delayed after a political backlash. The Sentencing Council, the independent body that sets out sentencing guidance to courts in England and Wales, was due to bring in new rules around how judges should determine punishment for people from ethnic minority backgrounds. The new guidance states that a pre-sentence report - the results of which are taken into account when considering a criminal's sentence - will \"usually be necessary\" before handing out punishment for someone from an ethnic, cultural or faith minority, alongside other groups such as young adults aged 18 to 25, women and pregnant women. Politics latest: Follow live updates  Shabana Mahmood, the justice secretary, had said the proposed guidance was \"unacceptable\" and amounted to \"differential treatment before the law\" as she urged the council to reverse it. When the Sentencing Council initially refused her request, Ms Mahmood threatened to legislate to overturn the guidance if necessary. \n                  What action has the justice secretary taken against the Sentencing Council?\n                 \n                  'Two-tier' justice row: Sentencing Council rejects minister's call for guidance rethink\n                 \n                  Government won't rule out shortening sentences of violent offenders to free up prison space as it opens new jail\n                  She confirmed on Monday evening that she would introduce legislation on Tuesday to block these guidelines coming into effect. The Sentencing Council has now delayed the \"in force date of the guideline pending such legislation taking effect\". It said in a statement that the council \"remains of the view that its guideline, imposition of community and custodial sentences, as drafted is necessary and appropriate\". However, in a meeting between the chairman Lord Justice Davis and Ms Mahmood on Monday, the minister \"indicated her intention to introduce legislation imminently that would have the effect of rendering the section on 'cohorts' in the guideline unlawful\". The council said it is unable to introduce a guideline when there is a draft bill due for introduction that would make it unlawful. Ms Mahmood said she was \"grateful\" to the Sentencing Council for delaying the implementation of its new guidelines. The minister said in a statement: \"These guidelines create a justice system where outcomes could be influenced by race, culture or religion. \"This differential treatment is unacceptable - equality before the law is the backbone of public confidence in our justice system.\" The Sentencing Council also attracted criticism from shadow justice secretary Robert Jenrick, who said its updated guidance was an example of \"two-tier justice\" that would lead to \"blatant bias\" against Christians and straight white men. He also argued that it would make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\" - something the council denied. The council previously rejected calls from the government to abandon the guidelines, which ask judges to consider offenders' racial, cultural and religious background when deciding a sentence. Lord Davis denied that pre-sentence reports reduced the prospect of a jail sentence. However, he said the council would provide \"some clarification of the language\" to avoid confusion."
    },
    {
        "title": "Sir Keir Starmer says 24,000 people who have 'no right to be here' have been returned under Labour",
        "description": "Sir Keir Starmer has said 24,000 people who \"have no right to be here\" have been returned since Labour took power as he opened the government's border security summit.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-24000-people-who-have-no-right-to-be-here-have-been-returned-under-labour-13339113",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-yvette-cooper-summit_6872118.jpg?20250331121959",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-31 06:38:00",
        "Headline": "Interior ministers and law enforcement from more than 40 countries are attending a summit on illegal migration in central London, as well as representatives from Meta, X and TikTok.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Sir Keir Starmer has said 24,000 people who \"have no right to be here\" have been returned since Labour took power as he opened the government's border security summit. The prime minister said it was the \"highest return rate for eight years\". Politics latest: UK has been 'soft touch on migration', says Starmer Since Labour took office last July, 29,884 people have been detected crossing the Channel on 542 small boats. A total of 6,642 people crossed between 1 January to 30 March this year - a 43% increase on the same time last year, when the Conservatives were in power. Crossings this year passed 5,000 on 21 March, a record compared with the previous seven years since the first crossings in 2018 - and 24% higher than 2024, and 36% higher than 2023. Interior ministers and law enforcement from more than 40 countries, including the US, Iraq, Vietnam and France, are at the summit at Lancaster House in central London. Meta, X and TikTok representatives are also there to discuss how to tackle the online promotion of illegal migration. Sir Keir told the gathering he was \"angry\" about the scale of illegal immigration around the world as he said it was a \"massive driver of global insecurity\". \"The truth is, we can only smash these gangs once and for all if we work together,\" he said. \"Because this evil trade, it exploits the cracks between our institutions. It pits nations against one another. It profits from our inability at the political level to come together.\" He said people smuggling should be treated as a global security threat similar to terrorism. \"None of these strategies, as you know, are a silver bullet. I know that,\" he told the summit. \"But each of them is another tool, an arsenal that we're building up to smash the gangs once and for all.\" Political correspondent In a speech at the organised immigration crime summit, Sir Keir Starmer pointedly told global delegates there is nothing progressive or compassionate about turning a blind eye to people smuggling. \n This is as much a direct challenge to other nations as it is to those in his party who may be uncomfortable with talk of cracking down on illegal migration and making it harder to claim asylum in the UK. \n In an effort to front up to the problem, the PM and home secretary both outlined the deep complexities involved in stopping the boats; interrupting supply chains, financial sanctions on gangs and blocking social media content advertising routes to the UK.  Labour's message? Bear with us, this is harder than it looks.  But, with public patience wearing dangerously thin on small boats crossings after endless promises from Labour and the Conservatives, and with record numbers crossing the Channel - a 43% rise on this time last year - the prime minister knows he has very little time to persuade the public he can deliver.  Senior government sources tell me they are far more worried about Reform UK denting their vote share than they are about the Conservatives - and the PM's message today indicates just that.  In his speech, Sir Keir twice cited what he called the unfairness of illegal migration: driving down working people's wages, terms and conditions, and putting valuable public services under strain.  This shift in tone, directly juxtaposing working people with migrants, feels like a subtle yet significant tilt to voters who may be tempted by Nigel Farage's rhetoric on migration. \n However, we may begin to see some Labour MPs fidgeting in their seats as it is sure to make some of them a little uncomfortable.  Sir Keir appears to be marching up the hill the Tories died on. So will this all too familiar hike prove fatal, or will he succeed where Rishi Sunak failed?  And if Sir Keir does succeed and manages to make a significant dent in the number of small boat crossings before the next general election, Reform may not prove to be as lethal an opponent as first thought.  UK has been a 'soft touch on migration' The prime minister criticised the previous Conservative government for allowing illegal migration to soar, saying: \"For too long the UK has been a soft touch on migration.\" He said a lack of co-ordination between the police and intelligence agencies had been an \"open invitation\" for people smugglers to send migrants to the UK. Read more:Government looking at countries to process asylum seekers inBosses who fail to check staff immigration status may face jail Cooper reveals small boats gang tactics Home Secretary Yvette Cooper also spoke at the event, where she revealed some of the horrifying tactics used by gangs smuggling people over to the UK in small boats. She said they place women and children in the middle of the flimsy rigid inflatable boats (RIBs), and when they collapse due to overcrowding, they fold in and crush them. \"All of your countries will have different stories of the way in which the gangs are exploiting people into sexual exploitation, into slave labour, into crime, the way in which the gangs are using new technology,\" she said. She said they were not just using phones and social media to organise crossings, but also drones to spot border patrols. \"It is governments and not gangs who should be deciding who enters our country,\" she said. Sir Keir also hosted a roundtable discussion joined by border security and asylum minister Dame Angela Eagle, Border Security Commander Martin Hewitt and Home Office, Border Force and National Crime Agency officials. Ministers 'disappointed' in small boat numbers Before the summit, Dame Angela told Wilfred Frost on Sky News Breakfast ministers were \"disappointed\" in the number of small boat crossings in recent months. She said one reason was more people were being packed into each boat. She also said smuggler gangs have been allowed to grow \"very sophisticated\" global networks over many years. Earlier, Ms Cooper announced £30m funding for \"high impact operations\" by the Border Security Command (BSC) to tackle supply chains, illicit finances and trafficking routes across Europe, the Western Balkans, Asia and Africa. An additional £3m will be given to the Crown Prosecution Service (CPS) to increase its capacity to prosecute organised international smugglers and to support the BSC to pursue and arrest those responsible for people smuggling operations."
    },
    {
        "title": "Major incident declared in Birmingham as '17,000 tonnes' of rubbish piles up",
        "description": "A major incident has been declared in Birmingham over an ongoing bin strike, which has left&#160;around 17,000 tonnes of waste on the streets of the city.",
        "url": "https://news.sky.com/story/major-incident-declared-in-birmingham-as-17000-tonnes-of-rubbish-piles-up-13339391",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-birmingham-bins-strikes_6871022.jpg?20250330024507",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-31 15:30:00",
        "Headline": "By declaring a major incident, the council will be able to increase the availability of street cleansing and fly-tip removal with an additional 35 vehicles and crews around the city.",
        "Content": "A major incident has been declared in Birmingham over an ongoing bin strike, which has left around 17,000 tonnes of waste on the streets of the city. Birmingham City Council said the \"regrettable\" step was taken in response to public health concerns, with picket lines blocking depots and preventing waste vehicles from collecting rubbish. Members of Unite have been on all-out strike since 11 March in a row over pay, which the union claims will leave some members of staff £8,000 worse off. A series of walkouts have also impacted refuse collections since January. Politics latest: Follow live updates By declaring a major incident, the council will be able to increase the availability of street cleansing and fly-tip removal with an additional 35 vehicles and crews around the city. This action will also allow the council to explore what further support is available from neighbouring authorities and the government to assist in the management of the situation. Council leader John Cotton said it was a \"regrettable\" step, but the situation was \"causing harm and distress\" to local people. News correspondent ‘We’re worried about our kids,\" says one man in Bordesley Green.  It’s a sentiment shared by many across Birmingham as the council declares a major incident due to concerns over public health. I’m standing on Fifth Avenue in the southeast of the city, which couldn’t be further from its glamorous namesake in New York.\n Piles of black bin liners, full to bursting, cover the pavements, forcing people to walk in the road. The recent warm weather makes the stench pervasive, as food waste openly rots outside homes. 17,000 tonnes of rubbish litters Birmingham, and the city council says declaring a major incident will initially increase the availability of street cleaning and fly-tip removal, with an additional 35 vehicles and crews deployed around the city. Many residents are taking matters into their own hands and driving their rubbish to nearby dumps, but for those without a car, all they can do is hope for some resolution between the council and Unite. \n\n  \"I respect the right to strike and protest, however actions on the picket line must be lawful and sadly the behaviour of some now means we are seeing a significant impact on residents and the city's environment,\" he said. Jim McMahon, the minister for local government, said the all-out strike by Unite members is causing \"misery and disruption\" to residents, as well as posing a \"public health risk to the city's most vulnerable and deprived\". He said the government \"stands ready\" to respond to any request for extra resources, but insisted that any deal to end the bin strike must \"maintain value for money\".  Mr McMahon told the Commons: \"This is causing a public health risk to the city's most vulnerable and deprived residents. As a result, I am aware that Birmingham has today declared a major incident to give them the mechanisms to better manage the impact on local residents. \"I support that decision, and I will back local leaders.\" The minister added that the government will \"not hesitate to give support in any way that Birmingham leaders need\". He said: \"If local leaders on the ground in Birmingham feel that tackling these issues goes beyond the resources available to them and they request national support, then of course we stand ready to respond to any such request.\" Members of the Unite union met with Birmingham City Council last Thursday, but talks have so far failed. Unite says the dispute will not end unless the \"hugely damaging\" cuts to bin collectors' wages are reversed. But Birmingham City Council says the aim of the restructuring is to create a \"modern, sustainable and consistently reliable waste collection service\"."
    },
    {
        "title": "Lib Dem leader Sir Ed Davey says he would not buy a Tesla - as he tries another way of getting around",
        "description": "Sir Ed Davey has said people are \"changing their mind\" on Tesla electric cars and he would not buy one.",
        "url": "https://news.sky.com/story/lib-dem-leader-says-he-would-not-buy-a-tesla-as-he-tries-another-way-of-getting-around-13339277",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-ed-davey-hobby-horse_6872068.jpg?20250331111011",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-03-31 11:36:00",
        "Headline": "Sir Ed Davey has become quite outspoken in his criticism of Donald Trump and his adviser, as he called for tariffs to be placed on Tesla.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Sir Ed Davey has said people are \"changing their mind\" on Tesla electric cars and he would not buy one. Asked if people should boycott Tesla - run by Trump adviser Elon Musk - the Liberal Democrat leader said: \"Let's get tariffs on them first.\" Sir Ed told Sky News: \"People who would have liked to believe that Teslas were the way forward are now saying, 'well, hold on a minute, we don't want to be associated with someone with these horrible views'.\" Politics latest: PM hosts summit on illegal migration The Lib Dems have called for the UK government to put retaliatory tariffs on Tesla and other American goods because President Donald Trump is \"not a reliable ally\". Launching their local election campaign in Henley-on-Thames, Sir Ed said the Lib Dems were now \"the party of Middle England\". He denied this meant they were the \"posh party\" or that their appeal was limited to those with middle or higher incomes. \n                  Man appears in court charged with malicious mischief over damage to Trump Turnberry golf resort in Scotland\n                 \n                  Finnish president reveals Trump running out of patience with Putin over Ukraine ceasefire\n                 \n                  Trump's tariff blueprint could transform America's industrial base or harm the poorest states\n                 Asked who he sees as Middle England, Sir Ed said: \"Vast amounts of people, everybody needs good care, everybody needs a good health service, we're appealing to everybody.\" To mark the launch of his party's campaign, Sir Ed was taught how to \"hobby horse\" - and was photographed jumping over miniature fences on a stick horse at the walled garden of an Oxfordshire golf club. May's local elections should bring a good set of results for the Lib Dems, with the party aiming to overtake the Conservatives in the number of councils they run. Lib Dem officials said the party currently leads 37 councils with a majority, compared with 49 run by the Conservatives. They are helped by the fact that 20 Tory local authorities are holding votes this year, including in areas like Shropshire, Devon and Hertfordshire where the Lib Dems performed well at the general election. Read more:PM says 24,000 with 'no right to be here' returned under LabourMusk gives away million dollar cheques to voters at rally Even if the Lib Dems can surpass the Conservatives in the number of councils won, they will likely still trail them in the total tally of individual elected councillors. Since winning a record number of seats at the general election last July, the Lib Dems have continued to focus their campaigning on local issues, with the NHS and social care a key topic. But in recent months, Sir Ed has become more vocal on foreign affairs, upping his criticism of Mr Trump and calling for closer economic ties with the EU. With Labour constrained by government and the Conservatives trying to stop voters switching to Reform UK, the Lib Dems believe they have identified an opportunity to strike a more pro-European and anti-Trump tone. The party also seized on comments made by Kemi Badenoch when the Tory leader appeared to dismiss Lib Dems as \"somebody who is good at fixing their church roof\". Sir Ed said he took that as a \"compliment\" and accused Ms Badenoch of \"sneering\" at voters. A majority of the party's target areas for the local elections are traditionally Tory-held councils in rural and more affluent areas. However, the party is also hoping for a strong result in the Hull and East Yorkshire mayoral contest. The Conservatives called the Lib Dem launch \"a joke\" and said Tories \"are working day in and day out to provide this country the opposition it deserves\". Other parties will also be holding launches ahead of the local elections on 1 May, which Sky News will also be covering. Henley-on-Thames' local election candidates are due to be confirmed on 2 April."
    },
    {
        "title": "Sir Keir Starmer hosts creators of hit Netflix drama Adolescence - and tells them he's 'not found it easy viewing'",
        "description": "Sir Keir Starmer has met with the creators of Adolescence for talks on how to prevent young boys being dragged into a \"whirlpool of hatred and misogyny\".",
        "url": "https://news.sky.com/story/sir-keir-starmer-hosts-creators-of-hit-netflix-drama-adolescence-and-tells-them-hes-not-found-it-easy-viewing-13339287",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-adolescence-stephen-graham_6862012.jpg?20250331145907",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-31 11:58:00",
        "Headline": "Sir Keir Starmer says there is no \"simple solution\" to stop boys from being radicalised online, calling misogyny a \"cultural issue\".",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has met with the creators of Adolescence for talks on how to prevent young boys being dragged into a \"whirlpool of hatred and misogyny\". The prime minister hosted a roundtable in Downing Street with co-writer Jack Thorne and producer Jo Johnson to discuss issues raised in the series, which centres on a 13-year-old boy arrested for the murder of a young girl and the rise of incel culture. Opening the meeting, which was first revealed by Sky News earlier this month, Sir Keir thanked the show's creators for the conversation they have started. Politics Live: UK expecting to get hit by Trump's 'liberation day' tariffs  He said he and his wife had watched the drama with his 14-year-old daughter and 16-year-old son, and that \"as a dad, I have not found it easy viewing\". Sir Keir said the four-part series raises questions about how to keep young people safe from technology. Previously it was thought they were more at risk outside their homes but that's now being \"overtaken by a greater danger, which is what's happening in the home, what's happening in the bedroom, in the places where they're on their own,\" the prime minister said. Read more:How incel culture influenced new Netflix show He referred to real-life cases such as that of Kyle Clifford, the crossbow killer who watched misogynistic content before he murdered his ex-girlfriend and her mother and sister. This type of violence against women \"isn't new\" but Adolescence shows it has taken \"different characteristics\", Sir Keir added. 'No simple solution' The meeting came as the government announced Netflix had made the show free to watch in all secondary schools across the country to help pupils understand \"the impact of misogyny, dangers of online radicalisation and the importance of healthy relationships\". Sir Keir said there is \"no simple solution\" or \"policy lever to be pulled\", describing misogyny as \"almost a cultural issue\". He said the aim of the round table was to discuss \"what can we do as a society to stop and prevent young boys being dragged into this whirlpool of hatred and misogyny\". 'Brilliant meeting' Speaking after the round table, Thorne told Sky News' arts and entertainment correspondent Katie Spencer it was a \"brilliant meeting\", with young people, charities, and representatives from Netflix also present. \"There needs to be more dialogue with people cleverer than me, that's the big solution to this problem,\" he said. \"It's about putting money in, having conversations, creating an environment which is safer for our young people.\" 👉 Listen to Sky News Daily on your podcast app 👈 Adolescence topped the charts amid mounting concern over violent and sexist social media content being served up to teenagers, and calls for the government to get tough on tech firms. Ministers have faced calls from MPs to take radical action such as raising the age of consent to use social media from 13 to 16 - something Thorne has previously backed."
    },
    {
        "title": "'You can start with me': Commander of NASA flight that was stranded in space for more than nine months says he is partly to blame",
        "description": "One of the astronauts who was stranded on the International Space Station (ISS) has said some of the blame for what went wrong lies with him. ",
        "url": "https://news.sky.com/story/watch-as-nasa-astronauts-who-were-stranded-in-space-for-months-speak-to-media-13339448",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-suni-williams-butch-wilmore_6872508.png?20250331203035",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-31 17:22:00",
        "Headline": "While the responsibility for issues that left him and Suni Williams stranded on the ISS can be found \"throughout the chain\", Butch Wilmore says that as the commander, \"I should have asked\" questions about Boeing's Starliner.",
        "Content": " One of the astronauts who was stranded on the International Space Station (ISS) has said some of the blame for what went wrong lies with him.  Butch Wilmore and Suni Williams splashed down off the coast of Florida earlier this month after more than nine months onboard the ISS. The two astronauts docked at the ISS on 5 June last year, expecting to be there for just eight days. Instead, issues with Boeing's long-awaited Starliner meant NASA decided to leave them waiting in orbit for months.  Wilmore: 'Start with me' for blame Mr Wilmore was asked at a NASA news conference on Monday evening where he lays the blame for the issues with Starliner, to which he said, \"I'll start with me\". \"There were issues, of course, with what happened with Starliner,\" he added. \"There were some issues, of course, that happened that prevented us from returning on Starliner. \n                  Stranded astronauts have just returned to a very different world\n                 \n                  NASA news conference as astronauts return to Earth after months in space\n                 \n                  Stranded NASA astronauts have returned home - but what else has gone wrong in space?\n                 \"And I'll start with me because there were questions that, as the commander of the spacecraft that I should have asked. And I did not, I didn't know I needed to... \"Blame, that's a term - I don't like that term - certainly there's responsibility throughout all the programmes, and certainly you can start with me.\" He then added that responsibility for the issues with returning home can be found \"all throughout the chain\", including with NASA and Boeing. Williams: 'Life goes on up there' Ms Williams also said she was somewhat surprised by the interest in their prolonged space mission. \"Life goes on up there. I mentioned today that we pivoted and became [ISS] crew members,\" she said. \"You maybe sort of get tunnel visioned into doing your job. \"We were just really focused on what we were doing... 'the world doesn't revolve around us but we revolve around it'.\" Ms Williams then said: \"I don't think we were aware to the degree [people were interested], pretty honoured and humbled by the fact of when we came home, it was like 'wow there are a lot of people'.\" During their long wait in space, the two US navy veterans completed spacewalks, experiments and even helped sort out the plumbing onboard the ISS.  Sky's science and technology editor Tom Clarke asked the astronauts if the politics around their stay in the ISS made a difficult situation worse. Nick Hague - who also was onboard the Crew-9 flight - disagreed. After explaining the timeline from the launch of SpaceX's Falcon 9 to the return of the two astronauts, he said: \"That was never in question the entire time. \"The politics don't make it up there when we're making operational decisions. There were a lot of options that were discussed, and the team on the ground... is gigantic, and everyone was working with a singular focus.\" Read more:Stranded astronauts have just returned to a very different world Science and technology editor The life of an astronaut is all about preparation.  And as Butch and Suni faced questions for the first back on Earth time about how their \"stranding\" in space was treated like an orbital political football -  that really shone through. The astronauts looked healthy and relaxed, despite having spent 35 times longer in space than they had expected to. They were happy to answer questions about their safe return, the effects of their extended stay in space on their bodies.  But when it came to politics, the answers were much more guarded. When I asked them about whether politics had made their difficult situation worse, it was quickly picked up, not by the pair themselves, but by astronaut Nick Hague, their mission commander for the ride back to Earth. \"The politics don't make it up there when we're making operational decisions,\" he said.  \"There were a lot of options discussed by the ground team, and everyone worked with singular focus on how do we end the Crew 9 mission at the right time and maintain the safety and the success of the space station mission.\" Their reluctance to address the political questions around the mission is understandable.  They have returned to a NASA bracing itself, like many federally funded organisations, for possible budget cuts and the mercurial decision-making of Donald Trump and his close ally Elon Musk. Both men had suggested it was a political decision by the previous administration not to return them to Earth sooner.  Painting their already scheduled return as a \"rescue mission\" - despite presenting no evidence of the claim it put NASA in an embarrassing position. It has been maintained all along that the plan was for the pair to return to Earth with the next rotation of the space station crew. Which is what subsequently happened.  But in the current political climate, and still awaiting the confirmation of a new leader for NASA's administration, it's giving politics a wide berth. The crew were also asked about how weird it was to return to Earth in the SpaceX capsule - and about the welcome party of dolphins that swam around the vessel after splashdown. \"I can tell you that returning from space to Earth through the atmosphere inside of a 3000-degree fireball of plasma is weird, regardless of how you look at it,\" Mr Wilmore said. \"It's thrilling, it's amazing, I remember thinking about the structure of the capsule,\" as the Dragon Freedom capsule descended at pace toward our planet. \"And then the parachutes open and... it's exhilarating.\" Mr Hague then remarked, \"I had requested dolphins as kind of a joke\". "
    },
    {
        "title": "Ex-GCHQ employee pleads guilty to causing risk to national security",
        "description": "A university student accused of removing top secret information worth millions of pounds while on a work placement with GCHQ has pleaded guilty to causing a serious risk to national security.",
        "url": "https://news.sky.com/story/ex-gchq-employee-pleads-guilty-to-causing-risk-to-national-security-13339410",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hasaan-arshad-gchq_6872354.jpg?20250331172025",
        "type": "Technology",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-03-31 16:13:00",
        "Headline": "Hasaan Arshad, 25, pleaded guilty to an offence under the Computer Misuse Act 1990 after downloading \"top secret\" information while on secondment at GCHQ.",
        "Content": "By Duncan Gardham, security journalist  A university student accused of removing top secret information worth millions of pounds while on a work placement with GCHQ has pleaded guilty to causing a serious risk to national security. While on secondment to the agency, Hasaan Arshad, 25, took his work mobile phone into a top-secret area and connected the device to a workstation. He then transferred sensitive data, containing the names of GCHQ employees, from a secure computer to the phone before taking it home. Arshad, the son of a local councillor from Rochdale, Lancashire, allegedly then transferred the data to his personal home computer. Prosecutors said the data was potentially worth millions of pounds and contained a tool that could have \"put lives at risk\". On the first day of what would have been a three-week-long trial, he pleaded guilty to an offence under the Computer Misuse Act 1990, and admitted to creating a significant risk of serious damage to national security. Suspect discussed 'bug bounty' sale After his arrest in 2022, Arshad gave a prepared statement to officers in which he admitted to removing the data but insisted he had no intention of providing it to someone else. \"I removed the data simply out of curiosity to further develop some of the changes I was unable to complete during the course of my placement,\" he said. \"I had intended to use my developments when I hopefully returned to my previous team. \"I'm sorry for my actions, and I understand the stupidity of what I have done.\" Arshad then told the police he understood \"the potential damage and risk,\" but insisted nobody had seen or had access to the sensitive data. Investigators found after his arrest that he used WhatsApp to discuss \"developed vetting\" in the cyber sector on 26 May 2022. He also mentioned the term \"bug bounty\" - an amount of money paid for providing details of a digital bug to either fix or create a software issue. In the chat, Arshad said: \"You can get like 10k for simple info leaks.\" Read more:Driving test waiting times hit record highPrince Andrew accuser says she has days to liveFinnish president: Trump running out of patience with Putin Prosecuters told a previous hearing the data removed was classified as \"top secret\" - including names of former colleagues whose anonymity was said to be critical to the safety of GCHQ. \"Top secret\" is the classification for the government's most sensitive information, where compromise might cause widespread loss of life or threaten the security or economic well-being of the country or friendly nations, according to Ministry of Justice security guidance. The court also heard the data removed provided a \"tool\" used by GCHQ - said to amount to many thousands of hours of work and a \"significant amount\" of taxpayer money. Prosecutors said that if the tool was compromised, it would \"put lives at risk\". Nina Grahame KC, defending, told the court that the plea had been made on \"on the basis of recklessness as to the damage caused\" rather than intent to cause damage. She added that Arshad was 21 when he began his internship, 22 at the time of the offence, and the defence would submit psychiatric and psychological reports before sentencing in June. He was released on bail and Mrs Justice McGowan ordered a pre-sentence report but warned him \"that does not mean there will not be a custodial sentence.\" Arshad will be sentenced at London's Old Bailey court on 13 June. He will also be sentenced for two offences of making indecent images of children, which he pleaded guilty to in 2023. As part of the investigation into the GCHQ data breach, officers found Arshad had collected 40 \"category A\" images, the worst type, and four \"category B\" images on his Samsung phone."
    },
    {
        "title": "Sir Keir Starmer hosts creators of hit Netflix drama Adolescence - and tells them he's 'not found it easy viewing'",
        "description": "Sir Keir Starmer has met with the creators of Adolescence for talks on how to prevent young boys being dragged into a \"whirlpool of hatred and misogyny\".",
        "url": "https://news.sky.com/story/sir-keir-starmer-hosts-creators-of-hit-netflix-drama-adolescence-and-tells-them-hes-not-found-it-easy-viewing-13339287",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-adolescence-stephen-graham_6862012.jpg?20250331145907",
        "type": "Entertainment",
        "Author": "Faye Brown",
        "Date Published": "2025-03-31 11:58:00",
        "Headline": "Sir Keir Starmer says there is no \"simple solution\" to stop boys from being radicalised online, calling misogyny a \"cultural issue\".",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has met with the creators of Adolescence for talks on how to prevent young boys being dragged into a \"whirlpool of hatred and misogyny\". The prime minister hosted a roundtable in Downing Street with co-writer Jack Thorne and producer Jo Johnson to discuss issues raised in the series, which centres on a 13-year-old boy arrested for the murder of a young girl and the rise of incel culture. Opening the meeting, which was first revealed by Sky News earlier this month, Sir Keir thanked the show's creators for the conversation they have started. Politics Live: UK expecting to get hit by Trump's 'liberation day' tariffs  He said he and his wife had watched the drama with his 14-year-old daughter and 16-year-old son, and that \"as a dad, I have not found it easy viewing\". Sir Keir said the four-part series raises questions about how to keep young people safe from technology. Previously it was thought they were more at risk outside their homes but that's now being \"overtaken by a greater danger, which is what's happening in the home, what's happening in the bedroom, in the places where they're on their own,\" the prime minister said. Read more:How incel culture influenced new Netflix show He referred to real-life cases such as that of Kyle Clifford, the crossbow killer who watched misogynistic content before he murdered his ex-girlfriend and her mother and sister. This type of violence against women \"isn't new\" but Adolescence shows it has taken \"different characteristics\", Sir Keir added. 'No simple solution' The meeting came as the government announced Netflix had made the show free to watch in all secondary schools across the country to help pupils understand \"the impact of misogyny, dangers of online radicalisation and the importance of healthy relationships\". Sir Keir said there is \"no simple solution\" or \"policy lever to be pulled\", describing misogyny as \"almost a cultural issue\". He said the aim of the round table was to discuss \"what can we do as a society to stop and prevent young boys being dragged into this whirlpool of hatred and misogyny\". 'Brilliant meeting' Speaking after the round table, Thorne told Sky News' arts and entertainment correspondent Katie Spencer it was a \"brilliant meeting\", with young people, charities, and representatives from Netflix also present. \"There needs to be more dialogue with people cleverer than me, that's the big solution to this problem,\" he said. \"It's about putting money in, having conversations, creating an environment which is safer for our young people.\" 👉 Listen to Sky News Daily on your podcast app 👈 Adolescence topped the charts amid mounting concern over violent and sexist social media content being served up to teenagers, and calls for the government to get tough on tech firms. Ministers have faced calls from MPs to take radical action such as raising the age of consent to use social media from 13 to 16 - something Thorne has previously backed."
    }
]