[
    {
        "title": "Andy Burnham opens door to Commons return and will seek to stand in by-election",
        "description": "Andy Burnham has said he has sought permission to enter the selection process to run as a candidate for the Labour Party in the upcoming Gorton and Denton by-election.",
        "url": "https://news.sky.com/story/andy-burnham-opens-door-to-commons-return-and-will-seek-to-stand-in-by-election-13498291",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-andy-burnham_7144964.jpg?20260124235101",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 09:30:00",
        "Headline": "Mr Burnham says the decision has been \"difficult\" but insists he will support the work of the government, \"not undermine it\". ",
        "Content": "Andy Burnham has said he has sought permission to enter the selection process to run as a candidate for the Labour Party in the upcoming Gorton and Denton by-election. The Greater Manchester mayor said on X: \"I have today written to the Chair of Labour's National Executive Committee seeking permission to enter the selection process for a candidate for the forthcoming Gorton and Denton by-election.\" It comes after former minister Andrew Gwynne formally stepped down on Friday on health grounds. As a directly-elected mayor, Mr Burnham needs to get approval from Labour's ruling national executive committee (NEC) before entering the race to be the party's candidate. In his letter to the NEC, which he shared on social media, Mr Burnham said the decision had been \"difficult\" but insisted he would support the work of the government \"not undermine it\" and that he had \"passed on this assurance to the Prime Minister\". Mr Burnham claimed there was now \"a direct threat to everything Greater Manchester has always been about from a brand of politics which seeks to pit people against each other\". He added: \"I see this by-election as the front line of that fight for the Manchester way and I feel I owe it to a city which has given me so much to lead it from the front, despite the risks involved.\" \n                  Andy Burnham facing 24-hour ultimatum over his Labour future\n                 \n                  Andy Burnham, next PM? The big hurdle facing popular mayor\n                 \n                  Unison leadership result shows Starmer's grip on Labour machine is slipping\n                 If elected, Mr Burnham would be required by law to stand down as mayor of Greater Manchester, which would then trigger a by-election for that role. If he became an MP, he could mount a leadership challenge against Sir Keir Starmer. However, the NEC can still block his bid for selection by refusing permission, and supporters of Sir Keir are reported to be mobilising to prevent him from becoming a candidate. Political correspondent Andy Burnham's bid to return to Westminster poses a massive political dilemma for the Labour Party leadership. Blocking the so-called 'King in the North', would cause outrage among the wing of the party already prone to rebelling against Sir Keir Starmer – and give grist to the mill of a Conservative Party that already delights in describing the PM as \"weak\".  The NEC might justify that decision by arguing that calling a mayoral by-election after just two years in office is fraught with political risk – not to mention expense. Reform are on the march. There is no guarantee his Labour successor would win.  Enabling a route back to parliament for a popular politician who's been incredibly open about his leadership ambitions, and his critique of the PM, may seem naïve. Loyal Labour MPs argue the constant leadership speculation which would follow Burnham's installation in parliament would be a self-inflicted psychodrama, an unnecessary distraction for a government already struggling to make headway with a weary public.   Burnham has told the NEC he wants to support the government, not undermine it. But circumstances change. And if he's installed in the Commons ahead of a disastrous set of election results in May – there are many who might look to him for leadership.   For now Mr Burnham's thrown down the gauntlet to the NEC - daring it to deny his request.\n Of course, even if it decides to put him on the shortlist he'd still need to be picked by local party members - and then he'd have to actually win the by-election. But he's decided the gamble is worth it. \n But several senior Labour figures have called for Mr Burnham to be allowed to stand, with the party's deputy leader, Lucy Powell, saying the decision should be up to local party members. London mayor Sir Sadiq Khan said: \"I think if Andy Burnham wants to be a member of Parliament, Andy Burnham should be allowed to be a member of Parliament.\" Ed Miliband, the energy secretary, said Mr Burnham would be \"a massive asset\" in parliament, and hoped the Gorton and Denton party members would have \"the option\" of selecting him as a candidate. Read more from Sky News:Trump pays tribute to UK soldiers after Afghanistan remarks rowIran warns any attack will mean 'all-out war' The timetable for the Gorton and Denton by-election is short. The deadline for applicants to put their name forward is midnight on Sunday, with a longlist of candidates set to be drawn up by a selection panel on Monday. Shortlisting interviews will be held on Tuesday before hustings and selection will take place next Saturday. Mr Burnham lost two previous Labour leadership challenges - against Mr Miliband in 2010 and Jeremy Corbyn in 2015."
    },
    {
        "title": "Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks",
        "description": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline.",
        "url": "https://news.sky.com/story/trump-pays-tribute-to-very-brave-british-soldiers-who-served-in-afghanistan-13498256",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-afghanistan-britain_7143139.jpg?20260122233853",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 06:46:00",
        "Headline": "Mr Trump made his original comments at the World Economic Forum earlier this week as he questioned if NATO would \"be there if we ever needed them\".",
        "Content": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline. He said Britons \"were among the greatest of all warriors\" as he acknowledged the 457 who died and many \"badly injured\". \"The GREAT and very BRAVE soldiers of the United Kingdom will always be with the United States of America!\" Mr Trump wrote on Truth Social. \"It's a bond too strong to ever be broken,\" the president added. \"The U.K. Military, with tremendous Heart and Soul, is second to none (except for the U.S.A.!). We love you all, and always will!\" President Trump's post comes after he falsely claimed NATO troops in Afghanistan had \"stayed a little back, a little off the frontlines\". Sir Keir Starmer had called the remarks \"insulting and frankly appalling\", while Prince Harry also defended the bravery of UK troops. \n                  Angry Sir Keir Starmer loses patience with Donald Trump over 'insulting' NATO troops remarks\n                 \n                  'Sacrifices deserve respect': Prince Harry joins PM in criticising Trump's NATO troops remark\n                 \n                  British troops were in Afghanistan from start to finish - despite what Trump says\n                 The prince - who served two tours of Afghanistan - said British \"sacrifices deserve to be spoken about truthfully and with respect\". Downing Street said Sir Keir had spoken to Mr Trump shortly before the president's social media post on Saturday. \"The prime minister raised the brave and heroic British and American soldiers who fought side by side in Afghanistan, many of whom never returned home. We must never forget their sacrifice,\" said a statement. Mr Trump made his original comments to Fox News at the World Economic Forum earlier this week, as he questioned if NATO would \"be there if we ever needed them\". \"We've never needed them,\" the US president said. \"They'll say they sent some troops to Afghanistan… and they did, they stayed a little back, a little off the frontlines.\" Read more:UK troops were there from start to finish - despite what Trump says Criticism from UK veterans, their families, and politicians was swift and severe. Al Carns, the armed forces minister, who was with the Royal Marines in Afghanistan, called the claims \"utterly ridiculous\". Tory MP Ben Obese-Jecty, who served there with the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". Diane Dernie, whose son Ben Parkinson suffered horrific injuries in Afghanistan, called the comments \"the ultimate insult\" and urged the prime minister to stand up to Mr Trump. The president's U-turn was welcomed by Conservative Party leader Kemi Badenoch. \"I'm pleased President Trump has now acknowledged the role of the British armed forces and those brave men and women who gave their lives fighting alongside the US and our allies,\" she wrote on X. \"It should never have been questioned in the first place.\" Over 1,000 non-US NATO troops died in Afghanistan and at least double that number were seriously wounded. At 457, the UK had the second-highest number of military deaths during the near 20-year campaign. The US suffered 2,461 deaths. The American-led invasion came shortly after 9/11 as it invoked NATO's Article 5 clause that an attack against one member is an attack on all. President Trump has been a frequent critic of NATO, saying the alliance is too reliant on US power and urging members to increase their defence spending."
    },
    {
        "title": "National Police Service: New 'British FBI' to fight serious crime and help local police tackle everyday offences",
        "description": "A \"British FBI\" will be created to fight the most serious crime and help local police forces focus on tackling everyday offences.",
        "url": "https://news.sky.com/story/national-police-service-new-british-fbi-to-fight-serious-crime-and-help-local-police-tackle-everyday-offences-13498076",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shabana-mahmood-with-police-policing_7144966.jpg?20260124235443",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 22:29:00",
        "Headline": "The National Police Service will be responsible for rolling out tech to all local forces - including facial recognition.",
        "Content": "A \"British FBI\" will be created to fight the most serious crime and help local police forces focus on tackling everyday offences. The National Police Service (NPS) will be established in England and Wales to tackle crimes such as terrorism, fraud and organised crime that are not constrained by areas, the home secretary will announce on Sunday. Shabana Mahmood will say the NPS will attract \"world-class talent\" and use \"state-of-the-art\" technology - although a start date has not been revealed. The NPS will be in charge of purchasing new tech and equipment for all forces - and will include a nationwide roll-out of facial recognition tech, which has seen London's Metropolitan Police arrest more than 1,700 suspects in two years. It will also bring the National Crime Agency, counter-terrorism policing, regional organised crime units, police helicopters and national road policing under a single organisation. Currently, different forces are responsible for those sections of national policing. A national police commissioner will be appointed to lead the NPS, making them the most senior police officer in the country. The home secretary said: \"The current policing model was built for a different century. \"Some local forces lack the skills or resources they need to fight complex modern crime such as fraud, online child abuse or organised criminal gangs. \"We will create a new National Police Service - dubbed 'the British FBI' - deploying world-class talent and state-of-the-art technology to track down and catch dangerous criminals. \"In doing so, local forces will be able to spend more time fighting crime in their communities.\" Read more: Out of date policing needs 'overdue' shake up, says Met Police chief One of the main aims is to boost the 43 local forces' ability to spend more time fighting crime in their communities, such as shoplifting, drug dealing, phone theft and anti-social behaviour. The Home Office said the NPS will make sure the public receives the same service from the police, no matter where they live. The new force will also set professional standards and training requirements for policing, so every officer in the country is subject to the same standards. In a bid to be more accountable to the public, local forces will have new targets on 999 response times, victim satisfaction, public trust and confidence. They will be published, and forces will be graded for comparison. As policing in Scotland and Northern Ireland is devolved, the NPS will only cover England and Wales. The announcement comes ahead of Ms Mahmood announcing plans which the government has said will be the largest reforms to policing since the police service was founded 200 years ago. She is expected to outline reforms that mean local forces protect their community, and national policing protects everyone. Watch the interview with Ms Mahmood on Sunday Morning With Trevor Phillips from 8.30am on Sky News."
    },
    {
        "title": "'Barbaric' attack during Ukraine peace talks but Zelenskyy says negotiations could resume next week",
        "description": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said.",
        "url": "https://news.sky.com/story/barbaric-attack-on-ukraines-largest-cities-during-peace-talks-further-negotiations-expected-as-early-as-next-week-13498413",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-russia-ukraine_7144299.jpg?20260124135448",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 14:43:00",
        "Headline": "Russia launched a \"cynical\" and \"barbaric\" attack on Ukraine's two largest cities, cutting power to 1.2 million buildings nationwide, as a second day of peace talks took place in Abu Dhabi.",
        "Content": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said. Negotiations took place in Abu Dhabi on Friday and Saturday, and were described as \"productive\" and \"constructive\" by Washington and Mr Zelenskyy respectively. \"The central focus of the discussions was the possible parameters for ending the war,\" President Zelenskyy wrote on X after the meeting. More talks are expected in Abu Dhabi next Sunday, according to a US official who spoke anonymously to Reuters. \"We got to real granular detail and (we feel) that next Sunday will be, God willing, another meeting where we push this deal towards its final culmination,\" they said. Sky correspondent Sally Lockwood said officials had reported \"unexpected chemistry\" between the two sides and that the atmosphere \"surpassed expectations\". A UAE government spokesman suggested a meeting between Mr Zelenskyy, President Putin - and possibly President Trump - did not seem too far away. \n                  Ukraine hits out at Winter Paralympics for lifting ban on Russia\n                 \n                  How close is a peace deal in Ukraine - and have we been here before?\n                 \n                  Russia to join peace talks with Ukraine and US for first time\n                 Despite the positive reports, the talks didn't stop Moscow raining down hundreds of missiles and drones on Ukraine's two largest cities, Kyiv and Kharkiv, early on Saturday morning. \"This barbaric attack once again proves that ​Putin's place is not at [Donald Trump's] Board of Peace, but in the dock of the special ​tribunal,\" said Ukrainian foreign minister Andrii Sybiha. Some 1.2 million buildings were left without power nationwide, while temperatures plummeted to -13C (8.6F) in the capital. Military analyst Professor Michael Clarke said the strikes were timed to influence the talks by attempting to convince the White House that the Russian army was unstoppable. One person was killed in the attack and 31 people were injured. Footage showed firefighters scrambling to tackle flames ignited by the strikes. Sky correspondent When the second day of talks ended in the UAE late on Saturday afternoon, there was a sense the negotiations may have broken down — or, at best, reached a deadlock. But more detail has since emerged from US officials about what happened behind closed doors. The Russian and Ukrainian delegations were described as \"respectful\" — and even had lunch together. According to officials briefed on the talks, the atmosphere between these sworn enemies surpassed expectations. It was described as positive, with the two sides showing unexpected chemistry as they worked to find solutions. It's a jarring contrast to developments overnight, when Ukraine's two largest cities were hit by a barrage of missiles and drones.  A maternity hospital and a shelter for displaced people were among the buildings struck, while around a million Ukrainians are without power after attacks on energy infrastructure. \"There’s been a lot of carnage. A lot of killing. But there was respect,\" one US official said during a press briefing organised by the White House. We now know the Americans have been working to arrange this meeting for the past six weeks. A meeting between Donald Trump and President Zelenskyy in Davos is said to have helped set the stage for the talks in Abu Dhabi. US officials say both Zelenskyy and Vladimir Putin were sufficiently encouraged by the progress to send negotiating teams to the UAE. Not only are all three parties expected to return to Abu Dhabi next Sunday to resume talks, but the idea of a bilateral meeting between presidents Zelenskyy and Putin is said to be \"very close\".  US officials say we could soon see delegations meeting in Russia — or even Russians travelling to Kyiv. \"Targeting civilians and civilian infrastructure is a clear breach of the rules of warfare,\" UN human rights chief Volker Turk said. Despite images showing damage to apartments, the Russian defence ministry claimed it targeted Ukrainian military and industrial installations as well as energy and transport infrastructure used by the armed forces. The Ukrainian negotiating team's main task in Abu Dhabi was to convey how relentless Russian strikes were undermining diplomacy, Mr Zelenskyy said. For its part, the Kremlin continued to demand Mr Zelenskyy give up all the land Russian soldiers have occupied by force, plus the rest of the eastern Donbas region. Ukraine shows little appetite to concede - and nor do its citizens, according to polls. Russia even floated the idea of using the bulk of nearly $5bn (£3.66bn) in Russian assets frozen in the US to fund rebuilding the cities it has destroyed in the Donbas. Mr Zelenskyy dismissed it as \"nonsense\"."
    },
    {
        "title": "Iran warns any attack will mean 'all-out war' after Trump says US 'armada' on its way",
        "description": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region.",
        "url": "https://news.sky.com/story/iran-warns-any-attack-will-mean-all-out-war-after-trump-says-us-armada-on-its-way-13498251",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-uss-abraham-lincoln_7144024.jpg?20260124013655",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 01:13:00",
        "Headline": "Donald Trump said on Thursday that the US had an \"armada\" heading toward Iran but hoped he would not have to use it.",
        "Content": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region. The warning and surge in US military presence comes almost two weeks after Donald Trump urged Iranian protesters - thousands of whom have been killed by the regime's forces - to keep demonstrating and promised that \"help is on the way\". \"This military ‌build-up - we hope it is ‌not intended for real confrontation - but our military is ready for the worst-case scenario. This is why everything is on high alert in Iran,\" said the Iranian official, speaking ‌to Reuters on condition of ⁠anonymity. The official went on to say: \"This time we will treat any attack - limited, unlimited, surgical, kinetic, whatever they call it - as an all-out war against us, and we will respond in the hardest way possible to settle this.\" Mr Trump said on Thursday that the US had an \"armada\" heading toward Iran but hoped he would not have to use it, as he renewed warnings to Tehran against killing protesters or restarting its nuclear programme. \"If the Americans violate Iran's sovereignty and territorial integrity, we will respond,\" said the Iranian official. He declined to specify ‌what an Iranian response might look like. \n                  'He was bleeding for 40 minutes, gasping for life': The dying moments of an aspiring Iranian rapper\n                 \n                  Hackers target Iranian state TV as exiled crown prince tells military to 'join the people'\n                 \n                  Rapper describes 'massacre' on Iran's streets - as supreme leader says thousands killed in protests\n                 Read more from Sky News:How close is a peace deal in Ukraine?Special relationship turns toxic after NATO troop comments The US military has periodically sent additional forces to the Middle East at times of heightened tension, moves often seen as defensive. However, the US military staged a major build-up last year ahead of its launching airstrikes against Iran's nuclear programme in June. Another build-up was seen in the Caribbean towards the end of last year before the US launched military action against Venezuela and captured the country's president Nicolas Maduro. 'Iran may try again to obtain nuclear weapon' Meanwhile, the Pentagon has published a new national defence strategy, which included analysis on Iran. The document warned Iran may attempt to obtain a nuclear weapon, something it has accused Tehran's leaders of attempting before. The document also said Iran had \"the blood of Americans on its hands\" and pledged US support for Israel. It read: \"Although Iran has suffered severe setbacks over recent months, it appears intent on reconstituting its conventional military forces. \"Iran's leaders have also left open the possibility that they will try again to obtain a nuclear weapon, including by refusing to engage in meaningful negotiations.\" It added: \"Nor can we ignore the facts that the Iranian regime has the blood of Americans on its hands.\" The document stated Iran \"remains intent on destroying our close ally Israel, and that Iran and its proxies routinely instigate regional crises that not only threaten the lives of American servicemembers in the region but also prevent the region itself from pursuing the kind of peaceful and prosperous future that so many of its leaders and peoples clearly wish for\"."
    },
    {
        "title": "Trump threatens Canada with 100% tariff over China trade deal",
        "description": "Donald Trump has threatened to impose a 100% tariff on goods imported from Canada over its proposed trade deal with China. ",
        "url": "https://news.sky.com/story/trump-threatens-canada-with-100-tariff-over-china-trade-deal-13498417",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-tariffs-canada_7060975.jpg?20251024211416",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 15:05:00",
        "Headline": "The US president took to social media to warn prime minister Mark Carney \"China will eat Canada alive\". ",
        "Content": "Donald Trump has threatened to impose a 100% tariff on goods imported from Canada over its proposed trade deal with China.  Canada negotiated an agreement to lower tariffs on Chinese electric vehicles in return for lower import taxes on Canadian farm products earlier this month. The US president initially said it was what Canadian prime minister Mark Carney \"should be doing and it's a good thing for him to sign a trade deal\". But in a post on Mr Trump's Truth social media platform on Saturday, he said if Mr Carney \"thinks he is going to make Canada a 'Drop Off Port' for China to send goods and products into the United States, he is sorely mistaken\". \"China will eat Canada alive, completely devour it, including the destruction of their businesses, social fabric, and general way of life,\" he said. \"If Canada makes a deal with China, it will immediately be hit with a 100% Tariff against all Canadian goods and products coming into the USA.\" Mr Trump also referred to Canada's leader as \"Governor Carney\", a continuation of the nickname he used for predecessor Justin Trudeau, in a further sign of their deteriorating relationship. \n                  Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks\n                 \n                  China no longer America's top defence priority, Pentagon says\n                 \n                  Tories claim government in retreat on Chagos 'surrender' after Donald Trump broadside\n                 Carney has not yet reached a deal with Mr Trump to reduce some of the tariffs that he has already imposed on key sectors of the Canadian economy. But Canada has been protected by the heaviest impact of the tariffs by the Canada-US-Mexico Agreement, which is up for a review this year. The tariff threat came amid an escalating war of words with Mr Carney as the US president's push to acquire Greenland strained the NATO alliance. Read more from Sky News:Should Trump be given more time with King?Iran warns any attack will mean 'all-out war' Mr Carney, the former Bank of England governor, called for a new alliance to face down American and Chinese belligerence at a speech in Davos, Switzerland, this week. When Mr Trump took to the stage, he said that \"Canada lives because of the United States\" before the Canadian PM said his country can be an example that the world does not have to bend toward autocratic tendencies. Mr Trump later revoked his invitation to Mr Carney to join his \"Board of Peace\", an idea first proposed when he announced his plan to end the war in Gaza, but which now has designs to tackle other global conflicts. Earlier this week, Mr Trump posted on social media an altered image showing a map of the United States that included Canada, Venezuela, Greenland and Cuba as part of its territory."
    },
    {
        "title": "Part of Teignmouth Grand Pier in Devon washed away during Storm Ingrid",
        "description": "Part of a historic pier in Devon has been washed away during Storm Ingrid.",
        "url": "https://news.sky.com/story/part-of-teignmouth-grand-pier-in-devon-washed-away-during-storm-ingrid-13498323",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-teignmouth-storm_7144907.jpg?20260124211949",
        "type": "Home",
        "Author": "David Rivers, news reporter",
        "Date Published": "2026-01-24 11:45:00",
        "Headline": "The Met Office has issued yellow weather warnings for heavy rainfall in Devon, Cornwall and parts of Scotland, with flooding and travel disruption likely.",
        "Content": "By David Rivers, news reporter  Part of a historic pier in Devon has been washed away during Storm Ingrid. Images showed Teignmouth Grand Pier, built in 1865, missing a huge chunk. It comes after the Met Office issued yellow weather warnings for rain across Devon, Cornwall and parts of Scotland, with flooding and travel disruption likely. Check out the weather forecast in your area Forecasters have warned of heavy rainfall on Saturday in an alert running from 2am to 10pm and covering large parts of southwest England and south Wales. There is also another Met Office yellow warning for rain covering a similar area from 6pm on Monday to 2pm on Tuesday. Teignmouth mayor, Councillor Cate Williams, said the pier was already in poor condition. She told Sky News: \"It goes out for a bit and then effectively there is a portion of it that has just washed away, dissolved, and then you have another little bit of the structure that is still standing. \"The pier was built in the 1860s. It has been through a bit of wear and tear, it's had storm damage before and been through wars. \"There is a family who own the pier and have done so for multi generations. But the pier itself is a focus of our community, it's right there on the front from our boardwalk. \"The arcade aspect to it, the games, are used by residents and visitors of all ages, so it's a really important feature. It stands out. \"As we know at seaside resorts, those with piers are very few and far between so the fact we have it here is something that we appreciate and enjoy.\" Read more:Warning of floods as heavy rain soaks parts of UKTemperatures could plunge again bringing chance of snow Ms Williams added that councillors do not have the power to immediately renovate it as it is privately owned. On Saturday morning, Great Western Railway urged people not to travel between Exeter St Davids and Newton Abbot as lines will be suspended. On its website, the company said disruption would be expected until 7pm on Saturday following severe weather impacting the Dawlish sea wall. Later in the day, the line between Par and Newquay was closed with disruption expected until 5pm. Elsewhere, the Met Office warned parts of northeast Scotland could face further flooding and travel disruption after a yellow warning was issued running from 0001 on Saturday until 9am on Sunday. It covers the Grampian, Angus and Perth regions. On Saturday morning, the Scottish Environment Protection Agency had 11 flood warnings and four flood alerts active. Also, yellow warnings for rain have been issued by the Met Office for Northern Ireland from 6pm on Saturday to 9am on Sunday, and from 6am to 3pm on Tuesday."
    },
    {
        "title": "Djokovic apologises after ball nearly hits ball girl during history-making win at Australian Open",
        "description": "Novak Djokovic has apologised after almost hitting a ball girl with the ball during his history-making Australian Open third-round match on Saturday.&#160;",
        "url": "https://news.sky.com/story/djokovic-apologises-after-ball-nearly-hits-ball-girl-during-history-making-win-at-australian-open-13498431",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-novak-djokovic-tennis_7144447.jpg?20260124153835",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-24 15:23:00",
        "Headline": "The 38-year-old said the incident happened \"in the heat of the moment\" during his third-round victory on Saturday. ",
        "Content": "Novak Djokovic has apologised after almost hitting a ball girl with the ball during his history-making Australian Open third-round match on Saturday.  Djokovic, a 24-time Grand Slam champion, recorded a 6-3 6-4 7-6 (7-4) victory over Dutchman Botic van de Zandschulp at Melbourne Park to become the first player ever to reach 400 singles wins at the Grand Slams and equal Roger Federer's record of 102 victories at the year's first major. However, in an apparent moment of frustration, the 38-year-old Serbian star sent a forehand shot that narrowly missed the head of a ball girl crouching close to the net. Djokovic, who was disqualified from the US Open in 2020 after hitting a line judge with a ball, later apologised, saying the incident happened \"in the heat of the moment\". \"I apologise for that,\" he said. \"That was not necessary and in the heat of the moment. \"I was lucky there, and I'm sorry for causing any distress to the ball kid or anybody.\" \n                  Gunman at large in Lake Cargelligo, Australia, after three people shot dead \n                 \n                  Surfer 'lucky to survive' Sydney's fourth shark attack in three days\n                 \n                  Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting\n                 Djokovic has won 10 Australian Open men's singles titles in his career and is going in search of what would be a record 25th Grand Slam triumph.He is yet to drop a set at the 2026 tournament, but his win over Van de Zandschulp, who won the last meeting between the two in Indian Wells last year, was far from straight-forward. The Serbian sparked concerns when he fell clutching his right ankle during the third game of the third set, although the subsequent visit he received from the trainer was to treat a blister.He then saved two set points at 5-6 in the third set, entering into his latest battle with the Melbourne crowd over noise during points, putting his finger to his lips on several occasions and cupping his hand to his ear when he made it across the line.After the match, Djokovic said: \"I relaxed a little bit too much and was in trouble closing out the second set, and pretty much from that moment onwards it was anybody's game. Read more from Sky News:Boy dies after shark attack in Sydney HarbourEight dead and more than 80 missing after Indonesia landslide\"I was really lucky to get out of the set point in the third. Just glad to overcome it in straights.\"It's been a great start to the tournament,\" he added, saying: \"I'm still trying to give these young guys a push for their money.\"He dismissed any concerns over his ankle, saying: \"Thankfully I managed to have a good fall. Things could have been very ugly.\" When asked if he had any advice for his younger self, Djokovic said: \"Calm down, you jerk. \"It's true. I am too stressed on the court very often and too much tension at times. I think I would say the patience is a big one.\""
    },
    {
        "title": "National Police Service: New 'British FBI' to fight serious crime and help local police tackle everyday offences",
        "description": "A \"British FBI\" will be created to fight the most serious crime and help local police forces focus on tackling everyday offences.",
        "url": "https://news.sky.com/story/national-police-service-new-british-fbi-to-fight-serious-crime-and-help-local-police-tackle-everyday-offences-13498076",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shabana-mahmood-with-police-policing_7144966.jpg?20260124235443",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-24 22:29:00",
        "Headline": "The National Police Service will be responsible for rolling out tech to all local forces - including facial recognition.",
        "Content": "A \"British FBI\" will be created to fight the most serious crime and help local police forces focus on tackling everyday offences. The National Police Service (NPS) will be established in England and Wales to tackle crimes such as terrorism, fraud and organised crime that are not constrained by areas, the home secretary will announce on Sunday. Shabana Mahmood will say the NPS will attract \"world-class talent\" and use \"state-of-the-art\" technology - although a start date has not been revealed. The NPS will be in charge of purchasing new tech and equipment for all forces - and will include a nationwide roll-out of facial recognition tech, which has seen London's Metropolitan Police arrest more than 1,700 suspects in two years. It will also bring the National Crime Agency, counter-terrorism policing, regional organised crime units, police helicopters and national road policing under a single organisation. Currently, different forces are responsible for those sections of national policing. A national police commissioner will be appointed to lead the NPS, making them the most senior police officer in the country. The home secretary said: \"The current policing model was built for a different century. \"Some local forces lack the skills or resources they need to fight complex modern crime such as fraud, online child abuse or organised criminal gangs. \"We will create a new National Police Service - dubbed 'the British FBI' - deploying world-class talent and state-of-the-art technology to track down and catch dangerous criminals. \"In doing so, local forces will be able to spend more time fighting crime in their communities.\" Read more: Out of date policing needs 'overdue' shake up, says Met Police chief One of the main aims is to boost the 43 local forces' ability to spend more time fighting crime in their communities, such as shoplifting, drug dealing, phone theft and anti-social behaviour. The Home Office said the NPS will make sure the public receives the same service from the police, no matter where they live. The new force will also set professional standards and training requirements for policing, so every officer in the country is subject to the same standards. In a bid to be more accountable to the public, local forces will have new targets on 999 response times, victim satisfaction, public trust and confidence. They will be published, and forces will be graded for comparison. As policing in Scotland and Northern Ireland is devolved, the NPS will only cover England and Wales. The announcement comes ahead of Ms Mahmood announcing plans which the government has said will be the largest reforms to policing since the police service was founded 200 years ago. She is expected to outline reforms that mean local forces protect their community, and national policing protects everyone. Watch the interview with Ms Mahmood on Sunday Morning With Trevor Phillips from 8.30am on Sky News."
    },
    {
        "title": "Andy Burnham opens door to Commons return and will seek to stand in by-election",
        "description": "Andy Burnham has said he has sought permission to enter the selection process to run as a candidate for the Labour Party in the upcoming Gorton and Denton by-election.",
        "url": "https://news.sky.com/story/andy-burnham-opens-door-to-commons-return-and-will-seek-to-stand-in-by-election-13498291",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-andy-burnham_7144964.jpg?20260124235101",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-24 09:30:00",
        "Headline": "Mr Burnham says the decision has been \"difficult\" but insists he will support the work of the government, \"not undermine it\". ",
        "Content": "Andy Burnham has said he has sought permission to enter the selection process to run as a candidate for the Labour Party in the upcoming Gorton and Denton by-election. The Greater Manchester mayor said on X: \"I have today written to the Chair of Labour's National Executive Committee seeking permission to enter the selection process for a candidate for the forthcoming Gorton and Denton by-election.\" It comes after former minister Andrew Gwynne formally stepped down on Friday on health grounds. As a directly-elected mayor, Mr Burnham needs to get approval from Labour's ruling national executive committee (NEC) before entering the race to be the party's candidate. In his letter to the NEC, which he shared on social media, Mr Burnham said the decision had been \"difficult\" but insisted he would support the work of the government \"not undermine it\" and that he had \"passed on this assurance to the Prime Minister\". Mr Burnham claimed there was now \"a direct threat to everything Greater Manchester has always been about from a brand of politics which seeks to pit people against each other\". He added: \"I see this by-election as the front line of that fight for the Manchester way and I feel I owe it to a city which has given me so much to lead it from the front, despite the risks involved.\" \n                  Andy Burnham facing 24-hour ultimatum over his Labour future\n                 \n                  Andy Burnham, next PM? The big hurdle facing popular mayor\n                 \n                  Unison leadership result shows Starmer's grip on Labour machine is slipping\n                 If elected, Mr Burnham would be required by law to stand down as mayor of Greater Manchester, which would then trigger a by-election for that role. If he became an MP, he could mount a leadership challenge against Sir Keir Starmer. However, the NEC can still block his bid for selection by refusing permission, and supporters of Sir Keir are reported to be mobilising to prevent him from becoming a candidate. Political correspondent Andy Burnham's bid to return to Westminster poses a massive political dilemma for the Labour Party leadership. Blocking the so-called 'King in the North', would cause outrage among the wing of the party already prone to rebelling against Sir Keir Starmer – and give grist to the mill of a Conservative Party that already delights in describing the PM as \"weak\".  The NEC might justify that decision by arguing that calling a mayoral by-election after just two years in office is fraught with political risk – not to mention expense. Reform are on the march. There is no guarantee his Labour successor would win.  Enabling a route back to parliament for a popular politician who's been incredibly open about his leadership ambitions, and his critique of the PM, may seem naïve. Loyal Labour MPs argue the constant leadership speculation which would follow Burnham's installation in parliament would be a self-inflicted psychodrama, an unnecessary distraction for a government already struggling to make headway with a weary public.   Burnham has told the NEC he wants to support the government, not undermine it. But circumstances change. And if he's installed in the Commons ahead of a disastrous set of election results in May – there are many who might look to him for leadership.   For now Mr Burnham's thrown down the gauntlet to the NEC - daring it to deny his request.\n Of course, even if it decides to put him on the shortlist he'd still need to be picked by local party members - and then he'd have to actually win the by-election. But he's decided the gamble is worth it. \n But several senior Labour figures have called for Mr Burnham to be allowed to stand, with the party's deputy leader, Lucy Powell, saying the decision should be up to local party members. London mayor Sir Sadiq Khan said: \"I think if Andy Burnham wants to be a member of Parliament, Andy Burnham should be allowed to be a member of Parliament.\" Ed Miliband, the energy secretary, said Mr Burnham would be \"a massive asset\" in parliament, and hoped the Gorton and Denton party members would have \"the option\" of selecting him as a candidate. Read more from Sky News:Trump pays tribute to UK soldiers after Afghanistan remarks rowIran warns any attack will mean 'all-out war' The timetable for the Gorton and Denton by-election is short. The deadline for applicants to put their name forward is midnight on Sunday, with a longlist of candidates set to be drawn up by a selection panel on Monday. Shortlisting interviews will be held on Tuesday before hustings and selection will take place next Saturday. Mr Burnham lost two previous Labour leadership challenges - against Mr Miliband in 2010 and Jeremy Corbyn in 2015."
    },
    {
        "title": "Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks",
        "description": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline.",
        "url": "https://news.sky.com/story/trump-pays-tribute-to-very-brave-british-soldiers-who-served-in-afghanistan-13498256",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-afghanistan-britain_7143139.jpg?20260122233853",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-24 06:46:00",
        "Headline": "Mr Trump made his original comments at the World Economic Forum earlier this week as he questioned if NATO would \"be there if we ever needed them\".",
        "Content": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline. He said Britons \"were among the greatest of all warriors\" as he acknowledged the 457 who died and many \"badly injured\". \"The GREAT and very BRAVE soldiers of the United Kingdom will always be with the United States of America!\" Mr Trump wrote on Truth Social. \"It's a bond too strong to ever be broken,\" the president added. \"The U.K. Military, with tremendous Heart and Soul, is second to none (except for the U.S.A.!). We love you all, and always will!\" President Trump's post comes after he falsely claimed NATO troops in Afghanistan had \"stayed a little back, a little off the frontlines\". Sir Keir Starmer had called the remarks \"insulting and frankly appalling\", while Prince Harry also defended the bravery of UK troops. \n                  Angry Sir Keir Starmer loses patience with Donald Trump over 'insulting' NATO troops remarks\n                 \n                  'Sacrifices deserve respect': Prince Harry joins PM in criticising Trump's NATO troops remark\n                 \n                  British troops were in Afghanistan from start to finish - despite what Trump says\n                 The prince - who served two tours of Afghanistan - said British \"sacrifices deserve to be spoken about truthfully and with respect\". Downing Street said Sir Keir had spoken to Mr Trump shortly before the president's social media post on Saturday. \"The prime minister raised the brave and heroic British and American soldiers who fought side by side in Afghanistan, many of whom never returned home. We must never forget their sacrifice,\" said a statement. Mr Trump made his original comments to Fox News at the World Economic Forum earlier this week, as he questioned if NATO would \"be there if we ever needed them\". \"We've never needed them,\" the US president said. \"They'll say they sent some troops to Afghanistan… and they did, they stayed a little back, a little off the frontlines.\" Read more:UK troops were there from start to finish - despite what Trump says Criticism from UK veterans, their families, and politicians was swift and severe. Al Carns, the armed forces minister, who was with the Royal Marines in Afghanistan, called the claims \"utterly ridiculous\". Tory MP Ben Obese-Jecty, who served there with the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". Diane Dernie, whose son Ben Parkinson suffered horrific injuries in Afghanistan, called the comments \"the ultimate insult\" and urged the prime minister to stand up to Mr Trump. The president's U-turn was welcomed by Conservative Party leader Kemi Badenoch. \"I'm pleased President Trump has now acknowledged the role of the British armed forces and those brave men and women who gave their lives fighting alongside the US and our allies,\" she wrote on X. \"It should never have been questioned in the first place.\" Over 1,000 non-US NATO troops died in Afghanistan and at least double that number were seriously wounded. At 457, the UK had the second-highest number of military deaths during the near 20-year campaign. The US suffered 2,461 deaths. The American-led invasion came shortly after 9/11 as it invoked NATO's Article 5 clause that an attack against one member is an attack on all. President Trump has been a frequent critic of NATO, saying the alliance is too reliant on US power and urging members to increase their defence spending."
    },
    {
        "title": "'Real possibility' May elections could lead to break up of UK, says Wales' First Minister Eluned Morgan",
        "description": "The first minister of Wales has said May's local elections could have \"profound implications\" and there's \"a real possibility\" they could set a path towards the break up of the UK.",
        "url": "https://news.sky.com/story/real-possibility-may-elections-could-lead-to-break-up-of-uk-says-wales-first-minister-eluned-morgan-13498433",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eluned-morgan-phillips_7144378.jpg?20260124204355",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-24 15:35:00",
        "Headline": "Scottish and Welsh parliament elections are among those taking place in May - with the results seen as crucial for Sir Keir Starmer's future.",
        "Content": "The first minister of Wales has said May's local elections could have \"profound implications\" and there's \"a real possibility\" they could set a path towards the break up of the UK. Speaking on Sunday Morning with Trevor Phillips, Baroness Eluned Morgan agreed the country could fragment if nationalist leaders end up in power in Scotland, Northern Ireland and Wales. \"I think there's a real possibility of that,\" said Baroness Morgan, who is also the leader of Welsh Labour. \"I think it's time people woke up to that as a possibility,\" she added. \"The elections in May could have profound implications, not just for the people of Wales and their public services, but also for the situation in the whole of the United Kingdom. The danger is real.\" Some commentators believe the 7 May vote could see Labour pushed into third place behind Reform in Scotland and Wales - where the party could lose control of the Senedd for the first time ever. Last week, Scotland's first minister, John Swinney, told Trevor Phillips he thought nationalist leaders could be in power in all the devolved parliaments by the end of 2026. He said a really strong showing by the Scottish National Party (SNP) would be a green light to demand another independence referendum. \n                  Welsh first minister accuses Westminster of treating Wales unfairly\n                 \n                  Plaid Cymru leader was 'turned down' for meeting with PM, he claims\n                 \n                  Is Labour losing Wales to Reform? \n                 Council elections, mayoral elections, and Scottish and Welsh parliament elections are all taking place in May - and the results are seen as crucial for Sir Keir Starmer's future. Baroness Morgan said she agreed the prime minister would \"inevitably\" be under pressure if his party suffers big losses. Read more from Sky News:Burnham facing ultimatum over his Labour futurePart of Devon pier washed away during Storm Ingrid Wes Streeting and Andy Burnham are among those rumoured as potential challengers and possible future prime ministers in such a scenario. However, allies of Sir Keir said in November he wouldn't go quietly and would fight any effort to remove him. The full interview with Baroness Morgan will be broadcast tomorrow on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "Part of Teignmouth Grand Pier in Devon washed away during Storm Ingrid",
        "description": "Part of a historic pier in Devon has been washed away during Storm Ingrid.",
        "url": "https://news.sky.com/story/part-of-teignmouth-grand-pier-in-devon-washed-away-during-storm-ingrid-13498323",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-teignmouth-storm_7144907.jpg?20260124211949",
        "type": "UK",
        "Author": "David Rivers, news reporter",
        "Date Published": "2026-01-24 11:45:00",
        "Headline": "The Met Office has issued yellow weather warnings for heavy rainfall in Devon, Cornwall and parts of Scotland, with flooding and travel disruption likely.",
        "Content": "By David Rivers, news reporter  Part of a historic pier in Devon has been washed away during Storm Ingrid. Images showed Teignmouth Grand Pier, built in 1865, missing a huge chunk. It comes after the Met Office issued yellow weather warnings for rain across Devon, Cornwall and parts of Scotland, with flooding and travel disruption likely. Check out the weather forecast in your area Forecasters have warned of heavy rainfall on Saturday in an alert running from 2am to 10pm and covering large parts of southwest England and south Wales. There is also another Met Office yellow warning for rain covering a similar area from 6pm on Monday to 2pm on Tuesday. Teignmouth mayor, Councillor Cate Williams, said the pier was already in poor condition. She told Sky News: \"It goes out for a bit and then effectively there is a portion of it that has just washed away, dissolved, and then you have another little bit of the structure that is still standing. \"The pier was built in the 1860s. It has been through a bit of wear and tear, it's had storm damage before and been through wars. \"There is a family who own the pier and have done so for multi generations. But the pier itself is a focus of our community, it's right there on the front from our boardwalk. \"The arcade aspect to it, the games, are used by residents and visitors of all ages, so it's a really important feature. It stands out. \"As we know at seaside resorts, those with piers are very few and far between so the fact we have it here is something that we appreciate and enjoy.\" Read more:Warning of floods as heavy rain soaks parts of UKTemperatures could plunge again bringing chance of snow Ms Williams added that councillors do not have the power to immediately renovate it as it is privately owned. On Saturday morning, Great Western Railway urged people not to travel between Exeter St Davids and Newton Abbot as lines will be suspended. On its website, the company said disruption would be expected until 7pm on Saturday following severe weather impacting the Dawlish sea wall. Later in the day, the line between Par and Newquay was closed with disruption expected until 5pm. Elsewhere, the Met Office warned parts of northeast Scotland could face further flooding and travel disruption after a yellow warning was issued running from 0001 on Saturday until 9am on Sunday. It covers the Grampian, Angus and Perth regions. On Saturday morning, the Scottish Environment Protection Agency had 11 flood warnings and four flood alerts active. Also, yellow warnings for rain have been issued by the Met Office for Northern Ireland from 6pm on Saturday to 9am on Sunday, and from 6am to 3pm on Tuesday."
    },
    {
        "title": "Man injured and six arrested after shooting in Manchester city centre",
        "description": "A man has been taken to hospital and six men were arrested after a shooting in Manchester city centre, police say.",
        "url": "https://news.sky.com/story/man-injured-and-six-arrested-after-shooting-in-manchester-city-centre-13498308",
        "image_url": "https://e3.365dm.com/23/08/1920x1080/skynews-f0833p-greater-manchester-police_6247250.jpg?20230811100042",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-24 10:49:00",
        "Headline": "Greater Manchester Police said the man was taken to hospital but his injuries are not believed to be life-threatening.",
        "Content": "A man has been taken to hospital and six men were arrested after a shooting in Manchester city centre, police say. Officers were called to an address in Richmond Street around 5am on Saturday following reports of a disturbance. After arriving at the location, they found a man with a leg injury \"consistent with a gunshot wound\", according to Greater Manchester Police. The force said the victim, who is in his 20s, was taken to hospital but his injuries were not believed to be life-threatening. A firearm was also recovered at an address in Richmond Street, the force added. Six men aged between 23 and 26 years have been arrested on suspicion of affray and firearms offences. They remain in police custody for questioning and investigations are ongoing. \n                  Labour ex-minister to step down as MP - potentially paving way for Andy Burnham to run for parliament\n                 \n                  2027 Tour de France: Full route of famous cycling race's return to the UK revealed\n                 \n                  'It made me feel so small' says man turned away from hotel for being homeless\n                 Read more from Sky News:Police officers warned they must hold work licenceTwo teens charged with murder of boy in Guildford Superintendent Stephen Wiggins said: \"This will undoubtedly be a concerning incident to be waking up to, not just for those who live and work in the city centre, but for the whole of Greater Manchester.\" \"I would like to reassure the community that we believe this is a targeted incident, and there is no wider threat to the general public,\" he added. In an update later on Saturday, he added: \"After exploring many lines of enquiries, I can confirm that this is not a hate crime of any nature, and I think it is important to share that update due to the locality of the incident.\" Police are appealing for witnesses or people with any information about the incident to contact them."
    },
    {
        "title": "Police officers warned they must hold work licence or face the sack",
        "description": "Police officers in England and Wales must hold a work licence or face the sack, the Home Office has announced.",
        "url": "https://news.sky.com/story/police-officers-warned-they-must-hold-work-licence-or-face-the-sack-13498279",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-officers-file_7144108.jpg?20260124093421",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-24 08:30:00",
        "Headline": "Home Secretary Shabana Mahmood is expected to announce the biggest shake-up to policing in decades on Monday.",
        "Content": "Police officers in England and Wales must hold a work licence or face the sack, the Home Office has announced. Officers must also renew the Licence to Practise over the course of their career. The plans, which come as part of reforms set to be announced by the Home Office, are designed to teach officers new skills as criminal techniques advance. This includes standards in tackling violence against women and girls along with neighbourhood policing. But officers who fail to reach the standard when applying, after opportunities to try again, will be dismissed. Crime and policing minister Sarah Jones said: \"Every police officer needs to remain match fit to protect their communities. As crime evolves, we expect police to evolve more quickly. \"The Licence to Practise will equip every officer with the skills and capabilities to do the job - whether new to the force or a policing veteran. \"Under these reforms, police forces will catch more criminals and protect their local communities.\" The Home Office said the plans had been drawn up from other professions including law and medicine. Read more:Revamped British passports rolling out this monthHome secretary vows to end UK's 'golden ticket' for asylum seekers Home Secretary Shabana Mahmood is expected to announce reforms on Monday. The Home Office has said they will be the biggest shake-up to policing in decades. The white paper, titled 'From local to national: a new model for policing', will promise to implement the programme in phases."
    },
    {
        "title": "'Barbaric' attack during Ukraine peace talks but Zelenskyy says negotiations could resume next week",
        "description": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said.",
        "url": "https://news.sky.com/story/barbaric-attack-on-ukraines-largest-cities-during-peace-talks-further-negotiations-expected-as-early-as-next-week-13498413",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-russia-ukraine_7144299.jpg?20260124135448",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 14:43:00",
        "Headline": "Russia launched a \"cynical\" and \"barbaric\" attack on Ukraine's two largest cities, cutting power to 1.2 million buildings nationwide, as a second day of peace talks took place in Abu Dhabi.",
        "Content": "Fresh talks between the US, Russia and Ukraine could take place \"as early as next week\", President Zelenskyy has said. Negotiations took place in Abu Dhabi on Friday and Saturday, and were described as \"productive\" and \"constructive\" by Washington and Mr Zelenskyy respectively. \"The central focus of the discussions was the possible parameters for ending the war,\" President Zelenskyy wrote on X after the meeting. More talks are expected in Abu Dhabi next Sunday, according to a US official who spoke anonymously to Reuters. \"We got to real granular detail and (we feel) that next Sunday will be, God willing, another meeting where we push this deal towards its final culmination,\" they said. Sky correspondent Sally Lockwood said officials had reported \"unexpected chemistry\" between the two sides and that the atmosphere \"surpassed expectations\". A UAE government spokesman suggested a meeting between Mr Zelenskyy, President Putin - and possibly President Trump - did not seem too far away. \n                  Ukraine hits out at Winter Paralympics for lifting ban on Russia\n                 \n                  How close is a peace deal in Ukraine - and have we been here before?\n                 \n                  Russia to join peace talks with Ukraine and US for first time\n                 Despite the positive reports, the talks didn't stop Moscow raining down hundreds of missiles and drones on Ukraine's two largest cities, Kyiv and Kharkiv, early on Saturday morning. \"This barbaric attack once again proves that ​Putin's place is not at [Donald Trump's] Board of Peace, but in the dock of the special ​tribunal,\" said Ukrainian foreign minister Andrii Sybiha. Some 1.2 million buildings were left without power nationwide, while temperatures plummeted to -13C (8.6F) in the capital. Military analyst Professor Michael Clarke said the strikes were timed to influence the talks by attempting to convince the White House that the Russian army was unstoppable. One person was killed in the attack and 31 people were injured. Footage showed firefighters scrambling to tackle flames ignited by the strikes. Sky correspondent When the second day of talks ended in the UAE late on Saturday afternoon, there was a sense the negotiations may have broken down — or, at best, reached a deadlock. But more detail has since emerged from US officials about what happened behind closed doors. The Russian and Ukrainian delegations were described as \"respectful\" — and even had lunch together. According to officials briefed on the talks, the atmosphere between these sworn enemies surpassed expectations. It was described as positive, with the two sides showing unexpected chemistry as they worked to find solutions. It's a jarring contrast to developments overnight, when Ukraine's two largest cities were hit by a barrage of missiles and drones.  A maternity hospital and a shelter for displaced people were among the buildings struck, while around a million Ukrainians are without power after attacks on energy infrastructure. \"There’s been a lot of carnage. A lot of killing. But there was respect,\" one US official said during a press briefing organised by the White House. We now know the Americans have been working to arrange this meeting for the past six weeks. A meeting between Donald Trump and President Zelenskyy in Davos is said to have helped set the stage for the talks in Abu Dhabi. US officials say both Zelenskyy and Vladimir Putin were sufficiently encouraged by the progress to send negotiating teams to the UAE. Not only are all three parties expected to return to Abu Dhabi next Sunday to resume talks, but the idea of a bilateral meeting between presidents Zelenskyy and Putin is said to be \"very close\".  US officials say we could soon see delegations meeting in Russia — or even Russians travelling to Kyiv. \"Targeting civilians and civilian infrastructure is a clear breach of the rules of warfare,\" UN human rights chief Volker Turk said. Despite images showing damage to apartments, the Russian defence ministry claimed it targeted Ukrainian military and industrial installations as well as energy and transport infrastructure used by the armed forces. The Ukrainian negotiating team's main task in Abu Dhabi was to convey how relentless Russian strikes were undermining diplomacy, Mr Zelenskyy said. For its part, the Kremlin continued to demand Mr Zelenskyy give up all the land Russian soldiers have occupied by force, plus the rest of the eastern Donbas region. Ukraine shows little appetite to concede - and nor do its citizens, according to polls. Russia even floated the idea of using the bulk of nearly $5bn (£3.66bn) in Russian assets frozen in the US to fund rebuilding the cities it has destroyed in the Donbas. Mr Zelenskyy dismissed it as \"nonsense\"."
    },
    {
        "title": "Iran warns any attack will mean 'all-out war' after Trump says US 'armada' on its way",
        "description": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region.",
        "url": "https://news.sky.com/story/iran-warns-any-attack-will-mean-all-out-war-after-trump-says-us-armada-on-its-way-13498251",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-uss-abraham-lincoln_7144024.jpg?20260124013655",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 01:13:00",
        "Headline": "Donald Trump said on Thursday that the US had an \"armada\" heading toward Iran but hoped he would not have to use it.",
        "Content": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region. The warning and surge in US military presence comes almost two weeks after Donald Trump urged Iranian protesters - thousands of whom have been killed by the regime's forces - to keep demonstrating and promised that \"help is on the way\". \"This military ‌build-up - we hope it is ‌not intended for real confrontation - but our military is ready for the worst-case scenario. This is why everything is on high alert in Iran,\" said the Iranian official, speaking ‌to Reuters on condition of ⁠anonymity. The official went on to say: \"This time we will treat any attack - limited, unlimited, surgical, kinetic, whatever they call it - as an all-out war against us, and we will respond in the hardest way possible to settle this.\" Mr Trump said on Thursday that the US had an \"armada\" heading toward Iran but hoped he would not have to use it, as he renewed warnings to Tehran against killing protesters or restarting its nuclear programme. \"If the Americans violate Iran's sovereignty and territorial integrity, we will respond,\" said the Iranian official. He declined to specify ‌what an Iranian response might look like. \n                  'He was bleeding for 40 minutes, gasping for life': The dying moments of an aspiring Iranian rapper\n                 \n                  Hackers target Iranian state TV as exiled crown prince tells military to 'join the people'\n                 \n                  Rapper describes 'massacre' on Iran's streets - as supreme leader says thousands killed in protests\n                 Read more from Sky News:How close is a peace deal in Ukraine?Special relationship turns toxic after NATO troop comments The US military has periodically sent additional forces to the Middle East at times of heightened tension, moves often seen as defensive. However, the US military staged a major build-up last year ahead of its launching airstrikes against Iran's nuclear programme in June. Another build-up was seen in the Caribbean towards the end of last year before the US launched military action against Venezuela and captured the country's president Nicolas Maduro. 'Iran may try again to obtain nuclear weapon' Meanwhile, the Pentagon has published a new national defence strategy, which included analysis on Iran. The document warned Iran may attempt to obtain a nuclear weapon, something it has accused Tehran's leaders of attempting before. The document also said Iran had \"the blood of Americans on its hands\" and pledged US support for Israel. It read: \"Although Iran has suffered severe setbacks over recent months, it appears intent on reconstituting its conventional military forces. \"Iran's leaders have also left open the possibility that they will try again to obtain a nuclear weapon, including by refusing to engage in meaningful negotiations.\" It added: \"Nor can we ignore the facts that the Iranian regime has the blood of Americans on its hands.\" The document stated Iran \"remains intent on destroying our close ally Israel, and that Iran and its proxies routinely instigate regional crises that not only threaten the lives of American servicemembers in the region but also prevent the region itself from pursuing the kind of peaceful and prosperous future that so many of its leaders and peoples clearly wish for\"."
    },
    {
        "title": "Eight dead and more than 80 missing after landslide on Indonesia's Java island",
        "description": "At least eight people have been killed and more than 80 others are missing following a landslide on Indonesia's Java island.&#160;",
        "url": "https://news.sky.com/story/eight-dead-and-dozens-missing-after-landslide-on-indonesias-java-island-13498297",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-extreme-weather-indonesia_7144134.jpg?20260124103310",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 10:08:00",
        "Headline": "Rescue efforts are under way on Java island following a landslide which was caused by days of torrential rainfall, authorities have said.",
        "Content": "At least eight people have been killed and more than 80 others are missing following a landslide on Indonesia's Java island.  The landslide happened on Saturday in the West Bandung district of West Java province, after days of torrential rain caused river banks to burst. Eight bodies were pulled from the worst-hit hamlet of Pasir Kuning, while more than 30 homes were buried under the mud and debris. Rescuers effort are under way in the search for 82 missing residents, while 24 people were able to escape the disaster, according to the national disaster management agency's spokesperson, Abdul Muhari. Television footage showed workers and residents digging desperately in the village of Pasir Langu, where roads and fields were covered with thick mud, rocks and uprooted trees. Teten Ali Mungku Engkun, who heads West Java's disaster management office, said emergency response teams were deployed immediately after the landslide, and that families living near the affected area had been evacuated due to fears of further landslides. He added that \"unstable soil and heavy rain continue to complicate search and rescue operations\". \n                  'Life-threatening' storm forecast in US as more than a dozen states declare emergency\n                 \n                  More than 100 people die after torrential rain and flooding in South Africa, Mozambique and Zimbabwe\n                 \n                  -37C temperatures traps thousands of tourists in Finland\n                 Authorities have urged residents in areas prone to landslides to remain vigilant and evacuate immediately if they hear rumbling sounds, see soil movement or believe conditions are unsafe. Read more from Sky News:Boy dies after shark attack in Sydney HarbourIran warns any attack will mean 'all-out war' It comes less than two months after floods and landslides hit parts of South and Southeast Asia - including Indonesia's largest island, Sumatra - killing more than 1,300 people, according to authorities. In January 2025, more than 20 people were killed in floods and landslides following torrential rain in the Central Java province. Indonesia, an archipelago of more than 17,000 islands, is prone to frequent flooding and landslides as a result of seasonal rains and high tides from around October to April."
    },
    {
        "title": "Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks",
        "description": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline.",
        "url": "https://news.sky.com/story/trump-pays-tribute-to-very-brave-british-soldiers-who-served-in-afghanistan-13498256",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-afghanistan-britain_7143139.jpg?20260122233853",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 06:46:00",
        "Headline": "Mr Trump made his original comments at the World Economic Forum earlier this week as he questioned if NATO would \"be there if we ever needed them\".",
        "Content": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline. He said Britons \"were among the greatest of all warriors\" as he acknowledged the 457 who died and many \"badly injured\". \"The GREAT and very BRAVE soldiers of the United Kingdom will always be with the United States of America!\" Mr Trump wrote on Truth Social. \"It's a bond too strong to ever be broken,\" the president added. \"The U.K. Military, with tremendous Heart and Soul, is second to none (except for the U.S.A.!). We love you all, and always will!\" President Trump's post comes after he falsely claimed NATO troops in Afghanistan had \"stayed a little back, a little off the frontlines\". Sir Keir Starmer had called the remarks \"insulting and frankly appalling\", while Prince Harry also defended the bravery of UK troops. \n                  Angry Sir Keir Starmer loses patience with Donald Trump over 'insulting' NATO troops remarks\n                 \n                  'Sacrifices deserve respect': Prince Harry joins PM in criticising Trump's NATO troops remark\n                 \n                  British troops were in Afghanistan from start to finish - despite what Trump says\n                 The prince - who served two tours of Afghanistan - said British \"sacrifices deserve to be spoken about truthfully and with respect\". Downing Street said Sir Keir had spoken to Mr Trump shortly before the president's social media post on Saturday. \"The prime minister raised the brave and heroic British and American soldiers who fought side by side in Afghanistan, many of whom never returned home. We must never forget their sacrifice,\" said a statement. Mr Trump made his original comments to Fox News at the World Economic Forum earlier this week, as he questioned if NATO would \"be there if we ever needed them\". \"We've never needed them,\" the US president said. \"They'll say they sent some troops to Afghanistan… and they did, they stayed a little back, a little off the frontlines.\" Read more:UK troops were there from start to finish - despite what Trump says Criticism from UK veterans, their families, and politicians was swift and severe. Al Carns, the armed forces minister, who was with the Royal Marines in Afghanistan, called the claims \"utterly ridiculous\". Tory MP Ben Obese-Jecty, who served there with the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". Diane Dernie, whose son Ben Parkinson suffered horrific injuries in Afghanistan, called the comments \"the ultimate insult\" and urged the prime minister to stand up to Mr Trump. The president's U-turn was welcomed by Conservative Party leader Kemi Badenoch. \"I'm pleased President Trump has now acknowledged the role of the British armed forces and those brave men and women who gave their lives fighting alongside the US and our allies,\" she wrote on X. \"It should never have been questioned in the first place.\" Over 1,000 non-US NATO troops died in Afghanistan and at least double that number were seriously wounded. At 457, the UK had the second-highest number of military deaths during the near 20-year campaign. The US suffered 2,461 deaths. The American-led invasion came shortly after 9/11 as it invoked NATO's Article 5 clause that an attack against one member is an attack on all. President Trump has been a frequent critic of NATO, saying the alliance is too reliant on US power and urging members to increase their defence spending."
    },
    {
        "title": "China no longer America's top defence priority, Pentagon says",
        "description": "China is no longer the US Pentagon's top priority, shifting its focus to the homeland and Western Hemisphere, an influential new strategy document says.",
        "url": "https://news.sky.com/story/china-no-longer-americas-top-defence-priority-pentagon-says-13498252",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-china-taiwan-military-drills_7121307.jpg?20251229112937",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 02:23:00",
        "Headline": "A new defence document has revealed a shift in US priorities - with significant messages for its allies in Europe and Asia.",
        "Content": "China is no longer the US Pentagon's top priority, shifting its focus to the homeland and Western Hemisphere, an influential new strategy document says. Where it had been viewed under former president Joe Biden as a top adversary, Beijing is now seen as a settled force in the Indo-Pacific region that only needs to be deterred from dominating the US or its allies, according to the 2026 National Defence Strategy. The document is based on President Donald Trump's National Security Strategy, published last year, which said the US will reassert its dominance in the Western Hemisphere, build military strength in the Indo-Pacific, and possibly reassess its relationship with Europe. The new paper calls for the US military to provide \"critical but more limited support\" for allies in Europe and elsewhere. It says there is a need for \"a sharp shift - in approach, focus, and tone\" in order to \"shift away from the legacy course headed for disaster and toward making America great again\". The strategy's release is likely to unnerve US allies even further, coming after disagreements over a desired US takeover of Greenland and claims by Mr Trump that NATO troops did not fight on the frontline in Afghanistan. The new document says the country is not pursuing an isolationist agenda, but lays out why the US wants allies to do more while the military focuses more on the homeland. \n                  Trump threatens Canada with 100% tariff over China trade deal\n                 \n                  Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks\n                 \n                  Tories claim government in retreat on Chagos 'surrender' after Donald Trump broadside\n                 The main focus on the homeland includes a section about the US no longer ceding key terrain in the Western Hemisphere and how the Pentagon will provide Mr Trump with \"credible options to guarantee US military and commercial access to key terrain from the Arctic to South America, especially Greenland, the Gulf of America, and the Panama Canal.\" Korean peninsula The paper warns that South Korea must stay vigilant against the threat of a North Korean invasion, underlining that the country is within striking distance of the North's missile forces. South Korea is singled out in the document as having begun to \"step up\" in defence spending. The country hosts around ​28,500 US personnel, and Seoul has increased its defence budget by 7.5% for this year. Seoul is described as \"capable of taking primary responsibility for deterring North Korea\" thanks to its powerful military and high defence spending. Ukraine While Mr Biden said defending Ukraine from Russian aggression was a top priority, the new strategy paper says NATO allies must assume \"the lead in supporting Ukraine's defence\". Peace in Ukraine is labelled as \"Europe's responsibility first and foremost\". The Pentagon foresees America providing \"critical but more limited US support\". Russia Russia is described as a persistent but manageable threat to NATO's eastern members. The document goes on to say that Moscow \"is in no position\" to make a bid for European dominance. European NATO allies are described as being substantially more powerful than Russia, with the text going on to say that \"it is not even close\". The strategy cites how Germany's economy alone dwarfs that of Russia. Perhaps then comes the part that will most worry Europe. \"Although Europe remains important,\" the document says. \"It has a smaller and decreasing share of global economic power. It follows that, although we are and will remain engaged in Europe, we must - and will - prioritise defending the US Homeland and deterring China.\" Read more from Sky News:Iran warns any attack will mean 'all-out war'Ukraine hits out at Winter Paralympics for lifting ban on Russia China China is labelled as \"the most powerful state relative to us [the US] since the 19th century\". The US, the document says, will seek to maintain a favourable balance of military power in the Indo-Pacific region. This will not be done for the purpose of \"dominating, humiliating, or strangling China\", but to ensure that no country can dominate the US or its allies. Mr Trump's White House believes \"a decent peace, on terms favourable to Americans but that China can also accept and live under\" is possible."
    },
    {
        "title": "Djokovic apologises after ball nearly hits ball girl during history-making win at Australian Open",
        "description": "Novak Djokovic has apologised after almost hitting a ball girl with the ball during his history-making Australian Open third-round match on Saturday.&#160;",
        "url": "https://news.sky.com/story/djokovic-apologises-after-ball-nearly-hits-ball-girl-during-history-making-win-at-australian-open-13498431",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-novak-djokovic-tennis_7144447.jpg?20260124153835",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 15:23:00",
        "Headline": "The 38-year-old said the incident happened \"in the heat of the moment\" during his third-round victory on Saturday. ",
        "Content": "Novak Djokovic has apologised after almost hitting a ball girl with the ball during his history-making Australian Open third-round match on Saturday.  Djokovic, a 24-time Grand Slam champion, recorded a 6-3 6-4 7-6 (7-4) victory over Dutchman Botic van de Zandschulp at Melbourne Park to become the first player ever to reach 400 singles wins at the Grand Slams and equal Roger Federer's record of 102 victories at the year's first major. However, in an apparent moment of frustration, the 38-year-old Serbian star sent a forehand shot that narrowly missed the head of a ball girl crouching close to the net. Djokovic, who was disqualified from the US Open in 2020 after hitting a line judge with a ball, later apologised, saying the incident happened \"in the heat of the moment\". \"I apologise for that,\" he said. \"That was not necessary and in the heat of the moment. \"I was lucky there, and I'm sorry for causing any distress to the ball kid or anybody.\" \n                  Gunman at large in Lake Cargelligo, Australia, after three people shot dead \n                 \n                  Surfer 'lucky to survive' Sydney's fourth shark attack in three days\n                 \n                  Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting\n                 Djokovic has won 10 Australian Open men's singles titles in his career and is going in search of what would be a record 25th Grand Slam triumph.He is yet to drop a set at the 2026 tournament, but his win over Van de Zandschulp, who won the last meeting between the two in Indian Wells last year, was far from straight-forward. The Serbian sparked concerns when he fell clutching his right ankle during the third game of the third set, although the subsequent visit he received from the trainer was to treat a blister.He then saved two set points at 5-6 in the third set, entering into his latest battle with the Melbourne crowd over noise during points, putting his finger to his lips on several occasions and cupping his hand to his ear when he made it across the line.After the match, Djokovic said: \"I relaxed a little bit too much and was in trouble closing out the second set, and pretty much from that moment onwards it was anybody's game. Read more from Sky News:Boy dies after shark attack in Sydney HarbourEight dead and more than 80 missing after Indonesia landslide\"I was really lucky to get out of the set point in the third. Just glad to overcome it in straights.\"It's been a great start to the tournament,\" he added, saying: \"I'm still trying to give these young guys a push for their money.\"He dismissed any concerns over his ankle, saying: \"Thankfully I managed to have a good fall. Things could have been very ugly.\" When asked if he had any advice for his younger self, Djokovic said: \"Calm down, you jerk. \"It's true. I am too stressed on the court very often and too much tension at times. I think I would say the patience is a big one.\""
    },
    {
        "title": "Ugandan opposition leader Bobi Wine claims wife held 'at gunpoint' after 'hundreds of soldiers' raided his home",
        "description": "Uganda's opposition leader claims \"hundreds of soldiers\" raided his home overnight and held his wife at gunpoint, leaving destruction everywhere.",
        "url": "https://news.sky.com/story/ugandan-opposition-leader-bobi-wine-claims-wife-held-at-gunpoint-after-hundreds-of-soldiers-raided-his-home-13498321",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-uganda-bobi-wine_7136675.jpg?20260115223556",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 11:40:00",
        "Headline": "It comes days after President Yoweri Museveni extended his decades-long rule of the African country in an election marred by claims of ballot stuffing.",
        "Content": "Uganda's opposition leader claims \"hundreds of soldiers\" raided his home overnight and held his wife at gunpoint, leaving destruction everywhere. Bobi Wine says his wife was assaulted and documents and electronic items were taken from his home. He made the claims on X on Saturday morning. Sky News has approached the Ugandan government for comment. It comes days after President Yoweri Museveni extended his decades-long rule of the African country in an election marred by claims of ballot stuffing. \"Hundreds of soldiers descended on our home in Magere last night,\" Mr Wine said. \"Many of them were drunk. They came with ladders, ready to climb upstairs. They broke our doors and forced themselves into our house.\" He said they held his wife at gunpoint, asking her to reveal his whereabouts. \n                  Ugandan election a 'fraudulent affair', Bobi Wine's lawyer says - as protesters face violent crackdown\n                 \n                  Ugandan long-time president wins election amid opposition claims of 'massive ballot stuffing'\n                 \n                  'People power' opposition supporters shout as voting count in Uganda election turns violent\n                 Read more:Ugandan election a 'fraudulent affair', Bobi Wine's lawyer says \"They grabbed my wife's phone, forced her to sit down, and ordered her to remove her password. She refused. They strangled her and insulted her.\" Mr Wine said his wife was taken to hospital where she remains, \"dealing with all the physical and psychological trauma\". \"Yet in all this, we remain firm in our belief that UGANDA WILL BE FREE.\""
    },
    {
        "title": "Boy, 12, dies after shark attack in Sydney Harbour",
        "description": "An Australian boy attacked by a shark in Sydney Harbour has died in hospital, his family has announced.",
        "url": "https://news.sky.com/story/boy-12-dies-after-shark-attack-in-sydney-harbour-13498258",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-nico-antic-australia_7144069.jpg?20260124091406",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 07:10:00",
        "Headline": "Nico Antic was taken to hospital after jumping off rocks with friends in Vaucluse, Sydney, last Sunday.",
        "Content": "An Australian boy attacked by a shark in Sydney Harbour has died in hospital, his family has announced. Nico Antic, 12, was bitten last Sunday after he and friends jumped off rocks in Vaucluse, around five miles from the city's business district. Nico was pulled from the water by friends and taken to hospital with severe injuries to both legs. On Saturday, his family released a statement to announce the boy had died of his injuries. It read: \"We are heartbroken to share ‌that our son, Nico, has passed away. \"Nico was a happy, friendly, and sporty young boy with the most kind and ‍generous spirit. \"He was always full of life and that's how we'll remember him.\" His death follows a series of attacks on Australia's east coast. Read more:Surfer 'lucky to survive' Sydney's fourth shark attack in three daysWoman killed and man injured in shark attack in New South Wales Dozens of beaches, including in Sydney, were shut this week after four shark attacks in two days. Heavy rainfall had left waters murky and more likely to attract the animals. In September last year, a surfer was killed by a large shark at Sydney's Long Reef beach. On average, Australia records 20 shark attacks a year with fewer than three of those fatal, according to data from conservation groups."
    },
    {
        "title": "The most striking photos of the week",
        "description": "From the Northern Lights to the aftermath of protests in Iran, here are the images of the week chosen by the Sky News picture editors.",
        "url": "https://news.sky.com/story/the-most-striking-photos-of-the-week-13498292",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-newspix-2301-northernlights_7143625.jpg?20260123142120",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-24 09:39:00",
        "Headline": "No subtitle found",
        "Content": "From the Northern Lights to the aftermath of protests in Iran, here are the images of the week chosen by the Sky News picture editors.  A Russian Orthodox believer bathes in the icy water of a pond in St Petersburg to celebrate the Orthodox Epiphany. Hindu devotees gather where the Ganges and Yamuna rivers meet in Prayagraj, India, on Basant Panchami, the day which marks the advent of spring, during the annual spiritual festival of Magh Mela. Burnt-out buses in Tehran after mass protests in Iran that saw thousands of protesters killed and arrested in a violent regime crackdown. A firefighter battles a forest fire in the Biobio region of Chile, where multiple wildfires have prompted emergency evacuations.  Senegal fans before the Africa Cup of Nations final against Morocco - which ended in huge controversy when Senegalese fans tried to storm the pitch and Senegal players walked off in protest after Morocco, the hosts, were awarded a penalty in the 98th minute. The Northern Lights captured by Roscosmos cosmonaut Sergey Kud-Sverchkov on board the International Space Station (ISS). A Cold War nuclear bunker hangs from a cliff edge on the Holderness coastline in Tunstall, East Yorkshire. Experts believe it could now be just weeks, if not days, away from falling into the sea. Austria's Anastasia Potapova in action at the Australian Open during her first round match against The Netherlands' Suzan Lamens. Border officials and police stand guard in front of the Bishop Henry Whipple Federal Building in Minneapolis during a protest more than a week after an ICE agent fatally shot Renee Nicole Good in the Minnesota city.  A man tumbles down a water slide in a public pool in the Puente Piedra district outside of Lima in Peru. A group of civilians smash a statue of a Syrian Democratic Forces fighter in Tabqa, Syria, after the Syrian army took control of the city.  Hans-Joachim von Massow was left with several thousand tons of potatoes when a trader failed to collect them due to a drop in price caused by a good harvest. Air Force personnel remove the wreckage of a microlight training aircraft after it crashed into a pond during a training exercise in Prayagraj, India. A person practices \"ice winging\" - a combination of ice skating, windsurfing and kiteboarding - on the frozen Lake Balaton near Vonyarcvashegy in Hungary. Waves crash against South Shields lighthouse on the North East coast during stormy weather that brought heavy rain and flooding."
    },
    {
        "title": "'Blood-curdling accounts' of killings and sexual violence: What we know about landmark Rohingya genocide case",
        "description": "When Dr Ronan Lee spoke to members of the Rohingya community, he heard \"blood-curdling accounts\" of killings and sexual violence allegedly carried out by Myanmar's security forces.",
        "url": "https://news.sky.com/story/blood-curdling-accounts-of-killings-and-sexual-violence-what-we-know-about-landmark-rohingya-genocide-case-13497127",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-myanmar-rohingya_7141757.jpg?20260121163205",
        "type": "World",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2026-01-24 00:01:00",
        "Headline": "The accounts of the Rohingya people are being heard directly in an international court for the first time as Myanmar stands accused of committing genocide.",
        "Content": "\n          News correspondent\n              @esadiya\n When Dr Ronan Lee spoke to members of the Rohingya community, he heard \"blood-curdling accounts\" of killings and sexual violence allegedly carried out by Myanmar's security forces. They described how hundreds of villages were burned to the ground, with Myanmar's military treating Rohingya males \"as fair game for extermination\", the author and academic said. Thousands of people were killed and a \"monstrous campaign of sexual violence\" was unleashed against women and girls from the mainly-Muslim minority group, alleged victims told Dr Lee. Now their stories are being heard directly in an international court for the first time in a landmark case, where Myanmar stands accused of committing genocide. More than 700,000 Rohingya refugees fled the Southeast Asian country into neighbouring Bangladesh during the 2017 military crackdown. Myanmar, which says it launched the campaign after an attack by a Rohingya insurgent group, has denied allegations of genocide. The long-awaited International Court of Justice (ICJ) hearings began last week in The Hague, and the case is expected to set precedents about how a genocide can be defined and proven. It was first filed by the Gambia, which has argued that Myanmar's military engaged in a \"clearance operation\" that violated the 1948 Genocide Convention. The Gambia's justice minister, Dawda Jallow, said his country had brought the case out of \"a sense of responsibility\" following its own experience with a military government. At the opening of the case last week, Mr Jallow told the court the Rohingya people had \"endured decades of appalling persecution, and years of dehumanising propaganda\". \"They have been targeted for destruction,\" he said. \"Myanmar has denied them their dream - in fact, it turned their lives into a nightmare, subjecting them to the most horrific violence and destruction one could imagine.\" What has Myanmar said? Myanmar, which has been under military control since 2021, opened its defence in the case, with representative Ko Ko Hlaing telling the court the country was \"not obliged to remain idle and allow terrorists to have free rein of northern Rakhine State\". He added the case will be decided \"on the basis of proven facts, not unsubstantiated allegations\" and \"emotional anguish and blurry factual pictures are not a substitute for rigorous presentation of facts\". Who are the Rohingya? More than a million Rohingya people lived in Myanmar at the start of 2017, with the majority in Rakhine State in the west of the country. With their own language and culture, they say they are descendants of Muslim traders who have lived in the region for generations. But Myanmar, a predominantly Buddhist country, has long considered the Rohingya people to be illegal immigrants from neighbouring Bangladesh and denied them citizenship. Following the 2017 crackdown, more than a million Rohingya people are now in chaotic, overcrowded camps in Bangladesh. A UN fact-finding mission concluded the military offensive had included \"genocidal acts\". Myanmar authorities rejected that report, saying the military offensive was a legitimate counter-terrorism campaign. Role of Facebook Over three weeks of hearings, the ICJ will hear from alleged victims in closed sessions - the first time their accounts have been told directly in an international court. The case also breaks new ground by exploring the use of Facebook as the main media for allegedly distributing hate speech. Dr Lee, whose research focuses on Myanmar, the Rohingya, genocide and hate speech, says Facebook became a key platform in the spread of anti-Muslim and anti-Rohingya messages at that time. \"Facebook was virtually unregulated within Myanmar at that time and allowed anti-Rohingya posts to proliferate on its platform,\" the Loughborough University expert says. \"This provided the political cover and public support to enable the Myanmar military to undertake its 2017 violence against Rohingya without any meaningful public backlash or opposition from influential political figures.\" Sky News has approached Facebook for comment. What's the likely outcome at the ICJ? In the case against Myanmar, Dr Lee believes the Gambia has a chance of success. \"The evidence strongly indicates Myanmar's military undertook violent actions targeting Rohingya civilians because they were Rohingya,\" he adds. \"And the decades-long mistreatment of Rohingya by Myanmar's military and government strongly indicates a desire to destroy the Rohingya as a Myanmar community.\" The trial is the first genocide case the ICJ has taken up in full in more than a decade, and its outcome could have repercussions for how future allegations are assessed, including South Africa's case accusing Israel of genocide in Gaza. Several members of the Rohingya have made the trip to the Netherlands to attend the hearings, which are expected to last three weeks. A final ruling is expected towards the end of 2026. Read more:Explained: The 2017 Rohingya refugee crisisMyanmar holds election - but critics call it a 'sham' vote Myanmar was initially represented at the court by Nobel Peace Prize winner Aung San Suu Kyi, who denied her country's armed forces committed genocide, telling the ICJ in 2019 that the mass exodus of Rohingya people from the country she led was the unfortunate result of a battle with insurgents. She is now in prison after being convicted of what her supporters call trumped-up charges after a military takeover of power. A finding of genocide may also have an impact on the ongoing investigation at another court based in The Hague, the International Criminal Court. In 2024, the court's chief prosecutor asked judges to issue an arrest warrant for the head of Myanmar's military regime, Senior General Min Aung Hlaing, for crimes against the Rohingya. Gen Hlaing has previously denied the allegations, and the request for the warrant is still pending."
    },
    {
        "title": "China no longer America's top defence priority, Pentagon says",
        "description": "China is no longer the US Pentagon's top priority, shifting its focus to the homeland and Western Hemisphere, an influential new strategy document says.",
        "url": "https://news.sky.com/story/china-no-longer-americas-top-defence-priority-pentagon-says-13498252",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-china-taiwan-military-drills_7121307.jpg?20251229112937",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-24 02:23:00",
        "Headline": "A new defence document has revealed a shift in US priorities - with significant messages for its allies in Europe and Asia.",
        "Content": "China is no longer the US Pentagon's top priority, shifting its focus to the homeland and Western Hemisphere, an influential new strategy document says. Where it had been viewed under former president Joe Biden as a top adversary, Beijing is now seen as a settled force in the Indo-Pacific region that only needs to be deterred from dominating the US or its allies, according to the 2026 National Defence Strategy. The document is based on President Donald Trump's National Security Strategy, published last year, which said the US will reassert its dominance in the Western Hemisphere, build military strength in the Indo-Pacific, and possibly reassess its relationship with Europe. The new paper calls for the US military to provide \"critical but more limited support\" for allies in Europe and elsewhere. It says there is a need for \"a sharp shift - in approach, focus, and tone\" in order to \"shift away from the legacy course headed for disaster and toward making America great again\". The strategy's release is likely to unnerve US allies even further, coming after disagreements over a desired US takeover of Greenland and claims by Mr Trump that NATO troops did not fight on the frontline in Afghanistan. The new document says the country is not pursuing an isolationist agenda, but lays out why the US wants allies to do more while the military focuses more on the homeland. \n                  Trump threatens Canada with 100% tariff over China trade deal\n                 \n                  Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks\n                 \n                  Tories claim government in retreat on Chagos 'surrender' after Donald Trump broadside\n                 The main focus on the homeland includes a section about the US no longer ceding key terrain in the Western Hemisphere and how the Pentagon will provide Mr Trump with \"credible options to guarantee US military and commercial access to key terrain from the Arctic to South America, especially Greenland, the Gulf of America, and the Panama Canal.\" Korean peninsula The paper warns that South Korea must stay vigilant against the threat of a North Korean invasion, underlining that the country is within striking distance of the North's missile forces. South Korea is singled out in the document as having begun to \"step up\" in defence spending. The country hosts around ​28,500 US personnel, and Seoul has increased its defence budget by 7.5% for this year. Seoul is described as \"capable of taking primary responsibility for deterring North Korea\" thanks to its powerful military and high defence spending. Ukraine While Mr Biden said defending Ukraine from Russian aggression was a top priority, the new strategy paper says NATO allies must assume \"the lead in supporting Ukraine's defence\". Peace in Ukraine is labelled as \"Europe's responsibility first and foremost\". The Pentagon foresees America providing \"critical but more limited US support\". Russia Russia is described as a persistent but manageable threat to NATO's eastern members. The document goes on to say that Moscow \"is in no position\" to make a bid for European dominance. European NATO allies are described as being substantially more powerful than Russia, with the text going on to say that \"it is not even close\". The strategy cites how Germany's economy alone dwarfs that of Russia. Perhaps then comes the part that will most worry Europe. \"Although Europe remains important,\" the document says. \"It has a smaller and decreasing share of global economic power. It follows that, although we are and will remain engaged in Europe, we must - and will - prioritise defending the US Homeland and deterring China.\" Read more from Sky News:Iran warns any attack will mean 'all-out war'Ukraine hits out at Winter Paralympics for lifting ban on Russia China China is labelled as \"the most powerful state relative to us [the US] since the 19th century\". The US, the document says, will seek to maintain a favourable balance of military power in the Indo-Pacific region. This will not be done for the purpose of \"dominating, humiliating, or strangling China\", but to ensure that no country can dominate the US or its allies. Mr Trump's White House believes \"a decent peace, on terms favourable to Americans but that China can also accept and live under\" is possible."
    },
    {
        "title": "Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks",
        "description": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline.",
        "url": "https://news.sky.com/story/trump-pays-tribute-to-very-brave-british-soldiers-who-served-in-afghanistan-13498256",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-afghanistan-britain_7143139.jpg?20260122233853",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-24 06:46:00",
        "Headline": "Mr Trump made his original comments at the World Economic Forum earlier this week as he questioned if NATO would \"be there if we ever needed them\".",
        "Content": "Donald Trump has praised \"very brave\" British soldiers who served in Afghanistan after fierce criticism of his claim non-US troops had stayed back from the frontline. He said Britons \"were among the greatest of all warriors\" as he acknowledged the 457 who died and many \"badly injured\". \"The GREAT and very BRAVE soldiers of the United Kingdom will always be with the United States of America!\" Mr Trump wrote on Truth Social. \"It's a bond too strong to ever be broken,\" the president added. \"The U.K. Military, with tremendous Heart and Soul, is second to none (except for the U.S.A.!). We love you all, and always will!\" President Trump's post comes after he falsely claimed NATO troops in Afghanistan had \"stayed a little back, a little off the frontlines\". Sir Keir Starmer had called the remarks \"insulting and frankly appalling\", while Prince Harry also defended the bravery of UK troops. \n                  Angry Sir Keir Starmer loses patience with Donald Trump over 'insulting' NATO troops remarks\n                 \n                  'Sacrifices deserve respect': Prince Harry joins PM in criticising Trump's NATO troops remark\n                 \n                  British troops were in Afghanistan from start to finish - despite what Trump says\n                 The prince - who served two tours of Afghanistan - said British \"sacrifices deserve to be spoken about truthfully and with respect\". Downing Street said Sir Keir had spoken to Mr Trump shortly before the president's social media post on Saturday. \"The prime minister raised the brave and heroic British and American soldiers who fought side by side in Afghanistan, many of whom never returned home. We must never forget their sacrifice,\" said a statement. Mr Trump made his original comments to Fox News at the World Economic Forum earlier this week, as he questioned if NATO would \"be there if we ever needed them\". \"We've never needed them,\" the US president said. \"They'll say they sent some troops to Afghanistan… and they did, they stayed a little back, a little off the frontlines.\" Read more:UK troops were there from start to finish - despite what Trump says Criticism from UK veterans, their families, and politicians was swift and severe. Al Carns, the armed forces minister, who was with the Royal Marines in Afghanistan, called the claims \"utterly ridiculous\". Tory MP Ben Obese-Jecty, who served there with the Royal Yorkshire Regiment, said it was \"sad to see our nation's sacrifice, and that of our NATO partners, held so cheaply by the president of the United States\". Diane Dernie, whose son Ben Parkinson suffered horrific injuries in Afghanistan, called the comments \"the ultimate insult\" and urged the prime minister to stand up to Mr Trump. The president's U-turn was welcomed by Conservative Party leader Kemi Badenoch. \"I'm pleased President Trump has now acknowledged the role of the British armed forces and those brave men and women who gave their lives fighting alongside the US and our allies,\" she wrote on X. \"It should never have been questioned in the first place.\" Over 1,000 non-US NATO troops died in Afghanistan and at least double that number were seriously wounded. At 457, the UK had the second-highest number of military deaths during the near 20-year campaign. The US suffered 2,461 deaths. The American-led invasion came shortly after 9/11 as it invoked NATO's Article 5 clause that an attack against one member is an attack on all. President Trump has been a frequent critic of NATO, saying the alliance is too reliant on US power and urging members to increase their defence spending."
    },
    {
        "title": "Iran warns any attack will mean 'all-out war' after Trump says US 'armada' on its way",
        "description": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region.",
        "url": "https://news.sky.com/story/iran-warns-any-attack-will-mean-all-out-war-after-trump-says-us-armada-on-its-way-13498251",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-uss-abraham-lincoln_7144024.jpg?20260124013655",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-24 01:13:00",
        "Headline": "Donald Trump said on Thursday that the US had an \"armada\" heading toward Iran but hoped he would not have to use it.",
        "Content": "A senior Iranian official has warned that the country will treat any attack \"as an all-out war against us\" ahead of the arrival of a US aircraft carrier strike group and other assets in the region. The warning and surge in US military presence comes almost two weeks after Donald Trump urged Iranian protesters - thousands of whom have been killed by the regime's forces - to keep demonstrating and promised that \"help is on the way\". \"This military ‌build-up - we hope it is ‌not intended for real confrontation - but our military is ready for the worst-case scenario. This is why everything is on high alert in Iran,\" said the Iranian official, speaking ‌to Reuters on condition of ⁠anonymity. The official went on to say: \"This time we will treat any attack - limited, unlimited, surgical, kinetic, whatever they call it - as an all-out war against us, and we will respond in the hardest way possible to settle this.\" Mr Trump said on Thursday that the US had an \"armada\" heading toward Iran but hoped he would not have to use it, as he renewed warnings to Tehran against killing protesters or restarting its nuclear programme. \"If the Americans violate Iran's sovereignty and territorial integrity, we will respond,\" said the Iranian official. He declined to specify ‌what an Iranian response might look like. \n                  'He was bleeding for 40 minutes, gasping for life': The dying moments of an aspiring Iranian rapper\n                 \n                  Hackers target Iranian state TV as exiled crown prince tells military to 'join the people'\n                 \n                  Rapper describes 'massacre' on Iran's streets - as supreme leader says thousands killed in protests\n                 Read more from Sky News:How close is a peace deal in Ukraine?Special relationship turns toxic after NATO troop comments The US military has periodically sent additional forces to the Middle East at times of heightened tension, moves often seen as defensive. However, the US military staged a major build-up last year ahead of its launching airstrikes against Iran's nuclear programme in June. Another build-up was seen in the Caribbean towards the end of last year before the US launched military action against Venezuela and captured the country's president Nicolas Maduro. 'Iran may try again to obtain nuclear weapon' Meanwhile, the Pentagon has published a new national defence strategy, which included analysis on Iran. The document warned Iran may attempt to obtain a nuclear weapon, something it has accused Tehran's leaders of attempting before. The document also said Iran had \"the blood of Americans on its hands\" and pledged US support for Israel. It read: \"Although Iran has suffered severe setbacks over recent months, it appears intent on reconstituting its conventional military forces. \"Iran's leaders have also left open the possibility that they will try again to obtain a nuclear weapon, including by refusing to engage in meaningful negotiations.\" It added: \"Nor can we ignore the facts that the Iranian regime has the blood of Americans on its hands.\" The document stated Iran \"remains intent on destroying our close ally Israel, and that Iran and its proxies routinely instigate regional crises that not only threaten the lives of American servicemembers in the region but also prevent the region itself from pursuing the kind of peaceful and prosperous future that so many of its leaders and peoples clearly wish for\"."
    },
    {
        "title": "Trump threatens Canada with 100% tariff over China trade deal",
        "description": "Donald Trump has threatened to impose a 100% tariff on goods imported from Canada over its proposed trade deal with China. ",
        "url": "https://news.sky.com/story/trump-threatens-canada-with-100-tariff-over-china-trade-deal-13498417",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-trump-tariffs-canada_7060975.jpg?20251024211416",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-24 15:05:00",
        "Headline": "The US president took to social media to warn prime minister Mark Carney \"China will eat Canada alive\". ",
        "Content": "Donald Trump has threatened to impose a 100% tariff on goods imported from Canada over its proposed trade deal with China.  Canada negotiated an agreement to lower tariffs on Chinese electric vehicles in return for lower import taxes on Canadian farm products earlier this month. The US president initially said it was what Canadian prime minister Mark Carney \"should be doing and it's a good thing for him to sign a trade deal\". But in a post on Mr Trump's Truth social media platform on Saturday, he said if Mr Carney \"thinks he is going to make Canada a 'Drop Off Port' for China to send goods and products into the United States, he is sorely mistaken\". \"China will eat Canada alive, completely devour it, including the destruction of their businesses, social fabric, and general way of life,\" he said. \"If Canada makes a deal with China, it will immediately be hit with a 100% Tariff against all Canadian goods and products coming into the USA.\" Mr Trump also referred to Canada's leader as \"Governor Carney\", a continuation of the nickname he used for predecessor Justin Trudeau, in a further sign of their deteriorating relationship. \n                  Trump praises 'very brave' UK soldiers after anger over Afghanistan troops remarks\n                 \n                  China no longer America's top defence priority, Pentagon says\n                 \n                  Tories claim government in retreat on Chagos 'surrender' after Donald Trump broadside\n                 Carney has not yet reached a deal with Mr Trump to reduce some of the tariffs that he has already imposed on key sectors of the Canadian economy. But Canada has been protected by the heaviest impact of the tariffs by the Canada-US-Mexico Agreement, which is up for a review this year. The tariff threat came amid an escalating war of words with Mr Carney as the US president's push to acquire Greenland strained the NATO alliance. Read more from Sky News:Should Trump be given more time with King?Iran warns any attack will mean 'all-out war' Mr Carney, the former Bank of England governor, called for a new alliance to face down American and Chinese belligerence at a speech in Davos, Switzerland, this week. When Mr Trump took to the stage, he said that \"Canada lives because of the United States\" before the Canadian PM said his country can be an example that the world does not have to bend toward autocratic tendencies. Mr Trump later revoked his invitation to Mr Carney to join his \"Board of Peace\", an idea first proposed when he announced his plan to end the war in Gaza, but which now has designs to tackle other global conflicts. Earlier this week, Mr Trump posted on social media an altered image showing a map of the United States that included Canada, Venezuela, Greenland and Cuba as part of its territory."
    },
    {
        "title": "One dead after gas explosion and fires at top of New York City apartment building",
        "description": "A gas explosion sent fire racing through a high-rise apartment building in New York City, killing one person and injuring 14 others.",
        "url": "https://news.sky.com/story/firefighters-tackling-blaze-at-high-rise-building-in-new-york-13498271",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-new-york-new-york-city_7144146.jpg?20260124104839",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-24 07:51:00",
        "Headline": "The blaze engulfed parts of the top floors of the 17-storey building in the Bronx, with people seen leaning out of windows calling for help, authorities said.",
        "Content": "A gas explosion sent fire racing through a high-rise apartment building in New York City, killing one person and injuring 14 others. The blaze engulfed parts of the top floors of the 17-storey building in the Bronx, and people were seen leaning out of windows calling for help, authorities said. Around a dozen apartments have sustained major damage, Chief of Department John Esposito said, adding that firefighters were investigating reports of a gas smell on the 15th and 16th floors when the explosion went off. It came as temperatures in the city plunged below -10C overnight. Officials said the building had been undergoing renovations and work on the natural gas system had been completed and inspected. The cause of the explosion was under investigation. \"It's an incredible tragedy. We're sending all our thoughts to the families involved,\" Leila Bozorg, deputy mayor for housing and planning said. Read more from Sky News:'Life-threatening' winter storm to hit USTrump-backed investors finalise TikTok deal \n                  Minneapolis latest: Man shot dead by federal agents\n                 \n                  Death in Minneapolis: The shooting dividing America\n                 \n                  'Life-threatening' storm forecast in US as more than a dozen states declare emergency\n                 The fire started in the early hours of Saturday morning and more than 200 fire and emergency personnel were working at the scene. \"There were injuries. It was a very, very difficult night on a very cold night, which caused even more difficulty,\" Fire Commissioner Lillian Bonsignore said. Authorities did not immediately release information on the person who died in the blaze. Around half a million New Yorkers live in aging buildings run by the city's housing authority, known as NYCHA, which is the largest in the nation."
    },
    {
        "title": "CVC-backed Global Sport Group adds to stable with $300m Equine Network deal",
        "description": "The sports vehicle backed by CVC Capital Partners, the former owner of Formula One motor racing, is close to striking a $300m deal to buy a majority stake in Equine Network, a US-based equestrian sports league.",
        "url": "https://news.sky.com/story/cvc-backed-global-sport-group-adds-to-stable-with-300m-equine-network-deal-13498337",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-horse-horses_7144329.jpg?20260124142946",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-24 12:52:00",
        "Headline": "The vehicle which holds stakes in Premiership Rugby and the commercial rights to Spain’s La Liga is close to sealing an agreement to buy into US-based equestrian sports, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The sports vehicle backed by CVC Capital Partners, the former owner of Formula One motor racing, is close to striking a $300m deal to buy a majority stake in Equine Network, a US-based equestrian sports league. Sky News has learnt that Global Sport Group (GSG), which owns stakes in assets such as women's professional tennis and Six Nations Rugby, is lining up its first new league investment since the new entity was created. Sports industry sources said the deal could be struck and announced in the coming days. Equine Network operates equestrian-based sports competitions ranging from team roping rodeo events to showjumping tournaments, and has benefited from growing spectator and participant interest in the American market. The business, which has been built over several years by chief executive Tom Winsor, now consists of 40 owned and operated competitions, as well as more than 800 events operated by third parties. A significant proportion of Equine Network's competition revenues is understood to be awarded to competitors in prize money, with some tournaments' prize funds reaching tens of millions of dollars. GSG's investment in Equine Network will increase the vehicle's exposure to the US and bring into its portfolio a profitable and fast-growing league. \n                  Rosa couldn't figure out why her phone kept going missing just as she was leaving for work…\n                 \n                  Championship club Preston North End FC holds talks with Chelsea suitor\n                 \n                  10-year passport rule confusion cleared up | Money newsletter\n                 One source said the deal would underpin GSG's model of using its network of sports industry executives to aid investment in technology infrastructure, to expand fan engagement and enhance commercial opportunities in areas such as sponsorship and data services. The deal will come as CVC-backed GSG prepares to bring in billions of dollars of new debt and equity funding as it seeks to become a global sports powerhouse. Sky News revealed this month that GSG, which is chaired by the former BT executive Marc Allera, was launching a €2.7bn debt refinancing process alongside talks with third-party investors from the private equity arena. GSG also owns interests in Premiership Rugby, the top flights of French and Spanish football, and international volleyball. Its new warchest is aimed at acquiring a series of other assets in sports with substantial commercial growth prospects. Once completed, the deal will enable CVC to remain invested in its sports portfolio for longer, while also paving the way for the sale of a minority stake in GSG or a future initial public offering on a major international stock exchange. Having made billions of dollars from its ownership of F1 - one of the most lucrative deals in the history of sport - CVC has bought stakes in leagues and other assets spanning a spectrum of elite sporting assets over the last two decades. CVC's backing of global sports properties is intended to position it to maximise their commercial potential through new media and sponsorship rights deals, as well as their expansion into new formats aimed at drawing wider audiences amid rapid shifts in media consumption. Its sporting assets will remain autonomous and independent of one another, despite the new umbrella holding entity. One expected benefit of the GSG approach would be the sourcing of new investment opportunities, with CVC potentially interested in the acquisition of further elite tennis tournaments. Global sports properties have become one of the hottest growth areas for private capital in recent years, with firms such as Ares, Silver Lake Partners and Bridgepoint all investing substantial sums in teams, leagues and other assets across the industry. CVC and GSG have been contacted for comment."
    },
    {
        "title": "Championship club Preston North End FC holds talks with Chelsea suitor",
        "description": "A wealthy US-Saudi investor who expressed an interest in buying Chelsea Football Club four years ago has been in talks with one of the founding members of the English Football League about a potential investment.",
        "url": "https://news.sky.com/story/championship-club-preston-north-end-fc-holds-talks-with-chelsea-suitor-13498336",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-preston-football_7144226.jpg?20260124125207",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-24 12:49:00",
        "Headline": "Amr Zedan, a US-born Saudi businessman who has interests in sectors including energy and horseracing, has held talks about an investment in one of the Football League’s founding members, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A wealthy US-Saudi investor who expressed an interest in buying Chelsea Football Club four years ago has been in talks with one of the founding members of the English Football League about a potential investment. Sky News has learnt that Amr Zedan, who has business interests spanning sectors from energy to horseracing, has held a series of discussions with Preston North End's board in recent weeks about a deal. Sources said the talks had stalled in recent weeks, with the playoff-chasing Lilywhites also exploring investment options with other parties. Preston North End is one of England's oldest football teams, having initially been established in 1866 as a cricket club before becoming a founder member of the Football League in 1888. In July 2024, the Hemmings family, which has owned the club since 2010, drafted in bankers from Rothschild to examine options for bringing in new investment or a change of owner. People close to the club said a process was ongoing in which it was continuing to hold talks with potential buyers and investors, and that the process was being run in a professional and comprehensive manner. A spokesperson for Mr Zedan said that he and the club had been in discussions since early December \"regarding an investment in the club intended to support its long-term Premier League ambitions\". \n                  CVC-backed Global Sport Group adds to stable with $300m Equine Network deal\n                 \n                  Rosa couldn't figure out why her phone kept going missing just as she was leaving for work…\n                 \n                  10-year passport rule confusion cleared up | Money newsletter\n                 The spokesperson claimed there had been a \"lack of constructive engagement by club owners as money coming early into the transfer window which is now closing was key to [Mr Zedan's] enthusiasm for supporting the club, its community and loyal fan base\". This weekend, people close to the Lancashire club disputed this characterisation of the discussions, although the identities of other parties involved in the process was unclear. Mr Zedan was among a large number of parties who were named as prospective buyers of Chelsea when Roman Abramovich was effectively forced to sell the London club in the wake of Vladimir Putin's invasion of Ukraine. He is thought to be willing to re-engage with Preston North End's board about a deal, but could also now turn his attention to another club. Preston North End is chaired by Ian Penrose, an experienced businessman who was appointed to the role last autumn. He sits on the board of Playtech, the London-listed gaming technology company, and previously ran Arena Leisure and Sportech. Despite losing 4-0 at promotion rivals Middlesbrough on Saturday, Preston have a realistic chance of competing in the end-of-season play-offs, from which one of four teams will win promotion to the Premier League. Its most famous player, Tom Finney, appeared for the club in the 1950s, when The Lilywhites twice finished second in English football's top tier. In recent decades, Preston has often spent time in the lower divisions, but has been in the Championship since its last promotion campaign in 2014-15. The club was bought by local businessman Trevor Hemmings, who died in 2021, having also owned assets including Blackpool Tower, and stakes in Center Parcs and Pontin's. In common with many English professional clubs, Preston is lossmaking, with its owners funding its ongoing losses and ploughing in excess of £100m into it. The club has been led for the last 15 years by Peter Ridsdale, the former Leeds United and Cardiff City chief. Talks with prospective investors come as many other English professional clubs seek new owners - most notably, Championship side Sheffield Wednesday, which collapsed into administration last summer, resulting in a punishing points deduction. The new Independent Football Regulator is establishing a licensing regime for club-owners in the top five tiers of English football, beginning in the 2027-28 season. Preston North End FC has been contacted for comment."
    },
    {
        "title": "Buyout firms plot £1.5bn takeover of private hospitals giant Spire",
        "description": "Britain's largest operator of private hospitals is in talks with a pack of buyout firms about a takeover that would result in it becoming the latest FTSE-250 company to disappear from the London stock market.",
        "url": "https://news.sky.com/story/buyout-firms-plot-16315bn-takeover-of-private-hospitals-giant-spire-13498263",
        "image_url": "https://e3.365dm.com/20/01/1920x1080/skynews-spire-parkway-hospital_4901374.jpg?20260124072624",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-24 07:23:00",
        "Headline": "Bridgepoint and Triton Partners are among the private equity groups interested in a take-private deal for Britain's biggest private hospitals operator, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's largest operator of private hospitals is in talks with a pack of buyout firms about a takeover that would result in it becoming the latest FTSE-250 company to disappear from the London stock market. Sky News has learnt that private equity firms including Bridgepoint and Triton Partners are exploring bids for Spire Healthcare Group, which runs nearly 40 of the UK's biggest private hospitals. City sources said the pair were among a broader group of parties which had expressed interest in making offers for the company ahead of a deadline set by its advisers this week. Advent International and Bain Capital are also said to have made contact with Rothschild, which is running the process, but are not expected to progress further. Chaired by Sir Ian Cheshire, the City grandee who has run DIY chain B&Q's parent, Kingfisher, and now also chairs the commercial property group Land Securities, Spire's board is said to be keen to progress discussions with prospective bidders in the coming weeks. If it progresses, any deal about a takeover of the company is expected to be agreed within the next few months, an insider said this weekend. A number of other financial investors and overseas trade buyers are also thought to be part of the process, which was initiated amid pressure from major shareholders. \n                  CVC-backed Global Sport Group adds to stable with $300m Equine Network deal\n                 \n                  Rosa couldn't figure out why her phone kept going missing just as she was leaving for work…\n                 \n                  Championship club Preston North End FC holds talks with Chelsea suitor\n                 Bridgepoint's interest is particularly intriguing because it was the owner of Oasis Dental Care, a large dentistry chain, during a period it was run by Justin Ash - who is now chief executive of Spire. Triton Partners is an experienced healthcare industry investor, owning assets such as Pharmanovia, a speciality producer of prescription medicines. In addition to its hospitals network, Spire runs more than 50 clinics, medical centres and consulting rooms across the UK. It is the largest provider of hip and knee operations in the country. The company also operates a network of private GP practices, as well as providing occupational health services to hundreds of corporate clients. In total, it works with nearly 9,000 consultants and employs thousands of people. In 2024, it delivered care to over 1.3 million patients. Leading investors in Spire have been pushing for corporate action to arrest its flagging share price, including exploring options to realise value from its property estate, much of which it owns on a freehold basis. In the wake of a Sky News report last September, Spire confirmed it was \"actively evaluating actions that could drive long-term sustainable shareholder value\". \"As part of this review, it has commenced discussions with a number of parties in relation to a range of potential options, which may include (but is not limited to) a potential sale of the Company, value generation from the Hospital property estate and increased strategic focus on private payors,\" it reiterated in December. In a trading update that month, the company said full-year adjusted earnings before interest, tax, depreciation and amortisation would be at the lower end of a forecast range of £270m-£285m. While private hospital capacity has increasingly been earmarked to perform routine operations on NHS patients, budget constraints have intervened to restrict the number of such procedures being carried out. Read more from Sky News:Trading platform backs Reeves on cash ISA curbsSurprise bounceback in December sales Spire was formed in 2007 when BUPA sold its hospitals division to Cinven, the private equity firm. A 29.9% stake in the company is now owned by Mediclinic Group, a private healthcare provider established in South Africa in 1983. In 2021, some of Spire's leading shareholders rejected a 250p-a-share offer from Australia's Ramsay Healthcare, saying the proposal undervalued the business. Spire's stock has fallen by more than 23% over the last year. On Friday, it closed at 178.2p, giving the company a market capitalisation of just under £725m. Any bid would need to be at a very significant premium to that level in order to win the backing of major investors. Spokespeople for Spire, Advent, Bain, Bridgepoint and Triton all declined to comment."
    },
    {
        "title": "Andy Burnham opens door to Commons return and will seek to stand in by-election",
        "description": "Andy Burnham has said he has sought permission to enter the selection process to run as a candidate for the Labour Party in the upcoming Gorton and Denton by-election.",
        "url": "https://news.sky.com/story/andy-burnham-opens-door-to-commons-return-and-will-seek-to-stand-in-by-election-13498291",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-andy-burnham_7144964.jpg?20260124235101",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-24 09:30:00",
        "Headline": "Mr Burnham says the decision has been \"difficult\" but insists he will support the work of the government, \"not undermine it\". ",
        "Content": "Andy Burnham has said he has sought permission to enter the selection process to run as a candidate for the Labour Party in the upcoming Gorton and Denton by-election. The Greater Manchester mayor said on X: \"I have today written to the Chair of Labour's National Executive Committee seeking permission to enter the selection process for a candidate for the forthcoming Gorton and Denton by-election.\" It comes after former minister Andrew Gwynne formally stepped down on Friday on health grounds. As a directly-elected mayor, Mr Burnham needs to get approval from Labour's ruling national executive committee (NEC) before entering the race to be the party's candidate. In his letter to the NEC, which he shared on social media, Mr Burnham said the decision had been \"difficult\" but insisted he would support the work of the government \"not undermine it\" and that he had \"passed on this assurance to the Prime Minister\". Mr Burnham claimed there was now \"a direct threat to everything Greater Manchester has always been about from a brand of politics which seeks to pit people against each other\". He added: \"I see this by-election as the front line of that fight for the Manchester way and I feel I owe it to a city which has given me so much to lead it from the front, despite the risks involved.\" \n                  Andy Burnham facing 24-hour ultimatum over his Labour future\n                 \n                  Andy Burnham, next PM? The big hurdle facing popular mayor\n                 \n                  Unison leadership result shows Starmer's grip on Labour machine is slipping\n                 If elected, Mr Burnham would be required by law to stand down as mayor of Greater Manchester, which would then trigger a by-election for that role. If he became an MP, he could mount a leadership challenge against Sir Keir Starmer. However, the NEC can still block his bid for selection by refusing permission, and supporters of Sir Keir are reported to be mobilising to prevent him from becoming a candidate. Political correspondent Andy Burnham's bid to return to Westminster poses a massive political dilemma for the Labour Party leadership. Blocking the so-called 'King in the North', would cause outrage among the wing of the party already prone to rebelling against Sir Keir Starmer – and give grist to the mill of a Conservative Party that already delights in describing the PM as \"weak\".  The NEC might justify that decision by arguing that calling a mayoral by-election after just two years in office is fraught with political risk – not to mention expense. Reform are on the march. There is no guarantee his Labour successor would win.  Enabling a route back to parliament for a popular politician who's been incredibly open about his leadership ambitions, and his critique of the PM, may seem naïve. Loyal Labour MPs argue the constant leadership speculation which would follow Burnham's installation in parliament would be a self-inflicted psychodrama, an unnecessary distraction for a government already struggling to make headway with a weary public.   Burnham has told the NEC he wants to support the government, not undermine it. But circumstances change. And if he's installed in the Commons ahead of a disastrous set of election results in May – there are many who might look to him for leadership.   For now Mr Burnham's thrown down the gauntlet to the NEC - daring it to deny his request.\n Of course, even if it decides to put him on the shortlist he'd still need to be picked by local party members - and then he'd have to actually win the by-election. But he's decided the gamble is worth it. \n But several senior Labour figures have called for Mr Burnham to be allowed to stand, with the party's deputy leader, Lucy Powell, saying the decision should be up to local party members. London mayor Sir Sadiq Khan said: \"I think if Andy Burnham wants to be a member of Parliament, Andy Burnham should be allowed to be a member of Parliament.\" Ed Miliband, the energy secretary, said Mr Burnham would be \"a massive asset\" in parliament, and hoped the Gorton and Denton party members would have \"the option\" of selecting him as a candidate. Read more from Sky News:Trump pays tribute to UK soldiers after Afghanistan remarks rowIran warns any attack will mean 'all-out war' The timetable for the Gorton and Denton by-election is short. The deadline for applicants to put their name forward is midnight on Sunday, with a longlist of candidates set to be drawn up by a selection panel on Monday. Shortlisting interviews will be held on Tuesday before hustings and selection will take place next Saturday. Mr Burnham lost two previous Labour leadership challenges - against Mr Miliband in 2010 and Jeremy Corbyn in 2015."
    },
    {
        "title": "'Real possibility' May elections could lead to break up of UK, says Wales' First Minister Eluned Morgan",
        "description": "The first minister of Wales has said May's local elections could have \"profound implications\" and there's \"a real possibility\" they could set a path towards the break up of the UK.",
        "url": "https://news.sky.com/story/real-possibility-may-elections-could-lead-to-break-up-of-uk-says-wales-first-minister-eluned-morgan-13498433",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-eluned-morgan-phillips_7144378.jpg?20260124204355",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-24 15:35:00",
        "Headline": "Scottish and Welsh parliament elections are among those taking place in May - with the results seen as crucial for Sir Keir Starmer's future.",
        "Content": "The first minister of Wales has said May's local elections could have \"profound implications\" and there's \"a real possibility\" they could set a path towards the break up of the UK. Speaking on Sunday Morning with Trevor Phillips, Baroness Eluned Morgan agreed the country could fragment if nationalist leaders end up in power in Scotland, Northern Ireland and Wales. \"I think there's a real possibility of that,\" said Baroness Morgan, who is also the leader of Welsh Labour. \"I think it's time people woke up to that as a possibility,\" she added. \"The elections in May could have profound implications, not just for the people of Wales and their public services, but also for the situation in the whole of the United Kingdom. The danger is real.\" Some commentators believe the 7 May vote could see Labour pushed into third place behind Reform in Scotland and Wales - where the party could lose control of the Senedd for the first time ever. Last week, Scotland's first minister, John Swinney, told Trevor Phillips he thought nationalist leaders could be in power in all the devolved parliaments by the end of 2026. He said a really strong showing by the Scottish National Party (SNP) would be a green light to demand another independence referendum. \n                  Welsh first minister accuses Westminster of treating Wales unfairly\n                 \n                  Plaid Cymru leader was 'turned down' for meeting with PM, he claims\n                 \n                  Is Labour losing Wales to Reform? \n                 Council elections, mayoral elections, and Scottish and Welsh parliament elections are all taking place in May - and the results are seen as crucial for Sir Keir Starmer's future. Baroness Morgan said she agreed the prime minister would \"inevitably\" be under pressure if his party suffers big losses. Read more from Sky News:Burnham facing ultimatum over his Labour futurePart of Devon pier washed away during Storm Ingrid Wes Streeting and Andy Burnham are among those rumoured as potential challengers and possible future prime ministers in such a scenario. However, allies of Sir Keir said in November he wouldn't go quietly and would fight any effort to remove him. The full interview with Baroness Morgan will be broadcast tomorrow on Sunday Morning With Trevor Phillips from 8.30am."
    },
    {
        "title": "National Police Service: New 'British FBI' to fight serious crime and help local police tackle everyday offences",
        "description": "A \"British FBI\" will be created to fight the most serious crime and help local police forces focus on tackling everyday offences.",
        "url": "https://news.sky.com/story/national-police-service-new-british-fbi-to-fight-serious-crime-and-help-local-police-tackle-everyday-offences-13498076",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-shabana-mahmood-with-police-policing_7144966.jpg?20260124235443",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-24 22:29:00",
        "Headline": "The National Police Service will be responsible for rolling out tech to all local forces - including facial recognition.",
        "Content": "A \"British FBI\" will be created to fight the most serious crime and help local police forces focus on tackling everyday offences. The National Police Service (NPS) will be established in England and Wales to tackle crimes such as terrorism, fraud and organised crime that are not constrained by areas, the home secretary will announce on Sunday. Shabana Mahmood will say the NPS will attract \"world-class talent\" and use \"state-of-the-art\" technology - although a start date has not been revealed. The NPS will be in charge of purchasing new tech and equipment for all forces - and will include a nationwide roll-out of facial recognition tech, which has seen London's Metropolitan Police arrest more than 1,700 suspects in two years. It will also bring the National Crime Agency, counter-terrorism policing, regional organised crime units, police helicopters and national road policing under a single organisation. Currently, different forces are responsible for those sections of national policing. A national police commissioner will be appointed to lead the NPS, making them the most senior police officer in the country. The home secretary said: \"The current policing model was built for a different century. \"Some local forces lack the skills or resources they need to fight complex modern crime such as fraud, online child abuse or organised criminal gangs. \"We will create a new National Police Service - dubbed 'the British FBI' - deploying world-class talent and state-of-the-art technology to track down and catch dangerous criminals. \"In doing so, local forces will be able to spend more time fighting crime in their communities.\" Read more: Out of date policing needs 'overdue' shake up, says Met Police chief One of the main aims is to boost the 43 local forces' ability to spend more time fighting crime in their communities, such as shoplifting, drug dealing, phone theft and anti-social behaviour. The Home Office said the NPS will make sure the public receives the same service from the police, no matter where they live. The new force will also set professional standards and training requirements for policing, so every officer in the country is subject to the same standards. In a bid to be more accountable to the public, local forces will have new targets on 999 response times, victim satisfaction, public trust and confidence. They will be published, and forces will be graded for comparison. As policing in Scotland and Northern Ireland is devolved, the NPS will only cover England and Wales. The announcement comes ahead of Ms Mahmood announcing plans which the government has said will be the largest reforms to policing since the police service was founded 200 years ago. She is expected to outline reforms that mean local forces protect their community, and national policing protects everyone. Watch the interview with Ms Mahmood on Sunday Morning With Trevor Phillips from 8.30am on Sky News."
    },
    {
        "title": "Police officers warned they must hold work licence or face the sack",
        "description": "Police officers in England and Wales must hold a work licence or face the sack, the Home Office has announced.",
        "url": "https://news.sky.com/story/police-officers-warned-they-must-hold-work-licence-or-face-the-sack-13498279",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-officers-file_7144108.jpg?20260124093421",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-24 08:30:00",
        "Headline": "Home Secretary Shabana Mahmood is expected to announce the biggest shake-up to policing in decades on Monday.",
        "Content": "Police officers in England and Wales must hold a work licence or face the sack, the Home Office has announced. Officers must also renew the Licence to Practise over the course of their career. The plans, which come as part of reforms set to be announced by the Home Office, are designed to teach officers new skills as criminal techniques advance. This includes standards in tackling violence against women and girls along with neighbourhood policing. But officers who fail to reach the standard when applying, after opportunities to try again, will be dismissed. Crime and policing minister Sarah Jones said: \"Every police officer needs to remain match fit to protect their communities. As crime evolves, we expect police to evolve more quickly. \"The Licence to Practise will equip every officer with the skills and capabilities to do the job - whether new to the force or a policing veteran. \"Under these reforms, police forces will catch more criminals and protect their local communities.\" The Home Office said the plans had been drawn up from other professions including law and medicine. Read more:Revamped British passports rolling out this monthHome secretary vows to end UK's 'golden ticket' for asylum seekers Home Secretary Shabana Mahmood is expected to announce reforms on Monday. The Home Office has said they will be the biggest shake-up to policing in decades. The white paper, titled 'From local to national: a new model for policing', will promise to implement the programme in phases."
    },
    {
        "title": "Steve Coogan on how his Irish identity drew him to an infamous bust-up",
        "description": "Steve Coogan says he doesn't want to fully be part of the British establishment because you cannot \"get rid of the history which weighs heavily on all of us\".",
        "url": "https://news.sky.com/story/steve-coogan-on-how-his-irish-identity-drew-him-to-an-infamous-bust-up-13498085",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-steve-coogan-eanna-hardwicke_7143691.jpg?20260123152259",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2026-01-24 00:01:00",
        "Headline": "The BAFTA-winning actor says his Irish heritage helped him tap into the infamous row between footballer Roy Keane and Ireland's manager Mick McCarthy in the lead-up to the 2002 World Cup for his latest film.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n Steve Coogan says he doesn't want to fully be part of the British establishment because you cannot \"get rid of the history which weighs heavily on all of us\". The 60-year-old actor is of Irish heritage - his mother was born in Ireland and so were his paternal grandparents. He tells Sky News during an interview for his new film Saipan that his ancestry has shaped his view of the world for the better. \"I don't feel fully like I want to be part of the British establishment because I feel like, you know, I'm not a royalist by any amount because I see them as a symbol of a sort of colonial approach to the world of which the Irish were nationally victims, historically, and that stuff matters in the way you view things. \"It served me well, I think. I like the feeling of being outside the establishment and having an Irish heritage helps with that. I think it's good creatively not to feel too close to what I would call the British establishment.\" Saipan centres on the idea of national identity through an infamous argument between Cork native Roy Keane and his then-Irish football team manager, Mick McCarthy, in the lead-up to the 2002 World Cup. McCarthy was born in Barnsley and is second-generation Irish. The former Manchester United player is reported to have called McCarthy \"not even Irish\" and that he didn't respect him as a player, a manager, or a man. The explosive disagreement centred around how McCarthy was conducting the Republic of Ireland team and their training routine on their journey to the World Cup finals. The row, which saw the Cork footballer leave Saipan 10 days before the tournament began, is considered one of football's biggest controversies. Coogan plays McCarthy in the film and says McCarthy's sense of Irish identity is what drew him to the role. \"Mick McCarthy, who I play, played for Ireland and managed the Irish team, but there's still, because you sound English, there's that whiff of, you're not really one of us, and you sound like the people who colonised us and there's a residue of that, however, that doesn't fully go away, I suppose, and all that interests me very much. \"I think I understand because I am that, but in terms of the story that we're telling is the whole idea of people who are Irish, how they feel about that and how they present that to the world. There's that aspect of it, there's also the aspect of how you conduct yourself as an individual, but that idea of national identity, I found really interesting about the film.\" The BAFTA-winning actor says he had a phone call with McCarthy before he portrayed him in the film to get his side of the story and allow for a fair depiction of his side. Speaking previously on the Under the Cosh podcast, McCarthy said he has \"no axe to grind\" against Coogan and thought it was kind of him to call. He did joke, however, that it could be a \"Baby Reindeer\" situation and he could submit \"a big £20m lawsuit\" if he doesn't like the production's interpretation. Keane has always argued that he just wanted the Irish team to strive to put their best foot forward in the competition. Reflecting on the moment, Coogan says Keane was simply determined to succeed. \"I think he was not bothered about whether people personally liked him. It was about whether he was achieving what he was supposed to do. And that is so laser-focused and you need people like that to achieve great things. \"And often people who achieve great things are very wanting in other areas because everything is subsumed by this drive and this one direction. And so, it's almost like to have someone who's excellent at one particular thing, to then expect them to be a completely rounded individual is almost impossible.\" Eanna Hardwicke, who plays his fellow Cork man in the film, says he thinks it was that element, for Roy, that \"got under his skin\" \"I think it's too high a standard sometimes, but it's never an excuse for bad behaviour,\" he said. \"I'm doing a play in the National Theatre at the moment and I was just talking to somebody backstage who said they worked with some of the last generation of amazing British theatre actors who came of age maybe in the 60s, 70s, and they said working with them was tough because of the discipline and what they demanded of his own compromising. \"And obviously we live in a slightly different world now and we need to make those compromises, but I think there is something quite powerful as well about being around people who go, you know, I really want this to be the very best it can be, and I'm always inspired by that.\" Roy Keane hasn't formally spoken about the film. Saipan is in cinemas now."
    }
]