[
    {
        "title": "Trump links drive for air traffic controllers with 'intellectual disabilities' to Washington plane crash",
        "description": "Donald Trump has linked a diversity drive at the Federal Aviation Administration (FAA) under previous governments to a deadly plane crash in Washington DC.",
        "url": "https://news.sky.com/story/donald-trump-links-diversity-hiring-at-government-agency-to-deadly-washington-plane-crash-13299661",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-washington-plane-helicopter_6814507.jpg?20250130173927",
        "type": "Home",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-01-30 16:10:00",
        "Headline": "US President Donald Trump gave a White House briefing on the crash in Washington DC on Wednesday night which saw 67 people killed when an American Airlines jet collided with a military helicopter.",
        "Content": "By Claire Gilbody Dickerson, news reporter   Donald Trump has linked a diversity drive at the Federal Aviation Administration (FAA) under previous governments to a deadly plane crash in Washington DC. Sixty-seven people were killed when an American Airlines jet and a military helicopter collided mid-air on Wednesday night. Speaking at the White House, the new US president suggested the diversity efforts had made air travel less safe. He said: \"We do not know what led to this crash, but we have some very strong opinions and ideas.\" Read the latest on the crash in Washington Later Sky's US partner NBC news said staffing at Reagan Washington National Airport, where air traffic controllers were guiding the flights, was \"not normal\", according to an initial FAA report. The tower normally has a controller who focuses specifically on helicopter traffic. \n                  What were the pilots doing? Experts weigh in on crash and what investigation will look for\n                 \n                  Washington plane crash: Profound sense of loss in Wichita - the 'air capital of the world' \n                 \n                  Washington plane crash: What we know so far\n                 But at the time of Wednesday night's crash, a source said, one controller was overseeing both plane and helicopter activity. The FAA, which controls air traffical control as well as certification of personnel and aircraft, is currently without an administrator. Its former boss Michael Whitaker stepped down on 20 January - the day of Mr Trump's inauguration. Mr Whitaker had clashed with Mr Trump's confidante Elon Musk over the SpaceX rocket launches during his tenure at the FAA. Since starting as head of the FAA in October 2023, he was also forced to respond to Boeing's safety and quality problems, and worked to hire more air traffic controllers amid a shortage of staff. At his briefing Mr Trump blamed his predecessor, former president Joe Biden, for lowering standards for air traffic controllers. \"We have to have our smartest people,\" he said. \"They have to be naturally talented geniuses.\" He added: \"The FAA is actively recruiting workers who suffer severe intellectual disabilities, psychiatric problems, and other mental and physical conditions under a diversity and inclusion hiring initiative spelled out on the agency's website.\" The American Association of People with Disabilities responded to these claims, saying: \"FAA employees with disabilities did not cause [the] tragic plane crash.\" \"The investigation into the crash is still ongoing. It is extremely inappropriate for the president to use this tragedy to push an anti-diversity hiring agenda. Doing so makes all Americans less safe,\" it said in a statement on X. Mr Trump also criticised former president Barack Obama for putting \"policy over safety\" when it came to US aviation.   \"I changed the Obama standards from very mediocre at best to extraordinary,\" Mr Trump said. He said that after being sworn in last week, he signed an executive order which \"restored the highest standards of air traffic controllers\". Read more:Washington DC plane crash: What we know so farAir traffic control heard diverting planes moments after collision  Mr Trump also said: \"When I left office and Biden took over he changed them [standards for those who work in aviation system] back to lower than ever before, I put safety first, Obama, Biden and the Democrats put policy first, they put politics at a level that nobody's ever seen because this was the lowest level.\" At a later briefing he was asked if gender or race played a role. He answered: \"It may have, I don't know. Incompetence may have played a role.\" Mr Trump's nominee to lead the US Army, Daniel Driscoll, said at a Senate confirmation hearing on Thursday that training exercises near an airport like the Washington National Airport may not be appropriate. Meanwhile, authorities have said the rescue operation for passengers on board the jet and the Black Hawk helicopter shifted to a recovery one as they believe there are no survivors. US correspondent In two news conferences on Thursday morning, the pain and bewilderment were both palpable. At the Washington airport where the American Eagle jet was due to land, officials were forced to say what no air crash investigator wants to - that rescue had turned to recovery.\n There was a sense of bewilderment over how this could have happened, a pledge to find out what went wrong and most importantly to recover the bodies of all those who died. Read more here A total of 28 bodies, including 27 from the jet and one from the helicopter, have been recovered from the Potomac river. Two black boxes from the airplane have also been recovered, Sky's US partner network NBC News reported. \"This was a dark and excruciating night in our nation's capital and in our nation's history and a tragedy of terrible proportions as one nation, we grieve for every precious soul that has been taken from us so suddenly,\" Mr Trump said. The American Airlines jet was carrying 60 passengers and four crew when it crashed with the military helicopter, carrying three soldiers, shortly before 9pm local time on Wednesday. Flight 5342 was preparing to land on runway 33 at the Ronald Reagan Washington National Airport when it collided with the helicopter. The crash is the country's worst civil aviation disaster since 2009. Mr Trump also said \"the people in the helicopter should have seen where they were going\" and that the crash involved a \"confluence of bad decisions\". The Pentagon and US army are investigating the crash, US defense secretary Pete Hegseth said on X."
    },
    {
        "title": "Tracking the Washington plane crash: What flight data, air traffic control recordings and CCTV tell us",
        "description": "With no survivors expected to be found, the focus is turning to how a military helicopter on a training exercise collided with an American Airlines passenger jet.",
        "url": "https://news.sky.com/story/tracking-the-washington-plane-crash-what-flight-data-air-traffic-control-recordings-and-cctv-tell-us-13299577",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-teaser-dandf-dc_6814745.png?20250130154846",
        "type": "Home",
        "Author": "Sky News&#x27; Data and Forensics Unit",
        "Date Published": "2025-01-30 13:45:00",
        "Headline": "Using flight tracking data, CCTV and recordings of air traffic control, Sky News' Data and Forensics Unit examines the events that led to the disaster, which is thought to have killed 67 people.",
        "Content": "By Sky News' Data and Forensics Unit   With no survivors expected to be found, the focus is turning to how a military helicopter on a training exercise collided with an American Airlines passenger jet. What we know so far At 8.47pm, with the plane at 600ft and preparing to cross over the river, an air traffic controller contacted the helicopter's pilot to tell them to pass behind the plane. \"PAT25 [military helicopter] do you have the CRJ [passenger jet] in sight? PAT25, pass behind the CRJ.\"  Airport security cameras captured the helicopter on a collision course with the plane in the final seconds before the crash.  Flight tracking websites lost sight of the plane at 8.48.03pm local time. Its last reported altitude was 275ft. Seconds after the crash, a gasp can be heard coming from the air traffic control room. \"Did you see that?\" someone asks.  The emergency alert was sounded around one minute later, at 8.48pm. \"Crash crash crash - this is Alert 3,\" rang the alert over the Metropolitan Washington Airports Authority Public Safety communications system. \"It's on the, uh… approaching runway 3-3. Approaching runway 3-3. Helicopter crash.\" After several minutes, someone asks to confirm the details. \"You said that was a helo and a CRJ?\" \"That is affirmative. A helo and a CRJ approaching at 3-3.\" \"Ok. How many souls on board?\" \"We don't have any of that information.\"  Police began to receive reports of a crash at 8.53pm. By 8.58pm, the first emergency response vehicle had arrived at the site and reported an aircraft in the water. Six minutes later, at 9.04pm, the search and rescue mission was launched, with the first boat arriving at 9.11pm. Why did the aircraft collide? Transport secretary Sean Duffy told a press conference that the crash was \"absolutely preventable\". Asked if the plane was aware there was a helicopter in the area, Mr Duffy replied: \"I would say the helicopter was aware that there was a plane in the area.\" A map published by the Federal Aviation Administration, which manages US airspace, advises helicopters flying to the east of the airport along the Potomac River to stay below 200ft. Flight tracking data, however, shows the military helicopter had quickly ascended to 300ft before the crash - 100ft above the recommended altitude. It's unclear if the helicopter took any action in response to the warning issued by air traffic control. Andrew Nicholson, chief executive of aviation security firm Osprey Flight Solutions, told Sky News that Black Hawk helicopters are typically very capable of avoiding obstacles in the sky, though a number of things could have gone wrong to cause the crash. Former air traffic controller Michele Robson suggests the instructions from the air traffic tower could have been clearer, especially considering there was another plane, an Airbus A319, in the helicopter's line of sight. \"I would expect them to have specified the airline as well so that there wasn't any confusion,\" she says. Ms Robson says it's possible that the helicopter pilot thought the Airbus, which was 9.2km away, was the much smaller American Eagle plane just 4.5km away. \"In the dark in a city environment with lots of lights, and at that distance, I don't think the helicopter would have been able to tell what type [of plane] the Airbus was that far away, so may have just assumed. \"The CRJ and Airbus look quite different, but in the dark it would make it much harder.\" Timeline shows how the crash response unfolded The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Singer Marianne Faithfull dies at the age of 78",
        "description": "Singer and actress Marianne Faithfull has died at the age of 78.",
        "url": "https://news.sky.com/story/singer-marianne-faithfull-dies-at-the-age-of-78-13299600",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-marianne-faithful-1964_6814943.jpg?20250130182723",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-30 14:10:00",
        "Headline": "Marianne Faithfull was best known for her 60s hit As Tears Go By, and for her starring roles in the films The Girl On A Motorcycle and Irina Palm.",
        "Content": "Singer and actress Marianne Faithfull has died at the age of 78. A spokesperson for her music promotion company Republic Media said: \"It is with deep sadness that we announce the death of the singer, songwriter and actress Marianne Faithfull. \"Marianne passed away peacefully in London today, in the company of her loving family. \"She will be dearly missed.\" Faithfull was best known for her 1964 hit As Tears Go By, written by Sir Mick Jagger, with whom she had a well-publicised relationship, and fellow Rolling Stones star Keith Richards. She also starred in films including The Girl On A Motorcycle and 2007's Irina Palm, for which she was nominated for a European Film Award for Best Actress. In recent years, she provided voice work for the 2021 remake of Dune and 2023's Wild Summon. She and Sir Mick began seeing each other in 1966 and became one of the most glamorous couples of Swinging London. He paid tribute to his \"wonderful friend and beautiful singer and a great actress\", and said he was \"so saddened\" by her death, as \"she was so much part of my life for so long\". Next to a picture of the pair arm in arm on Instagram, Sir Mick said Faithfull \"will always be remembered\". His Stones bandmates Ronnie Wood and Keith Richards also paid tribute, with Richards posting on Instagram that he was \"so sad and will miss her.\" His post was accompanied by a picture of the pair enjoying a drink together. Wood wrote on Jagger's post: \"Farewell dear Marianne.\" Born in 1946, Faithfull started her singing career in 1964 after being discovered by the Stones' manager Andrew Loog Oldham. Her self-titled debut album was released a year later, with As Tears Go By reaching number nine on the UK singles chart. She went on to have a string of successful singles, including Come And Stay With Me, This Little Bird, and Summer Nights, and famously dated Sir Mick from 1966 to 1970. Faithfull was prolific throughout the 60s, releasing six albums - some only in the UK and some for the US - as well as contributing backing vocals to the Beatles' Yellow Submarine and inspiring the Stones' Sympathy For The Devil. That decade also saw her star in films like 1967's I'll Never Forget What's'isname - where she was one of the first people to say f*** in a mainstream studio film - 1968's The Girl On A Motorcycle, and Tony Richardson's 1969 adaptation of Hamlet. Her affair with Sir Mick was notorious, with the couple being arrested in 1968 for possession of cannabis. She was also infamously found by police wearing only a bear skin rug when they arrived for a drugs raid at Richards' home in 1967. After breaking up with the Stones frontman, Faithfull spent two years homeless in Soho while suffering from anorexia and heroin addiction, before she started living in a squat. She wrote in her 1994 autobiography: \"For me, being a junkie was an admirable life. It was total anonymity, something I hadn't known since I was 17. \"As a street addict in London, I finally found it. I had no telephone, no address.\" Read more from Sky News:Badenoch disavows comments from Priti PatelHarvey Weinstein begs judge for earlier retrial In 1979, following success in Ireland with the country-themed Dreamin' My Dreams, Faithfull released the Grammy-nominated Broken English - widely considered her best album. She later achieved critical acclaim as a jazz and blues singer with 1987's Strange Weather and went to rehab that same decade. Faithfull released a total of 21 solo albums throughout her career. Her most recent was the spoken word album She Walks In Beauty from 2021, which saw her work with frequent Nick Cave collaborator Warren Ellis. She made a full recovery from breast cancer in 2006."
    },
    {
        "title": "Freed prisoner Zakaria Zubeidi a 'murderous extremist' to Israel but an inspiration to Palestinians",
        "description": "This third round of prisoner releases has been awash with images that feel loaded with symbolism and significance.",
        "url": "https://news.sky.com/story/freed-prisoner-zakaria-zubeidi-a-murderous-extremist-to-israel-but-an-inspiration-to-palestinians-13299769",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-zaharia-zubeidi-fatah_6814991.jpg?20250130193058",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-01-30 19:20:00",
        "Headline": "Zakaria Zubeidi, whose mother and brother were killed by Israeli troops, is a symbol of resistance to some Palestinians. A man who generates extraordinarily varied responses, he was mobbed by supporters on his release from prison.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n This third round of prisoner releases has been awash with images that feel loaded with symbolism and significance. We will remember Arbel Yehoud, frightened as she fought her way through a crowd in Khan Younis, or Agam Berger paraded in a fake IDF uniform and fitted with a bracelet in the colours of the Palestinian flag. Five Thai hostages, suddenly seen by the world. But for those on the West Bank, waiting for prisoners to be released and returned, there is a very different image that was celebrated. A man inside a coach, dressed in a prison-issue tracksuit, giving a victory sign while those outside cheer him vociferously. That man is Zakaria Zubeidi, a man who generates extraordinarily varied responses. In the minds of Israelis, Zubeidi is a murderous extremist with blood on his hands. To Palestinians, he is an inspiration, seen as a blend of resistance, leadership, and cultural pride. Zubeidi, born in the refugee camp in Jenin, grew up attending a theatre group in the camp that was supposed to promote understanding between Palestinians and Israelis, a cause fervently backed by his mother. He was shot in the leg by an Israeli soldier when he was 13 and was then jailed for the first time the following year after throwing stones at troops. He became the jail's spokesperson for all the child inmates. What followed were years of transient jobs, time in jail, and petty crime. But then in 2002, Zubeidi's life was transformed. His mother and brother were both killed by Israeli troops and, not long after, the camp was partly demolished, sparking fighting that killed dozens. He later said he was furious that none of the Israeli families who had attended his mother's theatre group got in touch to express sympathy. \"We opened our homes to you, we gave you everything but what did we get in return,\" he said in an interview. \"A bullet in my mother's chest.\" He joined the armed wing of Fatah and was blamed by Israel for planning the 2002 Beit She'an attack on a polling station that killed six civilians and injured more than 30 others. He was linked to more crimes just as his influence and control, especially in Jenin, grew. Read more:More than 100 Palestinian prisoners releasedCongo rebels take key city Israel named him as one of its most wanted people and, so it is claimed, tried and failed to kill him four times. Among Palestinians, his reputation soared as he defied the IDF. But then, apparently browbeaten, he changed tack, claiming it was impossible to defeat Israel, and decided to stop fighting in exchange for a pardon, which was later rescinded. Finally, in 2019, he was convicted by an Israeli military court of terrorism and imprisoned. Two years later, extraordinarily, he and five other prisoners escaped after digging a tunnel using kitchen utensils. Ever since, his name has been linked to people holding aloft a spoon - an unlikely symbol of Palestinian resistance. And now he is free. Zubeidi has been told he is banned from going back to Jenin, but he will be welcomed across the West Bank. There, he is revered; in Israel, he is reviled. A perfect symbol of how this ceasefire can blend joy and despair in a single moment."
    },
    {
        "title": "Mexico asks Google not to follow Trump's Gulf of America name change",
        "description": "Mexico's president has asked Google not to use Donald Trump's new name for the Gulf of Mexico - which he pledged to change to&#160;Gulf of America in&#160;one of his first acts as president.",
        "url": "https://news.sky.com/story/mexico-asks-google-not-to-follow-trumps-gulf-of-america-name-change-13299804",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-claudia-sheinbaum-mexico_6815108.jpg?20250130215310",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-30 20:19:00",
        "Headline": "In one of his first acts as president, Donald Trump signed an executive order requiring the Gulf of Mexico be renamed to the Gulf of America.",
        "Content": "Mexico's president has asked Google not to use Donald Trump's new name for the Gulf of Mexico - which he pledged to change to Gulf of America in one of his first acts as president. Earlier this week, Google said it would change the name of the body of water on Google Maps once it is officially updated in the US Geographic Names System. According to Mexico, the US cannot legally change the Gulf's name because under the United Nations Convention on the Law of the Sea, a country's sovereign territory only extends up to 12 nautical miles from the coastline. Reading out her letter to Google at a press conference on Thursday, Mexican President Claudia Sheinbaum said \"if a country wants to change the designation of something in the sea, it would only apply up to 12 nautical miles\", CNN reported. \"It cannot apply to the rest, in this case, the Gulf of Mexico.\" Ms Sheinbaum has previously joked that she was considering renaming the continent of North America to \"Mexican America\" in her country. She said: \"We ask that when you put Mexican America in the search engine, the map appears that we presented.\" A founding document from 1814, which preceded Mexico's constitution, used that name for the continent. Read more:Trump signs order for Guantanamo Bay migrant centreStreets empty in Chicago over Trump's immigration crackdown Under the changes on Google Maps, American users would see it online as the Gulf of America, while Mexican and Cuban users would see the name remain the Gulf of Mexico. Worldwide users would see both names. On Monday, Google explained the changes as part of \"longstanding practice,\" and added: \"When official names vary between countries, Maps users see their official local name. \"Everyone in the rest of the world sees both names. That applies here too.\""
    },
    {
        "title": "Bishop of Liverpool retires amid misconduct allegations as female bishop identifies herself as one of his accusers",
        "description": "The Bishop of Liverpool has announced his retirement days after facing allegations of misconduct from two women, including another bishop.",
        "url": "https://news.sky.com/story/bishop-of-liverpool-retires-amid-misconduct-allegations-13299545",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-john-perumbalath-church-of-england_6813185.jpg?20250128221052",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-30 12:54:00",
        "Headline": "One of the allegations came from another bishop, who accused the Right Reverend Dr John Perumbalath of sexual harassment. He denies the claims and has insisted: \"This is not a resignation occasioned by fault or by any admission of liability.\" ",
        "Content": "The Bishop of Liverpool has announced his retirement days after facing allegations of misconduct from two women, including another bishop. One woman said the Right Reverend Dr John Perumbalath kissed her without consent and groped her on separate occasions between 2019 and 2023, while the second, a female bishop, accused him of sexual harassment in 2023. The Rt Revd Beverley Mason, the Bishop of Warrington, later named herself as a second complainant in a statement. \"A bishop cannot be above the law. A bishop cannot be dealt differently from a priest. \"If anything, a bishop must be held to greater scrutiny. This is a biblical imperative,\" she said. Bishop Perumbalath, 58, has vehemently denied the allegations - and in his retirement letter, published online on Thursday, he reiterated his denial. The letter, shared by the Diocese of Liverpool, read: \"Having sought the permission of His Majesty the King, I have today taken the decision to retire from active ministry in the Church of England.\" \n                  Bishop of Liverpool should 'step aside' amid misconduct claims, say senior church leaders in city\n                 \n                  Bishop of Liverpool denies wrongdoing after misconduct allegations from two women\n                 \n                  Church of England concerned after government nearly halves funding for listed places of worship repairs\n                 Addressing the accusations, he continued: \"Since those allegations were made I have consistently maintained that I have not done anything wrong and continue to do so. \"I do not wish this story to become a distraction for this incredible diocese and its people whom it has been an honour and joy to serve,\" the bishop says in his letter. \"This is not a resignation occasioned by fault or by any admission of liability.\" The exact date for when the bishop's role will formally end is yet to be decided, but he is stepping back from ministering and leading the diocese as of Thursday. The letter continued: \"I have taken this decision for my own well-being, my family and the best interests of the Diocese. \"I have informed the Archbishop of York of my decision and I understand he will put in place the necessary arrangements for episcopal oversight of the diocese for the remainder of my time here and during the vacancy.\" The Archbishop of York Stephen Cottrell - who has faced calls to resign over separate safeguarding failures - said: \"I respect his decision and thank him for his ministry.\" \"My thoughts and prayers continue to be with all those who have been affected by this situation,\" he continued. \"I am committed to ensuring stability during this time of transition and will be putting the necessary arrangements in place to provide episcopal oversight for the diocese.\" An acting bishop will be announced in the coming days. The diocese - which on Wednesday pressured the bishop to step aside - said in a statement: \"We acknowledge his decision in taking this step for the good of the Diocese of Liverpool. \"This is a deeply painful situation, and we hold all concerned in our prayers.\" The misconduct allegations were reported by Channel 4 earlier this week but first made to the Church of England in 2023. The Church said the female bishop's complaint \"was looked into according to statutory safeguarding guidance… and an independent risk assessment undertaken\". \"This process concluded that there were no ongoing safeguarding concerns, but a learning outcome was identified with which the bishop fully engaged.\" More UK news:EuroMillions players urged to check ticketsWater bills to rise in England and Wales A \"further disclosure was made by another woman\" shortly after, the Church said. This was \"assessed not to be a safeguarding matter but a matter of alleged misconduct,\" it added. The Bishop of Warrington, later confirmed in a statement that she is the second complainant. She said she was advised of a complaint against the Bishop of Liverpool in March 2023, and \"raised what I believe were significant concerns, which included my own disclosure\". She added that \"we as a church have not properly and satisfactorily addressed concerns that have been raised,\" and hopes that after her disclosure, \"there will be no more defensiveness but an honest scrutiny of what we are doing, how we are doing it, where the gaps sit and how we address them\". Bishop Perumbalath's resignation comes at a tumultuous time for the Church of England, which has recently seen Justin Welby quit as Archbishop of Canterbury over the handling of another case."
    },
    {
        "title": "UK ticketholder bags £83m EuroMillions jackpot - as players urged to check tickets",
        "description": "A UK ticketholder has won the &#163;83m EuroMillions jackpot - but is yet to come forward to claim the prize.",
        "url": "https://news.sky.com/story/uk-ticketholder-bags-16383m-euromillions-jackpot-as-players-urged-to-check-tickets-13299481",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-euromillions-lottery_6619247.jpg?20240706005904",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-01-30 11:17:00",
        "Headline": "The winning numbers were announced nearly a week ago. It is the first UK EuroMillions jackpot win of the year,",
        "Content": "A UK ticketholder has won the £83m EuroMillions jackpot - but is yet to come forward to claim the prize. The winning player matched all five main numbers and both the lucky star numbers to win £83,474,081.80 in the draw on Friday 24 January. The main winning numbers were 02, 11, 19, 30 and 49, while the lucky star numbers were 03 and 08. Andy Carter, senior winners' advisor at Allwyn, the operator of The National Lottery, urged players to check their tickets. He said: \"What a fantastic night for a single UK ticket-holder who has scooped tonight's £83m EuroMillions jackpot! \"This lucky winner represents the first UK EuroMillions jackpot win of 2025, what a way to start the year.\" Last month, a UK ticket-holder claimed £177m in the EuroMillions draw, making them wealthier than popstar Dua Lipa, who is worth an estimated £104m. Read more from Sky News:Water bills in England and Wales to riseCoca-Cola, Sprite and Appletiser cans recalled in UK The winner, who chose to remain anonymous, scooped the third-biggest National Lottery winner ever. The biggest EuroMillions win by UK players was in 2022 when a single ticket-holder won £195m. Two months before that, Joe and Jess Thwaite, from Gloucester, won a then record-breaking £184,262,899 with a Lucky Dip ticket for the draw in May 2022."
    },
    {
        "title": "Bishop of Liverpool retires amid misconduct allegations as female bishop identifies herself as one of his accusers",
        "description": "The Bishop of Liverpool has announced his retirement days after facing allegations of misconduct from two women, including another bishop.",
        "url": "https://news.sky.com/story/bishop-of-liverpool-retires-amid-misconduct-allegations-13299545",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-john-perumbalath-church-of-england_6813185.jpg?20250128221052",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-30 12:54:00",
        "Headline": "One of the allegations came from another bishop, who accused the Right Reverend Dr John Perumbalath of sexual harassment. He denies the claims and has insisted: \"This is not a resignation occasioned by fault or by any admission of liability.\" ",
        "Content": "The Bishop of Liverpool has announced his retirement days after facing allegations of misconduct from two women, including another bishop. One woman said the Right Reverend Dr John Perumbalath kissed her without consent and groped her on separate occasions between 2019 and 2023, while the second, a female bishop, accused him of sexual harassment in 2023. The Rt Revd Beverley Mason, the Bishop of Warrington, later named herself as a second complainant in a statement. \"A bishop cannot be above the law. A bishop cannot be dealt differently from a priest. \"If anything, a bishop must be held to greater scrutiny. This is a biblical imperative,\" she said. Bishop Perumbalath, 58, has vehemently denied the allegations - and in his retirement letter, published online on Thursday, he reiterated his denial. The letter, shared by the Diocese of Liverpool, read: \"Having sought the permission of His Majesty the King, I have today taken the decision to retire from active ministry in the Church of England.\" \n                  Bishop of Liverpool should 'step aside' amid misconduct claims, say senior church leaders in city\n                 \n                  Bishop of Liverpool denies wrongdoing after misconduct allegations from two women\n                 \n                  Church of England concerned after government nearly halves funding for listed places of worship repairs\n                 Addressing the accusations, he continued: \"Since those allegations were made I have consistently maintained that I have not done anything wrong and continue to do so. \"I do not wish this story to become a distraction for this incredible diocese and its people whom it has been an honour and joy to serve,\" the bishop says in his letter. \"This is not a resignation occasioned by fault or by any admission of liability.\" The exact date for when the bishop's role will formally end is yet to be decided, but he is stepping back from ministering and leading the diocese as of Thursday. The letter continued: \"I have taken this decision for my own well-being, my family and the best interests of the Diocese. \"I have informed the Archbishop of York of my decision and I understand he will put in place the necessary arrangements for episcopal oversight of the diocese for the remainder of my time here and during the vacancy.\" The Archbishop of York Stephen Cottrell - who has faced calls to resign over separate safeguarding failures - said: \"I respect his decision and thank him for his ministry.\" \"My thoughts and prayers continue to be with all those who have been affected by this situation,\" he continued. \"I am committed to ensuring stability during this time of transition and will be putting the necessary arrangements in place to provide episcopal oversight for the diocese.\" An acting bishop will be announced in the coming days. The diocese - which on Wednesday pressured the bishop to step aside - said in a statement: \"We acknowledge his decision in taking this step for the good of the Diocese of Liverpool. \"This is a deeply painful situation, and we hold all concerned in our prayers.\" The misconduct allegations were reported by Channel 4 earlier this week but first made to the Church of England in 2023. The Church said the female bishop's complaint \"was looked into according to statutory safeguarding guidance… and an independent risk assessment undertaken\". \"This process concluded that there were no ongoing safeguarding concerns, but a learning outcome was identified with which the bishop fully engaged.\" More UK news:EuroMillions players urged to check ticketsWater bills to rise in England and Wales A \"further disclosure was made by another woman\" shortly after, the Church said. This was \"assessed not to be a safeguarding matter but a matter of alleged misconduct,\" it added. The Bishop of Warrington, later confirmed in a statement that she is the second complainant. She said she was advised of a complaint against the Bishop of Liverpool in March 2023, and \"raised what I believe were significant concerns, which included my own disclosure\". She added that \"we as a church have not properly and satisfactorily addressed concerns that have been raised,\" and hopes that after her disclosure, \"there will be no more defensiveness but an honest scrutiny of what we are doing, how we are doing it, where the gaps sit and how we address them\". Bishop Perumbalath's resignation comes at a tumultuous time for the Church of England, which has recently seen Justin Welby quit as Archbishop of Canterbury over the handling of another case."
    },
    {
        "title": "Singer Marianne Faithfull dies at the age of 78",
        "description": "Singer and actress Marianne Faithfull has died at the age of 78.",
        "url": "https://news.sky.com/story/singer-marianne-faithfull-dies-at-the-age-of-78-13299600",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-marianne-faithful-1964_6814943.jpg?20250130182723",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-30 14:10:00",
        "Headline": "Marianne Faithfull was best known for her 60s hit As Tears Go By, and for her starring roles in the films The Girl On A Motorcycle and Irina Palm.",
        "Content": "Singer and actress Marianne Faithfull has died at the age of 78. A spokesperson for her music promotion company Republic Media said: \"It is with deep sadness that we announce the death of the singer, songwriter and actress Marianne Faithfull. \"Marianne passed away peacefully in London today, in the company of her loving family. \"She will be dearly missed.\" Faithfull was best known for her 1964 hit As Tears Go By, written by Sir Mick Jagger, with whom she had a well-publicised relationship, and fellow Rolling Stones star Keith Richards. She also starred in films including The Girl On A Motorcycle and 2007's Irina Palm, for which she was nominated for a European Film Award for Best Actress. In recent years, she provided voice work for the 2021 remake of Dune and 2023's Wild Summon. She and Sir Mick began seeing each other in 1966 and became one of the most glamorous couples of Swinging London. He paid tribute to his \"wonderful friend and beautiful singer and a great actress\", and said he was \"so saddened\" by her death, as \"she was so much part of my life for so long\". Next to a picture of the pair arm in arm on Instagram, Sir Mick said Faithfull \"will always be remembered\". His Stones bandmates Ronnie Wood and Keith Richards also paid tribute, with Richards posting on Instagram that he was \"so sad and will miss her.\" His post was accompanied by a picture of the pair enjoying a drink together. Wood wrote on Jagger's post: \"Farewell dear Marianne.\" Born in 1946, Faithfull started her singing career in 1964 after being discovered by the Stones' manager Andrew Loog Oldham. Her self-titled debut album was released a year later, with As Tears Go By reaching number nine on the UK singles chart. She went on to have a string of successful singles, including Come And Stay With Me, This Little Bird, and Summer Nights, and famously dated Sir Mick from 1966 to 1970. Faithfull was prolific throughout the 60s, releasing six albums - some only in the UK and some for the US - as well as contributing backing vocals to the Beatles' Yellow Submarine and inspiring the Stones' Sympathy For The Devil. That decade also saw her star in films like 1967's I'll Never Forget What's'isname - where she was one of the first people to say f*** in a mainstream studio film - 1968's The Girl On A Motorcycle, and Tony Richardson's 1969 adaptation of Hamlet. Her affair with Sir Mick was notorious, with the couple being arrested in 1968 for possession of cannabis. She was also infamously found by police wearing only a bear skin rug when they arrived for a drugs raid at Richards' home in 1967. After breaking up with the Stones frontman, Faithfull spent two years homeless in Soho while suffering from anorexia and heroin addiction, before she started living in a squat. She wrote in her 1994 autobiography: \"For me, being a junkie was an admirable life. It was total anonymity, something I hadn't known since I was 17. \"As a street addict in London, I finally found it. I had no telephone, no address.\" Read more from Sky News:Badenoch disavows comments from Priti PatelHarvey Weinstein begs judge for earlier retrial In 1979, following success in Ireland with the country-themed Dreamin' My Dreams, Faithfull released the Grammy-nominated Broken English - widely considered her best album. She later achieved critical acclaim as a jazz and blues singer with 1987's Strange Weather and went to rehab that same decade. Faithfull released a total of 21 solo albums throughout her career. Her most recent was the spoken word album She Walks In Beauty from 2021, which saw her work with frequent Nick Cave collaborator Warren Ellis. She made a full recovery from breast cancer in 2006."
    },
    {
        "title": "UK ticketholder bags £83m EuroMillions jackpot - as players urged to check tickets",
        "description": "A UK ticketholder has won the &#163;83m EuroMillions jackpot - but is yet to come forward to claim the prize.",
        "url": "https://news.sky.com/story/uk-ticketholder-bags-16383m-euromillions-jackpot-as-players-urged-to-check-tickets-13299481",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-euromillions-lottery_6619247.jpg?20240706005904",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-30 11:17:00",
        "Headline": "The winning numbers were announced nearly a week ago. It is the first UK EuroMillions jackpot win of the year,",
        "Content": "A UK ticketholder has won the £83m EuroMillions jackpot - but is yet to come forward to claim the prize. The winning player matched all five main numbers and both the lucky star numbers to win £83,474,081.80 in the draw on Friday 24 January. The main winning numbers were 02, 11, 19, 30 and 49, while the lucky star numbers were 03 and 08. Andy Carter, senior winners' advisor at Allwyn, the operator of The National Lottery, urged players to check their tickets. He said: \"What a fantastic night for a single UK ticket-holder who has scooped tonight's £83m EuroMillions jackpot! \"This lucky winner represents the first UK EuroMillions jackpot win of 2025, what a way to start the year.\" Last month, a UK ticket-holder claimed £177m in the EuroMillions draw, making them wealthier than popstar Dua Lipa, who is worth an estimated £104m. Read more from Sky News:Water bills in England and Wales to riseCoca-Cola, Sprite and Appletiser cans recalled in UK The winner, who chose to remain anonymous, scooped the third-biggest National Lottery winner ever. The biggest EuroMillions win by UK players was in 2022 when a single ticket-holder won £195m. Two months before that, Joe and Jess Thwaite, from Gloucester, won a then record-breaking £184,262,899 with a Lucky Dip ticket for the draw in May 2022."
    },
    {
        "title": "Kate visits children's hospice as she is named patron, following in Diana's footsteps",
        "description": "The Princess of Wales has been playing with children at a hospice where she has just been named patron.",
        "url": "https://news.sky.com/story/kate-visits-childrens-hospice-as-she-is-named-patron-following-in-dianas-footsteps-13299506",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-princess-of-wales-hand_6814590.jpg?20250130134708",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-30 12:09:00",
        "Headline": "The Princess of Wales has been playing with children at a hospice in Wales and had her hand painted by 9-year-old Lottie, whose sibling is being treated there. The engagement is part of her phased return to royal duties after cancer treatment.",
        "Content": " The Princess of Wales has been playing with children at a hospice where she has just been named patron. In a surprise solo engagement, Kate visited Ty Hafan Children's Hospice, near Cardiff, where she spent time with children, families and staff. She has followed in the footsteps of Princess Diana and the King in becoming the institution's figurehead. The trip is her second engagement this week after she continues to make a phased return to royal duties after she confirmed earlier this month she is now in remission from cancer. Irfon Rees, chief executive of Ty Hafan, said: \"We are deeply honoured that Her Royal Highness The Princess of Wales has become patron of Ty Hafan and it was an absolute pleasure to welcome Her Royal Highness to our hospice for the first time today. \"As our patron, Her Royal Highness will be an inspiration for children with life-shortening conditions and their families, our dedicated staff and volunteers and everyone who so generously supports us.\" Royal correspondent You couldn’t get a more emotional visit, as it feels like the Princess is getting back to what you could call a bit of normality.  This was her first “away day” as they sometimes call it, since 2023 and her first public engagement in Wales since October 2023, so she wanted it to be a special one, choosing Ty Hafan, or Haven House in english, a hospice charity that helps around 400 families.  Crouching down to meet the amazing children who live with life limiting conditions and their parents, she stayed cheerful, asked lots of questions, this was about building new relationships as it was announced that she was now going to be their new patron.  In the garden she was shown the stones placed for children who have died, but also importantly made happy memories here. Kate’s already said she wants to help breakdown some of the perceptions about hospices and show they can be a place of joy and solace.  The Chief Executive of Ty Hafan told me her backing couldn’t be more welcome at a time when the hospice sector is crying out for support. She follows the King and Princess Diana in taking on the role of patron. But this was about more than that. After a year of very few engagements due to her cancer diagnosis, this was a very public reminder of her genuine and heartfelt commitment to getting more support for children and families as she continues her gradual return to work. The Princess of Wales was seen talking and playing with different children, and had her hand painted by 9-year-old Lottie, whose sibling is being treated at the hospice. Read more:Royal Mail could scale back second class deliveriesShould new dads get more time off? Ty Hafan was founded in 1999 by Suzanne Goodall, after a fundraising campaign lasting more than a decade, when she discovered there wasn't a children's hospice in Wales. Diana was patron during the fundraising phase, and the King took on the role in 2001."
    },
    {
        "title": "Sir Tony Blair and Gordon Brown lead tributes to Lord Prescott at his funeral",
        "description": "Former Labour prime ministers Gordon Brown and Sir Tony Blair have led tributes to \"working class hero\" Lord Prescott at his funeral.",
        "url": "https://news.sky.com/story/sir-tony-blair-and-gordon-brown-lead-tributes-to-lord-prescott-at-his-funeral-13299585",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-john-prescott-labour_6753282.jpg?20241121062458",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-30 13:54:00",
        "Headline": "The great and the good of the Labour Party joined the Prescott family at his funeral at Hull Minster in the city where he was an MP for 40 years.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Former Labour prime ministers Gordon Brown and Sir Tony Blair have led tributes to \"working class hero\" Lord Prescott at his funeral. The great and the good of the Labour Party remembered the UK's longest-serving deputy prime minister, who died in November aged 86 after a battle with Alzheimer's. The funeral cortege included a Jaguar hearse and limousine, in a nod to Lord Prescott's nickname \"two Jags\". Sir Keir Starmer and Deputy Prime Minister Angela Rayner gave readings as former cabinet ministers and current MPs gave their final goodbye to the Labour stalwart. Politics latest: 'John was guardian of the party's conscience' Both Sir Tony, who Lord Prescott was deputy for, and Gordon Brown gave eulogies at Hull Minster, in the city where he served as an MP for 40 years until he was given a peerage in 2010. Mr Brown, who was prime minister from 2007-2010, hailed a \"life lived to the full\", which \"touched the lives and changed the lives of millions who may never have met John but are today better off because of him\". \n                  Justice secretary's assisted dying intervention is explosive - and potentially embarrassing for PM\n                 \n                  Gordon Brown says assisted dying should not be legalised\n                 \n                  Ministers to kick off fresh search for £130,000-a-year football referee\n                 He called Lord Prescott a \"working-class hero\" who \"kept the show on the road during difficult times\". \"We will never see his like again. A man of the people he certainly was, in a class by himself, a one-off,\" Mr Brown said. \"One of a kind but one of us, in the best sense of the word.\" He also reminded mourners of his cameo in Gavin & Stacey - \"seen by millions\" - as Nessa's rejected suitor. And, in reference to the infamous incident where Lord Prescott punched a man who threw an egg at him, he said: \"John was a man of the people because he could connect with people, and I don't just mean that man in Rhyl who dared to hurl an egg at him.\" Read more:Labour's pugnacious stalwart who pulled no punchesJohn Prescott, a pork pie and me He said Lord Prescott, who came from very little, believed in the \"goodness in everyone...even that egg-thrower in Wales\". Sir Tony also shared some anecdotes, recalling the \"pandemonium\" that ensued after \"the punch\" in the 2001 general election campaign. 👉Listen to Politics At Jack And Sam's on your podcast app👈 He said he called his deputy with reluctance to ask him to apologise, but Lord Prescott told him: \"The answer is no, I'm not bloody apologising and that's the end of it.\" The former PM said: \"Classic\". He said he watched the footage again recently and was \"cheering him on\". Sir Tony told the congregation he \"played a huge part\" in government but was also \"a good man, a man who started as my political partner and became my personal friend\". \"I hope he will see in this vast gathering today, a recognition of that working-class boy from a small Welsh town, who rose to the highest ranks of the land by merit, by graft, by greatness of courage and character, and he will feel deservedly at peace.\" One of Lord Prescott's two sons, David, told the funeral: \"He was a man who spent his life overcoming challenges and helping others.\" He added: \"Prescott was always at your service.\" He described how the \"bolshy ex-waiter\" became deputy PM and talked about his father's final days in a care home, thanking all the carers and staff who looked after him. In lieu of flowers, the Prescott family requested donations for Alzheimer's Research UK. Following the service, mourners went to Lord Prescott's favourite Chinese restaurant in Hull."
    },
    {
        "title": "BBC apologises to staff over handling of Russell Brand complaints",
        "description": "The BBC has apologised to staff who felt unable to raise concerns about Russell Brand's behaviour during his time working for the broadcaster.",
        "url": "https://news.sky.com/story/bbc-apologises-to-staff-over-handling-of-russell-brand-complaints-13299507",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-russell-brand-portrait_6289357.jpg?20230918112319",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-30 12:05:00",
        "Headline": "The BBC publishes a review into its handling of complaints about Russell Brand during his time working for the broadcaster. Brand, who has always strongly denied any allegations against him, was invited to take part to give his perspective, but \"did not accept the invitation\".",
        "Content": "The BBC has apologised to staff who felt unable to raise concerns about Russell Brand's behaviour during his time working for the broadcaster. The corporation said eight complaints of misconduct had been considered - only two of which were made during the presenter's time there. It also acknowledged it was \"clear\" some presenters had been able to abuse their positions in the past. Brand, 49, has strongly denied any allegations against him and previously said all his sexual relationships were \"absolutely always consensual\". The BBC's apology came as it released the findings of an internal review of its handling of complaints, which cost £662,000 and involved interviews with 39 individuals. This focused on the comedian's work for 6 Music and Radio 2 between 2006 and 2008. BBC director of editorial complaints and reviews Peter Johnston, who carried out the investigation, found there were many staff who felt \"unable to raise\" concerns and believed Brand \"would always get his way and therefore they stayed silent\". The review looked into reports the presenter allegedly urinated \"into cups or bottles while in the studio, throwing objects, allegations of sex on the premises including with competition winners, and exposure while in the studio in front of staff and guests\". It also investigated a complaint made by a woman working in the same building as the BBC's office in Los Angeles. She claimed Brand flashed her in 2008, and later laughed about the incident on his radio show. Mr Johnston said the \"culture of the time undoubtedly influenced what was acceptable/tolerated\" but that \"the processes for raising concerns were also not as developed as they are now\". The BBC has since improved these processes, he said. Brand was asked to participate - 'but did not accept' Russell Brand joined the BBC as a regular presenter for 6 Music in April 2006 and joined Radio 2 in November that year. He had a regular show on the station until he left in 2008 over a \"high-profile editorial breach\" - when he made a prank call to Fawlty Towers actor Andrew Sachs. His hiring was \"understood (by those keen to hire him) to be a decision which carried editorial risks, given the nature of his comedy performances and material, but was in line with the strategy of the station at the time\" - which was to attract younger audiences and bring in presenters with profile, the review found. Brand was asked to participate in the review, Mr Johnston said, \"but did not accept the invitation\". The review was carried out after a joint investigation by Channel 4's Dispatches programme, The Times and Sunday Times, published in 2023, in which Brand was accused by four women of sexual assaults and abuse between 2006 and 2013. 'We know it has not been easy to speak out' In response to the report, the BBC said that after allegations were raised in 2023, \"it was important that this was looked into methodically\" and the review had been \"conducted with the greatest care\". Their statement said: \"We want to thank the individuals who have participated, as we know that it has not been easy to speak out about some of the issues the review addresses. \"The review considered eight complaints of misconduct about Russell Brand, only two of which were made while he was engaged by the BBC, one formally and one informally.  It is of great concern that some of these individuals felt unable to raise concerns about Russell Brand's behaviour at the time, and the BBC has apologised to them as part of this review. \"It is also clear that there were compliance inadequacies on some of Russell Brand's Radio 2 shows which led to content being aired that would not be broadcast today. Russell Brand left the BBC in 2008 following a high-profile editorial breach.\" The BBC highlighted an ongoing police investigation into Brand and said it had been in contact with the Metropolitan Police throughout the review. \"The BBC acknowledges that Russell Brand categorically denies all public allegations made against him,\" the broadcaster added. Culture Secretary Lisa Nandy said the complaints in the report were \"horrendous\" and added: \"As is the fact that staff felt unable to raise concerns because they did not think that they would be believed or taken seriously.\" The BBC needs to take action to reassure staff and the public that it takes the issues seriously, she said. \"Power imbalances and a perception that certain stars cannot be challenged are sadly not unique to this case.\" The BBC's review comes after similar investigations into Brand's time working on Channel 4 shows including Big Brother spin-offs Big Brother's Big Mouth and Big Brother's Celebrity Hijack. TV production company Banijay UK found that concerns raised informally about his alleged behaviour between 2004 and 2008 were \"not properly escalated or adequately addressed\". A separate Channel 4 investigation found there was no evidence that bosses were aware of any accusations. In November, the Met Police said they had handed a file of evidence to the Crown Prosecution Service (CPS). A man in his 40s was interviewed by officers three times under caution in relation to allegations of non-recent sexual offences, the force said at the time. Sky News has contacted representatives for Brand for comment."
    },
    {
        "title": "Man jailed after XL bully attacked 12-year-old girl",
        "description": "A man has been jailed after his XL bully attacked a 12-year-old girl.",
        "url": "https://news.sky.com/story/man-jailed-after-xl-bully-attacked-12-year-old-girl-13299404",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-gwent-police-justin-allison_6814257.png?20250130111940",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-01-30 08:55:00",
        "Headline": "The girl was seriously injured and needed hospital treatment after she was \"viciously attacked\", police say.",
        "Content": "A man has been jailed after his XL bully attacked a 12-year-old girl. Justin Allison, 38, from Ebbw Vale, was sentenced to three years in prison at Newport Crown Court on Wednesday. The girl was seriously injured and needed hospital treatment, police said. Allison had previously pleaded guilty to possessing a banned breed without a licence and being in charge of a dog dangerously out of control in a public place. He also admitted a charge of possessing an offensive weapon in a private place. Officers were called to an address in Nantyglo, Blaenau Gwent, last October to reports a child had been attacked by a dog. Gwent Police said the dog - later identified as an XL bully - was seized and humanely destroyed by a vet. The breed was banned in England and Wales from 1 February last year, with the ban later extended to Scotland. Read more from Sky News:Water bills in England and Wales to riseLove Island star bailed after dog attack Detective Chief Inspector Virginia Davies said the girl was \"viciously attacked\" after Allison \"failed to keep his dog under control\". She said the case \"should serve as a reminder to all dog owners of the importance of having your dog under control at all times\".  \"We take all reports of suspected irresponsible dog ownership seriously and we urge everyone to follow the legislation and guidance to prevent events like this happening in the future,\" she added. Allison was also banned from owning dogs for 10 years."
    },
    {
        "title": "Trump links drive for air traffic controllers with 'intellectual disabilities' to Washington plane crash",
        "description": "Donald Trump has linked a diversity drive at the Federal Aviation Administration (FAA) under previous governments to a deadly plane crash in Washington DC.",
        "url": "https://news.sky.com/story/donald-trump-links-diversity-hiring-at-government-agency-to-deadly-washington-plane-crash-13299661",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-washington-plane-helicopter_6814507.jpg?20250130173927",
        "type": "World",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-01-30 16:10:00",
        "Headline": "US President Donald Trump gave a White House briefing on the crash in Washington DC on Wednesday night which saw 67 people killed when an American Airlines jet collided with a military helicopter.",
        "Content": "By Claire Gilbody Dickerson, news reporter   Donald Trump has linked a diversity drive at the Federal Aviation Administration (FAA) under previous governments to a deadly plane crash in Washington DC. Sixty-seven people were killed when an American Airlines jet and a military helicopter collided mid-air on Wednesday night. Speaking at the White House, the new US president suggested the diversity efforts had made air travel less safe. He said: \"We do not know what led to this crash, but we have some very strong opinions and ideas.\" Read the latest on the crash in Washington Later Sky's US partner NBC news said staffing at Reagan Washington National Airport, where air traffic controllers were guiding the flights, was \"not normal\", according to an initial FAA report. The tower normally has a controller who focuses specifically on helicopter traffic. \n                  What were the pilots doing? Experts weigh in on crash and what investigation will look for\n                 \n                  Washington plane crash: Profound sense of loss in Wichita - the 'air capital of the world' \n                 \n                  Washington plane crash: What we know so far\n                 But at the time of Wednesday night's crash, a source said, one controller was overseeing both plane and helicopter activity. The FAA, which controls air traffical control as well as certification of personnel and aircraft, is currently without an administrator. Its former boss Michael Whitaker stepped down on 20 January - the day of Mr Trump's inauguration. Mr Whitaker had clashed with Mr Trump's confidante Elon Musk over the SpaceX rocket launches during his tenure at the FAA. Since starting as head of the FAA in October 2023, he was also forced to respond to Boeing's safety and quality problems, and worked to hire more air traffic controllers amid a shortage of staff. At his briefing Mr Trump blamed his predecessor, former president Joe Biden, for lowering standards for air traffic controllers. \"We have to have our smartest people,\" he said. \"They have to be naturally talented geniuses.\" He added: \"The FAA is actively recruiting workers who suffer severe intellectual disabilities, psychiatric problems, and other mental and physical conditions under a diversity and inclusion hiring initiative spelled out on the agency's website.\" The American Association of People with Disabilities responded to these claims, saying: \"FAA employees with disabilities did not cause [the] tragic plane crash.\" \"The investigation into the crash is still ongoing. It is extremely inappropriate for the president to use this tragedy to push an anti-diversity hiring agenda. Doing so makes all Americans less safe,\" it said in a statement on X. Mr Trump also criticised former president Barack Obama for putting \"policy over safety\" when it came to US aviation.   \"I changed the Obama standards from very mediocre at best to extraordinary,\" Mr Trump said. He said that after being sworn in last week, he signed an executive order which \"restored the highest standards of air traffic controllers\". Read more:Washington DC plane crash: What we know so farAir traffic control heard diverting planes moments after collision  Mr Trump also said: \"When I left office and Biden took over he changed them [standards for those who work in aviation system] back to lower than ever before, I put safety first, Obama, Biden and the Democrats put policy first, they put politics at a level that nobody's ever seen because this was the lowest level.\" At a later briefing he was asked if gender or race played a role. He answered: \"It may have, I don't know. Incompetence may have played a role.\" Mr Trump's nominee to lead the US Army, Daniel Driscoll, said at a Senate confirmation hearing on Thursday that training exercises near an airport like the Washington National Airport may not be appropriate. Meanwhile, authorities have said the rescue operation for passengers on board the jet and the Black Hawk helicopter shifted to a recovery one as they believe there are no survivors. US correspondent In two news conferences on Thursday morning, the pain and bewilderment were both palpable. At the Washington airport where the American Eagle jet was due to land, officials were forced to say what no air crash investigator wants to - that rescue had turned to recovery.\n There was a sense of bewilderment over how this could have happened, a pledge to find out what went wrong and most importantly to recover the bodies of all those who died. Read more here A total of 28 bodies, including 27 from the jet and one from the helicopter, have been recovered from the Potomac river. Two black boxes - a cockpit voice recorder and the flight data recorder - from the airplane have also been recovered. The American Airlines jet was carrying 60 passengers and four crew when it crashed with the military helicopter, carrying three soldiers, shortly before 9pm local time on Wednesday. Flight 5342 was preparing to land on runway 33 at the Ronald Reagan Washington National Airport when it collided with the helicopter. The crash is the country's worst civil aviation disaster since 2009. Mr Trump also said \"the people in the helicopter should have seen where they were going\" and that the crash involved a \"confluence of bad decisions\". The Pentagon and US army are investigating the crash, US defense secretary Pete Hegseth said on X."
    },
    {
        "title": "American Airlines jet found upside down and in three pieces after mid-air collision in Washington DC",
        "description": "An American Airlines plane was found upside down and in three sections after colliding mid-air with a military helicopter over a major river in Washington DC.",
        "url": "https://news.sky.com/story/american-airlines-jet-found-upside-down-and-in-three-pieces-after-mid-air-collision-in-washington-dc-13299547",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-washington-plane-helicopter_6814482.jpg?20250130122631",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-30 12:58:00",
        "Headline": "A passenger plane with 64 people on board was landing at the Ronald Reagan Washington National Airport at the time of the crash with the military aircraft, which had three soldiers on board.",
        "Content": " An American Airlines plane was found upside down and in three sections after colliding mid-air with a military helicopter over a major river in Washington DC. A total of 28 bodies - 27 from the passenger plane and one from the helicopter - have been recovered from the Potomac River after the two aircraft fell into the icy waters around 9pm local time (2am UK time) on Wednesday night. American Airlines flight 5342, which had 60 passengers and four crew on board, was flying into the Ronald Reagan Washington National Airport from Wichita in Kansas when the collision took place. Washington crash latest: Follow live updates The US army Black Hawk helicopter, which had three soldiers on board, was on a training flight at the time. An initial search and rescue mission to look for survivors became a recovery operation on Thursday morning, Washington DC fire chief John Donnelly said in an update at around 7.30am local time. \"We don't believe there are any survivors,\" he said.  US Figure Skating, the national governing body for the sport in the US, said in a statement that several members of its skating community were on the passenger plane. It said the athletes and coaches were returning home from a training camp in Kansas. Doug Zeghibe, chief executive of The Skating Club of Boston, said he believes 14 skaters who were returning from Kanas were \"lost\" in the plane crash. \"Of those 14 skaters, six were from the Skating Club of Boston. Two coaches and two teenage athletes, and two of the athletes' mums,\" he said. Two of the victims have been named as championship figure skaters Evgenia Shishkova and Vadim Naumov. Read more:What we know so far about the collisionWorld champion skaters 'on board' - who were the passengers?Air traffic control heard diverting planes The married couple from Russia won the world championship in pairs figure skating in 1994 and were working as coaches at the club in Boston. The Kremlin said in a statement on Thursday morning: \"Bad news from Washington today. We regret and offer condolences to the families and friends who lost those of our fellow citizens who died in this plane crash.\" US President Donald Trump thanked first responders for their \"incredible work\", and said he was \"monitoring the situation and will provide more details as they arise\", in a statement late on Wednesday. He added: \"May God bless their souls.\" Sir Keir Starmer and Foreign Secretary David Lammy also sent their condolences to the families of those on board and the emergency responders.  Crash 'absolutely preventable' The collision occurred in some of the most tightly controlled and monitored airspace in the world, just over three miles south of the White House and the US Capitol. Officials have not yet said what they believe caused the collision, with American Airlines chief executive Robert Isom saying they do not know why the military aircraft came into the path of the plane. Transport secretary Sean Duffy said the wreckage of the plane was found upside down in three sections in waist-deep water. The wreckage of the helicopter was also found. He said he believes the crash was \"absolutely preventable\" and both aircraft were on \"standard flight patterns\" and had \"standard communication\" before the crash. A few minutes before landing, air traffic controllers asked the American Airlines flight if it could land on the shorter Runway 33 at Ronald Reagan Washington National Airport and the pilots said they were able to. Controllers then cleared the plane to land on Runway 33. Flight tracking sites showed the plane circled around to approach the new runway from the south, while the helicopter was approaching from the north. Pete Hegseth, who was sworn in as US defence secretary only days ago, said an investigation into the crash had started \"immediately\"."
    },
    {
        "title": "Tracking the Washington plane crash: What flight data, air traffic control recordings and CCTV tell us",
        "description": "With no survivors expected to be found, the focus is turning to how a military helicopter on a training exercise collided with an American Airlines passenger jet.",
        "url": "https://news.sky.com/story/tracking-the-washington-plane-crash-what-flight-data-air-traffic-control-recordings-and-cctv-tell-us-13299577",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-teaser-dandf-dc_6814745.png?20250130154846",
        "type": "World",
        "Author": "Sky News&#x27; Data and Forensics Unit",
        "Date Published": "2025-01-30 13:45:00",
        "Headline": "Using flight tracking data, CCTV and recordings of air traffic control, Sky News' Data and Forensics Unit examines the events that led to the disaster, which is thought to have killed 67 people.",
        "Content": "By Sky News' Data and Forensics Unit   With no survivors expected to be found, the focus is turning to how a military helicopter on a training exercise collided with an American Airlines passenger jet. What we know so far At 8.47pm, with the plane at 600ft and preparing to cross over the river, an air traffic controller contacted the helicopter's pilot to tell them to pass behind the plane. \"PAT25 [military helicopter] do you have the CRJ [passenger jet] in sight? PAT25, pass behind the CRJ.\"  Airport security cameras captured the helicopter on a collision course with the plane in the final seconds before the crash.  Flight tracking websites lost sight of the plane at 8.48.03pm local time. Its last reported altitude was 275ft. Seconds after the crash, a gasp can be heard coming from the air traffic control room. \"Did you see that?\" someone asks.  The emergency alert was sounded around one minute later, at 8.48pm. \"Crash crash crash - this is Alert 3,\" rang the alert over the Metropolitan Washington Airports Authority Public Safety communications system. \"It's on the, uh… approaching runway 3-3. Approaching runway 3-3. Helicopter crash.\" After several minutes, someone asks to confirm the details. \"You said that was a helo and a CRJ?\" \"That is affirmative. A helo and a CRJ approaching at 3-3.\" \"Ok. How many souls on board?\" \"We don't have any of that information.\"  Police began to receive reports of a crash at 8.53pm. By 8.58pm, the first emergency response vehicle had arrived at the site and reported an aircraft in the water. Six minutes later, at 9.04pm, the search and rescue mission was launched, with the first boat arriving at 9.11pm. Why did the aircraft collide? Transport secretary Sean Duffy told a press conference that the crash was \"absolutely preventable\". Asked if the plane was aware there was a helicopter in the area, Mr Duffy replied: \"I would say the helicopter was aware that there was a plane in the area.\" A map published by the Federal Aviation Administration, which manages US airspace, advises helicopters flying to the east of the airport along the Potomac River to stay below 200ft. Flight tracking data, however, shows the military helicopter had quickly ascended to 300ft before the crash - 100ft above the recommended altitude. It's unclear if the helicopter took any action in response to the warning issued by air traffic control. Andrew Nicholson, chief executive of aviation security firm Osprey Flight Solutions, told Sky News that Black Hawk helicopters are typically very capable of avoiding obstacles in the sky, though a number of things could have gone wrong to cause the crash. Former air traffic controller Michele Robson suggests the instructions from the air traffic tower could have been clearer, especially considering there was another plane, an Airbus A319, in the helicopter's line of sight. \"I would expect them to have specified the airline as well so that there wasn't any confusion,\" she says. Ms Robson says it's possible that the helicopter pilot thought the Airbus, which was 9.2km away, was the much smaller American Eagle plane just 4.5km away. \"In the dark in a city environment with lots of lights, and at that distance, I don't think the helicopter would have been able to tell what type [of plane] the Airbus was that far away, so may have just assumed. \"The CRJ and Airbus look quite different, but in the dark it would make it much harder.\" Timeline shows how the crash response unfolded The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Freed prisoner Zakaria Zubeidi a 'murderous extremist' to Israel but an inspiration to Palestinians",
        "description": "This third round of prisoner releases has been awash with images that feel loaded with symbolism and significance.",
        "url": "https://news.sky.com/story/freed-prisoner-zakaria-zubeidi-a-murderous-extremist-to-israel-but-an-inspiration-to-palestinians-13299769",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-zaharia-zubeidi-fatah_6814991.jpg?20250130193058",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-01-30 19:20:00",
        "Headline": "Zakaria Zubeidi, whose mother and brother were killed by Israeli troops, is a symbol of resistance to some Palestinians. A man who generates extraordinarily varied responses, he was mobbed by supporters on his release from prison.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n This third round of prisoner releases has been awash with images that feel loaded with symbolism and significance. We will remember Arbel Yehoud, frightened as she fought her way through a crowd in Khan Younis, or Agam Berger paraded in a fake IDF uniform and fitted with a bracelet in the colours of the Palestinian flag. Five Thai hostages, suddenly seen by the world. But for those on the West Bank, waiting for prisoners to be released and returned, there is a very different image that was celebrated. A man inside a coach, dressed in a prison-issue tracksuit, giving a victory sign while those outside cheer him vociferously. That man is Zakaria Zubeidi, a man who generates extraordinarily varied responses. In the minds of Israelis, Zubeidi is a murderous extremist with blood on his hands. To Palestinians, he is an inspiration, seen as a blend of resistance, leadership, and cultural pride. Zubeidi, born in the refugee camp in Jenin, grew up attending a theatre group in the camp that was supposed to promote understanding between Palestinians and Israelis, a cause fervently backed by his mother. He was shot in the leg by an Israeli soldier when he was 13 and was then jailed for the first time the following year after throwing stones at troops. He became the jail's spokesperson for all the child inmates. What followed were years of transient jobs, time in jail, and petty crime. But then in 2002, Zubeidi's life was transformed. His mother and brother were both killed by Israeli troops and, not long after, the camp was partly demolished, sparking fighting that killed dozens. He later said he was furious that none of the Israeli families who had attended his mother's theatre group got in touch to express sympathy. \"We opened our homes to you, we gave you everything but what did we get in return,\" he said in an interview. \"A bullet in my mother's chest.\" He joined the armed wing of Fatah and was blamed by Israel for planning the 2002 Beit She'an attack on a polling station that killed six civilians and injured more than 30 others. He was linked to more crimes just as his influence and control, especially in Jenin, grew. Read more:More than 100 Palestinian prisoners releasedCongo rebels take key city Israel named him as one of its most wanted people and, so it is claimed, tried and failed to kill him four times. Among Palestinians, his reputation soared as he defied the IDF. But then, apparently browbeaten, he changed tack, claiming it was impossible to defeat Israel, and decided to stop fighting in exchange for a pardon, which was later rescinded. Finally, in 2019, he was convicted by an Israeli military court of terrorism and imprisoned. Two years later, extraordinarily, he and five other prisoners escaped after digging a tunnel using kitchen utensils. Ever since, his name has been linked to people holding aloft a spoon - an unlikely symbol of Palestinian resistance. And now he is free. Zubeidi has been told he is banned from going back to Jenin, but he will be welcomed across the West Bank. There, he is revered; in Israel, he is reviled. A perfect symbol of how this ceasefire can blend joy and despair in a single moment."
    },
    {
        "title": "Three Israelis and five Thai hostages freed in Gaza",
        "description": "Three Israeli and five Thai hostages have been freed under a phased ceasefire deal that has halted fighting in Gaza.",
        "url": "https://news.sky.com/story/three-israelis-and-five-thai-hostages-freed-in-gaza-13299385",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-agam-berger-israeli-hostage_6814211.jpg?20250130081400",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-30 08:19:00",
        "Headline": "Israel and Hamas are exchanging hostages and prisoners for a third time as a fragile ceasefire holds in Gaza. ",
        "Content": " Three Israeli and five Thai hostages have been freed under a phased ceasefire deal that has halted fighting in Gaza. But after a chaotic release that saw crowds swarm sections of the handover, Israel temporarily delayed the freeing of 110 Palestinians expected in exchange. The first hostage, 20-year-old female Israeli soldier Agam Berger, was released in northern Gaza. Hours later, footage from the southern Gaza city of Khan Younis showed a stunned and scared-looking Arbel Yehoud being led through a crowd, flanked by armed, masked Palestinian militants. Gaza ceasefire latest The Israeli civilian was at the centre of a dispute between Israel and Hamas last weekend. It's suspected she was being held by Islamic Jihad, another militant group in Gaza. A third Israeli, civilian Gadi Mozes, 80, was also released on Thursday. Israeli military identified the five Thai nationals as Thenna Pongsak, Sathian Suwannakhan, Sriaoun Watchara, Seathao Bannawat and Rumnao Surasak. In return for the release of the Israeli hostages, Israel is expected to set free 110 Palestinians detained in prisons, including children, according to the Palestinian Prisoners Society. Among them are a 61-year-old held since 1992 and 30 teenagers, the youngest a 15-year-old boy. Their release was pausedafter the Israeli PM condemned the \"shocking\" scenes of the handovers to the Red Cross. Benjamin Netanyahu said Palestinian detainees would be held until the safe exit of Israeli hostages was guaranteed in future. He said later that he had received such a commitment, and Israeli media reported the releases of Palestinians would go ahead. The war has devastated much of Gaza's infrastructure, including homes, roads, sanitation and communications networks. The latest planned exchange is part of a fragile truce - mediated by the US, Qatar and Egypt - that began on 19 January and has so far held, aimed at winding down the deadliest war ever fought between Israel and Hamas. In the first round, Hamas released three Israeli soldiers, including British-Israeli Emily Damari, in return for 90 Palestinians, including a teacher who said she had been held for seven months. Among the roughly 250 people taken from Israel during Hamas's 7 October 2023 attack which ignited the conflict, some have died in captivity in Gaza, while others have been released or rescued. More than 47,000 Palestinians have been killed in Israel's offensive, according to Hamas-run authorities in Gaza, which does not distinguish between civilians and combatants. On Monday, hundreds of thousands of Gazans traversed rubble and dirt to return to what was left of their homes in the north of the Gaza Strip. But joy was tempered by grief as many discovered shattered or looted homes, no running water in the vicinity and dire shortages of basic supplies. On Thursday, a new Israeli law came into effect banning the UN's Palestinian refugee agency (UNRWA) from Israeli territory. It raised fears of a shutdown of its schools, medical facilities and other services in east Jerusalem - and possibly more in the West Bank and Gaza Strip, where UNRWA is the biggest provider of aid. British MP Sarah Champion, who chairs the International Development Committee of MPs, called the ban \"devastating\". \"Food, water, education, even rubbish collection will all be affected,\" she said. \"In the strongest possible terms, I urge the UK government to do everything it can to get all parties round the table and ensure that UNRWA can fulfil its UN-mandated work. The success of the current ceasefire hangs in the balance if not.\""
    },
    {
        "title": "Duduzile Zuma-Sambudla: Ex-South African president Jacob Zuma's daughter faces terrorism charges",
        "description": "The daughter of ex-South African president Jacob Zuma has appeared in court after being charged over her alleged involvement in July 2021 riots, which left over 300 people dead.",
        "url": "https://news.sky.com/story/duduzile-zuma-sambudla-ex-south-african-president-jacob-zumas-daughter-faces-terrorism-charges-13299660",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-south-africa-duduzile-zuma-sambudla_6814938.jpg?20250130182111",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-30 15:57:00",
        "Headline": "Duduzile Zuma-Sambudla's lawyer said she did make social media posts on Twitter related to riots in July 2021 but denied they incited violence.",
        "Content": "The daughter of ex-South African president Jacob Zuma has appeared in court after being charged over her alleged involvement in July 2021 riots, which left over 300 people dead. Duduzile Zuma-Sambudla is accused of inciting others to carry out violent acts through her social media posts that month. The 42-year-old, who is a member of parliament, handed herself into a police station in the eastern city of Durban on Thursday morning before going to court. She faces charges of incitement to commit terrorism and incitement to commit public violence under a law that deals with threats to the state, prosecutors say. The MP is accused of urging protesters to cause more damage during the riots as a sign of support for her father. She was later released on warning - similar to bail but without a money payment - as her case was moved to a higher court to continue in March. Her lawyer said she did make social media posts on Twitter related to the riots but denied they incited violence. \n                  Dozens of bodies pulled from illegal South African mine - as 82 survivors face arrest\n                 \n                  At least 100 illegal miners have died trapped underground in South Africa, group says\n                 \n                  As anti-immigration rages, migrants from Zimbabwe jump the border into South Africa with ease\n                 The unrest broke out four years ago after her father, who served as president from 2009 to 2018, was jailed for contempt of court after refusing to testify at a government corruption inquiry. The violence was also partly down to poverty, inequality and frustrations over South Africa's COVID-19 lockdown measures at the time.  Brigadier Thandi Mbambo, who leads the Hawks special police unit, said the arrest was \"a result of a meticulous investigation... following the unrest that brought the country to a standstill in 2021\". Around 350 people died in the demonstrations, as thousands of shops were looted, more than 5,000 people were arrested, and over £1.5bn of damage was caused. It marked some of the worst civil unrest in South Africa since the end of the apartheid system of white minority rule in 1994.  Zuma, 82, also appeared in court on Thursday, while supporters of his uMKhonto weSizwe (MK) Party gathered outside. He served two months in prison for contempt of court but has also been charged with corruption, racketeering, fraud, tax evasion, and money laundering over an arms deal the South African government signed with a French arms maker in 1999. He denies any wrongdoing. Read more from Sky News:Rihanna attends court to support A$AP RockyWashington plane crash: Key details emerge The former president founded the new party in 2024, years after he was expelled from the African National Congress (ANC) party following his jailing. In last year's election, MK won 14.6% of the vote, as the ruling ANC had its worst-ever result."
    },
    {
        "title": "Iraqi man who sparked riots with Koran burnings shot dead in Sweden",
        "description": "An Iraqi man who burned copies of the Koran in Sweden has been killed in a shooting, Swedish authorities say.",
        "url": "https://news.sky.com/story/iraqi-man-who-sparked-riots-with-koran-burnings-shot-dead-in-sweden-13299458",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-momika-sweden_6814344.jpg?20250130104710",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-30 10:39:00",
        "Headline": "Salwan Momika caused widespread anger when he staged multiple Koran burnings in 2023. He was due to receive a verdict in a criminal trial in connection with the burnings today.",
        "Content": "An Iraqi man who burned copies of the Koran in Sweden has been killed in a shooting, Swedish authorities say. Swedish police said Salwan Momika was shot dead in a house in Sodertalje, a town near Stockholm, on Wednesday, hours before a court verdict was due in a trial in connection with his burning of the Koran. Five people have been been arrested, but police did not say whether the gunman was among those detained. Mr Momika, a refugee and anti-Islam campaigner, staged several desecrations of Islam's holy book in public or in social media broadcasts in 2023. Worldwide publicity of the burnings caused widespread anger and criticism, as well as riots in Sweden and numerous Muslim countries. Sweden's prime minister has expressed concern the shooting may be linked to a foreign power. \"I can assure you that the security services are deeply involved because there is obviously a risk that there is a connection to a foreign power,\" Prime Minister Ulf Kristersson said at a news conference on Thursday. \n                  New Eurovision rules announced to 'protect' artists after controversies at competition\n                 \n                  Russia accused of escalating hybrid attacks in Europe after Baltic Sea telecoms cables cut\n                 \n                  Swedish minister's staff insist on banana-free rooms due to 'weirdest phobia'\n                 A court in Stockholm had been due to sentence Mr Momika, 38, and another man on Thursday over \"offences of agitation against an ethnic or national group,\" in connection with the Koran burnings. The court said the verdict was postponed because one of the defendants had died. Judge Goran Lundahl and court documents confirmed Mr Momika was the deceased. Meanwhile, police said they were alerted to a shooting in Sodertalje on Wednesday night. Officers found a man with gunshot wounds, who later died. A preliminary murder investigation was opened. Read more from Sky News:What we know about the DC plane crashRebels take key city in DR Congo The 38-year-old was streaming live on TikTok at the time he was shot, local media has reported. A video seen by news agency Reuters showed police picking up a phone and ending a livestream that appeared to be from his account on the app. In 2023, Sweden raised its terrorism threat to the second-highest level after Koran burnings, many of them by Mr Momika, triggered threats from jihadists. Burning the Koran is seen by Muslims as a blasphemous act because they consider it the literal word of God."
    },
    {
        "title": "Mexico asks Google not to follow Trump's Gulf of America name change",
        "description": "Mexico's president has asked Google not to use Donald Trump's new name for the Gulf of Mexico - which he pledged to change to&#160;Gulf of America in&#160;one of his first acts as president.",
        "url": "https://news.sky.com/story/mexico-asks-google-not-to-follow-trumps-gulf-of-america-name-change-13299804",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-claudia-sheinbaum-mexico_6815108.jpg?20250130215310",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-01-30 20:19:00",
        "Headline": "In one of his first acts as president, Donald Trump signed an executive order requiring the Gulf of Mexico be renamed to the Gulf of America.",
        "Content": "Mexico's president has asked Google not to use Donald Trump's new name for the Gulf of Mexico - which he pledged to change to Gulf of America in one of his first acts as president. Earlier this week, Google said it would change the name of the body of water on Google Maps once it is officially updated in the US Geographic Names System. According to Mexico, the US cannot legally change the Gulf's name because under the United Nations Convention on the Law of the Sea, a country's sovereign territory only extends up to 12 nautical miles from the coastline. Reading out her letter to Google at a press conference on Thursday, Mexican President Claudia Sheinbaum said \"if a country wants to change the designation of something in the sea, it would only apply up to 12 nautical miles\", CNN reported. \"It cannot apply to the rest, in this case, the Gulf of Mexico.\" Ms Sheinbaum has previously joked that she was considering renaming the continent of North America to \"Mexican America\" in her country. She said: \"We ask that when you put Mexican America in the search engine, the map appears that we presented.\" A founding document from 1814, which preceded Mexico's constitution, used that name for the continent. Read more:Trump signs order for Guantanamo Bay migrant centreStreets empty in Chicago over Trump's immigration crackdown Under the changes on Google Maps, American users would see it online as the Gulf of America, while Mexican and Cuban users would see the name remain the Gulf of Mexico. Worldwide users would see both names. On Monday, Google explained the changes as part of \"longstanding practice,\" and added: \"When official names vary between countries, Maps users see their official local name. \"Everyone in the rest of the world sees both names. That applies here too.\""
    },
    {
        "title": "Washington plane crash: What we know so far",
        "description": null,
        "url": "https://news.sky.com/story/washington-plane-crash-what-we-know-so-far-13299722",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-daily-podcast-daily-300125-crash_6814515.jpg?20250130124929",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-01-30 17:35:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Ambanis' Mumbai Indians clinch deal for 49% stake in Oval Invincibles",
        "description": "India's richest family has clinched a landmark deal to buy a 49% stake in the Oval Invincibles in a deal that will unite the London-based team with the ownership of the Indian Premier League's Mumbai Indians.",
        "url": "https://news.sky.com/story/ambanis8217-mumbai-indians-clinch-deal-for-49-stake-in-oval-invincibles-13299629",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-oval-invincibles-the-hundred_6511916.jpg?20240406080423",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-30 14:51:00",
        "Headline": "India's Ambani family has sealed a landmark agreement to become the first external shareholder in one of English cricket's eight Hundred franchises, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n India's richest family has clinched a landmark deal to buy a 49% stake in the Oval Invincibles in a deal that will unite the London-based team with the ownership of the Indian Premier League's Mumbai Indians. Sky News can exclusively reveal that the Ambani family, who have a fortune estimated to be tens of billions of dollars, triumphed in a live three-way auction conducted by the England and Wales Cricket Board (ECB) on Friday. The price that the Ambanis agreed to pay for the ECB stake was unclear, although sources said it was understood to have valued 100% of Oval Invincibles at approximately £125m. Money latest: Barclays takes fresh aim at WFH If that price is confirmed, the roughly £60m accruing to the ECB would set a benchmark for the sale of the governing body's stakes in the remaining seven teams to be conducted over the next week. The Mumbai Indians' owners triumphed after competing against a group of technology billionaires including the bosses of Google and Microsoft. CVC Capital Partners, the private equity firm that has been a prolific investor in elite sport ranging from Formula One to volleyball, was also slated to take part in the auction. \n                  Plans to drill Rosebank and Jackdaw oil and gas fields obstructed in court\n                 \n                  Water bills in England and Wales to rise by average of £10 per month\n                 \n                  Money blog: Barclays sends WFH memo to 85,000 staff - as 'new normal' increasingly starts to resemble the old one\n                 The outcome, which may not be formally announced until next week, will see the Ambanis emerge among the most powerful stakeholders in English cricket. One insider said the Mumbai Indians would gain significant governance rights over the cricketing aspects of the Oval Invincibles team. The Oval Invincibles' men's team, captained by Sam Curran and featuring England internationals such as Gus Atkinson, is expected to fetch the second-highest price of any of the teams, behind Lords-based London Spirit, which will see the ECB's stake sold on Friday. The tech billionaire consortium will also take part in that process. Bidders in auctions with at least three participants are able to submit binding offers at 15-minute intervals, and in increments of at least £3m. Birmingham Phoenix is next on the block, with its auction scheduled for Thursday afternoon. Losing bidders in each franchise may be given the opportunity to participate in the remaining processes, although the mechanics of such a scenario were unclear on Wednesday. The other remaining bidders for London Spirit are a vehicle controlled by Todd Boehly, a shareholder in Chelsea Football Club; members of the Manchester United-owning Glazer family; and RPSG Group, the owner of the Indian Premier League team Lucknow Super Giants. For franchises with only two shortlisted bidders, the auction will involve a straightforward sealed bid shootout. The London Spirit franchise is expected to be valued at more than £140m, meaning the proceeds to be received and distributed by the ECB would be at least £70m, the insiders added. In total, the ECB has indicated that the eight teams could be worth in the region of £350m, although there are hopes that figure will be exceeded. The proceeds will be distributed between the hosts, non-host counties and the grassroots game. Host counties are also allowed to sell their 51% shareholdings, although some have said they do not intend to do so. The MCC, which controls the London Spirit franchise, does not intend to offload any of its stake at this point, according to cricket insiders. Investors will only be allowed to own a stake in one of the eight teams, which also include Welsh Fire, Southern Brave and the Northern Superchargers. A bigger-than-expected windfall from the process could offer a financial lifeline to a number of cash-strapped counties, with part of the proceeds likely to be used to pay down debt. Concerns have been raised, however, that windfalls from the Hundred auction will not deliver a meaningful improvement in counties' long-term financial sustainability. The outcome of the Hundred auction is also likely to intensify other searching questions about the future of cricket, as the Test format of the game struggles for international commercial relevance against shorter-length competition. The Hundred auction is being handled by bankers at Raine Group, the same firm which oversaw the sale of large stakes in both Manchester United and Chelsea in recent years. The ECB declined to comment on Thursday, while the participants in the Oval Invincibles process could not be reached for comment."
    },
    {
        "title": "Food item loved on Instagram slated by top chef - as he shares cheap pasta recipe",
        "description": "Every Thursday, our Money blog team interviews chefs from around the UK, hearing about their cheap food hacks and more. This week, we chat to Phil Kearsey, executive chef at the London-institution and Michelin-starred Pied &#224; Terre.",
        "url": "https://news.sky.com/story/food-item-loved-on-instagram-slated-by-top-chef-as-he-shares-cheap-pasta-recipe-13299696",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-phil-kearsey-chef_6814908.png?20250130175121",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-01-30 17:00:00",
        "Headline": "Michelin-starred chef Phil Kearsey sits down with Money to talk about his top tip for amateur chefs, his pet hate in restaurants and the one ingredient everyone should do without. ",
        "Content": "Every Thursday, our Money blog team interviews chefs from around the UK, hearing about their cheap food hacks and more. This week, we chat to Phil Kearsey, executive chef at the London-institution and Michelin-starred Pied à Terre. A top tip for amateur chefs is... acidity is a seasoning! Just like salt and pepper, citrus or vinegar can take a simple thing to another dimension. The most overrated single food item is... micro herbs with no flavour. Yes, it looks lovely on Instagram but if it adds nothing to the dish get it out of there! My secret ingredient I love and use all the time is... sherry vinegar. It adds so many layers of flavour in a sauce, a puree or a dressing. I can drink the stuff! My go-to cheap eat at home is... courgette pasta. It's so simple, so quick and so delicious! One restaurant that's worth blowing out for is... the French Laundry, in California. After I did a stage there and before I joined, I got to dine on my own there. Chef David Breeden and Thomas Keller cooked me a 22-course tasting menu. A cheap place to eat where I live is... Tooting. I enjoy going for an authentic curry there. I enjoy sitting on plastic garden chairs in a simple restaurant to enjoy authentic Indian food cooked by someone with pride, passion and years of experience, which is unbeatable for me… pass me the plastic fork! \n                  'There's a reason there are so many pizza restaurants': TV chef points finger on hospitality woes\n                 \n                  Renowned chef shares worst type of customer, most overrated food and cheap recipe\n                 \n                  Chef on customer expectations needing to change, the best sirloin steak dupe and her cheap weeknight recipe\n                 My pet hate in restaurants is... when guests book and don't show up or cancel on the day. We would love to be able to give that table to someone else and with it the opportunity to sample our hospitality. The biggest mistake I see in kitchens is… chefs being wasteful, normally due to lack of organisation. Personally, my style is built around sourcing the best produce and celebrating it. So, seeing an ingredient not being used to its potential is very frustrating. My chef heroes are... Gordon Ramsay and Heston Blumenthal. I've been very lucky in my career to work for some of the best chefs in the world, but I have to say, as a young chef falling in love with gastronomy I was (and still am) a big fan boy of them. Read more:Food prices to 'rise due to budget tax hikes''I only have two bills and get a pension after 12 years'Water bills in England and Wales to rise by average of £10 per month My one piece of advice for an aspiring chef is… work for chefs you want to be like when you're doing a stage. Don't be taken aback by a slightly reduced salary for an hour to work somewhere where you learn a lot more. Work hard and invest in your future. Trust me, it's worth it in the long run. One cookbook I recommended is... The French Laundry cookbook. It changed my life and inspired me so much that I ended up working there and I also worked on their latest book. I've cut costs in my restaurant by... being more aware and ordering smaller quantities daily, as everything is so much more expensive now. To cook with the best produce you have to count every onion. My favourite cheap substitute is... anything that takes longer cooking is always the best way to go when we are talking cheaper products and ingredients. It's the chef's skill that can unlock the flavour potential. For example, a beef fillet is amazing, but a great braised short rib is a fraction of the cost and if cooked well, is miles ahead in terms of depth of flavour. I've given free meals... At Pied à Terre my first ever chef came in for dinner and cooking for him and showing where I've come since the spotty teenager with burns all over him to this was incredible. When we got the bill, David Moore (the restaurant founder) almost brought me to tears when he told me to just drop a note on the table saying we have taken care of it all. Giving back to people who have shaped me through the years is the best feeling ever."
    },
    {
        "title": "Former Aviva chief Wilson to chair UK insurer Policy Expert",
        "description": "Policy Expert, the home, motor and pet insurer to 1.5m UK customers, is to underscore its growth ambitions by naming the former Aviva chief Mark Wilson as its new chairman.",
        "url": "https://news.sky.com/story/former-aviva-chief-wilson-to-chair-uk-insurer-policy-expert-13299673",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-mark-wilson-zilch_6674934.jpg?20240902145347",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-30 16:27:00",
        "Headline": "Mark Wilson has agreed to become the new chairman of the personal lines insurer, which is jointly owned by Cinven and a subsidiary of Abu Dhabi state fund, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Policy Expert, the home, motor and pet insurer to 1.5m UK customers, is to underscore its growth ambitions by naming the former Aviva chief Mark Wilson as its new chairman. Sky News has learnt that Mr Wilson, who also ran the Asian insurance company AIA, will become chairman of the company months after the buyout firm Cinven acquired a 50% stake in it from a subsidiary of the Abu Dhabi Investment Authority (ADIA). An announcement about his appointment is expected imminently, according to industry sources. Money latest: Barclays takes fresh aim at WFH Policy Expert describes itself as one of the UK's leading personal lines insurers, and is expected to use the recent stake sale to Cinven as a platform to spearhead a new round of industry consolidation, according to bankers. Cinven has an extensive track record in the insurance sector and in taking a 'buy-and-build' approach to businesses more broadly. It now has more than 1.5m policyholders across its different insurance product lines. \n                  Plans to drill Rosebank and Jackdaw oil and gas fields obstructed in court\n                 \n                  Water bills in England and Wales to rise by average of £10 per month\n                 \n                  Money blog: Barclays sends WFH memo to 85,000 staff - as 'new normal' increasingly starts to resemble the old one\n                 Mr Wilson, who also ran the Asian insurer AIA, will work closely with Policy Expert's chief executive, Steve Hardy, when he takes up the position next month. A non-executive director of the asset management behemoth BlackRock, Mr Wilson also recently joined the board of Zilch, a payments business boasting more than 4m customers. Founded in 2011, Policy Expert was only sold by Primary Group to a subsidiary of ADIA in late 2023. Policy Expert could not be reached for comment."
    },
    {
        "title": "Ofcom proposes Royal Mail scale back second class letter deliveries",
        "description": "The communications regulator has proposed cutting letter deliveries with second-class post arriving every second day and no longer on Saturdays.",
        "url": "https://news.sky.com/story/ofcom-proposes-royal-mail-scale-back-second-class-letter-deliveries-13299364",
        "image_url": "https://e3.365dm.com/22/05/1920x1080/skynews-postman-royal-mail_5776119.jpg?20220519085540",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-01-30 07:36:00",
        "Headline": "The communications watchdog says its research shows people are more willing to accept reduced quality service than price rises to fund better services, and want reliability and affordability more than they want speed.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The communications regulator has proposed cutting letter deliveries with second-class post arriving every second day and no longer on Saturdays. Ofcom said Royal Mail customers' postal needs would be met by keeping first class deliveries six days a week. It also outlined provisional plans to reduce goals for the delivery company, bringing down the percentage of first class post delivered the next day from 93% to 90%, and second class mail delivered within three days from 98.5% to 95%. Money blog: Food item loved on Instagram slated by top chef It comes as Ofcom said the universal service obligation - to deliver letters to every address in the UK, six days a week, at a uniform price - \"urgently needs reform to reflect what people need and [to] protect its future\". Royal Mail has been hit by hefty fines by Ofcom for poor performance, more than £16m in the last 18 months alone. \"Royal Mail's delivery performance has not been good enough,\" the watchdog said, but added distribution objectives need to be altered given the changes in how people send and receive goods. Less than a third of letters are sent now than 20 years ago and is forecast to fall to about a fifth of letters previously sent. \"Given the postal market has changed significantly since Royal Mail's delivery standards were set two decades ago, we believe it is right to reassess these targets with the future in mind,\" Ofcom said, adding it would continue to hold Royal Mail to account. Read more from Sky News:Water bills in England and Wales to riseCoca-Cola, Sprite and Appletiser cans recalled in UK It's good news for Royal Mail and its new owner, the Czech billionaire Daniel Kretinsky. Ofcom estimated the changes would bring savings of between £250m and £425m if successfully implemented. The kind of service people want  People want reliability and affordability more than they want speed, according to Ofcom's research. The price of second class stamps will remain capped to reflect this, it said. Most postal users told the regulator they do not need six days a week delivery for the majority of letters. The research also indicated people are more willing to accept a reduced quality service than price rises to fund better services."
    },
    {
        "title": "Insurance unicorn Marshmallow finalises fundraising at £1.5bn valuation",
        "description": "Marshmallow, the British insurance unicorn, is close to finalising a new capital injection valuing it at more than &#163;1.5bn, despite the difficult funding environment facing many technology companies.",
        "url": "https://news.sky.com/story/insurance-unicorn-marshmallow-finalises-fundraising-at-16315bn-valuation-13299460",
        "image_url": "https://e3.365dm.com/22/02/1920x1080/skynews-marshmallow-insurance_5670505.png?20220211144601",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-01-30 10:41:00",
        "Headline": "Founded by identical twin brothers a decade ago, Marshmallow is close to securing funding from fintech investor Portage Capital, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Marshmallow, the British insurance unicorn, is close to finalising a new capital injection valuing it at more than £1.5bn, despite the difficult funding environment facing many technology companies. Sky News has learnt that Marshmallow is in advanced talks to secure tens of millions of pounds in its first major equity fundraising in more than three years. Money blog: Wetherspoons hikes food and drink prices Banking sources said on Thursday that Portage Capital, a Canadian fintech investor, had been in discussions with Marshmallow for some time about leading the fundraising. Perella Weinberg Partners, the investment bank, is understood to have been advising the British company for several months. At a valuation of more than £1.5bn, it would represent a substantial premium to Marshmallow's last fundraising in 2021. Founded in 2015 by identical twins Oliver and Alexander Kent-Braham and David Goaté, the company targets customers who are typically underserved by the insurance market, including immigrants and expats. \n                  More than 130 Lloyds, Halifax and Bank of Scotland branches to close\n                 \n                  Barclays to slash CEO's fixed pay as package capped at £14m\n                 \n                  Muslim charities still being debanked despite Farage furore \n                 Among those previously disclosed as investors in Marshmallow are Investec, the bank, and Passion Capital, a prominent venture capital firm. Reports last month said Marshmallow's 2023 revenues soared 75%. The company now employs more than 300 people. It was also reported to have secured a £15m debt facility from Triple Point, a provider of private credit, in May 2023. Marshmallow did not respond to emails to one of its co-founders or an address set up to handle media enquiries."
    },
    {
        "title": "Sir Tony Blair and Gordon Brown lead tributes to Lord Prescott at his funeral",
        "description": "Former Labour prime ministers Gordon Brown and Sir Tony Blair have led tributes to \"working class hero\" Lord Prescott at his funeral.",
        "url": "https://news.sky.com/story/sir-tony-blair-and-gordon-brown-lead-tributes-to-lord-prescott-at-his-funeral-13299585",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-john-prescott-labour_6753282.jpg?20241121062458",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-01-30 13:54:00",
        "Headline": "The great and the good of the Labour Party joined the Prescott family at his funeral at Hull Minster in the city where he was an MP for 40 years.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Former Labour prime ministers Gordon Brown and Sir Tony Blair have led tributes to \"working class hero\" Lord Prescott at his funeral. The great and the good of the Labour Party remembered the UK's longest-serving deputy prime minister, who died in November aged 86 after a battle with Alzheimer's. The funeral cortege included a Jaguar hearse and limousine, in a nod to Lord Prescott's nickname \"two Jags\". Sir Keir Starmer and Deputy Prime Minister Angela Rayner gave readings as former cabinet ministers and current MPs gave their final goodbye to the Labour stalwart. Politics latest: 'John was guardian of the party's conscience' Both Sir Tony, who Lord Prescott was deputy for, and Gordon Brown gave eulogies at Hull Minster, in the city where he served as an MP for 40 years until he was given a peerage in 2010. Mr Brown, who was prime minister from 2007-2010, hailed a \"life lived to the full\", which \"touched the lives and changed the lives of millions who may never have met John but are today better off because of him\". \n                  Justice secretary's assisted dying intervention is explosive - and potentially embarrassing for PM\n                 \n                  Gordon Brown says assisted dying should not be legalised\n                 \n                  Ministers to kick off fresh search for £130,000-a-year football referee\n                 He called Lord Prescott a \"working-class hero\" who \"kept the show on the road during difficult times\". \"We will never see his like again. A man of the people he certainly was, in a class by himself, a one-off,\" Mr Brown said. \"One of a kind but one of us, in the best sense of the word.\" He also reminded mourners of his cameo in Gavin & Stacey - \"seen by millions\" - as Nessa's rejected suitor. And, in reference to the infamous incident where Lord Prescott punched a man who threw an egg at him, he said: \"John was a man of the people because he could connect with people, and I don't just mean that man in Rhyl who dared to hurl an egg at him.\" Read more:Labour's pugnacious stalwart who pulled no punchesJohn Prescott, a pork pie and me He said Lord Prescott, who came from very little, believed in the \"goodness in everyone...even that egg-thrower in Wales\". Sir Tony also shared some anecdotes, recalling the \"pandemonium\" that ensued after \"the punch\" in the 2001 general election campaign. 👉Listen to Politics At Jack And Sam's on your podcast app👈 He said he called his deputy with reluctance to ask him to apologise, but Lord Prescott told him: \"The answer is no, I'm not bloody apologising and that's the end of it.\" The former PM said: \"Classic\". He said he watched the footage again recently and was \"cheering him on\". Sir Tony told the congregation he \"played a huge part\" in government but was also \"a good man, a man who started as my political partner and became my personal friend\". \"I hope he will see in this vast gathering today, a recognition of that working-class boy from a small Welsh town, who rose to the highest ranks of the land by merit, by graft, by greatness of courage and character, and he will feel deservedly at peace.\" One of Lord Prescott's two sons, David, told the funeral: \"He was a man who spent his life overcoming challenges and helping others.\" He added: \"Prescott was always at your service.\" He described how the \"bolshy ex-waiter\" became deputy PM and talked about his father's final days in a care home, thanking all the carers and staff who looked after him. In lieu of flowers, the Prescott family requested donations for Alzheimer's Research UK. Following the service, mourners went to Lord Prescott's favourite Chinese restaurant in Hull."
    },
    {
        "title": "Ministers talk about 'smashing the gangs' but real success still resembles 'stop the boats' slogan",
        "description": "Several floors up, in a nondescript building in central London, rows of analysts are working to make good on the government's promise to smash the gangs.",
        "url": "https://news.sky.com/story/ministers-talk-about-smashing-the-gangs-but-real-success-still-resembles-stop-the-boats-slogan-13299702",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-small-boat-boats-dinghy_6794795.jpg?20250108220009",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-01-30 17:10:00",
        "Headline": "If work to \"smash the gangs\" is bearing fruit, the results are not feeding through to crossing numbers - with figures for 2024 higher than a year earlier.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Several floors up, in a nondescript building in central London, rows of analysts are working to make good on the government's promise to smash the gangs. At first glance, this block of offices looks more like the type of workspace that would play home to a tech startup or advertising firm. But the plasma screens pinned to the wall here are showing night-vision camera feeds from border force aircraft and maps detailing the routes of small boat crossings. Politics latest: Blair in funeral tribute to Prescott This is one of the government's command centres where officials gather intelligence about the dangerous journeys made week in week out by migrants attempting to get to the UK. The information being brought together here often paints a bleak picture. On the French side, violence around coastal launch points seems to have got worse. \n                  Syrian man crushed to death attempting to cross Channel on small boat\n                 \n                  Plan to sanction people smuggling gangs is a bold and novel departure - but can the government make it bite?\n                 \n                  UK to introduce 'world first' sanctions regime to target people smugglers\n                 Cars have been set on fire and local police officers followed home by those trying to facilitate crossings. The organised smuggling gangs appear to be getting increasingly cavalier with the lives of migrants too - by cramming more people on to their flimsy vessels. 'Buy one get one free' prices on crossings Sky News understands officials have even picked up social media adverts offering migrants 'buy one get one free' prices on crossings if an adult brings a child or someone with disabilities with them. \"Years ago it was safer, and it was payment by results… it's more cynical now,\" said one source. This is explained by an increasing desperation from smugglers, as action from authorities starts to bite. But if work to \"smash the gangs\" is bearing fruit, the results are not feeding through to crossing numbers - with figures for 2024 higher than a year earlier. Deaths in the Channel are up too, and that's partly why the government is including laws in its new borders bill to make it a specific offence to endanger another life during a sea crossing. 'Children held over side of small boats' One Home Office official says a tactic that's been used by some on board boats is to hold a child over the side of the vessel to avoid being rescued by the authorities. There are also stories of scrambles on French beaches as desperate migrants attempt to board boats at the last minute, leading to deadly crushes in the centre of the dinghy - the area where women and children often sit.  Trafficking experts question the feasibility of gathering evidence to pursue these new crimes, while refugee groups say there's a risk that vulnerable people could inadvertently be criminalised. The Tories also claim the move is performative as existing legislation passed by them can already deal with such offences. But that's not the only echo of previous approaches to migration. While the bill being published on Thursday repeals a majority of the Conservative's controversial Illegal Migration Act, some parts are being left in place. One section keeps beefed up powers for the Home Secretary Yvette Cooper to decide how long migrants can be detained for, while another retains exemptions from modern slavery protections in some circumstances. This has led to accusations of hypocrisy from human rights groups, given the critical tone adopted by many senior Labour figures towards the powers while they were in opposition. Other refugee groups seem more relaxed though and say the retained sections are relatively minor, especially given the huge tranches of Tory legislation that is repealed in the bill. That's not to say these groups are fully on side with the current approach. Read More:Could we soon see seismic political shift in Wales? Growth is a fight Starmer and Reeves want - and can't afford to lose \"The most effective way to break the smuggling gangs' grip is to stop refugees from getting into the boats in the first place, which means giving them a legal way to apply for asylum in the UK without crossing the Channel\", said Enver Solomon from the Refugee Council. More safe routes doesn't appear to be on the government's radar though. Asked repeatedly about whether upping safe and legal routes was part of the discussion, the home secretary told Sky News \"the priority… is tackling the criminal gangs, because if you don't, those boats will continue and that will continue to hit our border security\". Back in the small boats command centre, one screen sets out the data the government will ultimately be judged on. Above a bar chart of boat arrivals, a figure - coloured green for now - shows that crossing levels are currently lower than at the same point last year. As much as ministers talk about their plan to 'smash the gangs', real success still resembles the old Tory slogan - 'stop the boats'."
    },
    {
        "title": "Scottish government 'unlikely' to meet 2030 target on reducing car use, auditors warn",
        "description": "The Scottish government is \"unlikely\" to meet its 2030 climate change target to reduce car use due to a \"lack of leadership\", according to public spending watchdogs.",
        "url": "https://news.sky.com/story/scottish-government-unlikely-to-meet-2030-target-on-reducing-car-use-auditors-warn-13299401",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-motorway-scotland_6814289.jpg?20250130111133",
        "type": "Technology",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-01-30 08:52:00",
        "Headline": "Audit Scotland said in order to achieve the 20% reduction, car traffic levels would need to decrease by 7.3 billion kilometres to 29.3 billion. The last time car use was at this level was in 1994.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government is \"unlikely\" to meet its 2030 climate change target to reduce car use due to a \"lack of leadership\", according to public spending watchdogs. Stephen Boyle, auditor general for Scotland, and the Accounts Commission said \"minimal progress\" had been made to cut kilometres driven by 20% since the pledge in 2020. The report - prepared by Audit Scotland - blamed a \"lack of leadership\" and said the government had yet to produce a delivery plan for achieving the goal. First Minister John Swinney last year insisted the target could still be met, but Transport Scotland admitted the nation \"has still got some way to go\". Mr Boyle said: \"The Scottish government set an ambitious and very challenging target to reduce car use by 20% by 2030. \"But there has been a lack of leadership around delivering this goal. \"It's now unlikely the government will achieve its ambition, so it needs to be clear how this will affect its wider ambitions to achieve net zero emissions by 2045.\" \n                  Money and public backlash are not the only issues Heathrow expansion plans face\n                 \n                  Hotter, drier, faster, stronger: The role climate change did - and did not - play in the California wildfires\n                 \n                  Bristol City Council could become first local authority in England to collect black bin waste every four weeks\n                 The target was introduced during the COVID pandemic when levels of car traffic had decreased significantly. Audit Scotland said since 2020, vehicle traffic has increased to near pre-pandemic levels, public transport use has reduced, and there has been no significant change in how much people walk and cycle. The independent public spending watchdog said in order to achieve the target, car traffic levels would need to decrease by 7.3 billion kilometres to 29.3 billion. The last time car use was at this level was in 1994. 'Clearer guidance needed' Audit Scotland said spending by councils and the Scottish government on reducing car use \"is complex, fragmented and lacks transparency\". Ruth MacLeod, a member of the Accounts Commission, said: \"All parts of government need to act to deliver the 2030 car use reduction target. \"Councils need to set out to what extent they will contribute and how they will measure their progress. \"But they also need clearer guidance and direction from the Scottish government to agree their role in reducing car use in their area.\" Read more from Sky News:Plans to drill Rosebank and Jackdaw oil and gas fields thwarted in courtA long history of Heathrow's third runway plans In April last year, the Scottish government ditched its flagship target of reducing greenhouse gas emissions by 75% by 2030 after accepting it was \"out of reach\". However, its \"unwavering commitment\" to achieve net zero by 2045 remains. A pilot scheme scrapping peak-time ScotRail fares was axed last year, with Transport Scotland saying the £40m price tag could not be justified as the trial \"did not achieve its aims\" of encouraging more people to swap their cars for rail travel. Following the decision in August, Mr Swinney said he believed the 2030 target could still be met but would require \"changes in behaviour from members of the public\". 'A wake-up call' Scottish Greens MSP Mark Ruskell said the report \"must serve as a wake-up call\". He added: \"Part of the challenge is the extortionate cost of transport. \"By introducing cheaper bus and train fares we can encourage people to make the switch to greener alternatives and to leave their car at home.\" 'Scotland has still got some way to go' Transport Scotland said it would consider the report's recommendations while working with council body COSLA, as well as regional transport and local authority partners. It said the 2025-26 budget would invest £263m into sustainable travel, low carbon and climate positive activities to support the switch away from vehicle use. A spokesperson added: \"Reducing Scotland's reliance on cars and encouraging a shift towards public transport and active travel is a crucial step in meeting our climate targets. \"It also mirrors the thinking which is under way across the world in terms of reducing emissions and creating greener, healthier and more enjoyable environments for people and communities. \"We recognise that Scotland has still got some way to go to transition from private vehicles and towards more sustainable public transport - and cross-party support at all levels of government is key.\""
    },
    {
        "title": "Singer Marianne Faithfull dies at the age of 78",
        "description": "Singer and actress Marianne Faithfull has died at the age of 78.",
        "url": "https://news.sky.com/story/singer-marianne-faithfull-dies-at-the-age-of-78-13299600",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-marianne-faithful-1964_6814943.jpg?20250130182723",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-30 14:10:00",
        "Headline": "Marianne Faithfull was best known for her 60s hit As Tears Go By, and for her starring roles in the films The Girl On A Motorcycle and Irina Palm.",
        "Content": "Singer and actress Marianne Faithfull has died at the age of 78. A spokesperson for her music promotion company Republic Media said: \"It is with deep sadness that we announce the death of the singer, songwriter and actress Marianne Faithfull. \"Marianne passed away peacefully in London today, in the company of her loving family. \"She will be dearly missed.\" Faithfull was best known for her 1964 hit As Tears Go By, written by Sir Mick Jagger, with whom she had a well-publicised relationship, and fellow Rolling Stones star Keith Richards. She also starred in films including The Girl On A Motorcycle and 2007's Irina Palm, for which she was nominated for a European Film Award for Best Actress. In recent years, she provided voice work for the 2021 remake of Dune and 2023's Wild Summon. She and Sir Mick began seeing each other in 1966 and became one of the most glamorous couples of Swinging London. He paid tribute to his \"wonderful friend and beautiful singer and a great actress\", and said he was \"so saddened\" by her death, as \"she was so much part of my life for so long\". Next to a picture of the pair arm in arm on Instagram, Sir Mick said Faithfull \"will always be remembered\". His Stones bandmates Ronnie Wood and Keith Richards also paid tribute, with Richards posting on Instagram that he was \"so sad and will miss her.\" His post was accompanied by a picture of the pair enjoying a drink together. Wood wrote on Jagger's post: \"Farewell dear Marianne.\" Born in 1946, Faithfull started her singing career in 1964 after being discovered by the Stones' manager Andrew Loog Oldham. Her self-titled debut album was released a year later, with As Tears Go By reaching number nine on the UK singles chart. She went on to have a string of successful singles, including Come And Stay With Me, This Little Bird, and Summer Nights, and famously dated Sir Mick from 1966 to 1970. Faithfull was prolific throughout the 60s, releasing six albums - some only in the UK and some for the US - as well as contributing backing vocals to the Beatles' Yellow Submarine and inspiring the Stones' Sympathy For The Devil. That decade also saw her star in films like 1967's I'll Never Forget What's'isname - where she was one of the first people to say f*** in a mainstream studio film - 1968's The Girl On A Motorcycle, and Tony Richardson's 1969 adaptation of Hamlet. Her affair with Sir Mick was notorious, with the couple being arrested in 1968 for possession of cannabis. She was also infamously found by police wearing only a bear skin rug when they arrived for a drugs raid at Richards' home in 1967. After breaking up with the Stones frontman, Faithfull spent two years homeless in Soho while suffering from anorexia and heroin addiction, before she started living in a squat. She wrote in her 1994 autobiography: \"For me, being a junkie was an admirable life. It was total anonymity, something I hadn't known since I was 17. \"As a street addict in London, I finally found it. I had no telephone, no address.\" Read more from Sky News:Badenoch disavows comments from Priti PatelHarvey Weinstein begs judge for earlier retrial In 1979, following success in Ireland with the country-themed Dreamin' My Dreams, Faithfull released the Grammy-nominated Broken English - widely considered her best album. She later achieved critical acclaim as a jazz and blues singer with 1987's Strange Weather and went to rehab that same decade. Faithfull released a total of 21 solo albums throughout her career. Her most recent was the spoken word album She Walks In Beauty from 2021, which saw her work with frequent Nick Cave collaborator Warren Ellis. She made a full recovery from breast cancer in 2006."
    },
    {
        "title": "BBC apologises to staff over handling of Russell Brand complaints",
        "description": "The BBC has apologised to staff who felt unable to raise concerns about Russell Brand's behaviour during his time working for the broadcaster.",
        "url": "https://news.sky.com/story/bbc-apologises-to-staff-over-handling-of-russell-brand-complaints-13299507",
        "image_url": "https://e3.365dm.com/23/09/1920x1080/skynews-russell-brand-portrait_6289357.jpg?20230918112319",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-30 12:05:00",
        "Headline": "The BBC publishes a review into its handling of complaints about Russell Brand during his time working for the broadcaster. Brand, who has always strongly denied any allegations against him, was invited to take part to give his perspective, but \"did not accept the invitation\".",
        "Content": "The BBC has apologised to staff who felt unable to raise concerns about Russell Brand's behaviour during his time working for the broadcaster. The corporation said eight complaints of misconduct had been considered - only two of which were made during the presenter's time there. It also acknowledged it was \"clear\" some presenters had been able to abuse their positions in the past. Brand, 49, has strongly denied any allegations against him and previously said all his sexual relationships were \"absolutely always consensual\". The BBC's apology came as it released the findings of an internal review of its handling of complaints, which cost £662,000 and involved interviews with 39 individuals. This focused on the comedian's work for 6 Music and Radio 2 between 2006 and 2008. BBC director of editorial complaints and reviews Peter Johnston, who carried out the investigation, found there were many staff who felt \"unable to raise\" concerns and believed Brand \"would always get his way and therefore they stayed silent\". The review looked into reports the presenter allegedly urinated \"into cups or bottles while in the studio, throwing objects, allegations of sex on the premises including with competition winners, and exposure while in the studio in front of staff and guests\". It also investigated a complaint made by a woman working in the same building as the BBC's office in Los Angeles. She claimed Brand flashed her in 2008, and later laughed about the incident on his radio show. Mr Johnston said the \"culture of the time undoubtedly influenced what was acceptable/tolerated\" but that \"the processes for raising concerns were also not as developed as they are now\". The BBC has since improved these processes, he said. Brand was asked to participate - 'but did not accept' Russell Brand joined the BBC as a regular presenter for 6 Music in April 2006 and joined Radio 2 in November that year. He had a regular show on the station until he left in 2008 over a \"high-profile editorial breach\" - when he made a prank call to Fawlty Towers actor Andrew Sachs. His hiring was \"understood (by those keen to hire him) to be a decision which carried editorial risks, given the nature of his comedy performances and material, but was in line with the strategy of the station at the time\" - which was to attract younger audiences and bring in presenters with profile, the review found. Brand was asked to participate in the review, Mr Johnston said, \"but did not accept the invitation\". The review was carried out after a joint investigation by Channel 4's Dispatches programme, The Times and Sunday Times, published in 2023, in which Brand was accused by four women of sexual assaults and abuse between 2006 and 2013. 'We know it has not been easy to speak out' In response to the report, the BBC said that after allegations were raised in 2023, \"it was important that this was looked into methodically\" and the review had been \"conducted with the greatest care\". Their statement said: \"We want to thank the individuals who have participated, as we know that it has not been easy to speak out about some of the issues the review addresses. \"The review considered eight complaints of misconduct about Russell Brand, only two of which were made while he was engaged by the BBC, one formally and one informally.  It is of great concern that some of these individuals felt unable to raise concerns about Russell Brand's behaviour at the time, and the BBC has apologised to them as part of this review. \"It is also clear that there were compliance inadequacies on some of Russell Brand's Radio 2 shows which led to content being aired that would not be broadcast today. Russell Brand left the BBC in 2008 following a high-profile editorial breach.\" The BBC highlighted an ongoing police investigation into Brand and said it had been in contact with the Metropolitan Police throughout the review. \"The BBC acknowledges that Russell Brand categorically denies all public allegations made against him,\" the broadcaster added. Culture Secretary Lisa Nandy said the complaints in the report were \"horrendous\" and added: \"As is the fact that staff felt unable to raise concerns because they did not think that they would be believed or taken seriously.\" The BBC needs to take action to reassure staff and the public that it takes the issues seriously, she said. \"Power imbalances and a perception that certain stars cannot be challenged are sadly not unique to this case.\" The BBC's review comes after similar investigations into Brand's time working on Channel 4 shows including Big Brother spin-offs Big Brother's Big Mouth and Big Brother's Celebrity Hijack. TV production company Banijay UK found that concerns raised informally about his alleged behaviour between 2004 and 2008 were \"not properly escalated or adequately addressed\". A separate Channel 4 investigation found there was no evidence that bosses were aware of any accusations. In November, the Met Police said they had handed a file of evidence to the Crown Prosecution Service (CPS). A man in his 40s was interviewed by officers three times under caution in relation to allegations of non-recent sexual offences, the force said at the time. Sky News has contacted representatives for Brand for comment."
    },
    {
        "title": "Rihanna attends court to support A$AP Rocky during his trial - as key witness gives evidence",
        "description": "Rihanna has attended court for the first time in support of her partner A$AP Rocky - as his former friend gave evidence about the moment the star allegedly fired a gun in his direction.",
        "url": "https://news.sky.com/story/rihanna-attends-court-to-support-aap-rocky-during-his-trial-as-key-witness-gives-evidence-13299437",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-asap-rocky-rakim-mayers_6814302.jpg?20250130100659",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-01-30 09:45:00",
        "Headline": "When jurors for A$AP Rocky's trial were selected, prosecutors asked whether his superstar partner Rihanna's connection, especially if she appeared in court, would sway their decision making. Nearly all had heard of her, but said it would not.",
        "Content": "Rihanna has attended court for the first time in support of her partner A$AP Rocky - as his former friend gave evidence about the moment the star allegedly fired a gun in his direction. The superstar singer, who has two toddler sons with the rapper, sat next to his mother and sister, out of view of the Los Angeles criminal courtroom's cameras on Wednesday. Rocky, whose real name is Rakim Mayers, is on trial accused of firing a handgun at his former friend Terell Ephron, known as A$AP Relli. He has pleaded not guilty to two felony counts of assault with a semiautomatic firearm. Before the trial began last week, the star's lawyers said there was a possibility Rihanna may attend at some point to show support, as the court weighed up any potential impact of her celebrity on the case. When jurors were selected, prosecutors asked whether Rihanna's connection, especially if she appeared in the courtroom, would affect their decisions. Nearly half of the initial group said they had heard of A$AP Rocky before coming to court, while nearly all said they had heard of Rihanna. All said they felt it would not have an impact. It was not clear whether the jury could see Rihanna or were aware of her presence as they watched the testimony. She entered with the help of security before reporters arrived in court, according to US media reports, and was not seen with Rocky outside. She also left separately through a restricted exit, according to the Associated Press news agency. The star, known for hits including Umbrella, Diamonds and Work, was in court as Ephron, the trial's key witness, began his evidence. Who is the key witness and what has he testified? Ephron and Rocky were members of the A$AP crew of creators at a New York high school, the court has previously heard. They were once close but their relationship broke down after Rocky became famous, Ephron said. Rocky allegedly fired the gun at him on a street in Hollywood in 2021. Giving evidence, Ephron said he had been shouting angrily at the rapper, who was walking away after an initial confrontation and a scuffle. Read more from Sky News:Harvey Weinstein begs judge for earlier retrialRepublicans criticise Super Bowl half-time shows Rocky then pulled a gun from his waistband and held it in the air, Ephron testified. \"He turned around and then it was like BOOM!\" he told the jury. \"The whole thing was like a movie, he kind of like pointed down and he shot the first shot.\" He said his hand felt \"hot\" and added: \"I was hit. Or I was grazed. I didn't have a hole or nothing.\" Ephron said he grabbed a mutual friend after he alleged the first shot was fired and stood behind him for protection. He said he did not see Rocky fire a second shot, and that the rapper ran away moments later. What have Rocky's lawyers argued? Rocky's lawyer previously told the court the gun was not real - that the rapper fired shots from a starter pistol he carried as a prop. Ephron knew this, he said. However, when questioned about it in court, Ephron said: \"Oh it was a real gun\". The court heard he has received death threats since the incident and that his career in music management has dwindled. \"It's been a living hell,\" Ephron said. From court to Grammys Rocky was raised in Harlem and had his mainstream breakthrough when his first studio album topped the Billboard 200 in 2013. The second, released in 2015, did the same. His career was set to take off even further in 2025 - starting with his third Grammy nomination at this year's awards ceremony, which takes place on Sunday. The rapper is also set to headline the Rolling Loud Music Festival, will star opposite Denzel Washington in a crime drama directed by Spike Lee, and is also the co-chair of the Met Gala fashion event in May. He faces up to 24 years in prison if convicted. The trial continues."
    }
]