[
    {
        "title": "Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics",
        "description": "For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.&#160;",
        "url": "https://news.sky.com/story/donald-trumps-tariffs-will-have-consequences-for-globalisation-the-us-economy-and-geopolitics-13340802",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-tariffs_6874380.jpg?20250402221634",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-04-02 21:24:00",
        "Headline": "Sweeping tariffs have been unleased by Donald Trump, with a flat 10% on all imports from the UK and much higher rates on China, the European Union, India, and Vietnam.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.Â  Trade was mostly free and getting freer, tariffs were getting lower and lower, and the world was becoming more, not less, globalised. But alongside those long-term trends, there were some serious consequences. Trump latest: US president announces sweeping global trade tariffs Mature, developed economies like the UK and US became ever more reliant on cheap imports from China and, in the process, saw their manufacturing sectors shrink. Large swathes of the rust belt in the US - and much of the Midlands and North of England - were hollowed out. And to some extent that's where the story of Donald Trump's \"Liberation Day\" really began - with the notion that free trade and globalisation had a darker side, a side he wants to remedy via tariffs. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 He imposed a set of tariffs in his first term, some on China, some on specific materials like steel and aluminium. But the height and the breadth of those tariffs were as nothing compared with the ones we have just heard about. Not since the 1930s has the US so radically increased the level of tariffs on all nations across the world. Back then, those tariffs exacerbated the Great Depression. It's anyone's guess as to what the consequences of these ones will be. But there will be consequences. Consequences for the nature of globalisation, consequences for the US economy (tariffs are exceptionally inflationary), consequences for geopolitics. And to some extent, merely knowing that little bit more about the White House's plans will deliver a bit of relief to financial markets, which have fretted for months about the imposition of tariffs. That uncertainty recently reached unprecedented levels. But don't for a moment assume that this saga is over. Nothing of the sort. In the coming days, we will learn more - more about the nuts and bolts of these policies, more about the retaliatory measures coming from other countries. We will, possibly, get more of a sense about whether some countries - including the UK - will enjoy reprieves from the tariffs. To paraphrase Churchill, this isn't the end of the trade war, or even the beginning of the end - perhaps just the end of the beginning."
    },
    {
        "title": "'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'",
        "description": "The US is \"our closest ally\" but \"nothing is off the table\" in response to Donald Trump's 10% tariffs on imports from the UK, the business secretary has said.",
        "url": "https://news.sky.com/story/us-is-our-closest-ally-says-uk-minister-reacting-to-trump-tariffs-but-nothing-off-the-table-13340795",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jonathan-reynolds-business-secretary_6874430.jpg?20250402224419",
        "type": "Home",
        "Author": "Ben Bloch",
        "Date Published": "2025-04-02 21:13:00",
        "Headline": "The business secretary said the government will continue to negotiate an economic deal with the US to \"mitigate the impact\" of US trade tariffs.",
        "Content": "\n          Political reporter\n              @realBenBloch\n  The US is \"our closest ally\" but \"nothing is off the table\" in response to Donald Trump's 10% tariffs on imports from the UK, the business secretary has said. In a statement following the US president's nearly hour-long address to the world, Business and Trade Secretary Jonathan Reynolds said: \"We will always act in the best interests of UK businesses and consumers. \"That's why, throughout the last few weeks, the government has been fully focused on negotiating an economic deal with the United States that strengthens our existing fair and balanced trading relationship.\" Follow the latest following Trump's tariffs announcement Mr Reynolds reiterated the statements from the prime minister and his cabinet over the past few days, saying the US is \"our closest ally\", and the government's approach is to \"remain calm and committed to doing this deal, which we hope will mitigate the impact of what has been announced today\". But he continued: \"We have a range of tools at our disposal, and we will not hesitate to act. We will continue to engage with UK businesses, including on their assessment of the impact of any further steps we take. \"Nobody wants a trade war, and our intention remains to secure a deal. But nothing is off the table, and the government will do everything necessary to defend the UK's national interest.\" \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 'Get back round the negotiating table', say Tories The Conservative Party's shadow business and trade secretary described the US president's announcement as \"disappointing news which will worry working families across the country\".  Andrew Griffith hit out at the government for having \"failed to negotiate with President Trump's team for too many months after the election, failed to keep our experienced top trade negotiator, and failed to get a deal to avoid the imposition of these tariffs by our closest trading partner\". \"The chancellor's emergency budget of just a week ago with its inadequate headroom is now at risk, casting uncertainty about more taxes or spending cuts,\" he continued. \"Sadly, it is British businesses and workers who will pay the price for Labour's failure.\" He called on ministers to \"swallow their pride\" and \"get back round the negotiating table to agree a fair deal to protect jobs and consumers in both the UK and the US alike\". Political editor It has been quite a rollercoaster for the government, where they went from the hope that they could avoid tariffs, that they could get that economic deal, to the realisation that was not going to happen, and then the anticipation of how hard would the UK be hit. In Westminster tonight, there is actual relief because the UK is going to have a 10% baseline tariff - but that is the least onerous of all the tariffs we saw President Trump announce.\n He held up a chart of the worst offenders, and the UK was well at the bottom of that list. No 10 sources were telling me as President Trump was in the Rose Garden that while no tariffs are good, and it's not what they want, the fact the UK has tariffs that are lower than others vindicates their approach. They say it's important because the difference between a 20% tariff and a 10% tariff is thousands of jobs. Where to next? No 10 says it will \"keep negotiating, keep cool and calm\", and reiterated Sir Keir Starmer's desire to \"negotiate a sustainable trade deal\". \"Of course want to get tariffs lowered. Tomorrow we will continue with that work,\" a source added. Another source said the 10% tariff shows that \"the UK is in the friendlies club, as much as that is worth anything\". Overnight, people will be number-crunching, trying to work out what it means for the UK. There is a 25% tariff on cars which could hit billions in UK exports, in addition to the blanket 10% tariff. But despite this being lower than many other countries, GDP will take a hit, with forecasts being downgraded probably as we speak. I think the government's approach will be to not retaliate and try to speed up that economic deal in the hope that they can lower the tariffs even further. There will be concessions. For example, the UK could lower the Digital Services Tax, which is imposed on the UK profits of tech giants. Will they loosen regulation on social media companies or agricultural products? But for now, there is relief the UK has not been hit as hard as many others. Liberal Democrat leader Sir Ed Davey has reacted furiously to Mr Trump's announcement of a \"destructive trade war\", and called on the government to stand up against \"Trump's attempts to divide and rule\". \"The prime minister should bring our Commonwealth and European partners together in a coalition of the willing against Trump's tariffs, using retaliatory tariffs where necessary and signing new trade deals with each other where possible.\" Speaking on Wednesday evening at a White House event entitled 'Make America Wealthy Again', the US president unleashed sweeping tariffs across the globe. Mr Trump held up a chart detailing the worst offenders - which also showed the new tariffs the US would be imposing. The UK's rate of 10% was perhaps a shot across the bow over the 20% VAT rate, though the president's suggested a 10% tariff imbalance between the two nations. Nonetheless, tariffs of 10% could directly reduce UK GDP by between 0.01% and 0.06%, according to Capital Economics. A 25% duty on all car imports from around the world is also being imposed from midnight in the US - 5am on Thursday, UK time. Read more: World reacts to Trump's tariff announcementTariffs will have consequences for globalisation, the US economy and geopoliticsTrump's tariffs explained The UK government had been hoping to negotiate an economic deal with the US in a bid to avoid the tariffs, but to no avail. The government says negotiations will continue. The Confederation of British Industry said \"negotiating stronger trading relationships with all like-minded partners will be foundational to any success\". The business secretary is expected to make a statement in the House of Commons on Thursday, and we are also expecting to hear from the prime minister."
    },
    {
        "title": "MP tells Sky News she was attacked online by Tate brothers after Commons contribution",
        "description": "An MP has told Sky News she was attacked online by the Tate brothers after she participated in a debate in the House of Commons about violence against women.",
        "url": "https://news.sky.com/story/mp-tells-sky-news-she-was-attacked-online-by-tate-brothers-after-commons-contribution-13340655",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sorcha-eastwood-tate_6874186.jpg?20250402204321",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-04-02 19:12:00",
        "Headline": "Andrew Tate and his brother Tristan are under investigation in Romania, the UK and Florida. They have denied any wrongdoing.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  An MP has told Sky News she was attacked online by the Tate brothers after she participated in a debate in the House of Commons about violence against women. The controversial duo, Andrew and Tristan Tate, are facing charges of rape and human trafficking in the UK - all of which they deny. But they are still very active online, and according to Sorcha Eastwood, the MP for Lagan Valley, are targeting her. In a document seen by Sky News, Tristan Tate has highlighted one of the MP's tweets and writes in private correspondence: \"MP, nice target, can we sue her?\" Sorcha Eastwood says at first she thought the replies were from parody accounts and not the Tate brothers. Her original tweet was about Elon Musk, not the Tate brothers. The MP said Musk's tweets should be looked at through a counter-extremism lens. \"I was really concerned, I was concerned because to me that is a direct attack for want of a better phrase on me serving my constituents. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \"I couldn't believe that they decided to pick this random Northern Irish MP. The fact that it wasn't even about them. This is something I didn't go looking for. \"I think from my perspective, it's a very, very sinister attempt to shut down important voices in public life, political discourse.\" It was only when she started noticing an uptick in abuse from other accounts she realised she had encountered some of the brothers' followers. \"I had rape threats. I had death threats. I had people saying I should be hung from a lamppost. I had people saying I should be chopped into liver. I also had people then who were like we'll waste 15 minutes raping Sorcha Eastwood.\" A representative for the Tate brothers told Sky News that there was no targeted campaign against her. They said: \"Ms Eastwood has a distorted view regarding social media if she believes one is required to 'invite or ask' people to interact. \"Tristan Tate is entitled to his view in relation to her tweet regarding Elon Musk.\" The self-styled \"misogynist influencer\" Andrew Tate and his brother Tristan have both been charged with human trafficking, face allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. There is also a European arrest warrant for them as they are facing separate, unrelated charges of rape and human trafficking in the UK. They deny all charges. Ms Eastwood now worries for others who don't have a platform like her and who may not feel like they can speak out. \"If this is what has happened to me I have absolutely no doubt that this has happened to others where they have been attempted to be silenced.\" Keir Starmer has previously commented on the Tate brothers' case in the Commons saying it is \"a live issue\", but adding that \"the principle is absolutely clear\" in relation to whether the brothers should face justice. Sorcha Eastwood says she wants to see the government do much more to protect against abuse online.  \"I think ultimately the government has taken the wrong course on this. They need to step up. \"This should be an issue of national security as far as the radicalisation of young people online. It should be an issue in terms of the levels of misinformation, disinformation and the lack of trust that is had in our politics right across the UK and Europe. \"I want the government to help me, help every other person to crack down on this and get serious about it. And the only way they'll be able to do that, is by hitting these tech companies in the only language which they understand, which is money and via robust legislation.\" A government spokesperson said: \"Violence against women and girls is a scourge on our society which is why we have set out an unprecedented mission to halve these crimes within a decade. \"Tackling illegal abuse both online and offline is central to supporting victims and preventing harm in our communities and we will not hesitate to strengthen laws to deliver this mission. \"Last month, parts of the Online Safety Act came into force meaning companies must take action to protect users from illegal material including extreme sexual violence. \"Further protections from this summer will require platforms to protect children from harmful, misogynistic, and violent content.\""
    },
    {
        "title": "Emergency appeal launched for Myanmar as more than 2,800 killed in earthquake",
        "description": "An emergency appeal has been launched after the 7.7 magnitude earthquake which struck Myanmar last week.",
        "url": "https://news.sky.com/story/emergency-appeal-launched-for-myanmar-as-more-than-2800-killed-in-earthquake-13340626",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-earthquake-myanmar_6874076.jpg?20250402193334",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-02 18:17:00",
        "Headline": "Broadcast appeal films to raise funds to support charity responses will air on Sky later today, as well as on BBC, ITV, Channel 4, and Channel 5.",
        "Content": "An emergency appeal has been launched after the 7.7 magnitude earthquake which struck Myanmar last week. More than 2,800 people were killed by the quake and its aftershocks on Friday, with thousands more injured and buildings in the worst hit areas in ruins. It is thought the actual number of dead could be much higher. Today, the Disasters Emergency Committee (DEC) has launched an appeal to raise funds for those impacted. DEC charities and local partners are already in Myanmar to assist with search and rescue efforts, as well as provide emergency aid.  Saleh Saeed, committee chief executive, said the devastation from the earthquake \"is heart-breaking, with thousands of people suddenly losing loved ones in the most shocking of ways\". He said Myanmar was \"already in the grip of a severe humanitarian crisis\" in the wake of the 2021 military coup, and now \"the situation is ever more critical\". \"We know that money is tight for many people here in the UK as the cost-of-living crisis continues, but if you can, please do donate to support the hundreds of thousands of people, children and families caught up in this deadly disaster,\" he added.  Arif Noor, country director of CARE International in Myanmar, added that emergency relief teams \"are witnessing complete devastation everywhere we go\". \"People traumatised by the earthquake are sleeping on the streets, with no clean water or food to eat and nowhere to escape from the heat,\" he said. \"They simply don't know where to turn or where to find safety.\" It comes after a local in Mandalay - Myanmar's second biggest city - told Sky News that \"when we pass near the destructions, the collapsed building or very damaged building, we can smell\" dead bodies. \"The smell of the dead bodies after four days... it still remains,\" he said, before adding: \"For the social assistance association... they need permission [to give aid] especially from the government. \"If they don't have permission, then they cannot do anything.\" Read more:How quake left some areas almost completely destroyedFootage shows what it's like to be trapped in rubble Broadcast appeal films to raise funds to support the charities' responses will air on Sky later today, as well as on BBC, ITV, Channel 4, and Channel 5. Every pound donated by the British public will be matched by the government through its UK Aid Match scheme, up to the value of Â£5 million."
    },
    {
        "title": "'It's just nasty': Birmingham residents 'overwhelmed' by foul stench and massive rats as bins strike rumbles on",
        "description": "In parts of Birmingham, the stench is overwhelming - enough to make you heave.",
        "url": "https://news.sky.com/story/its-just-nasty-birmingham-residents-overwhelmed-by-foul-stench-and-massive-rats-as-bins-strike-rumbles-on-13340646",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-birmingham-bin-strike_6874488.jpg?20250402232325",
        "type": "Home",
        "Author": "Lisa Dowd",
        "Date Published": "2025-04-02 18:57:00",
        "Headline": "As the bin workers' strike continues, Sky's Lisa Dowd visits Birmingham and finds sympathy for those taking industrial action - even as the smell from piles of rotting rubbish was hard to take.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  In parts of Birmingham, the stench is overwhelming - enough to make you heave. At a block of flats in Highgate, in Birmingham city centre, we find a mountain of bin liners full of rubbish spewing out of the cavernous bin store, which is normally locked. Mickel comes out to speak to us, while all around bin liners lie open, with the contents for all to see, including used nappies and rotting food.   We both find it hard to keep talking amid the awful smell. \"We've had foxes and rats, literally the size of cats, flies, it's just nasty, something needs to be done,\" he says. Around the corner, I meet Chris, in her dressing gown, popping the bins into her bin store beneath her flat before work. She unlocks it, and although it isn't bursting out on to the street yet, it is getting full. If you've been affected by the strikes and resulting pest infestation, we want to hear from you. You can share your story, pictures or video with us using our app, private messaging or email. â€¢ Your Report on Sky News apps\nâ€¢ WhatsApp\nâ€¢ Email at news@skynews.com By sending us your video footage/photographs/audio you agree we can broadcast, publish and edit the material and pass it on to others for similar use in any media worldwide, without any payment being due to you. Please do not submit your contribution unless you accept this. She says the situation is \"overwhelming\" as she's \"terrified of rats\". But, even so, she has sympathy for the striking bin workers. \"It's not an easy job; they must have a heart of gold to do that job,\" she says. \"Pay them whatever they need, they deserve it.\" At Lifford Lane tip, south of the city centre, Brigette has pulled up alongside picketing workers. The back seat of her car is full of rubbish. She apologises for the terrible waft, mixed with air freshener. Read more:Pest controllers 'feel like an emergency service'Bin workers strike explained \"It's very pungent, isn't it? Not nice,\" she admits. \"It's unfortunate, I have some sympathies for all the parties, but, equally, we have a duty of care to stay clean and tidy.\" She says she has her rubbish and that of her elderly aunt and plans to make weekly trips to the tip until a resolution in this pay dispute between the council and the Unite union is found."
    },
    {
        "title": "Elon Musk calls reports he will step back from government role 'fake news'",
        "description": "Elon Musk has called reports that he will leave his government role in the coming months \"fake news\".",
        "url": "https://news.sky.com/story/elon-musk-to-step-back-from-government-role-in-coming-months-13340539",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-wisconsin_6871788.jpg?20250403003208",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-02 15:25:00",
        "Headline": "A senior White House official told NBC News that Donald Trump discussed Elon Musk transitioning back to the private sector at a cabinet meeting in March. ",
        "Content": "Elon Musk has called reports that he will leave his government role in the coming months \"fake news\". A senior White House official previously told NBC News, Sky's US partner network, that Donald Trump had discussed the Tesla and X boss transitioning back to the private sector at a cabinet meeting last month. After reports emerged of the meeting, White House press secretary Karoline Leavitt said it was \"garbage\" and added: \"Elon Musk and President Trump have both publicly stated that Elon will depart from public service as a special government employee when his incredible work at DOGE is complete.\" Mr Musk added in response on X: \"Yeah, fake news.\" NBC News reported that the official said Mr Musk would leave at the end of his 130 days as a special government employee. That would be 30 May, but it is unclear if the billionaire businessman will indeed leave on that date. Previously, the White House said that as a temporary organisation, the Department of Government Efficiency (DOGE) would be terminated on 4 July next year - the 250th anniversary of the US. \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 ðŸ‘‰ Follow Trump 100 on your podcast app ðŸ‘ˆ It comes days after Mr Musk said some members of his DOGE team were getting death threats on a daily basis. Mr Musk had drawn criticism over his efforts to downsize the US federal government.  In just weeks, entire agencies were dismantled, and tens of thousands of workers from the 2.3 million federal workforce have been fired or have agreed to leave their jobs. A number of lawsuits were filed in state and federal courts over cuts recommended by DOGE."
    },
    {
        "title": "Man charged with 64 offences after investigation at Hull funeral home",
        "description": "A man has been charged with 64 offences in connection with an investigation into a Hull funeral directors, Humberside Police has said.",
        "url": "https://news.sky.com/story/man-charged-in-connection-with-hull-funeral-home-investigation-13340497",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hull-hull-funeral-funeral-directions_6873955.jpg?20250402152147",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-02 14:00:00",
        "Headline": "Robert Bush, 47, has been charged with 64 offences, including 30 counts of prevention of a lawful and decent burial and 30 counts of fraud by false representation relating to the deceased recovered from the funeral premises.",
        "Content": "A man has been charged with 64 offences in connection with an investigation into a Hull funeral directors, Humberside Police has said. An investigation was launched into Legacy Independent Funeral Directors after officers received reports of concern for the care of the deceased in March 2024. Following a 10-month investigation by Humberside Police, Robert Bush, 47, formerly of Kirk Ella, East Yorkshire, has been charged with 64 offences. The force says the charges include 30 counts of prevention of a lawful and decent burial and 30 counts of fraud by false representation relating to the deceased recovered from the funeral premises. Bush has also been charged with two counts of theft from charities and one count of fraudulent trading in relation to funeral plans - encompassing 172 victims - between 23 May 2012 and 6 March last year. He also faces one count of fraud in relation to human ashes involving 50 victims between 1 August 2017 and March 2024. The force said the charges related to 254 victims in total - comprising 252 people and two charities. Police recovered 35 bodies during a raid on the funeral directors in March last year. In April 2024, the force confirmed that it was impossible to identify any of the human ashes using DNA profiles. Bush has been bailed with conditions and will appear at Hull Magistrates' Court on 25 June. In a statement, deputy chief constable Dave Marshall said the force had updated the families of 35 deceased with the development and has made initial contact with additional victims who may have been affected. \"My sincerest thanks go out to those affected for their patience and understanding,\" he said. \"They have always been the priority and at the very heart of the entire investigation and this will remain, and we would please ask their privacy is continued to be respected.\" A 55-year-old woman arrested in July 2024 has today been released with no further action to be taken."
    },
    {
        "title": "'A genius actor', 'firecracker', and 'my friend': Tributes paid to Top Gun star Val Kilmer",
        "description": "Actors, directors and celebrity friends have paid tribute to Val Kilmer, after he died aged 65.",
        "url": "https://news.sky.com/story/a-genius-actor-firecracker-and-my-friend-tributes-paid-to-top-gun-star-val-kilmer-13340666",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/image_6873522.jpg?20250402064256",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-02 19:29:00",
        "Headline": "Nicolas Cage, who co-starred with Val Kilmer in Bad Lieutenant, said the actor was a \"genius actor\".",
        "Content": " Actors, directors and celebrity friends have paid tribute to Val Kilmer, after he died aged 65. The California-born star of Top Gun, Batman and Heat died of pneumonia on Tuesday night in Los Angeles, his daughter Mercedes told the Associated Press. She said Kilmer was diagnosed with throat cancer in 2014 but later recovered. Tributes flooded in after reports broke of the actor's death, with No Country For Old Men star Josh Brolin among the first to share their memories.  He wrote on Instagram: \"See ya, pal. I'm going to miss you. You were a smart, challenging, brave, uber-creative firecracker. There's not a lot left of those. \"I hope to see you up there in the heavens when I eventually get there. Until then, amazing memories, lovely thoughts.\" Kyle Maclachlan, who co-starred with Kilmer in the 1991 biopic The Doors, wrote on social media: \"You'll always be my Jim. See you on the other side my friend.\" \n                  Film star Val Kilmer dies aged 65\n                 \n                  Watch: Val Kilmer in his most iconic roles, including Top Gun and Batman Forever\n                 \n                  Stalker who believed Strictly Come Dancing judge Shirley Ballas was his aunt avoids jail\n                 Michael Mann, who directed Kilmer in 1995's Heat, also paid tribute in a statement, saying: \"I always marvelled at the range, the brilliant variability within the powerful current of Val's possessing and expressing character. \"After so many years of Val battling disease and maintaining his spirit, this is tremendously sad news.\" Heat co-star Danny Trejo also called Kilmer \"a great actor, a wonderful person, and a dear friend of mine\" on Instagram. Cher, who once dated the actor, said on X that \"U Were Funny, crazy, pain in the ass, GREAT FRIEND... BRILLIANT as Mark Twain, BRAVE here during ur sickness\". Lifelong friend and director of Twixt, Francis Ford Coppola said: \"Val Kilmer was the most talented actor when in his High School, and that talent only grew greater throughout his life. \"He was a wonderful person to work with and a joy to know - I will always remember him.\" The Top Gun account on X also said it was remembering Kilmer, who starred as Iceman in both the 1986 original and 2022 sequel, and \"whose indelible cinematic mark spanned genres and generations\". Nicolas Cage added that \"I always liked Val and am sad to hear of his passing\". \"I thought he was a genius actor,\" he said. \"I enjoyed working with him on Bad Lieutenant and I admired his commitment and sense of humor. \"He should have won the Oscar for The Doors.\""
    },
    {
        "title": "Netanyahu says Israel establishing new security corridor in Gaza to 'pressure Hamas' - and plans to seize 'large areas'",
        "description": "Israel is establishing a new security corridor across Gaza, Prime Minister Benjamin Netanyahu has announced, as his country plans to seize \"large areas\" of the Palestinian territory.",
        "url": "https://news.sky.com/story/israel-announces-military-operation-expanding-in-gaza-to-seize-large-areas-13340265",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-israeli-strike_6873768.jpg?20250402115716",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-02 05:56:00",
        "Headline": "Prime Minister Benjamin Netanyahu says his troops are seizing an area he called the Morag Axis, a reference to a former Israeli settlement previously located in an area between Rafah and Khan Younis.",
        "Content": " Israel is establishing a new security corridor across Gaza, Prime Minister Benjamin Netanyahu has announced, as his country plans to seize \"large areas\" of the Palestinian territory. Mr Netanyahu said Israel was \"increasing the pressure\" on Hamas as it demands the militant group returns dozens of remaining hostages taken in the 7 October 2023 attack. He said his troops were seizing an area he called the Morag Axis, a reference to a former Israeli settlement previously located in an area between the two southern cities of Rafah and Khan Younis. Mr Netanyahu said in a video message that \"we are now dividing the Strip and we are increasing pressure step by step so they will give us our hostages\". The prime minister said the move, which would cut off Rafah from Khan Younis, would give Israel control of a second axis in southern Gaza. That is in addition to the Philadelphi Corridor, running along the border with Egypt, which Israel sees as a key line stopping weapons being smuggled into Gaza. Earlier, Israel's defence minister Israel Katz said his country was beginning a major expansion of its military operation in the Strip and there would be a large-scale evacuation of the Palestinian population from fighting areas. Mr Katz said the operation would clear out militants and infrastructure \"and seize large areas that will be added to the security zones of the State of Israel\". It comes as a wave of Israeli strikes killed more than 40 Palestinians, including several women and children, according to Palestinian health officials. Israel controls a buffer zone along Gaza's whole border and recently ordered the full evacuation of Rafah. The expansion of Israel's military operation in Gaza deepens its renewed offensive. The ceasefire between Israel and Hamas that had begun in January ended in March as Israel launched various air strikes on targets across Gaza, and imposed a month-long halt to all imports of food, fuel and humanitarian aid. The deal had seen the release of dozens of hostages and hundreds of Palestinian prisoners, but collapsed before it could move to phase two, which would have involved the release of all hostages and the withdrawal of Israeli forces from Gaza. Middle East correspondent The statement by Israel's defence minister was clear on one thing: Israel intends to seize \"extensive\" areas of Gaza, perhaps permanently, to create an enlarged \"security area\" or buffer-zone. But it gave no further detail about which areas Israel intends to capture, although IDF forces are now moving into Rafah in the south of the strip. This might be a pressure tactic, a negotiating ploy or genuine intent â€“ we wonâ€™t know until meaningful negotiations begin again. The statement was met with anger from hostage families, who accused Katz of prioritising the capture of land over the fate of the remaining 59 hostages in Gaza. Katz has since tried to reassure them that the return of hostages is the priority. There is little sign that military pressure is working, though. Since breaking the ceasefire just over two weeks ago, Israeli forces have been steadily expanding operations and issuing new evacuation orders for parts of Gaza almost daily. They hope that this will not only force Hamas back to the negotiating table but secure a new truce and hostage release on Israel's terms. That is yet to happen. Hamas is sticking to its position â€“ an end to the war and a withdrawal of all IDF in return for the hostages. Israel does not agree to this. From conversations I've had with people in Gaza (international journalists are still being denied access by Israel) Hamas is putting up little fight against the IDF, although a small number of missiles have been fired into Israel. The move into Rafah will probably be much more straightforward this time now that the city is almost flattened and empty following months of heavy fighting previously. Once again Gazans are fleeing the fighting, carrying the little they can, and to humanitarian zones that have been repeatedly targeted by the IDF. Whether distracted by tariffs, the war in Ukraine or other matters, The White House's attention is not on Gaza â€“ that, and Trump's support for Israel, has given Netanyahu freedom to act. If the Israeli prime minister insists on annexing areas of Gaza for Israel's future security, all signs are that Washington will back him.  The Israel Defence Forces (IDF) had already issued evacuation warnings to Gazans living around Rafah and towards Khan Younis, telling them to move to the al Mawasi area on the shore, which was previously designated a humanitarian zone. Israeli forces have already set up a significant buffer zone within Gaza, having expanded an area around the edge of the territory that had existed before the war, as well as a large security area in the so-called Netzarim corridor through the middle of Gaza. This latest conflict began when Hamas launched an attack on Israel on 7 October 2023, killing around 1,200 people and taking around 250 hostages. The ensuing Israeli offensive has killed more than 50,000 Palestinians, according to Gaza's Hamas-run health ministry. It does not distinguish between civilians and combatants in its count, but has previously said more than half of those killed in the conflict were women and children.  Read more:Father demands protection after Gaza aid workers' deathsAnti-Hamas chants heard at rare protest in Gaza Aid group Doctors Without Borders warned on Wednesday that Israel's month-long siege of Gaza means some critical medications are now short in supply and are running out, leaving Palestinians at risk of losing vital healthcare. \"The Israeli authorities' have condemned the people of Gaza to unbearable suffering with their deadly siege,\" said Myriam Laaroussi, the group's emergency coordinator in Gaza. \"This deliberate infliction of harm on people is like a slow death; it must end immediately.\""
    },
    {
        "title": "MP tells Sky News she was attacked online by Tate brothers after Commons contribution",
        "description": "An MP has told Sky News she was attacked online by the Tate brothers after she participated in a debate in the House of Commons about violence against women.",
        "url": "https://news.sky.com/story/mp-tells-sky-news-she-was-attacked-online-by-tate-brothers-after-commons-contribution-13340655",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sorcha-eastwood-tate_6874186.jpg?20250402204321",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-04-02 19:12:00",
        "Headline": "Andrew Tate and his brother Tristan are under investigation in Romania, the UK and Florida. They have denied any wrongdoing.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  An MP has told Sky News she was attacked online by the Tate brothers after she participated in a debate in the House of Commons about violence against women. The controversial duo, Andrew and Tristan Tate, are facing charges of rape and human trafficking in the UK - all of which they deny. But they are still very active online, and according to Sorcha Eastwood, the MP for Lagan Valley, are targeting her. In a document seen by Sky News, Tristan Tate has highlighted one of the MP's tweets and writes in private correspondence: \"MP, nice target, can we sue her?\" Sorcha Eastwood says at first she thought the replies were from parody accounts and not the Tate brothers. Her original tweet was about Elon Musk, not the Tate brothers. The MP said Musk's tweets should be looked at through a counter-extremism lens. \"I was really concerned, I was concerned because to me that is a direct attack for want of a better phrase on me serving my constituents. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \"I couldn't believe that they decided to pick this random Northern Irish MP. The fact that it wasn't even about them. This is something I didn't go looking for. \"I think from my perspective, it's a very, very sinister attempt to shut down important voices in public life, political discourse.\" It was only when she started noticing an uptick in abuse from other accounts she realised she had encountered some of the brothers' followers. \"I had rape threats. I had death threats. I had people saying I should be hung from a lamppost. I had people saying I should be chopped into liver. I also had people then who were like we'll waste 15 minutes raping Sorcha Eastwood.\" A representative for the Tate brothers told Sky News that there was no targeted campaign against her. They said: \"Ms Eastwood has a distorted view regarding social media if she believes one is required to 'invite or ask' people to interact. \"Tristan Tate is entitled to his view in relation to her tweet regarding Elon Musk.\" The self-styled \"misogynist influencer\" Andrew Tate and his brother Tristan have both been charged with human trafficking, face allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. There is also a European arrest warrant for them as they are facing separate, unrelated charges of rape and human trafficking in the UK. They deny all charges. Ms Eastwood now worries for others who don't have a platform like her and who may not feel like they can speak out. \"If this is what has happened to me I have absolutely no doubt that this has happened to others where they have been attempted to be silenced.\" Keir Starmer has previously commented on the Tate brothers' case in the Commons saying it is \"a live issue\", but adding that \"the principle is absolutely clear\" in relation to whether the brothers should face justice. Sorcha Eastwood says she wants to see the government do much more to protect against abuse online.  \"I think ultimately the government has taken the wrong course on this. They need to step up. \"This should be an issue of national security as far as the radicalisation of young people online. It should be an issue in terms of the levels of misinformation, disinformation and the lack of trust that is had in our politics right across the UK and Europe. \"I want the government to help me, help every other person to crack down on this and get serious about it. And the only way they'll be able to do that, is by hitting these tech companies in the only language which they understand, which is money and via robust legislation.\" A government spokesperson said: \"Violence against women and girls is a scourge on our society which is why we have set out an unprecedented mission to halve these crimes within a decade. \"Tackling illegal abuse both online and offline is central to supporting victims and preventing harm in our communities and we will not hesitate to strengthen laws to deliver this mission. \"Last month, parts of the Online Safety Act came into force meaning companies must take action to protect users from illegal material including extreme sexual violence. \"Further protections from this summer will require platforms to protect children from harmful, misogynistic, and violent content.\""
    },
    {
        "title": "'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'",
        "description": "The US is \"our closest ally\" but \"nothing is off the table\" in response to Donald Trump's 10% tariffs on imports from the UK, the business secretary has said.",
        "url": "https://news.sky.com/story/us-is-our-closest-ally-says-uk-minister-reacting-to-trump-tariffs-but-nothing-off-the-table-13340795",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jonathan-reynolds-business-secretary_6874430.jpg?20250402224419",
        "type": "UK",
        "Author": "Ben Bloch",
        "Date Published": "2025-04-02 21:13:00",
        "Headline": "The business secretary said the government will continue to negotiate an economic deal with the US to \"mitigate the impact\" of US trade tariffs.",
        "Content": "\n          Political reporter\n              @realBenBloch\n  The US is \"our closest ally\" but \"nothing is off the table\" in response to Donald Trump's 10% tariffs on imports from the UK, the business secretary has said. In a statement following the US president's nearly hour-long address to the world, Business and Trade Secretary Jonathan Reynolds said: \"We will always act in the best interests of UK businesses and consumers. \"That's why, throughout the last few weeks, the government has been fully focused on negotiating an economic deal with the United States that strengthens our existing fair and balanced trading relationship.\" Follow the latest following Trump's tariffs announcement Mr Reynolds reiterated the statements from the prime minister and his cabinet over the past few days, saying the US is \"our closest ally\", and the government's approach is to \"remain calm and committed to doing this deal, which we hope will mitigate the impact of what has been announced today\". But he continued: \"We have a range of tools at our disposal, and we will not hesitate to act. We will continue to engage with UK businesses, including on their assessment of the impact of any further steps we take. \"Nobody wants a trade war, and our intention remains to secure a deal. But nothing is off the table, and the government will do everything necessary to defend the UK's national interest.\" \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 'Get back round the negotiating table', say Tories The Conservative Party's shadow business and trade secretary described the US president's announcement as \"disappointing news which will worry working families across the country\".  Andrew Griffith hit out at the government for having \"failed to negotiate with President Trump's team for too many months after the election, failed to keep our experienced top trade negotiator, and failed to get a deal to avoid the imposition of these tariffs by our closest trading partner\". \"The chancellor's emergency budget of just a week ago with its inadequate headroom is now at risk, casting uncertainty about more taxes or spending cuts,\" he continued. \"Sadly, it is British businesses and workers who will pay the price for Labour's failure.\" He called on ministers to \"swallow their pride\" and \"get back round the negotiating table to agree a fair deal to protect jobs and consumers in both the UK and the US alike\". Political editor It has been quite a rollercoaster for the government, where they went from the hope that they could avoid tariffs, that they could get that economic deal, to the realisation that was not going to happen, and then the anticipation of how hard would the UK be hit. In Westminster tonight, there is actual relief because the UK is going to have a 10% baseline tariff - but that is the least onerous of all the tariffs we saw President Trump announce.\n He held up a chart of the worst offenders, and the UK was well at the bottom of that list. No 10 sources were telling me as President Trump was in the Rose Garden that while no tariffs are good, and it's not what they want, the fact the UK has tariffs that are lower than others vindicates their approach. They say it's important because the difference between a 20% tariff and a 10% tariff is thousands of jobs. Where to next? No 10 says it will \"keep negotiating, keep cool and calm\", and reiterated Sir Keir Starmer's desire to \"negotiate a sustainable trade deal\". \"Of course want to get tariffs lowered. Tomorrow we will continue with that work,\" a source added. Another source said the 10% tariff shows that \"the UK is in the friendlies club, as much as that is worth anything\". Overnight, people will be number-crunching, trying to work out what it means for the UK. There is a 25% tariff on cars which could hit billions in UK exports, in addition to the blanket 10% tariff. But despite this being lower than many other countries, GDP will take a hit, with forecasts being downgraded probably as we speak. I think the government's approach will be to not retaliate and try to speed up that economic deal in the hope that they can lower the tariffs even further. There will be concessions. For example, the UK could lower the Digital Services Tax, which is imposed on the UK profits of tech giants. Will they loosen regulation on social media companies or agricultural products? But for now, there is relief the UK has not been hit as hard as many others. Liberal Democrat leader Sir Ed Davey has reacted furiously to Mr Trump's announcement of a \"destructive trade war\", and called on the government to stand up against \"Trump's attempts to divide and rule\". \"The prime minister should bring our Commonwealth and European partners together in a coalition of the willing against Trump's tariffs, using retaliatory tariffs where necessary and signing new trade deals with each other where possible.\" Speaking on Wednesday evening at a White House event entitled 'Make America Wealthy Again', the US president unleashed sweeping tariffs across the globe. Mr Trump held up a chart detailing the worst offenders - which also showed the new tariffs the US would be imposing. The UK's rate of 10% was perhaps a shot across the bow over the 20% VAT rate, though the president's suggested a 10% tariff imbalance between the two nations. Nonetheless, tariffs of 10% could directly reduce UK GDP by between 0.01% and 0.06%, according to Capital Economics. A 25% duty on all car imports from around the world is also being imposed from midnight in the US - 5am on Thursday, UK time. Read more: World reacts to Trump's tariff announcementTariffs will have consequences for globalisation, the US economy and geopoliticsTrump's tariffs explained The UK government had been hoping to negotiate an economic deal with the US in a bid to avoid the tariffs, but to no avail. The government says negotiations will continue. The Confederation of British Industry said \"negotiating stronger trading relationships with all like-minded partners will be foundational to any success\". The business secretary is expected to make a statement in the House of Commons on Thursday, and we are also expecting to hear from the prime minister."
    },
    {
        "title": "'It's just nasty': Birmingham residents 'overwhelmed' by foul stench and massive rats as bins strike rumbles on",
        "description": "In parts of Birmingham, the stench is overwhelming - enough to make you heave.",
        "url": "https://news.sky.com/story/its-just-nasty-birmingham-residents-overwhelmed-by-foul-stench-and-massive-rats-as-bins-strike-rumbles-on-13340646",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-birmingham-bin-strike_6874488.jpg?20250402232325",
        "type": "UK",
        "Author": "Lisa Dowd",
        "Date Published": "2025-04-02 18:57:00",
        "Headline": "As the bin workers' strike continues, Sky's Lisa Dowd visits Birmingham and finds sympathy for those taking industrial action - even as the smell from piles of rotting rubbish was hard to take.",
        "Content": "\n          Midlands correspondent\n              @LisaSkyNews\n  In parts of Birmingham, the stench is overwhelming - enough to make you heave. At a block of flats in Highgate, in Birmingham city centre, we find a mountain of bin liners full of rubbish spewing out of the cavernous bin store, which is normally locked. Mickel comes out to speak to us, while all around bin liners lie open, with the contents for all to see, including used nappies and rotting food.   We both find it hard to keep talking amid the awful smell. \"We've had foxes and rats, literally the size of cats, flies, it's just nasty, something needs to be done,\" he says. Around the corner, I meet Chris, in her dressing gown, popping the bins into her bin store beneath her flat before work. She unlocks it, and although it isn't bursting out on to the street yet, it is getting full. If you've been affected by the strikes and resulting pest infestation, we want to hear from you. You can share your story, pictures or video with us using our app, private messaging or email. â€¢ Your Report on Sky News apps\nâ€¢ WhatsApp\nâ€¢ Email at news@skynews.com By sending us your video footage/photographs/audio you agree we can broadcast, publish and edit the material and pass it on to others for similar use in any media worldwide, without any payment being due to you. Please do not submit your contribution unless you accept this. She says the situation is \"overwhelming\" as she's \"terrified of rats\". But, even so, she has sympathy for the striking bin workers. \"It's not an easy job; they must have a heart of gold to do that job,\" she says. \"Pay them whatever they need, they deserve it.\" At Lifford Lane tip, south of the city centre, Brigette has pulled up alongside picketing workers. The back seat of her car is full of rubbish. She apologises for the terrible waft, mixed with air freshener. Read more:Pest controllers 'feel like an emergency service'Bin workers strike explained \"It's very pungent, isn't it? Not nice,\" she admits. \"It's unfortunate, I have some sympathies for all the parties, but, equally, we have a duty of care to stay clean and tidy.\" She says she has her rubbish and that of her elderly aunt and plans to make weekly trips to the tip until a resolution in this pay dispute between the council and the Unite union is found."
    },
    {
        "title": "Man charged with 64 offences after investigation at Hull funeral home",
        "description": "A man has been charged with 64 offences in connection with an investigation into a Hull funeral directors, Humberside Police has said.",
        "url": "https://news.sky.com/story/man-charged-in-connection-with-hull-funeral-home-investigation-13340497",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-hull-hull-funeral-funeral-directions_6873955.jpg?20250402152147",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-02 14:00:00",
        "Headline": "Robert Bush, 47, has been charged with 64 offences, including 30 counts of prevention of a lawful and decent burial and 30 counts of fraud by false representation relating to the deceased recovered from the funeral premises.",
        "Content": "A man has been charged with 64 offences in connection with an investigation into a Hull funeral directors, Humberside Police has said. An investigation was launched into Legacy Independent Funeral Directors after officers received reports of concern for the care of the deceased in March 2024. Following a 10-month investigation by Humberside Police, Robert Bush, 47, formerly of Kirk Ella, East Yorkshire, has been charged with 64 offences. The force says the charges include 30 counts of prevention of a lawful and decent burial and 30 counts of fraud by false representation relating to the deceased recovered from the funeral premises. Bush has also been charged with two counts of theft from charities and one count of fraudulent trading in relation to funeral plans - encompassing 172 victims - between 23 May 2012 and 6 March last year. He also faces one count of fraud in relation to human ashes involving 50 victims between 1 August 2017 and March 2024. The force said the charges related to 254 victims in total - comprising 252 people and two charities. Police recovered 35 bodies during a raid on the funeral directors in March last year. In April 2024, the force confirmed that it was impossible to identify any of the human ashes using DNA profiles. Bush has been bailed with conditions and will appear at Hull Magistrates' Court on 25 June. In a statement, deputy chief constable Dave Marshall said the force had updated the families of 35 deceased with the development and has made initial contact with additional victims who may have been affected. \"My sincerest thanks go out to those affected for their patience and understanding,\" he said. \"They have always been the priority and at the very heart of the entire investigation and this will remain, and we would please ask their privacy is continued to be respected.\" A 55-year-old woman arrested in July 2024 has today been released with no further action to be taken."
    },
    {
        "title": "Heathrow bosses were warned about power supply after stolen cables turned off runway lights, MPs told",
        "description": "Heathrow bosses were warned its power supply was vulnerable less than a week before the major outage in March, a committee of MPs has heard.",
        "url": "https://news.sky.com/story/heathrow-bosses-warned-about-substation-days-before-major-power-outage-mp-committee-hears-13340317",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport-fire_6864202.jpg?20250322155749",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-02 08:20:00",
        "Headline": "The head of a body representing more than 90 airlines using Heathrow says the airport could have had some flights moving by mid-morning, rather than being shut for a day, following the substation fire in March.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Heathrow bosses were warned its power supply was vulnerable less than a week before the major outage in March, a committee of MPs has heard. A terminal at the airport could also have had some flights moving by mid-morning rather than being shut for a day, the committee was told. Nigel Wicking, the chief executive of Heathrow Airline Operators' Committee, told MPs of the Transport Committee he raised issues about resilience on 15 March after cable and wiring theft took out lights on a runway. Mr Wicking said he believed Heathrow's Terminal 5 could have been ready to receive repatriation flights by \"late morning\" on the day of the closure, as \"there was opportunity also to get flights out\". A fire at an electricity substation in west London meant the power supply was disrupted to Europe's largest airport for a day on 21 March - causing travel chaos for nearly 300,000 passengers, the committee heard. Mr Wicking, the head of a body representing more than 90 airlines using Heathrow Airport, told MPs: \"I'd actually warned Heathrow of concerns that we had with regard to the substations and my concern was resilience.\" He said he spoke to the Team Heathrow director on March 15 about his power concerns, and the chief operating officer and chief customer officer on March 19. Mr Wicking added: \"It was following a number of, a couple of incidents of, unfortunately, theft, of wire and cable around some of the power supply that on one of those occasions, took out the lights on the runway for a period of time. That obviously made me concerned.\" The desire for information on the outage and closure was so large that a Teams call on the day of the closure was \"maxed out\" with \"a thousand participants\", Mr Wicking added. Read more:Airlines threaten Heathrow with legal actionNational Grid boss claims Heathrow had 'enough power'Weddings, rugby tours and Arctic Circle trips affected by shutdown However, Heathrow chief executive Thomas Woldbye said keeping the airport open during last month's power outage would have been \"disastrous\". There was a risk of having \"literally tens of thousands of people stranded in the airport, where we have nowhere to put them\", Mr Woldbye told MPs. Fire surveillance and CCTV systems were down as a result of having limited electricity, he added, meaning it would not have been safe to reopen. 'Most expensive airport in the world' Heathrow should have top quality infrastructure and service, Mr Wicking told MPs. \"It is the most expensive airport in the world with regard to passenger challenges,\" he said. \"So from our perspective, that means we should actually have the best service. We should have the best infrastructure.\" A review on resilience at Heathrow was done in 2018, according to Mr Wicking who said he was told it was \"not for sharing\" with airlines. He added that he had told Mr Woldbye: \"I think it is for sharing now because frankly, we're paying enough. \"I don't feel that we should be paying more attention for further resilience. The resilience should have been there in the first place.\" News correspondent There was clear tension between airlines and Heathrow Airport but little clarity on much else. Nobody took sole responsibility for the 21 March outage at Heathrow, and broader questions ultimately went unanswered despite a grilling. Among them, what can be done to prevent this from happening again, and what is next for the airport in terms of resilience? Also, who will be responsible for compensation? Thomas Woldbye, Heathrow chief executive, said to give the airport \"full resilience\" it would cost more than Â£1bn, and airlines would have to help foot the bill. Airlines argued back that they already pay enough for \"the world's most expensive airport\", and that the resilience \"should have been there in the first place\". What about liability too? That's also not been decided yet.  Mr Woldbye said discussions would happen when the facts were known, including why the fire started. The airlines are also reluctant to pay, stating it was \"not fair\" for them to have to fork out for a situation they didn't cause. The fact that concerns had been raised about Heathrow's power supply days before the \"unprecedented\" event may feature heavily in any argument moving forward. They'll all be waiting for the (at least) three reviews currently under way before, no doubt, the blaming and finger-pointing will begin once again behind closed doors. Uncertainty about Heathrow's foundation When asked if Heathrow is a problematic airport, Mr Wicking said: \"We've got to look at this with regard to future growth and expansion, investment, et cetera. \"We're not sure about the foundations of Heathrow as it stands at the moment; there have been a series of events such as this. \"We've had outages during last year where we had 82 baggage system issues... thousands of bags misconnecting and... it's the most expensive airport in the world for passenger charges\"."
    },
    {
        "title": "Royal Navy warship takes out air and sea drones in 'realistic' exercise",
        "description": "\"Action stations!\" a voice barks.",
        "url": "https://news.sky.com/story/royal-navy-warship-takes-out-air-and-sea-drones-in-realistic-exercise-13340221",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dauntless-royal-navy_6873491.jpg?20250402014534",
        "type": "UK",
        "Author": "Deborah Haynes",
        "Date Published": "2025-04-02 00:25:00",
        "Headline": "A number of real unmanned aerial systems and uncrewed attack boats were used for training. Drone vessels, packed with explosives, are an emerging maritime threat. Ukraine has used them to great effect against Russia's Black Sea Fleet.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  \"Action stations!\" a voice barks. The crew of a Royal Navy destroyer is on high alert for enemy drones - launched from the air and from the water. \"Maximum air threat,\" the voice says. A helicopter, already airborne, uses a missile to take out an incoming drone from a distance, while the ship's guns open fire on a small uncrewed vessel racing towards it. The action, using live rounds, unfolded on Tuesday off the Welsh coast as HMS Dauntless, a Type 45 destroyer, took part in an exercise to prepare for a major deployment to Asia in the coming weeks alongside one of the UK's two aircraft carriers. The voyage could take the carrier strike group through hostile waters, including within range of Iranian-backed Houthi rebels in Yemen. It means the heavily-armed destroyer - a key layer of defence for HMS Prince of Wales - may come under attack for real. Luke Pollard, the armed forces minister, said the ship was well prepared. \"If anyone were to threaten our carrier, they should be in no doubt that we possess formidable capabilities to defend ourselves, to defend every ship in that task force,\" he told Sky News, speaking onboard Dauntless, having watched part of the training. Escalating tensions between Washington and Tehran may also impact the long-planned trip. Donald Trump has threatened to bomb Iran if the regime does not reach an agreement with Washington over its nuclear programme. Asked whether the UK would divert its warships to support the US - if requested - should it attack Iran, Mr Pollard said: \"The advantage of naval power is that it always presents options, so there's always options in support of our national security objectives. \"That's why, when the carrier sails shortly for the Indo-Pacific, there's options for her entire deployment as to how we use that power.\" Read more from Sky News:More potential victims come forward after 'prolific' rapist jailedWhite House says 'days of US being ripped off are over'US prosecutors to seek death penalty for man accused of killing healthcare boss Practising their defensive drills, the crew of HMS Dauntless, commanded by Commander Ben Dorrington, used radars and binoculars to scan the area for enemy drones. A large portion of the exercise involved simulated threats, such as pretend swarms of aerial drones and uncrewed vessels, cruise missiles and hostile jets But there were also a number of real unmanned aerial systems and uncrewed attack boats for training. Drone vessels, packed with explosives, are an emerging maritime threat. Ukraine has used them to great effect against Russia's Black Sea Fleet. Sky News watched as fixed guns on one side of the destroyer opened fire on an uncrewed vessel that was playing the part of the enemy. The weapons included a cannon called Phalanx, which can pump out 3,000 rounds of armour-piercing shells a minute. Rounds could be seen piercing the water. The gunners then took out the boat, with flames and smoke rising out of it. Despite some cutting-edge capabilities, the Royal Navy's fighting capacity is increasingly finite after decades of defence cuts. The government has announced plans to increase defence spending to 2.5% of GDP by 2027, but many defence insiders say the increase is too small and too slow. Mr Pollard defended the policy, pointing to an extra Â£5bn in the budget this year. \"We know the world is more dangerous, we know threats towards the UK and our allies are increasing, and that's why we're investing in defence.\""
    },
    {
        "title": "The cheerful optimism of supporters of the assisted dying bill has turned to nervousness",
        "description": "The assisted dying bill is entering the make-or-break stage.",
        "url": "https://news.sky.com/story/the-cheerful-optimism-of-supporters-of-the-assisted-dying-bill-has-turned-to-nervousness-13340540",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-assisted-dying-kim-leadbeater_6874025.jpg?20250402172608",
        "type": "UK",
        "Author": "Ali Fortescue",
        "Date Published": "2025-04-02 15:25:00",
        "Headline": "The next vote on the historic legislation will take place as early as next month - meaning MPs must make their minds up about a bill that evokes strong emotions and will have consequences far beyond parliament.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n The assisted dying bill is entering the make-or-break stage. The message from those around Kim Leadbeater is that all is calm and well. She tells me she is \"not particularly worried\" about 28 MPs changing their minds and overturning the previous, historic, vote at the bill's second reading. But the mood at the assisted dying campaign's press conference today is different. The cheerful optimism that marked the last one has turned to a charged nervousness. They should be nervous. There are jitters among a number of MPs I've spoken to who voted for the bill last time but are concerned about safeguards and timeframes. Politics latest: Chancellor grilled over her spring statement  MPs do not have long to make up their minds - after the Easter recess the report stage of the process will begin (probably on the 25 April) and the next vote is expected around the 16 May. It will be the crunch vote where MPs who voted for the bill in principle - to see it debated - will need to pick a side. \n                  Assisted dying in doubt as rollout could be delayed until at least 2029\n                 \n                  Isle of Man to become first of British Isles to legalise assisted dying\n                 \n                  MPs vote to scrap High Court judge requirement in assisted dying bill\n                 Last time a majority of 55 MPs voted for assisted dying, more than many had expected but not enough to make the path to law certain. Reform's Lee Anderson and his former colleague Rupert Lowe have both told us they will no longer be backing the bill, having supported it last time. No Labour MPs I've spoken to appear to have decisively changed their mind, however. \"I would hope that some colleagues would come on board that potentially voted against it last time,\" Ms Leadbeater tells me. But the sense I get is the mood may be in the other direction. The main issue that comes up is the removal of the requirement of a High Court judge - to be replaced by a panel of experts including a senior lawyer, psychiatrist and social worker. Ms Leadbeater says the safeguards are now stronger. There has also been criticism that some amendments, including on closing a so-called anorexia loophole, were not selected. Naz Shah, the Labour MP for Bradford West who did not back the assisted dying bill but claims she was \"very open\" to voting for it, says the process has been \"fundamentally flawed\". She says: \"The intention for me was, is it going to be safer? Can I vote for this bill? Ultimately the conclusion I've drawn is, no, it's not safe enough.\"  There is also disquiet about the deadline for the implementation of assisted dying being pushed to four years, which some fear will mean it will be politicised in an election campaign. Ms Leadbeater says it is \"more important to do this right than to do this quickly\". She believes implementation can still be achieved in two years. And what of the toll it has taken on the MP herself? It was always remarkable that such consequential legislation to be brought via an individual MP's private members bill. Read more:Payouts for departing civil servants capped at Â£95,000Why is assisted dying so controversial? Ms Leadbeater, whose sister Jo Cox was murdered when she was an MP, tells me \"the personal toll has been quite hard\". She talks about the \"unpleasantness and nastiness\" that has been directed towards her but believes her parliamentary colleagues have come to the argument in good faith. \"I think people have got their views and they've got strong views\", she says. \"We all have to think about how we behave in this very privileged, very responsible job.\" One thing is for sure, it's nearly make-your-mind-up time for MPs, and what happens next will have consequences well beyond parliament."
    },
    {
        "title": "'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News",
        "description": "Tulip Siddiq has told Sky News her \"lawyers are ready\" to handle any formal questions about allegations she is involved in corruption in Bangladesh.",
        "url": "https://news.sky.com/story/my-lawyers-are-ready-for-questions-about-corruption-claims-ex-minister-tells-sky-news-13340622",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tulip-siddiq-rob-powell_6874077.jpg?20250402193448",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-04-02 18:19:00",
        "Headline": "Tulip Siddiq resigned as anti-corruption minister in January after being named in corruption probes opened by the authorities in Bangladesh.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Tulip Siddiq has told Sky News her \"lawyers are ready\" to handle any formal questions about allegations she is involved in corruption in Bangladesh. Asked whether she regrets apparent links with the Bangladeshi Awami League political party, Ms Siddiq said \"why don't you look at my legal letter and see if I have any questions to answerâ€¦ [the Bangladeshi authorities] have not once contacted me and I'm waiting to hear from them\". The London MP resigned as a Treasury minister in January after being named in several corruption inquiries in Bangladesh. In her first public comments since leaving government, Ms Siddiq said \"there's been allegations for months on end and no one has contacted me\". Last month, the interim leader of Bangladesh told Sky News the MP had \"wealth left behind\" in the country \"and should be made responsible\". Lawyers acting for Ms Siddiq wrote to the Bangladeshi Anti Corruption Commission (ACC) several weeks ago saying the allegations were \"false and vexatious\". The letter said the ACC must put questions to Ms Siddiq \"by no later than 25 March 2025\" or \"we shall presume that there are no legitimate questions to answer\". \n                  Ex-minister Tulip Siddiq attacks 'targeted and baseless campaign' against her by Bangladesh authorities\n                 \n                  Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister\n                 \n                  'The ugliest thing': Bangladesh leader reacts to 'House of Mirrors' prison - and vows to put Sheikh Hasina on trial\n                  In a post online today, the former minister said the deadline had expired and the authorities had not replied. Sky News has approached the Bangladeshi government for comment. The allegations against Ms Siddiq are focused on links to her aunt Sheikh Hasina - who served as the prime minister of Bangladesh for 20 years. Ms Hasina was forced to flee the country in August following weeks of deadly protests. She is accused of becoming an autocrat, with politically-motivated arrests, extra-judicial killings and other abuses allegedly happening on her watch. Hasina claims it's all a political witch hunt. Electrocuted on their genitals and mouths sewn up: Inside Bangladesh's 'death squad' jails Ms Siddiq was found to have lived in several London properties that had links back to the Awami League political party that her aunt still leads. She referred herself to the prime minister's standards adviser Sir Laurie Magnus who said he had \"not identified evidence of improprieties\" but added it was \"regrettable\" Ms Siddiq had not been more alert to the \"potential reputational risks\" of the ties to her aunt. Ms Siddiq said continuing in her role would be \"a distraction\" for the government but insisted she had done nothing wrong."
    },
    {
        "title": "Virginia Giuffre: Prince Andrew accuser to face court for 'breaching restraining order' after claiming she had 'days to live'",
        "description": "The woman who reached an out-of-court settlement with Prince Andrew after accusing him of sexual assault is facing court over allegedly breaching a restraining order.",
        "url": "https://news.sky.com/story/virginia-giuffre-prince-andrew-accuser-to-face-court-for-breaching-restraining-order-after-claiming-she-had-days-to-live-13340311",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-02 07:59:00",
        "Headline": "Ms Giuffre, who is due to appear in court on 9 April, said in Instagram post this week that a car she was travelling in was hit by a school bus and she was given \"four days to live\".",
        "Content": "The woman who reached an out-of-court settlement with Prince Andrew after accusing him of sexual assault is facing court over allegedly breaching a restraining order. The court appearance will come after Virginia Giuffre said this week that she had been given \"four days to live\" after a car she was travelling in was hit by a school bus. Ms Giuffre, who lives in Australia, has been charged with breaching a family violence restraining order in Ocean Reef, near Perth, on 2 February, Western Australia (WA) Courts said. The case was first heard in Joondalup Magistrates' Court in northern Perth on 14 March, where she did not enter a plea, WA Courts said. The case is due back in court on 9 April. Ms Giuffre said in an Instagram post this week that a car she was travelling in was \"slowing for a turn\" when it was struck by a school bus travelling at 110kmph (68mph). The 41-year-old shared a photo of herself appearing to be badly bruised and lying in a hospital bed and wrote that she had \"gone into kidney renal failure\". \n                  Sam Jones: US influencer who snatched baby wombat from its mother leaves Australia amid fears for animal's health\n                 \n                  Australian PM Anthony Albanese hits out at baby wombat-snatching US influencer\n                 \n                  Former Australian Test cricketer Stuart MacGill found guilty of taking part in the supply of cocaine\n                 Police later said they received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles north of Perth, on 24 March. A spokesperson said the collision was reported by the bus driver the following day, and there were no reported injuries. In her Instagram post, mother-of-three Ms Giuffre had written: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time, but you know what they say about wishes. S**t in one hand and wish in the other & I guarantee it's still going to be s**t at the end of the day.\" According to reports, a spokesperson for Ms Giuffre said the Instagram post was a mistake and she had meant to share the post to her private Facebook page. A statement said: \"Virginia thanks everyone for the outpouring of love and support. She is overwhelmed with gratitude. \"Today she remains in [a] serious condition while receiving medical care. On 24 March, in rural Western Australia, a school bus hit the car in which she was riding.\" It said: \"Virginia was banged up and bruised and returned home. Virginia's condition worsened and she was admitted to the hospital.\" Read more from Sky News:Val Kilmer dies aged 65Inside the engine room of China's economyHeathrow bosses 'warned about substation' Ms Giuffre is reported to have separated from her husband. A previous Instagram post by Ms Giuffre on 22 March included the caption: \"My beautiful babies have no clue how much I love them and they're being poisoned with lies. I miss them so very much. I have been through hell & back in my 41 years but this is incredibly hurting me worse than anything else. Hurt me, abuse me but don't take my babies.\" Ms Giuffre is one of the most prominent accusers of paedophile financier Jeffrey Epstein. She sued Prince Andrew for allegedly sexually assaulting her when she was 17 after she was trafficked by paedophile financier Jeffrey Epstein. The duke has repeatedly denied the claims and has not been charged with any criminal offences. He paid millions to settle the case with Ms Giuffre, who he said he had never met."
    },
    {
        "title": "'No justification for this': World reacts to Trump's tariff announcement",
        "description": "World leaders and governments have begun reacting to Donald Trump's sweeping tariffs.",
        "url": "https://news.sky.com/story/no-justification-for-this-world-reacts-to-trumps-tariff-announcement-13340828",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-us_6874310.jpg?20250402213917",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-02 21:27:00",
        "Headline": "Irish Prime Minister Micheal Martin has said there is \"no justification\" for US tariffs, while Canadian Prime Minister Mark Carney said Canada will fight tariffs with countermeasures. Here's how world leaders have reacted.",
        "Content": " World leaders and governments have begun reacting to Donald Trump's sweeping tariffs. The president imposed a 10% baseline tariff on all imports - but many of America's biggest trading partners have been hit by a far higher rate Speaking at an event entitled 'Make America Wealthy Again', Mr Trump hit out at foreign \"cheaters\" and held a chart detailing who would pay what. Here is some of the latest reaction.  China, facing a 34% tax, urged the US to immediately cancel the move and said it would \"resolutely\" take countermeasures to safeguard its interests. \"Many trading partners have expressed strong dissatisfaction and clear opposition,\" said a commerce ministry statement. Irish Prime Minister Micheal Martin has said there is \"no justification\" for US tariffs. \"I deeply regret the US decision to impose 20% tariffs on imports from across the European Union,\" the taoiseach added. \"We see no justification for this. More than â‚¬4.2bn worth of goods and services are traded between the EU and the US daily. \"Disrupting this deeply integrated relationship benefits no one. Tariffs drive inflation, hurt people on both sides of the Atlantic, and put jobs at risk.\" Japan's trade minister, Yoji Muto, called the tariffs \"extremely regrettable\" and said all options were open. Asked if Japan would retaliate, he added: \"We need to decide what is best for Japan, and most effective, in a careful but bold and speedy manner.\" Read more:Trump's tariffs will have consequences - Ed ConwayUK reacts to Trump's tariffs Manfred Weber, the president of the largest party in the European Parliament, the EPP, said: \"To our American friends, today isn't liberation day - it's resentment day. Donald Trump's tariffs don't defend fair trade; they attack it out of fear and hurt both sides of the Atlantic. \"Europe stands united, ready to defend its interests, and open to fair, firm talks.\" Europe correspondent There will be a response from the European Union - the question is how soon, and how tough. A symbolic reprisal is one choice - putting tariffs on classic American products such as Harley-Davidson motorbikes or bottles of bourbon.  That wonâ€™t damage the European economy, but it wonâ€™t make much of a difference, either. Thereâ€™s a reluctance to slap wide-ranging, indiscriminate tariffs simply because that would increase costs for many European manufacturers.  So something more targeted may look appealing and that could mean going after the tech giants - Facebook, Apple, Google, Amazon, for example. Companies who have already had rows with EU regulators and are seen as being, to varying extents, close to the White House.  If Europe could specifically target Tesla, it probably would. There are also those suggesting the EU should hold fire for the moment, confident that Trumpâ€™s tariffs will backfire and keen that the effects are visible. One fear is that some of the cheap goods that were destined for US markets will now be diverted to Europe, flooding its market. Another fear is how the Windsor Framework will be affected, now that there are different US tariffs on either side of the Irish border. And finally there is that insult from the President, who called the European Union â€œpatheticâ€. A few minutes later, a senior EU diplomat sent me a message saying â€œthe US is Brexiting the world, but you canâ€™t stop the march of follyâ€. Transatlantic relations are getting even icier. Canadian Prime Minister Mark Carney said his country would fight tariffs with countermeasures. \"It's essential to act with purpose and with force, and that's what we will do,\" he told reporters ahead of a cabinet meeting to discuss Canada's response. Australian Prime Minister Anthony Albanese said: \"It is the American people who will pay the biggest price for these unjustified tariffs. \"This is why our government will not be seeking to impose reciprocal tariffs. We will not join a race to the bottom that leads to higher prices and slower growth.\" Italian Prime Minister Giorgia Meloni, seen as close ally of the US president, called the tariffs \"wrong\" and said they would not benefit the United States. \"We will do everything we can to work towards an agreement with the United States, with the goal of avoiding a trade war that would inevitably weaken the West in favour of other global players,\" she said. The Spanish Prime Minister Pedro Sanchez vowed to protect the country's companies and workers and to \"continue to be committed to an open world.\" His Swedish counterpart, Ulf Kristersson, said: \"We don't want growing trade barriers. \"We don't want a trade war. \"We want to find our way back to a path of trade and cooperation together with the US, so that people in our countries can enjoy a better life.\""
    },
    {
        "title": "Emergency appeal launched for Myanmar as more than 2,800 killed in earthquake",
        "description": "An emergency appeal has been launched after the 7.7 magnitude earthquake which struck Myanmar last week.",
        "url": "https://news.sky.com/story/emergency-appeal-launched-for-myanmar-as-more-than-2800-killed-in-earthquake-13340626",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-earthquake-myanmar_6874076.jpg?20250402193334",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-02 18:17:00",
        "Headline": "Broadcast appeal films to raise funds to support charity responses will air on Sky later today, as well as on BBC, ITV, Channel 4, and Channel 5.",
        "Content": "An emergency appeal has been launched after the 7.7 magnitude earthquake which struck Myanmar last week. More than 2,800 people were killed by the quake and its aftershocks on Friday, with thousands more injured and buildings in the worst hit areas in ruins. It is thought the actual number of dead could be much higher. Today, the Disasters Emergency Committee (DEC) has launched an appeal to raise funds for those impacted. DEC charities and local partners are already in Myanmar to assist with search and rescue efforts, as well as provide emergency aid.  Saleh Saeed, committee chief executive, said the devastation from the earthquake \"is heart-breaking, with thousands of people suddenly losing loved ones in the most shocking of ways\". He said Myanmar was \"already in the grip of a severe humanitarian crisis\" in the wake of the 2021 military coup, and now \"the situation is ever more critical\". \"We know that money is tight for many people here in the UK as the cost-of-living crisis continues, but if you can, please do donate to support the hundreds of thousands of people, children and families caught up in this deadly disaster,\" he added.  Arif Noor, country director of CARE International in Myanmar, added that emergency relief teams \"are witnessing complete devastation everywhere we go\". \"People traumatised by the earthquake are sleeping on the streets, with no clean water or food to eat and nowhere to escape from the heat,\" he said. \"They simply don't know where to turn or where to find safety.\" It comes after a local in Mandalay - Myanmar's second biggest city - told Sky News that \"when we pass near the destructions, the collapsed building or very damaged building, we can smell\" dead bodies. \"The smell of the dead bodies after four days... it still remains,\" he said, before adding: \"For the social assistance association... they need permission [to give aid] especially from the government. \"If they don't have permission, then they cannot do anything.\" Read more:How quake left some areas almost completely destroyedFootage shows what it's like to be trapped in rubble Broadcast appeal films to raise funds to support the charities' responses will air on Sky later today, as well as on BBC, ITV, Channel 4, and Channel 5. Every pound donated by the British public will be matched by the government through its UK Aid Match scheme, up to the value of Â£5 million."
    },
    {
        "title": "Netanyahu says Israel establishing new security corridor in Gaza to 'pressure Hamas' - and plans to seize 'large areas'",
        "description": "Israel is establishing a new security corridor across Gaza, Prime Minister Benjamin Netanyahu has announced, as his country plans to seize \"large areas\" of the Palestinian territory.",
        "url": "https://news.sky.com/story/israel-announces-military-operation-expanding-in-gaza-to-seize-large-areas-13340265",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-gaza-israeli-strike_6873768.jpg?20250402115716",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-02 05:56:00",
        "Headline": "Prime Minister Benjamin Netanyahu says his troops are seizing an area he called the Morag Axis, a reference to a former Israeli settlement previously located in an area between Rafah and Khan Younis.",
        "Content": " Israel is establishing a new security corridor across Gaza, Prime Minister Benjamin Netanyahu has announced, as his country plans to seize \"large areas\" of the Palestinian territory. Mr Netanyahu said Israel was \"increasing the pressure\" on Hamas as it demands the militant group returns dozens of remaining hostages taken in the 7 October 2023 attack. He said his troops were seizing an area he called the Morag Axis, a reference to a former Israeli settlement previously located in an area between the two southern cities of Rafah and Khan Younis. Mr Netanyahu said in a video message that \"we are now dividing the Strip and we are increasing pressure step by step so they will give us our hostages\". The prime minister said the move, which would cut off Rafah from Khan Younis, would give Israel control of a second axis in southern Gaza. That is in addition to the Philadelphi Corridor, running along the border with Egypt, which Israel sees as a key line stopping weapons being smuggled into Gaza. Earlier, Israel's defence minister Israel Katz said his country was beginning a major expansion of its military operation in the Strip and there would be a large-scale evacuation of the Palestinian population from fighting areas. Mr Katz said the operation would clear out militants and infrastructure \"and seize large areas that will be added to the security zones of the State of Israel\". It comes as a wave of Israeli strikes killed more than 40 Palestinians, including several women and children, according to Palestinian health officials. Israel controls a buffer zone along Gaza's whole border and recently ordered the full evacuation of Rafah. The expansion of Israel's military operation in Gaza deepens its renewed offensive. The ceasefire between Israel and Hamas that had begun in January ended in March as Israel launched various air strikes on targets across Gaza, and imposed a month-long halt to all imports of food, fuel and humanitarian aid. The deal had seen the release of dozens of hostages and hundreds of Palestinian prisoners, but collapsed before it could move to phase two, which would have involved the release of all hostages and the withdrawal of Israeli forces from Gaza. Middle East correspondent The statement by Israel's defence minister was clear on one thing: Israel intends to seize \"extensive\" areas of Gaza, perhaps permanently, to create an enlarged \"security area\" or buffer-zone. But it gave no further detail about which areas Israel intends to capture, although IDF forces are now moving into Rafah in the south of the strip. This might be a pressure tactic, a negotiating ploy or genuine intent â€“ we wonâ€™t know until meaningful negotiations begin again. The statement was met with anger from hostage families, who accused Katz of prioritising the capture of land over the fate of the remaining 59 hostages in Gaza. Katz has since tried to reassure them that the return of hostages is the priority. There is little sign that military pressure is working, though. Since breaking the ceasefire just over two weeks ago, Israeli forces have been steadily expanding operations and issuing new evacuation orders for parts of Gaza almost daily. They hope that this will not only force Hamas back to the negotiating table but secure a new truce and hostage release on Israel's terms. That is yet to happen. Hamas is sticking to its position â€“ an end to the war and a withdrawal of all IDF in return for the hostages. Israel does not agree to this. From conversations I've had with people in Gaza (international journalists are still being denied access by Israel) Hamas is putting up little fight against the IDF, although a small number of missiles have been fired into Israel. The move into Rafah will probably be much more straightforward this time now that the city is almost flattened and empty following months of heavy fighting previously. Once again Gazans are fleeing the fighting, carrying the little they can, and to humanitarian zones that have been repeatedly targeted by the IDF. Whether distracted by tariffs, the war in Ukraine or other matters, The White House's attention is not on Gaza â€“ that, and Trump's support for Israel, has given Netanyahu freedom to act. If the Israeli prime minister insists on annexing areas of Gaza for Israel's future security, all signs are that Washington will back him.  The Israel Defence Forces (IDF) had already issued evacuation warnings to Gazans living around Rafah and towards Khan Younis, telling them to move to the al Mawasi area on the shore, which was previously designated a humanitarian zone. Israeli forces have already set up a significant buffer zone within Gaza, having expanded an area around the edge of the territory that had existed before the war, as well as a large security area in the so-called Netzarim corridor through the middle of Gaza. This latest conflict began when Hamas launched an attack on Israel on 7 October 2023, killing around 1,200 people and taking around 250 hostages. The ensuing Israeli offensive has killed more than 50,000 Palestinians, according to Gaza's Hamas-run health ministry. It does not distinguish between civilians and combatants in its count, but has previously said more than half of those killed in the conflict were women and children.  Read more:Father demands protection after Gaza aid workers' deathsAnti-Hamas chants heard at rare protest in Gaza Aid group Doctors Without Borders warned on Wednesday that Israel's month-long siege of Gaza means some critical medications are now short in supply and are running out, leaving Palestinians at risk of losing vital healthcare. \"The Israeli authorities' have condemned the people of Gaza to unbearable suffering with their deadly siege,\" said Myriam Laaroussi, the group's emergency coordinator in Gaza. \"This deliberate infliction of harm on people is like a slow death; it must end immediately.\""
    },
    {
        "title": "A gruelling search for bodies in Sagaing, the city at the Myanmar earthquake's epicentre",
        "description": "In Sagaing, the epicentre of the earthquake in Myanmar, the scale of the loss is immense.",
        "url": "https://news.sky.com/story/a-gruelling-search-for-bodies-in-sagaing-the-city-at-the-myanmar-earthquakes-epicentre-13340576",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-myanmar-sagaing-earthquake-cordelia-lynch_6874044.jpg?20250402175459",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-04-02 16:18:00",
        "Headline": "Sagaing bore the brunt of the 7.7 magnitude earthquake and, five days on, people are digging out bodies from the rubble themselves in a city where Sky News found mass graves and the stench of death.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  In Sagaing, the epicentre of the earthquake in Myanmar, the scale of the loss is immense. There are mass graves and the stench of death is everywhere. The road into the city, as witnessed by our camera operator, offers an omen of the devastation that lies ahead - the bridge is torn apart. How quake left areas almost totally destroyed Outside the ruins of Gay Day Myaing Grocery store, a large crowd is watching as volunteer rescue workers, who have been there for hours, try to recover the body of 16-year-old May Poo Aung. The teenager was working inside when the earthquake hit. She'd only recently fled fighting further north, hoping Sagaing would be a place of safety. \n                  Emergency appeal launched for Myanmar as more than 2,800 killed in earthquake\n                 \n                  Families of those trapped in rubble of collapsed Bangkok building after earthquake face agonising wait\n                 \n                  Bangkok felt like a city caught off guard when chaos erupted with earthquake\n                 But, sadly, she could not survive the cruelty of Mother Nature. Local people are trying to offer dignity to the dead. Without heavy equipment, they have been digging out neighbours, friends, and family members from the rubble themselves.  It's gruelling work. Wai Yan Min Oo, a volunteer, is struggling with the horror of it all. \"Our rescue team is working hard to return the bodies of those who have died to their families. And after five days, it's very distressing to see the condition of the bodies. They're decomposing. And the smell is awful.\" So many young lives have been lost here, and every recovery is taking hours. Myat Private School is a pile of bricks. A brutal lesson in loss no one wants to attend. Six children are buried beneath, along with their teachers. Futures ripped away in moments. For days, the people of Sagaing have been waiting for help. However, international aid arriving in Myanmar is being tightly controlled. At first, much of it was sent to the capital Naypyidaw, delaying it reaching the places that needed it the most. Aid has long been weaponised in Myanmar, and even a natural disaster has not changed that dynamic. On Wednesday, the ruling military junta admitted to firing warning shots at an aid convoy in another area. In a rare move, the isolated nation asked for help - but now itâ€™s trying to control it. Areas like the Sagaing region, home to resistance forces, have not received the aid needed. Read more:Bodies 'still' in destroyed buildingsMilitary targeting 'civilian areas' after disaster The junta has continued to carry out airstrikes in parts of the country, although it has now finally agreed to a month-long ceasefire. But the situation on the ground is dire, and most of the buildings have been damaged or destroyed. More than 3,000 people are known to have died in Friday's 7.7 magnitude earthquake, and thousands more may have been killed in Sagaing alone."
    },
    {
        "title": "What Sky correspondents make of Trump's tariff announcement",
        "description": "Donald Trump has announced new tariffs which he is slapping on countries around the world on what he declared as \"Liberation Day\".",
        "url": "https://news.sky.com/story/what-sky-correspondents-make-of-trumps-tariff-announcement-13340784",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6874454.jpg?20250402225350",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-02 20:57:00",
        "Headline": "The president said there would be a 10% baseline tax on imports from all nations and higher tariff rates on dozens of America's biggest trading partners.",
        "Content": " Donald Trump has announced new tariffs which he is slapping on countries around the world on what he declared as \"Liberation Day\". The president said at the White House that there would be a 10% baseline tax on imports from all nations and higher rates on goods from dozens of countries that run trade surpluses with the US. Mr Trump held up a chart in the Rose Garden, showing the US would charge a 34% tax on imports from China, a 20% tax on imports from the EU, 25% on South Korea, 24% on Japan, and 32% on Taiwan. The UK seemed to get off more tightly, with a 10% tariff. Latest updates on Trump tariffs So what do Sky's correspondents think of the president's tariff announcement? :: David Blevins, Sky correspondent, in Washington DC \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 Donald Trump has left little ground for negotiation. By declaring a national emergency due to national security and economic concerns arising from the trade deficit, the president has given himself the power to regulate imports. He is regulating them by imposing a 10% baseline tariff on all countries exporting goods to the United States, and country-specific tariffs on the 60 \"worst offenders\". The UK has escaped that worst offenders list with a 10% tariff, but the EU has not - a tax of 20% now imposed on its products. But Trump stressed that those specific reciprocal tariffs are half what those \"worst offending\" countries charge the United States. The combination of declaring a national emergency and framing the president as \"lenient\" and \"kind\" limits the ability of those on the receiving end to negotiate. One senior White House source said: \"This is not a negotiation. It's a national emergency. \"And any country that thinks that they can simply make an announcement promising to lower some tariffs is ignoring the big, central problem of their massive non-tariff barriers and the institutionalisation in their trade model.\" :: Dan Whitehead, Sky correspondent, in Toronto, Canada For Canada - this is all about cars. Confirmation from President Trump that from Thursday, vehicles imported into the US will, as feared, be subject to a 25% tariff. It is a bitter blow to the car makers - mainly in Ontario - but such is the integration of the auto industry in North America that it is bad news too for the industry in the US. \"He will single-handedly shut down the American auto industry,\" claims Flavio Volpe, head of Canada's Automotive Parts Manufacturers Association. He told Sky News this tariff will lead to mass job losses among the 500,000 car workers in Canada within \"one week\". More than a million vehicles are exported from Canada to the US each year - an industry worth tens of billions of dollars. Even though there's not yet a specific tariff on auto parts, companies in Canada are already cutting staff and losing business; fewer car orders, fewer parts needed. Canada may not have been on the billboard of highest tariff countries, but they are left in limbo that things could get worse if it doesn't address what Trump sees as a \"massive\" amount of fentanyl coming across the border. Such is the turmoil between Canada and the US, that the new Canadian Prime Minister Mark Carney called a snap election for 28 April. The US-Canada relationship is \"no longer\" reliable, he says - just how these North American neighbours fix it will be front and centre when Canadians head to the polls.  :: Adam Parsons, Europe correspondent, in Brussels There will be a response from the European Union - the question is how soon, and how tough. A symbolic reprisal is one choice - putting tariffs on classic American products such as Harley-Davidson motorbikes or bottles of bourbon. That won't damage the European economy, but it won't make much of a difference, either. There's a reluctance to slap wide-ranging, indiscriminate tariffs simply because that would increase costs for many European manufacturers. So something more targeted may look appealing and that could mean going after the tech giants - Facebook, Apple, Google, Amazon, for example. Companies who have already had rows with EU regulators and are seen as being, to varying extents, close to the White House. If Europe could specifically target Tesla, it probably would. There are also those suggesting the EU should hold fire for the moment, confident that Trump's tariffs will backfire and keen that the effects are visible. One fear is that some of the cheap goods that were destined for US markets will now be diverted to Europe, flooding its market. Another fear is how the Windsor Framework will be affected, now that there are different US tariffs on either side of the Irish border. And finally there is that insult from the president, who called the European Union \"pathetic\". A few minutes later, a senior EU diplomat sent me a message saying \"the US is Brexiting the world, but you can't stop the march of folly\". Transatlantic relations are getting even icier."
    },
    {
        "title": "How have Trump's tariffs already affected China?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ</a>      ",
        "url": "https://news.sky.com/story/how-have-trumps-tariffs-already-affected-china-13340422",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-daily-020425-china-trump_6873776.jpg?20250402120550",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-02 10:55:00",
        "Headline": "No subtitle found",
        "Content": "ðŸ‘‰ Listen to Sky News Daily on your podcast app ðŸ‘ˆ  China's economy is already struggling. Growth has slowed dramatically in recent years and there is high youth employment. Since the beginning of March, there's also been a tax of 20% on any goods sold to the US. Ahead of President Trump's \"Liberation Day\", what effect are tariffs already having on the Chinese economy? Niall Paterson speaks to Sky's Asia correspondent Helen-Ann Smith, who has been to Guangdong province to find out how manufacturing is being impacted. They also discuss how the tariffs will play into President Xi's narrative of a resurgent global China."
    },
    {
        "title": "Virginia Giuffre: Prince Andrew accuser to face court for 'breaching restraining order' after claiming she had 'days to live'",
        "description": "The woman who reached an out-of-court settlement with Prince Andrew after accusing him of sexual assault is facing court over allegedly breaching a restraining order.",
        "url": "https://news.sky.com/story/virginia-giuffre-prince-andrew-accuser-to-face-court-for-breaching-restraining-order-after-claiming-she-had-days-to-live-13340311",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-02 07:59:00",
        "Headline": "Ms Giuffre, who is due to appear in court on 9 April, said in Instagram post this week that a car she was travelling in was hit by a school bus and she was given \"four days to live\".",
        "Content": "The woman who reached an out-of-court settlement with Prince Andrew after accusing him of sexual assault is facing court over allegedly breaching a restraining order. The court appearance will come after Virginia Giuffre said this week that she had been given \"four days to live\" after a car she was travelling in was hit by a school bus. Ms Giuffre, who lives in Australia, has been charged with breaching a family violence restraining order in Ocean Reef, near Perth, on 2 February, Western Australia (WA) Courts said. The case was first heard in Joondalup Magistrates' Court in northern Perth on 14 March, where she did not enter a plea, WA Courts said. The case is due back in court on 9 April. Ms Giuffre said in an Instagram post this week that a car she was travelling in was \"slowing for a turn\" when it was struck by a school bus travelling at 110kmph (68mph). The 41-year-old shared a photo of herself appearing to be badly bruised and lying in a hospital bed and wrote that she had \"gone into kidney renal failure\". \n                  Sam Jones: US influencer who snatched baby wombat from its mother leaves Australia amid fears for animal's health\n                 \n                  Australian PM Anthony Albanese hits out at baby wombat-snatching US influencer\n                 \n                  Former Australian Test cricketer Stuart MacGill found guilty of taking part in the supply of cocaine\n                 Police later said they received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles north of Perth, on 24 March. A spokesperson said the collision was reported by the bus driver the following day, and there were no reported injuries. In her Instagram post, mother-of-three Ms Giuffre had written: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time, but you know what they say about wishes. S**t in one hand and wish in the other & I guarantee it's still going to be s**t at the end of the day.\" According to reports, a spokesperson for Ms Giuffre said the Instagram post was a mistake and she had meant to share the post to her private Facebook page. A statement said: \"Virginia thanks everyone for the outpouring of love and support. She is overwhelmed with gratitude. \"Today she remains in [a] serious condition while receiving medical care. On 24 March, in rural Western Australia, a school bus hit the car in which she was riding.\" It said: \"Virginia was banged up and bruised and returned home. Virginia's condition worsened and she was admitted to the hospital.\" Read more from Sky News:Val Kilmer dies aged 65Inside the engine room of China's economyHeathrow bosses 'warned about substation' Ms Giuffre is reported to have separated from her husband. A previous Instagram post by Ms Giuffre on 22 March included the caption: \"My beautiful babies have no clue how much I love them and they're being poisoned with lies. I miss them so very much. I have been through hell & back in my 41 years but this is incredibly hurting me worse than anything else. Hurt me, abuse me but don't take my babies.\" Ms Giuffre is one of the most prominent accusers of paedophile financier Jeffrey Epstein. She sued Prince Andrew for allegedly sexually assaulting her when she was 17 after she was trafficked by paedophile financier Jeffrey Epstein. The duke has repeatedly denied the claims and has not been charged with any criminal offences. He paid millions to settle the case with Ms Giuffre, who he said he had never met."
    },
    {
        "title": "In the engine room of China's economy Trump's tariffs are already beginning to bite",
        "description": "If China is known as the world's factory, then the province of Guangdong is the engine room.",
        "url": "https://news.sky.com/story/in-the-engine-room-of-chinas-economy-trumps-tariffs-are-already-beginning-to-bite-13340224",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-guangzhou-garments_6873577.jpg?20250402081952",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-04-02 02:46:00",
        "Headline": "China's economy is already struggling. Growth has slowed dramatically in recent years, there is very high youth unemployment and a lot of low paid migrant workers.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  If China is known as the world's factory, then the province of Guangdong is the engine room. It is here, in the thousands of factories that dominate city suburbs where many of your consumer goods likely started their life, and it is here where Donald Trump's tariffs are hitting first. China has arguably been the top target in the US president's trade war. Not only was it subject to a suite of measures during his first term, but this time round it is the only country that has had no carve-outs, no delays and tariffs are levied on 100% of Chinese goods. As of 4 March anything from China sold to the US faces a tax of at least 20%, and for many goods it's more than that. Trump latest: White House says 'days of US being ripped off are over' Johnny Pan shows us the assembly line at his factory. This business has been in his family since the 90s and it makes appliances such as fans, air purifiers and air fryers. Lines of workers are assembling the more complex components by hand. A third of his products are currently sold to America. Tariffs have had an immediate impact; in just the last month they have seen a major drop off in orders amounting to millions of dollars. \"We have to seek out new markets to get away from the US,\" Mr Pan explains. \"We should be diving more into product development. But now we have to figure out ways to survive.\" He is actively looking to move some of his manufacturing abroad to avoid the tariffs. Read more from Sky News:More potential victims come forward after 'prolific' rapist jailedWhite House says 'days of US being ripped off are over'US prosecutors to seek death penalty for man accused of killing healthcare boss But the alleyways of this area are scattered with smaller operations with fewer options. Tiny workshops often specialise in just one element of a big process, small cogs in a supply chain they cannot control. Through one garage door there are three sewing machines whirring; this tiny operation specialises in attaching buttons to garments. The husband-and-wife team admit they're worried, incomes are lower, they explain, and it could have an impact on the thousands of contract workers who exist job to job. Many here don't have an option to raise their prices. If the American consumer isn't willing to pay more, the only option is to seek new markets, but if new markets don't provide such willing buyers, jobs and livelihoods are at stake. Indeed, this is China's key concern. A huge 20% of its GDP is exports, and a trade shock will have a major impact. And the economy is already struggling. Growth has slowed dramatically in recent years, there is very high youth unemployment and a lot of low-paid migrant workers. The fact Beijing's response thus far has been relatively restrained signals an awareness it can ill afford a major escalation. There is some solace in the fact China is a lot less exposed to the US than it once was - the trade war of 2016 means it already sends far fewer goods to America than it once did. But this is still a system that fears instability above all else and can't be seen to lose face. Many point to the broader context of two global superpowers that both crave dominance and are, in their own ways, trying to direct a shifting global order. Tariffs may just be one issue in a bigger global standoff. China might still be a mighty economy that can absorb some pain, but its leaders are unlikely to take things lying down."
    },
    {
        "title": "'No justification for this': World reacts to Trump's tariff announcement",
        "description": "World leaders and governments have begun reacting to Donald Trump's sweeping tariffs.",
        "url": "https://news.sky.com/story/no-justification-for-this-world-reacts-to-trumps-tariff-announcement-13340828",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-us_6874310.jpg?20250402213917",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-02 21:27:00",
        "Headline": "Irish Prime Minister Micheal Martin has said there is \"no justification\" for US tariffs, while Canadian Prime Minister Mark Carney said Canada will fight tariffs with countermeasures. Here's how world leaders have reacted.",
        "Content": " World leaders and governments have begun reacting to Donald Trump's sweeping tariffs. The president imposed a 10% baseline tariff on all imports - but many of America's biggest trading partners have been hit by a far higher rate Speaking at an event entitled 'Make America Wealthy Again', Mr Trump hit out at foreign \"cheaters\" and held a chart detailing who would pay what. Here is some of the latest reaction.  China, facing a 34% tax, urged the US to immediately cancel the move and said it would \"resolutely\" take countermeasures to safeguard its interests. \"Many trading partners have expressed strong dissatisfaction and clear opposition,\" said a commerce ministry statement. Irish Prime Minister Micheal Martin has said there is \"no justification\" for US tariffs. \"I deeply regret the US decision to impose 20% tariffs on imports from across the European Union,\" the taoiseach added. \"We see no justification for this. More than â‚¬4.2bn worth of goods and services are traded between the EU and the US daily. \"Disrupting this deeply integrated relationship benefits no one. Tariffs drive inflation, hurt people on both sides of the Atlantic, and put jobs at risk.\" Japan's trade minister, Yoji Muto, called the tariffs \"extremely regrettable\" and said all options were open. Asked if Japan would retaliate, he added: \"We need to decide what is best for Japan, and most effective, in a careful but bold and speedy manner.\" Read more:Trump's tariffs will have consequences - Ed ConwayUK reacts to Trump's tariffs Manfred Weber, the president of the largest party in the European Parliament, the EPP, said: \"To our American friends, today isn't liberation day - it's resentment day. Donald Trump's tariffs don't defend fair trade; they attack it out of fear and hurt both sides of the Atlantic. \"Europe stands united, ready to defend its interests, and open to fair, firm talks.\" Europe correspondent There will be a response from the European Union - the question is how soon, and how tough. A symbolic reprisal is one choice - putting tariffs on classic American products such as Harley-Davidson motorbikes or bottles of bourbon.  That wonâ€™t damage the European economy, but it wonâ€™t make much of a difference, either. Thereâ€™s a reluctance to slap wide-ranging, indiscriminate tariffs simply because that would increase costs for many European manufacturers.  So something more targeted may look appealing and that could mean going after the tech giants - Facebook, Apple, Google, Amazon, for example. Companies who have already had rows with EU regulators and are seen as being, to varying extents, close to the White House.  If Europe could specifically target Tesla, it probably would. There are also those suggesting the EU should hold fire for the moment, confident that Trumpâ€™s tariffs will backfire and keen that the effects are visible. One fear is that some of the cheap goods that were destined for US markets will now be diverted to Europe, flooding its market. Another fear is how the Windsor Framework will be affected, now that there are different US tariffs on either side of the Irish border. And finally there is that insult from the President, who called the European Union â€œpatheticâ€. A few minutes later, a senior EU diplomat sent me a message saying â€œthe US is Brexiting the world, but you canâ€™t stop the march of follyâ€. Transatlantic relations are getting even icier. Canadian Prime Minister Mark Carney said his country would fight tariffs with countermeasures. \"It's essential to act with purpose and with force, and that's what we will do,\" he told reporters ahead of a cabinet meeting to discuss Canada's response. Australian Prime Minister Anthony Albanese said: \"It is the American people who will pay the biggest price for these unjustified tariffs. \"This is why our government will not be seeking to impose reciprocal tariffs. We will not join a race to the bottom that leads to higher prices and slower growth.\" Italian Prime Minister Giorgia Meloni, seen as close ally of the US president, called the tariffs \"wrong\" and said they would not benefit the United States. \"We will do everything we can to work towards an agreement with the United States, with the goal of avoiding a trade war that would inevitably weaken the West in favour of other global players,\" she said. The Spanish Prime Minister Pedro Sanchez vowed to protect the country's companies and workers and to \"continue to be committed to an open world.\" His Swedish counterpart, Ulf Kristersson, said: \"We don't want growing trade barriers. \"We don't want a trade war. \"We want to find our way back to a path of trade and cooperation together with the US, so that people in our countries can enjoy a better life.\""
    },
    {
        "title": "Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics",
        "description": "For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.&#160;",
        "url": "https://news.sky.com/story/donald-trumps-tariffs-will-have-consequences-for-globalisation-the-us-economy-and-geopolitics-13340802",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-tariffs_6874380.jpg?20250402221634",
        "type": "US",
        "Author": "Ed Conway",
        "Date Published": "2025-04-02 21:24:00",
        "Headline": "Sweeping tariffs have been unleased by Donald Trump, with a flat 10% on all imports from the UK and much higher rates on China, the European Union, India, and Vietnam.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.Â  Trade was mostly free and getting freer, tariffs were getting lower and lower, and the world was becoming more, not less, globalised. But alongside those long-term trends, there were some serious consequences. Trump latest: US president announces sweeping global trade tariffs Mature, developed economies like the UK and US became ever more reliant on cheap imports from China and, in the process, saw their manufacturing sectors shrink. Large swathes of the rust belt in the US - and much of the Midlands and North of England - were hollowed out. And to some extent that's where the story of Donald Trump's \"Liberation Day\" really began - with the notion that free trade and globalisation had a darker side, a side he wants to remedy via tariffs. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 He imposed a set of tariffs in his first term, some on China, some on specific materials like steel and aluminium. But the height and the breadth of those tariffs were as nothing compared with the ones we have just heard about. Not since the 1930s has the US so radically increased the level of tariffs on all nations across the world. Back then, those tariffs exacerbated the Great Depression. It's anyone's guess as to what the consequences of these ones will be. But there will be consequences. Consequences for the nature of globalisation, consequences for the US economy (tariffs are exceptionally inflationary), consequences for geopolitics. And to some extent, merely knowing that little bit more about the White House's plans will deliver a bit of relief to financial markets, which have fretted for months about the imposition of tariffs. That uncertainty recently reached unprecedented levels. But don't for a moment assume that this saga is over. Nothing of the sort. In the coming days, we will learn more - more about the nuts and bolts of these policies, more about the retaliatory measures coming from other countries. We will, possibly, get more of a sense about whether some countries - including the UK - will enjoy reprieves from the tariffs. To paraphrase Churchill, this isn't the end of the trade war, or even the beginning of the end - perhaps just the end of the beginning."
    },
    {
        "title": "'A genius actor', 'firecracker', and 'my friend': Tributes paid to Top Gun star Val Kilmer",
        "description": "Actors, directors and celebrity friends have paid tribute to Val Kilmer, after he died aged 65.",
        "url": "https://news.sky.com/story/a-genius-actor-firecracker-and-my-friend-tributes-paid-to-top-gun-star-val-kilmer-13340666",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/image_6873522.jpg?20250402064256",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-02 19:29:00",
        "Headline": "Nicolas Cage, who co-starred with Val Kilmer in Bad Lieutenant, said the actor was a \"genius actor\".",
        "Content": " Actors, directors and celebrity friends have paid tribute to Val Kilmer, after he died aged 65. The California-born star of Top Gun, Batman and Heat died of pneumonia on Tuesday night in Los Angeles, his daughter Mercedes told the Associated Press. She said Kilmer was diagnosed with throat cancer in 2014 but later recovered. Tributes flooded in after reports broke of the actor's death, with No Country For Old Men star Josh Brolin among the first to share their memories.  He wrote on Instagram: \"See ya, pal. I'm going to miss you. You were a smart, challenging, brave, uber-creative firecracker. There's not a lot left of those. \"I hope to see you up there in the heavens when I eventually get there. Until then, amazing memories, lovely thoughts.\" Kyle Maclachlan, who co-starred with Kilmer in the 1991 biopic The Doors, wrote on social media: \"You'll always be my Jim. See you on the other side my friend.\" \n                  Film star Val Kilmer dies aged 65\n                 \n                  Watch: Val Kilmer in his most iconic roles, including Top Gun and Batman Forever\n                 \n                  Stalker who believed Strictly Come Dancing judge Shirley Ballas was his aunt avoids jail\n                 Michael Mann, who directed Kilmer in 1995's Heat, also paid tribute in a statement, saying: \"I always marvelled at the range, the brilliant variability within the powerful current of Val's possessing and expressing character. \"After so many years of Val battling disease and maintaining his spirit, this is tremendously sad news.\" Heat co-star Danny Trejo also called Kilmer \"a great actor, a wonderful person, and a dear friend of mine\" on Instagram. Cher, who once dated the actor, said on X that \"U Were Funny, crazy, pain in the ass, GREAT FRIEND... BRILLIANT as Mark Twain, BRAVE here during ur sickness\". Lifelong friend and director of Twixt, Francis Ford Coppola said: \"Val Kilmer was the most talented actor when in his High School, and that talent only grew greater throughout his life. \"He was a wonderful person to work with and a joy to know - I will always remember him.\" The Top Gun account on X also said it was remembering Kilmer, who starred as Iceman in both the 1986 original and 2022 sequel, and \"whose indelible cinematic mark spanned genres and generations\". Nicolas Cage added that \"I always liked Val and am sad to hear of his passing\". \"I thought he was a genius actor,\" he said. \"I enjoyed working with him on Bad Lieutenant and I admired his commitment and sense of humor. \"He should have won the Oscar for The Doors.\""
    },
    {
        "title": "Elon Musk calls reports he will step back from government role 'fake news'",
        "description": "Elon Musk has called reports that he will leave his government role in the coming months \"fake news\".",
        "url": "https://news.sky.com/story/elon-musk-to-step-back-from-government-role-in-coming-months-13340539",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-wisconsin_6871788.jpg?20250403003208",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-02 15:25:00",
        "Headline": "A senior White House official told NBC News that Donald Trump discussed Elon Musk transitioning back to the private sector at a cabinet meeting in March. ",
        "Content": "Elon Musk has called reports that he will leave his government role in the coming months \"fake news\". A senior White House official previously told NBC News, Sky's US partner network, that Donald Trump had discussed the Tesla and X boss transitioning back to the private sector at a cabinet meeting last month. After reports emerged of the meeting, White House press secretary Karoline Leavitt said it was \"garbage\" and added: \"Elon Musk and President Trump have both publicly stated that Elon will depart from public service as a special government employee when his incredible work at DOGE is complete.\" Mr Musk added in response on X: \"Yeah, fake news.\" NBC News reported that the official said Mr Musk would leave at the end of his 130 days as a special government employee. That would be 30 May, but it is unclear if the billionaire businessman will indeed leave on that date. Previously, the White House said that as a temporary organisation, the Department of Government Efficiency (DOGE) would be terminated on 4 July next year - the 250th anniversary of the US. \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 ðŸ‘‰ Follow Trump 100 on your podcast app ðŸ‘ˆ It comes days after Mr Musk said some members of his DOGE team were getting death threats on a daily basis. Mr Musk had drawn criticism over his efforts to downsize the US federal government.  In just weeks, entire agencies were dismantled, and tens of thousands of workers from the 2.3 million federal workforce have been fired or have agreed to leave their jobs. A number of lawsuits were filed in state and federal courts over cuts recommended by DOGE."
    },
    {
        "title": "What Sky correspondents make of Trump's tariff announcement",
        "description": "Donald Trump has announced new tariffs which he is slapping on countries around the world on what he declared as \"Liberation Day\".",
        "url": "https://news.sky.com/story/what-sky-correspondents-make-of-trumps-tariff-announcement-13340784",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-white-house_6874454.jpg?20250402225350",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-02 20:57:00",
        "Headline": "The president said there would be a 10% baseline tax on imports from all nations and higher tariff rates on dozens of America's biggest trading partners.",
        "Content": " Donald Trump has announced new tariffs which he is slapping on countries around the world on what he declared as \"Liberation Day\". The president said at the White House that there would be a 10% baseline tax on imports from all nations and higher rates on goods from dozens of countries that run trade surpluses with the US. Mr Trump held up a chart in the Rose Garden, showing the US would charge a 34% tax on imports from China, a 20% tax on imports from the EU, 25% on South Korea, 24% on Japan, and 32% on Taiwan. The UK seemed to get off more tightly, with a 10% tariff. Latest updates on Trump tariffs So what do Sky's correspondents think of the president's tariff announcement? :: David Blevins, Sky correspondent, in Washington DC \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 Donald Trump has left little ground for negotiation. By declaring a national emergency due to national security and economic concerns arising from the trade deficit, the president has given himself the power to regulate imports. He is regulating them by imposing a 10% baseline tariff on all countries exporting goods to the United States, and country-specific tariffs on the 60 \"worst offenders\". The UK has escaped that worst offenders list with a 10% tariff, but the EU has not - a tax of 20% now imposed on its products. But Trump stressed that those specific reciprocal tariffs are half what those \"worst offending\" countries charge the United States. The combination of declaring a national emergency and framing the president as \"lenient\" and \"kind\" limits the ability of those on the receiving end to negotiate. One senior White House source said: \"This is not a negotiation. It's a national emergency. \"And any country that thinks that they can simply make an announcement promising to lower some tariffs is ignoring the big, central problem of their massive non-tariff barriers and the institutionalisation in their trade model.\" :: Dan Whitehead, Sky correspondent, in Toronto, Canada For Canada - this is all about cars. Confirmation from President Trump that from Thursday, vehicles imported into the US will, as feared, be subject to a 25% tariff. It is a bitter blow to the car makers - mainly in Ontario - but such is the integration of the auto industry in North America that it is bad news too for the industry in the US. \"He will single-handedly shut down the American auto industry,\" claims Flavio Volpe, head of Canada's Automotive Parts Manufacturers Association. He told Sky News this tariff will lead to mass job losses among the 500,000 car workers in Canada within \"one week\". More than a million vehicles are exported from Canada to the US each year - an industry worth tens of billions of dollars. Even though there's not yet a specific tariff on auto parts, companies in Canada are already cutting staff and losing business; fewer car orders, fewer parts needed. Canada may not have been on the billboard of highest tariff countries, but they are left in limbo that things could get worse if it doesn't address what Trump sees as a \"massive\" amount of fentanyl coming across the border. Such is the turmoil between Canada and the US, that the new Canadian Prime Minister Mark Carney called a snap election for 28 April. The US-Canada relationship is \"no longer\" reliable, he says - just how these North American neighbours fix it will be front and centre when Canadians head to the polls.  :: Adam Parsons, Europe correspondent, in Brussels There will be a response from the European Union - the question is how soon, and how tough. A symbolic reprisal is one choice - putting tariffs on classic American products such as Harley-Davidson motorbikes or bottles of bourbon. That won't damage the European economy, but it won't make much of a difference, either. There's a reluctance to slap wide-ranging, indiscriminate tariffs simply because that would increase costs for many European manufacturers. So something more targeted may look appealing and that could mean going after the tech giants - Facebook, Apple, Google, Amazon, for example. Companies who have already had rows with EU regulators and are seen as being, to varying extents, close to the White House. If Europe could specifically target Tesla, it probably would. There are also those suggesting the EU should hold fire for the moment, confident that Trump's tariffs will backfire and keen that the effects are visible. One fear is that some of the cheap goods that were destined for US markets will now be diverted to Europe, flooding its market. Another fear is how the Windsor Framework will be affected, now that there are different US tariffs on either side of the Irish border. And finally there is that insult from the president, who called the European Union \"pathetic\". A few minutes later, a senior EU diplomat sent me a message saying \"the US is Brexiting the world, but you can't stop the march of folly\". Transatlantic relations are getting even icier."
    },
    {
        "title": "Liberal judge Susan Crawford defeats Musk-backed challenger in Wisconsin Supreme Court race",
        "description": "A liberal judge has won a race for a seat on the Wisconsin Supreme Court after defeating a challenger endorsed by President Donald Trump and billionaire Elon Musk.",
        "url": "https://news.sky.com/story/liberal-judge-wins-wisconsin-supreme-court-race-after-defeating-musk-backed-challenger-13340343",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-crawford-wisconsin_6873670.jpg?20250402100818",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-02 08:44:00",
        "Headline": "Judge Susan Crawford said she \"never could have imagined that I would be taking on the richest man in the world for justice in Wisconsin\".",
        "Content": "A liberal judge has won a race for a seat on the Wisconsin Supreme Court after defeating a challenger endorsed by President Donald Trump and billionaire Elon Musk. Susan Crawford labelled her victory a win against powerful interests after a contest that the Democrats had framed as a referendum on the president and Tesla boss Musk, who is leading the government's cost-cutting Department of Government Efficiency (DOGE). Her win also cements a liberal majority for at least three more years on the highest court in Wisconsin, a swing state. Judge Crawford has led legal fights to protect union power and abortion rights and to oppose voter ID. \"Growing up in Chippewa Falls, I never could have imagined that I would be taking on the richest man in the world [Musk] for justice in Wisconsin,\" she said as she celebrated her victory. \"And we won.\" Mr Musk, and groups he backs, spent more than $21m (Â£16.2m) in a bid to unseat her, with the DOGE boss even flying to Wisconsin to personally hand over $1m (Â£770,000) cheques to two voters.  \"Today Wisconsinites fended off an unprecedented attack on our democracy, our fair elections and our Supreme Court,\" Judge Crawford said. \"And Wisconsin stood up and said loudly that justice does not have a price, our courts are not for sale.\" Read more:Democrat's speech against Trump breaks recordProsecutors directed to seek death penalty for Luigi Mangione The race was the most expensive in US judicial history and had the highest turnout for a Wisconsin Supreme Court election ever - as many saw it as a proxy fight for the nation's political battles. Judge Crawford defeated Republican-backed Brad Schimel, a former state attorney general. When he told his supporters he had conceded to Judge Crawford, one woman began to chant: \"Cheater, cheater!\" \"No,\" Mr Schimel said. \"You've got to accept the results.\""
    },
    {
        "title": "Virginia Giuffre: Prince Andrew accuser to face court for 'breaching restraining order' after claiming she had 'days to live'",
        "description": "The woman who reached an out-of-court settlement with Prince Andrew after accusing him of sexual assault is facing court over allegedly breaching a restraining order.",
        "url": "https://news.sky.com/story/virginia-giuffre-prince-andrew-accuser-to-face-court-for-breaching-restraining-order-after-claiming-she-had-days-to-live-13340311",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-virginia-roberts-virginia-giuffre_6872295.jpg?20250331161308",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-02 07:59:00",
        "Headline": "Ms Giuffre, who is due to appear in court on 9 April, said in Instagram post this week that a car she was travelling in was hit by a school bus and she was given \"four days to live\".",
        "Content": "The woman who reached an out-of-court settlement with Prince Andrew after accusing him of sexual assault is facing court over allegedly breaching a restraining order. The court appearance will come after Virginia Giuffre said this week that she had been given \"four days to live\" after a car she was travelling in was hit by a school bus. Ms Giuffre, who lives in Australia, has been charged with breaching a family violence restraining order in Ocean Reef, near Perth, on 2 February, Western Australia (WA) Courts said. The case was first heard in Joondalup Magistrates' Court in northern Perth on 14 March, where she did not enter a plea, WA Courts said. The case is due back in court on 9 April. Ms Giuffre said in an Instagram post this week that a car she was travelling in was \"slowing for a turn\" when it was struck by a school bus travelling at 110kmph (68mph). The 41-year-old shared a photo of herself appearing to be badly bruised and lying in a hospital bed and wrote that she had \"gone into kidney renal failure\". \n                  Sam Jones: US influencer who snatched baby wombat from its mother leaves Australia amid fears for animal's health\n                 \n                  Australian PM Anthony Albanese hits out at baby wombat-snatching US influencer\n                 \n                  Former Australian Test cricketer Stuart MacGill found guilty of taking part in the supply of cocaine\n                 Police later said they received a report of a \"minor crash\" between a school bus and a car in Neergabby, about 12 miles north of Perth, on 24 March. A spokesperson said the collision was reported by the bus driver the following day, and there were no reported injuries. In her Instagram post, mother-of-three Ms Giuffre had written: \"I've gone into kidney renal failure, they've given me four days to live, transferring me to a specialist hospital in urology. \"I'm ready to go, just not until I see my babies one last time, but you know what they say about wishes. S**t in one hand and wish in the other & I guarantee it's still going to be s**t at the end of the day.\" According to reports, a spokesperson for Ms Giuffre said the Instagram post was a mistake and she had meant to share the post to her private Facebook page. A statement said: \"Virginia thanks everyone for the outpouring of love and support. She is overwhelmed with gratitude. \"Today she remains in [a] serious condition while receiving medical care. On 24 March, in rural Western Australia, a school bus hit the car in which she was riding.\" It said: \"Virginia was banged up and bruised and returned home. Virginia's condition worsened and she was admitted to the hospital.\" Read more from Sky News:Val Kilmer dies aged 65Inside the engine room of China's economyHeathrow bosses 'warned about substation' Ms Giuffre is reported to have separated from her husband. A previous Instagram post by Ms Giuffre on 22 March included the caption: \"My beautiful babies have no clue how much I love them and they're being poisoned with lies. I miss them so very much. I have been through hell & back in my 41 years but this is incredibly hurting me worse than anything else. Hurt me, abuse me but don't take my babies.\" Ms Giuffre is one of the most prominent accusers of paedophile financier Jeffrey Epstein. She sued Prince Andrew for allegedly sexually assaulting her when she was 17 after she was trafficked by paedophile financier Jeffrey Epstein. The duke has repeatedly denied the claims and has not been charged with any criminal offences. He paid millions to settle the case with Ms Giuffre, who he said he had never met."
    },
    {
        "title": "Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics",
        "description": "For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.&#160;",
        "url": "https://news.sky.com/story/donald-trumps-tariffs-will-have-consequences-for-globalisation-the-us-economy-and-geopolitics-13340802",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-tariffs_6874380.jpg?20250402221634",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-04-02 21:24:00",
        "Headline": "Sweeping tariffs have been unleased by Donald Trump, with a flat 10% on all imports from the UK and much higher rates on China, the European Union, India, and Vietnam.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.Â  Trade was mostly free and getting freer, tariffs were getting lower and lower, and the world was becoming more, not less, globalised. But alongside those long-term trends, there were some serious consequences. Trump latest: US president announces sweeping global trade tariffs Mature, developed economies like the UK and US became ever more reliant on cheap imports from China and, in the process, saw their manufacturing sectors shrink. Large swathes of the rust belt in the US - and much of the Midlands and North of England - were hollowed out. And to some extent that's where the story of Donald Trump's \"Liberation Day\" really began - with the notion that free trade and globalisation had a darker side, a side he wants to remedy via tariffs. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 He imposed a set of tariffs in his first term, some on China, some on specific materials like steel and aluminium. But the height and the breadth of those tariffs were as nothing compared with the ones we have just heard about. Not since the 1930s has the US so radically increased the level of tariffs on all nations across the world. Back then, those tariffs exacerbated the Great Depression. It's anyone's guess as to what the consequences of these ones will be. But there will be consequences. Consequences for the nature of globalisation, consequences for the US economy (tariffs are exceptionally inflationary), consequences for geopolitics. And to some extent, merely knowing that little bit more about the White House's plans will deliver a bit of relief to financial markets, which have fretted for months about the imposition of tariffs. That uncertainty recently reached unprecedented levels. But don't for a moment assume that this saga is over. Nothing of the sort. In the coming days, we will learn more - more about the nuts and bolts of these policies, more about the retaliatory measures coming from other countries. We will, possibly, get more of a sense about whether some countries - including the UK - will enjoy reprieves from the tariffs. To paraphrase Churchill, this isn't the end of the trade war, or even the beginning of the end - perhaps just the end of the beginning."
    },
    {
        "title": "Heathrow bosses were warned about power supply after stolen cables turned off runway lights, MPs told",
        "description": "Heathrow bosses were warned its power supply was vulnerable less than a week before the major outage in March, a committee of MPs has heard.",
        "url": "https://news.sky.com/story/heathrow-bosses-warned-about-substation-days-before-major-power-outage-mp-committee-hears-13340317",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-heathrow-airport-fire_6864202.jpg?20250322155749",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-02 08:20:00",
        "Headline": "The head of a body representing more than 90 airlines using Heathrow says the airport could have had some flights moving by mid-morning, rather than being shut for a day, following the substation fire in March.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Heathrow bosses were warned its power supply was vulnerable less than a week before the major outage in March, a committee of MPs has heard. A terminal at the airport could also have had some flights moving by mid-morning rather than being shut for a day, the committee was told. Nigel Wicking, the chief executive of Heathrow Airline Operators' Committee, told MPs of the Transport Committee he raised issues about resilience on 15 March after cable and wiring theft took out lights on a runway. Mr Wicking said he believed Heathrow's Terminal 5 could have been ready to receive repatriation flights by \"late morning\" on the day of the closure, as \"there was opportunity also to get flights out\". A fire at an electricity substation in west London meant the power supply was disrupted to Europe's largest airport for a day on 21 March - causing travel chaos for nearly 300,000 passengers, the committee heard. Mr Wicking, the head of a body representing more than 90 airlines using Heathrow Airport, told MPs: \"I'd actually warned Heathrow of concerns that we had with regard to the substations and my concern was resilience.\" He said he spoke to the Team Heathrow director on March 15 about his power concerns, and the chief operating officer and chief customer officer on March 19. Mr Wicking added: \"It was following a number of, a couple of incidents of, unfortunately, theft, of wire and cable around some of the power supply that on one of those occasions, took out the lights on the runway for a period of time. That obviously made me concerned.\" The desire for information on the outage and closure was so large that a Teams call on the day of the closure was \"maxed out\" with \"a thousand participants\", Mr Wicking added. Read more:Airlines threaten Heathrow with legal actionNational Grid boss claims Heathrow had 'enough power'Weddings, rugby tours and Arctic Circle trips affected by shutdown However, Heathrow chief executive Thomas Woldbye said keeping the airport open during last month's power outage would have been \"disastrous\". There was a risk of having \"literally tens of thousands of people stranded in the airport, where we have nowhere to put them\", Mr Woldbye told MPs. Fire surveillance and CCTV systems were down as a result of having limited electricity, he added, meaning it would not have been safe to reopen. 'Most expensive airport in the world' Heathrow should have top quality infrastructure and service, Mr Wicking told MPs. \"It is the most expensive airport in the world with regard to passenger challenges,\" he said. \"So from our perspective, that means we should actually have the best service. We should have the best infrastructure.\" A review on resilience at Heathrow was done in 2018, according to Mr Wicking who said he was told it was \"not for sharing\" with airlines. He added that he had told Mr Woldbye: \"I think it is for sharing now because frankly, we're paying enough. \"I don't feel that we should be paying more attention for further resilience. The resilience should have been there in the first place.\" News correspondent There was clear tension between airlines and Heathrow Airport but little clarity on much else. Nobody took sole responsibility for the 21 March outage at Heathrow, and broader questions ultimately went unanswered despite a grilling. Among them, what can be done to prevent this from happening again, and what is next for the airport in terms of resilience? Also, who will be responsible for compensation? Thomas Woldbye, Heathrow chief executive, said to give the airport \"full resilience\" it would cost more than Â£1bn, and airlines would have to help foot the bill. Airlines argued back that they already pay enough for \"the world's most expensive airport\", and that the resilience \"should have been there in the first place\". What about liability too? That's also not been decided yet.  Mr Woldbye said discussions would happen when the facts were known, including why the fire started. The airlines are also reluctant to pay, stating it was \"not fair\" for them to have to fork out for a situation they didn't cause. The fact that concerns had been raised about Heathrow's power supply days before the \"unprecedented\" event may feature heavily in any argument moving forward. They'll all be waiting for the (at least) three reviews currently under way before, no doubt, the blaming and finger-pointing will begin once again behind closed doors. Uncertainty about Heathrow's foundation When asked if Heathrow is a problematic airport, Mr Wicking said: \"We've got to look at this with regard to future growth and expansion, investment, et cetera. \"We're not sure about the foundations of Heathrow as it stands at the moment; there have been a series of events such as this. \"We've had outages during last year where we had 82 baggage system issues... thousands of bags misconnecting and... it's the most expensive airport in the world for passenger charges\"."
    },
    {
        "title": "Elon Musk calls reports he will step back from government role 'fake news'",
        "description": "Elon Musk has called reports that he will leave his government role in the coming months \"fake news\".",
        "url": "https://news.sky.com/story/elon-musk-to-step-back-from-government-role-in-coming-months-13340539",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-elon-musk-wisconsin_6871788.jpg?20250403003208",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-02 15:25:00",
        "Headline": "A senior White House official told NBC News that Donald Trump discussed Elon Musk transitioning back to the private sector at a cabinet meeting in March. ",
        "Content": "Elon Musk has called reports that he will leave his government role in the coming months \"fake news\". A senior White House official previously told NBC News, Sky's US partner network, that Donald Trump had discussed the Tesla and X boss transitioning back to the private sector at a cabinet meeting last month. After reports emerged of the meeting, White House press secretary Karoline Leavitt said it was \"garbage\" and added: \"Elon Musk and President Trump have both publicly stated that Elon will depart from public service as a special government employee when his incredible work at DOGE is complete.\" Mr Musk added in response on X: \"Yeah, fake news.\" NBC News reported that the official said Mr Musk would leave at the end of his 130 days as a special government employee. That would be 30 May, but it is unclear if the billionaire businessman will indeed leave on that date. Previously, the White House said that as a temporary organisation, the Department of Government Efficiency (DOGE) would be terminated on 4 July next year - the 250th anniversary of the US. \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 ðŸ‘‰ Follow Trump 100 on your podcast app ðŸ‘ˆ It comes days after Mr Musk said some members of his DOGE team were getting death threats on a daily basis. Mr Musk had drawn criticism over his efforts to downsize the US federal government.  In just weeks, entire agencies were dismantled, and tens of thousands of workers from the 2.3 million federal workforce have been fired or have agreed to leave their jobs. A number of lawsuits were filed in state and federal courts over cuts recommended by DOGE."
    },
    {
        "title": "New Look fashions Â£30m cash call to fund digital growth plan",
        "description": "The owners of New Look, the high street fashion chain, are ploughing &#163;30m of fresh equity into the business as they seek to accelerate its digital transformation.",
        "url": "https://news.sky.com/story/new-look-fashions-16330m-cash-call-to-fund-digital-growth-plan-13340614",
        "image_url": "https://e3.365dm.com/17/08/1920x1080/f0176f90ec1f7eb411bf7220a366cf07cc3b0b22e1f6eea38aa36d161d6b39c2_4068705.jpg?20170808123554",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-02 17:53:00",
        "Headline": "Alcentra and Brait, which have owned New Look since 2020, are committing new funding to help it capture a bigger chunk of the UK's womenswear market, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of New Look, the high street fashion chain, are ploughing Â£30m of fresh equity into the business as they seek to accelerate its digital transformation. Sky News has learnt that the clothing retailer will announce this week that its shareholders - Alcentra and Brait - have provided the funding as they seek to capture a bigger slice of Britain's Â£4.3bn womenswear market. Insiders said the funding would be announced in a statement on Thursday. New Look operates approximately 340 stores and employs about 10,000 people across the UK. Money latest: Almost all foreign visitors must now pay to enter UK It is the country's second-largest womenswear retailer in the crucial 18-to-44 year-old age group, and has been owned by its current shareholders since October 2020. The new capital from Alcentra and Brait will be earmarked to optimise customers' online experience by investing heavily in New Look's technology and systems. \n                  Donald Trump announces sweeping global trade tariffs - including 10% on UK imports\n                 \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  Heathrow bosses were warned about power supply after stolen cables turned off runway lights, MPs told\n                 Last year, the chain reported sales of Â£769m, with an improvement in gross margins and a statutory loss before tax of Â£21.7m - down from Â£88m the previous year. Like most high street retailers, it endured a torrid COVID-19 and engaged in a formal financial restructuring through a company voluntary arrangement. In the autumn of 2023, it completed a Â£100m refinancing deal with Blazehill Capital and Wells Fargo. Responding to an enquiry from Sky News, New Look chief executive Helen Connolly said: \"Our goal is to be the number one online destination for feel-good fashion, powered by our loyal customer base and proven digital model. \"This new capital injection means we can ramp up our digital operations, enhance customer service, and drive growth and achieve our goal of Â£1bn online demand by 2030. \"It will allow us to get even closer to our growing customer base, giving them more of what they want: trend-led, high-quality fashion and a seamless shopping experience.\""
    },
    {
        "title": "Stokes-backed travel platform Unravel takes off with Â£5m funding",
        "description": "An online travel content platform backed by a fund which counts the England Test cricket captain Ben Stokes among its investors will this week unveil a $7m (&#163;5.4m) funding injection.",
        "url": "https://news.sky.com/story/stokes-backed-travel-platform-unravel-takes-off-with-1635m-funding-13340357",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ben-stokes-england_6873729.jpg?20250402110858",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-02 09:00:00",
        "Headline": "The Players Fund, which counts cricketer Ben Stokes as an investor, is among the backers of a $7m funding round to be announced this week by Unravel, a London-based start-up, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An online travel content platform backed by a fund which counts the England Test cricket captain Ben Stokes among its investors will this week unveil a $7m (Â£5.4m) funding injection. Sky News understands that Unravel, which combines TikTok-style video content with an artificial intelligence-powered booking assistant to enhance users' experience, will announce the Series A round on Thursday. Led by Nauta, a European business-to-business software investor, it includes participation from Slingshot Ventures, which is partly financed by Kees Koolen, the former chairman and CEO of Booking.com. Unravel partners with travel influencers to identify distinctive overseas experiences, and says it facilitates transactions within banking apps, airline loyalty programmes and digital marketplaces. \"The way people discover travel has changed,\" Vijay Anand, CEO and co-founder of Unravel, said. \"They don't sift through endless search results - they get inspired by creators who are exploring the world and sharing their experiences. \"Unravel bridges that gap, turning creator-shot videos into seamless, AI-powered booking experiences.\" Other investors in the round include Antler, Brook Bay Capital and The Players Fund, whose other backers include the Indian cricketer KL Rahul and Dame Jessica Ennis-Hill, the British Olympic heptathlon champion. Read more from Sky News:Boohoo's Debenhams renaming at risk amid Ashley rowFormer parliamentary watchdog pitches for football regulator job OIivier Bisserier, another senior former Booking.com executive, is also investing in Unravel, according to the company. \"The rise of TikTok has had a massive influence on the way people experience content on mobile,\" said Carles Ferrer, a general partner at Nauta. \"That change has happened in parallel with banks, insurers and telcos adding travel to their list of perks or products offered to customers. \"Unravel has combined both of these market changes, with the addition of an AI booking assistant, to produce an incredibly popular white-label solution for customers looking to add new revenue streams.\" The company said the new capital would be used to enhance its AI capabilities to optimize video-commerce conversions and expand its London-based workforce. Nauta's investment portfolio has included companies such as Brandwatch, Techspert and AppFollow."
    },
    {
        "title": "In the engine room of China's economy Trump's tariffs are already beginning to bite",
        "description": "If China is known as the world's factory, then the province of Guangdong is the engine room.",
        "url": "https://news.sky.com/story/in-the-engine-room-of-chinas-economy-trumps-tariffs-are-already-beginning-to-bite-13340224",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-guangzhou-garments_6873577.jpg?20250402081952",
        "type": "Business",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-04-02 02:46:00",
        "Headline": "China's economy is already struggling. Growth has slowed dramatically in recent years, there is very high youth unemployment and a lot of low paid migrant workers.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  If China is known as the world's factory, then the province of Guangdong is the engine room. It is here, in the thousands of factories that dominate city suburbs where many of your consumer goods likely started their life, and it is here where Donald Trump's tariffs are hitting first. China has arguably been the top target in the US president's trade war. Not only was it subject to a suite of measures during his first term, but this time round it is the only country that has had no carve-outs, no delays and tariffs are levied on 100% of Chinese goods. As of 4 March anything from China sold to the US faces a tax of at least 20%, and for many goods it's more than that. Trump latest: White House says 'days of US being ripped off are over' Johnny Pan shows us the assembly line at his factory. This business has been in his family since the 90s and it makes appliances such as fans, air purifiers and air fryers. Lines of workers are assembling the more complex components by hand. A third of his products are currently sold to America. Tariffs have had an immediate impact; in just the last month they have seen a major drop off in orders amounting to millions of dollars. \"We have to seek out new markets to get away from the US,\" Mr Pan explains. \"We should be diving more into product development. But now we have to figure out ways to survive.\" He is actively looking to move some of his manufacturing abroad to avoid the tariffs. Read more from Sky News:More potential victims come forward after 'prolific' rapist jailedWhite House says 'days of US being ripped off are over'US prosecutors to seek death penalty for man accused of killing healthcare boss But the alleyways of this area are scattered with smaller operations with fewer options. Tiny workshops often specialise in just one element of a big process, small cogs in a supply chain they cannot control. Through one garage door there are three sewing machines whirring; this tiny operation specialises in attaching buttons to garments. The husband-and-wife team admit they're worried, incomes are lower, they explain, and it could have an impact on the thousands of contract workers who exist job to job. Many here don't have an option to raise their prices. If the American consumer isn't willing to pay more, the only option is to seek new markets, but if new markets don't provide such willing buyers, jobs and livelihoods are at stake. Indeed, this is China's key concern. A huge 20% of its GDP is exports, and a trade shock will have a major impact. And the economy is already struggling. Growth has slowed dramatically in recent years, there is very high youth unemployment and a lot of low-paid migrant workers. The fact Beijing's response thus far has been relatively restrained signals an awareness it can ill afford a major escalation. There is some solace in the fact China is a lot less exposed to the US than it once was - the trade war of 2016 means it already sends far fewer goods to America than it once did. But this is still a system that fears instability above all else and can't be seen to lose face. Many point to the broader context of two global superpowers that both crave dominance and are, in their own ways, trying to direct a shifting global order. Tariffs may just be one issue in a bigger global standoff. China might still be a mighty economy that can absorb some pain, but its leaders are unlikely to take things lying down."
    },
    {
        "title": "Buyout barons in battle to extract Â£800m dentistry giant",
        "description": "A pack of private equity firms are battling to win control of MyDentist, the UK's biggest provider of NHS dental services.",
        "url": "https://news.sky.com/story/buyout-barons-in-battle-to-extract-163800m-dentistry-giant-13340410",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-teeth-dentist_6827936.jpg?20250214072232",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-02 10:43:00",
        "Headline": "Bridgepoint, Cinven, TDR Capital and Triton Partners are among the private equity firms circling Britain's biggest provider of NHS dental services, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A pack of private equity firms are battling to win control of MyDentist, the UK's biggest provider of NHS dental services. Sky News has learnt that Bridgepoint, Cinven and Triton Partners are among the parties which have submitted indicative offers for the business. TDR Capital, the owner of supermarket chain Asda, has also been participating in the sale process, banking sources said on Wednesday. Money latest: The scams most likely to catch each age group MyDentist's owners hope to attract a price tag of approximately Â£900m for the company, although any deal may value it at closer to Â£800m, according to insiders. A subsidiary of Integrated Dental Holdings, MyDentist operates from about 600 practices across the UK, and has been owned by Palamon Capital Partners since 2021. The company was previously owned by Carlyle, another major global private equity investor. \n                  Donald Trump announces sweeping global trade tariffs - including 10% on UK imports\n                 \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  Heathrow bosses were warned about power supply after stolen cables turned off runway lights, MPs told\n                 The auction of MyDentist is being handled by bankers at Morgan Stanley. Read more from Sky News:Trump's 'liberation day' explainedStokes-backed travel platform takes off with Â£5m funding It is taking place during a renewed period of scrutiny about the accessibility of NHS dental services across Britain. HIG Europe, another private equity firm, also bid for MyDentist, although it was unclear whether it remained in the auction. None of the parties contacted by Sky News would comment."
    },
    {
        "title": "'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'",
        "description": "The US is \"our closest ally\" but \"nothing is off the table\" in response to Donald Trump's 10% tariffs on imports from the UK, the business secretary has said.",
        "url": "https://news.sky.com/story/us-is-our-closest-ally-says-uk-minister-reacting-to-trump-tariffs-but-nothing-off-the-table-13340795",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jonathan-reynolds-business-secretary_6874430.jpg?20250402224419",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-04-02 21:13:00",
        "Headline": "The business secretary said the government will continue to negotiate an economic deal with the US to \"mitigate the impact\" of US trade tariffs.",
        "Content": "\n          Political reporter\n              @realBenBloch\n  The US is \"our closest ally\" but \"nothing is off the table\" in response to Donald Trump's 10% tariffs on imports from the UK, the business secretary has said. In a statement following the US president's nearly hour-long address to the world, Business and Trade Secretary Jonathan Reynolds said: \"We will always act in the best interests of UK businesses and consumers. \"That's why, throughout the last few weeks, the government has been fully focused on negotiating an economic deal with the United States that strengthens our existing fair and balanced trading relationship.\" Follow the latest following Trump's tariffs announcement Mr Reynolds reiterated the statements from the prime minister and his cabinet over the past few days, saying the US is \"our closest ally\", and the government's approach is to \"remain calm and committed to doing this deal, which we hope will mitigate the impact of what has been announced today\". But he continued: \"We have a range of tools at our disposal, and we will not hesitate to act. We will continue to engage with UK businesses, including on their assessment of the impact of any further steps we take. \"Nobody wants a trade war, and our intention remains to secure a deal. But nothing is off the table, and the government will do everything necessary to defend the UK's national interest.\" \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 'Get back round the negotiating table', say Tories The Conservative Party's shadow business and trade secretary described the US president's announcement as \"disappointing news which will worry working families across the country\".  Andrew Griffith hit out at the government for having \"failed to negotiate with President Trump's team for too many months after the election, failed to keep our experienced top trade negotiator, and failed to get a deal to avoid the imposition of these tariffs by our closest trading partner\". \"The chancellor's emergency budget of just a week ago with its inadequate headroom is now at risk, casting uncertainty about more taxes or spending cuts,\" he continued. \"Sadly, it is British businesses and workers who will pay the price for Labour's failure.\" He called on ministers to \"swallow their pride\" and \"get back round the negotiating table to agree a fair deal to protect jobs and consumers in both the UK and the US alike\". Political editor It has been quite a rollercoaster for the government, where they went from the hope that they could avoid tariffs, that they could get that economic deal, to the realisation that was not going to happen, and then the anticipation of how hard would the UK be hit. In Westminster tonight, there is actual relief because the UK is going to have a 10% baseline tariff - but that is the least onerous of all the tariffs we saw President Trump announce.\n He held up a chart of the worst offenders, and the UK was well at the bottom of that list. No 10 sources were telling me as President Trump was in the Rose Garden that while no tariffs are good, and it's not what they want, the fact the UK has tariffs that are lower than others vindicates their approach. They say it's important because the difference between a 20% tariff and a 10% tariff is thousands of jobs. Where to next? No 10 says it will \"keep negotiating, keep cool and calm\", and reiterated Sir Keir Starmer's desire to \"negotiate a sustainable trade deal\". \"Of course want to get tariffs lowered. Tomorrow we will continue with that work,\" a source added. Another source said the 10% tariff shows that \"the UK is in the friendlies club, as much as that is worth anything\". Overnight, people will be number-crunching, trying to work out what it means for the UK. There is a 25% tariff on cars which could hit billions in UK exports, in addition to the blanket 10% tariff. But despite this being lower than many other countries, GDP will take a hit, with forecasts being downgraded probably as we speak. I think the government's approach will be to not retaliate and try to speed up that economic deal in the hope that they can lower the tariffs even further. There will be concessions. For example, the UK could lower the Digital Services Tax, which is imposed on the UK profits of tech giants. Will they loosen regulation on social media companies or agricultural products? But for now, there is relief the UK has not been hit as hard as many others. Liberal Democrat leader Sir Ed Davey has reacted furiously to Mr Trump's announcement of a \"destructive trade war\", and called on the government to stand up against \"Trump's attempts to divide and rule\". \"The prime minister should bring our Commonwealth and European partners together in a coalition of the willing against Trump's tariffs, using retaliatory tariffs where necessary and signing new trade deals with each other where possible.\" Speaking on Wednesday evening at a White House event entitled 'Make America Wealthy Again', the US president unleashed sweeping tariffs across the globe. Mr Trump held up a chart detailing the worst offenders - which also showed the new tariffs the US would be imposing. The UK's rate of 10% was perhaps a shot across the bow over the 20% VAT rate, though the president's suggested a 10% tariff imbalance between the two nations. Nonetheless, tariffs of 10% could directly reduce UK GDP by between 0.01% and 0.06%, according to Capital Economics. A 25% duty on all car imports from around the world is also being imposed from midnight in the US - 5am on Thursday, UK time. Read more: World reacts to Trump's tariff announcementTariffs will have consequences for globalisation, the US economy and geopoliticsTrump's tariffs explained The UK government had been hoping to negotiate an economic deal with the US in a bid to avoid the tariffs, but to no avail. The government says negotiations will continue. The Confederation of British Industry said \"negotiating stronger trading relationships with all like-minded partners will be foundational to any success\". The business secretary is expected to make a statement in the House of Commons on Thursday, and we are also expecting to hear from the prime minister."
    },
    {
        "title": "MP tells Sky News she was attacked online by Tate brothers after Commons contribution",
        "description": "An MP has told Sky News she was attacked online by the Tate brothers after she participated in a debate in the House of Commons about violence against women.",
        "url": "https://news.sky.com/story/mp-tells-sky-news-she-was-attacked-online-by-tate-brothers-after-commons-contribution-13340655",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-sorcha-eastwood-tate_6874186.jpg?20250402204321",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-04-02 19:12:00",
        "Headline": "Andrew Tate and his brother Tristan are under investigation in Romania, the UK and Florida. They have denied any wrongdoing.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  An MP has told Sky News she was attacked online by the Tate brothers after she participated in a debate in the House of Commons about violence against women. The controversial duo, Andrew and Tristan Tate, are facing charges of rape and human trafficking in the UK - all of which they deny. But they are still very active online, and according to Sorcha Eastwood, the MP for Lagan Valley, are targeting her. In a document seen by Sky News, Tristan Tate has highlighted one of the MP's tweets and writes in private correspondence: \"MP, nice target, can we sue her?\" Sorcha Eastwood says at first she thought the replies were from parody accounts and not the Tate brothers. Her original tweet was about Elon Musk, not the Tate brothers. The MP said Musk's tweets should be looked at through a counter-extremism lens. \"I was really concerned, I was concerned because to me that is a direct attack for want of a better phrase on me serving my constituents. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News\n                 \n                  Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics\n                 \"I couldn't believe that they decided to pick this random Northern Irish MP. The fact that it wasn't even about them. This is something I didn't go looking for. \"I think from my perspective, it's a very, very sinister attempt to shut down important voices in public life, political discourse.\" It was only when she started noticing an uptick in abuse from other accounts she realised she had encountered some of the brothers' followers. \"I had rape threats. I had death threats. I had people saying I should be hung from a lamppost. I had people saying I should be chopped into liver. I also had people then who were like we'll waste 15 minutes raping Sorcha Eastwood.\" A representative for the Tate brothers told Sky News that there was no targeted campaign against her. They said: \"Ms Eastwood has a distorted view regarding social media if she believes one is required to 'invite or ask' people to interact. \"Tristan Tate is entitled to his view in relation to her tweet regarding Elon Musk.\" The self-styled \"misogynist influencer\" Andrew Tate and his brother Tristan have both been charged with human trafficking, face allegations of trafficking minors, sexual intercourse with a minor and money laundering in Romania. There is also a European arrest warrant for them as they are facing separate, unrelated charges of rape and human trafficking in the UK. They deny all charges. Ms Eastwood now worries for others who don't have a platform like her and who may not feel like they can speak out. \"If this is what has happened to me I have absolutely no doubt that this has happened to others where they have been attempted to be silenced.\" Keir Starmer has previously commented on the Tate brothers' case in the Commons saying it is \"a live issue\", but adding that \"the principle is absolutely clear\" in relation to whether the brothers should face justice. Sorcha Eastwood says she wants to see the government do much more to protect against abuse online.  \"I think ultimately the government has taken the wrong course on this. They need to step up. \"This should be an issue of national security as far as the radicalisation of young people online. It should be an issue in terms of the levels of misinformation, disinformation and the lack of trust that is had in our politics right across the UK and Europe. \"I want the government to help me, help every other person to crack down on this and get serious about it. And the only way they'll be able to do that, is by hitting these tech companies in the only language which they understand, which is money and via robust legislation.\" A government spokesperson said: \"Violence against women and girls is a scourge on our society which is why we have set out an unprecedented mission to halve these crimes within a decade. \"Tackling illegal abuse both online and offline is central to supporting victims and preventing harm in our communities and we will not hesitate to strengthen laws to deliver this mission. \"Last month, parts of the Online Safety Act came into force meaning companies must take action to protect users from illegal material including extreme sexual violence. \"Further protections from this summer will require platforms to protect children from harmful, misogynistic, and violent content.\""
    },
    {
        "title": "'My lawyers are ready' for questions about corruption claims, ex-minister tells Sky News",
        "description": "Tulip Siddiq has told Sky News her \"lawyers are ready\" to handle any formal questions about allegations she is involved in corruption in Bangladesh.",
        "url": "https://news.sky.com/story/my-lawyers-are-ready-for-questions-about-corruption-claims-ex-minister-tells-sky-news-13340622",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tulip-siddiq-rob-powell_6874077.jpg?20250402193448",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-04-02 18:19:00",
        "Headline": "Tulip Siddiq resigned as anti-corruption minister in January after being named in corruption probes opened by the authorities in Bangladesh.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n  Tulip Siddiq has told Sky News her \"lawyers are ready\" to handle any formal questions about allegations she is involved in corruption in Bangladesh. Asked whether she regrets apparent links with the Bangladeshi Awami League political party, Ms Siddiq said \"why don't you look at my legal letter and see if I have any questions to answerâ€¦ [the Bangladeshi authorities] have not once contacted me and I'm waiting to hear from them\". The London MP resigned as a Treasury minister in January after being named in several corruption inquiries in Bangladesh. In her first public comments since leaving government, Ms Siddiq said \"there's been allegations for months on end and no one has contacted me\". Last month, the interim leader of Bangladesh told Sky News the MP had \"wealth left behind\" in the country \"and should be made responsible\". Lawyers acting for Ms Siddiq wrote to the Bangladeshi Anti Corruption Commission (ACC) several weeks ago saying the allegations were \"false and vexatious\". The letter said the ACC must put questions to Ms Siddiq \"by no later than 25 March 2025\" or \"we shall presume that there are no legitimate questions to answer\". \n                  Ex-minister Tulip Siddiq attacks 'targeted and baseless campaign' against her by Bangladesh authorities\n                 \n                  Sheikh Hasina: India walks tightrope harbouring deposed Bangladeshi prime minister\n                 \n                  'The ugliest thing': Bangladesh leader reacts to 'House of Mirrors' prison - and vows to put Sheikh Hasina on trial\n                  In a post online today, the former minister said the deadline had expired and the authorities had not replied. Sky News has approached the Bangladeshi government for comment. The allegations against Ms Siddiq are focused on links to her aunt Sheikh Hasina - who served as the prime minister of Bangladesh for 20 years. Ms Hasina was forced to flee the country in August following weeks of deadly protests. She is accused of becoming an autocrat, with politically-motivated arrests, extra-judicial killings and other abuses allegedly happening on her watch. Hasina claims it's all a political witch hunt. Electrocuted on their genitals and mouths sewn up: Inside Bangladesh's 'death squad' jails Ms Siddiq was found to have lived in several London properties that had links back to the Awami League political party that her aunt still leads. She referred herself to the prime minister's standards adviser Sir Laurie Magnus who said he had \"not identified evidence of improprieties\" but added it was \"regrettable\" Ms Siddiq had not been more alert to the \"potential reputational risks\" of the ties to her aunt. Ms Siddiq said continuing in her role would be \"a distraction\" for the government but insisted she had done nothing wrong."
    },
    {
        "title": "Donald Trump's tariffs will have consequences for globalisation, the US economy and geopolitics",
        "description": "For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.&#160;",
        "url": "https://news.sky.com/story/donald-trumps-tariffs-will-have-consequences-for-globalisation-the-us-economy-and-geopolitics-13340802",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-tariffs_6874380.jpg?20250402221634",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-04-02 21:24:00",
        "Headline": "Sweeping tariffs have been unleased by Donald Trump, with a flat 10% on all imports from the UK and much higher rates on China, the European Union, India, and Vietnam.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  For decades, trade and trade policy has been an economic and political backwater - decidedly boring, seemingly uncontroversial.Â  Trade was mostly free and getting freer, tariffs were getting lower and lower, and the world was becoming more, not less, globalised. But alongside those long-term trends, there were some serious consequences. Trump latest: US president announces sweeping global trade tariffs Mature, developed economies like the UK and US became ever more reliant on cheap imports from China and, in the process, saw their manufacturing sectors shrink. Large swathes of the rust belt in the US - and much of the Midlands and North of England - were hollowed out. And to some extent that's where the story of Donald Trump's \"Liberation Day\" really began - with the notion that free trade and globalisation had a darker side, a side he wants to remedy via tariffs. \n                  'US is our closest ally', Jonathan Reynolds says in reaction to Trump tariffs - but 'nothing off the table'\n                 \n                  What Sky correspondents make of Trump's tariff announcement\n                 \n                  Elon Musk calls reports he will step back from government role 'fake news'\n                 He imposed a set of tariffs in his first term, some on China, some on specific materials like steel and aluminium. But the height and the breadth of those tariffs were as nothing compared with the ones we have just heard about. Not since the 1930s has the US so radically increased the level of tariffs on all nations across the world. Back then, those tariffs exacerbated the Great Depression. It's anyone's guess as to what the consequences of these ones will be. But there will be consequences. Consequences for the nature of globalisation, consequences for the US economy (tariffs are exceptionally inflationary), consequences for geopolitics. And to some extent, merely knowing that little bit more about the White House's plans will deliver a bit of relief to financial markets, which have fretted for months about the imposition of tariffs. That uncertainty recently reached unprecedented levels. But don't for a moment assume that this saga is over. Nothing of the sort. In the coming days, we will learn more - more about the nuts and bolts of these policies, more about the retaliatory measures coming from other countries. We will, possibly, get more of a sense about whether some countries - including the UK - will enjoy reprieves from the tariffs. To paraphrase Churchill, this isn't the end of the trade war, or even the beginning of the end - perhaps just the end of the beginning."
    },
    {
        "title": "More than 400 Sikh groups call on Starmer to launch 'promised' inquiry on Golden Temple massacre",
        "description": "More than 400 Gurdwaras and Sikh organisations are calling on Sir Keir Starmer to launch an inquiry he promised into potential British involvement in the Golden Temple Massacre.",
        "url": "https://news.sky.com/story/more-than-400-sikh-groups-call-on-starmer-to-launch-promised-inquiry-on-golden-temple-massacre-13340453",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-golden-temple-amritsar_6873850.jpg?20250402131255",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-04-02 12:02:00",
        "Headline": "In 2022, Sir Keir Starmer promised to hold an inquiry into the Golden Temple massacre and any potential UK involvement. Sikh groups are now calling for a probe to be announced by the end of next month.",
        "Content": "\n          Political reporter\n       More than 400 Gurdwaras and Sikh organisations are calling on Sir Keir Starmer to launch an inquiry he promised into potential British involvement in the Golden Temple Massacre. The groups have signed a letter that was sent to the prime minister urging him to follow through on a commitment made in 2022. The calls relate to questions around what part the UK and British special forces played in the 1984 killings, in which hundreds of Sikhs died after the Indian military entered the temple complex where separatists had sought refuge. Politics latest: PM admits 'pressures' as bills rise In 2014, the UK government accidentally revealed Margaret Thatcher was aware of the Indian state's intention to raid the temple and in the months before the raid, a British SAS officer provided advice to the Indian government. A subsequent investigation commissioned by David Cameron found that a single officer provided advice - and there was \"no evidence of UK government involvement in the operation itself\". However, this investigation was criticised as a cover-up due to its limited scope and quick timeframe. \n                  Bollywood film blamed for violent riots in India\n                 \n                  The Kabaddi World Cup is taking place in the West Midlands - and England's captain says they have a chance against big favourites India\n                 \n                  Holi: Millions celebrate Hindu festival of colours\n                 In 2022, Sir Keir wrote to all Gurdwaras and Sikh organisations, saying: \"A future Labour government will open an independent inquiry into Britain's military role in the Indian army's 1984 raid on the Golden Temple in Amritsar. It is important that we are open, transparent and above reproach in understanding any role the UK may have played in such events. \"This is something I know is important to our Sikh communities here and throughout the world.\" However, an announcement on the inquiry is yet to materialise. In the letter sent to the prime minister by the Sikh Federation, seen by Sky News, Sir Keir is told: \"If what is eventually proposed by a Labour government fails to deliver the 'truth' as promised by you this will have massive political ramifications for the Sikh community's support for Labour in future elections for many generations.\" The federation says an inquiry \"must\" be announced by 31 May. Read more:Groups 'disappointed' by silence on massacreSikh Activists fear for their life  In a letter to Labour MPs, the Sikh Federation also called on them to put pressure on the government to start an inquiry. The organisation also said it had heard \"extremely worrying rumours\" that the Foreign, Commonwealth And Development Office has been under pressure from the Indian government to \"avoid or limit\" an independent inquiry. It added: \"Civil servants are understood to be advising that a public inquiry is expensive and could damage relations with India.\" The UK is currently trying to negotiate a new trade agreement with India in the wake of Brexit. Attempts by the Conservative government failed due to a difference in position over visas. There is a campaign among some in the Sikh community for an independent nation to be established - known as Khalistan - out of parts of the Punjab region in northern India. ðŸ‘‰ Follow Trump 100 on your podcast app ðŸ‘ˆ These efforts are strongly opposed by Narendra Modhi's Hindu nationalist BJP movement. Sky News understands the Foreign Office has received the letter, and ministers are considering the issues raised."
    },
    {
        "title": "The cheerful optimism of supporters of the assisted dying bill has turned to nervousness",
        "description": "The assisted dying bill is entering the make-or-break stage.",
        "url": "https://news.sky.com/story/the-cheerful-optimism-of-supporters-of-the-assisted-dying-bill-has-turned-to-nervousness-13340540",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-assisted-dying-kim-leadbeater_6874025.jpg?20250402172608",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-04-02 15:25:00",
        "Headline": "The next vote on the historic legislation will take place as early as next month - meaning MPs must make their minds up about a bill that evokes strong emotions and will have consequences far beyond parliament.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n The assisted dying bill is entering the make-or-break stage. The message from those around Kim Leadbeater is that all is calm and well. She tells me she is \"not particularly worried\" about 28 MPs changing their minds and overturning the previous, historic, vote at the bill's second reading. But the mood at the assisted dying campaign's press conference today is different. The cheerful optimism that marked the last one has turned to a charged nervousness. They should be nervous. There are jitters among a number of MPs I've spoken to who voted for the bill last time but are concerned about safeguards and timeframes. Politics latest: Chancellor grilled over her spring statement  MPs do not have long to make up their minds - after the Easter recess the report stage of the process will begin (probably on the 25 April) and the next vote is expected around the 16 May. It will be the crunch vote where MPs who voted for the bill in principle - to see it debated - will need to pick a side. \n                  Assisted dying in doubt as rollout could be delayed until at least 2029\n                 \n                  Isle of Man to become first of British Isles to legalise assisted dying\n                 \n                  MPs vote to scrap High Court judge requirement in assisted dying bill\n                 Last time a majority of 55 MPs voted for assisted dying, more than many had expected but not enough to make the path to law certain. Reform's Lee Anderson and his former colleague Rupert Lowe have both told us they will no longer be backing the bill, having supported it last time. No Labour MPs I've spoken to appear to have decisively changed their mind, however. \"I would hope that some colleagues would come on board that potentially voted against it last time,\" Ms Leadbeater tells me. But the sense I get is the mood may be in the other direction. The main issue that comes up is the removal of the requirement of a High Court judge - to be replaced by a panel of experts including a senior lawyer, psychiatrist and social worker. Ms Leadbeater says the safeguards are now stronger. There has also been criticism that some amendments, including on closing a so-called anorexia loophole, were not selected. Naz Shah, the Labour MP for Bradford West who did not back the assisted dying bill but claims she was \"very open\" to voting for it, says the process has been \"fundamentally flawed\". She says: \"The intention for me was, is it going to be safer? Can I vote for this bill? Ultimately the conclusion I've drawn is, no, it's not safe enough.\"  There is also disquiet about the deadline for the implementation of assisted dying being pushed to four years, which some fear will mean it will be politicised in an election campaign. Ms Leadbeater says it is \"more important to do this right than to do this quickly\". She believes implementation can still be achieved in two years. And what of the toll it has taken on the MP herself? It was always remarkable that such consequential legislation to be brought via an individual MP's private members bill. Read more:Payouts for departing civil servants capped at Â£95,000Why is assisted dying so controversial? Ms Leadbeater, whose sister Jo Cox was murdered when she was an MP, tells me \"the personal toll has been quite hard\". She talks about the \"unpleasantness and nastiness\" that has been directed towards her but believes her parliamentary colleagues have come to the argument in good faith. \"I think people have got their views and they've got strong views\", she says. \"We all have to think about how we behave in this very privileged, very responsible job.\" One thing is for sure, it's nearly make-your-mind-up time for MPs, and what happens next will have consequences well beyond parliament."
    },
    {
        "title": "Britons urged to stop mowing lawns to boost butterfly numbers 'in long-term decline'",
        "description": "Conservation experts are urging homeowners not to mow their lawns over the coming months to help boost butterfly numbers, with more than half of UK species now in long-term decline.",
        "url": "https://news.sky.com/story/britons-urged-to-stop-mowing-lawns-to-boost-butterfly-numbers-in-long-term-decline-13340331",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-grass-lawnmower_6873718.jpg?20250402105030",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-02 08:32:00",
        "Headline": "Conservation experts say research shows letting part of a garden grow wild with long grass increases butterflies. Last year, 51 of the UK's 59 butterfly species showed a decline in numbers compared with figures for 2023.",
        "Content": "Conservation experts are urging homeowners not to mow their lawns over the coming months to help boost butterfly numbers, with more than half of UK species now in long-term decline. Last year was one of the worst on record for butterflies, with 51 of the UK's 59 butterfly species showing a decline in numbers compared with figures for 2023. The fall is being driven by human activity, the use of pesticides and climate change, experts have said. The UK Butterfly Monitoring Scheme, run by a coalition of conservation organisations, said renowned butterfly species including the small tortoiseshell, the chalk hill blue and small copper suffered their worst year ever. It was also the second-worst year, since monitoring started in 1976, for popular butterflies living in gardens, parks and the countryside such as the common blue, gatekeeper and large whites. Richard Fox, from Butterfly Conservation, said: \"I am devastated by the decline of our beloved British butterflies, and I'm sorry to say it has been brought about by human actions. \"We have destroyed wildlife habitats, polluted the environment, used pesticides on an industrial scale and we are changing the climate. \"That means that when we have poor weather, these already-depleted butterfly populations are highly vulnerable and can't bounce back like they once did - and with climate change, that unusual weather is becoming more and more usual.\" 'Significant' declines in some species Data revealed 31 species have shown a long-term decline. Experts said this included 22 species showing significant declines, including widespread butterflies such as the small tortoiseshell, whose numbers have plummeted by 86% since 1976. The green-veined white has seen a 28% decline, while the grizzled skipper, small pearl-bordered fritillary and chalk hill blue had their worst year on record. Conservationists said those species required specific habitat to survive, which had been destroyed over the past century. Dr Marc Botham, butterfly ecologist at the UK Centre for Ecology and Hydrology, said the results were \"deeply concerning\", particularly as \"they can tell us about the health of the wider environment\". Read more from Sky News:Water company 'should be prosecuted' for sewage spills'No more bat tunnels' in planning reforms What can be done to help butterflies? The results come after Butterfly Conservation declared a UK-wide \"butterfly emergency\" following the worst-ever results of its Big Butterfly Count last year. Dr Fox said the \"best thing we can do\" was to create \"more habitat\". He said research showed letting part of a garden grow wild with long grass increases butterflies. \"That is why we are calling on people and councils across the UK to pledge to not cut their grass this year from April to September, this simple act can make a real, immediate difference to butterflies, moths and other wildlife,\" he added."
    },
    {
        "title": "Film star Val Kilmer dies aged 65",
        "description": "Val Kilmer, the actor who starred in Top Gun and Batman while earning a reputation as a Hollywood bad boy, has died aged 65.",
        "url": "https://news.sky.com/story/val-kilmer-dies-aged-65-us-media-reports-13340233",
        "image_url": "https://e3.365dm.com/20/04/1920x1080/skynews-val-kilmer-top-gun_4975019.jpg?20200423112138",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-02 03:49:00",
        "Headline": "As well as his roles in Top Gun, Batman Forever and The Doors, he starred in True Romance, Heat and Kiss Kiss Bang Bang.",
        "Content": " Val Kilmer, the actor who starred in Top Gun and Batman while earning a reputation as a Hollywood bad boy, has died aged 65. His daughter Mercedes told the Associated Press he died of pneumonia on Tuesday night in Los Angeles surrounded by family and friends. California-born Kilmer was diagnosed with throat cancer in 2014 but later recovered, she said. The actor, who played Tom 'Iceman' Kazansky in Top Gun alongside Tom Cruise in 1986, previously admitted he didn't want the role which made him famous. But he said he begged to be part of the sequel, Top Gun: Maverick in 2022, even going as far as contacting the producers and creating \"heartrending scenes with Iceman\". It would be his final acting role. Kilmer had a colourful romantic past, having dated Hollywood stars including Cindy Crawford, Angelina Jolie, Carly Simon and Cher. He starred in Willow in 1988 and married his British co-star Joanne Whalley. The couple had two children before they divorced in 1996. Kilmer portrayed Batman in the 1995 film Batman Forever and received critical acclaim for his portrayal of rock singer Jim Morrison in the 1991 movie The Doors. He also starred in True Romance and Kiss Kiss Bang Bang, as well as playing criminal Chris Shiherlis in Michael Mann's 1995 movie Heat and Doc Holliday in the 1993 film Tombstone. Kilmer was one of the best-paid actors in the 1990s, and in 1992 film critic Roger Ebert wrote: \"If there is an award for the most unsung leading man of his generation, Kilmer should get it.\" The actor made his film debut in the spy spoof Top Secret! in 1984 before appearing in the goofy comedy Real Genius in 1985 - a year before he rocketed to fame in Top Gun. 'I make no apologies' Over the years, Kilmer had numerous spats with directors and co-stars and gained a reputation for being temperamental, intense, a perfectionistic, and sometimes egotistical. In an interview in 2003, Kilmer said: \"When certain people criticise me for being demanding, I think that's a cover for something they didn't do well. I think they're trying to protect themselves. \"I believe I'm challenging, not demanding, and I make no apologies for that.\" Kilmer famously clashed with co-star Marlon Brando during the notoriously troubled production of \"The Island of Dr. Moreau\", which flopped in 1996. John Frankenheimer, who directed the movie, said afterwards that there were two things he would never do: \"I will never climb Mount Everest and I will never work with Val Kilmer again. There isn't enough money in the world.\" Meanwhile, Batman Forever director Joel Schumacher once described Kilmer as \"the most psychologically troubled human being I've ever worked with\". Arts and entertainment editor From a fighter pilot, to a double-crossing mercenary to, well, Batman, Val Kilmer inhabited characters that weren't just celebrated in Hollywood but in popular culture more generally. While he'd had leading roles before 1986's Top Gun, it was in playing Iceman â€“ the atypical antihero to Tom Cruise's leading man â€“ that Kilmer became a household name. The film grossed hundreds of millions of dollars worldwide and the actor established his reputation as a box office draw. Two years later as the long-haired, sometimes bare chested, charismatic swordsman Madmartigan in fantasy Willow, Kilmer inspired a generation of teenage crushes. But it wasn't just audiences falling for him, he also met his future wife Joanne Whalley on set â€“ she played his love interest and broke young fans' hearts when they married in 1988. In the 1990s, Kilmer worked with some of the most exciting filmmakers of the decade including Oliver Stone on The Doors, Quentin Tarantino on True Romance and Michael Mann on Heat. This was before winning the role of Batman in Joel Schumacher's Batman Forever â€“ signing on without reading a script, he later revealed the costume had left him feeling isolated and he was disappointed with the experience. But in playing the iconic role, even though he didn't return for a second film, he cemented himself in superhero history. Despite his on-screen success, away from the cameras Kilmer had a reputation for being difficult to work with. There were reports he was argumentative and alienated co-stars on some films. Addressing the issue in his 2021 documentary, Val â€“ a film made from hours of self-shot footage the star had collected over the decades â€“ he explained he hoped the \"quality of the work would outweigh the perception of me being difficult\". Whether it was that reputation or the Hollywood machine moving on, Kilmer's work was less impactful in the 2000s and the starring roles were fewer and further between. Then in 2017 it was revealed he'd had treatment for throat cancer which had left him struggling to speak. Still he reprised his Iceman role for the Top Gun sequel in 2022 â€“ with the writers using his own story as inspiration for the film, the character communicating largely through typing. It was to be the final time he'd be seen on the big screen. A full circle moment and perhaps a more fitting way to say goodbye, the film was a mega hit and a reminder of Kilmer's star power. The Chicago Tribune wrote in 1997 that Kilmer was \"a member in good standing of Hollywood's bad boys club\". Despite his many plaudits for his roles in critically-acclaimed movies, Kilmer was also nominated multiple times for worst actor in the annual Razzie awards, honouring the worst in cinema. 'You truly were an icon' In his 2020 memoir Your Huckleberry, Kilmer discussed his throat cancer diagnosis and recovery. He underwent radiation and chemotherapy treatments for the disease and also had a tracheostomy that permanently gave him a raspy speaking voice. As well as the sequel to Top Gun, following his cancer diagnosis, Kilmer also starred in films including The Snowman in 2017 and Paydirt in 2020. Actor Josh Brolin wrote on Instagram: \"See ya, pal. I'm going to miss you. You were a smart, challenging, brave, uber-creative firecracker. There's not a lot left of those. \"I hope to see you up there in the heavens when I eventually get there. Until then, amazing memories, lovely thoughts.\" In an Instagram post, actor Josh Gad called Kilmer \"an icon\". He said: \"RIP Val Kilmer. Thank you for defining so many of the movies of my childhood. You truly were an icon.\" Kilmer made his Broadway debut in the 1983 production of Slab Boys with Sean Penn and Kevin Bacon. He also appeared in Shakespeare plays in New York - playing the title role in Hamlet and appearing in Henry IV: Part One and As You Like It. In 2005, he starred on London's West End in Andrew Rattenbury's adaptation of The Postman Always Rings Twice at the Playhouse Theatre. Kilmer also enjoyed painting, with his website describing him as a \"talented and prolific artist in a variety of mediums\". Born in Los Angeles on 31 December 1959, Kilmer began acting in high school and became the youngest student accepted into the drama division of the famed Juilliard School in New York. Phillip Noyce, who directed him in \"The Saint,\" told the Chicago Sun-Times in 1997 that Kilmer \"is plagued by a bad image, but most of it is unjustified. The real Val Kilmer is a lamb. And he is the hardest-working actor I've ever seen\"."
    },
    {
        "title": "'A genius actor', 'firecracker', and 'my friend': Tributes paid to Top Gun star Val Kilmer",
        "description": "Actors, directors and celebrity friends have paid tribute to Val Kilmer, after he died aged 65.",
        "url": "https://news.sky.com/story/a-genius-actor-firecracker-and-my-friend-tributes-paid-to-top-gun-star-val-kilmer-13340666",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/image_6873522.jpg?20250402064256",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-02 19:29:00",
        "Headline": "Nicolas Cage, who co-starred with Val Kilmer in Bad Lieutenant, said the actor was a \"genius actor\".",
        "Content": " Actors, directors and celebrity friends have paid tribute to Val Kilmer, after he died aged 65. The California-born star of Top Gun, Batman and Heat died of pneumonia on Tuesday night in Los Angeles, his daughter Mercedes told the Associated Press. She said Kilmer was diagnosed with throat cancer in 2014 but later recovered. Tributes flooded in after reports broke of the actor's death, with No Country For Old Men star Josh Brolin among the first to share their memories.  He wrote on Instagram: \"See ya, pal. I'm going to miss you. You were a smart, challenging, brave, uber-creative firecracker. There's not a lot left of those. \"I hope to see you up there in the heavens when I eventually get there. Until then, amazing memories, lovely thoughts.\" Kyle Maclachlan, who co-starred with Kilmer in the 1991 biopic The Doors, wrote on social media: \"You'll always be my Jim. See you on the other side my friend.\" \n                  Film star Val Kilmer dies aged 65\n                 \n                  Watch: Val Kilmer in his most iconic roles, including Top Gun and Batman Forever\n                 \n                  Stalker who believed Strictly Come Dancing judge Shirley Ballas was his aunt avoids jail\n                 Michael Mann, who directed Kilmer in 1995's Heat, also paid tribute in a statement, saying: \"I always marvelled at the range, the brilliant variability within the powerful current of Val's possessing and expressing character. \"After so many years of Val battling disease and maintaining his spirit, this is tremendously sad news.\" Heat co-star Danny Trejo also called Kilmer \"a great actor, a wonderful person, and a dear friend of mine\" on Instagram. Cher, who once dated the actor, said on X that \"U Were Funny, crazy, pain in the ass, GREAT FRIEND... BRILLIANT as Mark Twain, BRAVE here during ur sickness\". Lifelong friend and director of Twixt, Francis Ford Coppola said: \"Val Kilmer was the most talented actor when in his High School, and that talent only grew greater throughout his life. \"He was a wonderful person to work with and a joy to know - I will always remember him.\" The Top Gun account on X also said it was remembering Kilmer, who starred as Iceman in both the 1986 original and 2022 sequel, and \"whose indelible cinematic mark spanned genres and generations\". Nicolas Cage added that \"I always liked Val and am sad to hear of his passing\". \"I thought he was a genius actor,\" he said. \"I enjoyed working with him on Bad Lieutenant and I admired his commitment and sense of humor. \"He should have won the Oscar for The Doors.\""
    }
]