[
    {
        "title": "JD Vance hits out at Denmark during Greenland visit after Donald Trump says US 'needs' the island",
        "description": "JD Vance has told Denmark it has \"not done a good job\" with Greenland during a visit to the territory - as President Donald Trump repeated his call for the US to take over the island.",
        "url": "https://news.sky.com/story/jd-vance-hits-out-at-denmark-during-greenland-visit-after-donald-trump-says-us-needs-the-island-13337419",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-jd-vance_6869749.jpg?20250328210942",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-28 17:21:00",
        "Headline": "During a visit to a US military base on Greenland, the vice president says \"we need to ensure that America is leading in the Arctic\".",
        "Content": " JD Vance has told Denmark it has \"not done a good job\" with Greenland during a visit to the territory - as President Donald Trump repeated his call for the US to take over the island. Vice President Vance, his wife Usha and other senior US officials arrived at an American military base in Greenland, the semi-autonomous territory that has been a part of Denmark for more than 600 years. Follow latest: Key takeaways from Vance's speech in Greenland \"Our message to Denmark is very simple: you have not done a good job by the people of Greenland,\" Mr Vance said. \"You have underinvested in the people of Greenland, and you have underinvested in the security architecture of this incredible, beautiful landmass filled with incredible people. \"We need to ensure that America is leading in the Arctic.\" Shortly before Mr Vance spoke from Greenland on Friday, Mr Trump continued his threats of taking over the territory, saying: \"We need Greenland, very importantly, for international security. \"We have to have Greenland. It's not a question of you think we can do without it - we can't.\"  Lars-Christian Brask, deputy speaker of the Danish parliament, told Sky News that Mr Vance was \"not welcome\" by Greenlanders on his visit. \"It's a NATO country demanding a piece of another NATO country, which is highly unusual and there is a lack of respect,\" he said. The one-day visit to the US Space Force outpost at Pituffik - located on the northwest coast of the territory - has avoided violating potential diplomatic taboos of a state sending a delegation to another country, without an invitation. The trip had been scaled back after locals were angered that the original itinerary was made without consulting them - particularly in light of Mr Trump's repeated claims that the US should control Greenland. Speaking to soldiers at the US base, Mr Vance claimed Denmark - and Europe by extension - has failed to protect the region. He said: \"This place, this base, this surrounding area, is less secure than it was 30-40 years ago, as some of our allies have not kept up... \"Europe (has) not kept pace... with military spending, and Denmark has not kept pace in devoting the resources necessary to keep this base, to keep our troops, and in my view to keep the people of Greenland safe from a lot of aggressive incursions from Russia, China, and other nations.\" Mr Vance said Mr Trump was \"a president of peace\", adding: \"We respect the self-determination of Greenlanders, we believe in the self-determination of the population of Greenland.\" Asked if plans have been drafted to use military force to take over Greenland, he indicated the White House planned to wait for the people of the territory to vote for self-determination before acting. \"What the president has said... is that we need to have more of a position in Greenland,\" he added. Read more:Analysis: Vance felt the cold but had no warm wordsAnalysis: How Greenlanders view Trump's threatsWhy does Trump want to take over Greenland?Russia and America's Arctic plans another challenge for Europe Greenland is the world's largest island, with a population of 57,000, and is also a founding member of NATO. Straddling the Arctic circle between the US, Russia and Europe, the island offers a unique geopolitical advantage that America has eyed for more than 150 years. Earlier this week, Russian President Vladimir Putin said he was not surprised the US wants control of Greenland given its long-time interest in the mineral-rich territory. \"It can look surprising only at first glance and it would be wrong to believe that this is some sort of extravagant talk by the current US administration,\" Mr Putin said."
    },
    {
        "title": "JD Vance felt the cold in Greenland but he had no warm words for European allies",
        "description": "\"It's cold as s*** here,\" said the US vice president when he touched down in Greenland.",
        "url": "https://news.sky.com/story/jd-vance-felt-the-cold-in-greenland-but-he-had-no-warm-words-for-european-allies-13337663",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jd-vance-united-states_6869969.jpg?20250328235308",
        "type": "Home",
        "Author": "David Blevins",
        "Date Published": "2025-03-28 23:37:00",
        "Headline": "There was no warm welcome for JD Vance and the Second Lady in Greenland, Sky's David Blevins reports.",
        "Content": "\n          News correspondent\n              @skydavidblevins\n  \"It's cold as s*** here,\" said the US vice president when he touched down in Greenland. He meant it, both literally and metaphorically. There was no warm welcome from islanders for JD Vance and the second lady. A small US team with a list of engagements evolved into a large delegation and just one engagement. Everything changed when the organisers of a dogsled race, an annual spectacle on the cultural calendar, said the Americans weren't invited. The scaled-up US delegation and scaled-down schedule did little to address the concerns of Greenlanders. The White House didn't just send the vice president, they sent embattled national security advisor Mike Waltz too. \n                  Threat of Russia and America exploiting the Arctic another challenge for Europe\n                 \n                  JD Vance and wife due in Greenland as Putin warns US threat to take over not 'extravagant talk'\n                 \n                  JD Vance announces trip to Greenland and accuses Denmark of ignoring island 'for far too long'\n                 Instead of being greeted by residents, they were greeted by their own troops manning an outpost tasked with warning them about long-range missile attacks. And the vice president, who's fast becoming the chief critic of Europe, made Denmark the focus of his attack. But listen carefully to his speech and you'll hear the same word twice: \"think\". \"This is what we think is going to happen\" re. their hopes islanders will vote for independence from Denmark and then engage with America. \"We do not think military action will be necessary,\" he added, when asked about that potential.  There is a world of difference between thinking something and knowing something. So, what happens if what JD Vance \"thinks\" will or won't happen doesn't come to pass? Read more:How Greenlanders view Trump's threatsWhy does Trump want to take over Greenland?Russia and America's Arctic plans another challenge for Europe Back in Washington DC, the president of the United States gave the answer. \"It's not a question about whether we can do without it (Greenland). We can't,\" he said. And Donald Trump has never ruled out taking the island by force."
    },
    {
        "title": "At least 144 killed in Myanmar after earthquake - as 100 missing in Bangkok skyscraper collapse",
        "description": "At least 144 people have been killed and 730 others injured in Myanmar following a powerful earthquake, according to the head of the country's military government.",
        "url": "https://news.sky.com/story/at-least-144-killed-in-myanmar-after-earthquake-as-100-missing-in-bangkok-skyscraper-collapse-13337081",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-earthquake-thailand_6869846.jpg?20250328204539",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-28 06:37:00",
        "Headline": "Myanmar has declared a state of emergency in the affected regions after the earthquake struck while the country is in the grip of a civil war.",
        "Content": " At least 144 people have been killed and 730 others injured in Myanmar following a powerful earthquake, according to the head of the country's military government. \"The death toll and injuries are expected to rise,\" Senior General Min Aung Hlaing said on television. The 7.7 magnitude quake struck around 12.50pm local time (6.20am UK time) on Friday at a shallow depth of six miles, with the epicentre about 10 miles from the second city of Mandalay. There were also aftershocks, with one measuring a strong 6.4 magnitude 12 minutes later. Neighbouring Thailand was also rocked by the earthquake, with nine people killed in the capital Bangkok, including eight workers who died after a 33-storey skyscraper, which had been under construction, collapsed. Follow latest updates on Myanmar earthquake Rescuers searching through the rubble of the tower block for survivors have said more than 100 people were missing. Footage showed the high-rise in the Chatuchak area crashing to the ground as people ran away from the scene.  In Myanmar, buildings in five cities and towns collapsed, along with a railway bridge and a road bridge on the Yangon-Mandalay Expressway, state media reported. Images showed the destroyed Ava Bridge over the Irrawaddy River, with its arches leaning into the water. A rescue worker from the Moe Saydanar charity group said it had retrieved at least 60 bodies from monasteries and buildings in Pyinmanar, near the capital Naypyidaw, and more people were trapped. 'Building collapsed in front of my eyes' \"We all ran out of the house as everything started shaking,\" a Mandalay resident said. \"I witnessed a five-storey building collapse in front of my eyes. Everyone in my town is out on the road and no one dares to go back inside buildings.\" Another Mandalay resident said destruction stretched across the whole city, and one neighbourhood, Sein Pan, was on fire. Roads were damaged, phone lines disrupted and there was no electricity, they said. Other eyewitnesses said three people died while praying when a mosque partially collapsed in the Bago Region. Images have also emerged of a destroyed temple in Naypyidaw. Meanwhile, local media has reported that at least two people died and 20 were injured after a hotel collapsed in Aung Ben. Civil war in Myanmar The natural disaster comes as the country is in the grip of a civil war. The ruling military junta said a state of emergency has been declared in Sagaing Region, Mandalay Region, Magway Region and northeastern Shan State, Nay Pyi Taw Council Area, and Bago Region. The junta added in a statement: \"The government has ordered a rapid investigation of the damage in these areas, We will carry out relief and relief operations promptly. We will also work to provide necessary disaster relief and humanitarian assistance.\" Read more:Bangkok felt like a city caught off guardEyewitnesses describe earthquake hitting Myanmar and Bangkok By Cordelia Lynch, Asia correspondent, in Bangkok I was in the office in Bangkok at around 1.30pm when I felt the tremors. Lights start to swing, the windowpanes shook and people rushed downstairs to evacuate the building. The prime minister has established a \"war room\"- a very rare move, to help respond to the impact of the tremors. The damage in Myanmar appears far worse though.\n And this in a country ravaged by civil war. Getting information from there is very challenging. Getting aid into affected areas will be too. The Red Cross has said downed power lines are adding to challenges for their teams trying to reach Mandalay and Sagaing regions and southern Shan state. Tremors also affected Laos, Vietnam, and Bangladesh. Science and technology editor The world's highest mountain range - the Himalayas - is testament to the power of plate tectonics. Forced upwards by the gradual northward push of the Indian plate into the Eurasian plate.\n It's a power that's almost impossible to imagine until just a tiny fraction of it is suddenly released. And that's what happened just six miles beneath the feet of 1.2 million people living in the city of Mandalay and surrounding settlements. A fault line along that Indian-Eurasian plate boundary runs almost directly beneath the city. Over decades, as the plates grind past each other, tension builds up in the subsurface rock. When it finally gives, an earthquake is the result. Such strike-slip faults as they're known don't generate the world's most powerful earthquakes. That dubious honour goes to subduction zones in places like Sumatra and Japan that generate the magnitude 9 earthquakes that caused the Boxing Day tsunami of 2004 or the Tohoku tsunami of 2011.   A magnitude 7.7 quake is still extremely powerful and destructive if it occurs shallow in the Earth's crust and close to population centres. This did both. Recent history has an important role to play too. Large earthquakes in this region happen every decade or so. But the last one of this size in the Sagaing region was in 1946. That pre-dates the development of modern earthquake building codes. Reconstruction in Mandalay and beyond after that event will have resulted in buildings vulnerable to collapse from shaking of this magnitude and possibly already weakened by previous events. Meanwhile, hundreds of people poured out of buildings in Bangkok after the tremors, with many buildings evacuated. The city is home to 17 million people and many live in high-rise apartments. Alarms went off in buildings as the earthquake hit. Footage on social media has shown water being thrown down the side of buildings from rooftop swimming pools. All flights in and out of Bangkok are operating normally following the earthquake, the country's civil aviation department said on Friday."
    },
    {
        "title": "Bangkok felt like a city caught off guard when chaos erupted with earthquake",
        "description": "Bangkok felt like it erupted into chaos when the tremors hit.",
        "url": "https://news.sky.com/story/bangkok-felt-like-a-city-caught-off-guard-when-chaos-erupted-with-earthquake-13337432",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bangkok-skyscraper_6869694.jpg?20250328181910",
        "type": "Home",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-03-28 17:29:00",
        "Headline": "Many will no doubt continue to press the government on why there was no emergency alert system, no texts, nothing. Not for hours after, at least.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  Bangkok felt like it erupted into chaos when the tremors hit. No one knew what was happening and there was no warning. In a city where lives are lived, there were suddenly incongruous sights in the sky - pools overflowing, high-rise walkways connecting expensive apartments broken apart, and huddles of confused and scared people outside offices. The busy skytrain that millions rely on in Thailand's capital was shut down, bringing the city to a grinding halt and people struggling to move around. Read more: Dozens die in Myanmar quake - as 100 missing in Bangkok  My producer Rachael and I had to share a motorbike to try and get to the scene of the worst building collapse - a slow route through gridlocked traffic. On arrival, the devastation was clear. A mass of rubble, a sea of rescue workers, and panicked onlookers. \n                  Naples residents 'shaken awake' by strongest earthquake in 40 years\n                 \n                  Greece declares state of emergency on Santorini after earthquakes\n                 \n                  Buildings in Vanuatu damaged and casualties reported as magnitude 7.3 earthquake hits South Pacific island nation\n                 We were told that 90 construction workers were still trapped inside. One of the men trying to rescue them told me he had heard some voices and was hopeful they would be able to pull people out alive. But he acknowledged it was \"very difficult\" work and, as he spoke, we were engulfed with dust, the light already fading as specialist bulldozers were brought in. Many of those inside, we were told, were Cambodians about to finish building the structure.  Why no warnings? As the rescue effort continued, Thailand's Prime Minister Paetongtarn Shinawatra suddenly arrived. I asked her why there were no warnings - in a nation that 20 years ago suffered a devastating earthquake. She did not respond. But many will no doubt continue to press her government on why there was no emergency alert system, no texts, nothing. Not for hours after, at least. Read more from Sky News:Latest updates on earthquakeEyewitnesses describe quake hitting Myanmar and Bangkok On the ground, Bangkok felt like a city caught off guard. There are now fears of aftershocks - as the government moves quickly to try and reassure its people there will be warnings next time. But in a place where the skyline is dominated by high-rise apartments, buildings and offices, there is a feeling of vulnerability now. And there are questions about the integrity of their structures and what can be done to protect a population of more than 17 million people."
    },
    {
        "title": "Why King Charles's openness on cancer treatment is huge step change from past",
        "description": "The King's window was wound down as the car left Clarence House on Friday. Even that says a lot about the monarch and his approach to his cancer treatment right now. ",
        "url": "https://news.sky.com/story/why-king-charless-openness-on-cancer-treatment-is-huge-step-change-from-past-13337274",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-king-charles_6869530.jpg?20250328210221",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-03-28 13:13:00",
        "Headline": "King Charles has been seen publicly for the first time since going into hospital on Thursday for temporary side effects during cancer treatment. ",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The King's window was wound down as the car left Clarence House on Friday. Even that says a lot about the monarch and his approach to his cancer treatment right now.  He wants to be seen by people, he wants to be as open as possible about what he's going through. It comes after he cancelled his Friday engagements due to \"temporary side effects\" from his cancer treatment that required a \"short period of observation in hospital\", Buckingham Palace said. For those of us who've reported on the royals for some time, the amount he's shared has been a huge step change from the past.  Partly guided by him, I am regularly told he wanted to share his diagnosis and the fact that he's still having treatment, especially if he thinks it can help others. But also lessons have been learnt from the past. You may remember that in October 2021, The Sun newspaper revealed that Queen Elizabeth had spent a night in hospital, and that's why she had cancelled a trip to Northern Ireland. I remember it well, I'd already flown there, but the palace hadn't proactively told us about her hospital stay. It caused outrage that information about our head of state and her health was being kept from the public. The palace doesn't want a repeat of that - especially when the King's openness has had such a positive impact on the discussions around cancer. Read more from Sky News:Harry 'in shock' as he quits charityWilliam meets Clarkson's Farm star The King has chosen not to reveal what kind of cancer he has been treated for and some, of course, want to know exactly what he has been diagnosed with. Some ask if the public deserve to know more - which is a question for constitutional experts. Craig Prescott told Sky News: \"The King has the right to the privacy of his health affairs but there is a public interest when those health issues affect the King's ability to conduct his engagements and fulfil his constitutional functions.\" But cancer charities have told me the fact we don't know has been beneficial. It's not made one specific cancer more important than others - it's shown everyone's journey and potential struggles are worthy of respect. The fact that the King has been so busy with engagements, and strikingly front and centre of high stakes diplomatic issues recently, shows how much he is lifted by his official work, which gives him real purpose. But this shows us all that he is only human, and the cancer treatment he's going through is tough at times. Last week, the King asked other cancer patients in Northern Ireland if they were \"managing to survive the side effects alright\", before sharing his advice, telling them: \"What's that Winston Churchill saying? Keep buggering on.\" Largely with the King, he's been lucky; we haven't visibly seen any of the side effects he asked the others about. But this hospital visit is a reminder that he's still very much going through it - and living with it."
    },
    {
        "title": "Gaza's orphans have lost everything - even the dream of growing up",
        "description": "The number of children killed in Gaza, according to the local health ministry,&#160;recently&#160;rose above 15,000.",
        "url": "https://news.sky.com/story/gazas-orphans-have-lost-everything-even-the-dream-of-growing-up-13337030",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-israel-hamas-palestine_6869110.jpg?20250327235717",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "Five-year-old Jenin liked to dance, like so many other five-year-old girls around the world. She danced until the war came to her home, killing 25 members of her family including her father and all of her brothers and sisters.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  The number of children killed in Gaza, according to the local health ministry, recently rose above 15,000. Fatality figures in Gaza are disputed by Israel, but even allowing for miscalculation or exaggeration, it is a staggering loss of life. Many children have been orphaned, losing not just both parents but also siblings, grandparents and other close relatives too. Against this tragedy, the children of Gaza can't dream of growing up. War has robbed them of that. 'I just want to forget' \"I'm here hanging out with my friends because I just want to forget the war,\" says Osama, whose family was killed. \n                  Anti-Hamas chants heard at rare protest in Gaza\n                 \n                  What happened to the Israel-Hamas ceasefire - and could there be another one?\n                 \n                  Starmer expresses 'deep concern' about lack of humanitarian aid in Gaza\n                 \"I look at my destroyed home there and think about the memories I had there with my mum and dad, in their room. And now it's gone,\" he says, surrounded by other young boys, probably no older than 10. \"We used to have fun every day, sit in the kitchen, play together at home, and now it's all gone. \"I want to forget everything. I want to have fun.\" Israel continues to bombard Gaza On Thursday, Egypt sent a delegation to Qatar in an attempt to push for a renewed ceasefire. Israel's Prime Minister Benjamin Netanyahu met with senior security officials on Thursday night to discuss developments. For now, Israel is continuing to attack Gaza daily and is refusing to lift a blockade on aid entering the Strip. The United Nations has reported that cases of malnutrition among children in northern Gaza have almost doubled as a result. Hundreds of children have also been killed since the resumption of attacks almost two weeks ago. She danced until the war came home Five-year-old Jenin liked to dance, like so many five-year-old girls around the world liked to dance. She danced in the tent where her family was sheltering from the war nearby and she danced until the day that the war came home. It was early in the morning when the missile struck - the family was getting ready for Suhoor, the Ramadan breakfast. Twenty-five of Jenin's relatives were killed, including her father and all of her brothers and sisters. Her mother was already dead, killed in a previous strike. Jenin now lies in a hospital bed, still unaware she has lost her family. She is mostly unconscious - her skull fractured, she has bleeding on her brain and is in desperate need of surgery she cannot get in Gaza. \"She's truly lost all sense of safety. She's terrified by anyone who comes near her,\" Jenin's aunt told Sky News. \"Jenin has lost the ability to speak. The shock was so severe that she can no longer communicate verbally.\" She went on: \"Instead, she points and gestures, but words elude her. Most of the time, she is angry and throws things around; her emotional state is drained. \"Sometimes she responds, but other times she doesn't. When she looks at us, there's a visible frustration in her eyes -frustration from not being able to see her mum.\" Another family that didn't survive the night In Gaza City, our team filmed another family that didn't survive the night. Rescuers searched for survivors but pulled out the bodies of four people. Twelve-year-old Sameer was the only one to escape the strike. He sobbed in silent prayer next to the wrapped corpses of his parents and siblings. Another orphan in Gaza. \"One of my favourite memories with my family was a day at the beach,\" he told us. \"We swam and played and had such a good time. I remember my brother walking back and spilling juice on himself. We laughed and told him off!\" Read more:What happened to Israel-Hamas ceasefire?Anti-Hamas chants heard at rare protest in Gaza His family was buried together, side-by-side in a shallow grave. Sameer, the one who lived, watched on, silent and lost. \"I wasn't scared before, because I had my family around me. Right now, I am scared to lose more people. My mum and dad and everyone were martyred. I'm worried about losing more people. So now whenever I hear the planes above, I think they're going to bomb me in my home.\" There is no word for someone who has lost so much. But in Gaza, there are so many children who have lost everything. Their childhood, their families, their future."
    },
    {
        "title": "Who is MAGA's most aggressive loyalist Marjorie Taylor Greene?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/who-is-magas-most-aggressive-loyalist-marjorie-taylor-greene-13337393",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marjorietaylorgreene_6869596.jpg?20250328163223",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-28 16:32:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 US congresswoman Marjorie Taylor Greene hit the headlines this week when she told Sky's US correspondent Martha Kelner to \"go back to your own country\".  It was the latest controversy in a political career for the Republican firebrand - a staunch supporter of US President Donald Trump and his Make America Great Again (MAGA) movement.  But who is she and how influential has she become? Host Jonathan Samuels speaks to Tia Mitchell, Washington bureau chief for The Atlanta Journal-Constitution, who has been covering Ms Taylor Greene since she first entered politics five years ago. She tells us what she's like in person, how she emerged and her most controversial moments. Producer: Emma Rae Woodhouse Editor: Paul Stanworth & Philly Beaumont"
    },
    {
        "title": "UK weather: Spring sunshine set to return on Mother's Day, forecasters say",
        "description": "Spring sunshine will return to parts of the UK in time for Mother's Day and continue into next week &#8211; potentially bringing the hottest day of the year so far, forecasters have said.",
        "url": "https://news.sky.com/story/uk-weather-spring-sunshine-set-to-return-for-mothers-day-forecasters-say-13337381",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-weather_6869585.jpg?20250328160957",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-28 16:05:00",
        "Headline": "Saturday has a mixed outlook - but warmer weather should be back by Sunday, meteorologists have predicted.",
        "Content": "Spring sunshine will return to parts of the UK in time for Mother's Day and continue into next week – potentially bringing the hottest day of the year so far, forecasters have said. Sky weather producer Kirsty McCabe said Mothering Sunday was likely to be a \"mostly fine day with bright or sunny spells once early low cloud and drizzle clears\". She predicted there would be \"temperatures near or above average\" for most places. Afterwards, however, high pressure is set to dominate. There is a good chance the highest temperature of the year so far will be reached by the middle of next week, topping the high of 21.3C (70F) recorded on 20 March. Latest UK weather forecast However, the far north and west of the British Isles are likely to be cloudier and windier with a risk of rain. The Met Office has also forecast that warm conditions will return on Sunday after a brief, changeable period in what it called \"typical spring fashion\". Central and inland areas should have the warmest weather on Mother's Day, with its forecasters also predicting \"a short-lived spell of unsettled weather this weekend\". But the Met Office added the country would \"transition back towards a blocked weather pattern as high pressure builds on Sunday and dominates our weather through much of next week\". Honor Criswick, a meteorologist from the agency, said the high pressure would \"stick around as we head into next week, bringing some fine and settled conditions, perhaps even some warm sunshine\". Partial solar eclipse in parts of UK Ms Criswick said Sunday morning would be cloudy, with possible drizzle and mist, but that would give way to a dry day with \"some sunny spells, particularly across central and inland areas of the UK\". She predicted there would be \"quite a settled start to the week next week, lots of sunny spells and also some quite warm temperatures\". Read more from Sky News:Myanmar earthquake latestMan who murdered flatmate jailedKing seen in public after treatment Meanwhile, a partial solar eclipse will be visible in parts of the UK between 10am and noon on Saturday. Those in the east of the country will have the best chance of seeing it. The phenomenon occurs when the moon passes between the sun and the Earth. However, the three planetary bodies will not be completely aligned, meaning only part of the sun will be obscured this weekend."
    },
    {
        "title": "Nasen Saadi: Criminology student with 'grievance against women' jailed for murdering personal trainer on beach",
        "description": "A criminology student who murdered a woman and attempted to murder another on a beach in Bournemouth has been jailed for life, with a minimum term of 39 years.",
        "url": "https://news.sky.com/story/nasen-saadi-criminology-student-who-murdered-woman-in-beach-attack-jailed-13336704",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-nasen-saadi-dorset-police_6779625.jpg?20241218152809",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 12:00:00",
        "Headline": "The 20-year-old killed personal trainer Amie Gray, 34, as she sat beside a fire on Durley Chine Beach, Dorset, in May last year.",
        "Content": " A criminology student who murdered a woman and attempted to murder another on a beach in Bournemouth has been jailed for life, with a minimum term of 39 years. Nasen Saadi, 21, from Croydon, fatally stabbed personal trainer Amie Gray, 34, 10 times as she sat beside a fire on Durley Chine Beach in Dorset on the evening of 24 May. Her friend Leanne Miles, who was sitting next to her, suffered 20 knife injuries but survived the attack. Saadi was found guilty of murder and attempted murder after a trial at Winchester Crown Court in December. On Friday, he was sentenced to life in prison. During sentencing, Judge Mrs Justice Cutts said Saadi had denied his guilt because he wanted the \"notoriety of a trial\" and had a \"complete lack of remorse\". She said: \"The clear evidence is you planned to kill and went to Bournemouth to do so. \"I am satisfied that you chose Amie Gray and Leanne Miles because you have a grievance against society as a whole and women in particular.\" She added: \"It seems you have felt humiliated and rejected for any advances you have made towards girls, which has led over time to a deeply suppressed rage towards society and women in particular.\" The judge said the attack was \"utterly senseless\" and added: \"I have no doubt you are an extremely dangerous young man and will remain so.\" The trial previously heard how Saadi, who was studying criminology at Greenwich University in London, was asked by one of his lecturers: \"You're not planning a murder, are you?\" He had asked tutors questions about self-defence for murder and how long traces of DNA remain on an object. Saadi, who had collected knives and researched locations to carry out the killing, told detectives he had an interest in true crime, unsolved cases and horror movies. The court heard he used the name \"Ninja Killer\" on his Snapchat account and also had the username \"NSkills\" on his computer. During the trial, the jury was played CCTV footage the prosecution said showed Saadi walking along the beach promenade. They also heard a CCTV audio recording of screaming and a male voice at around 11.39pm - the time of the attack. A recording of a 999 call made by Ms Miles was played to the court in which she was heard crying in pain. The 39-year-old told the operator: \"I have been stabbed loads of times. Oh my God, I am getting dizzy, please hurry up, please hurry up.\" She continues: \"I am bleeding everywhere, I have been stabbed loads of times.\" The defendant, who chose not to give evidence, admitted visiting Bournemouth but denied the offences. He told police he might have \"blacked out\" and had no memory of the period that included the attacks. In a police interview shown in court, Saadi said: \"I am not responsible and I have no reason to attack someone for no reason.\" Saadi, who was wearing a blue sweatshirt and glasses, showed no emotion as the sentence was read out. He pleaded guilty to failing to provide his mobile phone code to police. In a victim impact statement read to the court, Mrs Gray's wife, Sian Gray, said the death would \"haunt\" her forever. She said: \"At the age of 36, I should not have to hold my deceased wife's cold hand, nor should my daughter have to say goodbye and grieve over a coffin. \"Amie's beautiful life has now been reduced to forever being remembered as 'the murder victim'.\" Read more from Sky News:Myanmar earthquake latestMan who murdered flatmate jailedKing seen in public after treatment Mrs Gray's mother Sharon Macklin described her daughter as \"an amazing, funny, kind and energetic soul\". Ms Macklin added: \"She had a big smile and a loud laugh, and when she entered the room, it filled with laughter, and her presence couldn't be ignored. \"She was beautiful inside and out. Even if life wasn't great for her, she would always find the time to help others.\""
    },
    {
        "title": "King Charles seen in public for first time since suffering side effects from cancer treatment",
        "description": "The King has been seen in public for the first time since his short hospital visit.",
        "url": "https://news.sky.com/story/king-charles-seen-in-public-for-first-time-since-suffering-side-effects-from-cancer-treatment-13337204",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-king-charles-clarence-house_6869373.jpg?20250328113437",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 10:55:00",
        "Headline": "Charles, who was seen in a car in London on Friday, cancelled his engagements for the day because of the \"temporary side effects\" from his cancer treatment that \"required a short period of observation in hospital\".",
        "Content": " The King has been seen in public for the first time since his short hospital visit. The monarch, 76, waved at well-wishers while leaving Clarence House in London in a car this morning. It is understood he was going to his Highgrove estate in Gloucestershire. It comes after he cancelled his Friday engagements due to \"temporary side effects\" from his cancer treatment. Buckingham Palace said after \"scheduled and ongoing medical treatment for cancer\" on Thursday, the King \"experienced temporary side effects that required a short period of observation in hospital\". The King revealed in February 2024 that he had been diagnosed with cancer and was beginning treatment. He returned to public duties in April last year and sources suggested in December his treatment would continue in 2025 and was \"moving in a positive direction\". Thursday's short period of observation in hospital was described as a \"most minor bump in a road that is very much heading in the right direction\", the Press Association said, quoting a source. The King visited the London Clinic on Thursday morning and travelled to and from the hospital by car. He was not joined by the Queen during his brief stay. Royal correspondent This news was unexpected, even though we've known the King is still undergoing treatment for his cancer. It is also unusual for the King to cancel engagements, especially a day in Birmingham which will have been meticulously planned.  That said, the palace was keen to stress he should be back to work as normal next week, and there was no sense this will have any effect on the upcoming state visit to Italy. \n The King enjoys his work and won't be happy letting people down. Some have said his work is what has helped keep him going through his diagnosis.\n Aides called it a \"bump in the road\" and that overall the King's progress is heading in the right direction.\n But the fact they decided to make this announcement shows it was of some concern. It is also a reminder he remains a cancer patient, and with that, facing all the uncertainty and unpredictability the disease can present.\n Tourist Julian Mati, 34, said it was a \"relief\" to see the King looking well, admitting he was \"horrified when we heard the news yesterday. \"We had come down to the palace today to take pictures, but we never imagined we would see the King. To see him smiling and waving, it's such a relief.\" In its statement, the palace added that the King \"would like to send his apologies to all those who may be inconvenienced or disappointed as a result [of his cancelled appointments].\" Read more from Sky News:Myanmar earthquake latestMacron's plan for Ukraine 'reassurance force'Six dead after tourist submarine sinks  On Wednesday, the King had a typically busy day of activities. He was at London's Somerset House, where he unveiled a plaque, before hosting a reception at Buckingham Palace in the evening. Last week, the royals also made a three-day visit to Northern Ireland."
    },
    {
        "title": "'Sensitive military documents' found in Newcastle street",
        "description": "\"Appropriate action\" will be taken following the discovery of sensitive military documents on a street in Newcastle, Downing Street has said.",
        "url": "https://news.sky.com/story/appropriate-action-will-be-taken-following-discovery-of-dumped-military-documents-13337300",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-defence-uk_6096155.jpg?20230321153338",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 16:13:00",
        "Headline": "An investigation has been launched after paperwork relating to a military garrison was found spilling out of a black bin bag.",
        "Content": "\"Appropriate action\" will be taken following the discovery of sensitive military documents on a street in Newcastle, Downing Street has said. An investigation has been launched by the Ministry of Defence (MoD) after the paperwork was found spilling out of a black bin bag in the Scotswood area of the city on 16 March. The BBC reported that the documents included details of soldiers' ranks, shift patterns, email addresses, weapon issue records and access information for military facilities. Politics latest: 'Many people' are 'slightly fearful' of trying work, Starmer says The broadcaster reported the paperwork related to units based at Catterick Garrison in North Yorkshire, around 50 miles south of Newcastle. In a statement, the MoD said it did not believe there had been a significant security breach. A spokesperson said: \"We take the protection of our information very seriously and this incident is being closely investigated. \"We have rapidly reviewed the information and understand no sensitive operational defence information is contained within the documents.\" Among the paperwork was a sheet reportedly headed \"armoury keys and hold IDS codes\" – believed to refer to an armoury and intruder detection system. A Number 10 spokesperson said: \"The Ministry of Defence is currently looking at documents handed to the police, but the matter is the subject of an ongoing investigation by the Army. \"As you will appreciate, I won't be able to comment on any specifics while that takes place, but you can expect that appropriate action will be taken in response to any potential information breach. \"It's obviously important that that investigation is allowed to take its course.\" The discovery was made by Mike Gibbard, a football fan from Gateshead, who stumbled across the documents while parking ahead of Newcastle United's Carabao Cup final match against Liverpool. He told the BBC: \"I peered down and started to see names on bits of papers, and numbers, and I thought 'what's that?' \"They were piled up against a wall, in a black bag, in the road, underneath cars – spread all the way up the road.\" He said he found more documents on the other side of the road and was alarmed by the contents. \"Details of the perimeter, the patrol, checking weapons in and out, requests for leave, mobile phone numbers, high-ranking officers,\" he told the BBC. \"This shouldn't be here, anyone could pick it up.\" Read more from Sky News:Myanmar earthquake latestMan who murdered flatmate jailedKing seen in public after treatment The documents were handed to Northumbria Police. A spokesperson for the force said they were subsequently given to the MoD. Government guidelines recommend that some \"official - sensitive\" documents could pose a \"threat to life\" if compromised. The advice states that such paperwork should be destroyed using shredders or \"burn bags\"."
    },
    {
        "title": "UK weather: Spring sunshine set to return on Mother's Day, forecasters say",
        "description": "Spring sunshine will return to parts of the UK in time for Mother's Day and continue into next week &#8211; potentially bringing the hottest day of the year so far, forecasters have said.",
        "url": "https://news.sky.com/story/uk-weather-spring-sunshine-set-to-return-for-mothers-day-forecasters-say-13337381",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-spring-weather_6869585.jpg?20250328160957",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 16:05:00",
        "Headline": "Saturday has a mixed outlook - but warmer weather should be back by Sunday, meteorologists have predicted.",
        "Content": "Spring sunshine will return to parts of the UK in time for Mother's Day and continue into next week – potentially bringing the hottest day of the year so far, forecasters have said. Sky weather producer Kirsty McCabe said Mothering Sunday was likely to be a \"mostly fine day with bright or sunny spells once early low cloud and drizzle clears\". She predicted there would be \"temperatures near or above average\" for most places. Afterwards, however, high pressure is set to dominate. There is a good chance the highest temperature of the year so far will be reached by the middle of next week, topping the high of 21.3C (70F) recorded on 20 March. Latest UK weather forecast However, the far north and west of the British Isles are likely to be cloudier and windier with a risk of rain. The Met Office has also forecast that warm conditions will return on Sunday after a brief, changeable period in what it called \"typical spring fashion\". Central and inland areas should have the warmest weather on Mother's Day, with its forecasters also predicting \"a short-lived spell of unsettled weather this weekend\". But the Met Office added the country would \"transition back towards a blocked weather pattern as high pressure builds on Sunday and dominates our weather through much of next week\". Honor Criswick, a meteorologist from the agency, said the high pressure would \"stick around as we head into next week, bringing some fine and settled conditions, perhaps even some warm sunshine\". Partial solar eclipse in parts of UK Ms Criswick said Sunday morning would be cloudy, with possible drizzle and mist, but that would give way to a dry day with \"some sunny spells, particularly across central and inland areas of the UK\". She predicted there would be \"quite a settled start to the week next week, lots of sunny spells and also some quite warm temperatures\". Read more from Sky News:Myanmar earthquake latestMan who murdered flatmate jailedKing seen in public after treatment Meanwhile, a partial solar eclipse will be visible in parts of the UK between 10am and noon on Saturday. Those in the east of the country will have the best chance of seeing it. The phenomenon occurs when the moon passes between the sun and the Earth. However, the three planetary bodies will not be completely aligned, meaning only part of the sun will be obscured this weekend."
    },
    {
        "title": "Richard Woods: Suicidal ex-RAF pilot took own life and killed four others in head-on motorway crash, inquest rules",
        "description": "A former fighter pilot took his own life and killed four others when he drove the wrong way down the M6 while drunk, an inquest has ruled.",
        "url": "https://news.sky.com/story/richard-woods-suicidal-ex-raf-pilot-took-own-life-and-killed-four-others-in-head-on-motorway-crash-inquest-rules-13337180",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-m6-crash_6717286.jpg?20250328101634",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-28 10:09:00",
        "Headline": "The fatal collision happened on the M6 northbound, past Tebay services in Cumbria, on 15 October 2024. Five people, including a father and his two sons, were killed in the crash.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A former fighter pilot took his own life and killed four others when he drove the wrong way down the M6 while drunk, an inquest has ruled. Richard Woods, 40, deliberately drove his Skoda head-on into a Toyota on the motorway near Tebay services in Cumbria on 15 October last year, Cockermouth Coroner's Court has officially recorded. Jaroslaw Rossa, 42, the driver of the Toyota, and his two sons, Filip, 15, and Dominic, seven, were pronounced dead at the scene alongside Mr Rossa's partner, Jade McEnroe, 33. All four were from Glasgow. On Thursday, assistant coroner Margaret Taylor returned a verdict of suicide for Mr Woods. His cause of death was said to be \"multiple injuries\". The inquest heard how Mr Woods, from Cambridgeshire, had served a distinguished 14-year career in the RAF and was a flight instructor for BAE Systems at the time of his death. In Ms Taylor's record of inquest, Mr Woods was said to have been experiencing \"a number of stressors in his life\" and had a \"history of harmful use of alcohol\". On the day of his death, concerns had been raised over his behaviour at a work conference near Preston in Lancashire. Ms Taylor wrote: \"It was suspected he had been drinking alcohol.\" Mr Woods failed to return to his seat after lunch and was later spotted driving erratically and swerving across three northbound carriageway lanes on the M6. After pulling onto the hard shoulder, he then proceeded to U-turn and drove southward on lane three. Ms Taylor said: \"Richard took no action to alter his position on the road or apply his breaks. \"His car collided head-on with the Toyota Yaris. The driver of the Toyota had no opportunity to react or take action to avoid the collision. \"Richard died as a consequence of multiple injuries sustained upon impact.\" Toxicology reports revealed \"high levels of alcohol\" in Mr Woods' blood at the time of his death. A forensic examination of his phone also showed multiple searches on suicide. Ms Taylor wrote: \"On the balance of probabilities, on 15 October 2024 Richard Woods drove purposefully at speed in a southerly direction on the northbound carriageway in lane three on the M6 motorway with the intention of ending his own life.\" Read more from Sky News:Man who murdered pensioner jailed for life81 trapped after earthquake collapses skyscraper Following the fatal collision, Filip and Dominic's mother Kamila paid a heartfelt tribute to her \"beloved angels\". She described Filip as \"very intelligent, sensitive and full of love\", adding: \"He was fascinated by computer games but also incredibly good at chess. He loved chemistry and dreamed of studying at the University of Glasgow. \"Dominic was always smiling, very resolute and sociable. He was extremely caring, always thinking of others first, and the first to help if someone was in trouble. \"Always surrounded by a group of friends of all ages. He loved dinosaurs and Pokémon, but most of all he loved penguins and dreamed of adopting one. \"Our lives will never be the same again.\" Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Oldham: Mum and baby safe and well after human placenta found in Werneth Park",
        "description": "A mum and baby have been found safe and well after a human placenta was discovered at a park in Oldham, police have said.",
        "url": "https://news.sky.com/story/oldham-police-appeal-after-placenta-found-in-werneth-park-13337614",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-oldham-werneth-park_6869885.png?20250328212912",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 21:20:00",
        "Headline": "Greater Manchester Police has thanked the local community for their assistance.",
        "Content": "A mum and baby have been found safe and well after a human placenta was discovered at a park in Oldham, police have said. In an earlier appeal, Greater Manchester Police said it was working to establish the circumstances of the incident and ensure no one had been harmed. The force said the discovery, in the town's Werneth Park, was being treated as a welfare investigation. Officers believed the mother and baby involved could be in need of medical attention, with the birth having occurred in the last 24 hours. Police say they have now located the mother and baby and added that they are both safe and doing well. Having worked with medical professionals, police are satisfied that their identities match the placenta found. The police scene will now close, with officers having concluded that there are \"no untoward circumstances\". Read more from Sky News:Dozens killed in Myanmar earthquakeStudent jailed for killing woman on beach A spokesperson for the force thanked the members of the public who provided assistance and cooperated with the park's closure. The spokesperson added that they hope the update \"provides closure to any earlier concerns\"."
    },
    {
        "title": "Plan for US oil tanker involved in North Sea collision announced",
        "description": "A US oil tanker that collided with a container ship in the North Sea is set to have its cargo of more than 200,000 barrels of jet fuel removed this weekend.",
        "url": "https://news.sky.com/story/plan-for-us-oil-tanker-involved-in-north-sea-collision-announced-13337520",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-stena-immaculate-humber-estuary_6869903.jpg?20250328214352",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 20:09:00",
        "Headline": "More than 200,000 barrels of jet fuel will be removed from the Stena Immaculate this weekend before the US vessel is towed to the North East of England.",
        "Content": " A US oil tanker that collided with a container ship in the North Sea is set to have its cargo of more than 200,000 barrels of jet fuel removed this weekend. The Stena Immaculate and Portuguese vessel the Solong collided about 12 miles off the coast of East Yorkshire earlier this month, leaving one man missing, presumed dead. Shipping company Crowley, which manages the Stena Immaculate, said salvage and recovery operations will move into the next phase on Saturday and Sunday. The remaining 202,485 barrels of Jet-A1 cargo will be transferred to a tanker anchored nearby, it said. The jet fuel will then be delivered to its original destination of Killingholme in Lincolnshire, Crowley added. The Solong arrived in Aberdeen on Friday after being towed to the city's port. Thirty-six people were rescued from both ships following the collision on 10 March. A sailor from the Solong - named as 38-year-old Filipino national Mark Angelo Pernia - is missing and presumed dead. The Solong's Russian captain Vladimir Motin has been remanded in custody, charged with gross negligence manslaughter. He is due to stand trial in January 2026. Read more:Why did the ships crash?Crew of tanker praised as 'heroic' After the jet fuel is removed, the Stena Immaculate will be towed to the Port of Tyne on the North East coast, near Newcastle, for further inspection, which is expected to take place in early April. Following the collision, thousands of plastic pellets, known as nurdles, were released from ruptured containers on the Solong. They began washing up on beaches on the Norfolk coast, where a clean-up operation is continuing. The National Trust said nurdles had appeared on Brancaster Beach in Norfolk and the RSPB confirmed they had washed up at the charity's reserve at nearby Titchwell. While the plastic pellets are not toxic, they can be a risk to wildlife if ingested."
    },
    {
        "title": "Marcin Majerkiewicz: Man who murdered pensioner and dismembered his body jailed for life",
        "description": "A man has been sentenced to life in prison with a minimum term of 34 years for murdering a pensioner and dismembering his body with a hacksaw.",
        "url": "https://news.sky.com/story/marcin-majerkiewicz-man-who-murdered-pensioner-and-dismembered-his-body-jailed-for-life-13336653",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marcin-majerkiewicz_6863151.jpg?20250321114743",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-28 09:00:00",
        "Headline": "Marcin Majerkiewicz, 42, bludgeoned Stuart Everett with a hammer at the house they shared in Salford, Greater Manchester, overnight between 27 and 28 March last year.",
        "Content": "A man has been sentenced to life in prison with a minimum term of 34 years for murdering a pensioner and dismembering his body with a hacksaw. Warning: This article contains details that some people might find distressing. Marcin Majerkiewicz, 42, bludgeoned Stuart Everett with a hammer at the house they shared in Salford, Greater Manchester, overnight between 27 and 28 March last year. He used a hacksaw to dismember the 67-year-old, cutting him into 27 pieces, before taking the body parts in plastic bags on bus journeys across Salford and Manchester to dump the evidence. Police say the Polish father-of-two had an obsession with gore and gruesome horror, as well as a tattoo of slasher-film character Jason from the horror franchise Friday the 13th. Majerkiewicz denied responsibility for the killing but offered no evidence in his defence. His motive remains unclear. Jurors convicted him of murder following a three-week trial at Manchester Crown Court. On Friday, he was jailed at the same court for life with a minimum term of 34 years. Trial judge Mr Justice Cavanagh told Majerkiewicz, who was unemployed at the time of the crime, it was pre-planned murder for gain, to steal Mr Everett's money to pay off his spiralling debts. Majerkiewicz, who planned to flee abroad after the murder, owed £60,000 in loan debt and £14,000 on credit cards, the court heard. Mr Justice Cavanagh said: \"You acted in an almost unbelievably cold-blooded and macabre way and showed complete disrespect and contempt for your friend's remains. \"This denied dignity to Stuart Everett even in death and greatly increased the pain suffered by Stuart Everett's family when the murder came to light.\" Mr Everett's family initially had no idea he was dead as Majerkiewicz had assumed use of his finances and his mobile phone, even sending text messages and a birthday card to his relatives purporting to be from Mr Everett. The court heard that, while former civil servant Mr Everett was murdered overnight between 27 and 28 March last year, police were only alerted after his torso was found at Kersal Dale nature reserve in Salford on 4 April. Police scoured CCTV and found that two days before the discovery, a man entered the wooded area carrying a heavy blue bag and left shortly after without it. His identity was unknown. But three weeks later, Majerkiewicz was spotted by an officer working on the case who drove past him by chance and noticed his resemblance to the man from the CCTV.  When police searched Majerkiewicz's address, they found evidence of blood on a carpet and furniture and an attempted clean-up after the killing and dismemberment. After discovering the torso, police launched Operation Harker, which found evidence at 15 crime scenes and human remains at five different sites. Only a third of Mr Everett's body has been recovered. Mr Everett had worked for the NHS and the Department for Work and Pensions. He was known to his family as Benny. His brother Richard Ziemacki, in a victim impact statement read to the court, said: \"It's extremely difficult to put into words how much I miss him. Seeing my brother on CCTV and listening to his voice for the last time will be moments that will live with me forever - I have no words other than absolutely horrendous. \"Every day we have sat watching in disbelief as the evidence unfolded and clearly shown the way my brother's end had been planned and orchestrated by an incredibly devious, monstrous individual.\""
    },
    {
        "title": "At least 144 killed in Myanmar after earthquake - as 100 missing in Bangkok skyscraper collapse",
        "description": "At least 144 people have been killed and 730 others injured in Myanmar following a powerful earthquake, according to the head of the country's military government.",
        "url": "https://news.sky.com/story/at-least-144-killed-in-myanmar-after-earthquake-as-100-missing-in-bangkok-skyscraper-collapse-13337081",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-earthquake-thailand_6869846.jpg?20250328204539",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-28 06:37:00",
        "Headline": "Myanmar has declared a state of emergency in the affected regions after the earthquake struck while the country is in the grip of a civil war.",
        "Content": " At least 144 people have been killed and 730 others injured in Myanmar following a powerful earthquake, according to the head of the country's military government. \"The death toll and injuries are expected to rise,\" Senior General Min Aung Hlaing said on television. The 7.7 magnitude quake struck around 12.50pm local time (6.20am UK time) on Friday at a shallow depth of six miles, with the epicentre about 10 miles from the second city of Mandalay. There were also aftershocks, with one measuring a strong 6.4 magnitude 12 minutes later. Neighbouring Thailand was also rocked by the earthquake, with nine people killed in the capital Bangkok, including eight workers who died after a 33-storey skyscraper, which had been under construction, collapsed. Follow latest updates on Myanmar earthquake Rescuers searching through the rubble of the tower block for survivors have said more than 100 people were missing. Footage showed the high-rise in the Chatuchak area crashing to the ground as people ran away from the scene.  In Myanmar, buildings in five cities and towns collapsed, along with a railway bridge and a road bridge on the Yangon-Mandalay Expressway, state media reported. Images showed the destroyed Ava Bridge over the Irrawaddy River, with its arches leaning into the water. A rescue worker from the Moe Saydanar charity group said it had retrieved at least 60 bodies from monasteries and buildings in Pyinmanar, near the capital Naypyidaw, and more people were trapped. 'Building collapsed in front of my eyes' \"We all ran out of the house as everything started shaking,\" a Mandalay resident said. \"I witnessed a five-storey building collapse in front of my eyes. Everyone in my town is out on the road and no one dares to go back inside buildings.\" Another Mandalay resident said destruction stretched across the whole city, and one neighbourhood, Sein Pan, was on fire. Roads were damaged, phone lines disrupted and there was no electricity, they said. Other eyewitnesses said three people died while praying when a mosque partially collapsed in the Bago Region. Images have also emerged of a destroyed temple in Naypyidaw. Meanwhile, local media has reported that at least two people died and 20 were injured after a hotel collapsed in Aung Ben. Civil war in Myanmar The natural disaster comes as the country is in the grip of a civil war. The ruling military junta said a state of emergency has been declared in Sagaing Region, Mandalay Region, Magway Region and northeastern Shan State, Nay Pyi Taw Council Area, and Bago Region. The junta added in a statement: \"The government has ordered a rapid investigation of the damage in these areas, We will carry out relief and relief operations promptly. We will also work to provide necessary disaster relief and humanitarian assistance.\" Read more:Bangkok felt like a city caught off guardEyewitnesses describe earthquake hitting Myanmar and Bangkok By Cordelia Lynch, Asia correspondent, in Bangkok I was in the office in Bangkok at around 1.30pm when I felt the tremors. Lights start to swing, the windowpanes shook and people rushed downstairs to evacuate the building. The prime minister has established a \"war room\"- a very rare move, to help respond to the impact of the tremors. The damage in Myanmar appears far worse though.\n And this in a country ravaged by civil war. Getting information from there is very challenging. Getting aid into affected areas will be too. The Red Cross has said downed power lines are adding to challenges for their teams trying to reach Mandalay and Sagaing regions and southern Shan state. Tremors also affected Laos, Vietnam, and Bangladesh. Science and technology editor The world's highest mountain range - the Himalayas - is testament to the power of plate tectonics. Forced upwards by the gradual northward push of the Indian plate into the Eurasian plate.\n It's a power that's almost impossible to imagine until just a tiny fraction of it is suddenly released. And that's what happened just six miles beneath the feet of 1.2 million people living in the city of Mandalay and surrounding settlements. A fault line along that Indian-Eurasian plate boundary runs almost directly beneath the city. Over decades, as the plates grind past each other, tension builds up in the subsurface rock. When it finally gives, an earthquake is the result. Such strike-slip faults as they're known don't generate the world's most powerful earthquakes. That dubious honour goes to subduction zones in places like Sumatra and Japan that generate the magnitude 9 earthquakes that caused the Boxing Day tsunami of 2004 or the Tohoku tsunami of 2011.   A magnitude 7.7 quake is still extremely powerful and destructive if it occurs shallow in the Earth's crust and close to population centres. This did both. Recent history has an important role to play too. Large earthquakes in this region happen every decade or so. But the last one of this size in the Sagaing region was in 1946. That pre-dates the development of modern earthquake building codes. Reconstruction in Mandalay and beyond after that event will have resulted in buildings vulnerable to collapse from shaking of this magnitude and possibly already weakened by previous events. Meanwhile, hundreds of people poured out of buildings in Bangkok after the tremors, with many buildings evacuated. The city is home to 17 million people and many live in high-rise apartments. Alarms went off in buildings as the earthquake hit. Footage on social media has shown water being thrown down the side of buildings from rooftop swimming pools. All flights in and out of Bangkok are operating normally following the earthquake, the country's civil aviation department said on Friday."
    },
    {
        "title": "Bangkok felt like a city caught off guard when chaos erupted with earthquake",
        "description": "Bangkok felt like it erupted into chaos when the tremors hit.",
        "url": "https://news.sky.com/story/bangkok-felt-like-a-city-caught-off-guard-when-chaos-erupted-with-earthquake-13337432",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bangkok-skyscraper_6869694.jpg?20250328181910",
        "type": "World",
        "Author": "Cordelia Lynch",
        "Date Published": "2025-03-28 17:29:00",
        "Headline": "Many will no doubt continue to press the government on why there was no emergency alert system, no texts, nothing. Not for hours after, at least.",
        "Content": "\n          Asia correspondent\n              @CordeliaSkyNews\n  Bangkok felt like it erupted into chaos when the tremors hit. No one knew what was happening and there was no warning. In a city where lives are lived, there were suddenly incongruous sights in the sky - pools overflowing, high-rise walkways connecting expensive apartments broken apart, and huddles of confused and scared people outside offices. The busy skytrain that millions rely on in Thailand's capital was shut down, bringing the city to a grinding halt and people struggling to move around. Read more: Dozens die in Myanmar quake - as 100 missing in Bangkok  My producer Rachael and I had to share a motorbike to try and get to the scene of the worst building collapse - a slow route through gridlocked traffic. On arrival, the devastation was clear. A mass of rubble, a sea of rescue workers, and panicked onlookers. \n                  Naples residents 'shaken awake' by strongest earthquake in 40 years\n                 \n                  Greece declares state of emergency on Santorini after earthquakes\n                 \n                  Buildings in Vanuatu damaged and casualties reported as magnitude 7.3 earthquake hits South Pacific island nation\n                 We were told that 90 construction workers were still trapped inside. One of the men trying to rescue them told me he had heard some voices and was hopeful they would be able to pull people out alive. But he acknowledged it was \"very difficult\" work and, as he spoke, we were engulfed with dust, the light already fading as specialist bulldozers were brought in. Many of those inside, we were told, were Cambodians about to finish building the structure.  Why no warnings? As the rescue effort continued, Thailand's Prime Minister Paetongtarn Shinawatra suddenly arrived. I asked her why there were no warnings - in a nation that 20 years ago suffered a devastating earthquake. She did not respond. But many will no doubt continue to press her government on why there was no emergency alert system, no texts, nothing. Not for hours after, at least. Read more from Sky News:Latest updates on earthquakeEyewitnesses describe quake hitting Myanmar and Bangkok On the ground, Bangkok felt like a city caught off guard. There are now fears of aftershocks - as the government moves quickly to try and reassure its people there will be warnings next time. But in a place where the skyline is dominated by high-rise apartments, buildings and offices, there is a feeling of vulnerability now. And there are questions about the integrity of their structures and what can be done to protect a population of more than 17 million people."
    },
    {
        "title": "JD Vance hits out at Denmark during Greenland visit after Donald Trump says US 'needs' the island",
        "description": "JD Vance has told Denmark it has \"not done a good job\" with Greenland during a visit to the territory - as President Donald Trump repeated his call for the US to take over the island.",
        "url": "https://news.sky.com/story/jd-vance-hits-out-at-denmark-during-greenland-visit-after-donald-trump-says-us-needs-the-island-13337419",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-jd-vance_6869749.jpg?20250328210942",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-28 17:21:00",
        "Headline": "During a visit to a US military base on Greenland, the vice president says \"we need to ensure that America is leading in the Arctic\".",
        "Content": " JD Vance has told Denmark it has \"not done a good job\" with Greenland during a visit to the territory - as President Donald Trump repeated his call for the US to take over the island. Vice President Vance, his wife Usha and other senior US officials arrived at an American military base in Greenland, the semi-autonomous territory that has been a part of Denmark for more than 600 years. Follow latest: Key takeaways from Vance's speech in Greenland \"Our message to Denmark is very simple: you have not done a good job by the people of Greenland,\" Mr Vance said. \"You have underinvested in the people of Greenland, and you have underinvested in the security architecture of this incredible, beautiful landmass filled with incredible people. \"We need to ensure that America is leading in the Arctic.\" Shortly before Mr Vance spoke from Greenland on Friday, Mr Trump continued his threats of taking over the territory, saying: \"We need Greenland, very importantly, for international security. \"We have to have Greenland. It's not a question of you think we can do without it - we can't.\"  Lars-Christian Brask, deputy speaker of the Danish parliament, told Sky News that Mr Vance was \"not welcome\" by Greenlanders on his visit. \"It's a NATO country demanding a piece of another NATO country, which is highly unusual and there is a lack of respect,\" he said. The one-day visit to the US Space Force outpost at Pituffik - located on the northwest coast of the territory - has avoided violating potential diplomatic taboos of a state sending a delegation to another country, without an invitation. The trip had been scaled back after locals were angered that the original itinerary was made without consulting them - particularly in light of Mr Trump's repeated claims that the US should control Greenland. Speaking to soldiers at the US base, Mr Vance claimed Denmark - and Europe by extension - has failed to protect the region. He said: \"This place, this base, this surrounding area, is less secure than it was 30-40 years ago, as some of our allies have not kept up... \"Europe (has) not kept pace... with military spending, and Denmark has not kept pace in devoting the resources necessary to keep this base, to keep our troops, and in my view to keep the people of Greenland safe from a lot of aggressive incursions from Russia, China, and other nations.\" Mr Vance said Mr Trump was \"a president of peace\", adding: \"We respect the self-determination of Greenlanders, we believe in the self-determination of the population of Greenland.\" Asked if plans have been drafted to use military force to take over Greenland, he indicated the White House planned to wait for the people of the territory to vote for self-determination before acting. \"What the president has said... is that we need to have more of a position in Greenland,\" he added. Read more:Analysis: Vance felt the cold but had no warm wordsAnalysis: How Greenlanders view Trump's threatsWhy does Trump want to take over Greenland?Russia and America's Arctic plans another challenge for Europe Greenland is the world's largest island, with a population of 57,000, and is also a founding member of NATO. Straddling the Arctic circle between the US, Russia and Europe, the island offers a unique geopolitical advantage that America has eyed for more than 150 years. Earlier this week, Russian President Vladimir Putin said he was not surprised the US wants control of Greenland given its long-time interest in the mineral-rich territory. \"It can look surprising only at first glance and it would be wrong to believe that this is some sort of extravagant talk by the current US administration,\" Mr Putin said."
    },
    {
        "title": "JD Vance felt the cold in Greenland but he had no warm words for European allies",
        "description": "\"It's cold as s*** here,\" said the US vice president when he touched down in Greenland.",
        "url": "https://news.sky.com/story/jd-vance-felt-the-cold-in-greenland-but-he-had-no-warm-words-for-european-allies-13337663",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jd-vance-united-states_6869969.jpg?20250328235308",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-03-28 23:37:00",
        "Headline": "There was no warm welcome for JD Vance and the Second Lady in Greenland, Sky's David Blevins reports.",
        "Content": "\n          News correspondent\n              @skydavidblevins\n  \"It's cold as s*** here,\" said the US vice president when he touched down in Greenland. He meant it, both literally and metaphorically. There was no warm welcome from islanders for JD Vance and the second lady. A small US team with a list of engagements evolved into a large delegation and just one engagement. Everything changed when the organisers of a dogsled race, an annual spectacle on the cultural calendar, said the Americans weren't invited. The scaled-up US delegation and scaled-down schedule did little to address the concerns of Greenlanders. The White House didn't just send the vice president, they sent embattled national security advisor Mike Waltz too. \n                  Threat of Russia and America exploiting the Arctic another challenge for Europe\n                 \n                  JD Vance and wife due in Greenland as Putin warns US threat to take over not 'extravagant talk'\n                 \n                  JD Vance announces trip to Greenland and accuses Denmark of ignoring island 'for far too long'\n                 Instead of being greeted by residents, they were greeted by their own troops manning an outpost tasked with warning them about long-range missile attacks. And the vice president, who's fast becoming the chief critic of Europe, made Denmark the focus of his attack. But listen carefully to his speech and you'll hear the same word twice: \"think\". \"This is what we think is going to happen\" re. their hopes islanders will vote for independence from Denmark and then engage with America. \"We do not think military action will be necessary,\" he added, when asked about that potential.  There is a world of difference between thinking something and knowing something. So, what happens if what JD Vance \"thinks\" will or won't happen doesn't come to pass? Read more:How Greenlanders view Trump's threatsWhy does Trump want to take over Greenland?Russia and America's Arctic plans another challenge for Europe Back in Washington DC, the president of the United States gave the answer. \"It's not a question about whether we can do without it (Greenland). We can't,\" he said. And Donald Trump has never ruled out taking the island by force."
    },
    {
        "title": "Threat of Russia and America exploiting the Arctic another challenge for Europe",
        "description": "Two events this week will give Greenland and friends in Europe a juddering sense of alarm.&#160;",
        "url": "https://news.sky.com/story/threat-of-russia-and-america-exploiting-the-arctic-another-challenge-for-europe-13337160",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jd-vance-greenland_6869905.jpg?20250328214450",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-28 11:07:00",
        "Headline": "Both President Trump and his vice president say America needs Greenland for security. This seems disingenuous. There are no hostile fleets circling the Arctic territory whatever they claim.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Two events this week will give Greenland and friends in Europe a juddering sense of alarm.  From the West, the US vice president JD Vance has landed for a controversial visit, despatched by a president openly talking of annexation. From the East a speech from a Russian leader hinting at carving up the Arctic and its vast mineral wealth with Moscow's new friends in Washington. In a closely watched speech, Vladimir Putin seemed to give Donald Trump's plans to seize Greenland the green light. They were \"serious\", he said, and \"have deep historical roots\". Kremlin officials went further saying Russia was open to cooperating with America to exploit the Arctic with \"joint investment\". The Arctic is a huge prize. Its vast mineral wealth is increasingly accessible thanks to climate change. Russia is well placed to exploit it with bases and ports ringing the Arctic Circle. Mr Putin though warned that \"NATO countries in general are increasingly designating the Far North as a springboard for possible conflicts\". This would appear to be a warning to European nations to back off. Yet another challenge for Europe The threat of Russia and America jointly exploiting the Arctic in a great power carve-up is yet another challenge for Europe in this new Trumpian world order. And Greenland is caught in the middle. Mr Trump has said he thinks the American annexation of Greenland \"will happen\".  He said so with breezy nonchalance in front of NATO's secretary general in the White House as if taking another alliance member's territory was entirely normal. Astonishingly NATO secretary general Mark Rutte did not push back at the idea. Read more:Why does Trump want to take over Greenland?Donald Trump says he thinks US will annex Greenland Both President Trump and his vice president say America needs Greenland for security. This seems disingenuous. There are no hostile fleets circling the Arctic territory whatever they claim. Besides, America already has a military base there and could ask to build more. Mr Vance also says Denmark has neglected Greenland. Denmark actually subsidises the territory to the tune of £480m a year. In reality, what the Trump administration seeks in Greenland is what it seems to seek in Ukraine. Mineral wealth. When we visited this month, Greenlanders told Sky News Mr Trump's threats are little more than a gangster shakedown. A menacing threat designed to extract material gain. There is no appetite for an American takeover among Greenlanders. And no enthusiasm for the vice president and his wife. US officials were reportedly going door to door this week asking if anyone would like to meet America's second lady. None said yes. The Vances have had to downscale their visit, and have only gone to the US base at Pittufik. But it seems the Trump administration is determined one way or another to acquire more territory and Greenland seems top of the list. And its president may have been persuaded by Mr Putin it is in his best interests to share the world with Russia, whatever that means for America's allies. That is a challenge they will need to meet."
    },
    {
        "title": "Gaza's orphans have lost everything - even the dream of growing up",
        "description": "The number of children killed in Gaza, according to the local health ministry,&#160;recently&#160;rose above 15,000.",
        "url": "https://news.sky.com/story/gazas-orphans-have-lost-everything-even-the-dream-of-growing-up-13337030",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-gaza-israel-hamas-palestine_6869110.jpg?20250327235717",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "Five-year-old Jenin liked to dance, like so many other five-year-old girls around the world. She danced until the war came to her home, killing 25 members of her family including her father and all of her brothers and sisters.",
        "Content": "\n          Middle East correspondent\n              @AliBunkallSKY\n  The number of children killed in Gaza, according to the local health ministry, recently rose above 15,000. Fatality figures in Gaza are disputed by Israel, but even allowing for miscalculation or exaggeration, it is a staggering loss of life. Many children have been orphaned, losing not just both parents but also siblings, grandparents and other close relatives too. Against this tragedy, the children of Gaza can't dream of growing up. War has robbed them of that. 'I just want to forget' \"I'm here hanging out with my friends because I just want to forget the war,\" says Osama, whose family was killed. \n                  Anti-Hamas chants heard at rare protest in Gaza\n                 \n                  What happened to the Israel-Hamas ceasefire - and could there be another one?\n                 \n                  Starmer expresses 'deep concern' about lack of humanitarian aid in Gaza\n                 \"I look at my destroyed home there and think about the memories I had there with my mum and dad, in their room. And now it's gone,\" he says, surrounded by other young boys, probably no older than 10. \"We used to have fun every day, sit in the kitchen, play together at home, and now it's all gone. \"I want to forget everything. I want to have fun.\" Israel continues to bombard Gaza On Thursday, Egypt sent a delegation to Qatar in an attempt to push for a renewed ceasefire. Israel's Prime Minister Benjamin Netanyahu met with senior security officials on Thursday night to discuss developments. For now, Israel is continuing to attack Gaza daily and is refusing to lift a blockade on aid entering the Strip. The United Nations has reported that cases of malnutrition among children in northern Gaza have almost doubled as a result. Hundreds of children have also been killed since the resumption of attacks almost two weeks ago. She danced until the war came home Five-year-old Jenin liked to dance, like so many five-year-old girls around the world liked to dance. She danced in the tent where her family was sheltering from the war nearby and she danced until the day that the war came home. It was early in the morning when the missile struck - the family was getting ready for Suhoor, the Ramadan breakfast. Twenty-five of Jenin's relatives were killed, including her father and all of her brothers and sisters. Her mother was already dead, killed in a previous strike. Jenin now lies in a hospital bed, still unaware she has lost her family. She is mostly unconscious - her skull fractured, she has bleeding on her brain and is in desperate need of surgery she cannot get in Gaza. \"She's truly lost all sense of safety. She's terrified by anyone who comes near her,\" Jenin's aunt told Sky News. \"Jenin has lost the ability to speak. The shock was so severe that she can no longer communicate verbally.\" She went on: \"Instead, she points and gestures, but words elude her. Most of the time, she is angry and throws things around; her emotional state is drained. \"Sometimes she responds, but other times she doesn't. When she looks at us, there's a visible frustration in her eyes -frustration from not being able to see her mum.\" Another family that didn't survive the night In Gaza City, our team filmed another family that didn't survive the night. Rescuers searched for survivors but pulled out the bodies of four people. Twelve-year-old Sameer was the only one to escape the strike. He sobbed in silent prayer next to the wrapped corpses of his parents and siblings. Another orphan in Gaza. \"One of my favourite memories with my family was a day at the beach,\" he told us. \"We swam and played and had such a good time. I remember my brother walking back and spilling juice on himself. We laughed and told him off!\" Read more:What happened to Israel-Hamas ceasefire?Anti-Hamas chants heard at rare protest in Gaza His family was buried together, side-by-side in a shallow grave. Sameer, the one who lived, watched on, silent and lost. \"I wasn't scared before, because I had my family around me. Right now, I am scared to lose more people. My mum and dad and everyone were martyred. I'm worried about losing more people. So now whenever I hear the planes above, I think they're going to bomb me in my home.\" There is no word for someone who has lost so much. But in Gaza, there are so many children who have lost everything. Their childhood, their families, their future."
    },
    {
        "title": "Who is MAGA's most aggressive loyalist Marjorie Taylor Greene?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/who-is-magas-most-aggressive-loyalist-marjorie-taylor-greene-13337393",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marjorietaylorgreene_6869596.jpg?20250328163223",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-28 16:32:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 US congresswoman Marjorie Taylor Greene hit the headlines this week when she told Sky's US correspondent Martha Kelner to \"go back to your own country\".  It was the latest controversy in a political career for the Republican firebrand - a staunch supporter of US President Donald Trump and his Make America Great Again (MAGA) movement.  But who is she and how influential has she become? Host Jonathan Samuels speaks to Tia Mitchell, Washington bureau chief for The Atlanta Journal-Constitution, who has been covering Ms Taylor Greene since she first entered politics five years ago. She tells us what she's like in person, how she emerged and her most controversial moments. Producer: Emma Rae Woodhouse Editor: Paul Stanworth & Philly Beaumont"
    },
    {
        "title": "Israel strikes Beirut for first time since ceasefire deal agreed with Hezbollah",
        "description": "Israel has carried out a strike on Beirut for the first time since it agreed a ceasefire deal with Hezbollah in November.",
        "url": "https://news.sky.com/story/israel-strikes-beirut-for-first-time-since-ceasefire-deal-agreed-with-hezbollah-13337236",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-lebanese-beirut-israel-airstrike_6869553.jpg?20250328150536",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-28 11:54:00",
        "Headline": "The Israeli military, which warned people in Arabic to leave their homes, says the strike targeted infrastructure storing drones that were used by Hezbollah in the city's southern suburbs, where the militant group has a strong presence.",
        "Content": " Israel has carried out a strike on Beirut for the first time since it agreed a ceasefire deal with Hezbollah in November. The Israeli military says the strike targeted a Hezbollah drone storage facility in Dahiyeh, in the city's southern suburbs, which it called a key Hezbollah stronghold and where support for the militant group is strong. Israel's army used a post on X in Arabic to urgently warn people to evacuate parts of a Beirut suburb on Friday as it vowed to retaliate against strikes that it said were launched from Lebanon into northern Israel. Hezbollah denied firing the rockets at northern Israel, and accused Israel of seeking a pretext to continue attacking Lebanon. Lebanon's government ordered all schools and universities in Beirut's southern suburb of Hadath to close for the day. Shooting could be heard in some parts of the southern suburbs, warning people to leave their homes, and many residents were seen fleeing the area in cars and on foot. Associated Press reporters in Beirut said they heard a large boom and saw smoke rising from where Israel's military had said it would strike, a residential and commercial area containing at least two schools. \n                  At least 144 killed in Myanmar after earthquake - as 100 missing in Bangkok skyscraper collapse\n                 \n                  Bangkok felt like a city caught off guard when chaos erupted with earthquake\n                 \n                  Moment building collapses in Bangkok earthquake\n                 Though it's the first Israeli strike on Beirut since November's ceasefire with the Hezbollah militant group, Israel has struck targets in southern Lebanon almost daily since then. Israel's defence minister, Israel Katz, said on Friday that if there was no peace in Israel's northern communities, there would be no peace in Beirut either. Hezbollah began launching rockets, drones, and missiles into Israel the day after Hamas's 7 October 2023 attack on southern Israel. In September, Israel carried out waves of airstrikes and killed most of Hezbollah's senior leaders as the bubbling conflict became an all-out war. More than 4,000 people in Lebanon died, while around 60,000 Israelis were displaced. Under the ceasefire that halted the fighting, Israeli forces were supposed to withdraw from all Lebanese territory by late January. The deadline was extended to 18 February, but Israeli troops have remained in five locations in Lebanon across from communities in northern Israel. Meanwhile, Israel has carried out dozens of airstrikes on southern and eastern Lebanon, saying it attacked Hezbollah, while continuing drone attacks that have killed several members of the militant group. Israeli strikes in the southern Lebanese village of Kfar Tibnit on Friday killed three people and injured 18, including children and women, Lebanon's health ministry said. Middle East correspondent It’s unclear who fired two missiles at northern Israel earlier – Hezbollah insists it wasn’t them, and the IDF hasn’t directly blamed the group. That suggests it could be someone else, perhaps factions of Hamas – but Israel is holding Hezbollah accountable for any actions along the border.\n Both Israel and Lebanon blame the other for violating the ceasefire, and Lebanon’s president has called on the US and France to intervene, as both are sponsors of the deal, which was agreed in November. Israel is right to call the firing of missiles across the border a breach, but despite the truce, it has been hitting targets in Lebanon regularly, and that could also be deemed a violation. \n Friday's bombing of Beirut was limited and targeted, and a warning was sent beforehand for civilians to evacuate the area. \n\n That suggests Israel is trying to escalate the message it sends but, at the same time, avoiding actions that might result in the ceasefire collapsing.\n The new government in Lebanon and the armed forces are still struggling to get overall security control of southern Lebanon, but it is in Israel's interests to give them a chance to do so. \n Hezbollah has been severely weakened militarily by Israel’s invasion last year, but only the Lebanese government can reduce their political influence within the country.\n With the fighting resumed in Gaza and almost daily Houthi missile attacks on Israel now, Washington is unlikely to encourage a return to conflict in Lebanon too. Six people died in Israeli airstrikes on several locations in Lebanon last week. The UN special co-ordinator for Lebanon, Jeanine Hennis-Plasschaert, said the escalation was deeply concerning, calling it a \"critical period for Lebanon and the wider region\". According to an Israeli official who was not authorised to speak to the media, Israeli Prime Minister Benjamin Netanyahu was meeting top security officials to discuss an impending strike on the capital. The escalation came as Israel ended its ceasefire with Hamas by launching a surprise wave of strikes that killed hundreds of people in Gaza. Read more:Oscar winner 'detained and beaten up'What happened to Israel-Hamas ceasefire? Earlier this month, Israel halted deliveries of food, fuel, medicine, and humanitarian aid to Gaza's roughly two million Palestinians. Israel has vowed to escalate the war until Hamas returns 59 hostages it still holds - 24 of them believed to be alive. Israel is demanding that the group give up power, disarm, and send its leaders into exile. Hamas has said it will release the remaining captives only in exchange for Palestinian prisoners, a lasting ceasefire, and an Israeli withdrawal from Gaza."
    },
    {
        "title": "Diego Maradona was in agony in the hours before his death, court hears",
        "description": "Diego Maradona was in \"agony\" in the hours before his death, a court has heard.",
        "url": "https://news.sky.com/story/diego-maradona-was-in-agony-in-the-hours-before-his-death-court-hears-13337040",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-diego-maradona-maradona_6704435.jpg?20241002194646",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-28 01:53:00",
        "Headline": "Seven healthcare professionals have gone on trial for manslaughter after being accused of failing to provide footballing legend Diego Maradona with adequate care.",
        "Content": "Diego Maradona was in \"agony\" in the hours before his death, a court has heard. The 1986 World Cup winner, one of football's greatest-ever players, died in a house outside Buenos Aires in November 2020 following a cardiac arrest. He was 60. Seven healthcare professionals, including a neurosurgeon, a psychiatrist and medical staffers, have gone on trial for manslaughter after being accused of failing to provide Maradona with adequate medical care. One of the experts who performed a post-mortem examination on Maradona spoke in front of the court on Thursday. He said the Argentinian suffered agony for at least 12 hours before death and added \"any doctor\" should have noticed his symptoms days earlier. Carlos Cassinelli, director of forensic medicine at the Scientific Police Superintendency, on Thursday provided details of the post-mortem performed on the day of Maradona's death. \"The heart was completely covered in fat and blood clots, which indicate agony,\" he said. Mr Cassinelli added: \"This is a patient who had been collecting water over the days; that's not acute. \"This was something that was foreseeable. \"Any doctor examining a patient would find this.\" The post-mortem concluded that Maradona died from acute pulmonary edema secondary to congestive heart failure. The trial could last up to four months, with three hearings held a week. Read more from Sky News:Europe divided on Ukraine armed deploymentKing Charles temporarily hospitalisedFive people wounded in Amsterdam stabbing If found guilty, the defendants, who all deny the allegations against them, could be jailed for 25 years. Among the accused are Leopoldo Luque, Maradona's personal physician for the last four years of his life, and psychiatrist Agustina Cosachov, who prescribed medication that Maradona took until the time of his death. Along with them, psychologist Carlos Diaz, coordinator of the medical company hired to care for him during his hospitalisation, Nancy Forlini, representative of the company that rendered nursing service, Mariano Perroni, Dr Pedro Di Spagna, who monitored his treatment, and nurse Ricardo Almiron are also standing trial. Gisela Madrid, a nurse who was also indicted, will be tried by a jury later this year."
    },
    {
        "title": "Dani Alves cleared of rape by Spanish court after appealing conviction",
        "description": "Former Brazilian football player Dani Alves has had a rape conviction against him quashed upon appeal.",
        "url": "https://news.sky.com/story/dani-alves-cleared-of-rape-by-spanish-court-after-appealing-conviction-13337203",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alves-football_6869356.jpg?20250328111417",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-28 10:47:00",
        "Headline": "The former Barcelona player has been cleared upon appeal of raping a woman in a bathroom at an upscale Barcelona nightclub early on New Year's Eve in 2022.",
        "Content": "Former Brazilian football player Dani Alves has had a rape conviction against him quashed upon appeal. The top court in Spain's Catalonia region said it overturned the original ruling in Alves' case saying it had presented \"inconsistencies and contradictions\". The former Barcelona player was found guilty of sexual assault in February last year and was sentenced to four years and six months in prison. He denied wrongdoing during the three-day trial. It was ruled that Alves raped the victim in a bathroom at an upscale Barcelona nightclub early on New Year's Eve in 2022. On Friday, the top court in Catalonia ruled that there was \"insufficient evidence\" to rule out Alves' presumption of innocence. In the judges' ruling, they wrote that the testimony of the victim \"differed notably\" from evidence of video footage taken before the woman and Alves entered the bathroom where she said he forced her to have sex without her consent. In March last year, Alves paid €1m (then £930,000) in bail to be released from prison while appealing the rape conviction. The former Barcelona footballer paid the sum and handed over his Brazilian and Spanish passports after prosecutors had argued he was a flight risk. Alves, now 41, had before that been kept in jail from January 2023 until March 2024. He may now leave the country as the appeal court lifted all travel restrictions. Read more from Sky News:Do Americans care about the leaked military chat?What Labour is doing to keep the welfare rebels quiet The decision can still be appealed before Spain's Supreme Court. The Alves trial was the first high-profile case since Spain overhauled its laws in 2022 to make consent central to defining a sex crime in response to an increase in protests after a gang-rape case during the San Fermin bull-running festival in Pamplona in 2016. The legislation popularly known as the \"only yes means yes\" law defines consent as an explicit expression of a person's will, making it clear that silence or passivity do not equal consent."
    },
    {
        "title": "JD Vance hits out at Denmark during Greenland visit after Donald Trump says US 'needs' the island",
        "description": "JD Vance has told Denmark it has \"not done a good job\" with Greenland during a visit to the territory - as President Donald Trump repeated his call for the US to take over the island.",
        "url": "https://news.sky.com/story/jd-vance-hits-out-at-denmark-during-greenland-visit-after-donald-trump-says-us-needs-the-island-13337419",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-greenland-jd-vance_6869749.jpg?20250328210942",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-28 17:21:00",
        "Headline": "During a visit to a US military base on Greenland, the vice president says \"we need to ensure that America is leading in the Arctic\".",
        "Content": " JD Vance has told Denmark it has \"not done a good job\" with Greenland during a visit to the territory - as President Donald Trump repeated his call for the US to take over the island. Vice President Vance, his wife Usha and other senior US officials arrived at an American military base in Greenland, the semi-autonomous territory that has been a part of Denmark for more than 600 years. Follow latest: Key takeaways from Vance's speech in Greenland \"Our message to Denmark is very simple: you have not done a good job by the people of Greenland,\" Mr Vance said. \"You have underinvested in the people of Greenland, and you have underinvested in the security architecture of this incredible, beautiful landmass filled with incredible people. \"We need to ensure that America is leading in the Arctic.\" Shortly before Mr Vance spoke from Greenland on Friday, Mr Trump continued his threats of taking over the territory, saying: \"We need Greenland, very importantly, for international security. \"We have to have Greenland. It's not a question of you think we can do without it - we can't.\"  Lars-Christian Brask, deputy speaker of the Danish parliament, told Sky News that Mr Vance was \"not welcome\" by Greenlanders on his visit. \"It's a NATO country demanding a piece of another NATO country, which is highly unusual and there is a lack of respect,\" he said. The one-day visit to the US Space Force outpost at Pituffik - located on the northwest coast of the territory - has avoided violating potential diplomatic taboos of a state sending a delegation to another country, without an invitation. The trip had been scaled back after locals were angered that the original itinerary was made without consulting them - particularly in light of Mr Trump's repeated claims that the US should control Greenland. Speaking to soldiers at the US base, Mr Vance claimed Denmark - and Europe by extension - has failed to protect the region. He said: \"This place, this base, this surrounding area, is less secure than it was 30-40 years ago, as some of our allies have not kept up... \"Europe (has) not kept pace... with military spending, and Denmark has not kept pace in devoting the resources necessary to keep this base, to keep our troops, and in my view to keep the people of Greenland safe from a lot of aggressive incursions from Russia, China, and other nations.\" Mr Vance said Mr Trump was \"a president of peace\", adding: \"We respect the self-determination of Greenlanders, we believe in the self-determination of the population of Greenland.\" Asked if plans have been drafted to use military force to take over Greenland, he indicated the White House planned to wait for the people of the territory to vote for self-determination before acting. \"What the president has said... is that we need to have more of a position in Greenland,\" he added. Read more:Analysis: Vance felt the cold but had no warm wordsAnalysis: How Greenlanders view Trump's threatsWhy does Trump want to take over Greenland?Russia and America's Arctic plans another challenge for Europe Greenland is the world's largest island, with a population of 57,000, and is also a founding member of NATO. Straddling the Arctic circle between the US, Russia and Europe, the island offers a unique geopolitical advantage that America has eyed for more than 150 years. Earlier this week, Russian President Vladimir Putin said he was not surprised the US wants control of Greenland given its long-time interest in the mineral-rich territory. \"It can look surprising only at first glance and it would be wrong to believe that this is some sort of extravagant talk by the current US administration,\" Mr Putin said."
    },
    {
        "title": "JD Vance felt the cold in Greenland but he had no warm words for European allies",
        "description": "\"It's cold as s*** here,\" said the US vice president when he touched down in Greenland.",
        "url": "https://news.sky.com/story/jd-vance-felt-the-cold-in-greenland-but-he-had-no-warm-words-for-european-allies-13337663",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jd-vance-united-states_6869969.jpg?20250328235308",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-03-28 23:37:00",
        "Headline": "There was no warm welcome for JD Vance and the Second Lady in Greenland, Sky's David Blevins reports.",
        "Content": "\n          News correspondent\n              @skydavidblevins\n  \"It's cold as s*** here,\" said the US vice president when he touched down in Greenland. He meant it, both literally and metaphorically. There was no warm welcome from islanders for JD Vance and the second lady. A small US team with a list of engagements evolved into a large delegation and just one engagement. Everything changed when the organisers of a dogsled race, an annual spectacle on the cultural calendar, said the Americans weren't invited. The scaled-up US delegation and scaled-down schedule did little to address the concerns of Greenlanders. The White House didn't just send the vice president, they sent embattled national security advisor Mike Waltz too. \n                  Threat of Russia and America exploiting the Arctic another challenge for Europe\n                 \n                  JD Vance and wife due in Greenland as Putin warns US threat to take over not 'extravagant talk'\n                 \n                  JD Vance announces trip to Greenland and accuses Denmark of ignoring island 'for far too long'\n                 Instead of being greeted by residents, they were greeted by their own troops manning an outpost tasked with warning them about long-range missile attacks. And the vice president, who's fast becoming the chief critic of Europe, made Denmark the focus of his attack. But listen carefully to his speech and you'll hear the same word twice: \"think\". \"This is what we think is going to happen\" re. their hopes islanders will vote for independence from Denmark and then engage with America. \"We do not think military action will be necessary,\" he added, when asked about that potential.  There is a world of difference between thinking something and knowing something. So, what happens if what JD Vance \"thinks\" will or won't happen doesn't come to pass? Read more:How Greenlanders view Trump's threatsWhy does Trump want to take over Greenland?Russia and America's Arctic plans another challenge for Europe Back in Washington DC, the president of the United States gave the answer. \"It's not a question about whether we can do without it (Greenland). We can't,\" he said. And Donald Trump has never ruled out taking the island by force."
    },
    {
        "title": "Who is MAGA's most aggressive loyalist Marjorie Taylor Greene?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/who-is-magas-most-aggressive-loyalist-marjorie-taylor-greene-13337393",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-marjorietaylorgreene_6869596.jpg?20250328163223",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-28 16:32:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 US congresswoman Marjorie Taylor Greene hit the headlines this week when she told Sky's US correspondent Martha Kelner to \"go back to your own country\".  It was the latest controversy in a political career for the Republican firebrand - a staunch supporter of US President Donald Trump and his Make America Great Again (MAGA) movement.  But who is she and how influential has she become? Host Jonathan Samuels speaks to Tia Mitchell, Washington bureau chief for The Atlanta Journal-Constitution, who has been covering Ms Taylor Greene since she first entered politics five years ago. She tells us what she's like in person, how she emerged and her most controversial moments. Producer: Emma Rae Woodhouse Editor: Paul Stanworth & Philly Beaumont"
    },
    {
        "title": "Trump 100 Day 68: Do Americans care about the leaked chat messages?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-68-do-americans-care-about-the-leaked-chat-messages-13337038",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250325061308",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-28 00:56:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On Day 68, US correspondents James Matthews and Martha Kelner take a temperature check on Donald Trump's first two months in his second term as president.  As Martha's bust-up with Marjorie Taylor Greene goes viral, James hits the road to Virginia to gauge how much voters care about \"Signal-gate\" - the leaked group chat that rocked President Trump's inner circle. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk. Help us understand more about our listeners by taking our survey! 👉 This form 👈 should only take a few minutes to complete, and Sky anonymises the responses as much as possible. Thank you. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Threat of Russia and America exploiting the Arctic another challenge for Europe",
        "description": "Two events this week will give Greenland and friends in Europe a juddering sense of alarm.&#160;",
        "url": "https://news.sky.com/story/threat-of-russia-and-america-exploiting-the-arctic-another-challenge-for-europe-13337160",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jd-vance-greenland_6869905.jpg?20250328214450",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-28 11:07:00",
        "Headline": "Both President Trump and his vice president say America needs Greenland for security. This seems disingenuous. There are no hostile fleets circling the Arctic territory whatever they claim.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Two events this week will give Greenland and friends in Europe a juddering sense of alarm.  From the West, the US vice president JD Vance has landed for a controversial visit, despatched by a president openly talking of annexation. From the East a speech from a Russian leader hinting at carving up the Arctic and its vast mineral wealth with Moscow's new friends in Washington. In a closely watched speech, Vladimir Putin seemed to give Donald Trump's plans to seize Greenland the green light. They were \"serious\", he said, and \"have deep historical roots\". Kremlin officials went further saying Russia was open to cooperating with America to exploit the Arctic with \"joint investment\". The Arctic is a huge prize. Its vast mineral wealth is increasingly accessible thanks to climate change. Russia is well placed to exploit it with bases and ports ringing the Arctic Circle. Mr Putin though warned that \"NATO countries in general are increasingly designating the Far North as a springboard for possible conflicts\". This would appear to be a warning to European nations to back off. Yet another challenge for Europe The threat of Russia and America jointly exploiting the Arctic in a great power carve-up is yet another challenge for Europe in this new Trumpian world order. And Greenland is caught in the middle. Mr Trump has said he thinks the American annexation of Greenland \"will happen\".  He said so with breezy nonchalance in front of NATO's secretary general in the White House as if taking another alliance member's territory was entirely normal. Astonishingly NATO secretary general Mark Rutte did not push back at the idea. Read more:Why does Trump want to take over Greenland?Donald Trump says he thinks US will annex Greenland Both President Trump and his vice president say America needs Greenland for security. This seems disingenuous. There are no hostile fleets circling the Arctic territory whatever they claim. Besides, America already has a military base there and could ask to build more. Mr Vance also says Denmark has neglected Greenland. Denmark actually subsidises the territory to the tune of £480m a year. In reality, what the Trump administration seeks in Greenland is what it seems to seek in Ukraine. Mineral wealth. When we visited this month, Greenlanders told Sky News Mr Trump's threats are little more than a gangster shakedown. A menacing threat designed to extract material gain. There is no appetite for an American takeover among Greenlanders. And no enthusiasm for the vice president and his wife. US officials were reportedly going door to door this week asking if anyone would like to meet America's second lady. None said yes. The Vances have had to downscale their visit, and have only gone to the US base at Pittufik. But it seems the Trump administration is determined one way or another to acquire more territory and Greenland seems top of the list. And its president may have been persuaded by Mr Putin it is in his best interests to share the world with Russia, whatever that means for America's allies. That is a challenge they will need to meet."
    },
    {
        "title": "Do Americans care about the Signalgate leaked military chat?",
        "description": "Caroline County is the kind of quiet place that found its voice in electing Donald Trump.",
        "url": "https://news.sky.com/story/do-americans-care-about-the-signalgate-leaked-military-chat-13337053",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-united-states_6869141.jpg?20250328040309",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-03-28 03:44:00",
        "Headline": "It's been over two months since Donald Trump began his second term in the Oval Office. Have voters grown tired of him or are they more supportive of the Republican than ever?",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Caroline County is the kind of quiet place that found its voice in electing Donald Trump. It's rural and Republican territory, a 90-minute drive from Washington DC, and it backed Trump at the election. Gauging political opinion isn't necessarily easy here, division runs raw in small-town America. As one cafe owner told me, in declining an interview: \"My business is worth more than my opinion.\" Did we find any buyer's remorse among Trump voters? In a word, no. It'll exist, no doubt, and there is enough anecdotal evidence of voters having second thoughts. In Bowling Green, Caroline County, our straw poll - unscientific - found that Signalgate had left a Trump support shaken but not stirred. \n                  Man charged over vandalism at Trump Turnberry golf resort in Scotland\n                 \n                  Trump targets 'improper ideology' of top US museums with executive order\n                 \n                  US pushes for more expansive minerals deal with Ukraine\n                 \"I'm impressed with the agenda,\" said Robert Hayman, who voted for Trump. On Signalgate, he said: \"In my opinion it's a non-story, compared to the misgivings of the previous administration. \"(It's not a big story) to the extent that it has the effect on our safety.\" Patty Roberts, who also voted for Trump, said the Signalgate episode had passed her by. She told me: \"I don't know a whole lot about that. So I would probably refrain from talking about that. I don't watch TV.\" How politics lands with people here depends on who they support and where they get their information. Read more:What are Donald Trump's tariffs?MAGA's most aggressive goes on the attack The response of the Trump administration has been to deny, dispute and deflect from the notion of incompetence surrounding the Signal chat story. Non-Trump supporters were damning in their assessment of the Signalgate episode. Iris Silver told me: \"It just shows you where putting the wrong people in power positions is not a great idea.\" Jeremiah Hirsch, also anti-Trump, told me how the politics of the day weighed on the community. He said: \"We need this thing that we all deserve that's a part of the American dream. I feel in some ways we've lost that.\" For some, Signalgate is a stone-cold scandal, for others not so much. Caroline County is known as the cradle of horse racing. The runners and riders are currently out of season, unlike the politics. In that race, it's a marathon and a sprint."
    },
    {
        "title": "US pushes for more expansive minerals deal with Ukraine",
        "description": "The US is reportedly pushing for a more expansive minerals deal with Ukraine.",
        "url": "https://news.sky.com/story/us-pushes-for-more-expansive-minerals-deal-with-ukraine-13337050",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-vladimir-putin-donald-trump_6853526.jpg?20250328034113",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-28 02:56:00",
        "Headline": "Donald Trump has said he wants a critical minerals deal with Ukraine as a way to recoup some of the money his country has spent aiding Kyiv defending itself against Russia.",
        "Content": "The US is reportedly pushing for a more expansive minerals deal with Ukraine. That's according to three people familiar with the ongoing negotiations, who have spoken to the news agency, Reuters. A deal on Ukraine's critical minerals has emerged as an apparently key stepping stone towards peace since Donald Trump began his second term in the White House. The US president has said he wants to claw back some of the money his country has spent helping Ukraine after Russia invaded it in February 2022. President of Ukraine Volodymyr Zelenskyy travelled to Washington previously to sign a critical minerals deal, but was told to leave the White House after a row erupted with the president and vice president in front of the world's media. On Thursday, Mr Zelenskyy said the US was \"constantly\" changing the terms of the proposed deal, but he added he did not want Washington to think Kyiv was against it. Earlier in the week, he said the US had proposed a \"major\" new deal, and his officials were still reviewing it. The new proposal is still said to include no security guarantee - something Kyiv has said is vital to ensure a stable peace. The new terms go well beyond the deal discussed previously, with treasury secretary Scott Bessent said to be leading negotiations. Trump has claimed the minerals deal will help secure a peace agreement by giving the US a financial stake in Ukraine, therefore discouraging future Russian aggression. Despite Mr Trump having recently spoken about it, the proposal was said to make no mention of the US taking ownership over Ukraine's nuclear power plants. National Security Council spokesperson James Hewitt declined to confirm the terms of the latest proposal, but said: \"The mineral deal offers Ukraine the opportunity to form an enduring economic relationship with the United States that is the basis for long-term security and peace.\" An earlier version of the deal suggested a joint investment fund, where Ukraine would contribute 50% of the proceeds from future profits of the extraction of the state-owned resources. The new proposal says that the US is given first rights to buy resources extracted under the agreement and that it will recoup all the money it has given Ukraine since 2022, in addition to 4% annual interest, all before Ukraine begins to gain access to the fund's profits. Read more:What minerals does Ukraine have?Inside a Ukrainian titanium mine The new proposal was first reported by the Financial Times. It comes as developments are moving quickly elsewhere in regards to news around the war in Ukraine. Here is some of the other latest news: • Russia and Ukraine both this week agreed to a US-organised Black Sea ceasefire;• France's Emmanuel Macron announced plans for an Anglo-French \"reassurance\" force in Ukraine;• Vladimir Putin warned the US was \"serious\" about its intentions over Greenland;• Fighting between the two sides continues."
    },
    {
        "title": "Trump targets 'improper ideology' of top US museums with executive order",
        "description": "Donald Trump has targeted America's best-known museums and charged vice president JD Vance with removing \"improper ideology\" from the institutions.",
        "url": "https://news.sky.com/story/trump-targets-improper-ideology-of-top-us-museums-with-executive-order-13337156",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-smithsonian-washington_6869281.jpg?20250328092647",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-28 09:34:00",
        "Headline": "Vice President JD Vance will be in charge of removing \"improper ideology\" from all areas of the institution, which is partly funded by the US government, in what is being seen as Mr Trump's latest culture wars attack.",
        "Content": "Donald Trump has targeted America's best-known museums and charged vice president JD Vance with removing \"improper ideology\" from the institutions. The president has accused the Smithsonian Institution of promoting \"corrosive ideology\" as well as \"divisive\" and \"race-centred\" ideas. He signed an executive order on Thursday tasking Mr Vance, who serves on the Smithsonian's Board of Regents, with removing \"improper ideology\" from all areas of the institution, which is made up of 21 museums and the National Zoo. The institution is partly funded by the US government. It marks Mr Trump's latest attack on US cultural institutions he believes are too liberal. Mr Trump recently had himself installed as chairman of the Kennedy Center for the Performing Arts and replaced board members with political loyalists. In his executive order, the president said the Smithsonian used to be seen as \"a symbol of American excellence and a global icon of cultural achievement\". But in recent years, it said, it has \"come under the influence of a divisive, race-centred ideology\". He accused it of advancing narratives that portray American and Western values as \"inherently harmful and oppressive\". Mr Trump claimed there has been a \"concerted and widespread\" effort over the past decade to rewrite American history by replacing \"objective facts\" with a \"distorted narrative driven by ideology rather than truth,\" adding that it casts the \"founding principles\" of the United States in a \"negative light\". Some have seen this as a nod towards the return of statues and monuments of Confederate figures, many of which were taken down after the police killing of George Floyd in Minneapolis in 2020 and the rise of the Black Lives Matter movement.  The Smithsonian describes itself on its website as \"the world's largest museum, education, and research complex, with 21 museums, 14 education and research centres\". Established in 1846 by the US Congress, it is charged with telling the country's story and is sometimes referred to as \"America's attic\". It also manages the National Zoo in Washington. It receives 62% of its funding from the federal government, The Washington Post said. Sky News has approached the Smithsonian Institution for comment. Read more:Signalgate: Does US care?What are Donald Trump's tariffs?Martha v Marjorie The order also calls for improvements to Independence Hall in Philadelphia by 4 July 2026, in time for the 250th anniversary of the signing of the Declaration of Independence. Mr Trump's administration has targeted, among others, Columbia University in New York, threatening to withdraw $400m (£3.1m) unless it acted to stop the \"persistent harassment of Jewish students\". The college, whose students were at the forefront of protests against US policy in Gaza, agreed to make sweeping changes, Sky's US partner NBC News said."
    },
    {
        "title": "WH Smith high street arm sold to Hobbycraft owner in £76m deal",
        "description": "WH Smith has sold its 233-year old high street business to the owner of Hobbycraft in a &#163;76m deal.",
        "url": "https://news.sky.com/story/wh-smith-high-street-arm-sold-to-hobbycraft-owner-for-16376m-13337092",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-wh-smith-shop_6810589.jpg?20250125181237",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-28 07:08:00",
        "Headline": "The deal will see the WH Smith name erased from town centres, with the wider business switching its full focus to its more lucrative travel arm.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n WH Smith has sold its 233-year old high street business to the owner of Hobbycraft in a £76m deal. Sky News revealed in January how a sales process was under way for the arm, which employs roughly 5,000 people and has 480 stores. Modella Capital won the final stage of the auction process in a run off against Alteri investors - both specialists in turning around troubled retailers. Money latest: Time running out for EV drivers to save £195 The deal will see the WH Smith name erased from town centres to become TGJones. The sale allows the WH Smith business to focus fully on its lucrative travel retail arm. That has around 1,200 stores, based mainly at airports and railway stations, in 32 countries globally and accounts for 85% of group profits. Chief executive Carl Cowling said: \"Given our rapid international growth, now is the right time for a new owner to take the High Street business forward and for the WH Smith leadership team to focus exclusively on our Travel business\". There was no word on what the new owners may do to bolster profitability, with a question mark firmly hanging over employment and the store estate - often the subject of criticism over a perceived lack of investment. WH Smith's statement said: \"All stores, colleagues, assets and liabilities of the High Street business will move under Modella Capital's ownership as part of the Transaction. Read more from Sky News:What are the other high street giants to disappear?Port giant 'discredited' by minister despite £1bn investmentTrump tariffs: German town frets over VW future \"Under this new ownership, the business will be led by Sean Toal, currently CEO of the High Street business. The High Street business will operate for a short transitional period under the WHSmith brand whilst the business rebrands as TGJones.\" A Modella spokesperson said the stores it was taking on would keep the same products and services, including Post Office work. \"TGJones feels like a worthy successor to the WHSmith brand\", they said. \"Jones carries the same sense of family and reflects these stores being at the heart of everyone's high street. \"There will be a handover period in the immediate term, and it is very much business as usual whilst we work closely with the management team to define and execute a strategy to introduce new ranges and other offerings in the future.\" The sale to Modella represents an enterprise value of £76m on a cash and debt-free basis but will see WH Smith secure an estimated £25m on a net basis after several costs associated with the sale are accounted for. WH Smith shares fell by more than 1% at the open. Susannah Streeter, head of money and markets at Hargreaves Lansdown, said the deal would represent a relief for WH Smith: \"WH Smith's high street stores have been up against the same challenges which beset Wilko and even Woolworths. \"It's a hugely competitive market for stationary, books, music and entertainment with online retailers typically able to undercut bricks and mortar stores with their higher overheads,\" she wrote in a note. \"Although the new owners of the high street chain, Modella, say the TG Jones name carries \"the same sense of family\" as WH Smith's, it will take time to resonate with the British public, and many will mourn the loss of a high street brand which has been a hub for shoppers for more than two centuries. \"Nevertheless, there is sure to be interest piqued at how the new owners can help revitalise sales, and whether products sold will be at a more competitive price, to help the chain turn a corner.\""
    },
    {
        "title": "Port giant DP World 'discredited' by former minister despite £1bn investment in London Gateway",
        "description": "The chairman of P&O Ferries' parent company DP World has told Sky News he went ahead with a &#163;1bn investment in the UK despite feeling \"discredited\" by criticism from a cabinet minister.",
        "url": "https://news.sky.com/story/port-giant-dp-world-discredited-by-former-minister-despite-1631bn-investment-in-london-gateway-13336839",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-dp-world-london-gateway_6714220.jpg?20241012164816",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "With ports and logistics operations in more than 70 countries handling around 10% of global trade, DP World's chairman Sultan Ahmed Bin Sulayem warned America's trading partners to take President Trump seriously on tariffs.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  The chairman of P&O Ferries' parent company DP World has told Sky News he went ahead with a £1bn investment in the UK despite feeling \"discredited\" by criticism from a cabinet minister. P&O was widely criticised in 2022 when more than 700 seafarers were summarily fired and replaced by largely overseas workers without consultation. Last October, the issue threatened DP World's planned expansion of London Gateway, its deepwater port on the Thames Estuary, when the then transport secretary, Louise Haigh, described P&O as a \"rogue operator\". Her comments came as DP World was in the final stages of negotiating a £1bn investment in the port, due to be announced at the government's investment summit. Money blog: Trump car tariffs condemned around the world In response, DP World pulled the announcement and only relented following a personal intervention by the prime minister to keep his showpiece event on course.  Speaking exclusively to Sky News, Sultan Ahmed Bin Sulayem said the criticism was unexpected given the scale of his planned investment in the UK. 'Water under the bridge' \"There was a misunderstanding. Someone, unfortunately, said something that was not what we expected. \"We were going to invest in infrastructure, a huge investment, and then we get the person in charge to basically discredit us. But it's water under the bridge.\" Bin Sulayem confirmed that he had spoken with the prime minister and received \"reassurances\" that Ms Haigh was expressing a personal view. She subsequently resigned after admitting a fraud offence. The chairman also defended P&O's conduct, saying that having received no state support during the pandemic, the cuts were necessary to save the company. \"We had a choice. We either close down the company and 3,000 people or more lose their jobs, or we try to survive by letting 700 or so go. And we felt that was right,\" he said. \"Maybe we didn't follow the procedures, but most importantly, we compensated every employee with more than what the law said.\" Read more from Sky News:Thousands of British Steel jobs at risk'Disgraceful' amount of sewage dumped in rivers Rebuilding relations Bin Sulayem was speaking on a flying visit to the UK intended to rebuild relations with the government, meeting investment minister Poppy Gustaffsen at London Gateway to discuss an expansion that will make the port Britain's largest by volume and offering encouraging words about the UK's attractiveness to investors. \"We believe in the UK economy, in its strength, and we believe the economic fundamentals are strong. That's why we invested,\" he said. \"The UK has the best stock market in the world. You have English law, and you have the best universities in Oxford and Cambridge. If we look to the future, it will be the economy of the brain, not the economy of the hand. \"The world economy doesn't want labourers, it wants brains. People want engineers. They want free thinkers. They want innovators. That is what's here, and that's why we invested in London Gateway.\" Tariff trade trouble With ports and logistics operations in more than 70 countries handling around 10% of global trade, DP World's chairman has a unique insight into global trade and the likely impact of the tariff war sparked by Donald Trump. While confident that trade will find a way to navigate the disruption, he warned America's trading partners to take the president seriously. \"I think psychologically it will [have an impact], but in reality it will not, because trade is resilient. I think of it like water coming from the mountain in the rain, nobody can stop it. If you can't sell a product in one place, you can sell it somewhere else. \"Trump is a deal maker. He is making threats because that's the way he negotiates. He comes with impossible demands because he wants people to come to the table. \"But he's serious. He will do what he's threatening if nobody makes a deal.\""
    },
    {
        "title": "Chelsea owner Boehly and Montgomery in talks about Daily Telegraph bid",
        "description": "Todd Boehly, the Chelsea Football Club co-owner, and media tycoon David Montgomery, have stepped up talks about a joint bid for The Daily Telegraph which could bring an end to nearly two years of uncertainty about the newspaper's ownership.",
        "url": "https://news.sky.com/story/chelsea-owner-boehly-and-montgomery-in-talks-about-daily-telegraph-bid-13337159",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-sunday-telegraph-newspapers_6708009.jpg?20241006112223",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-28 09:39:00",
        "Headline": "Todd Boehly and David Montgomery are holding discussions about a joint offer that would involve combining The Scotsman’s publisher, National World, and the Daily and Sunday Telegraph titles, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Todd Boehly, the Chelsea Football Club co-owner, and media tycoon David Montgomery, have stepped up talks about a joint bid for The Daily Telegraph which could bring an end to nearly two years of uncertainty about the newspaper's ownership. Sky News has learnt that Mr Boehly's investment vehicle Eldridge Media Holdings and Mr Montgomery, the former Mirror newspapers boss, are in discussions about a deal that would involve combining the Telegraph titles and National World, the London-listed company founded by Mr Montgomery. The talks remain tentative and are not certain to result in a formal offer for the Telegraph. Money latest: Time running out for EV drivers to save £195 Mr Boehly is said to have instructed bankers at Deutsche Numis to advise him on his interest in the newspapers. He was reported to have met Mr Montgomery to discuss the Telegraph situation in January, although there has been little sign of any progress since then. In a statement confirming Sky News' report, National World said on Friday morning that it noted \"recent speculation relating to an approach for the company from Eldridge Media Holdings, LLC\". \n                  WH Smith high street arm sold to Hobbycraft owner in £76m deal\n                 \n                  Money blog: Homebuyers rushing to sidestep rising stamp duty costs - but there's some respite for those who can't\n                 \n                  Port giant DP World 'discredited' by former minister despite £1bn investment in London Gateway\n                 \"The Company has received confirmation that EMH is considering making a proposal to acquire the entire issued and to be issued share capital the company but to date no details of any such proposal has been received by the National World board (including as to its possible terms, timing or process for implementation).\" Sources close to the process said the Boehly-Montgomery consortium was in talks with third-party backers about financing their Telegraph offer, but that any bid was likely to be below the £500m level at which the Abu Dhabi-based vehicle RedBird IMI would recoup its investment in an option to buy the Telegraph. Mr Boehly and Mr Montgomery are not yet in exclusive talks with RedBird IMI's advisers, the sources added. Dovid Efune, the New York Sun publisher who had several weeks of exclusivity to clinch a deal before his financing arrangements fell apart, remains interested in a potential deal, they said. Sky News revealed last November that the former Conservative chancellor Nadhim Zahawi and the party's former treasurer, Sir Mohamed Mansour, had been enlisted by Mr Efune to aid his bid for the right-leaning newspapers. Other bidders are also continuing to monitor the situation, although it is unclear whether they continue to include Mr Zahawi. If Mr Boehly and Mr Montgomery do progress to a formal and binding offer, a central tenet of the deal's economic rationale would involve the extraction of synergies from a combination of The Scotsman's publisher, National World, and the right-leaning Telegraph titles. One complicating factor lies in the fact that National World is already the subject of a recommended takeover bid from Media Concierge, an entity controlled by National World shareholder Malcolm Denmark. That offer is awaiting court and regulatory approval, and Mr Montgomery is said by allies to be confident of formulating a more attractive counterbid. If he cannot do so, a formal offer involving him for the Telegraph titles is a more remote prospect, according to banking sources. RedBird IMI paid £600m to acquire a call option that was intended to convert into ownership of the Telegraph newspapers and The Spectator magazine. That objective was thwarted by a change in media ownership laws amid an outcry from parliamentarians. The Spectator was then sold last year for £100m to Sir Paul Marshall, the hedge fund billionaire, who has installed Michael Gove, the former cabinet minister, as its editor. Read more from Sky News:Port giant 'discredited' by minister despite £1bn investmentTrump tariffs: German town frets over VW future Boohoo's Debenhams renaming opposed by Ashley The UAE-based IMI, which is controlled by the UAE's deputy prime minister and ultimate owner of Manchester City Football Club, Sheikh Mansour bin Zayed Al Nahyan, extended a further £600m to the Barclays to pay off a loan owed to Lloyds Banking Group, with the balance secured against other family assets. Other bidders for the Telegraph had included Lord Saatchi, the former advertising mogul, who offered £350m, while Lord Rothermere, the Daily Mail proprietor, pulled out of the bidding last summer amid concerns that he would be blocked on competition grounds. The Telegraph auction is being run by Raine Group and Robey Warshaw."
    },
    {
        "title": "WH Smith to become latest high street giant to disappear – what are the others?",
        "description": "WH Smith's name will be erased across high streets after the 233-year-old company sold part of its business to the owner of Hobbycraft.",
        "url": "https://news.sky.com/story/wh-smith-to-become-latest-high-street-giant-to-disappear-8211-what-are-the-others-13337250",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wh-smith-w-h-smith_6869435.jpg?20250328124547",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-28 12:10:00",
        "Headline": "For the first time since 1792, high streets will be without WH Smith stores. It marks the end of a lengthy era - but UK streets have become used to losing staples in recent years. What are some of the others that have disappeared? ",
        "Content": "WH Smith's name will be erased across high streets after the 233-year-old company sold part of its business to the owner of Hobbycraft. The £76m deal will see its 480 high street stores rebrand as TGJones, under the ownership of Modella Capital, which won the final stage of the auction process. While WH Smith has given up its high street business, it will continue its lucrative travel retail arm, with 1,200 stores, based mainly at airports and railway stations, in 32 countries globally. But its erasure from UK high streets marks the end of an era stretching back to 1792, when the first WH Smith was opened by Henry Walton Smith and his wife Anna in Little Grosvenor Street, London.  Here's a look at some of the other high street giants that have disappeared in recent years. Debenhams Department store chain Debenhams, like WH Smith, was a staple of British high streets for centuries, first opening its doors in 1778. \n                  Nasen Saadi: Criminology student with 'grievance against women' jailed for murdering personal trainer on beach\n                 \n                  King Charles seen in public for first time since suffering side effects from cancer treatment\n                 \n                  'Sensitive military documents' found in Newcastle street\n                 But its remaining premises closed permanently in May 2021 after the company collapsed amid the fallout of the COVID-19 pandemic. The retailer, which employed 20,000 people pre-pandemic, was already struggling before the outbreak, as shoppers moved away from traditional department store models and moved online. However, it could not cope with the enforced closure of sites during lockdown and quickly went into administration within weeks of the virus fully hitting the UK. Debenhams was acquired by fashion retailer Boohoo before the stores closed, and has been transformed into a successful online-only operation. It's so successful that Boohoo, in the midst of a huge fall in profit, has renamed itself Debenham Group. Its chief executive Dan Finley said that a turnaround of Debenhams was now complete and the online department store's updated business model now accounted for the majority of group profitability. Woolworths Once another high street fundamental, Woolworths - known for its pick 'n' mix, homeware and everything in between - had more than 800 stores in the UK at its peak. The first store opened in November 1909 in Liverpool, by New Yorker Frank Woolworth, who had already established the brand in the US. But almost exactly 100 years later - 6 January 2009 - its famous stores closed for good, just months after the company sunk into administration. Analysts blame its downfall on a toxic combination of low cash reserves, lost credit insurance and crippling debt - all exacerbated by the 2008 financial crisis. The stores were popular right until the end, with the firm's final annual report showing a slight pre-tax profit in 2007. But it was not enough to save the struggling business, which left 27,000 people out of work. Paul Seaton, who had worked as a store manager and as part of the IT team during 25 years at the company, told Sky News: \"The sad reality is Woolworths took 99 years to build, and it took 42 days from administration to the day the last door shut. Ninety-nine years of meticulous care and thought… gone.\" Ted Baker Founded by Ray Kelvin in Glasgow in 1988, Ted Baker went on to become a popular menswear label across the UK and ventured into womenswear, too. But a torrid period began for the retailer in 2019 when Mr Kelvin left amid claims of inappropriate behaviour towards colleagues. It was subsequently forced to issue a string of profit warnings and accounting mishaps, having to address the COVID-19 pandemic from a position of financial weakness. In 2020, it axed hundreds of jobs and raised £100m to shore up its balance sheet. Ted Baker was delisted from the London stock market in 2022 after being bought by Authentic, headed by the entrepreneur Jamie Salter, for about £210m. But it never recovered, eventually closing 15 of its UK stores in early 2024, before closing its remaining 31 shops in August 2024. Just before closing all stores, owners Authentic struck a deal with United Legwear and Apparel Co (ULAC) to operate an e-commerce presence for the brand in Britain and Europe, so Ted Baker still has an online store. Arcadia brands The Arcadia Group, led by Sir Philip Green, employed around 13,000 people across its high-street fashion brands like Topshop, Topman, Burton, Dorothy Perkins and Miss Selfridge. After nearly two decades, the empire came crumbling down when Sir Philip was forced to put the group into administration in the autumn of 2020. It was picked apart by online retailers, with Asos swooping in for big names like Topshop, Topman, Miss Selfridge and HIIT, and Boohoo taking over Burton, Dorothy Perkins and Wallis. Arcadia's downfall was one of the most spectacular implosions in recent corporate history, forcing about 500 standalone sites to close. Sir Philip bought the high street group in 2002 for £850m, and just three years later paid what remains one of the largest-ever dividends - £1.2bn - to his wife and Arcadia's registered owner, Lady Tina Green. Arcadia's collapse came in the midst of the pandemic, but its downfall occurred after many controversial moves by Sir Philip. BHS BHS - or British Home Stores - collapsed into administration in April 2016, leading 11,000 workers to lose their jobs. The brand, established in 1928, closed its last 22 stores in October 2016. Sir Philip Green also owned BHS after buying it for £200m in 2000. He sold the business to Dominic Chappell, a serial bankrupt, in 2015 for £1. Twenty-two thousand pensioners were hit by a £571m black hole in the collapsed retailer's pension fund, leading MPs to push for Sir Philip to be stripped of his knighthood. He eventually paid £363m to settle the pension schemes, while Chappell was jailed for six years in 2020 for failing to pay tax on £2.2m in income he received after buying BHS."
    },
    {
        "title": "Retail investor platform PrimaryBid in talks about sale",
        "description": "PrimaryBid, the fintech which had aspirations of joining the ranks of British unicorns, is exploring a sale after receiving expressions of interest from potential buyers.",
        "url": "https://news.sky.com/story/retail-investor-platform-primarybid-in-talks-about-sale-13337301",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-london-stock-exchange_6433018.jpg?20240125141202",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-28 14:01:00",
        "Headline": "PrimaryBid, which has helped raise funds for Compass Group and Aston Martin, is in discussions with a range of financial institutions about a takeover, Sky News learns. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n PrimaryBid, the fintech which had aspirations of joining the ranks of British unicorns, is exploring a sale after receiving expressions of interest from potential buyers. Sky News has learnt that PrimaryBid, which counts London Stock Exchange Group and the SoftBank Vision Fund among its investors, is working with advisers to field interest in a takeover. City sources said the process was being conducted on an accelerated basis and that if concluded, it would be at a steep discount to the $500m valuation which it attracted three years ago. PrimaryBid was founded with a simple but compelling vision to help ordinary investors gatecrash the closed City ranks of corporate fundraisings and flotations by aggregating demand from retail shareholders into a single, enlarged order. Money latest: Time running out for EV drivers to save £195 That mission to democratise access to public markets won support from politicians and market participants. It made significant progress towards this goal during the pandemic, notably securing a slice of a £2bn share sale announced by Compass Group, the FTSE 100 contract caterer. \n                  WH Smith high street arm sold to Hobbycraft owner in £76m deal\n                 \n                  Money blog: Homebuyers rushing to sidestep rising stamp duty costs - but there's some respite for those who can't\n                 \n                  Port giant DP World 'discredited' by former minister despite £1bn investment in London Gateway\n                 Since then, it has worked on hundreds of deals and helped raise roughly $2bn in equity for listed companies. However, it has been hit by a severe slowdown in equity capital markets activity, prompting it to launch a strategic review and hire US-based market infrastructure specialist Rosenblatt Securities to evaluate its strategic options. Sources said on Friday that it had received a number of expressions of interest about a deal from financial institutions and other investors. PrimaryBid has been facing into the weakest IPO market in years, which it has been attempting to mitigate by striking partnerships with the likes of US fintech group SoFi, as well as European groups. It has now reshaped its UK operations and stepped back from regulated activities, having for several months explored a deal with LSEG, one of its largest shareholders, to license its retail capital-raising technology. For some time, the company was chaired by Sir Donald Brydon, the veteran businessman who also used to chair the stock exchange's parent company. Read more from Sky News:Port giant 'discredited' by minister despite £1bn investmentTrump tariffs: German town frets over VW future Boohoo's Debenhams renaming opposed by Ashley Financial News, the trade publication, reported on Friday that LSEG had written down the value of its 7.2% stake in PrimaryBid by 87%, implying that the business now had a valuation of just £56m. Founded in 2016, PrimaryBid has raised roughly $250m during its nine years in existence. The company declined to comment on Friday."
    },
    {
        "title": "Living standards boost for households but surge in costs looms large",
        "description": "UK households saw a boost to their living standards at the end of 2024, according to official figures which follow upgrades this week to expectations for the years ahead.",
        "url": "https://news.sky.com/story/living-standards-boost-for-households-but-surge-in-costs-looms-large-13337074",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-crowds-high-street_6812766.jpg?20250128145749",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-28 05:59:00",
        "Headline": "In a week when the outlook for disposable income was raised by the OBR, new official figures suggest people were better off at the end of 2024.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n UK households saw a boost to their living standards at the end of 2024, according to official figures which follow upgrades this week to expectations for the years ahead. The Office for National Statistics (ONS) reported, alongside unrevised data showing 0.1% growth in the economy during the fourth quarter, that real households disposable income (RHDI) per person increased by 1.7% over the period. The measure of spending power, when the effects of inflation are included, was up from the 0.6% over the previous three months. Money latest: Time running out for EV drivers to save £195 The ONS said the bulk of the increase went to savings rather than being spent, explaining that consumer confidence had darkened at that time and unemployment was rising. The disposable income figure was bolstered by public sector pay deals struck after Labour's election victory and private sector pay awards remaining above the pace of price growth in the economy. The Office for Budget Responsibility (OBR) predicted in its updated forecasts for the spring statement this week that disposable incomes would grow at about 0.5% on average each year between 2025 and 2030. \n                  Can Starmer silence the rebels?\n                 \n                  How was the spring statement? Three experts give their verdicts on key policy areas\n                 \n                  'Child poverty will increase for first time under Labour and it's paving way for Reform', Corbyn warns Starmer\n                 Chancellor Rachel Reeves said that equated to an annual boost of £500. The ONS figures may help partly explain an unexpected 1% rise in retail sales volumes in February - a month when economists had widely expected a decline of 0.5%.  There is widespread evidence that economic growth has picked up over the past two months, since a surprise contraction of 0.1% was declared for January though much of that was accounted for in manufacturing and construction. Private sector activity data, however, continues to point to a meagre performance at a time when consumer and business confidence remains in the doldrums. The OBR's report also included a brutal downgrade to the UK's growth projections this year, falling from a forecast of 2% at the time of October's budget, to just 1%. The chancellor has blamed events outside her control, mostly Trump trade war-linked market moves, for having to announce spending cuts this week to restore her buffer of almost £10bn to meet her fiscal rules.  That so-called headroom was completely eroded by weaker-than-expected tax receipts and a leap in government borrowing costs since the budget. All this has happened before the main measures from that fiscal event come into force, with businesses warning that a leap in costs from higher tax and minimum pay demands, from April, will erode investment, pay awards and lead to rising prices. Household spending power will also come under further pressure from then, as many essential bills are set to rise by above the rate of inflation including water, council tax and energy - for those on the energy price cap, at least. Read more from Sky News:Port giant 'discredited' by minister despite £1bn investmentTrump tariffs: German town frets over VW future Boohoo's Debenhams renaming opposed by Ashley On top of that, the prospects for Bank of England rate cuts - bringing down borrowing costs for businesses and families alike - are under threat mainly as a result of the effects of the Trump trade war but also those of high wage growth. Liberal Democrat Treasury spokesperson Daisy Cooper said of the ONS growth data: \"These minor revisions will be cold comfort to the families, pensioners and small business owners who have to live with the consequences of anaemic growth, higher taxes and shrinking support. \"The chancellor's spring statement was a huge missed opportunity to deliver the change people were crying out for after years of Conservative chaos and mismanagement.\""
    },
    {
        "title": "'If VW disappears, people won't stay in the town': Fears over Trump's car tariffs",
        "description": "At one factory in eastern Germany, they're pumping out a car part every second, cutting and pressing millions of pieces destined for the country's mega motor industry.",
        "url": "https://news.sky.com/story/if-vw-disappears-people-wont-stay-in-the-town-anymore-fears-over-trumps-car-tariffs-13337006",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-henngineered-zwickau_6869066.jpg?20250327230224",
        "type": "Business",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "In Zwickau, car building is in people's blood, with the first vehicle made here around 120 years ago. If President Donald Trump follows through with his plan to impose new 25% levies on imported cars and light trucks, it's feared the city will be hit very hard.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  At one factory in eastern Germany, they're pumping out a car part every second, cutting and pressing millions of pieces destined for the country's mega motor industry. The HENNgineered plant sits on the edge of Zwickau, a city where the car is king. And when it comes to vehicles, America is Germany's most important trading partner. In 2024, automotive exports to the US reached a total value of €36.8bn (£30.7bn), according to the German Automobile Association. So, Donald Trump's decision to introduce 25% tariffs on all passenger cars and light commercial vehicles imported into the US is a big problem for manufacturers and suppliers alike. \"Such tariffs would be very hard. It could make companies decide to move to the US to produce there, which might also mean jobs are lost here in Germany,\" explains site manager Matthias Wissel. Volkswagen is now the main local employer, providing around 10,000 jobs. Read more: Trump's car tariffs condemned But car building is in people's blood, with the first vehicle made here around 120 years ago. The city museum proudly displays cars through the ages. One room hosts shiny silver racing cars, another brightly coloured Trabants. The city developed cars from the German empire right through to the current modern republic, explains Thomas Stebich, head of August Horch Museum. While the immaculate car displays celebrate the city's pioneering past, tariffs are making many feel uncertain about the future. \"If nobody in the US buys a German car or less people buy German cars, it will have an impact, of course, because we need to build high numbers of cars here [for jobs],\" Stebich says.  👉 Follow Trump 100 on your podcast app 👈 If you want to understand how key the auto industry is to German identity, think mining to the UK in its heyday. Around 700,000 people are employed in the industry, which generates more than 540 billion euros in sales a year. But tariffs are not the first storm German car manufacturers have had to weather. High energy and labour costs, competition from China and weaker domestic demand due to the ailing economy mean the German car industry has been cutting jobs. Audi recently announced it will cut 7,500 administration jobs by 2029. By 2030, VW will lose 35,000 roles. Read more from Sky News:UK firms plead for tariff deal with TrumpWhat will happen on 'liberation day'? They're not the only ones, but Trump's tariffs news comes as a fresh blow to workers. A representative on the VW works council in Zwickau cancelled our interview due to crisis talks. All the workers we met seemed pessimistic and deeply worried for the plant and the city's future. Their concern is shared by Aliriza Oernek, who owns four restaurants in Zwickau. He says in recent years they've seen many of their young people leave the area to seek jobs elsewhere. He fears fresh pain from tariffs will hurt the whole community. \"Volkswagen is the biggest employer in Zwickau, the main source of money for people who live here. If they were to disappear, then people won't stay in the town anymore,\" he says. Like its counterparts, Volkswagen is closely watching developments around tariffs and assessing how they could impact the supply chain and production. All eyes are currently on the European Union to see how it will retaliate. In a statement, a spokesperson for VW Group said they \"share the assessment of most experts that US tariffs and any counter-tariffs will have negative consequences for growth and prosperity in the US and other economic areas... and continue to advocate for constructive talks\". So, while car makers brace for impact, Germany's vowed it will \"not take this lying down\", calling for a \"firm response\" from the EU as it tries to protect its automakers from this new American attack."
    },
    {
        "title": "What Labour is doing to keep the welfare rebels quiet",
        "description": "Government whips will be overestimating the number of Labour rebels over welfare cuts as a form of \"expectation management\", Dame Harriet Harman has said.",
        "url": "https://news.sky.com/story/what-labour-is-doing-to-keep-the-welfare-rebels-quiet-13336685",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6869407.png?20250328121523",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "Dame Harriet Harman says government whips will be studying all the 411 Labour MPs for clues as to who may oppose the near £5bn in cuts unveiled at the spring statement.",
        "Content": "Government whips will be overestimating the number of Labour rebels over welfare cuts as a form of \"expectation management\", Dame Harriet Harman has said. Speaking to Beth Rigby on the Electoral Dysfunction podcast, the Labour peer and former deputy leader shed light on some of the dark arts that have traditionally been associated with government whipping operations - whereby MPs are encouraged to vote in line with the government. Sir Keir Starmer and Rachel Reeves are facing a looming rebellion over the chancellor's decision to impose nearly £5bn worth of welfare cuts, as outlined in the spring statement on Wednesday. Politics latest: Trump threatens chancellor's economic plan  Dame Harriet said the \"first thing\" the government whips will be doing is suggesting that the rebellion will be larger than it is - so it looks less damaging when smaller numbers emerge. \"You'll see floating around that there's going to be 50 Labour MPs rebelling against their own government within a year of having been elected on a Labour manifesto,\" she explained. \"And probably that's because they think they'll be considerably fewer than that. And they're just setting the expectation.\" \n                  Extra 50,000 children could be pushed into poverty over welfare changes, says government assessment\n                 \n                  Celebrities urge government to reverse 'shameful' welfare cuts\n                 \n                  Is Rachel Reeves about to have a very tough week?\n                 Alongside this, Dame Harriet said there has always been talk about whips - who are responsible for enforcing party discipline - \"blackmailing people with private information\". She said that while this used to be the case when she was first elected as an MP in the 1980s, it would not be happening under the current government. However, she said the whips will have a \"spreadsheet of every single one of the 411 Labour members of parliament because the whips' job is to get the government business through\". \"They'll be identifying those who think that they might be at risk of voting against or abstaining,\" she said. \"And they will talk to them, and they'll be reminding them that actually, they really need to be supporting the government and think about the good things the government's doing - think about the waiting lists coming down in your area. \"Don't destabilize the government when we've only just started, because you know you want to focus the minds of everybody in your constituency on the fact that things are getting better in some areas. \"So they'll be saying: 'You promised you'd be voting with the whip. How can you be breaking that promise?'\"  Read more:Spring statement 2025 key takeawaysBacklash over welfare cuts on 'people that need extra help' A number of Labour MPs have already expressed their concerns at the changes, particularly following the government's own impact assessment which stated that around 250,000 families - including 50,000 children - could be pushed into poverty. Debbie Abrahams, the MP for Oldham East and Saddleworth and the chair of the work and pensions select committee, said: \"All the evidence points to cuts in welfare leading to severe poverty and worsened health conditions. How will making people sicker and poorer get people into jobs?\" And Leeds MP Richard Burgon added: \"Making cuts instead of taxing wealth is a political choice, and taking away the personal independence payments from so many disabled people is an especially cruel choice. \"A disabled person who can't cut up their own food without assistance, and can't go to the toilet without assistance, and can't wash themselves without assistance will lose their personal independence payment.\""
    },
    {
        "title": "'Two-tier' justice row: Sentencing Council rejects minister's call for guidance rethink",
        "description": "The Sentencing Council has rejected calls from the justice secretary to change guidance that recommends judges consider a criminal's ethnicity before deciding their punishment.",
        "url": "https://news.sky.com/story/sentencing-council-rejects-justice-secretarys-calls-for-guidance-rethink-amid-two-tier-justice-row-13337167",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-shabana-mahmood_6756053.jpg?20241123194430",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-28 09:52:00",
        "Headline": "The independent body that issues guidelines on sentencing is pushing ahead with changes which critics claim could lead to people from certain backgrounds being treated differently under the law.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n The Sentencing Council has rejected calls from the justice secretary to change guidance that recommends judges consider a criminal's ethnicity before deciding their punishment. The body, which sets out sentencing guidance to courts in England and Wales, recently published new principles for judges and magistrates to follow when imposing community and custodial sentences, including whether to suspend jail time. The updated guidance, which is due to come into force from April, says that a pre-sentence report will \"usually be necessary\" before handing out punishment for someone of an ethnic, cultural or faith minority, alongside other groups such as young adults aged 18 to 25, women and pregnant women. Politics latest: PM unveils billions to fix 'Victorian era' northern transport  Sir Keir Starmer today said he was \"disappointed\" with the Sentencing Council's refusal to change guidance and that \"all options are on the table\" over how the government might respond. Ms Mahmood expressed her \"displeasure\" at the body's recommendations, arguing that \"as someone who is from an ethnic minority background myself, I do not stand for any differential treatment before the law\". She had recommended that the guidance be reversed, but because the Sentencing Council is independent, she cannot order them to do so. Responding to the news that her requests had been rejected, Ms Mahmood said: \"I have been clear in my view that these guidelines represent differential treatment, under which someone's outcomes may be influenced by their race, culture or religion. \"This is unacceptable, and I formally set out my objections to this in a letter to the Sentencing Council last week. \"I am extremely disappointed by the council's response. All options are on the table and I will legislate if necessary.\" The Sentencing Council's decision has prompted claims of \"two-tier\" justice from the Conservatives, with shadow justice secretary Robert Jenrick arguing it would be \"very corrosive to public trust and confidence in the criminal justice system\" if enacted. In a recent interview with Sky News, he accused the council of setting rules which make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\". \"To me, this seems like blatant bias, particularly against Christians, and against straight white men,\" Mr Jenrick said. \"Either this was the policy of the justice secretary - she's changed her mind, but this was her policy - or she was asleep at the wheel.\"  Following the Sentencing Council's response, he said: \"Shabana Mahmood has been humiliated by the Sentencing Council. In three days time we will have two-tier sentencing because of her and Two-Tier Keir. It is shameful they sat on their hands and chose not to legislate to prevent two-tier justice.\" In setting out the changes, Sentencing Review body chair Lord Justice William Davis said the reforms reflected evidence of disparities in sentencing outcomes, disadvantages faced within the criminal justice system and complexities in the circumstances of individual offenders. In his letter to Ms Mahmood, he said that while it was not the role of the judiciary to introduce policies to \"redress the imbalance\", those responsible for handing down sentences \"must do all that they can to avoid a difference in outcome based on ethnicity\". Read more:What are pre-sentence reports?Violent offenders could be let out early to free up prison space He argued that, in allowing judges access to pre-sentence reports, they will be \"better equipped to do that if they have as much information as possible about the offender\". \"The cohort of ethnic, cultural and faith minority groups may be a cohort about which judges and magistrates are less well informed,\" he added. Pushing back against suggestions that providing judges with pre-sentence reports could lead to more lenient sentences, Lord Justice Davis wrote: \"The crucial point is that a pre-sentence report will provide information to the judge or magistrate. It will not determine the sentence. \"Rather, it will leave the judge or magistrate better informed about the offender. Frequently, the information provided will not assist the offender's prospect of avoiding a custodial sentence: rather the reverse.\" Downing Street rejected Mr Jenrick's assertion that the justice secretary had been humiliated by the Sentencing Council, saying: \"She has been in dialogue with the Sentencing Council throughout, she has made her views clear. \"As she said, all options remain on the table, and that includes legislating if necessary.\""
    },
    {
        "title": "Can Starmer silence the rebels?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/electoral-dysfunction/id1613562765' target='_blank'> 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/can-starmer-silence-the-rebels-13336854",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electoral-dysfunction_6862564.png?20250320204606",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "No subtitle found",
        "Content": " 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Beth Rigby, Ruth Davidson and Harriet Harman analyse Rachel Reeves's spring statement and how Donald Trump may have made things worse for her. The chancellor has redone her maths to make sure she sticks to her own rules on running the economy - but in doing that she has got tougher on welfare cuts. Can Labour keep the dissenting voices within their own party quiet? Harriet has some insight on how they'll be trying to do that. And do Trump's tariffs on US car imports (and the prospect of more tariffs looming) just put the chancellor on the backfoot anyway? Also, after an American journalist was added to a US government Signal group, how much government business is done on apps? And how much loose-lipped gossip is on there? Meanwhile, as Beth goes into the last few weeks of London marathon training, did we just start the Electoral Dysfunction run club? Email us at electoraldysfunction@sky.uk, post on X to @BethRigby, or send a WhatsApp voice note on 07934 200 444. \n                  Labour MPs and officials briefing against work and pensions secretary should 'shut up', Baroness Harman says\n                 \n                  MPs in controversial Labour WhatsApp group should never have been in parliament, says Harman\n                 \n                  Ed Miliband will find Heathrow third runway support 'uncomfortable' but he won't cause 'disruption', Harriet Harman says\n                 Remember you can also watch us on YouTube! Help us understand more about our listeners by taking our survey This form should only take a few minutes to complete, and Sky anonymises the responses as much as possible."
    },
    {
        "title": "Government won't rule out shortening sentences of violent offenders to free up prison space as it opens new jail",
        "description": "The justice secretary has not ruled out shortening the sentences of violent offenders in a drive to create more space in an over-stretched prison system.",
        "url": "https://news.sky.com/story/government-wont-rule-out-shortening-sentences-of-violent-offenders-to-free-up-prison-space-as-it-opens-new-jail-13337036",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-glasgow-hmp-barlinnie_6820282.jpg?20250218104526",
        "type": "Politics",
        "Author": "Katie Barnfield, North of England correspondent",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "Prisons in England and Wales are over 99% capacity. With less than 800 spaces left in jails, the government recently triggered emergency measures to hold prisoners in police cells.",
        "Content": "By Katie Barnfield, North of England correspondent  The justice secretary has not ruled out shortening the sentences of violent offenders in a drive to create more space in an over-stretched prison system. Speaking to Sky News, Shabana Mahmood MP said the government wanted to follow the example of Texas in the US, where she said a \"good behaviour credit scheme\" allows offenders to earn an earlier parole hearing. When asked how victims of violent offenders would react to such a move, the justice secretary said her message to them was: \"We've all got an interest in making sure the country does not run out of prison places. \"If you run out of prison places, none of your options are good options, or anything anyone would be happy about. \"So we've got to do things differently.\" Ms Mahmood was speaking at the opening of HMP Millsike in East Yorkshire - a brand new nearly 1,500 capacity prison, built as part of a government plan to create 14,000 new prison spaces by 2031. The new Category C jail is focused on rehabilitation, with skills and training for inmates to try and help them get jobs when they leave prison. \n                  'Two-tier' justice row: Sentencing Council rejects minister's call for guidance rethink\n                 \n                  Court backlog at unmanageable levels, says report, as victims suffer from poor mental health in wait for trials\n                 \n                  Scrapping jury trials for some offences may be only way to clear court backlog, says CPS watchdog chief\n                 It also has technology like barless windows and X-ray body scanners to stop drugs and drones getting into the prison. But, by the Ministry of Justice's own estimate, their target for new prison spaces will not go far enough to tackle the overcrowding crisis. Prisons are currently at over 99% capacity - with less than 800 spaces left in jails across England and Wales. The government recently triggered Operation Safeguard, an emergency measure to hold prisoners in police cells because of a lack of space. The Lord Chancellor said the government has launched a sentencing review because it \"cannot build its way\" out of the crisis. Ms Mahmood added that just focusing on short sentence reviews \"would not go far enough\". MPs from the Public Accounts Committee warned earlier this month that the plan to deliver the 14,000 new places on time are \"still fraught with risk and uncertainty\". They also said the government is facing a nearly £2.8bn bill to fix disrepair issues across the existing prison estate. Tom Wheatley, president of the Prison Governors Association, told Sky News the \"maintenance crisis\" is worsening problems with overcrowding. Read more from Sky News:King briefly hospitalisedFive wounded in Amsterdam stabbingHow was the spring statement? He said many jails built in Victorian times \"require an awful lot of money to maintain\". \"And if you don't maintain them - if you lose a heating system or security systems that are absolutely necessary for the prison to run effectively - you also lose the accommodation. So these things become compound issues.\""
    },
    {
        "title": "Clocks go forward this weekend - but should daylight savings be scrapped?",
        "description": "The clocks go forward this Sunday, marking the beginning of the daylight saving period.&#160;",
        "url": "https://news.sky.com/story/clocks-go-forward-this-weekend-but-should-daylight-savings-be-scrapped-13335364",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-clock-daylight-savings_6869162.jpg?20250328070605",
        "type": "Technology",
        "Author": "Lauren Russell",
        "Date Published": "2025-03-28 00:01:00",
        "Headline": "\"Spring forward, fall back\" has been part of our calendar for more than 100 years - but whether we should continue the practice is hotly debated. Here's why.",
        "Content": "\n          News reporter\n              @laurenvrussell\n  The clocks go forward this Sunday, marking the beginning of the daylight saving period.  It will mean the time jumps to 2am as the clocks turn to 1am on 30 March - and yes, bad news, you will lose an hour of sleep. But the extra hour of daylight will mean longer, lighter evenings from next week. \"Spring forward, fall back\" has been part of our calendar for more than 100 years - but whether we should continue the practice is hotly debated. But why do some people get so up in arms about the clocks changing - and why do we do it in the first place? Here is what you need to know - including how to prepare ahead of this weekend's clock change. Why do we have daylight saving time? The change to British Summer Time (BST) - also known as daylight saving time (DST) signifies the end of Greenwich Mean Time (GMT) in the UK. It lasts from the last Sunday in March until the last Sunday in October, when the clocks go back an hour. It is common belief that DST was introduced to help give farmers more daylight hours to work in the fields. But this is not exactly true. George Hudson, a New Zealand entomologist - someone who studies insects - first campaigned for more evening sunlight back in the 1890s, so he could study his beloved bugs. It was the first time changing the clocks around the seasons had been suggested seriously. Jump to 1907 and British inventor William Willett - the man credited with bringing daylight saving to the UK - self-published a pamphlet called The Waste Of Daylight, in which he outlined his frustration with not getting the most out of summer days. He initially proposed that clocks jump forward by 80 minutes in four incremental steps in April and reversed the same way in September - but he died before any law was implemented in the UK. The first country to adopt DST was Germany in 1916, during the First World War. The UK followed suit a few weeks later. How does daylight savings affect your health? Since the implementation of DST, and particularly the clocks going forward in spring, various studies have found that darker mornings and lighter evenings can cause havoc with some people's bodies. In fact, sleep and dream researcher Charlie Morley said there is \"overwhelming\" evidence of the health issues the switch can cause. \"What research shows is what a massive effect on the body and mind, just one extra hour [of sleep] can have,\" Mr Morely told Sky News. One study cited by the American Heart Foundation found there was a 24% increase in heart attacks on the day following the switch to daylight saving time - however the opposite effect has been identified in autumn, when the clocks go back. Another from 2016 in Finland found there were 8% more hospital admissions for the most common type of stroke in the two days after the shift to daylight savings. Researchers also note those suffering strokes and heart attacks were likely to already be at higher risk. When asked what symptoms losing an hour of sleep can lead to, Mr Morely said: \"The interesting thing is when you get a really short amount of sleep, like four hours or less, the fear centre of the brain, known as the amygdala, becomes 60% more active. \"This can make it seem like everything is annoying, threatening or in conflict. So if you lose an hour of sleep, you might see an increase in the amygdala response, making you more grumpy and tetchy.\" Read more from Sky News:Seasonal affective disorder isn't just 'winter blues'Partial eclipse to be visible from UK Should daylight saving be scrapped? Whether to keep daylight saving or not has been a hotly debated question for many years, but was reignited in October last year, when the British Sleep Society called on the UK government to abolish the twice-yearly clock changes. In an article at the time, researchers said due to the negative effect DST has on circadian and sleep health, the UK should abolish the change altogether, and reinstate standard time throughout the year. In reality, only about a third of the world's countries practice daylight saving time, according to the Pew Research Center. US President Donald Trump wrote in a post on Truth Social last December that he wanted to scrap DST. His secretary of state Marco Rubio has also called the ritual of changing time twice a year \"stupid\". The European Parliament has also previously voted for all EU member countries to scrap DST, but after the Parliament and EU Council couldn't reach an agreement on the legislation, it never became law. One of the few places that doesn't follow DST in Europe is Iceland, due to its location and extreme variations in daylight throughout the year. How to prepare for clock changes and the 'golden rule' of napping Mr Morley says it is impossible to make up for lost sleep, but those worried ahead of daylight saving time can \"front load sleep\". This involves someone getting \"really good, quality sleep before entering a period of bad sleep\". Exposing yourself to natural sunlight first thing in the morning, eating meals based on the time of day it is where you are, minimise the use of caffeine and exercising can also all help treat negative effects of losing an hour of sleep. Mr Morely added that napping can also be an effective way of dealing with sleep deprivation - but there are some hard and fast rules. \"The two golden rules of napping are it needs to be under an hour, so between 20 minutes and 60 minutes, and the nap needs to end six hours before you intend to go to bed again,\" he explained. \"There is a chemical called adenosine, which is known as the tiredness chemical, and it takes around five to six hours to build up. So if you want to go to bed at midnight, as long as your nap ends up 5pm you have got enough time for adenosine to build up, and you will be tired enough to go to bed.\""
    }
]