[
    {
        "title": "Five people including police officer killed after shooting at New York skyscraper",
        "description": "Five people, including a police officer, have died after a shooting at a New York skyscraper.",
        "url": "https://news.sky.com/story/active-shooter-incident-in-new-york-city-as-police-officer-among-at-least-two-people-shot-13403118",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-new-york-shooting-manhattan-shooting_6976486.jpg?20250729010158",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 14:23:00",
        "Headline": "The suspect has been identified as a 27-year-old man from Las Vegas called Shane Devon Tamura, according to reports in the US.",
        "Content": "Five people, including a police officer, have died after a shooting at a New York skyscraper. The lone gunman is also dead from a self-inflicted gunshot wound, officials said. The suspect was identified as a 27-year-old man from Las Vegas called Shane Devon Tamura, four senior law enforcement officials told Sky News' US partner network NBC News. His motive is not yet clear. The New York Police Department (NYP) confirmed the fatalities, while it was reported the police officer who died was off duty. The shooting is reported to have happened at 345 Park Avenue - a skyscraper in Midtown Manhattan which houses both the headquarters of the investment firm Blackstone and the National Football League (NFL). It also houses offices belonging to KPMG, as well as the consulate general of Ireland and a Bank of America branch. The gunman was wearing a bulletproof vest and carrying an assault rifle when he opened fire at the skyscraper, unnamed police sources have told the New York Post newspaper. Nekeisha Lewis, who was eating dinner in the plaza of the building at the time of the shooting, said: \"We heard the shots, I looked up and I saw the first wall of the first floor shatter. \"I realised 'oh my god' this is a shootout, it felt like you were in a war zone almost. I saw a worker run out, he was running so frantically I thought he was just trying to get away. \"By the time he got to us he said 'help, help, I've been shot'. I turned to my left and looked at him and saw he had a wound in his back, and my partner who was ahead of me had also looked at him and seen that he had a wound, that looked like an entry wound or an exit wound on the front, so (the bullet) might have gone all the way through.\" She added that the police then took over and helped the man get treatment. The New York Police Department had urged people to avoid the vicinity of East 52 Street between Park Avenue and Lexington Avenue as they searched for the suspect. It added in a post on X: \"Expect emergency vehicles & delays in the surrounding area.\" It came as Dan Bongino, deputy director of the FBI, said its agents were \"responding to provide support at the active crime scene in Manhattan\". Jessica S. Tisch, police commissioner of New York City, later wrote on X: \"UPDATE: At this time, the scene has been contained and the lone shooter has been neutralized.\" Officers close to the scene had been seen stopping cars and looking inside as the force searched for the suspect, NBC New York reported. Video from Lexington Avenue showed a police officer stop a yellow taxi SUV, having the windows be lowered and looking in the driver's front passenger seat and back seats with flashlight. The Fire Department of New York has said emergency crews were called to the Park Avenue office building Monday evening for a report of someone shot. A spokesperson said the call came in around 6.30pm local time (11.30pm UK time). New York City Mayor Eric Adams earlier wrote on X: \"New Yorkers: there is an active shooter investigation taking place in Midtown right now. Please take proper safety precautions if you are in vicinity and do not go outside if you are near Park Avenue and East 51st Street.\""
    },
    {
        "title": "Lionesses parade: The route and key timings as thousands of England fans to descend on central London",
        "description": "The Lionesses will celebrate with thousands of England fans in central London today as the players take part in an open-top bus procession.",
        "url": "https://news.sky.com/story/lionesses-victory-parade-route-timings-and-whats-next-for-englands-women-after-euros-victory-13402884",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-lionesses_6976489.jpg?20250729015605",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 06:49:00",
        "Headline": "The England players will celebrate the defence of their Women's Euros title with an open-top bus parade today. Here is everything you need to know.",
        "Content": " The Lionesses will celebrate with thousands of England fans in central London today as the players take part in an open-top bus procession. The bus will carry the team through central London, allowing supporters to celebrate the team's defence of their Women's Euros title alongside the likes of Leah Williamson and Chloe Kelly and catch a glimpse of the silverware. Here is all you need to know. Where will the parade go and when? The team's open-top bus will travel along The Mall from 12.10pm. It will end with a staged ceremony at the Queen Victoria Memorial in front of Buckingham Palace, which is expected to start at roughly 12.30pm and end at 1pm, the Football Association (FA) announced. The Royal Marines Portsmouth band and the Central Band of the Royal Air Force will perform on the stage and highlights from the tournament will be shown on big screens. England manager Sarina Wiegman will then lead her triumphant team out on stage to lift the trophy. The event will be hosted by former Lioness and football pundit Alex Scott. Fans will be able to attend the event for free, but the FA have warned that the capital is going to be \"very busy\". \"People should plan their visits carefully, both coming into central London and travelling home,\" the association said. How to watch You can watch coverage of the entire event live on Sky News from 10am and follow all the action with our live blog. Fans can also follow coverage of the event on the BBC, ITV and across England's social media channels. Celebrations with the deputy PM The Lionesses landed back in the UK from Basel, Switzerland, on Monday, where celebrations continued with a reception at Downing Street. Deputy Prime Minister Angela Rayner and sports minister Stephanie Peacock hosted the team ahead of today's bus parade.  Sir Keir Starmer said: \"The Lionesses have once again captured the hearts of the nation. \"Their victory is not only a remarkable sporting achievement, but an inspiration for young people across the country.\"  An extra bank holiday? As the team have become the first senior England side to win a major tournament on foreign soil, some have called for an extra bank holiday to mark the occasion. Liberal Democrats leader Ed Davey was one of those who asked the prime minister if it was \"time for that bank holiday\". He was referring to comments made by Sir Keir in 2023. When, as leader of the opposition, he wrote on X that there \"should be a celebratory bank holiday if the Lionesses bring it home\". But with estimates suggesting an extra bank holiday would cost the economy £2.4bn, it's understood such a move isn't being planned by Downing Street. 'There is no stopping them now' The impact of the Lionesses second consecutive Euros title is already being felt across the UK. At Bearsted Football Club in Maidstone, Kent, a mural of Alessia Russo, who levelled Sunday's final with a goal in the 56th minute, has been unveiled. The club is where Russo first started playing, and chairman Jamie Houston told Sky News the Lionesses have helped transform the women's game. \"Five years ago we never had a girl's football team,\" he told Sky correspondent Mollie Malone. \"Now we have five separate teams for girls, and boys are accepting of more girls in the game. \"There is no stopping them now.\"  Read more:In pictures: The story of the Euros final Fans celebrate at club where Lioness began journeyAnalysis: England showed resolve and relentlessness Lynda Hale, who played in the England squad in the first ever international women's match against Scotland in 1972, reiterated that women's football has changed drastically since she played. \"When I first started playing there was hardly anyone that would watch,\" she told Sky News Breakfast. \"To put on the England shirt and think what we started has grown to this magnitude, and it is still going to grow, is absolutely fantastic. I think the sky's the limit in women's football.\" Asked what advice she would have for the current England squad after their win, Ms Hale said: \"The girls need to make as many memories as they can and take everything in their stride.\""
    },
    {
        "title": "Suspect in fatal shooting of mother and her two children in Northern Ireland dies in hospital",
        "description": "The suspect in the fatal shooting of a mother and her two children in Northern Ireland has died.",
        "url": "https://news.sky.com/story/suspect-in-fatal-shooting-of-mother-and-her-two-children-in-northern-ireland-dies-in-hospital-13403264",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-vanessa-whyte-james-rutledge_6972482.jpg?20250724122142",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 22:27:00",
        "Headline": "Vanessa Whyte, her 14-year-old son James and 13-year-old daughter Sara were shot dead at a property in Maguiresbridge last week.",
        "Content": "The suspect in the fatal shooting of a mother and her two children in Northern Ireland has died. Ian Rutledge, a 43-year-old agricultural worker, had himself suffered a gunshot wound during the attack in the village of Maguiresbridge in County Fermanagh on Wednesday morning. He was taken to hospital where he remained in a serious condition until the Police Service of Northern Ireland (PSNI) announced he had died on Monday evening. It is understood he was the only suspect in the murder investigation. Vanessa Whyte, 45, a vet originally from County Clare, her son James, 14, and daughter Sara, 13, were all shot dead at a property on Drummeer Road during the attack. The PSNI said last week that all four people who were shot were members of the same household. Police have been investigating whether the attack was a triple murder and attempted suicide. A prayer service took place for Ms Whyte and the two children in Barefield, County Clare on Sunday, following a community vigil in Maguiresbridge last Friday. A funeral service is expected to take place in County Clare later this week. Following Mr Rutledge's death, the PSNI said detectives have \"reiterated their appeal for anyone with information, no matter how insignificant it may seem, to come forward\". It comes after the PSNI issued an appeal on Saturday for information involving the movements of a vehicle. They have asked anyone who saw a silver Mercedes saloon car being driven in the Clones Road area of Newtownbutler, or between Maguiresbridge and Newtownbutler, on the evening of Tuesday 22 July to call detectives on 101. Read more from Sky News:Lionesses celebrate Euros triumph at No 10Trump reignites row with London mayorThe view from a plane dropping aid to Gaza Tributes paid to 'lovely-natured' children A local Gaelic football club said last week that Ms White and her children were all \"active and beloved\" members of their club. Sara and James Rutledge also used to be part of a local cricket club, which said in a statement that it was \"extremely saddened by the tragic events\". \"Both of them turned out to be talented young cricketers and two absolutely lovely-natured children,\" the statement read. Flowers, teddy bears and an Arsenal football top with written notes were laid close to scene of the incident in Drummeer Road in the days after the shooting."
    },
    {
        "title": "Trump reignites row with 'nasty' Sadiq Khan as Starmer responds",
        "description": "Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\".",
        "url": "https://news.sky.com/story/trump-reignites-row-with-nasty-sadiq-khan-as-starmer-responds-13403126",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-sadiq-khan_6976221.jpg?20250728161225",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 15:00:00",
        "Headline": "The London mayor had tried to strike a more conciliatory tone after previously trading insults with Donald Trump - but the row is back on.",
        "Content": " Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\". During an hour-long news conference with Sir Keir Starmer in Scotland, the US president hit out at the Labour mayor, who has responded with his own snipey remarks. Trump latest: US leader gives Putin new deadline to end war Asked if he would visit London during his state visit in September, Mr Trump said: \"I will, I'm not a fan of your mayor, I think he's done a terrible job. \"A nasty person, I think.\" The prime minister then interrupted and said: \"He's a friend of mine.\" But the president added: \"I think he's done a terrible job but I will certainly visit London, I hope so.\" \n                  Starmer ran the gauntlet with Trump but just about emerged intact\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 Sir Sadiq's spokesperson then released a statement saying: \"Sadiq is delighted that President Trump wants to come to the greatest city in the world. \"He'd see how our diversity makes us stronger not weaker; richer, not poorer. \"Perhaps these are the reasons why a record number of Americans have applied for British citizenship under his presidency.\" They noted that Sir Sadiq has won three mayoral elections, including when Mr Trump lost the US election in 2020. This is not the first time Mr Trump and Sir Sadiq have locked horns. Read more:US and EU agree trade dealScots divided as Trump heads to Turnberry During his first presidential term, Mr Trump called the London mayor a \"stone cold loser who should focus on crime in London\". Sir Sadiq then described Mr Trump as a \"poster boy for racists\". And in November 2024, after Mr Trump won his second term, Sir Sadiq said many Londoners would be \"fearful\" about what it would \"mean for democracy\". However, as Sir Keir tried to show diplomacy with Mr Trump after becoming PM, Sir Sadiq said he \"wanted to work closely with the American president\" ahead of his inauguration in January. The London mayor said as somebody \"who believes in democracy, and voting and elections, we should recognise the fact that Donald Trump is the elected president of the United States\". But he added: \"Let's keep our fingers crossed that this president is different from the last time he was president.\""
    },
    {
        "title": "Mile after mile of grey rubble - the view from a plane dropping aid to Gaza",
        "description": "We are on our way to Gaza with the Jordanian military.",
        "url": "https://news.sky.com/story/mile-after-mile-of-grey-rubble-the-view-from-a-plane-dropping-aid-to-gaza-13403242",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jordan-gaza_6976450.jpg?20250728221159",
        "type": "Home",
        "Author": "Sally Lockwood, Sky correspondent",
        "Date Published": "2025-07-28 20:54:00",
        "Headline": "Sky News goes on board a Royal Jordanian Air Force plane for one of the first aid drop flights since Israel announced they could resume.",
        "Content": "By Sally Lockwood, Sky correspondent   We are on our way to Gaza with the Jordanian military. The aircraft is hot and noisy and as we get closer, the atmosphere gets more tense. Aircrew gesture with their hands to tell us how many minutes there are to go. Fifteen. Six. One. The Jordanian military C-130 flies out over the sea before banking and heading inland for Gaza. The parachutes, attached to the top of each of the eight pallets, are prepared for the drop. As land approaches, I look down. The ground is modern and built up - we're still over southern Israel. Then a few short minutes later, it's clear we've crossed Gaza's border. The ground turns grey, the shapes of buildings disappear, there are no cars, no people. You can see the outline of communities and villages that are now flattened. Mile after mile of grey rubble. This mission by the Royal Jordanian Air Force is one of the first aid drop flights since Israel announced they could resume. It is carrying eight tonnes of food and baby formula. Foreign nations know this is a deeply flawed way of delivering aid - road convoys are far more effective and can carry far more - but the Jordanian flight crew say the need in Gaza is so urgent, it's simply an attempt to do something. When the aircraft ramp opens, the aid is pushed out and it's gone in seconds. The parachutes seem peaceful as they open and their fall slows. But dropping food from the sky is a dangerous and undignified way to feed people. On the ground it's chaos. Our colleagues in Gaza say the fighting for food has become lethal - gangs are now punching and stabbing people to reach it first. Most critically, it's not getting to the weakest. To those who really need it. One man becomes emotional as he describes racing to find food and leaving with nothing. \"I came only for my son,\" he says. \"I wouldn't come here if it was just for me. When you have a child, they need bread.\" He's an engineer in normal times and seems in disbelief that his life has come to this. \"The aid comes from the sky and we have to run after it. I've never had to do this in my life.\" Read more:Why are aid airdrops so dangerous?Inside Gaza's Nasser Hospital It is hoped Israel's humanitarian pauses in fighting will rapidly increase food distribution by road but it's very unclear how that is going. Hospitals in Gaza have reported another 14 deaths from starvation in the last 24 hours, the Gaza health ministry said on Monday. Airstrikes killed another at least 78 Palestinians across Gaza on Monday, local health officials said. We cannot verify these numbers because Israel has not allowed international journalists access to Gaza. And Monday's flight came with strict media conditions. We were told the Israeli side had warned that any shots of Gaza filmed from the air could result in these aid flights being cancelled. But Israel's tight grip has not stopped the images from Gaza getting out, horrifying people around the world. The question now is what more the international community will do about it."
    },
    {
        "title": "The 1975 star Matty Healy warns of musical 'silence' without small stages as he backs new UK-wide festival",
        "description": "The 1975 frontman Matty Healy has warned of a musical \"silence\" that would come without the pubs and bars that give UK artists their first chance to perform.",
        "url": "https://news.sky.com/story/the-1975-star-matty-healy-warns-of-musical-silence-without-small-stages-as-he-backs-new-uk-wide-festival-13403105",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-the-1975-glastonbury_6976143.jpg?20250728151622",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-28 13:56:00",
        "Headline": "Matty Healy is an ambassador for the new Seed Sounds Weekender, a UK-wide festival championing the pubs, bars and clubs that host artists when they are starting out.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The 1975 frontman Matty Healy has warned of a musical \"silence\" that would come without the pubs and bars that give UK artists their first chance to perform. Fresh from headlining Glastonbury in June, Healy is backing a new UK-wide festival which will see more than 2,000 gigs taking place across more than 1,000 \"seed\" venues in September. The Seed Sounds Weekender aims to celebrate the hospitality sector hosting bands and singers just as they are starting out - and for some, before they go on to become global superstars. Healy, who is an ambassador for the event, said in a statement to Sky News: \"Local venues aren't just where bands cut their teeth, they're the foundation of any real culture. \"Without them, you don't get The Smiths, Amy Winehouse, or The 1975. You get silence.\" Oasis, currently making headlines thanks to their sold-out reunion tour, first played at Manchester's Boardwalk club, which closed in 1999, and famously went on to play stadiums and their huge Knebworth gigs within the space of a few years. GigPig, the live music marketplace behind Seed Sounds, says the seed sector collectively hosts more than three million gigs annually, supports more than 43,000 active musicians, and contributes an estimated £2.4bn to the UK economy. \"The erosion of funding for seed and grassroots spaces is part of a wider liberal tendency to strip away the socially democratic infrastructure that actually makes art possible,\" said Healy. \"What's left is a cultural economy where only the privileged can afford to create, and where only immediately profitable art survives.\" He described the Seed Sounds Weekender as \"a vital reminder that music doesn't start in boardrooms or big arenas - it starts in back rooms, pubs, basements, and independent spaces run on love, grit, and belief in something bigger.\" Read more from Sky News:Oasis photographers recall the early daysHeavy metal to reality TV: The wild life of Ozzy Osbourne The importance of funding for grassroots venues has been highlighted in the past few years, with more than 200 closing or stopping live music in 2023 and 2024, according to the Music Venue Trust. Sheffield's well-known Leadmill venue saw its last gig in its current form in June, after losing a long-running eviction battle. In May, Culture Secretary Lisa Nandy announced the £85m Creative Foundations Fund to support arts venues across England. And last year, the Culture, Media and Sport Committee called for a levy on tickets to large concerts at stadiums and arenas to help fund grassroots venues, which artists including Coldplay and Katy Perry, and venues including the Royal Albert Hall, have backed. But most seed venues - the smaller spaces in the hospitality sector that provide a platform before artists get to ticketed grassroots gigs or bigger stages - won't qualify for the levy. GigPig is working to change this by formalising the seed music venue space as a recognised category. \"The UK's seed venues are where music careers are born,\" said GigPig co-founder Kit Muir-Rogers. \"Collectively, this space promotes more music than any other in the live music business, yet it has gone overlooked and under-appreciated.\" The Seed Sounds Weekender takes place from 26-28 September and will partner with Uber to give attendees discounted rides to and from venues. Tickets for most of the gigs will be free, with events taking place across 20 UK towns and cities including London, Liverpool, Birmingham, Manchester, Glasgow, Leicester, Newcastle and Southampton"
    },
    {
        "title": "Two killed in stabbing at business premises in London",
        "description": "Two men have died after a stabbing in central London.",
        "url": "https://news.sky.com/story/two-killed-in-stabbing-at-business-premises-in-london-13403183",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southwark-stabbing_6976452.jpg?20250728221441",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 17:59:00",
        "Headline": "Two other men are in hospital, including one who has been detained in connection with the incident.",
        "Content": "Two men have died after a stabbing in central London. Police were called to a business premises in Long Lane, Southwark, at 1pm on Monday, where they found four people had been stabbed. A 58-year-old man died at the scene while three others were taken to hospital, the Metropolitan Police said. These included a 27-year-old man who has since died. A third man, who is in his thirties, remains in hospital with injuries described as non-life-threatening. Another man in his thirties, who has been detained in connection with the incident, remains in a life-threatening condition in hospital. Read more:The party drug destroying livesTasers to be used in prisons for first time A local man who did not want to be named said apartments in the area \"are really expensive\" and added of the incident: \"You wouldn't expect it.\" Detective Chief Superintendent Emma Bond said: \"Our investigation is in the early stages and we are working hard to understand the full circumstances of this shocking incident. \"At this point, we do not believe it to be terrorism-related and there is no further risk to the public.\" Natasha Ennin, Southwark Council's cabinet member for community safety and neighbourhoods, said: \"I'm horrified and deeply saddened by the deaths of two men in our borough today. \"My heartfelt condolences go to their families and friends.\""
    },
    {
        "title": "Paul Gallagher, older brother of Oasis stars Noel and Liam, is charged with offences including rape",
        "description": "Paul Gallagher, the older brother of Oasis stars Noel and Liam, has been charged with multiple offences including rape.",
        "url": "https://news.sky.com/story/paul-gallagher-older-brother-of-oasis-stars-noel-and-liam-is-charged-with-offences-including-rape-13403104",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-paul-gallagher-premiere_6976152.jpg?20250728153812",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 14:02:00",
        "Headline": "The 59-year-old is also facing other charges including three counts of sexual assault and three counts of intentional strangulation, the Metropolitan Police said. ",
        "Content": "Paul Gallagher, the older brother of Oasis stars Noel and Liam, has been charged with multiple offences including rape. The Metropolitan Police said Gallagher, 59, of East Finchley, north London, has been charged with rape, coercive and controlling behaviour, three counts of sexual assault, three counts of intentional strangulation, two counts of making a threat to kill and assault occasioning actual bodily harm. The offences are reported to have taken place between 2022 and 2024. The charges follow an investigation which began last year, the force added in a statement. A woman is being supported by specially-trained officers, the statement continued. Paul Gallagher, who is about one year older than Noel and seven years older than Liam, has never been involved in Oasis. He is due to appear at Westminster Magistrates' Court on 27 August."
    },
    {
        "title": "Three killed in Turks and Caicos Islands' first mass shooting in recent history, authorities say",
        "description": "Three young men have been killed in the Turks and Caicos Islands, in what authorities are calling the British territory's first mass shooting in recent history.",
        "url": "https://news.sky.com/story/three-killed-in-turks-and-caicos-islands-first-mass-shooting-in-recent-history-authorities-say-13403144",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-providenciales-turks-and-caicos_6976303.jpg?20250728184545",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-28 16:00:00",
        "Headline": "The territory's premier Charles Washington Misick likened the shooting to a \"gangland-type slaying\". He added: \"What is happening here is unlike anything we've ever seen before.\"",
        "Content": "Three young men have been killed in the Turks and Caicos Islands, in what authorities are calling the British territory's first mass shooting in recent history. A further 10 people were injured in the incident at a popular nightspot on Providenciales, the archipelago's main island, early on Sunday. At least four suspects were involved but there have not yet been any arrests, police commissioner Fitz Bailey said - as he labelled the incident \"deeply disturbing\". The territory's premier, Charles Washington Misick, said at a news conference: \"What is happening here is unlike anything we've ever seen before. This is not a situation we should accept.\" He likened the incident to a \"gangland-type slaying\" and said the \"gang violence\" appears to be linked to Turks and Caicos' Haitian communities. Mr Misick called on the Haitian community to cooperate with police, claiming some of them know how guns are being smuggled to Turks and Caicos. The hospital in Providenciales was on lockdown to protect those being treated for their injuries, acting governor Anya Williams said. At least two of the people injured were flown overseas for further treatment, she added. Read more:Why are airdrops on Gaza so dangerous?Celebrity monk under criminal investigation Turks and Caicos - a British Overseas Territory - is known for its exclusive, luxurious resorts and pristine beaches, and is around 300km (186 miles) north of Haiti and the Dominican Republic. It is home to an estimated 10,900 Haitians, representing a third of the population. Around 80% of Haitians live in Providenciales and 20% have permanent residency, according to the United Nations humanitarian affairs office."
    },
    {
        "title": "Starmer ran the gauntlet with Trump but just about emerged intact",
        "description": "When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians.",
        "url": "https://news.sky.com/story/starmer-ran-the-gauntlet-with-trump-but-just-about-emerged-intact-13403179",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-keir-starmer_6976022.jpg?20250728125041",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-07-28 17:55:00",
        "Headline": "Sir Keir Starmer and Donald Trump held a long televised meeting with questions from the media covering a wide range of issues.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians. Not with Donald Trump. Sir Keir Starmer ran the gauntlet on Monday. Trump latest: President treats PM to a ride on Air Force One Put through a total of almost 90 minutes of televised questioning alongside the American leader, it was his diciest encounter with the president yet. But he still just about emerged intact. For a start, he can claim substantive policy wins after Trump announced extra pressure on Vladimir Putin to negotiate a ceasefire and dialled up the concern over the devastating scenes coming from Gaza. \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 There were awkward moments aplenty though.  Top of the list is Mr Trump's trashing of the prime minister's Labour colleague, London mayor Sir Sadiq Khan. But more important than that, Monday's meeting was the clearest representation of the political gulf that separates the two leaders. \"He's slightly more liberal than me,\" Mr Trump said of Sir Keir when he arrived in Scotland. What an understatement. Read more:Trump reignites row with Sir Sadiq KhanEU leaders resigned to US trade deal On green energy, immigration, taxation and online regulation, the differences were clear to see. Sir Keir just about managed to paper over the cracks by chuckling at times, choosing his interventions carefully and always attempting to sound eminently reasonable. At times, it had the energy of a man being forced to grin and bear inappropriate comments from his in-laws at an important family dinner. But hey, it stopped a full Trump implosion - so I suppose that's a win. My main takeaway from this Scotland visit though is not so much the political gulf present between the two men, but the gulf in power.  Sir Keir flew the length of the country he leads to be the guest at the visiting president's resort. He was then forced to sit through more than an hour of uncontrolled, freewheeling questioning from a man most of his party and voters despise, during which he was offered unsolicited advice on how to beat Nigel Farage and criticised (albeit indirectly) on key planks of his government's policy platform. In return he got warm words about him (and his wife) and relatively incremental announcements on two foreign policy priorities. So why does he do it? Because, to borrow a quote from a popular American political TV series: \"Air Force One is a big plane and it makes a hell of a noise when it lands on your head.\""
    },
    {
        "title": "Lionesses parade: The route and key timings as thousands of England fans to descend on central London",
        "description": "The Lionesses will celebrate with thousands of England fans in central London today as the players take part in an open-top bus procession.",
        "url": "https://news.sky.com/story/lionesses-victory-parade-route-timings-and-whats-next-for-englands-women-after-euros-victory-13402884",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-england-lionesses_6976489.jpg?20250729015605",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 06:49:00",
        "Headline": "The England players will celebrate the defence of their Women's Euros title with an open-top bus parade today. Here is everything you need to know.",
        "Content": " The Lionesses will celebrate with thousands of England fans in central London today as the players take part in an open-top bus procession. The bus will carry the team through central London, allowing supporters to celebrate the team's defence of their Women's Euros title alongside the likes of Leah Williamson and Chloe Kelly and catch a glimpse of the silverware. Here is all you need to know. Where will the parade go and when? The team's open-top bus will travel along The Mall from 12.10pm. It will end with a staged ceremony at the Queen Victoria Memorial in front of Buckingham Palace, which is expected to start at roughly 12.30pm and end at 1pm, the Football Association (FA) announced. The Royal Marines Portsmouth band and the Central Band of the Royal Air Force will perform on the stage and highlights from the tournament will be shown on big screens. England manager Sarina Wiegman will then lead her triumphant team out on stage to lift the trophy. The event will be hosted by former Lioness and football pundit Alex Scott. Fans will be able to attend the event for free, but the FA have warned that the capital is going to be \"very busy\". \"People should plan their visits carefully, both coming into central London and travelling home,\" the association said. How to watch You can watch coverage of the entire event live on Sky News from 10am and follow all the action with our live blog. Fans can also follow coverage of the event on the BBC, ITV and across England's social media channels. Celebrations with the deputy PM The Lionesses landed back in the UK from Basel, Switzerland, on Monday, where celebrations continued with a reception at Downing Street. Deputy Prime Minister Angela Rayner and sports minister Stephanie Peacock hosted the team ahead of today's bus parade.  Sir Keir Starmer said: \"The Lionesses have once again captured the hearts of the nation. \"Their victory is not only a remarkable sporting achievement, but an inspiration for young people across the country.\"  An extra bank holiday? As the team have become the first senior England side to win a major tournament on foreign soil, some have called for an extra bank holiday to mark the occasion. Liberal Democrats leader Ed Davey was one of those who asked the prime minister if it was \"time for that bank holiday\". He was referring to comments made by Sir Keir in 2023. When, as leader of the opposition, he wrote on X that there \"should be a celebratory bank holiday if the Lionesses bring it home\". But with estimates suggesting an extra bank holiday would cost the economy £2.4bn, it's understood such a move isn't being planned by Downing Street. 'There is no stopping them now' The impact of the Lionesses second consecutive Euros title is already being felt across the UK. At Bearsted Football Club in Maidstone, Kent, a mural of Alessia Russo, who levelled Sunday's final with a goal in the 56th minute, has been unveiled. The club is where Russo first started playing, and chairman Jamie Houston told Sky News the Lionesses have helped transform the women's game. \"Five years ago we never had a girl's football team,\" he told Sky correspondent Mollie Malone. \"Now we have five separate teams for girls, and boys are accepting of more girls in the game. \"There is no stopping them now.\"  Read more:In pictures: The story of the Euros final Fans celebrate at club where Lioness began journeyAnalysis: England showed resolve and relentlessness Lynda Hale, who played in the England squad in the first ever international women's match against Scotland in 1972, reiterated that women's football has changed drastically since she played. \"When I first started playing there was hardly anyone that would watch,\" she told Sky News Breakfast. \"To put on the England shirt and think what we started has grown to this magnitude, and it is still going to grow, is absolutely fantastic. I think the sky's the limit in women's football.\" Asked what advice she would have for the current England squad after their win, Ms Hale said: \"The girls need to make as many memories as they can and take everything in their stride.\""
    },
    {
        "title": "Suspect in fatal shooting of mother and her two children in Northern Ireland dies in hospital",
        "description": "The suspect in the fatal shooting of a mother and her two children in Northern Ireland has died.",
        "url": "https://news.sky.com/story/suspect-in-fatal-shooting-of-mother-and-her-two-children-in-northern-ireland-dies-in-hospital-13403264",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-vanessa-whyte-james-rutledge_6972482.jpg?20250724122142",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 22:27:00",
        "Headline": "Vanessa Whyte, her 14-year-old son James and 13-year-old daughter Sara were shot dead at a property in Maguiresbridge last week.",
        "Content": "The suspect in the fatal shooting of a mother and her two children in Northern Ireland has died. Ian Rutledge, a 43-year-old agricultural worker, had himself suffered a gunshot wound during the attack in the village of Maguiresbridge in County Fermanagh on Wednesday morning. He was taken to hospital where he remained in a serious condition until the Police Service of Northern Ireland (PSNI) announced he had died on Monday evening. It is understood he was the only suspect in the murder investigation. Vanessa Whyte, 45, a vet originally from County Clare, her son James, 14, and daughter Sara, 13, were all shot dead at a property on Drummeer Road during the attack. The PSNI said last week that all four people who were shot were members of the same household. Police have been investigating whether the attack was a triple murder and attempted suicide. A prayer service took place for Ms Whyte and the two children in Barefield, County Clare on Sunday, following a community vigil in Maguiresbridge last Friday. A funeral service is expected to take place in County Clare later this week. Following Mr Rutledge's death, the PSNI said detectives have \"reiterated their appeal for anyone with information, no matter how insignificant it may seem, to come forward\". It comes after the PSNI issued an appeal on Saturday for information involving the movements of a vehicle. They have asked anyone who saw a silver Mercedes saloon car being driven in the Clones Road area of Newtownbutler, or between Maguiresbridge and Newtownbutler, on the evening of Tuesday 22 July to call detectives on 101. Read more from Sky News:Lionesses celebrate Euros triumph at No 10Trump reignites row with London mayorThe view from a plane dropping aid to Gaza Tributes paid to 'lovely-natured' children A local Gaelic football club said last week that Ms White and her children were all \"active and beloved\" members of their club. Sara and James Rutledge also used to be part of a local cricket club, which said in a statement that it was \"extremely saddened by the tragic events\". \"Both of them turned out to be talented young cricketers and two absolutely lovely-natured children,\" the statement read. Flowers, teddy bears and an Arsenal football top with written notes were laid close to scene of the incident in Drummeer Road in the days after the shooting."
    },
    {
        "title": "Trump reignites row with 'nasty' Sadiq Khan as Starmer responds",
        "description": "Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\".",
        "url": "https://news.sky.com/story/trump-reignites-row-with-nasty-sadiq-khan-as-starmer-responds-13403126",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-sadiq-khan_6976221.jpg?20250728161225",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 15:00:00",
        "Headline": "The London mayor had tried to strike a more conciliatory tone after previously trading insults with Donald Trump - but the row is back on.",
        "Content": " Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\". During an hour-long news conference with Sir Keir Starmer in Scotland, the US president hit out at the Labour mayor, who has responded with his own snipey remarks. Trump latest: US leader gives Putin new deadline to end war Asked if he would visit London during his state visit in September, Mr Trump said: \"I will, I'm not a fan of your mayor, I think he's done a terrible job. \"A nasty person, I think.\" The prime minister then interrupted and said: \"He's a friend of mine.\" But the president added: \"I think he's done a terrible job but I will certainly visit London, I hope so.\" \n                  Starmer ran the gauntlet with Trump but just about emerged intact\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 Sir Sadiq's spokesperson then released a statement saying: \"Sadiq is delighted that President Trump wants to come to the greatest city in the world. \"He'd see how our diversity makes us stronger not weaker; richer, not poorer. \"Perhaps these are the reasons why a record number of Americans have applied for British citizenship under his presidency.\" They noted that Sir Sadiq has won three mayoral elections, including when Mr Trump lost the US election in 2020. This is not the first time Mr Trump and Sir Sadiq have locked horns. Read more:US and EU agree trade dealScots divided as Trump heads to Turnberry During his first presidential term, Mr Trump called the London mayor a \"stone cold loser who should focus on crime in London\". Sir Sadiq then described Mr Trump as a \"poster boy for racists\". And in November 2024, after Mr Trump won his second term, Sir Sadiq said many Londoners would be \"fearful\" about what it would \"mean for democracy\". However, as Sir Keir tried to show diplomacy with Mr Trump after becoming PM, Sir Sadiq said he \"wanted to work closely with the American president\" ahead of his inauguration in January. The London mayor said as somebody \"who believes in democracy, and voting and elections, we should recognise the fact that Donald Trump is the elected president of the United States\". But he added: \"Let's keep our fingers crossed that this president is different from the last time he was president.\""
    },
    {
        "title": "Starmer ran the gauntlet with Trump but just about emerged intact",
        "description": "When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians.",
        "url": "https://news.sky.com/story/starmer-ran-the-gauntlet-with-trump-but-just-about-emerged-intact-13403179",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-keir-starmer_6976022.jpg?20250728125041",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-07-28 17:55:00",
        "Headline": "Sir Keir Starmer and Donald Trump held a long televised meeting with questions from the media covering a wide range of issues.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians. Not with Donald Trump. Sir Keir Starmer ran the gauntlet on Monday. Trump latest: President treats PM to a ride on Air Force One Put through a total of almost 90 minutes of televised questioning alongside the American leader, it was his diciest encounter with the president yet. But he still just about emerged intact. For a start, he can claim substantive policy wins after Trump announced extra pressure on Vladimir Putin to negotiate a ceasefire and dialled up the concern over the devastating scenes coming from Gaza. \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 There were awkward moments aplenty though.  Top of the list is Mr Trump's trashing of the prime minister's Labour colleague, London mayor Sir Sadiq Khan. But more important than that, Monday's meeting was the clearest representation of the political gulf that separates the two leaders. \"He's slightly more liberal than me,\" Mr Trump said of Sir Keir when he arrived in Scotland. What an understatement. Read more:Trump reignites row with Sir Sadiq KhanEU leaders resigned to US trade deal On green energy, immigration, taxation and online regulation, the differences were clear to see. Sir Keir just about managed to paper over the cracks by chuckling at times, choosing his interventions carefully and always attempting to sound eminently reasonable. At times, it had the energy of a man being forced to grin and bear inappropriate comments from his in-laws at an important family dinner. But hey, it stopped a full Trump implosion - so I suppose that's a win. My main takeaway from this Scotland visit though is not so much the political gulf present between the two men, but the gulf in power.  Sir Keir flew the length of the country he leads to be the guest at the visiting president's resort. He was then forced to sit through more than an hour of uncontrolled, freewheeling questioning from a man most of his party and voters despise, during which he was offered unsolicited advice on how to beat Nigel Farage and criticised (albeit indirectly) on key planks of his government's policy platform. In return he got warm words about him (and his wife) and relatively incremental announcements on two foreign policy priorities. So why does he do it? Because, to borrow a quote from a popular American political TV series: \"Air Force One is a big plane and it makes a hell of a noise when it lands on your head.\""
    },
    {
        "title": "The 1975 star Matty Healy warns of musical 'silence' without small stages as he backs new UK-wide festival",
        "description": "The 1975 frontman Matty Healy has warned of a musical \"silence\" that would come without the pubs and bars that give UK artists their first chance to perform.",
        "url": "https://news.sky.com/story/the-1975-star-matty-healy-warns-of-musical-silence-without-small-stages-as-he-backs-new-uk-wide-festival-13403105",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-the-1975-glastonbury_6976143.jpg?20250728151622",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-28 13:56:00",
        "Headline": "Matty Healy is an ambassador for the new Seed Sounds Weekender, a UK-wide festival championing the pubs, bars and clubs that host artists when they are starting out.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The 1975 frontman Matty Healy has warned of a musical \"silence\" that would come without the pubs and bars that give UK artists their first chance to perform. Fresh from headlining Glastonbury in June, Healy is backing a new UK-wide festival which will see more than 2,000 gigs taking place across more than 1,000 \"seed\" venues in September. The Seed Sounds Weekender aims to celebrate the hospitality sector hosting bands and singers just as they are starting out - and for some, before they go on to become global superstars. Healy, who is an ambassador for the event, said in a statement to Sky News: \"Local venues aren't just where bands cut their teeth, they're the foundation of any real culture. \"Without them, you don't get The Smiths, Amy Winehouse, or The 1975. You get silence.\" Oasis, currently making headlines thanks to their sold-out reunion tour, first played at Manchester's Boardwalk club, which closed in 1999, and famously went on to play stadiums and their huge Knebworth gigs within the space of a few years. GigPig, the live music marketplace behind Seed Sounds, says the seed sector collectively hosts more than three million gigs annually, supports more than 43,000 active musicians, and contributes an estimated £2.4bn to the UK economy. \"The erosion of funding for seed and grassroots spaces is part of a wider liberal tendency to strip away the socially democratic infrastructure that actually makes art possible,\" said Healy. \"What's left is a cultural economy where only the privileged can afford to create, and where only immediately profitable art survives.\" He described the Seed Sounds Weekender as \"a vital reminder that music doesn't start in boardrooms or big arenas - it starts in back rooms, pubs, basements, and independent spaces run on love, grit, and belief in something bigger.\" Read more from Sky News:Oasis photographers recall the early daysHeavy metal to reality TV: The wild life of Ozzy Osbourne The importance of funding for grassroots venues has been highlighted in the past few years, with more than 200 closing or stopping live music in 2023 and 2024, according to the Music Venue Trust. Sheffield's well-known Leadmill venue saw its last gig in its current form in June, after losing a long-running eviction battle. In May, Culture Secretary Lisa Nandy announced the £85m Creative Foundations Fund to support arts venues across England. And last year, the Culture, Media and Sport Committee called for a levy on tickets to large concerts at stadiums and arenas to help fund grassroots venues, which artists including Coldplay and Katy Perry, and venues including the Royal Albert Hall, have backed. But most seed venues - the smaller spaces in the hospitality sector that provide a platform before artists get to ticketed grassroots gigs or bigger stages - won't qualify for the levy. GigPig is working to change this by formalising the seed music venue space as a recognised category. \"The UK's seed venues are where music careers are born,\" said GigPig co-founder Kit Muir-Rogers. \"Collectively, this space promotes more music than any other in the live music business, yet it has gone overlooked and under-appreciated.\" The Seed Sounds Weekender takes place from 26-28 September and will partner with Uber to give attendees discounted rides to and from venues. Tickets for most of the gigs will be free, with events taking place across 20 UK towns and cities including London, Liverpool, Birmingham, Manchester, Glasgow, Leicester, Newcastle and Southampton"
    },
    {
        "title": "Two killed in stabbing at business premises in London",
        "description": "Two men have died after a stabbing in central London.",
        "url": "https://news.sky.com/story/two-killed-in-stabbing-at-business-premises-in-london-13403183",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-southwark-stabbing_6976452.jpg?20250728221441",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 17:59:00",
        "Headline": "Two other men are in hospital, including one who has been detained in connection with the incident.",
        "Content": "Two men have died after a stabbing in central London. Police were called to a business premises in Long Lane, Southwark, at 1pm on Monday, where they found four people had been stabbed. A 58-year-old man died at the scene while three others were taken to hospital, the Metropolitan Police said. These included a 27-year-old man who has since died. A third man, who is in his thirties, remains in hospital with injuries described as non-life-threatening. Another man in his thirties, who has been detained in connection with the incident, remains in a life-threatening condition in hospital. Read more:The party drug destroying livesTasers to be used in prisons for first time A local man who did not want to be named said apartments in the area \"are really expensive\" and added of the incident: \"You wouldn't expect it.\" Detective Chief Superintendent Emma Bond said: \"Our investigation is in the early stages and we are working hard to understand the full circumstances of this shocking incident. \"At this point, we do not believe it to be terrorism-related and there is no further risk to the public.\" Natasha Ennin, Southwark Council's cabinet member for community safety and neighbourhoods, said: \"I'm horrified and deeply saddened by the deaths of two men in our borough today. \"My heartfelt condolences go to their families and friends.\""
    },
    {
        "title": "Paul Gallagher, older brother of Oasis stars Noel and Liam, is charged with offences including rape",
        "description": "Paul Gallagher, the older brother of Oasis stars Noel and Liam, has been charged with multiple offences including rape.",
        "url": "https://news.sky.com/story/paul-gallagher-older-brother-of-oasis-stars-noel-and-liam-is-charged-with-offences-including-rape-13403104",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-paul-gallagher-premiere_6976152.jpg?20250728153812",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 14:02:00",
        "Headline": "The 59-year-old is also facing other charges including three counts of sexual assault and three counts of intentional strangulation, the Metropolitan Police said. ",
        "Content": "Paul Gallagher, the older brother of Oasis stars Noel and Liam, has been charged with multiple offences including rape. The Metropolitan Police said Gallagher, 59, of East Finchley, north London, has been charged with rape, coercive and controlling behaviour, three counts of sexual assault, three counts of intentional strangulation, two counts of making a threat to kill and assault occasioning actual bodily harm. The offences are reported to have taken place between 2022 and 2024. The charges follow an investigation which began last year, the force added in a statement. A woman is being supported by specially-trained officers, the statement continued. Paul Gallagher, who is about one year older than Noel and seven years older than Liam, has never been involved in Oasis. He is due to appear at Westminster Magistrates' Court on 27 August."
    },
    {
        "title": "Mum pleads guilty to manslaughter of toddler who died after being found in pond",
        "description": "A woman has pleaded guilty to the manslaughter of her two-year-old daughter, who died after being found in a pond.",
        "url": "https://news.sky.com/story/mum-pleads-guilty-to-manslaughter-of-toddler-who-died-after-being-found-in-pond-13403092",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-annabel-mackey-mackey_6846249.jpg?20250304182742",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 13:31:00",
        "Headline": "Alice Mackey, 42, admitted killing Annabel Mackey in Kingsley, Hampshire, in September 2023.",
        "Content": "A woman has pleaded guilty to the manslaughter of her two-year-old daughter, who died after being found in a pond. Alice Mackey, 42, admitted killing Annabel Mackey in Kingsley, Hampshire, in September 2023. The two-year-old went missing from her home on 10 September.   She was found a short time later unresponsive at Kingsley Pond. Annabel was taken to hospital in a serious condition, but died the following afternoon. \n                  'I lost my father to suicide': Schoolgirl's assembly on the hardest of subjects\n                 \n                  Shocking footage shows near-misses on level crossings\n                 \n                  Boy, 16, arrested on suspicion of murder after elderly couple die in house fire\n                 Mackey entered the plea at Winchester Crown Court. She entered a not guilty plea to a charge of murder, which the court heard was acceptable to the prosecution, as reports by two psychiatrists showed she was in a state of \"diminished responsibility\" at the time of the incident. Judge Christopher Parker KC adjourned the case for sentencing on 6 October. He remanded Mackey into custody until then."
    },
    {
        "title": "'No other drug does this amount of damage so quickly to your kidneys and bladder': How party drug is ruining lives",
        "description": null,
        "url": "https://news.sky.com/story/it-destroyed-my-life-the-drug-addiction-leaving-users-in-chronic-pain-13402841",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-shingi-ketamine_6974676.png?20250727181525",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-28 02:35:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Tasers to be used in prisons to tackle 'unacceptably high' levels of violence ",
        "description": "Tasers can be used in prisons for the first time to tackle \"unacceptably high\" levels of violence, as part of a new trial.",
        "url": "https://news.sky.com/story/tasers-to-be-used-in-prisons-to-tackle-unacceptably-high-levels-of-violence-13402582",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-taser-police_6975235.jpg?20250727155524",
        "type": "UK",
        "Author": "Mollie Malone",
        "Date Published": "2025-07-28 03:01:00",
        "Headline": "Specialist officers will use the devices - the same as those used by police - in adult male prisons in England and Wales as part of Justice Secretary Shabana Mahmood's promise to \"keep prison staff safe\".",
        "Content": "\n          Home news correspondent\n              @Mollie_Malone1\n  Tasers can be used in prisons for the first time to tackle \"unacceptably high\" levels of violence, as part of a new trial. Justice Secretary Shabana Mahmood has said she is \"determined to keep prison staff safe\". Specialist officers from two bases in Oxfordshire and Doncaster can now be deployed to incidents in adult male prisons in England and Wales, equipped with Tasers. Reporters attending a demonstration were shown how they could be used in certain scenarios, where there is a threat to safety, including hostage situations or riots, and where multiple people are involved in \"mass disorder\". One demonstration involved four prisoners who had become disruptive in the exercise yard. After staff were forced to withdraw, three inmates turned on one and it was deemed there was an \"immediate threat to life.\" Officers gave verbal warnings before deploying the Tasers at a distance. \n                  Foreign prisoners to be deported earlier under new plans \n                 \n                  Sentencing guidelines for ethnic minority suspects delayed after backlash\n                 \n                  What action has the justice secretary taken against the Sentencing Council?\n                 This trial will use the Taser 7 model, which is what police officers currently use. It can generate 50,000 volts when triggered, but drops to about 1,500 volts when hitting the target. In a separate hostage situation, officers used pyrotechnics which produced loud bangs and smoke to distract an aggressive \"inmate\" before putting them in handcuffs. At first, specialist national officers from the two bases can be deployed if such incidents occur. It's understood at the moment these teams get 800 callouts a year - averaging just over two a day. The trial will run until enough data is collected to determine whether Tasers should be rolled out more widely. Ms Mahmood said she intends to have further updates in the autumn and will \"consider\" whether local staff inside jails can use them. \"From my perspective, this is very much the beginning,\" she said. Violence in prisons has been rising. In the 12 months to December there were 10,605 assaults on staff, a rise of 13% on the year before and a new peak. Serious assaults were also up 10% on the previous 12 months. Earlier this year, Manchester Arena bomb plotter Hashem Abedi attacked prison staff at the high-security jail HMP Frankland, using hot cooking oil and homemade, or improvised, weapons. The justice secretary said the incident at Frankland \"forced the pace\" of further measures to tackle violence. Southport killer Axel Rudakubana also allegedly attacked a member of staff at HMP Belmarsh by pouring hot water over them from inside his cell. The Prison Officers Association (POA) union urged ministers to consider protective equipment and stab vests for staff. Read more:Tories call for Tasers to be used in prisons'Bleak' prison in special measures Last month, the government announced the use of body armour at certain units in high-security jails, which house some of the most dangerous inmates. But while \"grateful\" for a \"step in the right direction\", the POA don't think the new measure goes far enough - and instead want specialist staff inside jails trained to use Tasers. \"It is pointless a national response being several hours away if, locally, Taser is needed to immediately preserve life and combat threat,\" Mark Fairhurst, the POA's national chairman said. Whitehall wants to consider the \"lessons\" from this trial before any potential further rollout. Ms Mahmood pointed out that while Tasers have been used for many years by the police, \"a custodial setting is different to usage in other scenarios\"."
    },
    {
        "title": "Mile after mile of grey rubble - the view from a plane dropping aid to Gaza",
        "description": "We are on our way to Gaza with the Jordanian military.",
        "url": "https://news.sky.com/story/mile-after-mile-of-grey-rubble-the-view-from-a-plane-dropping-aid-to-gaza-13403242",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jordan-gaza_6976450.jpg?20250728221159",
        "type": "World",
        "Author": "Sally Lockwood, Sky correspondent",
        "Date Published": "2025-07-28 20:54:00",
        "Headline": "Sky News goes on board a Royal Jordanian Air Force plane for one of the first aid drop flights since Israel announced they could resume.",
        "Content": "By Sally Lockwood, Sky correspondent   We are on our way to Gaza with the Jordanian military. The aircraft is hot and noisy and as we get closer, the atmosphere gets more tense. Aircrew gesture with their hands to tell us how many minutes there are to go. Fifteen. Six. One. The Jordanian military C-130 flies out over the sea before banking and heading inland for Gaza. The parachutes, attached to the top of each of the eight pallets, are prepared for the drop. As land approaches, I look down. The ground is modern and built up - we're still over southern Israel. Then a few short minutes later, it's clear we've crossed Gaza's border. The ground turns grey, the shapes of buildings disappear, there are no cars, no people. You can see the outline of communities and villages that are now flattened. Mile after mile of grey rubble. This mission by the Royal Jordanian Air Force is one of the first aid drop flights since Israel announced they could resume. It is carrying eight tonnes of food and baby formula. Foreign nations know this is a deeply flawed way of delivering aid - road convoys are far more effective and can carry far more - but the Jordanian flight crew say the need in Gaza is so urgent, it's simply an attempt to do something. When the aircraft ramp opens, the aid is pushed out and it's gone in seconds. The parachutes seem peaceful as they open and their fall slows. But dropping food from the sky is a dangerous and undignified way to feed people. On the ground it's chaos. Our colleagues in Gaza say the fighting for food has become lethal - gangs are now punching and stabbing people to reach it first. Most critically, it's not getting to the weakest. To those who really need it. One man becomes emotional as he describes racing to find food and leaving with nothing. \"I came only for my son,\" he says. \"I wouldn't come here if it was just for me. When you have a child, they need bread.\" He's an engineer in normal times and seems in disbelief that his life has come to this. \"The aid comes from the sky and we have to run after it. I've never had to do this in my life.\" Read more:Why are aid airdrops so dangerous?Inside Gaza's Nasser Hospital It is hoped Israel's humanitarian pauses in fighting will rapidly increase food distribution by road but it's very unclear how that is going. Hospitals in Gaza have reported another 14 deaths from starvation in the last 24 hours, the Gaza health ministry said on Monday. Airstrikes killed another at least 78 Palestinians across Gaza on Monday, local health officials said. We cannot verify these numbers because Israel has not allowed international journalists access to Gaza. And Monday's flight came with strict media conditions. We were told the Israeli side had warned that any shots of Gaza filmed from the air could result in these aid flights being cancelled. But Israel's tight grip has not stopped the images from Gaza getting out, horrifying people around the world. The question now is what more the international community will do about it."
    },
    {
        "title": "Israeli human rights organisations accuse country of genocide",
        "description": "Two Israeli human rights organisations have said the country is committing genocide against Palestinians in Gaza.",
        "url": "https://news.sky.com/story/israeli-human-rights-organisations-accuse-country-of-genocide-13403174",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestinians-gaza_6975778.jpg?20250728182820",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 17:22:00",
        "Headline": "The two groups are the first major voices within Israeli society to make such accusations against the state during nearly 22 months of war. Israel has denied claims of genocide.",
        "Content": " Two Israeli human rights organisations have said the country is committing genocide against Palestinians in Gaza. In reports published on Monday, B'Tselem and Physicians for Human Rights (PHR) said Israel was carrying out \"coordinated, deliberate action to destroy Palestinian society in the Gaza Strip\". The two groups are the first major voices within Israeli society to make such accusations against the state during nearly 22 months of war against Hamas. Israel has vehemently denied claims of genocide. David Mencer, a spokesperson for the government, called the allegation by the rights groups \"baseless\". He said: \"There is no intent, (which is) key for the charge of genocide... it simply doesn't make sense for a country to send in 1.9 million tonnes of aid, most of that being food, if there is an intent of genocide.\" B'Tselem director Yuli Novak called for urgent action, saying: \"What we see is a clear, intentional attack on civilians in order to destroy a group.\" The organisation's report \"is one we never imagined we would have to write,\" Ms Novak said. \"The people of Gaza have been displaced, bombed, and starved, left completely stripped of their humanity and rights.\" \n                  Mile after mile of grey rubble - the view from a plane dropping aid to Gaza\n                 \n                  Why are airdrops on Gaza so dangerous?\n                 \n                  Israel announces 'tactical pause' in fighting - as Jordan and UAE start Gaza aid drops\n                 PHR said Israel's military campaign shows evidence of a \"deliberate and systemic dismantling of Gaza's health and life-sustaining systems\". Both organisations said Israel's Western allies were enabling the genocidal campaign, and shared responsibility for suffering in Gaza. \"It couldn't happen without the support of the Western world,\" Ms Novak said. \"Any leader that is not doing whatever they can to stop it is part of this horror.\" Hamas said the reports by the two groups were a \"clear and unambiguous testimony from within Israeli society itself regarding the grave crimes perpetrated by the occupation regime against our people\". Read more:Why are airdrops on Gaza so dangerous?UN: 'Vast amounts of aid needed to stave off catastrophic health crisis'  Dire humanitarian conditions Since Israel launched its offensive in Gaza following the deadly Hamas attack on 7 October 2023, nearly 60,000 people - mostly civilians - have been killed, according to Gaza health officials. Much of the infrastructure has been destroyed, and nearly the whole population of more than two million has been displaced. An increasing number of people in Gaza are also dying from starvation and malnutrition, according to Gaza health authorities. On Monday, the Gaza health ministry reported that at least 14 people had died from starvation and malnutrition in the past 24 hours, raising the total number of hunger-related deaths during the war to 147. Among the victims were 88 children, with most of the deaths occurring in recent weeks. UN agencies say the territory is running out of food for its people and accuse Israel of not allowing enough aid deliveries to the enclave. Israel denies those claims. Israeli Prime Minister Benjamin Netanyahu on Sunday said \"there is no starvation in Gaza\" and vowed to fight on against Hamas.  US President Donald Trump said on Monday that many in Gaza are facing starvation and implied that Israel could take further steps to improve humanitarian access. Israel has repeatedly said its actions in Gaza are in self-defence, placing full responsibility for civilian casualties on Hamas. It cites the militant group's refusal to release hostages, surrender, or stop operating within civilian areas - allegations that Hamas denies."
    },
    {
        "title": "Trump reignites row with 'nasty' Sadiq Khan as Starmer responds",
        "description": "Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\".",
        "url": "https://news.sky.com/story/trump-reignites-row-with-nasty-sadiq-khan-as-starmer-responds-13403126",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-sadiq-khan_6976221.jpg?20250728161225",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 15:00:00",
        "Headline": "The London mayor had tried to strike a more conciliatory tone after previously trading insults with Donald Trump - but the row is back on.",
        "Content": " Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\". During an hour-long news conference with Sir Keir Starmer in Scotland, the US president hit out at the Labour mayor, who has responded with his own snipey remarks. Trump latest: US leader gives Putin new deadline to end war Asked if he would visit London during his state visit in September, Mr Trump said: \"I will, I'm not a fan of your mayor, I think he's done a terrible job. \"A nasty person, I think.\" The prime minister then interrupted and said: \"He's a friend of mine.\" But the president added: \"I think he's done a terrible job but I will certainly visit London, I hope so.\" \n                  Starmer ran the gauntlet with Trump but just about emerged intact\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 Sir Sadiq's spokesperson then released a statement saying: \"Sadiq is delighted that President Trump wants to come to the greatest city in the world. \"He'd see how our diversity makes us stronger not weaker; richer, not poorer. \"Perhaps these are the reasons why a record number of Americans have applied for British citizenship under his presidency.\" They noted that Sir Sadiq has won three mayoral elections, including when Mr Trump lost the US election in 2020. This is not the first time Mr Trump and Sir Sadiq have locked horns. Read more:US and EU agree trade dealScots divided as Trump heads to Turnberry During his first presidential term, Mr Trump called the London mayor a \"stone cold loser who should focus on crime in London\". Sir Sadiq then described Mr Trump as a \"poster boy for racists\". And in November 2024, after Mr Trump won his second term, Sir Sadiq said many Londoners would be \"fearful\" about what it would \"mean for democracy\". However, as Sir Keir tried to show diplomacy with Mr Trump after becoming PM, Sir Sadiq said he \"wanted to work closely with the American president\" ahead of his inauguration in January. The London mayor said as somebody \"who believes in democracy, and voting and elections, we should recognise the fact that Donald Trump is the elected president of the United States\". But he added: \"Let's keep our fingers crossed that this president is different from the last time he was president.\""
    },
    {
        "title": "Five people including police officer killed after shooting at New York skyscraper",
        "description": "Five people, including a police officer, have died after a shooting at a New York skyscraper.",
        "url": "https://news.sky.com/story/active-shooter-incident-in-new-york-city-as-police-officer-among-at-least-two-people-shot-13403118",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-new-york-shooting-manhattan-shooting_6976486.jpg?20250729010158",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 14:23:00",
        "Headline": "The suspect has been identified as a 27-year-old man from Las Vegas called Shane Devon Tamura, according to reports in the US.",
        "Content": "Five people, including a police officer, have died after a shooting at a New York skyscraper. The lone gunman is also dead from a self-inflicted gunshot wound, officials said. The suspect was identified as a 27-year-old man from Las Vegas called Shane Devon Tamura, four senior law enforcement officials told Sky News' US partner network NBC News. His motive is not yet clear. The New York Police Department (NYP) confirmed the fatalities, while it was reported the police officer who died was off duty. The shooting is reported to have happened at 345 Park Avenue - a skyscraper in Midtown Manhattan which houses both the headquarters of the investment firm Blackstone and the National Football League (NFL). It also houses offices belonging to KPMG, as well as the consulate general of Ireland and a Bank of America branch. The gunman was wearing a bulletproof vest and carrying an assault rifle when he opened fire at the skyscraper, unnamed police sources have told the New York Post newspaper. Nekeisha Lewis, who was eating dinner in the plaza of the building at the time of the shooting, said: \"We heard the shots, I looked up and I saw the first wall of the first floor shatter. \"I realised 'oh my god' this is a shootout, it felt like you were in a war zone almost. I saw a worker run out, he was running so frantically I thought he was just trying to get away. \"By the time he got to us he said 'help, help, I've been shot'. I turned to my left and looked at him and saw he had a wound in his back, and my partner who was ahead of me had also looked at him and seen that he had a wound, that looked like an entry wound or an exit wound on the front, so (the bullet) might have gone all the way through.\" She added that the police then took over and helped the man get treatment. The New York Police Department had urged people to avoid the vicinity of East 52 Street between Park Avenue and Lexington Avenue as they searched for the suspect. It added in a post on X: \"Expect emergency vehicles & delays in the surrounding area.\" It came as Dan Bongino, deputy director of the FBI, said its agents were \"responding to provide support at the active crime scene in Manhattan\". Jessica S. Tisch, police commissioner of New York City, later wrote on X: \"UPDATE: At this time, the scene has been contained and the lone shooter has been neutralized.\" Officers close to the scene had been seen stopping cars and looking inside as the force searched for the suspect, NBC New York reported. Video from Lexington Avenue showed a police officer stop a yellow taxi SUV, having the windows be lowered and looking in the driver's front passenger seat and back seats with flashlight. The Fire Department of New York has said emergency crews were called to the Park Avenue office building Monday evening for a report of someone shot. A spokesperson said the call came in around 6.30pm local time (11.30pm UK time). New York City Mayor Eric Adams earlier wrote on X: \"New Yorkers: there is an active shooter investigation taking place in Midtown right now. Please take proper safety precautions if you are in vicinity and do not go outside if you are near Park Avenue and East 51st Street.\""
    },
    {
        "title": "Starmer ran the gauntlet with Trump but just about emerged intact",
        "description": "When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians.",
        "url": "https://news.sky.com/story/starmer-ran-the-gauntlet-with-trump-but-just-about-emerged-intact-13403179",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-keir-starmer_6976022.jpg?20250728125041",
        "type": "World",
        "Author": "Rob Powell",
        "Date Published": "2025-07-28 17:55:00",
        "Headline": "Sir Keir Starmer and Donald Trump held a long televised meeting with questions from the media covering a wide range of issues.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians. Not with Donald Trump. Sir Keir Starmer ran the gauntlet on Monday. Trump latest: President treats PM to a ride on Air Force One Put through a total of almost 90 minutes of televised questioning alongside the American leader, it was his diciest encounter with the president yet. But he still just about emerged intact. For a start, he can claim substantive policy wins after Trump announced extra pressure on Vladimir Putin to negotiate a ceasefire and dialled up the concern over the devastating scenes coming from Gaza. \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 There were awkward moments aplenty though.  Top of the list is Mr Trump's trashing of the prime minister's Labour colleague, London mayor Sir Sadiq Khan. But more important than that, Monday's meeting was the clearest representation of the political gulf that separates the two leaders. \"He's slightly more liberal than me,\" Mr Trump said of Sir Keir when he arrived in Scotland. What an understatement. Read more:Trump reignites row with Sir Sadiq KhanEU leaders resigned to US trade deal On green energy, immigration, taxation and online regulation, the differences were clear to see. Sir Keir just about managed to paper over the cracks by chuckling at times, choosing his interventions carefully and always attempting to sound eminently reasonable. At times, it had the energy of a man being forced to grin and bear inappropriate comments from his in-laws at an important family dinner. But hey, it stopped a full Trump implosion - so I suppose that's a win. My main takeaway from this Scotland visit though is not so much the political gulf present between the two men, but the gulf in power.  Sir Keir flew the length of the country he leads to be the guest at the visiting president's resort. He was then forced to sit through more than an hour of uncontrolled, freewheeling questioning from a man most of his party and voters despise, during which he was offered unsolicited advice on how to beat Nigel Farage and criticised (albeit indirectly) on key planks of his government's policy platform. In return he got warm words about him (and his wife) and relatively incremental announcements on two foreign policy priorities. So why does he do it? Because, to borrow a quote from a popular American political TV series: \"Air Force One is a big plane and it makes a hell of a noise when it lands on your head.\""
    },
    {
        "title": "Turkey wildfires: At least 17 killed as thousands flee their homes",
        "description": "Wildfires in several Turkish regions have claimed at least 17 lives in the past month, as record-breaking heatwaves and strong winds fuel devastating blazes across the eastern Mediterranean.",
        "url": "https://news.sky.com/story/turkey-wildfires-at-least-17-killed-as-thousands-flee-their-homes-13403136",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-turkey-gursu-bursa_6976119.jpg?20250728162754",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 15:10:00",
        "Headline": "Unusually high temperatures, dry conditions, and strong winds have fuelled major wildfires in Turkey and other parts of the eastern Mediterranean.",
        "Content": " Wildfires in several Turkish regions have claimed at least 17 lives in the past month, as record-breaking heatwaves and strong winds fuel devastating blazes across the eastern Mediterranean. The number of fatalities in fires outside the country's fourth-largest city, Bursa, rose to four on Monday, as two volunteer firefighters died in hospital after being pulled from a water tanker that had overturned on the way to a forest fire. Another worker had died at the scene earlier, and a firefighter suffered a fatal heart attack on Sunday. More than 3,500 residents in the area were forced to flee their homes over the weekend. The latest fatalities bring Turkey's wildfire-related number of dead to 17 since late June, including 10 rescue volunteers and forestry workers who lost their lives in a fire last Wednesday in Eskisehir, western Turkey. Although several fires have been partially contained, vast areas of forest have been destroyed by the flames. Turkey's forestry minister Ibrahim Yumakli said on Sunday that the country had battled at least 44 separate fires that day. \n                  Turkey faces 'truly great disaster', warns Erdogan amid raging wildfires and sweltering temperatures across Europe\n                 \n                  Kurdish fighters burn weapons in significant step towards peace with Turkey\n                 \n                  Wildfires break out in Turkey, Syria and Greece - with towns near Athens evacuated\n                 Two western provinces, Izmir and Bilecik, have been declared disaster areas. Read more:Firefighters tackle blazes in Greece, Turkey and AlbaniaTurkey faces 'truly great disaster' Legal action has been brought against 97 individuals across 33 of Turkey's 81 provinces in connection with the fires, according to the country's justice minister, Yilmaz Tunc. Tensions rose on Sunday evening near a police station in the village of Harmancik, 57km (35 miles) south of Bursa, after people learned that a suspected arsonist had been detained there. The angry crowd demanded the suspect be handed over but eventually dispersed after police assured them that there would be a thorough investigation. Over the weekend, wildfires also swept through Bulgaria, Albania, Montenegro, and Greece. In villages near Athens, explosions were heard as the fires spread to factories storing flammable materials, according to Reuters."
    },
    {
        "title": "Three killed in Turks and Caicos Islands' first mass shooting in recent history, authorities say",
        "description": "Three young men have been killed in the Turks and Caicos Islands, in what authorities are calling the British territory's first mass shooting in recent history.",
        "url": "https://news.sky.com/story/three-killed-in-turks-and-caicos-islands-first-mass-shooting-in-recent-history-authorities-say-13403144",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-providenciales-turks-and-caicos_6976303.jpg?20250728184545",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 16:00:00",
        "Headline": "The territory's premier Charles Washington Misick likened the shooting to a \"gangland-type slaying\". He added: \"What is happening here is unlike anything we've ever seen before.\"",
        "Content": "Three young men have been killed in the Turks and Caicos Islands, in what authorities are calling the British territory's first mass shooting in recent history. A further 10 people were injured in the incident at a popular nightspot on Providenciales, the archipelago's main island, early on Sunday. At least four suspects were involved but there have not yet been any arrests, police commissioner Fitz Bailey said - as he labelled the incident \"deeply disturbing\". The territory's premier, Charles Washington Misick, said at a news conference: \"What is happening here is unlike anything we've ever seen before. This is not a situation we should accept.\" He likened the incident to a \"gangland-type slaying\" and said the \"gang violence\" appears to be linked to Turks and Caicos' Haitian communities. Mr Misick called on the Haitian community to cooperate with police, claiming some of them know how guns are being smuggled to Turks and Caicos. The hospital in Providenciales was on lockdown to protect those being treated for their injuries, acting governor Anya Williams said. At least two of the people injured were flown overseas for further treatment, she added. Read more:Why are airdrops on Gaza so dangerous?Celebrity monk under criminal investigation Turks and Caicos - a British Overseas Territory - is known for its exclusive, luxurious resorts and pristine beaches, and is around 300km (186 miles) north of Haiti and the Dominican Republic. It is home to an estimated 10,900 Haitians, representing a third of the population. Around 80% of Haitians live in Providenciales and 20% have permanent residency, according to the United Nations humanitarian affairs office."
    },
    {
        "title": "Why are airdrops on Gaza so dangerous?",
        "description": "The United Nations has condemned airdrops on Gaza, warning they risk killing the starving Palestinians they are intended to help.",
        "url": "https://news.sky.com/story/why-are-airdrops-on-gaza-so-dangerous-13402889",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-airdrop-aid_6975746.jpg?20250728083932",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 06:59:00",
        "Headline": "Jordan, the United Arab Emirates, and Israel parachuted aid packages into the territory for the first time in months over the weekend amid claims a third of the population has not eaten for days.",
        "Content": " The United Nations has condemned airdrops on Gaza, warning they risk killing the starving Palestinians they are intended to help. Jordan, the United Arab Emirates, and Israel parachuted aid packages into the territory for the first time in months at the weekend amid claims a third of the population has not eaten for days.  But Philippe Lazzarini, commissioner-general for the UN Relief and Work Agency for Palestinian Refugees (UNRWA), has said they \"will not reverse the deepening starvation\" and often do more harm than good. 'Make or break' as starvation looms; Middle East latest \"They are expensive, inefficient & can even kill starving civilians,\" he wrote in a statement on X. What is an airdrop - and why are they dangerous? There are several ways humanitarian agencies and international allies can deliver aid to regions in need - by land, by sea, or by air. While parachuting in supply packages from planes may look impressive, airdrops are \"fraught with problems\", Sky correspondent in Jordan Sally Lockwood says, and often used as a \"desperate last resort\". \"Foreign nations know airdrops are a deeply flawed way of delivering aid,\" she says. \"Palestinian sources tell us the aid that's been dropped so far is not reaching the most vulnerable. They are an attempt to get something to a few - often viewed as a desperate last resort. Gaza is at that point.\" Read moreIsrael announces 'tactical pause' in fightingEyewitness: Aid is sitting idle in Gaza Military analyst Sean Bell says that delivering aid by air is ideally done when planes can land on a runway - but Gaza's only landing strip in Rafah was shut down in 2021. The alternative is \"very dangerous\", he warns. \"Aircraft flying relatively low and slow over a warzone isn't very clever. When these parcels hit the ground, there's a significant danger of them hitting people.\" Crucially, they can only deliver a fraction of what lorries can. \"The really big issue is aircraft can only deliver one truckload of aid. Gaza needs 500 truckloads a day, so it's 0.2% of the daily need,\" Bell adds. They also risk falling into the wrong hands and ending up on the black market. \"Some of it has been looted by gangs and is on the black market already,\" Lockwood says. Why are they happening now? Israel cut off all supplies to Gaza at the beginning of March, reopening some aid centres in May, but with restrictions they said were designed to stop goods being stolen by Hamas militants. Israeli authorities control the only three border crossings to the strip: Kerem Shalom in the south, Crossing 147 in the centre, and Erez to the north. Since the current conflict with Hamas began in October 2023, humanitarian agencies and world leaders have repeatedly accused Israel of not allowing enough deliveries through. Mr Lazzarini says the UN has \"the equivalent of 6,000 trucks\" in neighbouring Jordan and Egypt \"waiting for the green light to get into Gaza\". Israel says it has commissioned a \"one-week scale-up of aid\", having conducted its own airdrops on Saturday. In a statement over the weekend, the Israeli Defence Forces said it will work with the UN and other aid organisations to ensure aid is delivered but no more details were given. Meanwhile on Sunday, it began daily 10-hour pauses in fighting in three areas of Gaza to address the deteriorating humanitarian situation.  According to the Hamas-run health ministry, 133 Palestinians had died of malnutrition by then, including 87 children. Doctors Without Borders warned on Friday that 25% of young children and pregnant women in Gaza are malnourished. Israel says there is no famine in Gaza.  What are in the airdrops and who is behind them? Air packages are largely being delivered by C-130 planes. Jordan is reported to be using 10 and the UAE eight. They can carry eight pallets of goods each, weighing around eight tonnes in total, according to Lockwood, who is on the runway at Jordan's King Abdullah II airbase. There are no medical supplies in the packages, she says, only dried food, rice, flour, and baby formula. Prime Minister Sir Keir Starmer has said the UK will help with airdrops - but no British aircraft have been seen in Jordan so far. He discussed the situation in Gaza with his US counterpart President Donald Trump on a visit to Scotland on Monday. Speaking afterwards, Mr Trump said America is \"prepared to help\" and will be setting up \"food centres... in conjunction with some very good people\", as well as \"supplying funds\". \"We're going to be even more involved,\" he said. We did some airlifts before, some airdrops, and the people are running for it. And the prime minister's going to help us.\" The RAF delivered 110 tonnes of aid across 10 drops last year as part of a Jordanian-led international coalition - but it is not clear what level of support will be offered this time."
    },
    {
        "title": "Thailand shooting: Gunman who shot five people dead at food market 'had grudge'",
        "description": "A man who shot five people dead at a Bangkok food market \"had a personal grudge\" against security guards there who he believed scratched his car.",
        "url": "https://news.sky.com/story/thailand-shooting-gunman-kills-five-people-at-bangkoks-popular-or-tor-kor-market-13402934",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bangkok-thailand_6975843.jpg?20250728101840",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-28 08:53:00",
        "Headline": "Police say the incident was over a \"personal conflict\" and that the suspect was \"very protective of his car\".",
        "Content": " A man who shot five people dead at a Bangkok food market \"had a personal grudge\" against security guards there who he believed scratched his car. Four security guards and a stall holder were killed in the incident at Or Tor Kor market in the north of the Thai capital on Monday, police said in a statement. Two women were also injured, a spokesperson for Erawan Medical Centre added. The man, whose wife has a stall at the fresh food outlet, walked away from the scene and sat down on a bench before shooting himself dead with a handgun. Police said the incident was over a \"personal conflict\" from 2019 or 2020 and not the current fighting between Thailand and Cambodia, as had been speculated on social media. Referring to the gunman only by the nickname \"Mr Noi\", police described him as a \"person who loves and is very protective of his car\" and \"also a violent person\". He was seen wearing a black T-shirt, military shorts, baseball cap, and rucksack. The market mainly sells agricultural produce and is a popular area for Thai and foreign tourists. Read more from Sky News:'Vast amounts of aid needed to prevent health crisis in Gaza'Lionesses beat Spain to successfully defend Euros title  Gun violence is not unusual in Thailand. In October 2023, a 14-year-old suspect used a modified handgun to kill two people at a shopping centre in central Bangkok. A year earlier, a former police officer killed 36 people in a gun and knife attack at a nursery in eastern Thailand."
    },
    {
        "title": "Five people including police officer killed after shooting at New York skyscraper",
        "description": "Five people, including a police officer, have died after a shooting at a New York skyscraper.",
        "url": "https://news.sky.com/story/active-shooter-incident-in-new-york-city-as-police-officer-among-at-least-two-people-shot-13403118",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-new-york-shooting-manhattan-shooting_6976486.jpg?20250729010158",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-28 14:23:00",
        "Headline": "The suspect has been identified as a 27-year-old man from Las Vegas called Shane Devon Tamura, according to reports in the US.",
        "Content": "Five people, including a police officer, have died after a shooting at a New York skyscraper. The lone gunman is also dead from a self-inflicted gunshot wound, officials said. The suspect was identified as a 27-year-old man from Las Vegas called Shane Devon Tamura, four senior law enforcement officials told Sky News' US partner network NBC News. His motive is not yet clear. The New York Police Department (NYP) confirmed the fatalities, while it was reported the police officer who died was off duty. The shooting is reported to have happened at 345 Park Avenue - a skyscraper in Midtown Manhattan which houses both the headquarters of the investment firm Blackstone and the National Football League (NFL). It also houses offices belonging to KPMG, as well as the consulate general of Ireland and a Bank of America branch. The gunman was wearing a bulletproof vest and carrying an assault rifle when he opened fire at the skyscraper, unnamed police sources have told the New York Post newspaper. Nekeisha Lewis, who was eating dinner in the plaza of the building at the time of the shooting, said: \"We heard the shots, I looked up and I saw the first wall of the first floor shatter. \"I realised 'oh my god' this is a shootout, it felt like you were in a war zone almost. I saw a worker run out, he was running so frantically I thought he was just trying to get away. \"By the time he got to us he said 'help, help, I've been shot'. I turned to my left and looked at him and saw he had a wound in his back, and my partner who was ahead of me had also looked at him and seen that he had a wound, that looked like an entry wound or an exit wound on the front, so (the bullet) might have gone all the way through.\" She added that the police then took over and helped the man get treatment. The New York Police Department had urged people to avoid the vicinity of East 52 Street between Park Avenue and Lexington Avenue as they searched for the suspect. It added in a post on X: \"Expect emergency vehicles & delays in the surrounding area.\" It came as Dan Bongino, deputy director of the FBI, said its agents were \"responding to provide support at the active crime scene in Manhattan\". Jessica S. Tisch, police commissioner of New York City, later wrote on X: \"UPDATE: At this time, the scene has been contained and the lone shooter has been neutralized.\" Officers close to the scene had been seen stopping cars and looking inside as the force searched for the suspect, NBC New York reported. Video from Lexington Avenue showed a police officer stop a yellow taxi SUV, having the windows be lowered and looking in the driver's front passenger seat and back seats with flashlight. The Fire Department of New York has said emergency crews were called to the Park Avenue office building Monday evening for a report of someone shot. A spokesperson said the call came in around 6.30pm local time (11.30pm UK time). New York City Mayor Eric Adams earlier wrote on X: \"New Yorkers: there is an active shooter investigation taking place in Midtown right now. Please take proper safety precautions if you are in vicinity and do not go outside if you are near Park Avenue and East 51st Street.\""
    },
    {
        "title": "Starmer ran the gauntlet with Trump but just about emerged intact",
        "description": "When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians.",
        "url": "https://news.sky.com/story/starmer-ran-the-gauntlet-with-trump-but-just-about-emerged-intact-13403179",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-keir-starmer_6976022.jpg?20250728125041",
        "type": "US",
        "Author": "Rob Powell",
        "Date Published": "2025-07-28 17:55:00",
        "Headline": "Sir Keir Starmer and Donald Trump held a long televised meeting with questions from the media covering a wide range of issues.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians. Not with Donald Trump. Sir Keir Starmer ran the gauntlet on Monday. Trump latest: President treats PM to a ride on Air Force One Put through a total of almost 90 minutes of televised questioning alongside the American leader, it was his diciest encounter with the president yet. But he still just about emerged intact. For a start, he can claim substantive policy wins after Trump announced extra pressure on Vladimir Putin to negotiate a ceasefire and dialled up the concern over the devastating scenes coming from Gaza. \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 There were awkward moments aplenty though.  Top of the list is Mr Trump's trashing of the prime minister's Labour colleague, London mayor Sir Sadiq Khan. But more important than that, Monday's meeting was the clearest representation of the political gulf that separates the two leaders. \"He's slightly more liberal than me,\" Mr Trump said of Sir Keir when he arrived in Scotland. What an understatement. Read more:Trump reignites row with Sir Sadiq KhanEU leaders resigned to US trade deal On green energy, immigration, taxation and online regulation, the differences were clear to see. Sir Keir just about managed to paper over the cracks by chuckling at times, choosing his interventions carefully and always attempting to sound eminently reasonable. At times, it had the energy of a man being forced to grin and bear inappropriate comments from his in-laws at an important family dinner. But hey, it stopped a full Trump implosion - so I suppose that's a win. My main takeaway from this Scotland visit though is not so much the political gulf present between the two men, but the gulf in power.  Sir Keir flew the length of the country he leads to be the guest at the visiting president's resort. He was then forced to sit through more than an hour of uncontrolled, freewheeling questioning from a man most of his party and voters despise, during which he was offered unsolicited advice on how to beat Nigel Farage and criticised (albeit indirectly) on key planks of his government's policy platform. In return he got warm words about him (and his wife) and relatively incremental announcements on two foreign policy priorities. So why does he do it? Because, to borrow a quote from a popular American political TV series: \"Air Force One is a big plane and it makes a hell of a noise when it lands on your head.\""
    },
    {
        "title": "Trump reignites row with 'nasty' Sadiq Khan as Starmer responds",
        "description": "Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\".",
        "url": "https://news.sky.com/story/trump-reignites-row-with-nasty-sadiq-khan-as-starmer-responds-13403126",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-sadiq-khan_6976221.jpg?20250728161225",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-28 15:00:00",
        "Headline": "The London mayor had tried to strike a more conciliatory tone after previously trading insults with Donald Trump - but the row is back on.",
        "Content": " Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\". During an hour-long news conference with Sir Keir Starmer in Scotland, the US president hit out at the Labour mayor, who has responded with his own snipey remarks. Trump latest: US leader gives Putin new deadline to end war Asked if he would visit London during his state visit in September, Mr Trump said: \"I will, I'm not a fan of your mayor, I think he's done a terrible job. \"A nasty person, I think.\" The prime minister then interrupted and said: \"He's a friend of mine.\" But the president added: \"I think he's done a terrible job but I will certainly visit London, I hope so.\" \n                  Starmer ran the gauntlet with Trump but just about emerged intact\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 Sir Sadiq's spokesperson then released a statement saying: \"Sadiq is delighted that President Trump wants to come to the greatest city in the world. \"He'd see how our diversity makes us stronger not weaker; richer, not poorer. \"Perhaps these are the reasons why a record number of Americans have applied for British citizenship under his presidency.\" They noted that Sir Sadiq has won three mayoral elections, including when Mr Trump lost the US election in 2020. This is not the first time Mr Trump and Sir Sadiq have locked horns. Read more:US and EU agree trade dealScots divided as Trump heads to Turnberry During his first presidential term, Mr Trump called the London mayor a \"stone cold loser who should focus on crime in London\". Sir Sadiq then described Mr Trump as a \"poster boy for racists\". And in November 2024, after Mr Trump won his second term, Sir Sadiq said many Londoners would be \"fearful\" about what it would \"mean for democracy\". However, as Sir Keir tried to show diplomacy with Mr Trump after becoming PM, Sir Sadiq said he \"wanted to work closely with the American president\" ahead of his inauguration in January. The London mayor said as somebody \"who believes in democracy, and voting and elections, we should recognise the fact that Donald Trump is the elected president of the United States\". But he added: \"Let's keep our fingers crossed that this president is different from the last time he was president.\""
    },
    {
        "title": "Tide turns as TPG leads talks to lead digital bank fundraising",
        "description": "TPG, the American private equity giant, is in advanced talks to take a stake in Tide, the British-based digital banking services platform.",
        "url": "https://news.sky.com/story/tide-turns-as-tpg-leads-talks-to-lead-digital-bank-fundraising-13403149",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-tide-account_6976281.jpg?20250728174741",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-28 16:11:00",
        "Headline": "The US-based private equity giant is in negotiations that would see it become a meaningful shareholder in one of Britain's fastest-growing fintechs, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n TPG, the American private equity giant, is in advanced talks to take a stake in Tide, the British-based digital banking services platform. Sky News has learnt that TPG, which manages more than $250bn in assets, is discussing acquiring a significant shareholding in the company. Sources said that Tide's existing investors were expected to sell shares to TPG, while a separate deal would involve another existing shareholder in the company acquiring newly issued shares. The two transactions may be conducted at different valuations, although both are likely to see the company valued at at least $1bn, the sources added. The size of TPG's prospective stake in Tide was unclear on Monday. Earlier this year, Sky News reported that Tide had been negotiating the terms of an investment from Apis Partners, a prolific investor in the fintech sector, although it was unclear whether this would now proceed. Tide has roughly 650,000 SME customers in both Britain and India, with the latter market expanding at a faster rate. \n                  Trump trade war could still see America come off worse\n                 \n                  Money blog: €20 charge for Britons travelling to EU from next year - what you need to know\n                 \n                  US and EU agree trade deal - with bloc facing 15% tariffs on goods into America\n                 Morgan Stanley, the Wall Street bank, has been advising Tide on its fundraising. Tide was founded in 2015 by George Bevis and Errol Damelin, before launching two years later. It describes itself as the leading business financial platform in the UK, offering business accounts and related banking services. The company also provides its SME 'members' in the UK a set of connected administrative solutions from invoicing to accounting. It now boasts a roughly 11% SME banking market share in Britain. Read more:Wise set for resounding winTalkTalk's £100m windfallUS could lose, even if Trumps wins Tide, which employs about 2,000 people, also launched in Germany last May. The company's investors include Apax Partners, Augmentum Fintech and LocalGlobe. Chaired by the City grandee Sir Donald Brydon, Tide declined to comment on Monday. TPG also declined to comment."
    },
    {
        "title": "Trump trade war could still see America come off worse",
        "description": "It is a trade deal that will &#8220;rebalance, but enable trade on both sides,&#8221;  said Ursula von der Leyen after the EU and US struck a trade deal in Scotland.\n",
        "url": "https://news.sky.com/story/trump-trade-war-could-still-see-america-come-off-worse-13403029",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-trump-trade-us-economy_6965912.png?20250716092126",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-07-28 11:24:00",
        "Headline": "Sky's Gurpreet Narwan writes that while the bloc is now trading with the US on worse terms, the worse trade war damage could yet be felt in Washington rather than Brussels.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n It is a trade deal that will “rebalance, but enable trade on both sides,”  said Ursula von der Leyen after the EU and US struck a trade deal in Scotland.\n It was not the most emphatic declaration by the president of the European Commission. The trading partnership between two of the biggest markets in the world is in significantly worse shape than it was before Donald Trump was elected, but this deal is better than nothing. As part of the agreement, European exports to the US will be hit with a 15% tariff. That's better than the 30% the bloc was threatened with but it is a world away from the type of open and free trade European leaders would like. The EU had offered tariff free trade to the US just weeks before the deal was announced. Money latest: What new EU travel rules mean for you Instead, it has accepted a 15% tariff and agreed to ramp up its energy purchases from the US. The EU tariff on US imports will remain close to zero but Europe did get some important exemptions - on aviation, critical raw materials, some chemicals and some medical equipment. That being said, the bloc did not achieve a breakthrough on steel, aluminium or copper, which are still facing a 50% tariff. It means the average tariff on EU exports to the US will now rise from 1.2 % last year to 17%. \n                  Tide turns as TPG leads talks to lead digital bank fundraising\n                 \n                  Money blog: €20 charge for Britons travelling to EU from next year - what you need to know\n                 \n                  US and EU agree trade deal - with bloc facing 15% tariffs on goods into America\n                 There is also confusion over the status of pharmaceuticals - an important industry to Europe. Products like Ozempic, which is made in Denmark, have flooded into the US market in recent years and Donald Trump was threatening tariffs as high as 50% on the sector.  It appears that pharmaceuticals will fall under the 15% bracket, even though President Trump contradicted official announcements by suggesting a deal had not yet been made on the industry. The risk is that the implementation of the deal could be beset with differences of interpretation, as has been the case with the Japan deal that Trump struck last week. It also risks fracturing solidarity between EU states, all of which have different strategic industries that rely on the US to differing degrees. Germany's BDI federation of industrial groups said: \"Even a 15% tariff rate will have immense negative effects on export-oriented German industry.\" The VCI chemical trade association said rates were still \"too high\". For German carmakers, including Mercedes and BMW, there was some reprieve from the crippling 27.5% tariff imposed by Trump. The industry is Europe's top exporter to the US but the German trade body, the VDA, warned that a 15% rate would \"cost the German automotive industry billions annually\".  Meanwhile, François Bayrou, the French Prime Minister, described the agreement as a \"dark day\" for the union, \"when an alliance of free peoples, gathered to affirm their values and defend their interests, resolves to submission.\" While the deal has divided the bloc, the greater certainty it delivers is not to be snubbed at. Markets bounced on the news, even though the deal will ultimately harm economic growth.  Analysts at Oxford Economics said: \"We don't plan material changes to our eurozone baseline forecast of 1.1% GDP growth this year and 0.8% in 2026 in response to the EU-US trade deal. \"While the effective tariff rate will end up at around 15%, a few percentage points higher than in our baseline, lower uncertainty and no EU retaliation are partial offsets.\" However, economists at Capital Economics said the economic outlook had now deteriorated, with growth in the bloc likely to drop by 0.2%. Germany and Ireland could be the hardest hit. While the US appears to be the obvious winner in this negotiation, uncertainty still hangs over the US economy. Trump has not achieved his goal of \"90 deals in 90 days\" and, in the end, American consumers could still bear the cost through higher prices. That of course depends on how businesses share the burden of those higher costs, with the latest data suggesting that inflation is yet to rip through the US economy. While Europe determined on Sunday that a bad deal is better than no deal, some fear that the worst is yet to come for the Americans."
    },
    {
        "title": "Trade negotiations, bond risks and a rise in botulism cases",
        "description": "The British Chambers of Commerce's take on the US-EU trade deal. Sky's Wilfred Frost speaks to one of the world's most successful investors about the bond market. ",
        "url": "https://news.sky.com/story/trade-negotiations-bond-risks-and-a-rise-in-botulism-cases-13403058",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-28 12:12:00",
        "Headline": "No subtitle found",
        "Content": "The British Chambers of Commerce's take on the US-EU trade deal. Sky's Wilfred Frost speaks to one of the world's most successful investors about the bond market.  Listen and subscribe to the Sky News Business Podcast here."
    },
    {
        "title": "UK in 'debt doom loop', top investor Dalio warns",
        "description": "One of of the world's most successful investors has warned that the UK is stuck in a \"debt doom loop\".&#160;",
        "url": "https://news.sky.com/story/uk-in-debt-doom-loop-top-investor-dalio-warns-13402866",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ray-dalio-bridgewater_6975698.jpg?20250728063336",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-07-28 05:26:00",
        "Headline": "Bridgewater founder Ray Dalio is the latest top US investor to sound a warning to the chancellor about the consequences of the UK's troubled public finances.",
        "Content": "One of of the world's most successful investors has warned that the UK is stuck in a \"debt doom loop\".  Hedge fund manager Ray Dalio, who founded Bridgewater Associates, was speaking as UK debt as a percentage of GDP (gross domestic product) rose to 101%. Long-term borrowing costs are higher than they have been at any point this century, giving the Chancellor Rachel Reeves little room to borrow more to fund spending, and thus requiring a focus on raising taxes instead. Mr Dalio told the 'Master Investor' Podcast with Wilfred Frost she risked alienating the very people who could help get the country out of its fiscal bind - mirroring concerns expressed by the boss of Goldman Sachs last week. Money latest: You'd be surprised how a jockey's pay works \"The debt doom loop is affecting capital flows. So the necessity for creating taxations that then drive people away. \"As the financial problems and the social problems worsen, having the effect of causing people with money to leave. \n                  Tide turns as TPG leads talks to lead digital bank fundraising\n                 \n                  Trump trade war could still see America come off worse\n                 \n                  Money blog: €20 charge for Britons travelling to EU from next year - what you need to know\n                 \"That's a problem because, I don't know the exact numbers in the UK, but they're analogous to the US, where 75% of income taxes are paid by the top 10%.  \"So you have this financial deterioration, that precedes social and economic deterioration that has caused migrations all around the world and so on. And there is only one way to deal with that. Both of our countries need a strong leadership of a strong middle. They have to have the war between those of the left and those of the right begin to end because difficult choices are going to have to be made, you know, like our countries had in World War II. \"The deficits for the central government, have to be lowered to about 3% of GDP. That is what would be sustainable rather than having this compounding effect.\" The UK deficit is currently 5.1% of GDP, while in the US it is 6%. \"They have to do it equally in spending cuts and taxation. And if that is done interest rates will come down not rise.\" Dalio outlines the process around the debt cycle in his new book How Countries Go Broke. And while many people are broadly aware of the debt problems advanced nations now face, he said that bond markets are complacent to the looming risks. \"You get this complacency. So now the question for you or for your audience is, is it priced into the markets? Well, I'll answer the question and say, no, it is not priced into the markets.\" The Master Investor Podcast with Wilfred Frost is available across multiple podcast platforms"
    },
    {
        "title": "Restaurant tycoon Page opens new chapter with Tasty deal",
        "description": "One of Britain's most prolific restaurant industry entrepreneurs is in talks to raise millions of pounds in a deal that would see him take the helm at Tasty, the London-listed leisure group.",
        "url": "https://news.sky.com/story/restaurant-tycoon-page-opens-new-chapter-with-tasty-deal-13402955",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-wales-cheese-pizza_6336388.jpg?20231026135414",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-28 09:16:00",
        "Headline": "David Page, the former PizzaExpress chief, is trying to raise £10m through a placing that would see London-listed Tasty renamed Bow Street Group plc, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of Britain's most prolific restaurant industry entrepreneurs is in talks to raise millions of pounds in a deal that would see him take the helm at Tasty, the London-listed leisure group. Sky News has learnt that David Page, who previously ran chains including PizzaExpress and Gourmet Burger Kitchen, is seeking close to £10m of new funding from institutional investors. If successfully implemented, the deal would see Mr Page installed as executive chairman of Tasty, which would be renamed Bow Street Group on the London Stock Exchange. Money latest: You'd be surprised how a jockey's pay works Tasty, which owns the dim t and Wildwood casual dining brands, would acquire a cash shell owned by Mr Page and associates as part of the deal. It would then seek to acquire a number of brands, for which it would act as an incubator. Nick Wong, who worked with Mr Page at two of his previous ventures, would become Bow Street Group's finance chief if the plan is successful. \n                  Tide turns as TPG leads talks to lead digital bank fundraising\n                 \n                  Trump trade war could still see America come off worse\n                 \n                  Money blog: €20 charge for Britons travelling to EU from next year - what you need to know\n                 Tasty launched a restructuring plan last year which saw more than a third of its 54 sites jettisoned. Recent trading at the company is said to have improved, although it continues to face the headwinds of inflationary cost pressures and the impact of tax increases which trade body UK Hospitality recently warned would result in a jobs bloodbath across the industry. As part of Mr Page's fundraising plans, existing and proposed board members would commit more than £1m to a share placing, according to restaurant sector insiders. The entrepreneur's career in the industry has spanned more than three decades, with the 1993 flotation of PizzaExpress a milestone. He then floated Clapham House Group, which included The Real Greek concept, in London a decade later, before selling it. Mr Page's subsequent venture, Fulham Shore, and its Franco Manca pizza chain were sold to Toridoll Holdings of Japan in 2023 for £93m. Sources said his plans included a review of Tasty's existing sites The fundraising is being coordinated by Cavendish and Allenby Capital, the investment banks. A spokesman for Mr Page declined to comment, while Mr Plant did not respond to a call seeking comment."
    },
    {
        "title": "Buyout giant Warburg Pincus snaps up Health Partners stake",
        "description": "One of the world's biggest private equity firms has agreed to acquire a stake in Health Partners Group, a provider of occupational health services to millions of its clients' employees.",
        "url": "https://news.sky.com/story/buyout-giant-warburg-pincus-snaps-up-health-partners-stake-13402962",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-stock-istock-generic_6848624.jpg?20250307063055",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-28 09:30:00",
        "Headline": "The US-based private equity firm has agreed to partner with a provider of occupational health services to millions of Britons in a deal thought to be worth more than £300m, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the world's biggest private equity firms has agreed to acquire a stake in Health Partners Group, a provider of occupational health services to millions of its clients' employees. Sky News understands that Warburg Pincus has struck a deal to partner with the company in a deal valuing it at more than £300m. Health Partners Group was founded in 2016 by chief executive Andrew Noble and chief medical officer Dr Alasdair Emslie. Money latest: You'd be surprised how a jockey's pay works It is principally focused on serving private sector clients, although it does not disclose their identities. In the year to 31 July 2024, it reported revenue of close to £77m and earnings before interest, tax, depreciation and amortisation of £13.6m, according to accounts filed at Companies House. The company says it is now the largest occupational health provider and among the largest non-hospital healthcare providers in Britain. \n                  Tide turns as TPG leads talks to lead digital bank fundraising\n                 \n                  Trump trade war could still see America come off worse\n                 \n                  Money blog: €20 charge for Britons travelling to EU from next year - what you need to know\n                 Further details of the transaction with Warburg Pincus, including the size of the stake it had agreed to buy, were unclear on Monday. The deal is said by bankers to value Health Partners at between £300m and £400m. Warburg Pincus has backed similar businesses in other countries, including Quantum Health in the US and Arsipa in Europe. On Monday, Warburg Pincus declined to comment."
    },
    {
        "title": "Trump reignites row with 'nasty' Sadiq Khan as Starmer responds",
        "description": "Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\".",
        "url": "https://news.sky.com/story/trump-reignites-row-with-nasty-sadiq-khan-as-starmer-responds-13403126",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-sadiq-khan_6976221.jpg?20250728161225",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-28 15:00:00",
        "Headline": "The London mayor had tried to strike a more conciliatory tone after previously trading insults with Donald Trump - but the row is back on.",
        "Content": " Donald Trump has reignited his row with London mayor Sir Sadiq Khan after calling him a \"nasty person\" who has done \"a terrible job\". During an hour-long news conference with Sir Keir Starmer in Scotland, the US president hit out at the Labour mayor, who has responded with his own snipey remarks. Trump latest: US leader gives Putin new deadline to end war Asked if he would visit London during his state visit in September, Mr Trump said: \"I will, I'm not a fan of your mayor, I think he's done a terrible job. \"A nasty person, I think.\" The prime minister then interrupted and said: \"He's a friend of mine.\" But the president added: \"I think he's done a terrible job but I will certainly visit London, I hope so.\" \n                  Starmer ran the gauntlet with Trump but just about emerged intact\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 Sir Sadiq's spokesperson then released a statement saying: \"Sadiq is delighted that President Trump wants to come to the greatest city in the world. \"He'd see how our diversity makes us stronger not weaker; richer, not poorer. \"Perhaps these are the reasons why a record number of Americans have applied for British citizenship under his presidency.\" They noted that Sir Sadiq has won three mayoral elections, including when Mr Trump lost the US election in 2020. This is not the first time Mr Trump and Sir Sadiq have locked horns. Read more:US and EU agree trade dealScots divided as Trump heads to Turnberry During his first presidential term, Mr Trump called the London mayor a \"stone cold loser who should focus on crime in London\". Sir Sadiq then described Mr Trump as a \"poster boy for racists\". And in November 2024, after Mr Trump won his second term, Sir Sadiq said many Londoners would be \"fearful\" about what it would \"mean for democracy\". However, as Sir Keir tried to show diplomacy with Mr Trump after becoming PM, Sir Sadiq said he \"wanted to work closely with the American president\" ahead of his inauguration in January. The London mayor said as somebody \"who believes in democracy, and voting and elections, we should recognise the fact that Donald Trump is the elected president of the United States\". But he added: \"Let's keep our fingers crossed that this president is different from the last time he was president.\""
    },
    {
        "title": "Starmer ran the gauntlet with Trump but just about emerged intact",
        "description": "When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians.",
        "url": "https://news.sky.com/story/starmer-ran-the-gauntlet-with-trump-but-just-about-emerged-intact-13403179",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-keir-starmer_6976022.jpg?20250728125041",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-07-28 17:55:00",
        "Headline": "Sir Keir Starmer and Donald Trump held a long televised meeting with questions from the media covering a wide range of issues.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n When TV cameras are let in to film world leaders meeting in person, the resulting footage is usually incredibly boring for journalists and incredibly safe for politicians. Not with Donald Trump. Sir Keir Starmer ran the gauntlet on Monday. Trump latest: President treats PM to a ride on Air Force One Put through a total of almost 90 minutes of televised questioning alongside the American leader, it was his diciest encounter with the president yet. But he still just about emerged intact. For a start, he can claim substantive policy wins after Trump announced extra pressure on Vladimir Putin to negotiate a ceasefire and dialled up the concern over the devastating scenes coming from Gaza. \n                  Trump reignites row with 'nasty' Sadiq Khan as Starmer responds\n                 \n                  Terror probe as man arrested 'after shouting Allahu Akbar and death to Trump' on flight from Luton to Glasgow\n                 \n                  PM to hold talks with Trump today - but will have to walk a fine diplomatic line\n                 There were awkward moments aplenty though.  Top of the list is Mr Trump's trashing of the prime minister's Labour colleague, London mayor Sir Sadiq Khan. But more important than that, Monday's meeting was the clearest representation of the political gulf that separates the two leaders. \"He's slightly more liberal than me,\" Mr Trump said of Sir Keir when he arrived in Scotland. What an understatement. Read more:Trump reignites row with Sir Sadiq KhanEU leaders resigned to US trade deal On green energy, immigration, taxation and online regulation, the differences were clear to see. Sir Keir just about managed to paper over the cracks by chuckling at times, choosing his interventions carefully and always attempting to sound eminently reasonable. At times, it had the energy of a man being forced to grin and bear inappropriate comments from his in-laws at an important family dinner. But hey, it stopped a full Trump implosion - so I suppose that's a win. My main takeaway from this Scotland visit though is not so much the political gulf present between the two men, but the gulf in power.  Sir Keir flew the length of the country he leads to be the guest at the visiting president's resort. He was then forced to sit through more than an hour of uncontrolled, freewheeling questioning from a man most of his party and voters despise, during which he was offered unsolicited advice on how to beat Nigel Farage and criticised (albeit indirectly) on key planks of his government's policy platform. In return he got warm words about him (and his wife) and relatively incremental announcements on two foreign policy priorities. So why does he do it? Because, to borrow a quote from a popular American political TV series: \"Air Force One is a big plane and it makes a hell of a noise when it lands on your head.\""
    },
    {
        "title": "Paul Gallagher, older brother of Oasis stars Noel and Liam, is charged with offences including rape",
        "description": "Paul Gallagher, the older brother of Oasis stars Noel and Liam, has been charged with multiple offences including rape.",
        "url": "https://news.sky.com/story/paul-gallagher-older-brother-of-oasis-stars-noel-and-liam-is-charged-with-offences-including-rape-13403104",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-paul-gallagher-premiere_6976152.jpg?20250728153812",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-28 14:02:00",
        "Headline": "The 59-year-old is also facing other charges including three counts of sexual assault and three counts of intentional strangulation, the Metropolitan Police said. ",
        "Content": "Paul Gallagher, the older brother of Oasis stars Noel and Liam, has been charged with multiple offences including rape. The Metropolitan Police said Gallagher, 59, of East Finchley, north London, has been charged with rape, coercive and controlling behaviour, three counts of sexual assault, three counts of intentional strangulation, two counts of making a threat to kill and assault occasioning actual bodily harm. The offences are reported to have taken place between 2022 and 2024. The charges follow an investigation which began last year, the force added in a statement. A woman is being supported by specially-trained officers, the statement continued. Paul Gallagher, who is about one year older than Noel and seven years older than Liam, has never been involved in Oasis. He is due to appear at Westminster Magistrates' Court on 27 August."
    },
    {
        "title": "The 1975 star Matty Healy warns of musical 'silence' without small stages as he backs new UK-wide festival",
        "description": "The 1975 frontman Matty Healy has warned of a musical \"silence\" that would come without the pubs and bars that give UK artists their first chance to perform.",
        "url": "https://news.sky.com/story/the-1975-star-matty-healy-warns-of-musical-silence-without-small-stages-as-he-backs-new-uk-wide-festival-13403105",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-the-1975-glastonbury_6976143.jpg?20250728151622",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-28 13:56:00",
        "Headline": "Matty Healy is an ambassador for the new Seed Sounds Weekender, a UK-wide festival championing the pubs, bars and clubs that host artists when they are starting out.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n The 1975 frontman Matty Healy has warned of a musical \"silence\" that would come without the pubs and bars that give UK artists their first chance to perform. Fresh from headlining Glastonbury in June, Healy is backing a new UK-wide festival which will see more than 2,000 gigs taking place across more than 1,000 \"seed\" venues in September. The Seed Sounds Weekender aims to celebrate the hospitality sector hosting bands and singers just as they are starting out - and for some, before they go on to become global superstars. Healy, who is an ambassador for the event, said in a statement to Sky News: \"Local venues aren't just where bands cut their teeth, they're the foundation of any real culture. \"Without them, you don't get The Smiths, Amy Winehouse, or The 1975. You get silence.\" Oasis, currently making headlines thanks to their sold-out reunion tour, first played at Manchester's Boardwalk club, which closed in 1999, and famously went on to play stadiums and their huge Knebworth gigs within the space of a few years. GigPig, the live music marketplace behind Seed Sounds, says the seed sector collectively hosts more than three million gigs annually, supports more than 43,000 active musicians, and contributes an estimated £2.4bn to the UK economy. \"The erosion of funding for seed and grassroots spaces is part of a wider liberal tendency to strip away the socially democratic infrastructure that actually makes art possible,\" said Healy. \"What's left is a cultural economy where only the privileged can afford to create, and where only immediately profitable art survives.\" He described the Seed Sounds Weekender as \"a vital reminder that music doesn't start in boardrooms or big arenas - it starts in back rooms, pubs, basements, and independent spaces run on love, grit, and belief in something bigger.\" Read more from Sky News:Oasis photographers recall the early daysHeavy metal to reality TV: The wild life of Ozzy Osbourne The importance of funding for grassroots venues has been highlighted in the past few years, with more than 200 closing or stopping live music in 2023 and 2024, according to the Music Venue Trust. Sheffield's well-known Leadmill venue saw its last gig in its current form in June, after losing a long-running eviction battle. In May, Culture Secretary Lisa Nandy announced the £85m Creative Foundations Fund to support arts venues across England. And last year, the Culture, Media and Sport Committee called for a levy on tickets to large concerts at stadiums and arenas to help fund grassroots venues, which artists including Coldplay and Katy Perry, and venues including the Royal Albert Hall, have backed. But most seed venues - the smaller spaces in the hospitality sector that provide a platform before artists get to ticketed grassroots gigs or bigger stages - won't qualify for the levy. GigPig is working to change this by formalising the seed music venue space as a recognised category. \"The UK's seed venues are where music careers are born,\" said GigPig co-founder Kit Muir-Rogers. \"Collectively, this space promotes more music than any other in the live music business, yet it has gone overlooked and under-appreciated.\" The Seed Sounds Weekender takes place from 26-28 September and will partner with Uber to give attendees discounted rides to and from venues. Tickets for most of the gigs will be free, with events taking place across 20 UK towns and cities including London, Liverpool, Birmingham, Manchester, Glasgow, Leicester, Newcastle and Southampton"
    }
]