[
    {
        "title": "Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv",
        "description": "Ukraine has agreed terms with the United States on a crucial minerals deal, a Ukrainian government source has told Sky News.",
        "url": "https://news.sky.com/story/ukraine-agrees-terms-with-us-on-minerals-deal-with-no-security-guarantee-for-kyiv-13317021",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-volodymyr_6835229.jpg?20250221052112",
        "type": "Home",
        "Author": "Azad Safarov, Ukraine producer",
        "Date Published": "2025-02-25 20:26:00",
        "Headline": "A Ukrainian government source has said there is a plan for the accord to be signed by both sides \"very soon\".",
        "Content": "By Azad Safarov, Ukraine producer  Ukraine has agreed terms with the United States on a crucial minerals deal, a Ukrainian government source has told Sky News. There has been no confirmation from the US side yet but Donald Trump said on Monday evening that his Ukrainian counterpart \"would like to sign the minerals deal with me\". The accord, once signed, could unlock a new long-term partnership between Kyiv and Mr Trump's White House after weeks of increasingly tense exchanges. The source said there was a plan for the document to be signed \"very soon\". This could even be during a face-to-face meeting between Ukrainian President Volodymyr Zelenskyy and Mr Trump. The US president told reporters on Tuesday evening that his Ukrainian counterpart is \"coming to visit on Friday\". He added: \"We have pretty much negotiated our deal on rare earths.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Campbell Scott: Body of missing British businessman 'found in sack of pineapples' in Kenya\n                 A Ukrainian government source has also said Mr Zelenskyy will meet with Mr Trump in Washington on Friday and that the meeting was proposed by the American side. Meanwhile, Ukrainian officials have said Kyiv has agreed a framework for an economic deal with the US which will see them trade rights to rare minerals in exchange for continued aid. The deal sets out the terms to create a new fund to invest in Ukraine's minerals, rare earth materials and other valuable natural resources. It no longer contains an initial demand by the United States for a right to $500bn (£394bn) in potential revenue from the resources. Mr Zelenskyy had previously described such a high price as not being a \"serious\" conversation. Mr Trump, however, views the minerals transaction with Ukraine as a fair way to recoup the billions of dollars that the US has given Kyiv - via weapons and financial support - to assist the armed forces in their fight against Russia's full-scale invasion over the past three years. The document also does not provide a commitment from Washington to give security guarantees to Ukraine in the wake of any ceasefire deal with Vladimir Putin - something that Kyiv desperately needs and has been asking for. More granular details about the new partnership are expected to be fleshed out in coming discussions. Read more:Pay back the billions of aid, Trump tells UkraineWhat minerals does Ukraine have and why does Trump want them? 👉 Listen to Sky News Daily on your podcast app 👈 The two sides have \"agreed on a framework agreement on how to create a fund that will be filled with a share of minerals\" and other natural resources, the government source said, speaking on condition of anonymity. \"This is a political step to ensure that resource revenues are used for the security and reconstruction of Ukraine.\" The fund would comprise US money that would be invested in Ukrainian natural resources, with profits shared between Washington and Kyiv, it is understood. The Financial Times first reported on the agreement being reached. It said the final version of the deal was dated 24 February. \"The minerals agreement is only part of the picture. We have heard multiple times from the US administration that it's part of a bigger picture,\" Olha Stefanishyna, Ukraine's deputy prime minister and justice minister who has led the negotiations, told the newspaper on Tuesday. The development comes after Mr Trump shocked European leaders last week by calling Mr Zelenskyy a \"dictator with no elections\". He added that the Ukrainian president \"better move fast or he is not going to have a country left\" after Mr Zelenskyy had accused him of living in a Russian-made \"disinformation space\".  French President Emmanuel Macron flew to Washington to meet with Mr Trump on Monday for talks on Ukraine amid fragile relations between the US and Europe. Meeting in the White House on the third anniversary of Russia's war in Ukraine, the French president said he and Mr Trump \"made substantive steps forward during our discussions\". It comes as UK Prime Minister Sir Keir Starmer prepares to meet with Mr Trump at the White House on Thursday. Mr Starmer and Mr Macron spoke on the phone on Tuesday and \"agreed that President Trump's leadership in working towards a durable peace in Ukraine was welcome\", a Downing Street spokesperson continued."
    },
    {
        "title": "Large bruise on Trump's hand prompts speculation over health - but White House blames 'shaking hands'",
        "description": "A large bruise that appeared on Donald Trump's hand is down to him shaking a lot of hands, the White House has said.",
        "url": "https://news.sky.com/story/bruise-on-trumps-hand-prompts-speculation-over-health-but-white-house-blames-shaking-hands-13316982",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bruise-hand-donald-trump_6839636.jpg?20250225203105",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-25 19:16:00",
        "Headline": "Donald Trump's right hand appeared to be bruised when he was pictured on Monday during a meeting with French President Emmanuel Macron. The US leader, who started his second stint in the White House last month, is yet to release his full medical report.",
        "Content": "A large bruise that appeared on Donald Trump's hand is down to him shaking a lot of hands, the White House has said. Mr Trump's right hand seemed bruised during the 78-year-old's meeting with French President Emmanuel Macron on Monday, prompting speculation on social media over his health. Redness or bruising on the US leader's right hand were also spotted in August and November last year, Sky News' US partner network NBC reported.  White House press secretary Karoline Leavitt has claimed the bruising is a result of hand shaking. \"President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other president in history. \"His commitment is unwavering and he proves that every single day,\" Ms Leavitt said. \"President Trump has bruises on his hand because he's constantly working and shaking hands all day every day,\" she said in a follow-up statement. \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 \n                  Badenoch says US is acting in its national interest - and UK must do the same\n                 \n                  Day 37: Does the Macron-Trump bromance bring us closer to peace?   \n                 Read more from Sky News:Trump's optimism meets Macron's caution 👉 Follow Trump 100 on your podcast app 👈 People speculated about potential causes for the bruising on social media. On X, one person suggested Mr Trump was on blood thinners, while another said: \"Maybe, but elderly people bruise more easily than younger folks. Trump is 78. He could have gotten that in any number of ways.\" One user didn't seem to believe the White House's explanation. \"Why even lie? It's obviously an IV bruise for blood testing or something. Is it a surprise to people that Trump is old and gets regular physician visits?\" they said. In a December interview with NBC News' Meet the Press, Mr Trump said he would release his full medical report, but he has yet to do so."
    },
    {
        "title": "Post Office scandal: 21 ‘Capture’ cases now being investigated for miscarriages of justice",
        "description": "The number of convictions linked to a second Post Office IT scandal being investigated for miscarriages of justice - has more than doubled, Sky News has learned.",
        "url": "https://news.sky.com/story/post-office-scandal-21-8216capture8217-cases-now-being-investigated-for-miscarriages-of-justice-13316673",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-02-25 11:00:00",
        "Headline": "So far around 100 people who suffered after being accused of stealing from their branch, while using Capture, could be eligible for redress.",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n  The number of convictions linked to a second Post Office IT scandal being investigated for miscarriages of justice - has more than doubled, Sky News has learned. Twenty-one Capture cases have now been submitted to the Criminal Cases Review Commission (CCRC) for review. Before Christmas, it was around eight. They relate to the Capture computing software, which was used in Post Office branches in the 1990s before the infamous faulty Horizon system was introduced. Hundreds of sub-postmasters were wrongly accused of stealing after Horizon software caused false shortfalls in branch accounts between 1999 and 2015. A report last year found that there was a reasonable likelihood that the Capture accounting system, used from the early 1990s until 1999, was also responsible for shortfalls. If the CCRC finds significant new evidence or legal arguments not previously heard before, cases can be referred back to the Court of Appeal. \n                  Sub-postmasters still going through hell, lead campaigner Sir Alan Bates says\n                 \n                  Tesco eyes delivery of Crown Post Office branches\n                 \n                  Post Office unveils new wave of cuts to fuel transformation plan\n                 Lawyer for victims, Neil Hudgell from Hudgell Solicitors, says the next steps for the Capture cases and the CCRC are still \"some months away\". He said he is also hopeful that the first cases could be referred to the Court of Appeal before the end of this year. \"Certainly we will certainly be lobbying,\" he said. \"The CCRC will be lobbying, the advisory board will be lobbying any interested parties, that these are hideously damaged people of advancing years who need some peace of mind and the quicker that can happen the better.\"  'We didn't talk about it' Among those submitted to the CCRC - Pat Owen's Capture case was the first. Her family have kept her 1998 conviction for stealing from her post office branch a secret for 26 years. Speaking to Sky News they have opened up for the first time about what happened to her. Pat was a former sub-postmistress, who was found guilty and given a two-year suspended sentence. She died in 2003 from heart failure. Her daughters describe her as coming home from court after her conviction \"a different woman\". \"We didn't talk about it,\" said Juliet Shardlow. \"We didn't talk about it amongst ourselves as a family, we didn't talk about it with the extended family. \"Our extended family don't know.\" David Owen, Pat's husband, said she lost a lot of weight after her conviction and at 62 years old \"looked like an old gal of 90\". Capture evidence never heard in court Pat's family kept all the documents from her case safe for over two decades and now a key piece of evidence may turn the tide on her conviction, and potentially help others. A document summarising the findings of an IT expert described the computer Pat used as having \"a faulty motherboard\". It also stated that this \"would have produced calculation errors and may have been responsible for the discrepancies subsequently identified by Post Office Counters' Security and Investigation team.\" Read more from Sky News:Sub-postmasters: 'Still going through hell'Compensation for victims of CaptureCalls on Fujitsu for compensationThe computer expert was due to give evidence in Pat Owen's defence at court as part of her trial - but failed to turn up on the day. The family say they never found out exactly why he didn't show up at court. David said there was a computer all set up in the courtroom for the expert to use to show malfunctions. \"I heard, now I can't remember who from, that he'd done work for the Post Office,\" he said. \"If he turned up to be a witness in court for us to he wouldn't get any more work from the Post Office.\" Despite best efforts the expert has never been tracked down. The Post Office has declined to comment. David also described how his wife never expected to lose her case. \"She was so confident. She knew she didn't do anything wrong,\" he said. \"But when the guilty verdict came out she actually fell to her knees in the dock crying her eyes out shaking.\" He said the judge then asked if he wanted to say anything, and David said he got up in court and spoke at length about his wife's innocence. The government announced in December that they will be setting up a redress scheme for Capture victims, similar to Horizon. So far around 100 people who suffered after being accused of stealing from their branch, while using Capture, could be eligible for redress."
    },
    {
        "title": "Woman admits trying to defraud Elvis Presley's family by auctioning off Graceland",
        "description": "A woman has admitted attempting to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale.",
        "url": "https://news.sky.com/story/woman-admits-trying-to-defraud-elvis-presleys-family-by-auctioning-off-graceland-13317185",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-graceland-memphis-tennessee_6561472.jpg?20240521071042",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-25 23:07:00",
        "Headline": "Lisa Jeanine Findley, of Kimberling City, Missouri, falsely claimed Presley's daughter Lisa Marie had borrowed $3.8m from a bogus private lender and had pledged Graceland as collateral for the loan, prosecutors said.",
        "Content": "A woman has admitted attempting to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale. Lisa Jeanine Findley had initially denied charges of mail fraud and aggravated identity theft in relation to the scheme but has now changed her plea in the two-count indictment. Prosecutors had said Findley, of Kimberling City, Missouri, falsely claimed Presley's daughter Lisa Marie had borrowed $3.8m (£3m) from a bogus private lender and had pledged Graceland as collateral for the loan before her death in January 2023. Findley then threatened to sell Graceland to the highest bidder if Presley's family did not pay a $2.85m (£2.25m) settlement, according to authorities. She posed as three different people allegedly involved with the fake lender, fabricated loan documents and published a fraudulent foreclosure notice in a Memphis newspaper announcing the auction of Graceland in May 2024, prosecutors said. A judge stopped the sale after Presley's granddaughter and Lisa Marie's daughter, actress Riley Keough, sued. Experts were baffled by the attempt to sell off one of the most famous pieces of property in the country using names, emails and documents that were quickly suspected to be fake. \n                  Woman charged over alleged scheme to fraudulently sell Elvis Presley's former home Graceland\n                 \n                  Elvis Presley's blue suede shoes expected to fetch up to £120,000 at auction\n                 \n                  Mark James: Suspicious Minds and Hooked On A Feeling songwriter dies\n                 Graceland opened as a museum and tourist attraction in 1982 and draws hundreds of thousands of visitors each year. A large Presley-themed entertainment complex across the street from the museum is owned by Elvis Presley Enterprises. Presley, known as the King of Rock and Roll, died in August 1977 at the age of 42 Keough, who inherited the trust and ownership of the home after the death of her mother, filed a lawsuit claiming fraud against Findley and a judge halted the proposed auction with an injunction. Naussany Investments and Private Lending - the bogus lender authorities say Findley created - said Lisa Marie Presley had used Graceland as collateral for the loan, according to the foreclosure sale notice. The judge said Elvis Presley's estate could be successful in arguing that a company's attempt to auction Graceland was fraudulent. Read more from Sky News:Businessman's body found in 'sack of pineapples'Large bruise on Trump's hand prompts speculation over healthCouple 'forced' to sit next to dead woman on flight Ms Keough's lawsuit alleged that Naussany presented fraudulent documents regarding the loan in September 2023 and that Ms Presley never borrowed money from Naussany. After the scheme fell apart, Findley tried to make it look like the person responsible was a Nigerian identity thief, prosecutors said. An email sent on 25 May 2024 to the Associated Press from the same email as the earlier statement said in Spanish that the foreclosure sale attempt was made by a Nigerian fraud ring that targets old and dead people in the US and uses the internet to steal money. In a statement, Tennessee Attorney General Jonathan Skrmetti called the scheme \"nonsense\" and praised the work of federal authorities. \"Graceland matters so much to so many people around the world - just go to Memphis during Elvis Week and listen to all the different accents and languages of fans who make the pilgrimage,\" Mr Skrmetti said. \"All of Tennessee is glad that Graceland remains safely in the possession of Elvis's heir and that it will remain a celebrated Memphis landmark for generations to come.\" Findley will be sentenced on 18 June and would have faced up to 20 years if convicted, but she is expected to receive less than that under the plea deal."
    },
    {
        "title": "MP demands clampdown on 'ghost' number plates",
        "description": "People are using 'ghost' number plates to avoid getting caught for dangerous driving, according to an MP who is attempting to change the law.",
        "url": "https://news.sky.com/story/mp-demands-clampdown-on-ghost-number-plates-13316814",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ghost-number-plates_6839375.jpg?20250225195227",
        "type": "Home",
        "Author": "Tim Jones",
        "Date Published": "2025-02-25 13:55:00",
        "Headline": "The fine for a dodgy number plate is £100 while the penalty for speeding is £100 plus three penalty points.",
        "Content": "\n          News Reporter\n              @TimJones_SN\n People are using 'ghost' number plates to avoid getting caught for dangerous driving, according to an MP who is attempting to change the law. Sarah Coombes, who represents West Bromwich, wants the penalties increased to tackle illegal licence plates which are being used by some motorists to run red lights and ignore speed limits. Motorists can buy so-called 'ghost' or 'stealth' plates for as little as £30. They reflect light back, preventing the registration number from being clearly seen by Automatic Number Plate Recognition (ANPR) cameras. The Labour MP wants the fine for being caught with a non-compliant number plate increased to £1,000 and at least six penalty points. Currently, drivers caught with one can be fined £100. That compares to the minimum penalty for speeding which is a £100 fine and three penalty points. \"There are a select minority of people who think they are above the law. The behaviour of a few reckless drivers is putting us all at risk. The punishments need to be tougher,\" she said. The scale of number plate misuse is unclear but one estimate suggests around 1 in 15 plates could be modified in some way. One police exercise conducted in London found that 40% of taxi and private hire vehicles had coatings applied to their plates that made them unreadable to ANPR cameras. Tony Porter, the UK's former surveillance camera commissioner, said: \"ANPR and the humble number plate is hot-wired into the UK's road safety. \"If people think, by doctoring their plates, they can speed, drive without due care or without insurance to evade prosecution - then we need to remove this temptation. Innocent members of the public are being put at risk.\" Ms Coombes is putting forward her plan in the Commons on Wednesday using a 10-minute rule motion. But unless it gets government support the idea is unlikely to progress into law. Jack Cousens, head of roads policy for The AA, said: \"Drivers manipulating their number plates in any way is a serious offence. \"While steps are needed to tackle the root cause of the problem, some feel that a lack of traffic police increases their chances of getting away with such activity.\" A government spokesperson said: \"This government takes road safety seriously. We are committed to reducing the number of those killed and injured on our roads. \"Since the general election, the Labour government has begun work on a new road safety strategy, the first in over a decade. Ministers will share more details of the strategy in due course.\""
    },
    {
        "title": "Planetary parade: How and when to spot seven planets in UK skies in rare alignment",
        "description": "Not one, not two, but seven planets are due to line up in the night skies later this week in a relatively rare planetary parade.",
        "url": "https://news.sky.com/story/planetary-parade-how-and-when-to-spot-seven-planets-in-uk-skies-in-rare-alignment-13316815",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-planets-space_6839317.jpg?20250225143504",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-25 16:18:00",
        "Headline": "The occasion will see Mars, Jupiter, Mercury, Venus, Saturn, Uranus, Neptune and Mercury align, with some of the planets visible to the naked eye.",
        "Content": "Not one, not two, but seven planets are due to line up in the night skies later this week in a relatively rare planetary parade. The phenomenon will see Mars, Jupiter, Mercury, Venus, Saturn, Uranus, Neptune and Mercury align, with some of the planets visible to the naked eye. Keen astronomers may have already spotted six of the planets in late January or earlier this month, but on 28 February, Mercury will also join the parade. This will mean a potential of seven planets on display at once, the Greenwich Royal Observatory says. Here is everything you need to know ahead of the phenomenon and how to maximise your chances of spotting all seven planets. Why do the planets align? In simple terms, as the planets in our Solar System orbit the sun, they occasionally line up in space, according to NASA. The term planetary alignment can refer to apparent line-ups with other planets, the moon, or bright stars. When this happens, the planets always appear along a line or an arc, NASA adds, due to the way they are viewed from Earth. How rare is it? \"Planetary alignments, where multiple planets appear close together in the sky, occur periodically but are relatively rare,\" Dr Shyam Balaji, researcher in astroparticle physics and cosmology at King's College London, said last month. He added alignments of six or more planets happen approximately every few decades, making Friday's potential line-up even rarer. NASA adds Mars, Jupiter, and Saturn are frequently seen in the night sky, but the addition of Venus and Mercury are particularly noteworthy. Will UK skies be clear enough to see the planets? There's good news, and somewhat bad news - depending on where you are in the UK. Sky News meteorologist Jo Robinson says there's high pressure over the UK on Friday, meaning the weather looks good for people getting ready to watch the night skies. Most places will also be dry with clear spells, although Robinson warns temperatures will be chilly, with the Met Office predicting \"widespread\" frost on Friday morning. Unfortunately, Ireland, Northern Ireland and northwest Scotland may be quite cloudy ahead of rain moving in on Friday night, Robinson says. But, she adds, the forecast is still \"several days away, so timings may change\". Any delay in the rain moving in will allow for clearer skies. An added bonus to the upcoming planetary alignment is there will also be a new moon on 28 February. This occurs when the moon is directly between the sun and the Earth, with its shadowed side pointing towards Earth. It means that those looking into the skies on Friday will be less affected by light pollution from the moon, and may even be able to get a good look at some galaxies, the Greenwich Royal Observatory says. Read more from Sky News:Mars could have had beaches and an oceanWhat could happen if the 2024 YR4 asteroid hits earth? Will you need a telescope? Five planets: Mercury, Venus, Mars, Jupiter, and Saturn, are typically visible to the naked eye. However, this does not guarantee they will be visible this Friday. The Greenwich Royal Observatory says in late February it becomes much more difficult to see Saturn as it will be very low on the southwestern horizon after sunset. NASA adds Mercury could also be difficult for observers to see without the aid of a telescope, as it may be too faint and too low. It says to see Neptune a telescope is absolutely necessary, while Uranus, although technically bright enough to detect with good eyesight, is \"quite faint and requires dark skies and precise knowledge of its location among similarly faint stars\", so a telescope is recommended. Other top tips for planet-spotters To help keen observers maximise their chances of seeing as many planets as possible, Dr Balaji, from King's College London recommends the following tips: • Find a location away from city lights• Use current astronomical software or websites to find a planet's latest position• Exercise caution when observing near sunrise or sunset• Check reliable astronomy websites for updated viewing information as the date approaches."
    },
    {
        "title": "Couple 'forced' to sit next to dead body for hours on Qatar Airways flight",
        "description": "A couple have said they were forced to sit next to a dead body for four hours on a Qatar Airways flight.",
        "url": "https://news.sky.com/story/couple-forced-to-sit-next-to-dead-body-for-hours-on-qatar-airways-flight-13317026",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-qatar-airways-plane_6839662.jpg?20250225204859",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-25 20:37:00",
        "Headline": "One of the passengers claims there were a few spare seats but that flight attendants didn't offer to move them.",
        "Content": "A couple have said they were forced to sit next to a dead body for four hours on a Qatar Airways flight. Mitchell Ring and Jennifer Colin were travelling from Melbourne to Doha, en route to Italy, when a woman walked out the toilet and collapsed near their row about 10 hours into the journey. \"Unfortunately the lady couldn't be saved, which was pretty heartbreaking to watch,\" Mr Ring told Australia's A Current Affair programme. He added: \"They tried to wheel her up towards business class, but she was quite a large lady and they couldn't get her through the aisle.\" The pair, who were the only ones in a row of four, said flight attendants put the woman in one of the spare seats for the remaining four hours of the flight. Mr Ring told Australian media: \"They said, 'Can you move over please?'﻿ and I just said, 'Yes no problem'. \"Then they placed the lady in the chair I was in.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 He said there were a few spare seats nearby but claimed crew didn't offer to move them. Read more from Sky News:Taliban says Britons' arrest is 'misunderstanding'Mystery illness kills more than 50 people in DRC Mr Ring also said he was told to stay put while medical teams removed blankets covering the woman when they landed, and that they were offered no support. In a statement to Sky's US partner network NBC News, Qatar Airways said: \"First and foremost our thoughts are with the family of the passenger who sadly passed away on board our flight. \"We apologise for any inconvenience or distress this incident may have caused, and are in the process of contacting passengers in line with our policies and procedures.\""
    },
    {
        "title": "Campbell Scott: Body of missing British businessman 'found in sack of pineapples' in Kenya",
        "description": "The body of a British businessman who went missing in Kenya more than a week ago was reportedly found in a sack of pineapples in a forest.",
        "url": "https://news.sky.com/story/campbell-scott-body-of-missing-british-businessman-found-in-sack-of-pineapples-in-kenya-13316862",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-campbell-scott-fico_6838871.jpg?20250224222519",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-25 15:41:00",
        "Headline": "The Briton was last seen attending a conference in Nairobi - with local media reporting a waiter and a taxi driver have been arrested in relation to his death.",
        "Content": "The body of a British businessman who went missing in Kenya more than a week ago was reportedly found in a sack of pineapples in a forest. Campbell Scott, believed to be from Dunfermline in Fife, Scotland, was last seen attending a conference at the JW Marriot Hotel in the capital Nairobi on 16 February. His body was discovered in a sack of pineapples in a forest around 66 miles southeast of the city at the weekend, according to local media reports. Local administrator Thomas Maitha told Kenya's The Standard Newspaper that Mr Scott's eyes had been gouged out and his ears had been cut. He said: \"(Mr Scott) appeared to have been tortured. \"The body, which was in bad state, prompted us to escalate the matter further. \"In addition to the physical injuries, the killer(s) had tied his hands from the back, and stuffed the body in the sack which had been packed with ripe pineapples.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 CCTV footage reportedly captured him leaving the hotel with a man dressed in a white T-shirt and blue jeans before they got in a taxi on the day he was last seen. The taxi driver and a waiter from the club have been arrested by police investigating the death, according to local media. Mr Scott worked as a senior director at credit scoring firm Fico and was reportedly on a business trip when he disappeared. His employer said police have identified a body and are investigating. Read more:Man pleads guilty to stalking Strictly judgeReturn of Trump stuns UK into action on defenceMystery illness kills more than 50 people in Africa A spokesperson said: \"Fico can confirm that Nairobi police have identified the body of Campbell Scott, a Fico employee. \"Campbell went missing last Sunday while on a business trip to Nairobi. We are not sharing further details as the investigation is in the hands of the police. \"We are devastated by this tragic news. Campbell was a leader in our international Scores business. \"He joined Fico in 2014 and was instrumental in introducing Scores to new markets and growing our business with existing partnerships. \"We mourn his passing and will miss his humour and kindness. \"Our thoughts are with Campbell's family and friends.\" A Foreign Office spokesperson said: \"We are supporting the family of a British man who has died in Kenya and are in contact with the local authorities.\" Kenya's National Police Service has been contacted for comment."
    },
    {
        "title": "'No chance' of impact from asteroid 2024 YR4, say space agencies",
        "description": "An asteroid that had a very small chance of hitting Earth is no longer a potential threat, according to scientists.",
        "url": "https://news.sky.com/story/no-chance-of-impact-from-asteroid-2024-yr4-say-space-agencies-13316954",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-asteroid-earth-space_6826746.jpg?20250212165816",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-25 18:38:00",
        "Headline": "NASA now says the rock - estimated at 40-90 metres across - poses \"no significant impact risk to Earth in 2032 and beyond\".",
        "Content": "An asteroid that had a very small chance of hitting Earth is no longer a potential threat, according to scientists. The 2024 YR4 asteroid climbed to the top of the risk list earlier this month when the chance of a collision in 2032 tripled from 1.2% to about 3% (about one in 33). It first set off warning systems in December after being spotted through telescopes in Chile, travelling around 38,000mph. Professor Brian Cox had even talked of a possible \"deflection mission\" if the risk did not drop. But anyone faintly worried about a potential Armageddon scenario can now rest easy - the European Space Agency has slashed the chance of impact on Earth to 0.001%, and NASA to 0.0017%. The US space agency said it poses \"no significant impact risk to Earth in 2032 and beyond\". Paul Chodas, head of NASA's near-Earth objects studies, said the odds wouldn't rise again and an impact had been ruled out. \n                  Planetary parade: How and when to spot seven planets in UK skies in rare alignment\n                 \n                  Mars could have once had sandy beaches and a large ocean, scientists say\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \"That's the outcome we expected all along, although we couldn't be 100% sure that it would happen,\" he said. Read more from Sky News:How and when to spot seven planets in UK skiesMars could have once had sandy beaches Telescopes will continue to track the asteroid as it moves away, with the Webb Space Telescope hoping to pinpoint its size. Estimates had put it between 40-90 metres wide (130-300ft). \"While this asteroid no longer poses a significant impact hazard to Earth, 2024 YR4 provided an invaluable opportunity\" for study, NASA added. There is a very small chance that 2024 YR4 will \"impact the moon\" on 22 December 2032. That probability is currently 1.7%."
    },
    {
        "title": "Post Office scandal: 21 ‘Capture’ cases now being investigated for miscarriages of justice",
        "description": "The number of convictions linked to a second Post Office IT scandal being investigated for miscarriages of justice - has more than doubled, Sky News has learned.",
        "url": "https://news.sky.com/story/post-office-scandal-21-8216capture8217-cases-now-being-investigated-for-miscarriages-of-justice-13316673",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-post-office-sign_6839861.jpg?20250225230217",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-02-25 11:00:00",
        "Headline": "So far around 100 people who suffered after being accused of stealing from their branch, while using Capture, could be eligible for redress.",
        "Content": "\n          Business correspondent\n              @SkyNewsAdele\n  The number of convictions linked to a second Post Office IT scandal being investigated for miscarriages of justice - has more than doubled, Sky News has learned. Twenty-one Capture cases have now been submitted to the Criminal Cases Review Commission (CCRC) for review. Before Christmas, it was around eight. They relate to the Capture computing software, which was used in Post Office branches in the 1990s before the infamous faulty Horizon system was introduced. Hundreds of sub-postmasters were wrongly accused of stealing after Horizon software caused false shortfalls in branch accounts between 1999 and 2015. A report last year found that there was a reasonable likelihood that the Capture accounting system, used from the early 1990s until 1999, was also responsible for shortfalls. If the CCRC finds significant new evidence or legal arguments not previously heard before, cases can be referred back to the Court of Appeal. \n                  Sub-postmasters still going through hell, lead campaigner Sir Alan Bates says\n                 \n                  Tesco eyes delivery of Crown Post Office branches\n                 \n                  Post Office unveils new wave of cuts to fuel transformation plan\n                 Lawyer for victims, Neil Hudgell from Hudgell Solicitors, says the next steps for the Capture cases and the CCRC are still \"some months away\". He said he is also hopeful that the first cases could be referred to the Court of Appeal before the end of this year. \"Certainly we will certainly be lobbying,\" he said. \"The CCRC will be lobbying, the advisory board will be lobbying any interested parties, that these are hideously damaged people of advancing years who need some peace of mind and the quicker that can happen the better.\"  'We didn't talk about it' Among those submitted to the CCRC - Pat Owen's Capture case was the first. Her family have kept her 1998 conviction for stealing from her post office branch a secret for 26 years. Speaking to Sky News they have opened up for the first time about what happened to her. Pat was a former sub-postmistress, who was found guilty and given a two-year suspended sentence. She died in 2003 from heart failure. Her daughters describe her as coming home from court after her conviction \"a different woman\". \"We didn't talk about it,\" said Juliet Shardlow. \"We didn't talk about it amongst ourselves as a family, we didn't talk about it with the extended family. \"Our extended family don't know.\" David Owen, Pat's husband, said she lost a lot of weight after her conviction and at 62 years old \"looked like an old gal of 90\". Capture evidence never heard in court Pat's family kept all the documents from her case safe for over two decades and now a key piece of evidence may turn the tide on her conviction, and potentially help others. A document summarising the findings of an IT expert described the computer Pat used as having \"a faulty motherboard\". It also stated that this \"would have produced calculation errors and may have been responsible for the discrepancies subsequently identified by Post Office Counters' Security and Investigation team.\" Read more from Sky News:Sub-postmasters: 'Still going through hell'Compensation for victims of CaptureCalls on Fujitsu for compensationThe computer expert was due to give evidence in Pat Owen's defence at court as part of her trial - but failed to turn up on the day. The family say they never found out exactly why he didn't show up at court. David said there was a computer all set up in the courtroom for the expert to use to show malfunctions. \"I heard, now I can't remember who from, that he'd done work for the Post Office,\" he said. \"If he turned up to be a witness in court for us to he wouldn't get any more work from the Post Office.\" Despite best efforts the expert has never been tracked down. The Post Office has declined to comment. David also described how his wife never expected to lose her case. \"She was so confident. She knew she didn't do anything wrong,\" he said. \"But when the guilty verdict came out she actually fell to her knees in the dock crying her eyes out shaking.\" He said the judge then asked if he wanted to say anything, and David said he got up in court and spoke at length about his wife's innocence. The government announced in December that they will be setting up a redress scheme for Capture victims, similar to Horizon. So far around 100 people who suffered after being accused of stealing from their branch, while using Capture, could be eligible for redress."
    },
    {
        "title": "MP demands clampdown on 'ghost' number plates",
        "description": "People are using 'ghost' number plates to avoid getting caught for dangerous driving, according to an MP who is attempting to change the law.",
        "url": "https://news.sky.com/story/mp-demands-clampdown-on-ghost-number-plates-13316814",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ghost-number-plates_6839375.jpg?20250225195227",
        "type": "UK",
        "Author": "Tim Jones",
        "Date Published": "2025-02-25 13:55:00",
        "Headline": "The fine for a dodgy number plate is £100 while the penalty for speeding is £100 plus three penalty points.",
        "Content": "\n          News Reporter\n              @TimJones_SN\n People are using 'ghost' number plates to avoid getting caught for dangerous driving, according to an MP who is attempting to change the law. Sarah Coombes, who represents West Bromwich, wants the penalties increased to tackle illegal licence plates which are being used by some motorists to run red lights and ignore speed limits. Motorists can buy so-called 'ghost' or 'stealth' plates for as little as £30. They reflect light back, preventing the registration number from being clearly seen by Automatic Number Plate Recognition (ANPR) cameras. The Labour MP wants the fine for being caught with a non-compliant number plate increased to £1,000 and at least six penalty points. Currently, drivers caught with one can be fined £100. That compares to the minimum penalty for speeding which is a £100 fine and three penalty points. \"There are a select minority of people who think they are above the law. The behaviour of a few reckless drivers is putting us all at risk. The punishments need to be tougher,\" she said. The scale of number plate misuse is unclear but one estimate suggests around 1 in 15 plates could be modified in some way. One police exercise conducted in London found that 40% of taxi and private hire vehicles had coatings applied to their plates that made them unreadable to ANPR cameras. Tony Porter, the UK's former surveillance camera commissioner, said: \"ANPR and the humble number plate is hot-wired into the UK's road safety. \"If people think, by doctoring their plates, they can speed, drive without due care or without insurance to evade prosecution - then we need to remove this temptation. Innocent members of the public are being put at risk.\" Ms Coombes is putting forward her plan in the Commons on Wednesday using a 10-minute rule motion. But unless it gets government support the idea is unlikely to progress into law. Jack Cousens, head of roads policy for The AA, said: \"Drivers manipulating their number plates in any way is a serious offence. \"While steps are needed to tackle the root cause of the problem, some feel that a lack of traffic police increases their chances of getting away with such activity.\" A government spokesperson said: \"This government takes road safety seriously. We are committed to reducing the number of those killed and injured on our roads. \"Since the general election, the Labour government has begun work on a new road safety strategy, the first in over a decade. Ministers will share more details of the strategy in due course.\""
    },
    {
        "title": "Campbell Scott: Body of missing British businessman 'found in sack of pineapples' in Kenya",
        "description": "The body of a British businessman who went missing in Kenya more than a week ago was reportedly found in a sack of pineapples in a forest.",
        "url": "https://news.sky.com/story/campbell-scott-body-of-missing-british-businessman-found-in-sack-of-pineapples-in-kenya-13316862",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-campbell-scott-fico_6838871.jpg?20250224222519",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-25 15:41:00",
        "Headline": "The Briton was last seen attending a conference in Nairobi - with local media reporting a waiter and a taxi driver have been arrested in relation to his death.",
        "Content": "The body of a British businessman who went missing in Kenya more than a week ago was reportedly found in a sack of pineapples in a forest. Campbell Scott, believed to be from Dunfermline in Fife, Scotland, was last seen attending a conference at the JW Marriot Hotel in the capital Nairobi on 16 February. His body was discovered in a sack of pineapples in a forest around 66 miles southeast of the city at the weekend, according to local media reports. Local administrator Thomas Maitha told Kenya's The Standard Newspaper that Mr Scott's eyes had been gouged out and his ears had been cut. He said: \"(Mr Scott) appeared to have been tortured. \"The body, which was in bad state, prompted us to escalate the matter further. \"In addition to the physical injuries, the killer(s) had tied his hands from the back, and stuffed the body in the sack which had been packed with ripe pineapples.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 CCTV footage reportedly captured him leaving the hotel with a man dressed in a white T-shirt and blue jeans before they got in a taxi on the day he was last seen. The taxi driver and a waiter from the club have been arrested by police investigating the death, according to local media. Mr Scott worked as a senior director at credit scoring firm Fico and was reportedly on a business trip when he disappeared. His employer said police have identified a body and are investigating. Read more:Man pleads guilty to stalking Strictly judgeReturn of Trump stuns UK into action on defenceMystery illness kills more than 50 people in Africa A spokesperson said: \"Fico can confirm that Nairobi police have identified the body of Campbell Scott, a Fico employee. \"Campbell went missing last Sunday while on a business trip to Nairobi. We are not sharing further details as the investigation is in the hands of the police. \"We are devastated by this tragic news. Campbell was a leader in our international Scores business. \"He joined Fico in 2014 and was instrumental in introducing Scores to new markets and growing our business with existing partnerships. \"We mourn his passing and will miss his humour and kindness. \"Our thoughts are with Campbell's family and friends.\" A Foreign Office spokesperson said: \"We are supporting the family of a British man who has died in Kenya and are in contact with the local authorities.\" Kenya's National Police Service has been contacted for comment."
    },
    {
        "title": "Mother fatally stabbed with 'zombie knife' in front of daughter at Notting Hill Carnival, court hears",
        "description": "A young mother was fatally stabbed with a \"zombie knife\" in front of her three-year-old daughter on the family day of Notting Hill Carnival, a court heard.",
        "url": "https://news.sky.com/story/mother-fatally-stabbed-with-zombie-knife-in-front-of-daughter-at-notting-hill-carnival-court-hears-13316888",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-cher-maximen-death_6674459.jpg?20240901225905",
        "type": "UK",
        "Author": "Ashna Hurynag",
        "Date Published": "2025-02-25 16:29:00",
        "Headline": "Cher Maximen, 32, was celebrating the annual carnival with her friends when she was allegedly stabbed by 20-year-old Shakeil Thibou. ",
        "Content": "\n          News correspondent\n              @ashnahurynag\n A young mother was fatally stabbed with a \"zombie knife\" in front of her three-year-old daughter on the family day of Notting Hill Carnival, a court heard. Cher Maximen, 32, had been celebrating the annual carnival with her friends and their children on Sunday 25 August last year. Shakeil Thibou, 20, is accused of stabbing Ms Maximen in the groin after she was knocked to the ground while he was in an altercation with another man. He denies her murder. At the opening of the trial on Tuesday, prosecutor Ed Brown KC told the court Ms Maximen and the group she was with had got caught up in the middle of a \"horrifying outbreak of violence\" at 5:48pm. A crowd of hundreds splintered on Golborne Road in west London as Thibou and his two brothers, who are on trial alongside him facing separate charges, had an altercation with at least two other males. Thibou produced a \"huge\" knife, described by one witness as a zombie knife, and lunged repeatedly at a man called Adjei Isaac in a \"determined, thrusting movement\", the Old Bailey heard. Mr Isaac recoiled and during the altercation the pair bumped into Ms Maximen who had been crouched chatting to her friends as they sat on the ground with their children. The knife, the prosecutor said, missed Mr Isaac by \"centimetres\". Thibou denies the attempted murder of Mr Isaac. Mr Brown KC told the court Ms Maximen struggled to regain her footing after being knocked to the ground. He said: \"Cher Maximen in those moments grabbed hold of Shakeil Thibou's coat, pulled it and managed to get partially to her feet. \"She appeared to attempt to strike out with her hand at Shakeil who of course was still holding that knife in his hand. Cher Maximen took a step towards Shakeil Thibou and at the same time attempted to raise her right leg out towards him. \"It was at this moment, Shakeil Thibou raised the knife directly towards Cher Maximen and deliberately thrust it towards her, stabbing her in the groin.\" His brothers, Sheldon Thibou, 25, and Shaeim Thibou, 22, both deny assaulting a police officer and violent disorder. 'Pure anger' in accused face As jurors were shown police bodycam footage of the incident, Mr Brown KC told them: \"You will see pure anger in the face of Shakeil Thibou. This was right in front of her [Ms Maximen's] three-year-old daughter.\" The \"truly shocking\" incident happened in just eight seconds. Ms Maximen fell to the ground as the defendants ran away. The knife wound was 12cm deep and had caused severe internal bleeding in her groin. She died six days later in hospital. After the fatal incident, Thibou allegedly disposed of the knife. Hundreds had been attending the \"happy carefree event\" when the attack happened just off the main carnival route. The trial continues."
    },
    {
        "title": "Neighbour of Luton teenager who murdered family speaks out after living above killer for decade ",
        "description": "Triple killer Nicholas Prosper, who also planned to attack a primary school, gave no clues about what he was going to do, according to a neighbour.&#160;",
        "url": "https://news.sky.com/story/luton-teenager-who-murdered-family-seemed-like-a-really-chilled-person-neighbour-says-13316951",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nicholas-prosper_6839539.jpg?20250225185521",
        "type": "UK",
        "Author": "Tom Parmenter",
        "Date Published": "2025-02-25 18:24:00",
        "Headline": "David Melseaux, who lived in a flat directly above Nicholas Prosper for over a decade, said his family heard the 19-year-old shooting his mother and two siblings in September last year. ",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  Triple killer Nicholas Prosper, who also planned to attack a primary school, gave no clues about what he was going to do, according to a neighbour.  \"He didn't give off a vibe to him,\" David Melseaux told Sky News. \"He seemed like a really chilled person, it didn't really seem like he had anything wrong with him.\" The 20-year-old trainee electrician lived in a flat directly above Prosper for over a decade. \"I have known him for years… It just goes to show you never know anyone's character really no matter how close you are to them.\" Prosper, 19, pleaded guilty on Monday to murdering his mother Juliana Falcon, his 16-year-old brother Kyle Prosper and 13-year-old sister Giselle Prosper at the family home in Luton last September. Mr Melseaux's family, who live on the ninth floor of their tower block, heard the shootings happen. \"They said the floor was shaking, they heard banging and screaming and it was just a very scary moment because they didn't know what was going on.\" After his guilty pleas, Bedfordshire Police said officers were in no doubt that the 19-year-old also planned to attack his old primary school in Luton. He was arrested on a nearby street and a gun was found in bushes - officers had intercepted him before he could carry out the second phase of his attack. Mr Melseaux told Sky News he couldn't believe what detectives said his neighbour planned to do. \"Why would someone want to do that?\" he asked. \"Why would someone want to hurt innocent kids, something you should never do as a person - that's a line you should never cross.\" Read more from Sky News:Man admits stalking Strictly judgeCCTV shows moment thieves roll gold toilet out of palaceMan Utd announce more redundancies Parents outside the primary school in Luton told Sky News they were horrified by the prospect of what could have happened. \"It's stuff we expect from the (United) States not here… it's scary,\" one mother said. One father said: \"Having to sit your 11-year-old down and talk about someone with a gun at the school is not right. \"However we were able to convince them and reassure them that is it going to be OK.\" The 19-year-old has been held on remand and will be sentenced next Wednesday."
    },
    {
        "title": "MP Paul Waugh accuses Meta of turning Facebook Messenger into 'Epstein's paedophile island'",
        "description": "An MP has accused Meta of turning Facebook Messenger into \"Jeffrey Epstein's private island\" by enabling end-to-end encryption.&#160;",
        "url": "https://news.sky.com/story/mp-paul-waugh-accuses-meta-of-turning-facebook-messenger-into-epsteins-paedophile-island-13316884",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-facebook-messenger_5827680.jpg?20220708112019",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-25 16:17:00",
        "Headline": "After MP Paul Waugh accused Meta of turning Facebook into \"Epstein's own paedophile island\", Facebook's representative said online child abuse imagery needed a \"whole of society response\" where tech companies and law enforcement agencies worked cooperatively.",
        "Content": "\n          Science and Technology reporter\n       An MP has accused Meta of turning Facebook Messenger into \"Jeffrey Epstein's private island\" by enabling end-to-end encryption.  The Science, Innovation and Technology Committee grilled tech giants X, TikTok, Google and Meta today as part of an inquiry into online misinformation and harmful algorithms. \"Twenty years ago, someone like Gary Glitter had to go to the other side of the world to prey on children,\" said Labour MP Paul Waugh to Chris Yiu, one of Meta's directors of public policy. \"Someone like Jeffrey Epstein had to create his own private paedophile island. \"Now, these monsters, all they have to do is go on to set up a group on Facebook Messenger.\" Mr Waugh was referring to Facebook Messenger's recent implementation of end-to-end encryption, meaning that no one, not even Facebook, can see the contents of encrypted messages. Law enforcement agencies also cannot see the messages, which is a constant source of tension between tech companies and governments. \n                  Social media users risk fragmenting into silos after Trump election victory, experts warn\n                 \n                  Meta denies 'forcing' people to follow Donald Trump and JD Vance on social media apps\n                 \n                  Nick Clegg to step down from Meta role - with prominent Republican Joel Kaplan to replace him\n                 Just last week, Apple removed one of its highest-security tools for users over an alleged request by the Home Office to be able to see its encrypted user data.  \"Isn't it true that you've turned Facebook Messenger into Epstein's own paedophile island and a place where you can do what you want without getting caught?\" asked Mr Waugh. Mr Yiu denied this was the case and said the issue of online child sexual abuse material needed a \"whole of society response\" where tech companies and law enforcement agencies worked cooperatively. He also argued end-to-end encryption is a \"fundamental technology designed to keep people safe and protect their privacy\". The select committee's inquiry is investigating the spread of harmful content online, sparked by last August's riots. The widespread unrest took hold across the country after three young girls were stabbed to death in Southport.  In the days that followed, illegal content and disinformation spread \"widely and quickly\" online, according to the communications regulator Ofcom. Read more from Sky News:Apple removes end-to-end security encryption tool for UKIllness kills more than 50 people in Democratic Republic of CongoKate Bush, Sam Fender and Damon Albarn release silent protest album The committee chair Chi Onwurah said Elon Musk, owner of X, was invited to the evidence session but the billionaire did not reply formally. MP Emily Darlington also quizzed the Meta representative about the company's recent changes to its content guidelines. She read out numerous examples of Meta users posting racist, antisemitic and transphobic comments online and asked Mr Yiu how Meta justified allowing those posts to stay online. \"We have received feedback that [...] some areas of debates were being suppressed too much on our platform and that some conversations, whilst challenging, should have a space to be discussed,\" he said. X's representative also faced questions from the MPs, with Ms Darlington asking why verified X users were able to post comments calling politicians rapists and threatening to \"rise up and shoot\" public figures. Wifredo Fernandez, X's senior director for Government Affairs, said he would ask the X team to review the posts."
    },
    {
        "title": "Shirley Ballas stalker Kyle Shaw admits charge at Liverpool Crown Court",
        "description": "A 37-year-old man has pleaded guilty to stalking Strictly Come Dancing judge Shirley Ballas over the course of six years.",
        "url": "https://news.sky.com/story/man-37-pleads-guilty-to-stalking-strictly-come-dancing-judge-shirley-ballas-13316859",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-shirley-ballas-stalking_6793487.jpg?20250107114645",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-25 15:36:00",
        "Headline": "Shaw, from Birkenhead, was bailed until 1 April and told to expect an immediate prison sentence.",
        "Content": "A 37-year-old man has pleaded guilty to stalking Strictly Come Dancing judge Shirley Ballas over the course of six years. Kyle Shaw admitted stalking the 64-year-old dancer and TV star between 31 August 2017 and 29 November 2023. According to the charge, he caused Ballas \"serious alarm or distress, which had a substantial adverse effect on her usual day-to-day activities\". The court heard he made continued attempts to contact Ballas, including posting an image of her house on social media. He also tried to contact family, friends and colleagues, monitored her online and TV presence and made arrangements to go to her book tour. Ballas was so concerned, the court was told, that she increased her security measures, moved her mother to a different address and altered social and work arrangements. Shaw, from Whetstone Lane in Birkenhead, was bailed at Liverpool Crown Court ahead of sentencing on 1 April. He also admitted possessing cannabis. Read more from Sky News:BBC apologises over WestwoodRoberta Flack dies Judge Gary Woodhall told him it was very likely he would get \"an immediate custodial sentence\". Ballas, originally from Wallasey, has been head judge on Strictly since 2017, when she replaced Len Goodman. Known as the 'Queen of Latin', she retired from competition in 1996 after winning numerous titles and went on to become a dance coach and international judge."
    },
    {
        "title": "Planetary parade: How and when to spot seven planets in UK skies in rare alignment",
        "description": "Not one, not two, but seven planets are due to line up in the night skies later this week in a relatively rare planetary parade.",
        "url": "https://news.sky.com/story/planetary-parade-how-and-when-to-spot-seven-planets-in-uk-skies-in-rare-alignment-13316815",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-planets-space_6839317.jpg?20250225143504",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-25 16:18:00",
        "Headline": "The occasion will see Mars, Jupiter, Mercury, Venus, Saturn, Uranus, Neptune and Mercury align, with some of the planets visible to the naked eye.",
        "Content": "Not one, not two, but seven planets are due to line up in the night skies later this week in a relatively rare planetary parade. The phenomenon will see Mars, Jupiter, Mercury, Venus, Saturn, Uranus, Neptune and Mercury align, with some of the planets visible to the naked eye. Keen astronomers may have already spotted six of the planets in late January or earlier this month, but on 28 February, Mercury will also join the parade. This will mean a potential of seven planets on display at once, the Greenwich Royal Observatory says. Here is everything you need to know ahead of the phenomenon and how to maximise your chances of spotting all seven planets. Why do the planets align? In simple terms, as the planets in our Solar System orbit the sun, they occasionally line up in space, according to NASA. The term planetary alignment can refer to apparent line-ups with other planets, the moon, or bright stars. When this happens, the planets always appear along a line or an arc, NASA adds, due to the way they are viewed from Earth. How rare is it? \"Planetary alignments, where multiple planets appear close together in the sky, occur periodically but are relatively rare,\" Dr Shyam Balaji, researcher in astroparticle physics and cosmology at King's College London, said last month. He added alignments of six or more planets happen approximately every few decades, making Friday's potential line-up even rarer. NASA adds Mars, Jupiter, and Saturn are frequently seen in the night sky, but the addition of Venus and Mercury are particularly noteworthy. Will UK skies be clear enough to see the planets? There's good news, and somewhat bad news - depending on where you are in the UK. Sky News meteorologist Jo Robinson says there's high pressure over the UK on Friday, meaning the weather looks good for people getting ready to watch the night skies. Most places will also be dry with clear spells, although Robinson warns temperatures will be chilly, with the Met Office predicting \"widespread\" frost on Friday morning. Unfortunately, Ireland, Northern Ireland and northwest Scotland may be quite cloudy ahead of rain moving in on Friday night, Robinson says. But, she adds, the forecast is still \"several days away, so timings may change\". Any delay in the rain moving in will allow for clearer skies. An added bonus to the upcoming planetary alignment is there will also be a new moon on 28 February. This occurs when the moon is directly between the sun and the Earth, with its shadowed side pointing towards Earth. It means that those looking into the skies on Friday will be less affected by light pollution from the moon, and may even be able to get a good look at some galaxies, the Greenwich Royal Observatory says. Read more from Sky News:Mars could have had beaches and an oceanWhat could happen if the 2024 YR4 asteroid hits earth? Will you need a telescope? Five planets: Mercury, Venus, Mars, Jupiter, and Saturn, are typically visible to the naked eye. However, this does not guarantee they will be visible this Friday. The Greenwich Royal Observatory says in late February it becomes much more difficult to see Saturn as it will be very low on the southwestern horizon after sunset. NASA adds Mercury could also be difficult for observers to see without the aid of a telescope, as it may be too faint and too low. It says to see Neptune a telescope is absolutely necessary, while Uranus, although technically bright enough to detect with good eyesight, is \"quite faint and requires dark skies and precise knowledge of its location among similarly faint stars\", so a telescope is recommended. Other top tips for planet-spotters To help keen observers maximise their chances of seeing as many planets as possible, Dr Balaji, from King's College London recommends the following tips: • Find a location away from city lights• Use current astronomical software or websites to find a planet's latest position• Exercise caution when observing near sunrise or sunset• Check reliable astronomy websites for updated viewing information as the date approaches."
    },
    {
        "title": "MP grills X official over extreme messages after being told to 'swing on a gibbet'",
        "description": "An MP has confronted social media bosses over extreme messages received by politicians after she was threatened with being hung.",
        "url": "https://news.sky.com/story/mp-grills-x-official-over-extreme-messages-after-being-told-to-swing-on-a-gibbet-13317034",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emily-darlington-mp_6839781.png?20250225221153",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-02-25 20:44:00",
        "Headline": "Emily Darlington said threats towards her have not been removed, and the same account is posting racist and misogynistic content. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n An MP has confronted social media bosses over extreme messages received by politicians after she was threatened with being hung. Emily Darlington said the comment was made after she shared a petition to save her local Post Office on X last November and still hasn't been removed - despite reporting it. The same account has continued to post racist, misogynistic and homophobic comments, she said. The Labour MP was speaking at the Science, Innovation and Technology Committee, which grilled tech giants X, TikTok, Google and Meta on Tuesday as part of an inquiry into online misinformation and harmful algorithms. Ms Darlington said: \"In November I posted a tweet about my petition to save my local Post Office. \"This was a reply from one person: 'You are a traitor to the British people and you will swing oh so slowly on a gibbet'. \"I had to look up what a gibbet is, it's not a pleasant thing.\" \n                  Starmer says decision to increase defence spending was 'accelerated' by Trump taking office\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 A gibbet is a form of gallows from which the bodies of executed criminals were hung to public view. Ms Darlington said she reported the post as harmful and violent speech, in violation of X's rules that state expressing desire for violence is not allowed. Addressing Wifredo Fernandez, X's senior director for government affairs, she said: \"These are your safety rules. No action was taken, no action is still taken, the post is still up.\" She went onto list other violent and racist comments made by the account. She asked Mr Fernandez: \"Is this acceptable, under the guise of free speech on X these days?\" The X official said the comments are \"abhorrent\" and he will have his teams take a look - but that couldn't make any assurances the account will be removed. Ms Darlington said the comments are \"not unique\" and many other MPs get messages \"from these kinds of accounts\". \"[They] report them and no action is taken\", she said. Elsewhere in the session, MPs clashed with Meta representatives over the implementation of end-to-end encryption - with Labour's Paul Waugh accusing the platform of turning Facebook Messenger into \"Jeffrey Epstein's private island\". Meta's removal of third-party fact-checkers from its platforms also came in for criticism, with MPs saying it will allow \"racist misinformation\" to spread. In January, Meta boss Mark Zuckerberg announced the change, saying at the time that fact-checkers were too \"politically biased\" and were having an impact on \"free expression\" - a move seen by many as an attempt to get closer to the pro-free speech stance of the incoming Donald Trump administration."
    },
    {
        "title": "Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv",
        "description": "Ukraine has agreed terms with the United States on a crucial minerals deal, a Ukrainian government source has told Sky News.",
        "url": "https://news.sky.com/story/ukraine-agrees-terms-with-us-on-minerals-deal-with-no-security-guarantee-for-kyiv-13317021",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-volodymyr_6835229.jpg?20250221052112",
        "type": "World",
        "Author": "Azad Safarov, Ukraine producer",
        "Date Published": "2025-02-25 20:26:00",
        "Headline": "A Ukrainian government source has said there is a plan for the accord to be signed by both sides \"very soon\".",
        "Content": "By Azad Safarov, Ukraine producer  Ukraine has agreed terms with the United States on a crucial minerals deal, a Ukrainian government source has told Sky News. There has been no confirmation from the US side yet but Donald Trump said on Monday evening that his Ukrainian counterpart \"would like to sign the minerals deal with me\". The accord, once signed, could unlock a new long-term partnership between Kyiv and Mr Trump's White House after weeks of increasingly tense exchanges. The source said there was a plan for the document to be signed \"very soon\". This could even be during a face-to-face meeting between Ukrainian President Volodymyr Zelenskyy and Mr Trump. The US president told reporters on Tuesday evening that his Ukrainian counterpart is \"coming to visit on Friday\". He added: \"We have pretty much negotiated our deal on rare earths.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Campbell Scott: Body of missing British businessman 'found in sack of pineapples' in Kenya\n                 A Ukrainian government source has also said Mr Zelenskyy will meet with Mr Trump in Washington on Friday and that the meeting was proposed by the American side. Meanwhile, Ukrainian officials have said Kyiv has agreed a framework for an economic deal with the US which will see them trade rights to rare minerals in exchange for continued aid. The deal sets out the terms to create a new fund to invest in Ukraine's minerals, rare earth materials and other valuable natural resources. It no longer contains an initial demand by the United States for a right to $500bn (£394bn) in potential revenue from the resources. Mr Zelenskyy had previously described such a high price as not being a \"serious\" conversation. Mr Trump, however, views the minerals transaction with Ukraine as a fair way to recoup the billions of dollars that the US has given Kyiv - via weapons and financial support - to assist the armed forces in their fight against Russia's full-scale invasion over the past three years. The document also does not provide a commitment from Washington to give security guarantees to Ukraine in the wake of any ceasefire deal with Vladimir Putin - something that Kyiv desperately needs and has been asking for. More granular details about the new partnership are expected to be fleshed out in coming discussions. Read more:Pay back the billions of aid, Trump tells UkraineWhat minerals does Ukraine have and why does Trump want them? 👉 Listen to Sky News Daily on your podcast app 👈 The two sides have \"agreed on a framework agreement on how to create a fund that will be filled with a share of minerals\" and other natural resources, the government source said, speaking on condition of anonymity. \"This is a political step to ensure that resource revenues are used for the security and reconstruction of Ukraine.\" The fund would comprise US money that would be invested in Ukrainian natural resources, with profits shared between Washington and Kyiv, it is understood. The Financial Times first reported on the agreement being reached. It said the final version of the deal was dated 24 February. \"The minerals agreement is only part of the picture. We have heard multiple times from the US administration that it's part of a bigger picture,\" Olha Stefanishyna, Ukraine's deputy prime minister and justice minister who has led the negotiations, told the newspaper on Tuesday. The development comes after Mr Trump shocked European leaders last week by calling Mr Zelenskyy a \"dictator with no elections\". He added that the Ukrainian president \"better move fast or he is not going to have a country left\" after Mr Zelenskyy had accused him of living in a Russian-made \"disinformation space\".  French President Emmanuel Macron flew to Washington to meet with Mr Trump on Monday for talks on Ukraine amid fragile relations between the US and Europe. Meeting in the White House on the third anniversary of Russia's war in Ukraine, the French president said he and Mr Trump \"made substantive steps forward during our discussions\". It comes as UK Prime Minister Sir Keir Starmer prepares to meet with Mr Trump at the White House on Thursday. Mr Starmer and Mr Macron spoke on the phone on Tuesday and \"agreed that President Trump's leadership in working towards a durable peace in Ukraine was welcome\", a Downing Street spokesperson continued."
    },
    {
        "title": "Landmark moment as the return of Trump stuns UK into action on defence",
        "description": "This is the moment the government finally woke up to the enormity of the threat faced by the UK and the inability of its hollowed-out armed forces to cope. ",
        "url": "https://news.sky.com/story/landmark-moment-as-the-return-of-trump-stuns-uk-into-action-on-defence-13316819",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-keir-starmer-estonia_6400295.jpg?20231221082423",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-25 14:03:00",
        "Headline": "The decision to increase military spending to 2.5% of GDP by 2027 has been sparked by a fundamental change in the UK's ability to rely on its strongest ally, the United States.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  This is the moment the government finally woke up to the enormity of the threat faced by the UK and the inability of its hollowed-out armed forces to cope.  But make no mistake, today's decision to increase military spending is not just about increasing the number of troops, warships and fighter jets or even ensuring they can use the latest drones, satellites or artificial intelligence breakthroughs. This is an emergency that requires the entire nation to take responsibility for - or at least an interest in - the defence of the nation and the importance of being able to deter threats. Politics latest: PM makes defence commitment Sir Keir Starmer signalled this fundamental shift in priorities when he told parliament: \"We must change our national security posture because a generational challenge requires a generational response that will demand some extremely difficult and painful choices.\" He continued: \"And through those choices, as hard as they are, we must also seek unity. A whole society effort that will reach into the lives, the industries, and the homes of the British people.\" Such a proposal is not something new. The UK has a long history of being prepared for war. The entirety of the Cold War era was framed around ensuring the UK had enough troops and reservists to fight a sustained conflict, supported by a vast industrial base to produce weapons and a society that was intrinsically resilient, with the ability to sustain itself with emergency food rations, power supplies and an understanding of the need to be prepared to respond in an emergency. Back then, the threat was war - maybe even nuclear annihilation - with the Soviet Union. Today the threat is just as stark but also far more complex. Russia is the immediate danger. But China poses a long-term challenge, while Iran and North Korea are also menacing adversaries. Most fundamentally though is the change in the UK's ability to rely squarely on its strongest ally, the United States. Donald Trump, with his resentment of shouldering the responsibility for European security, has made clear the rest of the transatlantic NATO alliance must take much more of the share of defending themselves.  He has also signalled that he may not even be willing to deploy America's powerful military to defend every single member state - singling out those who pay far too little on their defences. He has a point when it comes to Europe freeloading on the might of the United States for too long. But the suggestion that European allies can no longer automatically rely on their American partner to come to their aid is enough to call into question the value of Article 5 of the NATO Alliance, which states an attack on one is an attack on all. When it comes to deterring foes, there must be no such uncertainty between friends. Read more from Sky News:Why Trump wants Ukraine's mineralsPutin hints at potential deals with USSanctions have changed European imports It is why countries across Europe are being urged by the new head of NATO to rapidly ramp up defence spending and adopt what NATO Secretary General Mark Rutte has called a \"war mindset\". The UK, who along with France are the only two NATO powers in Europe to possess nuclear weapons, has a bigger responsibility than most to heed that call. Russia's invasion of Crimea in 2014 was not a sufficient enough alarm bell. Even Russian President Vladimir Putin's full-scale war in Ukraine in 2022 failed to shake the UK and most of the rest of Europe from their slumber. Instead, it seems the return of Donald Trump to the White House, with all the unpredictability that he brings, is the final shock that has stunned the UK into action. Of course, defence insiders know that increasing spending to 2.5% of GDP by 2027 is not soon enough. But this - coupled with Sir Keir's language about the need for a \"generational response\" - is a landmark moment. The beginning of the correction of a strategic mistake made by Labour and Conservative governments over years to take a \"holiday from history\" and fail to find credible, capable armed forces and ensure society understands the importance of defence and the ability to deter."
    },
    {
        "title": "Campbell Scott: Body of missing British businessman 'found in sack of pineapples' in Kenya",
        "description": "The body of a British businessman who went missing in Kenya more than a week ago was reportedly found in a sack of pineapples in a forest.",
        "url": "https://news.sky.com/story/campbell-scott-body-of-missing-british-businessman-found-in-sack-of-pineapples-in-kenya-13316862",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-campbell-scott-fico_6838871.jpg?20250224222519",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 15:41:00",
        "Headline": "The Briton was last seen attending a conference in Nairobi - with local media reporting a waiter and a taxi driver have been arrested in relation to his death.",
        "Content": "The body of a British businessman who went missing in Kenya more than a week ago was reportedly found in a sack of pineapples in a forest. Campbell Scott, believed to be from Dunfermline in Fife, Scotland, was last seen attending a conference at the JW Marriot Hotel in the capital Nairobi on 16 February. His body was discovered in a sack of pineapples in a forest around 66 miles southeast of the city at the weekend, according to local media reports. Local administrator Thomas Maitha told Kenya's The Standard Newspaper that Mr Scott's eyes had been gouged out and his ears had been cut. He said: \"(Mr Scott) appeared to have been tortured. \"The body, which was in bad state, prompted us to escalate the matter further. \"In addition to the physical injuries, the killer(s) had tied his hands from the back, and stuffed the body in the sack which had been packed with ripe pineapples.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 CCTV footage reportedly captured him leaving the hotel with a man dressed in a white T-shirt and blue jeans before they got in a taxi on the day he was last seen. The taxi driver and a waiter from the club have been arrested by police investigating the death, according to local media. Mr Scott worked as a senior director at credit scoring firm Fico and was reportedly on a business trip when he disappeared. His employer said police have identified a body and are investigating. Read more:Man pleads guilty to stalking Strictly judgeReturn of Trump stuns UK into action on defenceMystery illness kills more than 50 people in Africa A spokesperson said: \"Fico can confirm that Nairobi police have identified the body of Campbell Scott, a Fico employee. \"Campbell went missing last Sunday while on a business trip to Nairobi. We are not sharing further details as the investigation is in the hands of the police. \"We are devastated by this tragic news. Campbell was a leader in our international Scores business. \"He joined Fico in 2014 and was instrumental in introducing Scores to new markets and growing our business with existing partnerships. \"We mourn his passing and will miss his humour and kindness. \"Our thoughts are with Campbell's family and friends.\" A Foreign Office spokesperson said: \"We are supporting the family of a British man who has died in Kenya and are in contact with the local authorities.\" Kenya's National Police Service has been contacted for comment."
    },
    {
        "title": "'No chance' of impact from asteroid 2024 YR4, say space agencies",
        "description": "An asteroid that had a very small chance of hitting Earth is no longer a potential threat, according to scientists.",
        "url": "https://news.sky.com/story/no-chance-of-impact-from-asteroid-2024-yr4-say-space-agencies-13316954",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-asteroid-earth-space_6826746.jpg?20250212165816",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 18:38:00",
        "Headline": "NASA now says the rock - estimated at 40-90 metres across - poses \"no significant impact risk to Earth in 2032 and beyond\".",
        "Content": "An asteroid that had a very small chance of hitting Earth is no longer a potential threat, according to scientists. The 2024 YR4 asteroid climbed to the top of the risk list earlier this month when the chance of a collision in 2032 tripled from 1.2% to about 3% (about one in 33). It first set off warning systems in December after being spotted through telescopes in Chile, travelling around 38,000mph. Professor Brian Cox had even talked of a possible \"deflection mission\" if the risk did not drop. But anyone faintly worried about a potential Armageddon scenario can now rest easy - the European Space Agency has slashed the chance of impact on Earth to 0.001%, and NASA to 0.0017%. The US space agency said it poses \"no significant impact risk to Earth in 2032 and beyond\". Paul Chodas, head of NASA's near-Earth objects studies, said the odds wouldn't rise again and an impact had been ruled out. \n                  Planetary parade: How and when to spot seven planets in UK skies in rare alignment\n                 \n                  Mars could have once had sandy beaches and a large ocean, scientists say\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \"That's the outcome we expected all along, although we couldn't be 100% sure that it would happen,\" he said. Read more from Sky News:How and when to spot seven planets in UK skiesMars could have once had sandy beaches Telescopes will continue to track the asteroid as it moves away, with the Webb Space Telescope hoping to pinpoint its size. Estimates had put it between 40-90 metres wide (130-300ft). \"While this asteroid no longer poses a significant impact hazard to Earth, 2024 YR4 provided an invaluable opportunity\" for study, NASA added. There is a very small chance that 2024 YR4 will \"impact the moon\" on 22 December 2032. That probability is currently 1.7%."
    },
    {
        "title": "Couple 'forced' to sit next to dead body for hours on Qatar Airways flight",
        "description": "A couple have said they were forced to sit next to a dead body for four hours on a Qatar Airways flight.",
        "url": "https://news.sky.com/story/couple-forced-to-sit-next-to-dead-body-for-hours-on-qatar-airways-flight-13317026",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-qatar-airways-plane_6839662.jpg?20250225204859",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 20:37:00",
        "Headline": "One of the passengers claims there were a few spare seats but that flight attendants didn't offer to move them.",
        "Content": "A couple have said they were forced to sit next to a dead body for four hours on a Qatar Airways flight. Mitchell Ring and Jennifer Colin were travelling from Melbourne to Doha, en route to Italy, when a woman walked out the toilet and collapsed near their row about 10 hours into the journey. \"Unfortunately the lady couldn't be saved, which was pretty heartbreaking to watch,\" Mr Ring told Australia's A Current Affair programme. He added: \"They tried to wheel her up towards business class, but she was quite a large lady and they couldn't get her through the aisle.\" The pair, who were the only ones in a row of four, said flight attendants put the woman in one of the spare seats for the remaining four hours of the flight. Mr Ring told Australian media: \"They said, 'Can you move over please?'﻿ and I just said, 'Yes no problem'. \"Then they placed the lady in the chair I was in.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 He said there were a few spare seats nearby but claimed crew didn't offer to move them. Read more from Sky News:Taliban says Britons' arrest is 'misunderstanding'Mystery illness kills more than 50 people in DRC Mr Ring also said he was told to stay put while medical teams removed blankets covering the woman when they landed, and that they were offered no support. In a statement to Sky's US partner network NBC News, Qatar Airways said: \"First and foremost our thoughts are with the family of the passenger who sadly passed away on board our flight. \"We apologise for any inconvenience or distress this incident may have caused, and are in the process of contacting passengers in line with our policies and procedures.\""
    },
    {
        "title": "Mystery illness kills more than 50 people in Democratic Republic of Congo",
        "description": "An unknown disease has killed more than 50 people in the Democratic Republic of Congo (DRC), according to doctors.",
        "url": "https://news.sky.com/story/mystery-illness-kills-more-than-50-people-in-democratic-republic-of-congo-13316610",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-congo-hospital-drc_6839275.jpg?20250225135732",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 08:31:00",
        "Headline": "More than 400 cases have been recorded since the outbreak in January, with most deaths occurring within 48 hours of the onset of symptoms.",
        "Content": "An unknown disease has killed more than 50 people in the Democratic Republic of Congo (DRC), according to doctors. The World Health Organisation's (WHO) Africa office said the first outbreak was discovered in the town of Boloko, in the northwest of the country. It is reported that three children ate a bat and died following haemorrhagic fever symptoms. The interval between the onset of symptoms and death has been 48 hours in the majority of cases. \"That's what's really worrying,\" Serge Ngalebato, medical director of Bikoro Hospital, a regional monitoring centre, told the news agency, The Associated Press. The outbreak began on 21 January and 419 cases have been recorded including 53 deaths. There was a second outbreak of the mystery illness in the town of Bomate on 9 February. Samples from 13 cases have been sent for testing to the National Institute for Biomedical Research in the DRC's capital, Kinshasa, the WHO said. All samples have been negative for Ebola or other common haemorrhagic fever diseases like Marburg. Some tested positive for malaria. Last year, another mystery flu-like illness which killed dozens of people in another part of Congo was considered likely to be malaria. Read more:Rebels take second city in DRCFootball clubs should stop Rwanda deal Scientists have had concerns for a long time about diseases jumping from animals to humans in places where wild animals are eaten. The number of these types of outbreaks in Africa has surged by more than 60% in the last decade, the WHO said in 2022."
    },
    {
        "title": "Pope Francis meets Vatican officials as he carries out duties from hospital",
        "description": "Pope Francis has met leading Vatican officials in hospital as he continues his recovery from pneumonia in both lungs.",
        "url": "https://news.sky.com/story/pope-francis-meets-vatican-officials-as-he-carries-out-duties-from-hospital-13316810",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-pope_6833354.jpg?20250219081843",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 13:40:00",
        "Headline": "In its latest health bulletin, the Vatican said Francis approved decrees for five people for beatification and two new saints during Monday's audience, actions which are part of his normal routine.",
        "Content": " Pope Francis has met leading Vatican officials in hospital as he continues his recovery from pneumonia in both lungs. The pontiff, 88, who is receiving treatment at Rome's Gemelli hospital, met Cardinal Pietro Parolin and Archbishop Edgar Pena Parra, the so-called Vatican \"substitute\" or chief of staff. In its Tuesday lunchtime update on his condition, the Vatican said Francis, who was admitted earlier this month, approved decrees for five people for beatification and two new saints.  He also agreed to call a formal meeting to set the dates for their canonisation during the audience on Monday. Both the actions and the meeting are considered part of the normal papal routine. In a later bulletin, the Vatican announced that Francis had additionally named a handful of new bishops for Brazil, named a new archbishop for Vancouver, and modified the law for the Vatican City State to create a new hierarchy. The Pope \"slept well, all night\", the Vatican's earlier update said. On Monday evening, as thousands of people gathered in St Peter's Square to pray for him, doctors said that, while he remained in critical condition, he had shown a \"slight improvement\" in some tests, the most upbeat bulletin in days. Francis had resumed work from his hospital room, calling a parish in Gaza City that he has kept in touch with since the war there began, officials said. Doctors have said the condition of the Argentine pontiff, who had part of one lung removed as a young man, is touch-and-go, given his age, fragility, and pre-existing lung disease before the pneumonia set in. Francis has previously said he has written a letter of resignation, in case he becomes medically incapacitated. Honduran Cardinal Oscar Rodriguez Maradiaga told La Repubblica he had seen \"everything he [Francis] did for the church, with a great love of Jesus. Humanly speaking, I don't think it's time for him to go to paradise.\" Over the weekend, the pontiff suffered a \"prolonged respiratory crisis\" that required a high flow of oxygen, as well as an \"initial, mild\" kidney problem. Read more:Putin is the aggressor - MacronMystery illness kills 50Cocaine found under wig The Vatican also said he had blood transfusions after tests revealed thrombocytopenia, which is associated with anaemia. Doctors said on Friday that he was \"not out of danger\" and was expected to remain in hospital for at least another week."
    },
    {
        "title": "'Misunderstanding' in arrest of British couple in Afghanistan, Taliban says",
        "description": "The arrest of a British couple in Afghanistan was over a \"misunderstanding\", the Taliban has said.",
        "url": "https://news.sky.com/story/misunderstanding-in-arrest-of-british-couple-in-afghanistan-taliban-says-13316683",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-peter-reynolds-barbie-reynolds_6837937.jpg?20250223175304",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 11:19:00",
        "Headline": "Peter Reynolds, 79, and his wife Barbie, 75, were detained by the Taliban's interior ministry on 1 February.",
        "Content": "The arrest of a British couple in Afghanistan was over a \"misunderstanding\", the Taliban has said. Peter Reynolds, 79, and his wife Barbie, 75, were detained by the Taliban's interior ministry on 1 February. The reason for their arrests was immediately unknown. But the Taliban said on Tuesday that the couple were detained due to a \"misunderstanding\" that they had fake Afghan passports. The four adult children of the couple said last week that their parents were married in Kabul in 1970 and have lived in Afghanistan for 18 years - remaining after the withdrawal of Western troops and the Taliban's return to power in 2021. The couple runs an organisation named Rebuild, which provides education and training programmes for businesses, government agencies, educational organisations and nongovernmental groups. Mr and Mrs Reynolds, who are also Afghan citizens, allegedly texted their children after their arrests saying they did not want Western authorities to get involved. Read more from Sky News:NHS England chief to step downMystery illness kills more than 50 people In a letter to the Taliban, their children wrote: \"Our parents have consistently expressed their commitment to Afghanistan, stating that they would rather sacrifice their lives than become part of ransom negotiations or be traded. \"We trust that this is not your intention, as we are instructed to respect their wishes to remain with you.\" The Taliban have released no further details nor confirmed if the couple have now been released. On Monday, the BBC reported the Taliban as saying they would \"endeavour\" to release the couple \"as soon as possible\"."
    },
    {
        "title": "Chinese company that set deadline for single workers to get married responds to criticism",
        "description": "A company in China that introduced a policy threatening single employees with termination if they were not married by the end of September says it has withdrawn its notice.",
        "url": "https://news.sky.com/story/chinese-company-that-set-deadline-for-single-workers-to-get-married-responds-to-criticism-13316803",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-employee-worker-businessman_6839258.jpg?20250225132428",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-25 13:18:00",
        "Headline": "The notice warned single employees aged between 28 and 58 to \"resolve your personal marriage issues\" or \"the company will terminate your labour contract\".",
        "Content": "A company in China that introduced a policy threatening single employees with termination if they were not married by the end of September says it has withdrawn its notice. The Shuntian Chemical Group, based in eastern China's Shandong province, told its 1,200 employees last month that any unmarried workers aged between 28 and 58, including those who are divorced, were required to \"resolve your personal marriage issues\" by 30 September. \"If not completed by the first quarter, you must write a self-reflection,\" its announcement read, according to Sky News' US partner NBC News. \"If not completed by the second quarter, the company will conduct an evaluation. \"If you cannot get married and establish a family by the third quarter, the company will terminate your labour contract,\" it continued. \"Please take note.\" The notice also criticised single employees for \"not responding to the national call\" to marry and have children, accusing them of being \"disloyal and disobedient to parental advice.\" The announcement came amid the Chinese government's ongoing push to encourage younger generations to get married and have children in order to counter the country's declining birth rate. \n                  'Puppy mountain' along Chinese river draws in tourists\n                 \n                  China holds live-fire exercises in Gulf of Tonkin days after Vietnam maps new territory\n                 \n                  Scientists find new virus that could infect humans in same way as COVID-19\n                 But the chemical group's notice received backlash on social media. Read more:'Puppy mountain' along Chinese river draws in touristsMan caught using unusual technique to smuggle cocaine Chinese media reported that officials from the local human resources and social security bureau visited the company on 13 February and pointed out that the policy violated Chinese labour law. The company withdrew it by the next day. Someone from the Shuntian Chemical Group, who did not provide their name, told NBC News: \"This announcement has been withdrawn because some of the words used were inappropriate.\" The latest government data shows the number of new marriages in China fell by a fifth last year - the biggest drop on record - while the population fell in 2024 for the third consecutive year, to 1.408 billion."
    },
    {
        "title": "Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv",
        "description": "Ukraine has agreed terms with the United States on a crucial minerals deal, a Ukrainian government source has told Sky News.",
        "url": "https://news.sky.com/story/ukraine-agrees-terms-with-us-on-minerals-deal-with-no-security-guarantee-for-kyiv-13317021",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-volodymyr_6835229.jpg?20250221052112",
        "type": "US",
        "Author": "Azad Safarov, Ukraine producer",
        "Date Published": "2025-02-25 20:26:00",
        "Headline": "A Ukrainian government source has said there is a plan for the accord to be signed by both sides \"very soon\".",
        "Content": "By Azad Safarov, Ukraine producer  Ukraine has agreed terms with the United States on a crucial minerals deal, a Ukrainian government source has told Sky News. There has been no confirmation from the US side yet but Donald Trump said on Monday evening that his Ukrainian counterpart \"would like to sign the minerals deal with me\". The accord, once signed, could unlock a new long-term partnership between Kyiv and Mr Trump's White House after weeks of increasingly tense exchanges. The source said there was a plan for the document to be signed \"very soon\". This could even be during a face-to-face meeting between Ukrainian President Volodymyr Zelenskyy and Mr Trump. The US president told reporters on Tuesday evening that his Ukrainian counterpart is \"coming to visit on Friday\". He added: \"We have pretty much negotiated our deal on rare earths.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Campbell Scott: Body of missing British businessman 'found in sack of pineapples' in Kenya\n                 A Ukrainian government source has also said Mr Zelenskyy will meet with Mr Trump in Washington on Friday and that the meeting was proposed by the American side. Meanwhile, Ukrainian officials have said Kyiv has agreed a framework for an economic deal with the US which will see them trade rights to rare minerals in exchange for continued aid. The deal sets out the terms to create a new fund to invest in Ukraine's minerals, rare earth materials and other valuable natural resources. It no longer contains an initial demand by the United States for a right to $500bn (£394bn) in potential revenue from the resources. Mr Zelenskyy had previously described such a high price as not being a \"serious\" conversation. Mr Trump, however, views the minerals transaction with Ukraine as a fair way to recoup the billions of dollars that the US has given Kyiv - via weapons and financial support - to assist the armed forces in their fight against Russia's full-scale invasion over the past three years. The document also does not provide a commitment from Washington to give security guarantees to Ukraine in the wake of any ceasefire deal with Vladimir Putin - something that Kyiv desperately needs and has been asking for. More granular details about the new partnership are expected to be fleshed out in coming discussions. Read more:Pay back the billions of aid, Trump tells UkraineWhat minerals does Ukraine have and why does Trump want them? 👉 Listen to Sky News Daily on your podcast app 👈 The two sides have \"agreed on a framework agreement on how to create a fund that will be filled with a share of minerals\" and other natural resources, the government source said, speaking on condition of anonymity. \"This is a political step to ensure that resource revenues are used for the security and reconstruction of Ukraine.\" The fund would comprise US money that would be invested in Ukrainian natural resources, with profits shared between Washington and Kyiv, it is understood. The Financial Times first reported on the agreement being reached. It said the final version of the deal was dated 24 February. \"The minerals agreement is only part of the picture. We have heard multiple times from the US administration that it's part of a bigger picture,\" Olha Stefanishyna, Ukraine's deputy prime minister and justice minister who has led the negotiations, told the newspaper on Tuesday. The development comes after Mr Trump shocked European leaders last week by calling Mr Zelenskyy a \"dictator with no elections\". He added that the Ukrainian president \"better move fast or he is not going to have a country left\" after Mr Zelenskyy had accused him of living in a Russian-made \"disinformation space\".  French President Emmanuel Macron flew to Washington to meet with Mr Trump on Monday for talks on Ukraine amid fragile relations between the US and Europe. Meeting in the White House on the third anniversary of Russia's war in Ukraine, the French president said he and Mr Trump \"made substantive steps forward during our discussions\". It comes as UK Prime Minister Sir Keir Starmer prepares to meet with Mr Trump at the White House on Thursday. Mr Starmer and Mr Macron spoke on the phone on Tuesday and \"agreed that President Trump's leadership in working towards a durable peace in Ukraine was welcome\", a Downing Street spokesperson continued."
    },
    {
        "title": "What minerals does Ukraine have – and why does Donald Trump want them?",
        "description": "Donald Trump is ramping up pressure on his Ukrainian counterpart to sign away up to 50% of its mineral supplies.",
        "url": "https://news.sky.com/story/what-minerals-does-ukraine-have-8211-and-why-does-donald-trump-want-them-13316629",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-graphic-ukraine-minerals_6839269.jpg?20250225135031",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-25 14:26:00",
        "Headline": "Before Russia's invasion in February 2022, minerals made up 6.1% of Ukraine's GDP (gross domestic product) and 30% of its exports - but the current situation is unclear amid the war with Russia.",
        "Content": "Donald Trump is ramping up pressure on his Ukrainian counterpart to sign away up to 50% of its mineral supplies. Amid concerns Mr Trump would withdraw aid if elected, during a meeting at Trump Tower in September, Ukrainian President Volodymyr Zelenskyy reportedly proposed a US stake in Ukrainian minerals in exchange for more weapons. But since Mr Trump's return to the White House, US-Ukrainian relations have become increasingly strained, with him branding Mr Zelenskyy a \"dictator\" and excluding Ukraine from negotiations with Russia. Moscow contradicts Trump over peacekeepers; Ukraine latest A Ukrainian source told Sky News that Mr Zelenskyy is \"not ready\" to sign the US agreement due to a \"number of problematic issues\", with a leaked draft claiming to ask for 50%. French President Emmanuel Macron has lent his support to the idea. Here we look at Ukraine's mineral supply - and why the US wants access to it. Which minerals does Ukraine have? Before Russia's invasion in February 2022, minerals made up 6.1% of Ukraine's GDP (gross domestic product) and 30% of its exports. It is home to various 'critical' minerals, so called for their use in technology manufacturing, defence systems, and green energy, with examples including copper, nickel, lithium, and titanium. According to the European Commission, in 2019 Ukraine supplied 7% of global titanium, which is used for building nuclear power plants and planes. Similarly, it is believed to have more lithium (used to make batteries) than any other European country - a suspected 500,000 tonnes. Before Russia's invasion, it was also responsible for a fifth of global graphite, which is a key material for nuclear power stations and electric vehicle batteries. Other raw materials in good supply include coal, iron ore, and manganese. Read moreFact-checking Trump on ZelenskyyHow China is using its minerals as leverage Pre-war figures are the most reliable, as up to 40% of Ukrainian metallic minerals are now in areas occupied by Russia - namely the Donbas and neighbouring eastern regions. For example, two of Ukraine's lithium deposits are under Russian control - Zaporizhzhia and Donetsk. Rare earth elements Rare earth elements (REE) are a group of 17 exotic minerals used to make everything from smartphones and electronic devices, to electric vehicles, wind turbines, and weapons systems. Examples include europium, a material for control rods at nuclear power plants, and gadolinium, used to make the magnets inside mobile phones - as well as holmium, ytterbium, and dysprosium. They are not strictly rare - but their extraction and storage are highly energy-intensive. With the details of war-torn Ukraine's mineral supplies uncertain - it is not clear which REEs are present there and how much there are of them. But in a pre-war assessment of 109 critical mineral deposits across the country by the Kyiv School of Economics, three were reported to contain REEs. Ukrainian mineral data, seen by Reuters, has also cited cerium, neodymium, erbium, yttrium, and lanthanum. Why does Trump want them?  Donald Trump has not been clear about which minerals he wants from Ukraine. And as Sky's economics and data editor Ed Conway says, there are far greater supplies of lithium, graphite, and titanium elsewhere, including in the US. But what is far more certain is the role China has to play in Mr Trump's demands. As the biggest manufacturer in the world, China processes more REEs than any other country - with its deposits representing between 50% and 75% of global supply, according to estimates. As a result, both the US and Europe are trying to reduce their dependency on Beijing. In December as Mr Trump prepared to return to office, China banned the export of some REEs to the US. Under Joe Biden's administration, it had already restricted its US mineral exports. In response on 1 February, the Trump administration announced 10% tariffs on all Chinese imports.  Beyond the trade war with China, REEs and critical minerals are fundamental to the global green energy transition. According to the World Meteorological Organisation, to meet net-zero targets by 2030, we will need three times as much copper, lithium, nickel, and cobalt. This will mean a further 50 lithium, 60 nickel, and 17 cobalt mines globally."
    },
    {
        "title": "Large bruise on Trump's hand prompts speculation over health - but White House blames 'shaking hands'",
        "description": "A large bruise that appeared on Donald Trump's hand is down to him shaking a lot of hands, the White House has said.",
        "url": "https://news.sky.com/story/bruise-on-trumps-hand-prompts-speculation-over-health-but-white-house-blames-shaking-hands-13316982",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bruise-hand-donald-trump_6839636.jpg?20250225203105",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-25 19:16:00",
        "Headline": "Donald Trump's right hand appeared to be bruised when he was pictured on Monday during a meeting with French President Emmanuel Macron. The US leader, who started his second stint in the White House last month, is yet to release his full medical report.",
        "Content": "A large bruise that appeared on Donald Trump's hand is down to him shaking a lot of hands, the White House has said. Mr Trump's right hand seemed bruised during the 78-year-old's meeting with French President Emmanuel Macron on Monday, prompting speculation on social media over his health. Redness or bruising on the US leader's right hand were also spotted in August and November last year, Sky News' US partner network NBC reported.  White House press secretary Karoline Leavitt has claimed the bruising is a result of hand shaking. \"President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other president in history. \"His commitment is unwavering and he proves that every single day,\" Ms Leavitt said. \"President Trump has bruises on his hand because he's constantly working and shaking hands all day every day,\" she said in a follow-up statement. \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 \n                  Badenoch says US is acting in its national interest - and UK must do the same\n                 \n                  Day 37: Does the Macron-Trump bromance bring us closer to peace?   \n                 Read more from Sky News:Trump's optimism meets Macron's caution 👉 Follow Trump 100 on your podcast app 👈 People speculated about potential causes for the bruising on social media. On X, one person suggested Mr Trump was on blood thinners, while another said: \"Maybe, but elderly people bruise more easily than younger folks. Trump is 78. He could have gotten that in any number of ways.\" One user didn't seem to believe the White House's explanation. \"Why even lie? It's obviously an IV bruise for blood testing or something. Is it a surprise to people that Trump is old and gets regular physician visits?\" they said. In a December interview with NBC News' Meet the Press, Mr Trump said he would release his full medical report, but he has yet to do so."
    },
    {
        "title": "Woman admits trying to defraud Elvis Presley's family by auctioning off Graceland",
        "description": "A woman has admitted attempting to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale.",
        "url": "https://news.sky.com/story/woman-admits-trying-to-defraud-elvis-presleys-family-by-auctioning-off-graceland-13317185",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-graceland-memphis-tennessee_6561472.jpg?20240521071042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-25 23:07:00",
        "Headline": "Lisa Jeanine Findley, of Kimberling City, Missouri, falsely claimed Presley's daughter Lisa Marie had borrowed $3.8m from a bogus private lender and had pledged Graceland as collateral for the loan, prosecutors said.",
        "Content": "A woman has admitted attempting to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale. Lisa Jeanine Findley had initially denied charges of mail fraud and aggravated identity theft in relation to the scheme but has now changed her plea in the two-count indictment. Prosecutors had said Findley, of Kimberling City, Missouri, falsely claimed Presley's daughter Lisa Marie had borrowed $3.8m (£3m) from a bogus private lender and had pledged Graceland as collateral for the loan before her death in January 2023. Findley then threatened to sell Graceland to the highest bidder if Presley's family did not pay a $2.85m (£2.25m) settlement, according to authorities. She posed as three different people allegedly involved with the fake lender, fabricated loan documents and published a fraudulent foreclosure notice in a Memphis newspaper announcing the auction of Graceland in May 2024, prosecutors said. A judge stopped the sale after Presley's granddaughter and Lisa Marie's daughter, actress Riley Keough, sued. Experts were baffled by the attempt to sell off one of the most famous pieces of property in the country using names, emails and documents that were quickly suspected to be fake. \n                  Woman charged over alleged scheme to fraudulently sell Elvis Presley's former home Graceland\n                 \n                  Elvis Presley's blue suede shoes expected to fetch up to £120,000 at auction\n                 \n                  Mark James: Suspicious Minds and Hooked On A Feeling songwriter dies\n                 Graceland opened as a museum and tourist attraction in 1982 and draws hundreds of thousands of visitors each year. A large Presley-themed entertainment complex across the street from the museum is owned by Elvis Presley Enterprises. Presley, known as the King of Rock and Roll, died in August 1977 at the age of 42 Keough, who inherited the trust and ownership of the home after the death of her mother, filed a lawsuit claiming fraud against Findley and a judge halted the proposed auction with an injunction. Naussany Investments and Private Lending - the bogus lender authorities say Findley created - said Lisa Marie Presley had used Graceland as collateral for the loan, according to the foreclosure sale notice. The judge said Elvis Presley's estate could be successful in arguing that a company's attempt to auction Graceland was fraudulent. Read more from Sky News:Businessman's body found in 'sack of pineapples'Large bruise on Trump's hand prompts speculation over healthCouple 'forced' to sit next to dead woman on flight Ms Keough's lawsuit alleged that Naussany presented fraudulent documents regarding the loan in September 2023 and that Ms Presley never borrowed money from Naussany. After the scheme fell apart, Findley tried to make it look like the person responsible was a Nigerian identity thief, prosecutors said. An email sent on 25 May 2024 to the Associated Press from the same email as the earlier statement said in Spanish that the foreclosure sale attempt was made by a Nigerian fraud ring that targets old and dead people in the US and uses the internet to steal money. In a statement, Tennessee Attorney General Jonathan Skrmetti called the scheme \"nonsense\" and praised the work of federal authorities. \"Graceland matters so much to so many people around the world - just go to Memphis during Elvis Week and listen to all the different accents and languages of fans who make the pilgrimage,\" Mr Skrmetti said. \"All of Tennessee is glad that Graceland remains safely in the possession of Elvis's heir and that it will remain a celebrated Memphis landmark for generations to come.\" Findley will be sentenced on 18 June and would have faced up to 20 years if convicted, but she is expected to receive less than that under the plea deal."
    },
    {
        "title": "Remains of British man who vanished more than two years ago found in Georgia woods",
        "description": "The remains of a British man who went missing on a trip to Florida nearly two-and-a-half years ago have been found, the FBI has said.",
        "url": "https://news.sky.com/story/remains-of-british-man-who-vanished-more-than-two-years-ago-found-in-georgia-woods-13316587",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-alex-hodgson-doughty_6838973.jpg?20250225075122",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-25 07:30:00",
        "Headline": "Alex Hodgson Doughty had been visiting Jacksonville, Florida in September 2022 when he went missing. ",
        "Content": "The remains of a British man who went missing on a trip to Florida nearly two-and-a-half years ago have been found, the FBI has said. Alex Hodgson Doughty was on holiday in Jacksonville in September 2022 when he was reported missing by his mother after she was unable to contact him. His remains were found 35 miles north of there in a wooded area on private land near Kingsland, Georgia, the FBI said on Friday. Overseas missing persons charity LBT Global said on a web page dedicated to Mr Doughty that he was last seen on 11 September 2022. He was at a Jacksonville bar and grill at around 3.30pm and then got into a taxi which dropped him off in Kingsland around an hour later. A Facebook page, Help Find Alex, said he continued to make video calls and send text messages up until 6.51pm when his phone went offline. Federal, state, local, and international agencies were involved in the investigation and search for Mr Doughty, who was 30 when he went missing. His remains were found on 4 February, the FBI said, adding a medical examiner had confirmed Mr Doughty's identity. Read more from Sky News:Missing British businessman found dead in KenyaAgent who leapt onto JFK's limo after assassination dies \"While we had hoped to bring Mr Doughty's family better news, we are thankful to be able to provide them with some closure,\" said special agent Kristin Rehler. \"This discovery is the direct result of our partnerships and special agents from FBI Jacksonville's Cellular Analysis Survey Team (CAST), who were relentless in their efforts to narrow down potential search locations.\" No criminal charges are expected, the FBI said."
    },
    {
        "title": "Energy bills for typical household to rise to £1,849 a year from April",
        "description": "The average annual energy bill will increase to &#163;1,849 from April as the industry regulator Ofgem increases the price cap for the third time in a row. ",
        "url": "https://news.sky.com/story/energy-bills-for-typical-household-to-rise-to-1631849-a-year-from-april-13316130",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-cost-of-living-energy-price-cap_6789796.png?20250102121246",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire and James Sillars, business and economics reporters",
        "Date Published": "2025-02-25 07:05:00",
        "Headline": "Annual bills will now be nearly £160 more expensive than a year ago but an extra four million people have signed up for a fixed tariff since November and are unaffected. ",
        "Content": "By Sarah Taaffe-Maguire and James Sillars, business and economics reporters    The average annual energy bill will increase to £1,849 from April as the industry regulator Ofgem increases the price cap for the third time in a row.  When compared to prices over the last three months, the new figure represents a 6.4% a year - or £9.25 per month - increase in the typical sum the vast majority of households face paying for gas and electricity when using direct debit. It also means typical bills will be £159 more expensive than last year's. It's the first time the April cap has risen above the January cap since quarterly updates began in 2022. Only those on fixed-rate deals - around eleven million homes - will see no change until their current term expires. An extra four million homes fixed the cost of energy units since November, Ofgem said. The price cap limits the amount suppliers can charge per unit of energy and is revised every three months. Energy debts have reached a record high, Ofgem also said. Why are prices going up? Ofgem's energy price cap decision comes as a consequence of rising wholesale gas prices since the start of the year. Europe has seen a price spike due to strong demand in recent months, driven by colder weather compared to recent years. That, in turn, has sapped stockpiles and even prompted a warning last month from the owner of the UK's largest gas storage facility that levels were \"concerningly low\". The UK is heavily reliant on gas for its home heating and also uses a significant amount for electricity generation. It's this reliance that has caused the increased cost, the regulator said. Only a small portion of the increase came from inflation and policy costs. The government is investing heavily in more UK-based renewable energy, such as wind and solar farms, to ease the country's current reliance on gas imports, targeting 95% clean power across the electricity grid by 2030. When will prices fall? Market analysts anticipate natural gas costs will remain elevated in the coming months due to Europe's need to restock ahead of next winter. But the prospect of a settlement between Russia and Ukraine has brought prices down slightly. Bills are expected to fall in July. Trusted forecasters Cornwell Insight see a slight fall to £1,756 as likely, but they caution that the forecasts will be changed to reflect market volatility in the coming months. Widespread bill rises  Energy bills are just one of the cost increases consumers can expect in April. Council tax and water bills are to rise then. Some people may be in a better position to meet those costs as the minimum and living wages will rise then. For employers, their national insurance contributions also go up during the month."
    },
    {
        "title": "Lord's tenant Middlesex County Cricket Club eyes end to mutual ownership",
        "description": "The 161-year-old Middlesex County Cricket Club (MCCC) is kicking off a secret review of its mutual ownership status as it seeks to place the Lord's-based outfit on a sustainable long-term financial footing.",
        "url": "https://news.sky.com/story/lord8217s-tenant-middlesex-county-cricket-club-eyes-end-to-mutual-ownership-13316623",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-middlesex-henry-brookes_6839141.jpg?20250225113827",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-25 08:49:00",
        "Headline": "The MCCC has hired advisors from Oakvale to explore strategic options that will include eventually ceding the Lord's-based club's 161-year-old mutual ownership, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The 161-year-old Middlesex County Cricket Club (MCCC) is kicking off a secret review of its mutual ownership status as it seeks to place the Lord's-based outfit on a sustainable long-term financial footing. Sky News can exclusively reveal that Middlesex has drafted in Oakvale, a specialist sports and gaming corporate finance advisor, to explore a range of options, which insiders confirmed on Tuesday would include the longer-term possibility of a demutualisation and partial sale. Prospective investors are already understood to have begun being sounded out about the early-stage plans. Sources said there were no plans for the club to move away from or stop playing at Lord's, adding that demutualisation and ceding its member-owned status were not \"immediately\" on the agenda. Money blog: Unexpected rise to energy price cap  The review is the latest to involve one of English cricket's 18 professional counties and follows the recent sale of a controlling stake in Hampshire to the GMR Group, the owner of the Indian Premier League franchise the Delhi Capitals. News of Middlesex's review comes within weeks of the England and Wales Cricket Board (ECB) securing a landmark windfall of £520m to be injected into the professional and recreational game from the auction of its 49% stakes in the sport's eight Hundred tournament franchises. \n                  Cricket chiefs stage live 'super-over' shootout for Hundred stakes\n                 \n                  Silicon Valley execs in late bid to bowl over London Hundred cricket team\n                 \n                  Josh Baker: Parents 'broken' at death of 20-year-old Worcestershire County cricketer\n                 The most lucrative of those came from the sale of the Lord's-based London Spirit team, which was valued at £295m after being at the centre of a fierce bidding war eventually won by a group of American technology billionaires. These included the Indian-born chief executives of Google and Microsoft, with the consortium led by Nikesh Arora, the former SoftBank executive. Cricket insiders tipped the consortium to explore whether a bid to inject funding into the MCCC would also make sense. The Hundred auction will rank as a financially transformational moment for the sport, coming at a time when many of the professional counties - including Yorkshire - have been struggling to make ends meet. While the MCCC will benefit from an estimated windfall of more than £20m from the distribution of the ECB's proceeds from the Hundred sell-off, its financial position is comparatively weaker than other first-class counties. It pays rent to the Marylebone Cricket Club (MCC), the owner of Lord's, and unlike most counties does not own or have a direct financial interest in its home ground. This is said to have made exploiting its commercial assets more challenging. The MCCC was founded in February 1864 by a \"gathering of gentleman of Middlesex in the London Tavern\", according to the club's official history. Middlesex made its debut in June 1864 at the Cattle Market Ground in Islington and has been based at Lord's since 1877. It has won the County Championship 13 times and counts English cricket legends including Denis Compton, Mike Gatting and Andrew Strauss among its former players. This summer, the New Zealand batsman Kane Williamson will play for Middlesex in the Vitality Blast and Rothesay County Championship. Currently owned by its roughly 7,000 members, its status as a mutual means it is regulated by the Financial Conduct Authority. According to people close to the process, at least 50% of the MCCC's members would need to vote in a ballot for it to be legitimate, which one described as challenging because many of the club's members acquire membership solely in order to secure tickets for Test matches played at Lord's. Even if a future vote were to be valid, 75% of those casting their ballots would need to vote in favour of ending its mutually owned status. To date, only three professional counties have demutualised, with two of those - Hampshire and Northamptonshire - doing so to avoid collapse, with the other, Durham, going bust. One source described the MCCC as one of the biggest brands in global cricket and said the strategic review was aimed at ensuring the club would be competitive in all forms of the game, as well as financially sustainable, over the next 50 years. According to one prospective investor, Oakvale's analysis is expected to focus on protecting the MCCC's heritage, as well as the interests of members and Middlesex's fan base. A spokesman for the MCCC declined to comment on Tuesday."
    },
    {
        "title": "Environment Secretary Steve Reed receives hostile reception from farmers - despite series of policy sweeteners",
        "description": "The environment secretary's speech to the National Farmers' Union (NFU) conference was interrupted by protesters who remain angry over the decision to impose inheritance tax on farms.",
        "url": "https://news.sky.com/story/environment-secretary-steve-reed-receives-hostile-reception-from-farmers-despite-series-of-policy-sweeteners-13316432",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-steve-reed-nfu_6839143.jpg?20250225114205",
        "type": "Business",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-02-25 00:01:00",
        "Headline": "A series of policy announcements designed to ease tension with farmers was overshadowed by the ongoing anger over the government's changes to inheritance tax policy. ",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  The environment secretary's speech to the National Farmers' Union (NFU) conference was interrupted by protesters who remain angry over the decision to impose inheritance tax on farms. Steve Reed unveiled a series of policy sweeteners designed to ease tension with the farming community over the policy, but was met with muted applause and a hostile audience. Shortly after beginning his speech, Mr Reed was confronted by protesters holding banners that were thought to be about the government's plan to force farmers to pay 20% inheritance tax on farms worth more than £1m from April 2026, when they were previously exempt. Politics latest: Badenoch says UK should 'review' foreign policy strategy Mr Reed said he understood \"the strength of feeling in the room\" but could not \"give the answer\" the audience wanted on inheritance - which is that the government should scrap the policy. \"I'm sorry, it's a decision that we have had to take,\" he said. Among the raft of measures unveiled by Mr Reed was a long-called-for extension of the seasonal worker visa programme by five years to boost profits for farmers. \n                  Starmer says decision to increase defence spending was 'accelerated' by Trump taking office\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 He also announced £30m to increase payment rates in higher-level stewardship schemes, new requirements for government catering contracts to back British produce and a multimillion-pound investment in technology strengthening controls on animal disease and protecting farmers in trade deals. 'You must correct this urgently' But the announcements were overshadowed by palpable anger at the inheritance tax policy, which NFU President Tom Bradshaw branded \"cruel\" and \"morally wrong\". He said older farmers \"are now facing that very real dilemma that unless they die before April 2026, their families will face a family farm tax they simply cannot afford to pay\". \"What a cruel position to put elderly people in by no way of warning, by way of a broken promise,\" he added. \"Government, you must correct this urgently.\" Those in favour of the change say it will significantly reduce the use of agricultural property for large-scale tax avoidance, ensure a closer relationship between the agricultural and market values of land, and create a greater diversity of land ownership. But the move has been condemned by farmers who have staged a series of protests in Westminster over the policy, which they fear will put small farms out of business. After his speech to the NFU conference, the environment secretary was heckled and repeatedly challenged in a question-and-answer session over farmers who questioned whether the best tax planning would be to die before the inheritance tax changes came into effect, \"I'm really sorry about the individual circumstances, but it's very difficult for the secretary of state to comment on individual circumstances,\" he said. He pointed to the financial \"black hole\" the government inherited from the previous Conservative government and highlighted the need to stabilise the economy.  \"I've explained to you why we had to take a decision that I know has been very, very difficult, but we will focus on making farms more profitable, because that seems to me, the problem at the heart of the crisis in the sector,\" he said. Extending the seasonal workers' visa programme was welcomed by the NFU for providing \"much-needed certainty\" for farmers. A shortfall in the number of season worker visas granted by the Home Office since the UK left the European Union has been blamed for leaving tonnes of food unpicked, costing the agriculture industry millions. Mr Bradshaw said the extension had been a \"key ask of ours for many years, and its introduction will help safeguard the future of UK food production\". Read more:Ex-Reform UK leader in Wales in court Boris Johnson hits out at Trump over Zelenskyy To the sound of farmers sounding their tractor horns outside the conference venue in London, Mr Reed also outlined plans for a 25-year farming roadmap and food strategy, which will prioritise food production and make farm businesses more resilient to shocks such as severe flooding, drought and animal disease. He told the conference: \"I will consider my time as the secretary of state a failure if I do not improve profitability for farmers up and down this country.\" He added: \"Ours is an outward-facing trading nation, but I want to be clear that we will never lower our food standards in trade agreements.\""
    },
    {
        "title": "UK energy bills highest in Europe and public patience is wearing thin",
        "description": "The possibility of a peace deal between Russia and Ukraine has caused wholesale energy bills to fall in recent weeks but household bills will still be going up from April.",
        "url": "https://news.sky.com/story/uk-energy-bills-highest-in-europe-and-public-patience-is-wearing-thin-13316611",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-manchester-united-kingdom_6680241.jpg?20240909111626",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-02-25 08:31:00",
        "Headline": "Labour promised it would save households £300 by 2030 but bills are still higher than before the war in Ukraine began. ",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n The possibility of a peace deal between Russia and Ukraine has caused wholesale energy bills to fall in recent weeks but household bills will still be going up from April. Consumers will be paying for the winter months. Europe endured a cold and still winter, meaning demand for energy increased while countries were less able to rely on wind power, so they had to draw down more heavily on their gas reserves. European gas prices subsequently rose, hitting a two-year high of just over €58 (£48) per megawatt/hour earlier this month. That spike has fed into the latest price cap, which Ofgem sets quarterly. Money blog: How to beat the energy price cap by £180 The recent drop in the wholesale price could lead to lower prices come the summer. \n                  How to beat energy price rise by almost £180\n                 \n                  Energy bills for typical household to rise to £1,849 a year from April\n                 \n                  Gas prices at a two-year high, putting pressure on already expensive energy bills\n                 However, the latest increase - the third in a row - underscores just how vulnerable Britain is to volatility in the global energy markets and, in turn, how the government's political ambitions are being held hostage by factors outside of its control. Labour promised it would save households £300 by 2030. Yet, bills are still higher than they were before the war in Ukraine began in 2022 - when bills averaged £1,100 a year - and the consequences of this are rippling through the economy. Inflation impacts Most clearly, high energy prices push up prices. That's because energy is used in the production of goods and services, whether that's running ovens in restaurants or powering factories. Industrial electricity prices are already among the highest in the developing world. The Bank of England expects inflation to hit 3.7% later this year because of rising gas prices, taking it further above the 2% target before it comes back down again. That has ramifications for our living standards. The government says it wants to tackle this by investing in green energy at home. Ed Miliband, the energy secretary, said today: \"The way to deliver energy security and bring down bills for good is to deliver our mission to make Britain a clean energy superpower - with homegrown clean power that we in Britain control.\" The hope is this will lead to lower energy bills. However, the plan requires time, money and reform before it pays dividends. In the meantime, the UK's domestic energy bills are the highest in Europe and the public's patience is wearing thin."
    },
    {
        "title": "Starmer says decision to increase defence spending was 'accelerated' by Trump taking office",
        "description": "Sir Keir Starmer has admitted his decision to increase defence spending was \"accelerated\" by Donald Trump taking office. ",
        "url": "https://news.sky.com/story/starmer-says-decision-to-increase-defence-spending-was-accelerated-by-trump-taking-office-13316922",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keir-starmer-beth-rigby_6839489.jpg?20250225173646",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-25 17:41:00",
        "Headline": "At a press conference following the funding announcement, Sir Keir was repeatedly challenged on whether the new US president was effectively setting UK government policy  - given he has long called for European countries to boost defence spending. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Sir Keir Starmer has admitted his decision to increase defence spending was \"accelerated\" by Donald Trump taking office.  The prime minister said today's announcement was \"three years in the making\" after Russia invaded Ukraine - but a \"very changed context\" pushed him forward. Politics Live: PM warns 'everything has changed' after announcing defence spending boost In a surprise Commons statement on Tuesday morning, Sir Keir said defence spending will increase to 2.5% of GDP by 2027, funded by a cut in the foreign aid budget. While this honours a Labour manifesto commitment, ministers have previously been tight-lipped about when the new target would be reached - with today's decision coming ahead of a meeting between Sir Keir and Mr Trump in Washington on Thursday. Asked by Sky News political editor Beth Rigby if Mr Trump had \"bounced\" him into setting out a timeline, given he has long called for European countries to boost defence spending, the prime minister said: \"I think in our heart of hearts, we've all known that this decision has been coming for three years, since the beginning of the conflict in Ukraine. \"The last few weeks have accelerated my thinking on when we needed to make this announcement.\" Analysis: Starmer has put Britain on a war footing ahead of key Trump meeting However, he denied Mr Trump was effectively setting UK government policy, saying the defence spending increase is \"very much my decision\" and he has been \"arguing for some time\" that Europe and the UK \"needed to do more\". He said talks of \"possible peace\" and what that would mean for Europe's security - with the potential for UK peacekeeping troops to be put on the ground - \"has brought our response into sharp focus\". \"I have pushed our system to move this date forward because I think it's vital that we take the decision now, that we rise to the occasion and we show the leadership that's needed across Europe, in response to a very changed context,\" he said. The UK currently spends 2.3% of GDP on defence, with the jump to 2.5% meaning £13.4bn more will be spent annually on defence from 2027. Sir Keir said he wants that figure to reach 3% of gross domestic product during the next parliament, but that would depend on Labour winning the next election. Farage 'fawning over Putin' Asked if he is \"Nigel Farage is disguise\", given the Reform UK leader has previously vowed to increase defence spending but cut the foreign aid budget, Sir Keir said: \"Nigel Farage didn't even turn up to the debate in parliament today. Nigel Farage is fawning over Putin. That's not patriotism. \"What I've done is take the duty of the prime minister seriously, which is to ensure that our citizens are safe and secure.\" Mr Farage has previously faced criticism for saying the West provoked Russia's invasion of Ukraine with NATO and the EU's expansions, and for saying he admired Vladimir Putin as a statesman. Sir Keir's announcement comes as Europe reels from a shift in US foreign policy, with the White House making clear it is no longer prepared to bankroll the defence of other NATO members. Last week also saw an exchange of words between Mr Trump and Ukrainian President Volodymyr Zelenskyy, after officials from Washington and Moscow held peace talks without anyone from Kyiv or Europe present.  'Desertion of leadership' Sir Keir announced the government would cut back on foreign aid to fund the increase, reducing current spending from 0.5% of GDP to 0.3% - in a move that has angered some charities. Conservative leader Kemi Badenoch welcomed the measure and said she had written to the prime minister over the weekend to suggest how he could redirect money from the overseas development budget. But former Tory defence secretary Ben Wallace said an extra 0.2% was \"a staggering desertion of leadership\". \"Tone deaf to dangers of the world and demands of the United States,\" he wrote on X. \"Such a weak commitment to our security and nation puts us all at risk.\""
    },
    {
        "title": "Landmark moment as the return of Trump stuns UK into action on defence",
        "description": "This is the moment the government finally woke up to the enormity of the threat faced by the UK and the inability of its hollowed-out armed forces to cope. ",
        "url": "https://news.sky.com/story/landmark-moment-as-the-return-of-trump-stuns-uk-into-action-on-defence-13316819",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-keir-starmer-estonia_6400295.jpg?20231221082423",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-25 14:03:00",
        "Headline": "The decision to increase military spending to 2.5% of GDP by 2027 has been sparked by a fundamental change in the UK's ability to rely on its strongest ally, the United States.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  This is the moment the government finally woke up to the enormity of the threat faced by the UK and the inability of its hollowed-out armed forces to cope.  But make no mistake, today's decision to increase military spending is not just about increasing the number of troops, warships and fighter jets or even ensuring they can use the latest drones, satellites or artificial intelligence breakthroughs. This is an emergency that requires the entire nation to take responsibility for - or at least an interest in - the defence of the nation and the importance of being able to deter threats. Politics latest: PM makes defence commitment Sir Keir Starmer signalled this fundamental shift in priorities when he told parliament: \"We must change our national security posture because a generational challenge requires a generational response that will demand some extremely difficult and painful choices.\" He continued: \"And through those choices, as hard as they are, we must also seek unity. A whole society effort that will reach into the lives, the industries, and the homes of the British people.\" Such a proposal is not something new. The UK has a long history of being prepared for war. The entirety of the Cold War era was framed around ensuring the UK had enough troops and reservists to fight a sustained conflict, supported by a vast industrial base to produce weapons and a society that was intrinsically resilient, with the ability to sustain itself with emergency food rations, power supplies and an understanding of the need to be prepared to respond in an emergency. Back then, the threat was war - maybe even nuclear annihilation - with the Soviet Union. Today the threat is just as stark but also far more complex. Russia is the immediate danger. But China poses a long-term challenge, while Iran and North Korea are also menacing adversaries. Most fundamentally though is the change in the UK's ability to rely squarely on its strongest ally, the United States. Donald Trump, with his resentment of shouldering the responsibility for European security, has made clear the rest of the transatlantic NATO alliance must take much more of the share of defending themselves.  He has also signalled that he may not even be willing to deploy America's powerful military to defend every single member state - singling out those who pay far too little on their defences. He has a point when it comes to Europe freeloading on the might of the United States for too long. But the suggestion that European allies can no longer automatically rely on their American partner to come to their aid is enough to call into question the value of Article 5 of the NATO Alliance, which states an attack on one is an attack on all. When it comes to deterring foes, there must be no such uncertainty between friends. Read more from Sky News:Why Trump wants Ukraine's mineralsPutin hints at potential deals with USSanctions have changed European imports It is why countries across Europe are being urged by the new head of NATO to rapidly ramp up defence spending and adopt what NATO Secretary General Mark Rutte has called a \"war mindset\". The UK, who along with France are the only two NATO powers in Europe to possess nuclear weapons, has a bigger responsibility than most to heed that call. Russia's invasion of Crimea in 2014 was not a sufficient enough alarm bell. Even Russian President Vladimir Putin's full-scale war in Ukraine in 2022 failed to shake the UK and most of the rest of Europe from their slumber. Instead, it seems the return of Donald Trump to the White House, with all the unpredictability that he brings, is the final shock that has stunned the UK into action. Of course, defence insiders know that increasing spending to 2.5% of GDP by 2027 is not soon enough. But this - coupled with Sir Keir's language about the need for a \"generational response\" - is a landmark moment. The beginning of the correction of a strategic mistake made by Labour and Conservative governments over years to take a \"holiday from history\" and fail to find credible, capable armed forces and ensure society understands the importance of defence and the ability to deter."
    },
    {
        "title": "Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?",
        "description": "Big announcement. Big spending. Big numbers. That's what the prime minister wants you to know.&#160;",
        "url": "https://news.sky.com/story/starmer-wants-defence-spending-announcement-to-impress-trump-but-do-the-numbers-stack-up-13316988",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-donald-trump-keir-starmer_6779780.png?20250202145248",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-02-25 19:27:00",
        "Headline": "So much of the spending side of this announcement actually remains a mystery, writes Sam Coates...",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  Big announcement. Big spending. Big numbers. That's what the prime minister wants you to know.  But do the numbers stack up? £59.8bn is the Ministry of Defence budget in the coming year. £59.8bn. It's the lion's share of military spending - which makes up 2.3% of our GDP. And £13.4bn is how much more Sir Keir Starmer says it will cost to increase defence spending to the government's new target of 2.5% of GDP.  Now that's an enormous amount of public spending. Sums designed to impress Donald Trump. And it would require big big cuts elsewhere to achieve.  If that is the scale of the increase. Starmer has offered up one big cut to pay for it. Slashing the aid budget… Currently, it's due to be £13.7bn - 0.5% of national income. Starmer today said this would drop to 0.3% of national income. But here's the thing. That saves just short of £6bn. That leaves a big, big shortfall. So what does the government say about this gap? Well quietly, the government effectively admit to some creative accounting in their use of the £13.4bn figure. This £7.9bn apparent shortfall is the gap between what we pay now for defence today, and what it would have risen to anyway in 2027 because defence spending was pegged at 2.3% of GDP. Now I wouldn't ordinarily call that section an increase in spending, but it gets Keir Starmer that more impressive-sounding figure to brandish in front of Donald Trump. Now Labour promised to raise international development in the manifesto, not cut it. Here's why they've done it anyway - exclusive YouGov polling which shows the public backs it by a margin of more than two to one, with 62% saying they support a cut to aid to fund defence and just 25% opposing.  Labour voters like it much less - 48% for, 38% against - but look at this - among voters who backed Reform last year, it's a belter, with 93% in favour and 4% against. But so much of the spending side of this actually remains a mystery. For instance, Starmer said today that some intelligence and security spending would count towards the 2.5% NATO target from 2027. And the government won't answer whether future payments for the Chagos islands might be part of it too. Do these truly qualify as military spending? Read More:Landmark moment asTrump return stuns UK into actionPM puts Britain on war footing ahead of key Trump meeting If we're being honest, once you start to prod, lots of bits of defence spending turn out to be pretty secret. Government departments won't actually give me a cash figure for how much the defence spending amounts to, once everything is included. I asked for a complete list of what does and doesn't count towards our NATO 2.5% target - and the government refused to say. Keir Starmer wants distractions from the big picture. He wants Donald Trump to understand we're paying a lot more. Let's hope it does the trick in the White House later this week."
    },
    {
        "title": "Badenoch says US is acting in its national interest - and UK must do the same",
        "description": "Kemi Badenoch has said the US is acting in its national interest and the UK also needs to, ahead of Sir Keir Starmer's meeting with Donald Trump.",
        "url": "https://news.sky.com/story/badenoch-says-us-is-acting-in-its-national-interest-and-uk-must-do-the-same-13316700",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kemi-badenoch-foreign-policy_6839093.jpg?20250225104522",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-25 11:44:00",
        "Headline": "Ahead of Starmer's meeting with Trump, the Conservative leader said the UK doesn't have to agree with the US on everything - but needs to be \"realistic\". ",
        "Content": "\n          Political reporter\n              @alixculbertson\n  Kemi Badenoch has said the US is acting in its national interest and the UK also needs to, ahead of Sir Keir Starmer's meeting with Donald Trump. The Conservative leader, giving a foreign policy speech in London on Tuesday, told Sky News' political editor Beth Rigby the US is \"not an authoritarian regime\" and shares the same Western values as the UK, including free trade, free enterprise and free speech. On Monday, the US sided with Russia on two UN resolutions when they declined to condemn Russia's war in Ukraine, and backed a resolution for the conflict's end that avoided labelling Russia as the aggressor or acknowledging Ukraine's territorial integrity. Politics latest: UK defence spending to rise to 2.5% of GDP Ms Badenoch said the second resolution showed the US \"acting in its national interests\". \"It is being realistic and we need to be so too,\" she said. \"Now, that doesn't mean we're going to agree on everything. We disagree with them on that resolution, for example. \"But that is why I want the prime minister to be successful in his talks and find out what the thinking was behind that.\"  'Absolutely critical' Starmer succeeds in DC Ms Badenoch also said it is \"absolutely critical\" that Sir Keir succeeds in his talks on ending the war in Ukraine with Mr Trump on Thursday. However, she did not provide details of exactly what he should succeed in. Sir Keir is expected to discuss the importance of Ukraine's independence, European involvement in peace talks and US security guarantees with Mr Trump. Mr Trump, since becoming president just over a month ago, has called Ukrainian president Volodymyr Zelenskyy a dictator and suggested Kyiv started the war. He has also sent US officials to negotiate with Russia in Saudi Arabia - but did not invite Ukraine or any European leaders. Call for Starmer to cut development aid and welfare budget Ms Badenoch urged Sir Keir to \"repurpose\" development aid in the short term and look to make welfare savings to fund increased defence spending. She said 2.5% of GDP on defence is \"now no longer sufficient\" because any country that \"spends more on debt interest than it does on defence, as the UK does today, is destined for weakness\". \"I will back the prime minister in taking these difficult decisions,\" she added. Her call came ahead of the prime minister's unexpected statement on Tuesday lunchtime, in which he said UK defence spending will rise to 2.5% by 2027, and 3% in the next parliament. Read more:Starmer says 'US is right' about UK defenceRussian oligarchs face UK ban  The world has changed and the UK is not ready Ms Badenoch said the UK must \"accept reality\" that the world has changed and \"we can no longer hide behind vapid statements that were at best ambitious 20 years ago and are now today outright irrelevant\". \"It is time to speak the truth. The world has changed and the UK is not ready, so we must change too,\" she said. She accused the West of not doing enough to support Ukraine as \"we were too ineffective, too indecisive and too often behind the curve\". Because of that, she said: \"Putin gained what he needed most, time. We now see the consequences. \"An end to the war is being negotiated while a fifth of Ukrainian territory is under enemy occupation.\" However, she said she was proud of the support her government gave Ukraine in the run-up to Vladimir Putin's invasion and \"in those first crucial weeks and months of the war\"."
    },
    {
        "title": "MP grills X official over extreme messages after being told to 'swing on a gibbet'",
        "description": "An MP has confronted social media bosses over extreme messages received by politicians after she was threatened with being hung.",
        "url": "https://news.sky.com/story/mp-grills-x-official-over-extreme-messages-after-being-told-to-swing-on-a-gibbet-13317034",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emily-darlington-mp_6839781.png?20250225221153",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-25 20:44:00",
        "Headline": "Emily Darlington said threats towards her have not been removed, and the same account is posting racist and misogynistic content. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n An MP has confronted social media bosses over extreme messages received by politicians after she was threatened with being hung. Emily Darlington said the comment was made after she shared a petition to save her local Post Office on X last November and still hasn't been removed - despite reporting it. The same account has continued to post racist, misogynistic and homophobic comments, she said. The Labour MP was speaking at the Science, Innovation and Technology Committee, which grilled tech giants X, TikTok, Google and Meta on Tuesday as part of an inquiry into online misinformation and harmful algorithms. Ms Darlington said: \"In November I posted a tweet about my petition to save my local Post Office. \"This was a reply from one person: 'You are a traitor to the British people and you will swing oh so slowly on a gibbet'. \"I had to look up what a gibbet is, it's not a pleasant thing.\" \n                  Starmer says decision to increase defence spending was 'accelerated' by Trump taking office\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 A gibbet is a form of gallows from which the bodies of executed criminals were hung to public view. Ms Darlington said she reported the post as harmful and violent speech, in violation of X's rules that state expressing desire for violence is not allowed. Addressing Wifredo Fernandez, X's senior director for government affairs, she said: \"These are your safety rules. No action was taken, no action is still taken, the post is still up.\" She went onto list other violent and racist comments made by the account. She asked Mr Fernandez: \"Is this acceptable, under the guise of free speech on X these days?\" The X official said the comments are \"abhorrent\" and he will have his teams take a look - but that couldn't make any assurances the account will be removed. Ms Darlington said the comments are \"not unique\" and many other MPs get messages \"from these kinds of accounts\". \"[They] report them and no action is taken\", she said. Elsewhere in the session, MPs clashed with Meta representatives over the implementation of end-to-end encryption - with Labour's Paul Waugh accusing the platform of turning Facebook Messenger into \"Jeffrey Epstein's private island\". Meta's removal of third-party fact-checkers from its platforms also came in for criticism, with MPs saying it will allow \"racist misinformation\" to spread. In January, Meta boss Mark Zuckerberg announced the change, saying at the time that fact-checkers were too \"politically biased\" and were having an impact on \"free expression\" - a move seen by many as an attempt to get closer to the pro-free speech stance of the incoming Donald Trump administration."
    },
    {
        "title": "Business Secretary Jonathan Reynolds apologises over claims he exaggerated solicitor qualification",
        "description": "The business secretary has apologised after it emerged he claimed to be a solicitor - despite not finishing his training.",
        "url": "https://news.sky.com/story/business-secretary-jonathan-reynolds-apologises-over-claims-he-exaggerated-solicitor-qualification-13316631",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jonthan-reynolds-india_6839046.jpg?20250225092918",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-25 09:10:00",
        "Headline": "Andrew Griffith, the shadow business secretary, renewed calls for Mr Reynolds to resign following his apology, saying he was \"making excuses\".",
        "Content": "The business secretary has apologised after it emerged he claimed to be a solicitor - despite not finishing his training. Jonathan Reynolds faced calls to resign after accusations he described himself as a solicitor on several occasions - including on his LinkedIn page, in the Commons and on an old constituency website that is no longer online. The term solicitor is protected under law, and people can face prosecution for pretending to be one. Politics latest: Former MP to claim £91,000 salary in prison Mr Reynolds completed a law course and later began to train as a solicitor, but left the programme to run for parliament. Speaking to journalists on a trip to India, Mr Reynolds said: \"I've never presented myself as a qualified solicitor. I have made repeated references to being a trainee solicitor in government press releases, on social media, covered very extensively in the legal press.\" The minister added: \"For a speech - and I think a tweet or maybe a Facebook post over a decade ago - I don't think it's a huge deal, but I should apologise for that, if anyone has misunderstood that, but I don't think they have.\" Downing Street said Prime Minister Sir Keir Starmer had accepted the apology offered by Mr Reynolds. A spokesperson said the minister had written to the prime minister \"offering an unreserved apology for inadvertent errors made and he's provided an explanation and an apology that the prime minister has accepted\". Andrew Griffith, the shadow business secretary, renewed calls for Mr Reynolds to resign following his apology, saying he was \"making excuses\". He wrote on X: \"The Business Secretary lied to Parliament. This is still on the record. He should do the proper thing and resign.\" He also criticised the framing of the apology, saying: \"This is a 'sorry' from over 4,000 miles away, not a sorry apology.\" Read more:Watchdog looking into Reynolds claimsReynolds set for fresh talks on British Steel rescue Yesterday, Reform UK leader Nigel Farage promised to privately prosecute Mr Reynolds over the claims. He told a crowd in Cornwall: \"Jonathan Reynolds, who's never had a proper job in his life, who tells us he's a solicitor when he's never been qualified, which is a criminal offence. \"I can tell you tonight that there will be a private prosecution brought against Jonathan Reynolds.\" 👉Listen to Politics At Jack And Sam's on your podcast app👈 The Solicitors Regulation Authority said last week: \"We looked at that issue at the time we became aware of it and contacted Mr Reynolds about the profiles. \"The materials were corrected, and we closed the matter with no further action based on all the evidence we had at the time. \"However, we've now become aware of further information, so we will look at this.\" A Labour source suggested previously the reference to Mr Reynolds being a solicitor on social media was \"human error\" and said Mr Reynolds did not manage the profile."
    },
    {
        "title": "Yvette Cooper calls for new Runcorn MP after Amesbury jailed - but will keep his £91,000 salary",
        "description": "Home Secretary Yvette Cooper has said Runcorn needs a new Labour MP after Mike Amesbury was jailed for beating up a constituent - and will keep his &#163;91,000 MPs salary in prison.",
        "url": "https://news.sky.com/story/yvette-cooper-calls-for-new-runcorn-mp-after-amesbury-jailed-but-will-keep-his-16391000-salary-13316646",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mike-amesbury-mp-court_6838297.jpg?20250224100326",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-02-25 10:09:00",
        "Headline": "Mike Amesbury punched a man and has now been jailed for it but remains as an MP as the rules state he does not need to stand down.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Home Secretary Yvette Cooper has said Runcorn needs a new Labour MP after Mike Amesbury was jailed for beating up a constituent - and will keep his £91,000 MPs salary in prison. She told Wilfred Frost on Sky News Breakfast: \"Whether it is resigning or through recall, everyone's clear - the people of Runcorn deserve better representation, and that would come by having a newly elected MP.\" Amesbury, who has been an MP since 2017, remains as the MP for Runcorn and Helsby after being jailed for 10 weeks on Monday. He had at an earlier hearing pleaded guilty to assaulting Paul Fellows, 45 by punching him to the ground and hitting him five more times in Frodsham, Cheshire, after a night out last October. He has not resigned, despite calls for him to do so. Politics latest: Badenoch says UK should 'review' foreign policy strategy The 55-year-old MP will keep receiving his £91,000 salary while in prison because parliamentary rules state a recall petition, which kickstarts a by-election, can only happen once an appeal period for a custodial sentence of a year or less is exhausted. Amesbury's lawyer stated in court he would be appealing the 10-week sentence, of which the MP will serve four weeks in HMP Altcourse in Liverpool. There is also no mechanism to stop pay for MPs, unless they are suspended from the House of Commons, which has not yet happened for Amesbury.  Ms Cooper added: \"It's completely unacceptable what has happened. No matter who you are. No one is above the law.\" On whether the government is considering changing the law so MPs who receive a prison sentence can no longer serve as an MP, Ms Cooper said: \"I think these are matters, obviously, for the parliamentary authorities and processes that is separate from the decisions government make. \"But we are clear we need a new representation in Runcorn.\" Conservative shadow minister Victoria Atkins told Sky News the public and MPs have been \"disgusted\" by Amesbury keeping his job and called for the rules to be changed. \"I find it extraordinary that someone can claim their salary from their prison cell when their job is to be here in parliament, representing their constituents,\" she said. \"I think the government needs to look at this and we will look at these measures very, very carefully, whatever they bring forward. \"I share the public's disgust that a Labour MP is sitting in prison, serving a prison sentence because he beat up a constituent.\" Read more: Phone-snatchers targeted in new police crackdownEnvironment secretary to unveil farming reforms Amesbury was suspended by Labour two days after the incident, after CCTV footage was widely distributed. He has been sitting as an independent since then and Labour has said he will not be admitted back in. Reform UK has also called for Amesbury \"to do the honourable thing and resign immediately\". Amesbury pleaded guilty to assault by beating in January and described the incident as \"highly regrettable\" and apologised to Mr Fellows and his family outside the court. After the judge left the courtroom in Chester on Monday, following sentencing, Amesbury's lawyer asked for him to return and requested bail while he appealed the sentence. Judge Tan Ikram returned to the court, sat down, paused briefly and said: \"Application refused.\""
    },
    {
        "title": "MP Paul Waugh accuses Meta of turning Facebook Messenger into 'Epstein's paedophile island'",
        "description": "An MP has accused Meta of turning Facebook Messenger into \"Jeffrey Epstein's private island\" by enabling end-to-end encryption.&#160;",
        "url": "https://news.sky.com/story/mp-paul-waugh-accuses-meta-of-turning-facebook-messenger-into-epsteins-paedophile-island-13316884",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-facebook-messenger_5827680.jpg?20220708112019",
        "type": "Politics",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-25 16:17:00",
        "Headline": "After MP Paul Waugh accused Meta of turning Facebook into \"Epstein's own paedophile island\", Facebook's representative said online child abuse imagery needed a \"whole of society response\" where tech companies and law enforcement agencies worked cooperatively.",
        "Content": "\n          Science and Technology reporter\n       An MP has accused Meta of turning Facebook Messenger into \"Jeffrey Epstein's private island\" by enabling end-to-end encryption.  The Science, Innovation and Technology Committee grilled tech giants X, TikTok, Google and Meta today as part of an inquiry into online misinformation and harmful algorithms. \"Twenty years ago, someone like Gary Glitter had to go to the other side of the world to prey on children,\" said Labour MP Paul Waugh to Chris Yiu, one of Meta's directors of public policy. \"Someone like Jeffrey Epstein had to create his own private paedophile island. \"Now, these monsters, all they have to do is go on to set up a group on Facebook Messenger.\" Mr Waugh was referring to Facebook Messenger's recent implementation of end-to-end encryption, meaning that no one, not even Facebook, can see the contents of encrypted messages. Law enforcement agencies also cannot see the messages, which is a constant source of tension between tech companies and governments. \n                  Social media users risk fragmenting into silos after Trump election victory, experts warn\n                 \n                  Meta denies 'forcing' people to follow Donald Trump and JD Vance on social media apps\n                 \n                  Nick Clegg to step down from Meta role - with prominent Republican Joel Kaplan to replace him\n                 Just last week, Apple removed one of its highest-security tools for users over an alleged request by the Home Office to be able to see its encrypted user data.  \"Isn't it true that you've turned Facebook Messenger into Epstein's own paedophile island and a place where you can do what you want without getting caught?\" asked Mr Waugh. Mr Yiu denied this was the case and said the issue of online child sexual abuse material needed a \"whole of society response\" where tech companies and law enforcement agencies worked cooperatively. He also argued end-to-end encryption is a \"fundamental technology designed to keep people safe and protect their privacy\". The select committee's inquiry is investigating the spread of harmful content online, sparked by last August's riots. The widespread unrest took hold across the country after three young girls were stabbed to death in Southport.  In the days that followed, illegal content and disinformation spread \"widely and quickly\" online, according to the communications regulator Ofcom. Read more from Sky News:Apple removes end-to-end security encryption tool for UKIllness kills more than 50 people in Democratic Republic of CongoKate Bush, Sam Fender and Damon Albarn release silent protest album The committee chair Chi Onwurah said Elon Musk, owner of X, was invited to the evidence session but the billionaire did not reply formally. MP Emily Darlington also quizzed the Meta representative about the company's recent changes to its content guidelines. She read out numerous examples of Meta users posting racist, antisemitic and transphobic comments online and asked Mr Yiu how Meta justified allowing those posts to stay online. \"We have received feedback that [...] some areas of debates were being suppressed too much on our platform and that some conversations, whilst challenging, should have a space to be discussed,\" he said. X's representative also faced questions from the MPs, with Ms Darlington asking why verified X users were able to post comments calling politicians rapists and threatening to \"rise up and shoot\" public figures. Wifredo Fernandez, X's senior director for Government Affairs, said he would ask the X team to review the posts."
    },
    {
        "title": "Starmer has put Britain on a war footing ahead of key Trump meeting",
        "description": "Sir Keir Starmer has long talked about Europe needing to step up and lead.",
        "url": "https://news.sky.com/story/starmer-has-put-britain-on-a-war-footing-ahead-of-key-white-house-visit-13316830",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-beth-rigby-starmer_6839333.png?20250225144507",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-02-25 14:22:00",
        "Headline": "On Tuesday, Sir Keir Starmer announced plans to cut foreign aid in a bid to increase defence funding. This will give the prime minister something to show President Trump at their summit - but the UK will still need American support.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer has long talked about Europe needing to step up and lead. On Tuesday, he took a decisive stride as he put Britain on a war footing with a big boost to defence spending against the backdrop of an isolationist president in the White House and emboldened aggressor in the Kremlin. With European leaders reeling from the US - their once most reliable ally - siding with Russia in the United Nations, calling Ukraine's President Volodymyr Zelenskyy a \"dictator without elections\" and suggesting Kyiv is to blame for the war, Sir Keir made his move - stepping up on Britain's commitment to defence, to NATO and both its European and US allies. It was a case of when - not if - as the US, which has provided the backstop to European security for decades, signalled that it was no longer prepared to bankroll the defence of other NATO members. Politics latest: PM announces multi-billion pound defence increase Washington demanded that those in the security alliance step up military spending, calling for 5% of GDP to be spent on defence - more than double the alliance's current spending target.  In 2023, the US accounted for 68% of NATO spending, according to statistics compiled by the Stockholm International Peace Research Institute, with NATO's European members making up just 28%, and the rest from Canada and Turkey. The prime minister, announcing his decisions to redirect some of the UK's foreign development and aid budget into defence to pour an additional £13.4bn a year into defence spending by 2027, said it was the biggest increase in defence spending since the Cold War. He also pledged to increase defence spending to 3% of GDP in the next parliament, should he win the next general election. This decision is an acknowledgement from the British government that the peace dividend the UK and Europe took after the fall of the Berlin Wall is long gone, that the nation must now reinvest in its defence and security, rebuild its defence industry and put that above other priorities. \"The whole approach to national security must now change,\" said the prime minister. Read more:UK defence spending to rise to 2.5% of GDPStarmer 'must quickly' raise defence spending  \"We will have to ask British industry, British universities, British businesses and the British people to play a bigger part,\" he added. \"At moments like these in our past, Britain has stood up to be counted - it has come together, and it has demonstrated strength. \"That is what the security of our country needs now, and it is what this government will deliver.\" Even as he stood at the despatch box, the criticism that this was not enough in the face of the threat Britain faced began. The former defence secretary, Ben Wallace, told me the announcement was \"a staggering desertion of leadership\". \"[It is] tone-deaf to the dangers of the world and demands of the United States. Such a weak commitment to our security and nation puts us all at risk.\" It may well be, in the coming months, that figure needs to be revised again. 👉 Follow Trump 100 on your podcast app 👈  But what this commitment does give Sir Keir is something to offer President Trump when he goes to the White House on Thursday, asking the US to provide security guarantees to Ukraine as part of any peace deal. With the old order now in flux, Sir Keir is trying to carve out a leadership role straddling US and European allies. But he knows all too well that Ukrainian security will still rely on US support, which is why, regardless of what Starmer says now, winning commitments from Trump is essential."
    },
    {
        "title": "'No chance' of impact from asteroid 2024 YR4, say space agencies",
        "description": "An asteroid that had a very small chance of hitting Earth is no longer a potential threat, according to scientists.",
        "url": "https://news.sky.com/story/no-chance-of-impact-from-asteroid-2024-yr4-say-space-agencies-13316954",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-asteroid-earth-space_6826746.jpg?20250212165816",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-25 18:38:00",
        "Headline": "NASA now says the rock - estimated at 40-90 metres across - poses \"no significant impact risk to Earth in 2032 and beyond\".",
        "Content": "An asteroid that had a very small chance of hitting Earth is no longer a potential threat, according to scientists. The 2024 YR4 asteroid climbed to the top of the risk list earlier this month when the chance of a collision in 2032 tripled from 1.2% to about 3% (about one in 33). It first set off warning systems in December after being spotted through telescopes in Chile, travelling around 38,000mph. Professor Brian Cox had even talked of a possible \"deflection mission\" if the risk did not drop. But anyone faintly worried about a potential Armageddon scenario can now rest easy - the European Space Agency has slashed the chance of impact on Earth to 0.001%, and NASA to 0.0017%. The US space agency said it poses \"no significant impact risk to Earth in 2032 and beyond\". Paul Chodas, head of NASA's near-Earth objects studies, said the odds wouldn't rise again and an impact had been ruled out. \n                  Planetary parade: How and when to spot seven planets in UK skies in rare alignment\n                 \n                  Mars could have once had sandy beaches and a large ocean, scientists say\n                 \n                  Elon Musk calls famed astronaut Andreas Mogensen an 'idiot' after being accused of 'lying' about stranded astronauts\n                 \"That's the outcome we expected all along, although we couldn't be 100% sure that it would happen,\" he said. Read more from Sky News:How and when to spot seven planets in UK skiesMars could have once had sandy beaches Telescopes will continue to track the asteroid as it moves away, with the Webb Space Telescope hoping to pinpoint its size. Estimates had put it between 40-90 metres wide (130-300ft). \"While this asteroid no longer poses a significant impact hazard to Earth, 2024 YR4 provided an invaluable opportunity\" for study, NASA added. There is a very small chance that 2024 YR4 will \"impact the moon\" on 22 December 2032. That probability is currently 1.7%."
    },
    {
        "title": "MP Paul Waugh accuses Meta of turning Facebook Messenger into 'Epstein's paedophile island'",
        "description": "An MP has accused Meta of turning Facebook Messenger into \"Jeffrey Epstein's private island\" by enabling end-to-end encryption.&#160;",
        "url": "https://news.sky.com/story/mp-paul-waugh-accuses-meta-of-turning-facebook-messenger-into-epsteins-paedophile-island-13316884",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-facebook-messenger_5827680.jpg?20220708112019",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-02-25 16:17:00",
        "Headline": "After MP Paul Waugh accused Meta of turning Facebook into \"Epstein's own paedophile island\", Facebook's representative said online child abuse imagery needed a \"whole of society response\" where tech companies and law enforcement agencies worked cooperatively.",
        "Content": "\n          Science and Technology reporter\n       An MP has accused Meta of turning Facebook Messenger into \"Jeffrey Epstein's private island\" by enabling end-to-end encryption.  The Science, Innovation and Technology Committee grilled tech giants X, TikTok, Google and Meta today as part of an inquiry into online misinformation and harmful algorithms. \"Twenty years ago, someone like Gary Glitter had to go to the other side of the world to prey on children,\" said Labour MP Paul Waugh to Chris Yiu, one of Meta's directors of public policy. \"Someone like Jeffrey Epstein had to create his own private paedophile island. \"Now, these monsters, all they have to do is go on to set up a group on Facebook Messenger.\" Mr Waugh was referring to Facebook Messenger's recent implementation of end-to-end encryption, meaning that no one, not even Facebook, can see the contents of encrypted messages. Law enforcement agencies also cannot see the messages, which is a constant source of tension between tech companies and governments. \n                  Social media users risk fragmenting into silos after Trump election victory, experts warn\n                 \n                  Meta denies 'forcing' people to follow Donald Trump and JD Vance on social media apps\n                 \n                  Nick Clegg to step down from Meta role - with prominent Republican Joel Kaplan to replace him\n                 Just last week, Apple removed one of its highest-security tools for users over an alleged request by the Home Office to be able to see its encrypted user data.  \"Isn't it true that you've turned Facebook Messenger into Epstein's own paedophile island and a place where you can do what you want without getting caught?\" asked Mr Waugh. Mr Yiu denied this was the case and said the issue of online child sexual abuse material needed a \"whole of society response\" where tech companies and law enforcement agencies worked cooperatively. He also argued end-to-end encryption is a \"fundamental technology designed to keep people safe and protect their privacy\". The select committee's inquiry is investigating the spread of harmful content online, sparked by last August's riots. The widespread unrest took hold across the country after three young girls were stabbed to death in Southport.  In the days that followed, illegal content and disinformation spread \"widely and quickly\" online, according to the communications regulator Ofcom. Read more from Sky News:Apple removes end-to-end security encryption tool for UKIllness kills more than 50 people in Democratic Republic of CongoKate Bush, Sam Fender and Damon Albarn release silent protest album The committee chair Chi Onwurah said Elon Musk, owner of X, was invited to the evidence session but the billionaire did not reply formally. MP Emily Darlington also quizzed the Meta representative about the company's recent changes to its content guidelines. She read out numerous examples of Meta users posting racist, antisemitic and transphobic comments online and asked Mr Yiu how Meta justified allowing those posts to stay online. \"We have received feedback that [...] some areas of debates were being suppressed too much on our platform and that some conversations, whilst challenging, should have a space to be discussed,\" he said. X's representative also faced questions from the MPs, with Ms Darlington asking why verified X users were able to post comments calling politicians rapists and threatening to \"rise up and shoot\" public figures. Wifredo Fernandez, X's senior director for Government Affairs, said he would ask the X team to review the posts."
    },
    {
        "title": "MP grills X official over extreme messages after being told to 'swing on a gibbet'",
        "description": "An MP has confronted social media bosses over extreme messages received by politicians after she was threatened with being hung.",
        "url": "https://news.sky.com/story/mp-grills-x-official-over-extreme-messages-after-being-told-to-swing-on-a-gibbet-13317034",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-emily-darlington-mp_6839781.png?20250225221153",
        "type": "Technology",
        "Author": "Faye Brown",
        "Date Published": "2025-02-25 20:44:00",
        "Headline": "Emily Darlington said threats towards her have not been removed, and the same account is posting racist and misogynistic content. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n An MP has confronted social media bosses over extreme messages received by politicians after she was threatened with being hung. Emily Darlington said the comment was made after she shared a petition to save her local Post Office on X last November and still hasn't been removed - despite reporting it. The same account has continued to post racist, misogynistic and homophobic comments, she said. The Labour MP was speaking at the Science, Innovation and Technology Committee, which grilled tech giants X, TikTok, Google and Meta on Tuesday as part of an inquiry into online misinformation and harmful algorithms. Ms Darlington said: \"In November I posted a tweet about my petition to save my local Post Office. \"This was a reply from one person: 'You are a traitor to the British people and you will swing oh so slowly on a gibbet'. \"I had to look up what a gibbet is, it's not a pleasant thing.\" \n                  Starmer says decision to increase defence spending was 'accelerated' by Trump taking office\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 A gibbet is a form of gallows from which the bodies of executed criminals were hung to public view. Ms Darlington said she reported the post as harmful and violent speech, in violation of X's rules that state expressing desire for violence is not allowed. Addressing Wifredo Fernandez, X's senior director for government affairs, she said: \"These are your safety rules. No action was taken, no action is still taken, the post is still up.\" She went onto list other violent and racist comments made by the account. She asked Mr Fernandez: \"Is this acceptable, under the guise of free speech on X these days?\" The X official said the comments are \"abhorrent\" and he will have his teams take a look - but that couldn't make any assurances the account will be removed. Ms Darlington said the comments are \"not unique\" and many other MPs get messages \"from these kinds of accounts\". \"[They] report them and no action is taken\", she said. Elsewhere in the session, MPs clashed with Meta representatives over the implementation of end-to-end encryption - with Labour's Paul Waugh accusing the platform of turning Facebook Messenger into \"Jeffrey Epstein's private island\". Meta's removal of third-party fact-checkers from its platforms also came in for criticism, with MPs saying it will allow \"racist misinformation\" to spread. In January, Meta boss Mark Zuckerberg announced the change, saying at the time that fact-checkers were too \"politically biased\" and were having an impact on \"free expression\" - a move seen by many as an attempt to get closer to the pro-free speech stance of the incoming Donald Trump administration."
    },
    {
        "title": "Artists including Kate Bush, Sam Fender and Damon Albarn release silent album in protest at AI copyright plans",
        "description": "More than 1,000 artists and musicians including Kate Bush, Damon Albarn, Sam Fender and Annie Lennox have recorded a silent album in protest at proposed changes to copyright law, which they say could lead to artists being replaced by artificial intelligence (AI).",
        "url": "https://news.sky.com/story/artists-including-kate-bush-sam-fender-and-damon-albarn-release-silent-album-in-protest-at-ai-copyright-plans-13316626",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kate-bush-sam-fender_6839061.jpg?20250225100213",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-25 09:05:00",
        "Headline": "Is This What We Want? features recordings of empty studios and performance spaces - which artists say could become a reality for musicians in the UK if the changes go ahead. Profits will be donated to the musicians' charity, Help Musicians.",
        "Content": " More than 1,000 artists and musicians including Kate Bush, Damon Albarn, Sam Fender and Annie Lennox have recorded a silent album in protest at proposed changes to copyright law, which they say could lead to artists being replaced by artificial intelligence (AI). Is This What We Want? also involves artists including Billy Ocean, Tom Grennan, New Order, Simon Le Bon, Tori Amos, Pet Shop Boys, The Clash, Bashy, Jamiroquai and Imogen Heap - along with a range of composers, conductors and organisations such as Hans Zimmer, and the Royal Albert Hall and Royal Liverpool Philharmonic Orchestra. It features recordings of empty studios and performance spaces - which artists say could become a reality for musicians in the UK if the changes go ahead. The track listing spells out the message: \"The British government must not legalise music theft to benefit AI companies.\" Under the plans, an exemption to copyright would be created for training AI, so tech firms would not need a licence to use copyrighted material - and creators would need to opt out to prevent their work from being used. A government spokesperson the UK's \"current regime\" for copyright and AI was holding back the creative industries, media and AI sector \"from realising their full potential\". A consultation on the issue closed on Wednesday. Sir Elton John and Simon Cowell have also backed a campaign opposing the proposals, and Sir Paul McCartney has spoken out against them. The new plans fail to reimburse artists for AI recreating and copying their work, stifle creativity, and the proposed opt-out scheme places an unnecessary burden on artists, critics say. All profits from the silent album will be donated to the musicians' charity, Help Musicians. Read more:'Regulate it before we're all finished'Why the UK didn't sign up to global AI agreement 'Throwing creative industries under the bus' Campaigner Ed Newton-Rex, who organised the album, said: \"The government's proposal would hand the life's work of the country's musicians to AI companies, for free, letting those companies exploit musicians' work to outcompete them. \"It is a plan that would not only be disastrous for musicians, but that is totally unnecessary. The UK can be leaders in AI without throwing our world-leading creative industries under the bus. \"This album shows that, however the government tries to justify it, musicians themselves are united in their thorough condemnation of this ill-thought-through plan.\" The creative industries have been vocal in their opposition to how powerful AI models such as ChatGPT can be used to generate fresh content on demand, imitating what already exists. Concerns around their use by film and TV studios to write scripts or even replace actors were a key driver of the Hollywood strikes in 2023, while music labels have sought to prevent pop stars' vocals from being freely cloned and photographers have spoken out against online art generators. In 2023, UK music contributed £7.6bn to the UK economy, with exports of UK music reaching £4.6bn. While some AI firms have started making deals to license content, many existing models have been trained using data from the public internet, including from news and other publishing websites. Dan Conway, chief executive of the Publishers Association, the trade organisation representing book, journal and electronic publishers in the UK, said the \"extraordinary strength of support\" against the proposals is \"something the government ignores at its peril\". He continued: \"When Booker, Grammy, Oscar and Nobel prize winners are united in calling on the government for a fair hearing, we have to hope they listen… \"The message to government is clear: the great copyright heist cannot go unchallenged.\" A government spokesperson said: \"As it stands, the UK's current regime for copyright and AI is holding back the creative industries, media and AI sector from realising their full potential - and that cannot continue. That's why we have been consulting on a new approach that protects the interests of both AI developers and right holders and delivers a solution which allows both to thrive. \"We have engaged extensively with these sectors throughout and will continue to do so. No decisions have been taken, and no moves will be made until we are absolutely confident we have a practical plan that delivers each of our objectives, including increased control for right holders to help them easily license their content, enabling lawful access to material to train world-leading AI models in the UK, and building greater transparency over material being used. Our proposals will be set out in due course.\""
    },
    {
        "title": "Mars could have once had sandy beaches and a large ocean, scientists say",
        "description": "Go back a mere four billion years, and Mars could have been the perfect destination for a summer holiday.",
        "url": "https://news.sky.com/story/mars-could-have-once-had-sandy-beaches-and-a-large-ocean-scientists-say-13316637",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mars-illustration-gfx_6839125.jpg?20250225112130",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-25 09:43:00",
        "Headline": "The ocean - known as Deuteronilus - would have existed roughly 3.5 to four billion years ago, a time when Mars had a thicker atmosphere and warmer climate, according to scientists.",
        "Content": "Go back a mere four billion years, and Mars could have been the perfect destination for a summer holiday. According to scientists, hidden underneath the red planet is evidence that there were once sandy beaches and a large ocean on its surface. Data obtained from China's Zhurong rover indicate that the ocean - known as Deuteronilus - would have existed roughly 3.5 to four billion years ago, a time when Mars had a thicker atmosphere and warmer climate. The rover, which operated from May 2021 to May 2022, travelled about 1.2 miles (1.9km) on the planet, and detected thick layers of material with properties similar to sand around 35-115ft below the surface. The sand-like material was all sloped in the same direction and at an angle, similar to beaches on Earth, and spanned for three quarters of a mile, researchers said. The study, published in the journal Proceedings of the National Academy of Sciences on Monday, said these beaches would have been formed by similar processes to those on Earth - waves and tides. The discovery could be crucial in finding out if Mars's surface supported living organisms. \"Shorelines are great locations to look for evidence of past life,\" planetary scientist and co-author of the study, Michael Manga of the University of California, Berkeley, said. \"It's thought that the earliest life on Earth began at locations like this, near the interface of air and shallow water.\" Fellow co-author and Penn State geoscientist, Benjamin Cardenas, added researchers were able to rule out that the structures detected by the rover were ancient rivers or sand dunes. \"Beaches simply fit the observations the best,\" he said. He added: \"Dunes tend to come in groups, and these groups produce characteristic patterns not present in these deposits... We also considered ancient rivers, but we rejected that hypothesis for similar reasons based on the patterns we saw in the deposits.\" Read more from Sky News:Illness kills more than 50 people in Democratic Republic of CongoApple removes advanced security tool over UK government row A study published last year found evidence suggesting there is a large reservoir of liquid water under the surface of Mars, within fractured igneous rocks. Any evidence of the reservoir on the surface could have been erased or distorted by billions of years of wind erosion or other geological processes. That is not the case with these newly found structures, which were preserved over time under material deposited by dust storms, meteorite strikes or volcanic activity."
    },
    {
        "title": "Mystery illness kills more than 50 people in Democratic Republic of Congo",
        "description": "An unknown disease has killed more than 50 people in the Democratic Republic of Congo (DRC), according to doctors.",
        "url": "https://news.sky.com/story/mystery-illness-kills-more-than-50-people-in-democratic-republic-of-congo-13316610",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-congo-hospital-drc_6839275.jpg?20250225135732",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-25 08:31:00",
        "Headline": "More than 400 cases have been recorded since the outbreak in January, with most deaths occurring within 48 hours of the onset of symptoms.",
        "Content": "An unknown disease has killed more than 50 people in the Democratic Republic of Congo (DRC), according to doctors. The World Health Organisation's (WHO) Africa office said the first outbreak was discovered in the town of Boloko, in the northwest of the country. It is reported that three children ate a bat and died following haemorrhagic fever symptoms. The interval between the onset of symptoms and death has been 48 hours in the majority of cases. \"That's what's really worrying,\" Serge Ngalebato, medical director of Bikoro Hospital, a regional monitoring centre, told the news agency, The Associated Press. The outbreak began on 21 January and 419 cases have been recorded including 53 deaths. There was a second outbreak of the mystery illness in the town of Bomate on 9 February. Samples from 13 cases have been sent for testing to the National Institute for Biomedical Research in the DRC's capital, Kinshasa, the WHO said. All samples have been negative for Ebola or other common haemorrhagic fever diseases like Marburg. Some tested positive for malaria. Last year, another mystery flu-like illness which killed dozens of people in another part of Congo was considered likely to be malaria. Read more:Rebels take second city in DRCFootball clubs should stop Rwanda deal Scientists have had concerns for a long time about diseases jumping from animals to humans in places where wild animals are eaten. The number of these types of outbreaks in Africa has surged by more than 60% in the last decade, the WHO said in 2022."
    },
    {
        "title": "Planetary parade: How and when to spot seven planets in UK skies in rare alignment",
        "description": "Not one, not two, but seven planets are due to line up in the night skies later this week in a relatively rare planetary parade.",
        "url": "https://news.sky.com/story/planetary-parade-how-and-when-to-spot-seven-planets-in-uk-skies-in-rare-alignment-13316815",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-planets-space_6839317.jpg?20250225143504",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-25 16:18:00",
        "Headline": "The occasion will see Mars, Jupiter, Mercury, Venus, Saturn, Uranus, Neptune and Mercury align, with some of the planets visible to the naked eye.",
        "Content": "Not one, not two, but seven planets are due to line up in the night skies later this week in a relatively rare planetary parade. The phenomenon will see Mars, Jupiter, Mercury, Venus, Saturn, Uranus, Neptune and Mercury align, with some of the planets visible to the naked eye. Keen astronomers may have already spotted six of the planets in late January or earlier this month, but on 28 February, Mercury will also join the parade. This will mean a potential of seven planets on display at once, the Greenwich Royal Observatory says. Here is everything you need to know ahead of the phenomenon and how to maximise your chances of spotting all seven planets. Why do the planets align? In simple terms, as the planets in our Solar System orbit the sun, they occasionally line up in space, according to NASA. The term planetary alignment can refer to apparent line-ups with other planets, the moon, or bright stars. When this happens, the planets always appear along a line or an arc, NASA adds, due to the way they are viewed from Earth. How rare is it? \"Planetary alignments, where multiple planets appear close together in the sky, occur periodically but are relatively rare,\" Dr Shyam Balaji, researcher in astroparticle physics and cosmology at King's College London, said last month. He added alignments of six or more planets happen approximately every few decades, making Friday's potential line-up even rarer. NASA adds Mars, Jupiter, and Saturn are frequently seen in the night sky, but the addition of Venus and Mercury are particularly noteworthy. Will UK skies be clear enough to see the planets? There's good news, and somewhat bad news - depending on where you are in the UK. Sky News meteorologist Jo Robinson says there's high pressure over the UK on Friday, meaning the weather looks good for people getting ready to watch the night skies. Most places will also be dry with clear spells, although Robinson warns temperatures will be chilly, with the Met Office predicting \"widespread\" frost on Friday morning. Unfortunately, Ireland, Northern Ireland and northwest Scotland may be quite cloudy ahead of rain moving in on Friday night, Robinson says. But, she adds, the forecast is still \"several days away, so timings may change\". Any delay in the rain moving in will allow for clearer skies. An added bonus to the upcoming planetary alignment is there will also be a new moon on 28 February. This occurs when the moon is directly between the sun and the Earth, with its shadowed side pointing towards Earth. It means that those looking into the skies on Friday will be less affected by light pollution from the moon, and may even be able to get a good look at some galaxies, the Greenwich Royal Observatory says. Read more from Sky News:Mars could have had beaches and an oceanWhat could happen if the 2024 YR4 asteroid hits earth? Will you need a telescope? Five planets: Mercury, Venus, Mars, Jupiter, and Saturn, are typically visible to the naked eye. However, this does not guarantee they will be visible this Friday. The Greenwich Royal Observatory says in late February it becomes much more difficult to see Saturn as it will be very low on the southwestern horizon after sunset. NASA adds Mercury could also be difficult for observers to see without the aid of a telescope, as it may be too faint and too low. It says to see Neptune a telescope is absolutely necessary, while Uranus, although technically bright enough to detect with good eyesight, is \"quite faint and requires dark skies and precise knowledge of its location among similarly faint stars\", so a telescope is recommended. Other top tips for planet-spotters To help keen observers maximise their chances of seeing as many planets as possible, Dr Balaji, from King's College London recommends the following tips: • Find a location away from city lights• Use current astronomical software or websites to find a planet's latest position• Exercise caution when observing near sunrise or sunset• Check reliable astronomy websites for updated viewing information as the date approaches."
    },
    {
        "title": "Woman admits trying to defraud Elvis Presley's family by auctioning off Graceland",
        "description": "A woman has admitted attempting to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale.",
        "url": "https://news.sky.com/story/woman-admits-trying-to-defraud-elvis-presleys-family-by-auctioning-off-graceland-13317185",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-graceland-memphis-tennessee_6561472.jpg?20240521071042",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-25 23:07:00",
        "Headline": "Lisa Jeanine Findley, of Kimberling City, Missouri, falsely claimed Presley's daughter Lisa Marie had borrowed $3.8m from a bogus private lender and had pledged Graceland as collateral for the loan, prosecutors said.",
        "Content": "A woman has admitted attempting to defraud Elvis Presley's family by trying to auction off his Graceland mansion and property before a judge halted the mysterious foreclosure sale. Lisa Jeanine Findley had initially denied charges of mail fraud and aggravated identity theft in relation to the scheme but has now changed her plea in the two-count indictment. Prosecutors had said Findley, of Kimberling City, Missouri, falsely claimed Presley's daughter Lisa Marie had borrowed $3.8m (£3m) from a bogus private lender and had pledged Graceland as collateral for the loan before her death in January 2023. Findley then threatened to sell Graceland to the highest bidder if Presley's family did not pay a $2.85m (£2.25m) settlement, according to authorities. She posed as three different people allegedly involved with the fake lender, fabricated loan documents and published a fraudulent foreclosure notice in a Memphis newspaper announcing the auction of Graceland in May 2024, prosecutors said. A judge stopped the sale after Presley's granddaughter and Lisa Marie's daughter, actress Riley Keough, sued. Experts were baffled by the attempt to sell off one of the most famous pieces of property in the country using names, emails and documents that were quickly suspected to be fake. \n                  Woman charged over alleged scheme to fraudulently sell Elvis Presley's former home Graceland\n                 \n                  Elvis Presley's blue suede shoes expected to fetch up to £120,000 at auction\n                 \n                  Mark James: Suspicious Minds and Hooked On A Feeling songwriter dies\n                 Graceland opened as a museum and tourist attraction in 1982 and draws hundreds of thousands of visitors each year. A large Presley-themed entertainment complex across the street from the museum is owned by Elvis Presley Enterprises. Presley, known as the King of Rock and Roll, died in August 1977 at the age of 42 Keough, who inherited the trust and ownership of the home after the death of her mother, filed a lawsuit claiming fraud against Findley and a judge halted the proposed auction with an injunction. Naussany Investments and Private Lending - the bogus lender authorities say Findley created - said Lisa Marie Presley had used Graceland as collateral for the loan, according to the foreclosure sale notice. The judge said Elvis Presley's estate could be successful in arguing that a company's attempt to auction Graceland was fraudulent. Read more from Sky News:Businessman's body found in 'sack of pineapples'Large bruise on Trump's hand prompts speculation over healthCouple 'forced' to sit next to dead woman on flight Ms Keough's lawsuit alleged that Naussany presented fraudulent documents regarding the loan in September 2023 and that Ms Presley never borrowed money from Naussany. After the scheme fell apart, Findley tried to make it look like the person responsible was a Nigerian identity thief, prosecutors said. An email sent on 25 May 2024 to the Associated Press from the same email as the earlier statement said in Spanish that the foreclosure sale attempt was made by a Nigerian fraud ring that targets old and dead people in the US and uses the internet to steal money. In a statement, Tennessee Attorney General Jonathan Skrmetti called the scheme \"nonsense\" and praised the work of federal authorities. \"Graceland matters so much to so many people around the world - just go to Memphis during Elvis Week and listen to all the different accents and languages of fans who make the pilgrimage,\" Mr Skrmetti said. \"All of Tennessee is glad that Graceland remains safely in the possession of Elvis's heir and that it will remain a celebrated Memphis landmark for generations to come.\" Findley will be sentenced on 18 June and would have faced up to 20 years if convicted, but she is expected to receive less than that under the plea deal."
    },
    {
        "title": "BBC apologises for failing to stop DJ Tim Westwood's 'bullying and misogynistic behaviour' ",
        "description": "The BBC has apologised after it \"missed opportunities that might have led to action\" following claims of \"bullying and misogynistic behaviour\" against former Radio One star Tim Westwood.",
        "url": "https://news.sky.com/story/bbc-apologises-for-failing-to-stop-dj-tim-westwoods-bullying-and-misogynistic-behaviour-13316715",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-tim-westwood-dj_6217916.jpg?20230713171809",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-25 12:03:00",
        "Headline": "In a statement for the report sent through his solicitors, Tim Westwood strongly denied his behaviour at the BBC \"ever amounted to bullying or harassment\", and said some people \"behaved poorly towards\" him.",
        "Content": "The BBC has apologised after it \"missed opportunities that might have led to action\" following claims of \"bullying and misogynistic behaviour\" against former Radio One star Tim Westwood. It comes after the publication of an independent external review into Westwood's conduct while he was working for the corporation. The review did not find \"significant BBC knowledge of allegations or concerns about sexual misconduct\" by the DJ, but concluded \"a range of factors... ought to have alerted\" the broadcaster to the possibility he might \"present a risk to young women and girls\". Westwood did not take part in the review. In a statement for the report sent through his solicitors, he strongly denied his behaviour \"ever amounted to bullying or harassment\", and said some people \"behaved poorly\" towards him. Publication of the report, commissioned in 2022, has faced several delays - including in December, when the BBC postponed at the request of the Metropolitan Police. The review, carried out by barrister Gemma White KC, cost approximately £3.3m. It included contributions from more than 120 people and highlights several allegations which Ms White said showed there was a \"considerable body of evidence either known to, or available to\" the BBC which raised questions about Westwood's conduct. Responding to the report, the BBC board highlighted the review had found \"no widespread or significant BBC knowledge of allegations or concerns about predatory sexual behaviour\". Their statement continued: \"It is clear, however, that there were instances where the organisation missed opportunities that might have led to action. Allegations were treated in isolation rather than being brought together. Had this happened, the BBC may have seen a pattern of behaviour that it could have acted on. \"There is evidence of bullying and misogynistic behaviour on the part of Mr Westwood and the plain fact is that his general conduct was entirely incompatible with BBC values - not just now, but then. The organisation fell short and failed people - including our own staff - who had a right to expect better from us.\" What did the review find? People who reported allegations against Westwood said they were \"concerned that they would not be believed or might be blamed\" for his alleged behaviour, Ms White wrote in her report. The DJ was \"very popular so no one wanted to listen\", one person said. \"A common theme amongst those who reported allegations was that they did not know or understand at the time that the behaviour which they had described to me was wrong,\" the report said. One person described Westwood's conduct as being \"so public\" and \"brazen\", the report stated, and members of the BBC production team were left \"upset and in tears\" as a result of his alleged bullying and harassment. The report read: \"People referred to Tim Westwood refusing to talk to some of his BBC production team members, 'freezing them out' and giving them the 'silent treatment'. \"Many told me that they, and others, found it very difficult to work with him.\" Ms White's report said \"many people\" also raised concerns about the way Westwood treated people on air, including jokes about women's breasts, and the review team listened to a selection of his 1Xtra drivetime shows during their investigations. \"There are repeated examples of Tim Westwood discussing, or referring to, the bodies of those who were in the studio with him and of jokes at their expense,\" Ms White wrote. However, she added: \"I did not hear of any allegation of inappropriate sexual contact with BBC colleagues and no BBC employee who worked with Tim Westwood told me that they regarded inappropriate sexualised language that Tim Westwood is alleged to have used about them to be a sexual advance.\"  The BBC has taken a range of actions in recent years, including implementing a specialist case management process to consider the most serious allegations and concerns raised, as well as a new anti-bullying and harassment policy. Westwood began his career on local radio before joining Capital Radio in London. He then moved to the BBC and left Radio 1 and Radio 1Xtra after nearly 20 years in 2013. He hosted a regular Saturday show on Capital Xtra, where he was referred to as \"The Big Dawg\", before he left the company in 2022. In their statement for the review, Westwood's lawyers said he had complained about \"negative behaviour\" towards him when he worked for 1Xtra and was \"essentially advised to rise above it\". He also said after a move to a new slot in 2009, \"the environment felt competitive and hostile\" and was \"toxic from the outset\". On some occasions, Westwood \"took issue with some of his colleagues' poor attitude to work and low productivity, and expressed his opinion that they were lazy and out of touch with the audience\", his lawyers' statement said. \"He accepts that this contributed to a divisive atmosphere within some of the teams with which he worked.\" Allegations against Westwood were first made public in 2022, when several women accused him of sexual misconduct. He has strongly denied all allegations of inappropriate behaviour and wrongdoing. The Met Police previously said detectives were investigating accusations of offences alleged to have happened between 1982 and 2016."
    },
    {
        "title": "Artists including Kate Bush, Sam Fender and Damon Albarn release silent album in protest at AI copyright plans",
        "description": "More than 1,000 artists and musicians including Kate Bush, Damon Albarn, Sam Fender and Annie Lennox have recorded a silent album in protest at proposed changes to copyright law, which they say could lead to artists being replaced by artificial intelligence (AI).",
        "url": "https://news.sky.com/story/artists-including-kate-bush-sam-fender-and-damon-albarn-release-silent-album-in-protest-at-ai-copyright-plans-13316626",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-kate-bush-sam-fender_6839061.jpg?20250225100213",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-25 09:05:00",
        "Headline": "Is This What We Want? features recordings of empty studios and performance spaces - which artists say could become a reality for musicians in the UK if the changes go ahead. Profits will be donated to the musicians' charity, Help Musicians.",
        "Content": " More than 1,000 artists and musicians including Kate Bush, Damon Albarn, Sam Fender and Annie Lennox have recorded a silent album in protest at proposed changes to copyright law, which they say could lead to artists being replaced by artificial intelligence (AI). Is This What We Want? also involves artists including Billy Ocean, Tom Grennan, New Order, Simon Le Bon, Tori Amos, Pet Shop Boys, The Clash, Bashy, Jamiroquai and Imogen Heap - along with a range of composers, conductors and organisations such as Hans Zimmer, and the Royal Albert Hall and Royal Liverpool Philharmonic Orchestra. It features recordings of empty studios and performance spaces - which artists say could become a reality for musicians in the UK if the changes go ahead. The track listing spells out the message: \"The British government must not legalise music theft to benefit AI companies.\" Under the plans, an exemption to copyright would be created for training AI, so tech firms would not need a licence to use copyrighted material - and creators would need to opt out to prevent their work from being used. A government spokesperson the UK's \"current regime\" for copyright and AI was holding back the creative industries, media and AI sector \"from realising their full potential\". A consultation on the issue closed on Wednesday. Sir Elton John and Simon Cowell have also backed a campaign opposing the proposals, and Sir Paul McCartney has spoken out against them. The new plans fail to reimburse artists for AI recreating and copying their work, stifle creativity, and the proposed opt-out scheme places an unnecessary burden on artists, critics say. All profits from the silent album will be donated to the musicians' charity, Help Musicians. Read more:'Regulate it before we're all finished'Why the UK didn't sign up to global AI agreement 'Throwing creative industries under the bus' Campaigner Ed Newton-Rex, who organised the album, said: \"The government's proposal would hand the life's work of the country's musicians to AI companies, for free, letting those companies exploit musicians' work to outcompete them. \"It is a plan that would not only be disastrous for musicians, but that is totally unnecessary. The UK can be leaders in AI without throwing our world-leading creative industries under the bus. \"This album shows that, however the government tries to justify it, musicians themselves are united in their thorough condemnation of this ill-thought-through plan.\" The creative industries have been vocal in their opposition to how powerful AI models such as ChatGPT can be used to generate fresh content on demand, imitating what already exists. Concerns around their use by film and TV studios to write scripts or even replace actors were a key driver of the Hollywood strikes in 2023, while music labels have sought to prevent pop stars' vocals from being freely cloned and photographers have spoken out against online art generators. In 2023, UK music contributed £7.6bn to the UK economy, with exports of UK music reaching £4.6bn. While some AI firms have started making deals to license content, many existing models have been trained using data from the public internet, including from news and other publishing websites. Dan Conway, chief executive of the Publishers Association, the trade organisation representing book, journal and electronic publishers in the UK, said the \"extraordinary strength of support\" against the proposals is \"something the government ignores at its peril\". He continued: \"When Booker, Grammy, Oscar and Nobel prize winners are united in calling on the government for a fair hearing, we have to hope they listen… \"The message to government is clear: the great copyright heist cannot go unchallenged.\" A government spokesperson said: \"As it stands, the UK's current regime for copyright and AI is holding back the creative industries, media and AI sector from realising their full potential - and that cannot continue. That's why we have been consulting on a new approach that protects the interests of both AI developers and right holders and delivers a solution which allows both to thrive. \"We have engaged extensively with these sectors throughout and will continue to do so. No decisions have been taken, and no moves will be made until we are absolutely confident we have a practical plan that delivers each of our objectives, including increased control for right holders to help them easily license their content, enabling lawful access to material to train world-leading AI models in the UK, and building greater transparency over material being used. Our proposals will be set out in due course.\""
    },
    {
        "title": "Shirley Ballas stalker Kyle Shaw admits charge at Liverpool Crown Court",
        "description": "A 37-year-old man has pleaded guilty to stalking Strictly Come Dancing judge Shirley Ballas over the course of six years.",
        "url": "https://news.sky.com/story/man-37-pleads-guilty-to-stalking-strictly-come-dancing-judge-shirley-ballas-13316859",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-shirley-ballas-stalking_6793487.jpg?20250107114645",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-25 15:36:00",
        "Headline": "Shaw, from Birkenhead, was bailed until 1 April and told to expect an immediate prison sentence.",
        "Content": "A 37-year-old man has pleaded guilty to stalking Strictly Come Dancing judge Shirley Ballas over the course of six years. Kyle Shaw admitted stalking the 64-year-old dancer and TV star between 31 August 2017 and 29 November 2023. According to the charge, he caused Ballas \"serious alarm or distress, which had a substantial adverse effect on her usual day-to-day activities\". The court heard he made continued attempts to contact Ballas, including posting an image of her house on social media. He also tried to contact family, friends and colleagues, monitored her online and TV presence and made arrangements to go to her book tour. Ballas was so concerned, the court was told, that she increased her security measures, moved her mother to a different address and altered social and work arrangements. Shaw, from Whetstone Lane in Birkenhead, was bailed at Liverpool Crown Court ahead of sentencing on 1 April. He also admitted possessing cannabis. Read more from Sky News:BBC apologises over WestwoodRoberta Flack dies Judge Gary Woodhall told him it was very likely he would get \"an immediate custodial sentence\". Ballas, originally from Wallasey, has been head judge on Strictly since 2017, when she replaced Len Goodman. Known as the 'Queen of Latin', she retired from competition in 1996 after winning numerous titles and went on to become a dance coach and international judge."
    },
    {
        "title": "Large bruise on Trump's hand prompts speculation over health - but White House blames 'shaking hands'",
        "description": "A large bruise that appeared on Donald Trump's hand is down to him shaking a lot of hands, the White House has said.",
        "url": "https://news.sky.com/story/bruise-on-trumps-hand-prompts-speculation-over-health-but-white-house-blames-shaking-hands-13316982",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bruise-hand-donald-trump_6839636.jpg?20250225203105",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-25 19:16:00",
        "Headline": "Donald Trump's right hand appeared to be bruised when he was pictured on Monday during a meeting with French President Emmanuel Macron. The US leader, who started his second stint in the White House last month, is yet to release his full medical report.",
        "Content": "A large bruise that appeared on Donald Trump's hand is down to him shaking a lot of hands, the White House has said. Mr Trump's right hand seemed bruised during the 78-year-old's meeting with French President Emmanuel Macron on Monday, prompting speculation on social media over his health. Redness or bruising on the US leader's right hand were also spotted in August and November last year, Sky News' US partner network NBC reported.  White House press secretary Karoline Leavitt has claimed the bruising is a result of hand shaking. \"President Trump is a man of the people and he meets more Americans and shakes their hands on a daily basis than any other president in history. \"His commitment is unwavering and he proves that every single day,\" Ms Leavitt said. \"President Trump has bruises on his hand because he's constantly working and shaking hands all day every day,\" she said in a follow-up statement. \n                  Starmer wants defence spending announcement to impress Trump - but do the numbers stack up?\n                 \n                  Badenoch says US is acting in its national interest - and UK must do the same\n                 \n                  Day 37: Does the Macron-Trump bromance bring us closer to peace?   \n                 Read more from Sky News:Trump's optimism meets Macron's caution 👉 Follow Trump 100 on your podcast app 👈 People speculated about potential causes for the bruising on social media. On X, one person suggested Mr Trump was on blood thinners, while another said: \"Maybe, but elderly people bruise more easily than younger folks. Trump is 78. He could have gotten that in any number of ways.\" One user didn't seem to believe the White House's explanation. \"Why even lie? It's obviously an IV bruise for blood testing or something. Is it a surprise to people that Trump is old and gets regular physician visits?\" they said. In a December interview with NBC News' Meet the Press, Mr Trump said he would release his full medical report, but he has yet to do so."
    },
    {
        "title": "Couple 'forced' to sit next to dead body for hours on Qatar Airways flight",
        "description": "A couple have said they were forced to sit next to a dead body for four hours on a Qatar Airways flight.",
        "url": "https://news.sky.com/story/couple-forced-to-sit-next-to-dead-body-for-hours-on-qatar-airways-flight-13317026",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-qatar-airways-plane_6839662.jpg?20250225204859",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-25 20:37:00",
        "Headline": "One of the passengers claims there were a few spare seats but that flight attendants didn't offer to move them.",
        "Content": "A couple have said they were forced to sit next to a dead body for four hours on a Qatar Airways flight. Mitchell Ring and Jennifer Colin were travelling from Melbourne to Doha, en route to Italy, when a woman walked out the toilet and collapsed near their row about 10 hours into the journey. \"Unfortunately the lady couldn't be saved, which was pretty heartbreaking to watch,\" Mr Ring told Australia's A Current Affair programme. He added: \"They tried to wheel her up towards business class, but she was quite a large lady and they couldn't get her through the aisle.\" The pair, who were the only ones in a row of four, said flight attendants put the woman in one of the spare seats for the remaining four hours of the flight. Mr Ring told Australian media: \"They said, 'Can you move over please?'﻿ and I just said, 'Yes no problem'. \"Then they placed the lady in the chair I was in.\" \n                  Sexual slavery, starvation and shelling: How Sudan's children are being erased by war\n                 \n                  Ukraine 'agrees terms with US on minerals deal' - with no security guarantee for Kyiv\n                 \n                  Landmark moment as the return of Trump stuns UK into action on defence\n                 He said there were a few spare seats nearby but claimed crew didn't offer to move them. Read more from Sky News:Taliban says Britons' arrest is 'misunderstanding'Mystery illness kills more than 50 people in DRC Mr Ring also said he was told to stay put while medical teams removed blankets covering the woman when they landed, and that they were offered no support. In a statement to Sky's US partner network NBC News, Qatar Airways said: \"First and foremost our thoughts are with the family of the passenger who sadly passed away on board our flight. \"We apologise for any inconvenience or distress this incident may have caused, and are in the process of contacting passengers in line with our policies and procedures.\""
    },
    {
        "title": "'Puppy mountain' along Chinese river draws in tourists",
        "description": "A mountain resembling the head of a puppy has become a tourist destination along an ancient Chinese river.",
        "url": "https://news.sky.com/story/puppy-mountain-along-chinese-river-draws-in-tourists-13316636",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-puppy-mountain-yangtze-river_6839062.jpg?20250225095217",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-25 10:33:00",
        "Headline": "The mountain, which viewers say resembles a dog's head, lies along the Yangtze River - the longest in China and the third-longest in the world - and can be viewed from an observation deck.",
        "Content": "A mountain resembling the head of a puppy has become a tourist destination along an ancient Chinese river. The mountain, dubbed \"puppy mountain\", sits in the city of Yichang in central China's Hubei province - and while it has been there for some time, its popularity has skyrocketed in recent weeks thanks to a social media post. Shanghai-based designer Guo Qingshan posted a vacation photo on Valentine's Day, after noticing the mountain resembled a dog's head resting on the ground next to the Yangtze River, with its snout perched in the water. Mr Qingshan's post received 120,000 likes in 10 days on Chinese social media platform Weibo, and the hashtag #xiaogoushan - Chinese for Puppy Mountain - drew millions of views. \"It was so magical and cute. I was so excited and happy when I discovered it,\" Mr Qingshan said. \"The puppy's posture is like it's drinking water, or it's looking at some fish. It also looks like it's quietly protecting the Yangtze River,\" he said. The mountain in Yichang's Zigui County sits along the longest river in China and the third-longest river in the world, and can be viewed from an observation deck. \n                  Chinese company that set deadline for single workers to get married responds to criticism\n                 \n                  China holds live-fire exercises in Gulf of Tonkin days after Vietnam maps new territory\n                 \n                  Scientists find new virus that could infect humans in same way as COVID-19\n                 Many have since been travelling to the location to take their own photos, many bringing their dogs with them, and some have posted photos of their dogs to show off a resemblance between them and the mountain. After Mr Qingshan's post, many shared photos they had already taken in the same location, saying they had never noticed the mountain's dog-like features. Others said its form had changed over the years. One social media user on RedNote shared photos of the mountain, along with the message: \"Puppy Mountain here I am! Just stroke the puppy's head and then everything will be OK. \"We all need the eyes to see the beauty in this world.\" Yang Yang often makes the hour-and-a-half drive from her home to visit the mountain with her two-year-old grey poodle, named Yang Keyi. \"I was really happy to see the mountain,\" she said. \"I always travel with my dog if possible, so Puppy Mountain and my own little dog really match.\" Yichang resident Shi Tong posted a photo he took near the mountain in 2021, writing: \"After I saw the Puppy Mountain photo online, I tried to look up where it is. And then I realised that I have been to this place before. \"I thought it looked like a dog at that time too.\""
    },
    {
        "title": "Man caught trying to smuggle cocaine under a wig in Colombia ",
        "description": "A Colombian man has been caught trying to smuggle &#163;8,000 worth of cocaine under a wig.",
        "url": "https://news.sky.com/story/man-caught-trying-to-smuggle-cocaine-under-a-wig-in-colombia-13316620",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cocaine-wig-colombia_6839068.jpg?20250225100244",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-25 09:40:00",
        "Headline": "Footage released by police showed the wig being cut off the man's head to reveal 19 capsules of the substance, which weighed 220g.",
        "Content": " A Colombian man has been caught trying to smuggle £8,000 worth of cocaine under a wig. The drugs were discovered by police after the 40-year-old attempted to board a plane to Amsterdam, Netherlands, at Rafael Nunez International Airport. Footage released by police showed the wig being cut off the man's head to reveal 19 capsules of the substance, which weighed 220g. The man was arrested on suspicion of trafficking, manufacturing and carrying narcotic substances, the Colombian national police said. The force said the bust had affected criminal finances and \"prevented the sale of more than 400 doses of cocaine, valued at more than €10,000 (£8,296) in international markets\". Police commander, Gelver Yecid Pena Araque, said so far this year more than 450 people have been arrested for drug trafficking. Read more from Sky News:Pope Francis 'resumes some work'Jose Mourinho accused of making 'racist statements' \"We are dealing decisive blows against these criminal structures that not only fight over local drug trafficking, but are also the generators of different violent acts and other types of crimes that disrupt peace and coexistence,\" he said. \"We continue to insist on the importance of the community being our main ally, providing timely information that helps us identify and locate criminals.\""
    },
    {
        "title": "Chinese company that set deadline for single workers to get married responds to criticism",
        "description": "A company in China that introduced a policy threatening single employees with termination if they were not married by the end of September says it has withdrawn its notice.",
        "url": "https://news.sky.com/story/chinese-company-that-set-deadline-for-single-workers-to-get-married-responds-to-criticism-13316803",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-employee-worker-businessman_6839258.jpg?20250225132428",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-02-25 13:18:00",
        "Headline": "The notice warned single employees aged between 28 and 58 to \"resolve your personal marriage issues\" or \"the company will terminate your labour contract\".",
        "Content": "A company in China that introduced a policy threatening single employees with termination if they were not married by the end of September says it has withdrawn its notice. The Shuntian Chemical Group, based in eastern China's Shandong province, told its 1,200 employees last month that any unmarried workers aged between 28 and 58, including those who are divorced, were required to \"resolve your personal marriage issues\" by 30 September. \"If not completed by the first quarter, you must write a self-reflection,\" its announcement read, according to Sky News' US partner NBC News. \"If not completed by the second quarter, the company will conduct an evaluation. \"If you cannot get married and establish a family by the third quarter, the company will terminate your labour contract,\" it continued. \"Please take note.\" The notice also criticised single employees for \"not responding to the national call\" to marry and have children, accusing them of being \"disloyal and disobedient to parental advice.\" The announcement came amid the Chinese government's ongoing push to encourage younger generations to get married and have children in order to counter the country's declining birth rate. \n                  'Puppy mountain' along Chinese river draws in tourists\n                 \n                  China holds live-fire exercises in Gulf of Tonkin days after Vietnam maps new territory\n                 \n                  Scientists find new virus that could infect humans in same way as COVID-19\n                 But the chemical group's notice received backlash on social media. Read more:'Puppy mountain' along Chinese river draws in touristsMan caught using unusual technique to smuggle cocaine Chinese media reported that officials from the local human resources and social security bureau visited the company on 13 February and pointed out that the policy violated Chinese labour law. The company withdrew it by the next day. Someone from the Shuntian Chemical Group, who did not provide their name, told NBC News: \"This announcement has been withdrawn because some of the words used were inappropriate.\" The latest government data shows the number of new marriages in China fell by a fifth last year - the biggest drop on record - while the population fell in 2024 for the third consecutive year, to 1.408 billion."
    }
]