[
    {
        "title": "Trump offers ominous message on Greenland ahead of crunch talks with European leaders",
        "description": "\"You'll find out.\"",
        "url": "https://news.sky.com/story/trump-offers-ominous-message-on-greenland-and-says-starmer-gets-a-little-rough-with-him-13496909",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7141126.jpg?20260120231956",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-20 23:13:00",
        "Headline": "It was an \"extraordinary inconsistent ramble… even by his standards\" said Sky's US correspondent Mark Stone, following the US president's surprise White House news conference on Tuesday.",
        "Content": "\"You'll find out.\" That was the ominous reply from Donald Trump when asked how far he would go to wrest control of Greenland. He offered the warning at the end of a long and rambling White House news conference on Tuesday, ahead of crunch talks with European leaders in Davos, Switzerland. Trump's news conference as it happened The briefing, held to mark a year since he took office, comes at a time of unprecedented tension between the US and Europe, fuelled by Mr Trump's desire to annex Greenland. Currently, the Arctic island is part of Denmark, an ally with which the US has a defensive pact, yet the president hasn't ruled out seizing it by force. Trump claims 'things are going to work out' Asked again whether he would endanger NATO by going after an ally's territory, Mr Trump doubled down on his belief that the US \"needs\" it. \"I think that we will work something out where NATO is going to be very happy, and where we're going to be very happy,\" he said. \"But we need it for security purposes, we need it for national security and even world security.\" He also said he would raise the matter at the World Economic Forum in Davos on Wednesday. \"And I think things are going to work out pretty well,\" he claimed. Starmer can 'get a little rough', says Trump So far, Mr Trump's designs on Greenland have faced vocal opposition from his NATO allies. When several European nations contributed troops to a reconnaissance mission in Greenland, he took it as a provocation. In response, he threatened the countries with 10% tariffs from 1 February, raising to 25% from 1 June, unless the US is allowed to buy the territory. Read more:What Trump's tariff threat means for Europe Against this backdrop, British Defence Secretary John Healey will travel to Copenhagen on Wednesday to meet his Danish counterpart Troels Lund Poulsen. While Mr Trump was positive when asked how he gets on with his British and French counterparts, he said Sir Keir Starmer and Emmanuel Macron - who have criticised his tariffs threat - \"get a little bit rough when I'm not around\". \"But when I'm around they treat me very nicely,\" he added. It comes after Mr Trump attacked Sir Keir's deal to hand over the Chagos Islands to Mauritius, despite having backed it just last year. Read more:What is the Chagos deal? He also used the occasion to address Venezuela, whose president Nicolas Maduro was abducted by the US in a raid on Caracas this month. Mr Trump said his administration had taken 50 million barrels of oil out of the South American country so far, and that it would bring down prices in the US. And he once again aired his grievances about not receiving a Nobel Peace Prize, saying he'd \"lost a lot of respect for Norway\" over the matter. But most of the briefing was concerned with singing his own praises, darting from subject to subject for nearly two hours. It was an \"extraordinary inconsistent ramble... even by his standards\" said Sky's US correspondent Mark Stone. \"The right-wing US news networks stuck with it, but others moved on, skipping the monologue, dipping back only for the questions,\" Stone said. He continued: \"I'd argue that his ramblings - today more than any day - are on a different level from what we saw with Biden. \"The numerous conservative policy achievements - job numbers up, immigration down, crime down - are lost behind the ramble.\""
    },
    {
        "title": "Driver killed and 37 injured after train derails near Barcelona",
        "description": "A train driver has been killed and 37 people injured after a commuter train derailed near Barcelona.",
        "url": "https://news.sky.com/story/driver-killed-and-20-injured-after-train-derails-near-barcelona-13496913",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-emergency-crews-spain_7141155.jpg?20260121004021",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-20 23:27:00",
        "Headline": "The accident occurred just two days after a train collision killed 42 people in southern Spain and injured dozens more.",
        "Content": "A train driver has been killed and 37 people injured after a commuter train derailed near Barcelona. A retaining wall \"collapsed on to the tracks\", causing the incident, the region's civil protection agency said on social media. The accident occurred just two days after a train collision killed 42 people in southern Spain and injured dozens. Following Tuesday's incident, 20 ambulances were dispatched to the site near Gelida, on the outskirts of Barcelona, along with 38 firefighter units, emergency services said. Four people were seriously injured, Claudi Gallardo, inspector at the Catalonia regional fire department, said in televised comments. The train was travelling south between Gelida and Sant Sadurni d'Anoia, according to Spanish newspaper El Mundo. The injured have been taken to the Moises Broggu, Bellvitge, and Vilafranca hospitals, the newspaper reports. Catalonia's fire service confirmed \"no one remained inside\" the train carriages after conducting a review of the site. \"We are reviewing the underside of the train and conducting a sweep of the area to rule out any further victims,\" it said on X. \"We continue securing the area to work safely.\" Spanish Prime Minister Pedro Sanchez acknowledged the Barcelona area crash, posting on X: \"All my affection and solidarity with the victims and their families.\" Read more from Sky News:Spain mourns for train crash victimsSurfer 'lucky to survive' shark attack Spain's railway operator ADIF said the containment wall likely collapsed due to heavy rainfall across the northeastern Spanish region this week. Commuter train services were cancelled along the line, it added. The accident occurred in a region that has struggled for a long time with underfunded rail services and ‌frequent incidents, according to Reuters."
    },
    {
        "title": "Inside the new breed of 'zero bills' homes where you pay nothing for your energy",
        "description": "Elliott Wood has something you're probably going to want.",
        "url": "https://news.sky.com/story/what-cost-of-living-crisis-why-elliott-pays-absolutely-nothing-to-power-his-home-13496916",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-victoria-seabrook-elliott-wood_7141165.png?20260121013419",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-20 23:33:00",
        "Headline": "The government's long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. Is this a realistic vision of the future?",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Elliott Wood has something you're probably going to want. Like most of us, every month he gets a bill for his monthly energy use. Only his bill… is free. He's living in a new breed of \"zero bills\" homes, which comes with solar panels, heat pumps and batteries. Together, that technology generates more electricity than Elliot uses. When combined with the right tariff - in his case a zero bills tariff with Octopus Energy - the excess electricity is sold back to the grid, and his bill comes in at a princely sum of £0 a month. \"It's amazing… you just don't have to worry,\" says 26-year-old Elliott, who lives in a one-bedroom rental house with his partner in Milton Keynes. \"There is no stress at the end of each month, [wondering] 'have we had too many showers, has the heating been on too much, have we used the microwave too many times?'\" The zero bills scheme does come with a few caveats: the tariff is only guaranteed for five to 10 years, and it doesn't include electric vehicle charging. But Octopus estimates it will save an average household of two to three beds approximately £1,758 a year on bills, based on current Ofgem price cap rates. Now for the bad news… But only a few hundred of these homes are up and running, meaning for most of us, the zero bill home remains a pipe dream. In fact Britain has some of the most leaky, drafty and gas reliant homes in Western Europe - and that's a major vulnerability. Approximately 85% of homes rely on gas for heating, more than half of which we import, only for some of that hard work to go to waste as the heat drifts out through uninsulated Victorian brickwork. That means cold, damp homes that are expensive to run, leaving a staggering 2.7m UK households living in fuel poverty. Housing and buildings are also the second biggest polluting sector in the UK, after transport, something that must fall if the country is to hit its climate targets. Quest to upgrade Britain's homes The government aims to tackle all these problems in one fell swoop. Its long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. The £14.7bn strategy will pay for measures like insulation, solar panels, batteries, and heat pumps that can lower bills and cut gas use. These won't see bills falls to zero, like Elliott's, but ministers say it could slash some bills by several hundred pounds. Ministers says the plan will upgrade five million homes and lift \"up to\" one million families out of fuel poverty by 2030. If done well, upgrading homes is an effective way to slash bills and reduce damp, and campaigners and industry have broadly welcomed the idea. But previous attempts to upgrade homes have tried and failed. It's not clear how officials can enforce landlords to upgrade properties, or who to trust to insulate homes, or whether electricity costs will come down enough to truly reap the benefits of a heat pump. Energy UK's CEO Dhara Vyas said: \"Supporting better access to clean heat systems, solar panels, batteries, and insulation will help millions of households across the UK bring down their energy bills. But she said to \"ensure the plan realises its full potential, it will be important to tackle the factors that currently make electricity artificially expensive.\" The key to the cost of living crisis? As more people get off gas heating and on to electric heat pumps, it should also reduce the UK's imports of gas. The government sees a geopolitical value in weaning the country off gas it has to buy from abroad, as opposed to clean power it can harness at home - albeit using Chinese components. First it wanted to reduce reliance on Russia, but now even buying gas from the US has taken on a new risk with a less predictable president in the White House. No one in government would say that out loud, yet, but who knows what levers Donald Trump might pull on Europe to get his way on Greenland. And while reducing energy imports is good for security, there's a risk that with fewer people paying gas bills, those left will shoulder higher costs to keep the system running. Read more from Sky News:Trump's ominous Greenland messageStarmer's biggest crisis could be closer to home On top of that, the Warm Homes plan is still just a plan - and previous attempts to deliver have failed. But the government has staked its reputation on easing the cost of living and slashing household bills. Prime Minister Sir Keir Starmer said: \"This is a government bearing down on the cost-of-living crisis… giving people the security and the fair shot they need to get on in life.\" That claim will be judged largely on whether this new plan to upgrade homes sinks or swims."
    },
    {
        "title": "Beth Rigby: Forget Greenland for now, Starmer's biggest crisis could be closer to home",
        "description": "Sir Keir Starmer was not meant to be doing an emergency news conference on the Greenland crisis in the Downing Street briefing room on Monday.",
        "url": "https://news.sky.com/story/beth-rigby-starmers-bigger-crisis-could-be-closer-to-home-and-may-decide-his-fate-13496816",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-downing-street_7141156.png?20260121004658",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-20 21:11:00",
        "Headline": "While the prime minister focuses on foreign affairs, his deputy Labour leader has a message for those frustrated with his performance back home. But voters will soon have their say, and it looks ominous.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer was not meant to be doing an emergency news conference on the Greenland crisis in the Downing Street briefing room on Monday. The prime minister was meant to be about 200 miles away, delivering a speech much closer to voters' concerns around household budgets and what this Labour government is doing to try to help. 2026 was supposed to be the year in which he tried to win back disillusioned voters - and MPs - with a big push to cut the cost of living, be it around rail fares, energy bills, childcare or lifting the two-child benefit cap. Instead, he has found his agenda blown wildly off course by the whirlwind that is Donald Trump. But what matters on the global stage affects voters at home: tariffs will hurt the economy and could cost jobs. Conflicts drive up costs, be it in your shopping basket or heating your home. As the prime minister put it on Monday when he called out Trump on his tariff threat over Greenland: \"In today's world geopolitics is not something that happens somewhere else…when instability grows it's rarely those with the most power who pay the price… we must use every tool of government, domestic and international, to fight for the interests of ordinary people, tackling the cost of living today also means engagement beyond our borders.\" As Starmer does that, deputy Labour leader Lucy Powell is taking on the role of \"campaigner in chief\" for the party ahead of the May elections. Because as global crises keep rolling, Labour could be running into a polling crisis at home. Later this year, Labour will be contesting 4,000 council seats, representing 20 million voters, plus Scotland's Holyrood and Wales's Senedd. They come with the party trailing Reform and the Conservatives on 17% of the vote. It is a perilous predicament in what looks set to be a bloody set of elections which could see Labour pushed into third place behind Reform in Scotland and Wales, where Labour could control of the Senedd for the first time ever. The resignation of first minister and Welsh Labour leader Eluned Morgan would surely come shortly after if that becomes Welsh Labour's fate. But Powell, MP for Manchester Central, who became deputy leader in November, doesn't seem daunted by the task. The core message When I meet her in a community centre of her patch run by the Manchester Settlement, she has a clear message for her party: Labour must focus relentlessly on what matters to voters and get behind Starmer. \"The cost of living crisis and cost of living issues are absolutely in the fore of everyone's mind, and I think it's important for us as politicians […] to just constantly remind ourselves that for most people, they're struggling to pay their rent, they're struggling with their housing costs, they're struggling to pay the bills,\" she said. \"I think people really want to know we are on their side and working every single day as a government to rewire the country and reshape the economy so that life works better for them. I just don't know that we have really pulled it together more strongly as a story.\" Read more from Sky News:Beth Rigby: I've never seen PM look so graveEverything we know about China's new super-embassyWill EU unleash its most powerful trade weapon? 'Worst of all worlds' if Labour turn on PM Part of Powell's job is to remedy that - and the deputy leader is proving more loyal to the leadership than many of her colleagues had perhaps expected. The soft left Labour MP was sacked from the cabinet by Starmer and was not the leadership's choice in the battle to replace Angela Rayner. There were many who thought she would be a constant thorn in Starmer's side, but instead her message to colleagues is to \"not undermine Keir, not undermine ourselves\". \"I do think that's probably counter-intuitive for some people to see me saying that, because obviously part of my election was [because] people wanted to see us change a bit and have a course correction and do better than what we've been doing - and that is the mandate I've got,\" she admitted. \"But I strongly believe we're not going to do that if we all turn in on ourselves and have months and months and months of this constant speculation, that's the worst of all worlds. \"The Tories changed the prime minister three times in three months, and it didn't change the outcome for them at the election one jot. If we don't tell our story ourselves, no one is going to do it and that's what we've got to do.\" Who might challenge Starmer? Powell tells me Starmer will lead the party after the May elections and will be leading Labour into the next election. That she of course cannot know. But what is ringing clear in our conversation is her call for unity. It comes at a febrile time, with chatter over a possible Wes Streeting leadership bid constant as the briefings and counter-briefings roll on between Starmer supporters and allies of the health secretary. Streeting is constantly referenced by MPs as a politician with the ambition, network and funding to mount a leadership bid. Some MPs tell me it is in Streeting's interests to go sooner rather than later as the two obvious left candidates - Angela Rayner and Andy Burnham - are not ready for a challenge should it come (the former needs to get her tax situation solved and then rebuild, the latter lacks a seat in parliament). The upshot is that \"will he, won't he\" is a constant refrain in Labour circles. All of this reflects the difficult predicament Starmer is in. The situation got so bad in the run-up to Christmas, the PM's allies felt it necessary to tell MPs he would stay on and fight any rival rather than fold. That a PM was forced to say that just 18 months into his premiership, on the back of a landslide victory, was both astonishing and a reflection of just how bad things for this government had become. Foreign affairs to the rescue? But there is also huge reticence, anxiety even, about trying to turf out a sitting prime minister. As one cabinet minister put it to me last week: \"Changing the leader is a bit Tory for me. \"If we try to change the leader, the party will end up tacking to the left and that is not Labour's problem with the country, so it won't be the solution. It's probably better to try to work on making Keir Starmer better.\" The international crisis also helps Starmer, as attentions turn from domestic politics to managing the most serious rift in the transatlantic relationship in decades. As fellow party leaders fell in behind Starmer on his position on Greenland, it helped him look statesmanlike: this grave chapter in geopolitics is not a moment in which a rival would mount a leadership bid. In the meantime, Starmer will no doubt soon be back out and about, touring the country rather like he did during the 2024 election. The five pledges, six pillars and three foundations of this government - remember those? - have been buried in favour of a focus on the cost of living. As part of this, the government is now quickly ditching policies that are unpopular or distract from the core cost of living message. In Westminster parlance, this is known - to quote the former Conservative election chief Lynton Crosby - as \"scraping the barnacles off the boat\". The decision to water down the farms tax, business rates on pubs and ditch compulsory digital IDs has seen ministers get a battering in news studios for U-turns (and yes it does roil backbench MPs), but it is a short-term hit senior party figures think is worth taking. \"I think less is more,\" Powell tells me. \"I think people want to see a clearer agenda that they can connect to and that they see. And I think sometimes when you first come into government, there is this attraction of 'let's try to manage everything and do everything'. \"And you know, politics is painted in primary colours, our colour is red. Let's paint in that colour, let's paint in our primary colours and leave the kind of managing of things to other people whose job that is.\" Read more:Every Labour U-turn as Starmer rolls back on digital IDFarmers celebrate U-turn on inheritance taxSupport package for pubs expected shortly On U-turns, Powell concedes it \"would be much better to do a lot of that thinking and get things right beforehand\" - but the crux of the Labour challenge in 2026 is the government has to deliver. From Number 10 to new MPs, everyone in Labour agrees that voters - who were promised change in 2024 - need to begin to feel better off. Starmer is acutely aware that people haven't felt personally better off or seen public services improving since the 2008 financial crash, and saying it will get better isn't cutting much ice. \"People won't believe it until they feel it,\" is how one cabinet minister put it to me. To that end, there will be much more activity around cutting costs and improving the NHS, which Labour see as a proxy in voters' minds for better public services. There will be, I suspect, more barnacles off the boat, as Labour look to lessen the noise in the party and Westminster and campaign into the May elections and beyond. The government might delay reform of jury trails - the legislation is planned for March - in order to avoid a showdown with some of its backbenches. There will be many that see it as weakness from Starmer, but this is a PM who wants to dial the noise down in order to try to push Labour's dismal polling ratings up. It is a perhaps insurmountable task for a PM being tested to his limits at home and abroad. May will be a huge ballot box test for the Starmer administration - and could well determine his fate with his party."
    },
    {
        "title": "Woman says she 'begged for pain relief but was told no' - amid national call for birth stories",
        "description": "Women and families are being asked to share their maternity stories in a national call for action.",
        "url": "https://news.sky.com/story/woman-says-she-begged-for-pain-relief-but-was-told-no-amid-national-call-for-birth-stories-13496758",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kelly-redhead-maternity-crisis_7140809.jpg?20260120173950",
        "type": "Home",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2026-01-20 17:51:00",
        "Headline": "Kelly Redhead, whose daughter Harper lived for less than half-an-hour after being born at 18 weeks, hopes other women share their stories to help the national maternity investigation.",
        "Content": "By Laura Bundock, health correspondent  Women and families are being asked to share their maternity stories in a national call for action. Warning: This article contains details some may find distressing The findings will help inform the National Maternity and Neonatal Investigation (NMNI),which is being led by Baroness Amos. She told Sky News she understands many women have \"lost faith\" in the system but wants them to take part to ensure positive change can happen.  Kelly Redhead's daughter Harper lived for less than half-an-hour. She was born prematurely at 18 weeks and three days. \"She was laid on my chest and there was a beam of light coming in through the window… and I could just see her chest moving up and down and I watched until it wasn't,\" she said. \n                  Finger prick blood test trial 'could revolutionise' Alzheimer's diagnosis, say experts\n                 \n                  Call for urgent Holyrood statement after Glasgow health board's hospital infections admission\n                 \n                  Doctors warn of 'horrific' impact of tech and devices on children and young people's health\n                 Days earlier, Kelly had known something was wrong. But her medical team sent her home. \"I was begging for pain relief at this point because of how much pain I was in. And I was told 'no, you can't have anything'.\" Kelly was carrying an infection which led to pelvic inflammatory disease, sepsis and pre-term labour. \"When she said, 'I'm really sorry Kelly, your cervix is opening', I just remember screaming at my mum, saying 'no'. Because I knew if I gave birth to Harper, she wouldn't survive.\" Kelly keeps a memory box for Harper, containing scan photos and prints of her tiny hands and feet. She says she will never be the same again. Leeds Teaching Hospitals was responsible for Kelly's care and is facing its own independent inquiry. It welcomes the national call for evidence. The trust's deputy chief medical officer, Dr Elizabeth Garthwaite, said: \"We are truly sorry that Kelly did not feel listened to about her concerns during her pregnancy, and we offer our sincere condolences to Kelly and her family for their sad loss of baby Harper.\" The national review was ordered by Health Secretary Wes Streeting, following a series of scandals. Sky News has been highlighting the issues and speaking to many mothers about their birth trauma. Kelly still struggles with her loss and has suffered from post-natal depression and PTSD. But she thinks women should share their stories, if only to highlight how badly the system is failing. Read more on birth stories:Feeling ignored, bad staff behaviour, long-term trauma: Your maternity experiences \"I will be filling it in because we all have voices and as lost mums and lost families and lost parents and siblings, we deserve to be heard.\" The call for evidence will be open until 17 March. If you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853, emailing maternitystories@sky.uk or using 'Your Report' on the Sky News app."
    },
    {
        "title": "Will Brooklyn regret launching a grenade at Brand Beckham?",
        "description": "It had been a while&#160;since&#160;we'd&#160;seen the whole Beckham family out together.",
        "url": "https://news.sky.com/story/will-brooklyn-regret-launching-a-grenade-at-brand-beckham-13496724",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckham-david-beckham_7140029.jpg?20260119210741",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2026-01-20 16:53:00",
        "Headline": "In a long statement on Instagram, the 26-year-old said he was \"standing up for myself for the first time in my life\".",
        "Content": "\n          Arts and entertainment correspondent\n       It had been a while since we'd seen the whole Beckham family out together. And while the tabloids had picked up last year on the fact that their eldest child had been noticeably missing from family photo-ops, few could have foreseen how Brooklyn would briefly break the internet. Will their eldest child come to regret the fallout? Had he really thought it through? The carefully worded references to his parents \"performative social media posts\", the \"inauthentic relationships…a fixture of the life I was born into\" certainly feels like words that weren't casually dashed off in the heat of the moment. Moreover, he was waiting for the right moment to press send. Read more:In full: Brooklyn Beckham's explosive statementSir David Beckham snubs question about Brooklyn in Davos There are of course two sides to every story and we're yet to hear his parents' take. But it's worth noting that behind the scenes the Beckhams have patently done quite a bit to try to launch their son's career. As a wannabe photographer, were it not for his surname, he likely wouldn't have secured a book deal with Penguin for his photographs. With journalists around the world reaching out to the Beckhams for comment, so far the couple has said nothing. Anything other than silence arguably lends weight to Brooklyn's argument that what they say is carefully stage-managed. \n                  Sir David Beckham refuses to answer Sky News questions in Davos\n                 \n                  Brooklyn Peltz Beckham 'doesn't want to reconcile with family'\n                 \n                  Prince Harry's privacy case is 'threadbare' and journalist sources were legitimate, lawyer for Mail publisher tells High Court\n                 So for now, Sir David's interview with CNBC in Davos might just be the closest we get to understanding what his parents are thinking. Said under the guise of how young people use social media, Sir David's reference to children being \"allowed to make mistakes, that's how they learn\" is seemingly rather telling right now. But of course this isn't a small mistake. Brooklyn's claims are akin to a grenade being thrown at the notoriously polished Brand Beckham."
    },
    {
        "title": "Child serial killer Lucy Letby will face no further criminal charges",
        "description": "Child serial killer Lucy Letby will not face criminal charges in relation to further allegations of deaths and non-fatal collapses of babies.",
        "url": "https://news.sky.com/story/child-serial-killer-lucy-letby-will-face-no-further-criminal-charges-13496666",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lucy-letby-child-killer_7140713.jpg?20260120154902",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-20 14:27:00",
        "Headline": "Prosecutors say the new information they had received from police did not meet the \"evidential test\" to pursue further criminal charges against the former nurse. But police have hit back saying the evidence met the \"charging standard\".",
        "Content": "Child serial killer Lucy Letby will not face criminal charges in relation to further allegations of deaths and non-fatal collapses of babies. The Crown Prosecution Service said on Tuesday the extra information it had received from police had not met \"the evidential test\". Letby was sentenced to 15 whole-life terms for murdering seven babies and attempting to murder seven others on a hospital neonatal unit between June 2015 and June 2016. Frank Ferguson, head of the CPS Special Crime and Counter Terrorism Division, said: \"We received a file of evidence from Cheshire Constabulary in July 2025 asking us to consider further allegations against Lucy Letby, 36, relating to deaths and non-fatal collapses of babies at the Countess of Chester Hospital and Liverpool Women's Hospital. \"Following a thorough review of that evidence, we have decided that no criminal charges should be brought in respect of those further allegations.\" Mr Ferguson said the decision not to pursue further charges had been made \"independently, based on the evidence and in line with our legal test\". \"The Crown Prosecution Service considered offences of murder and attempted murder in respect of two infants who died and attempted murder in respect of seven infants who survived,\" he said. \"We concluded that the evidential test was not met in any of those cases.\" In a rare public response, Cheshire Constabulary said the decision was \"not the outcome that we had anticipated throughout our investigation\". \"We believed the evidence submitted met the Crown Prosecution Service charging standard,\" the force said. \"The CPS did not agree and despite our representations we must respect the decision that has been made. \"There will be some who will feel that this is news worth celebrating. \"We do not share this view and would ask that people respect the privacy and feelings of the families involved.\" The former nurse, who has always maintained her innocence, lost two bids last year to challenge her convictions at the Court of Appeal. A group of campaigners have been backing Letby and have submitted reports to the Criminal Cases Review Commission in an attempt to overturn her convictions. Read more from Sky News:Russell Brand appears in court via video link to face further chargesBrooklyn Peltz Beckham 'doesn't want to reconcile with family' Letby's barrister, Mark McDonald, said: \"Lucy Letby has always maintained her innocence - she has never hurt a child and never would. \"It is vital that the case is now referred back to the Court of Appeal as a matter of urgency. \"Thirty-one reports have been submitted to the CCRC, compiled by 26 internationally renowned experts, which provide overwhelming evidence that no babies were murdered.\" Tory MP Sir David Davis, who has repeatedly called for Letby to be retried, said on X: \"The CCRC must conclude its review quickly and refer the case to the Court of Appeal. \"It has long been my view that any retrial in Lucy Letby's case should happen as quickly as possible.\" Lawyer Tamlin Bolton, who represents several families of babies Letby has been convicted of harming or killing, said: \"While we note today's decision our focus remains on supporting those families we represent access the specialist and support and therapies they require.\" \"There may well be other families upset at today's decision,\" she said. \"It's important that families with serious concerns about what happened to their babies are now supported so they can receive the answers they deserve.\""
    },
    {
        "title": "Sir David Beckham refuses to answer Sky News questions in Davos",
        "description": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos.",
        "url": "https://news.sky.com/story/sir-david-beckham-refuses-to-answer-sky-news-questions-in-davos-13496537",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-beckham-davos_7140314.jpg?20260120095443",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-20 09:53:00",
        "Headline": "Sir David was asked if he had a message for his son and if he was disappointed that family business was being aired in public.",
        "Content": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos. On Tuesday, Brooklyn Peltz Beckham broke his silence about his estrangement from his parents, saying in a post on social media he does not want to reconcile with his family. Asked about his son's statement in Switzerland on Tuesday by Sky News business correspondent Paul Kelso, Sir David refused to comment. He was asked if he had a message for his son and if he was disappointed that family business was being aired in public. In a statement shared on his Instagram story, Brooklyn offered his explanation for the alleged rift. The 26-year-old wrote: \"I have been silent for years and made every effort to keep these matters private. \"I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life. \"All we want [is] peace, privacy and happiness for us and our future family.\" Read more:What Brooklyn's claims tell us about the Beckham rift Brooklyn, the eldest son of footballer Sir David and former Spice Girl Victoria Beckham, married Nicola Peltz in 2022. She is the daughter of American billionaire businessman Nelson Peltz and former model Claudia Heffner Peltz. The couple live together in Los Angeles. Sir David, who is now co-owner of Inter Miami CF and has made millions from endorsements and commercial partnerships, was in Davos recording a podcast. 'Children are allowed to make mistakes' Speaking about the economy and the sports business with CNBC, Sir David was also asked about young people and social media use. Pointing to his role as goodwill ambassador for UNICEF, as well as his relationship with his own children, he said: \"I've been able to use my platform and following for UNICEF, and it's been the biggest tool to make people aware of what's going on around the world for children. \"I've tried to do the same with my children, to educate them, they make mistakes. Children are allowed to make mistakes, that's how they learn... but you know you have to sometimes let them make those mistakes as well.\" 'Posh and Becks' - Britain's best known power couple The former midfielder received his knighthood for his services to sport and charity from the King at an investiture ceremony at Windsor Castle in November. He married his wife, Victoria, who is now a fashion designer and businesswoman, in 1999. Thanks to a combination of sports and entertainment credentials paired with savvy business instincts, \"Posh and Becks\" quickly became Britain's best-known power couple. They have four children together: three sons, Brooklyn, Romeo, 23, and Cruz, 20, and one daughter, Harper, 14. Read more:Nicola Peltz Beckham denies 'feud'Victoria awarded prize from daughterSir David Beckham gets knighthood There has been widespread media speculation about a rift in the Beckham family since Brooklyn's wedding to Nicola Peltz in 2022, but Brooklyn's six-page statement, shared with his 16.1 million followers, is the first public acknowledgement of any bad blood. It's been widely reported that Brooklyn did not attend his dad's 50th birthday celebrations in May. Brooklyn now claims he was in the UK, but that his dad only agreed to see him under the condition that his wife was not invited. I have been silent for years and made every effort to keep these matters private. Unfortunately my parents and their team have continued to go to the press, leaving me with no choice but to speak for myself and tell the truth about only some of the lies that have been printed. I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life.' For my entire life, my parents have controlled narratives in the press about our family. The performative social media posts, family events and inauthentic relationships have been a fixture of the life I was born into. To read the full statement, click or tap here. 'Overexplaining would most definitely backfire,' says celebrity crisis expert Laura Beeching, the founder of the crisis management agency Honest London told Sky News she would not expect the Beckhams to comment on Brooklyn's posts in a hurry. \"Silence is definitely key here. Anything more than a minimal response risks reinforcing what Brooklyn's argument is that everything is managed and strategic,\" she said. \"I would suggest no explanation, no rebuttal, no expansion, because overexplaining it would most definitely backfire. As you can see in Brooklyn's very long statement, it's very emotional. \"[I tell my clients] less is more when it comes to statements, because every actual word you put into a statement, that's another thing that people can analyse and dissect. Even down to the wedding dress comment that [Brooklyn] put out. \"People have already disputed that with what was written in Vogue back in 2022, I believe, and that's the issue when you go to detail. I would be very shocked at the Beckhams speaking out on this.\" The Beckham family are yet to publicly respond to Brooklyn's posts, but have shared promotional posts for Cruz's first music gig at the Courtyard Theatre in east London in March. Meanwhile, Nicola Peltz has not commented on social media, instead sharing tributes to late fashion designer Valentino in her Instagram stories. Sky News has contacted David and Victoria Beckham for comment."
    },
    {
        "title": "Teenage boy stabbed to death in Surrey woodland",
        "description": "A 15-year-old boy has been stabbed to death in a woodland near a park in Surrey.",
        "url": "https://news.sky.com/story/teenage-boy-stabbed-to-death-in-surrey-woodland-13496740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-car-police-tape_6916669.jpg?20250514222100",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-20 17:26:00",
        "Headline": "Officers have urged witnesses to come forward \"as a matter of urgency\", and the leader of the local council described the death as \"utterly devastating\".",
        "Content": "A 15-year-old boy has been stabbed to death in a woodland near a park in Surrey. Officers were called to reports of a stabbing off Lido Road in Stoke Park, Guildford, around 6.10pm on Monday. They attended along with fire and ambulance crews, but the boy was pronounced dead at the scene. Speaking on Tuesday afternoon, Detective Chief Superintendent Debbie White of Surrey Police asked witnesses to come forward \"as a matter of urgency\". She went on: \"We appreciate that this incident will have caused shock and concern amongst our local communities, and we want to reassure you that we are working at pace to establish the circumstances of the boy's death, gather as much evidence as possible and identify those responsible. \"Although the circumstances of the boy's death are not clear at this time, this is a fast-moving investigation, and we are pursuing a number of lines of inquiry. \"We would ask that people don't speculate about what might have happened while we work through these inquiries. \"A police cordon remains in place, and we respectfully ask that people stay away from the area while we carry out our investigation. \"A significant police presence will remain in the area for some time.\" Read more from Sky News:Beckham refuses to answer questions on BrooklynLucy Letby to face no further criminal charges A cordon has been placed around the wooded area known as Peacock Wood and Wild Wood Adventure, as well as the end of the car park on Lido Road. The nearby A25 is not affected. Julia McShane, leader of Guildford Borough Council, added: \"I am shocked and saddened at this tragic event. \"The loss of a young life in this way is utterly devastating. \"My heart goes out to their family and friends at this desperately sad time.\""
    },
    {
        "title": "Inside the new breed of 'zero bills' homes where you pay nothing for your energy",
        "description": "Elliott Wood has something you're probably going to want.",
        "url": "https://news.sky.com/story/what-cost-of-living-crisis-why-elliott-pays-absolutely-nothing-to-power-his-home-13496916",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-victoria-seabrook-elliott-wood_7141165.png?20260121013419",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-20 23:33:00",
        "Headline": "The government's long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. Is this a realistic vision of the future?",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Elliott Wood has something you're probably going to want. Like most of us, every month he gets a bill for his monthly energy use. Only his bill… is free. He's living in a new breed of \"zero bills\" homes, which comes with solar panels, heat pumps and batteries. Together, that technology generates more electricity than Elliot uses. When combined with the right tariff - in his case a zero bills tariff with Octopus Energy - the excess electricity is sold back to the grid, and his bill comes in at a princely sum of £0 a month. \"It's amazing… you just don't have to worry,\" says 26-year-old Elliott, who lives in a one-bedroom rental house with his partner in Milton Keynes. \"There is no stress at the end of each month, [wondering] 'have we had too many showers, has the heating been on too much, have we used the microwave too many times?'\" The zero bills scheme does come with a few caveats: the tariff is only guaranteed for five to 10 years, and it doesn't include electric vehicle charging. But Octopus estimates it will save an average household of two to three beds approximately £1,758 a year on bills, based on current Ofgem price cap rates. Now for the bad news… But only a few hundred of these homes are up and running, meaning for most of us, the zero bill home remains a pipe dream. In fact Britain has some of the most leaky, drafty and gas reliant homes in Western Europe - and that's a major vulnerability. Approximately 85% of homes rely on gas for heating, more than half of which we import, only for some of that hard work to go to waste as the heat drifts out through uninsulated Victorian brickwork. That means cold, damp homes that are expensive to run, leaving a staggering 2.7m UK households living in fuel poverty. Housing and buildings are also the second biggest polluting sector in the UK, after transport, something that must fall if the country is to hit its climate targets. Quest to upgrade Britain's homes The government aims to tackle all these problems in one fell swoop. Its long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. The £14.7bn strategy will pay for measures like insulation, solar panels, batteries, and heat pumps that can lower bills and cut gas use. These won't see bills falls to zero, like Elliott's, but ministers say it could slash some bills by several hundred pounds. Ministers says the plan will upgrade five million homes and lift \"up to\" one million families out of fuel poverty by 2030. If done well, upgrading homes is an effective way to slash bills and reduce damp, and campaigners and industry have broadly welcomed the idea. But previous attempts to upgrade homes have tried and failed. It's not clear how officials can enforce landlords to upgrade properties, or who to trust to insulate homes, or whether electricity costs will come down enough to truly reap the benefits of a heat pump. Energy UK's CEO Dhara Vyas said: \"Supporting better access to clean heat systems, solar panels, batteries, and insulation will help millions of households across the UK bring down their energy bills. But she said to \"ensure the plan realises its full potential, it will be important to tackle the factors that currently make electricity artificially expensive.\" The key to the cost of living crisis? As more people get off gas heating and on to electric heat pumps, it should also reduce the UK's imports of gas. The government sees a geopolitical value in weaning the country off gas it has to buy from abroad, as opposed to clean power it can harness at home - albeit using Chinese components. First it wanted to reduce reliance on Russia, but now even buying gas from the US has taken on a new risk with a less predictable president in the White House. No one in government would say that out loud, yet, but who knows what levers Donald Trump might pull on Europe to get his way on Greenland. And while reducing energy imports is good for security, there's a risk that with fewer people paying gas bills, those left will shoulder higher costs to keep the system running. Read more from Sky News:Trump's ominous Greenland messageStarmer's biggest crisis could be closer to home On top of that, the Warm Homes plan is still just a plan - and previous attempts to deliver have failed. But the government has staked its reputation on easing the cost of living and slashing household bills. Prime Minister Sir Keir Starmer said: \"This is a government bearing down on the cost-of-living crisis… giving people the security and the fair shot they need to get on in life.\" That claim will be judged largely on whether this new plan to upgrade homes sinks or swims."
    },
    {
        "title": "Beth Rigby: Forget Greenland for now, Starmer's biggest crisis could be closer to home",
        "description": "Sir Keir Starmer was not meant to be doing an emergency news conference on the Greenland crisis in the Downing Street briefing room on Monday.",
        "url": "https://news.sky.com/story/beth-rigby-starmers-bigger-crisis-could-be-closer-to-home-and-may-decide-his-fate-13496816",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-downing-street_7141156.png?20260121004658",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-20 21:11:00",
        "Headline": "While the prime minister focuses on foreign affairs, his deputy Labour leader has a message for those frustrated with his performance back home. But voters will soon have their say, and it looks ominous.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer was not meant to be doing an emergency news conference on the Greenland crisis in the Downing Street briefing room on Monday. The prime minister was meant to be about 200 miles away, delivering a speech much closer to voters' concerns around household budgets and what this Labour government is doing to try to help. 2026 was supposed to be the year in which he tried to win back disillusioned voters - and MPs - with a big push to cut the cost of living, be it around rail fares, energy bills, childcare or lifting the two-child benefit cap. Instead, he has found his agenda blown wildly off course by the whirlwind that is Donald Trump. But what matters on the global stage affects voters at home: tariffs will hurt the economy and could cost jobs. Conflicts drive up costs, be it in your shopping basket or heating your home. As the prime minister put it on Monday when he called out Trump on his tariff threat over Greenland: \"In today's world geopolitics is not something that happens somewhere else…when instability grows it's rarely those with the most power who pay the price… we must use every tool of government, domestic and international, to fight for the interests of ordinary people, tackling the cost of living today also means engagement beyond our borders.\" As Starmer does that, deputy Labour leader Lucy Powell is taking on the role of \"campaigner in chief\" for the party ahead of the May elections. Because as global crises keep rolling, Labour could be running into a polling crisis at home. Later this year, Labour will be contesting 4,000 council seats, representing 20 million voters, plus Scotland's Holyrood and Wales's Senedd. They come with the party trailing Reform and the Conservatives on 17% of the vote. It is a perilous predicament in what looks set to be a bloody set of elections which could see Labour pushed into third place behind Reform in Scotland and Wales, where Labour could control of the Senedd for the first time ever. The resignation of first minister and Welsh Labour leader Eluned Morgan would surely come shortly after if that becomes Welsh Labour's fate. But Powell, MP for Manchester Central, who became deputy leader in November, doesn't seem daunted by the task. The core message When I meet her in a community centre of her patch run by the Manchester Settlement, she has a clear message for her party: Labour must focus relentlessly on what matters to voters and get behind Starmer. \"The cost of living crisis and cost of living issues are absolutely in the fore of everyone's mind, and I think it's important for us as politicians […] to just constantly remind ourselves that for most people, they're struggling to pay their rent, they're struggling with their housing costs, they're struggling to pay the bills,\" she said. \"I think people really want to know we are on their side and working every single day as a government to rewire the country and reshape the economy so that life works better for them. I just don't know that we have really pulled it together more strongly as a story.\" Read more from Sky News:Beth Rigby: I've never seen PM look so graveEverything we know about China's new super-embassyWill EU unleash its most powerful trade weapon? 'Worst of all worlds' if Labour turn on PM Part of Powell's job is to remedy that - and the deputy leader is proving more loyal to the leadership than many of her colleagues had perhaps expected. The soft left Labour MP was sacked from the cabinet by Starmer and was not the leadership's choice in the battle to replace Angela Rayner. There were many who thought she would be a constant thorn in Starmer's side, but instead her message to colleagues is to \"not undermine Keir, not undermine ourselves\". \"I do think that's probably counter-intuitive for some people to see me saying that, because obviously part of my election was [because] people wanted to see us change a bit and have a course correction and do better than what we've been doing - and that is the mandate I've got,\" she admitted. \"But I strongly believe we're not going to do that if we all turn in on ourselves and have months and months and months of this constant speculation, that's the worst of all worlds. \"The Tories changed the prime minister three times in three months, and it didn't change the outcome for them at the election one jot. If we don't tell our story ourselves, no one is going to do it and that's what we've got to do.\" Who might challenge Starmer? Powell tells me Starmer will lead the party after the May elections and will be leading Labour into the next election. That she of course cannot know. But what is ringing clear in our conversation is her call for unity. It comes at a febrile time, with chatter over a possible Wes Streeting leadership bid constant as the briefings and counter-briefings roll on between Starmer supporters and allies of the health secretary. Streeting is constantly referenced by MPs as a politician with the ambition, network and funding to mount a leadership bid. Some MPs tell me it is in Streeting's interests to go sooner rather than later as the two obvious left candidates - Angela Rayner and Andy Burnham - are not ready for a challenge should it come (the former needs to get her tax situation solved and then rebuild, the latter lacks a seat in parliament). The upshot is that \"will he, won't he\" is a constant refrain in Labour circles. All of this reflects the difficult predicament Starmer is in. The situation got so bad in the run-up to Christmas, the PM's allies felt it necessary to tell MPs he would stay on and fight any rival rather than fold. That a PM was forced to say that just 18 months into his premiership, on the back of a landslide victory, was both astonishing and a reflection of just how bad things for this government had become. Foreign affairs to the rescue? But there is also huge reticence, anxiety even, about trying to turf out a sitting prime minister. As one cabinet minister put it to me last week: \"Changing the leader is a bit Tory for me. \"If we try to change the leader, the party will end up tacking to the left and that is not Labour's problem with the country, so it won't be the solution. It's probably better to try to work on making Keir Starmer better.\" The international crisis also helps Starmer, as attentions turn from domestic politics to managing the most serious rift in the transatlantic relationship in decades. As fellow party leaders fell in behind Starmer on his position on Greenland, it helped him look statesmanlike: this grave chapter in geopolitics is not a moment in which a rival would mount a leadership bid. In the meantime, Starmer will no doubt soon be back out and about, touring the country rather like he did during the 2024 election. The five pledges, six pillars and three foundations of this government - remember those? - have been buried in favour of a focus on the cost of living. As part of this, the government is now quickly ditching policies that are unpopular or distract from the core cost of living message. In Westminster parlance, this is known - to quote the former Conservative election chief Lynton Crosby - as \"scraping the barnacles off the boat\". The decision to water down the farms tax, business rates on pubs and ditch compulsory digital IDs has seen ministers get a battering in news studios for U-turns (and yes it does roil backbench MPs), but it is a short-term hit senior party figures think is worth taking. \"I think less is more,\" Powell tells me. \"I think people want to see a clearer agenda that they can connect to and that they see. And I think sometimes when you first come into government, there is this attraction of 'let's try to manage everything and do everything'. \"And you know, politics is painted in primary colours, our colour is red. Let's paint in that colour, let's paint in our primary colours and leave the kind of managing of things to other people whose job that is.\" Read more:Every Labour U-turn as Starmer rolls back on digital IDFarmers celebrate U-turn on inheritance taxSupport package for pubs expected shortly On U-turns, Powell concedes it \"would be much better to do a lot of that thinking and get things right beforehand\" - but the crux of the Labour challenge in 2026 is the government has to deliver. From Number 10 to new MPs, everyone in Labour agrees that voters - who were promised change in 2024 - need to begin to feel better off. Starmer is acutely aware that people haven't felt personally better off or seen public services improving since the 2008 financial crash, and saying it will get better isn't cutting much ice. \"People won't believe it until they feel it,\" is how one cabinet minister put it to me. To that end, there will be much more activity around cutting costs and improving the NHS, which Labour see as a proxy in voters' minds for better public services. There will be, I suspect, more barnacles off the boat, as Labour look to lessen the noise in the party and Westminster and campaign into the May elections and beyond. The government might delay reform of jury trails - the legislation is planned for March - in order to avoid a showdown with some of its backbenches. There will be many that see it as weakness from Starmer, but this is a PM who wants to dial the noise down in order to try to push Labour's dismal polling ratings up. It is a perhaps insurmountable task for a PM being tested to his limits at home and abroad. May will be a huge ballot box test for the Starmer administration - and could well determine his fate with his party."
    },
    {
        "title": "What is in the Chagos Islands deal and why is it controversial?",
        "description": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base.",
        "url": "https://news.sky.com/story/what-is-in-the-chagos-islands-deal-and-why-is-it-controversial-13496512",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260120072111",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-20 08:38:00",
        "Headline": "The UK government is standing firm on its decision to hand over sovereignty of the remote Chagos Islands to Mauritius after a decades-long dispute, despite criticism from Donald Trump.",
        "Content": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base. The US president said giving away the land was \"an act of great stupidity\", adding that the UK took the decision for \"no reason whatsoever\". But the UK government is standing firm. In a statement on 20 January, an official spokesperson said the government acted because the base on Diego Garcia was \"under threat after court decisions undermined our position and would have prevented it operating as intended in future\". \"The UK will never compromise on our national security,\" the spokesperson added. Follow the latest on Trump The UK and Mauritius have agreed to the deal, but it is yet to be ratified (made officially valid) by the UK parliament, so the islands currently remain British territory. So what is the deal really about, why has it sparked controversy and what does it mean for the UK-US military presence on the archipelago? Where are the Chagos Islands? The Chagos Islands are made up of more than 600 islands lying in the Indian Ocean, halfway between Africa and Indonesia. Around 4,000 people are stationed there. Why are they so controversial? The islands were a dependency of Mauritius when it was a French colony, but the UK claimed them as part of Mauritius in the early 19th Century and kept them beyond the country's independence in 1968. In the early 1970s, the UK expelled everyone from the archipelago so the US could build a naval support facility on the biggest island, Diego Garcia. Up to 2,000 native inhabitants, who are often referred to as Chagossians or Ilois, were removed to Mauritius or the Seychelles. The expulsions are regarded as one of the most shameful parts of Britain's modern colonial history and Chagossians have spent decades fighting to return. Why is the Diego Garcia base so important? Diego Garcia serves as a key military base for both the US and UK. It is leased to the US but operates as a joint UK-US base. Since 1971, only military employees have been allowed access. The UK government said its \"strategic location\" made it \"vital to UK and US power projection in the Indian Ocean and beyond\". It is described as \"a unique shared platform\" enabling a UK-US military presence across the Middle East, Indo-Pacific and Africa. Sir Keir Starmer has noted that it was used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\". More recent operations launched from the base include bombing strikes against ‍Houthi targets in Yemen in 2024 and 2025 and humanitarian aid deployments to Gaza. Why did the UK agree to return the islands? Mauritius and the UK have been in dispute over the islands for the past 50 years. In 2010, Mauritius started proceedings against the UK to challenge the legality of how Britain had declared sovereignty, including its declaration of a marine protected area around the archipelago, which it argued stopped Chagossians from returning. It demanded compensation and repatriation of former inhabitants. In 2018, the fight made it to the International Court of Justice. Under the Conservative government in 2022 sovereignty negotiations with Mauritius began, but halted a year later after a paper by three academics said transferring the islands would be a \"major self-inflicted blow\". Two years later, in October 2024, the UK agreed to transfer sovereignty of the Chagos Islands to Mauritius. The deal, however, drew some criticism from lawmakers as ‌well as Britons born on Diego Garcia. At the time, the US said it \"welcomed the historic agreement\", commending both countries' leaders for their vision. In February ​2025, ahead of the signing, Mr Trump also expressed preliminary support for the deal. Canada, Australia, New Zealand and India have also backed the agreement. What is in the final deal? Last May, Sir Keir Starmer's Labour government signed the deal to return the islands, which would mean Britain formally gives up sovereignty of the Indian Ocean territory. The deal states: • The UK will hand sovereignty of the territory over to Mauritius and lease the Diego Garcia base from the Mauritian government over 99 years;• It will ban other powers from using the islands around Diego Garcia without agreement with the UK;• Mauritius will be free to arrange for resettlement of Chagossians on all islands except Diego Garcia;• The period can be extended by a further 40 years, if both parties agree;• Sir Keir said the average cost per year is £101m. Sky News analysis suggests the total cost could rise as high as £30bn;• Both the Commons and the Mauritian parliament need to ratify the deal. Sir Keir said the UK might otherwise have lost the island over Mauritius's legal claim on the Chagos Islands, which may have allowed hostile countries to set up their own bases or carry out exercises. The government said the final deal also addressed \"wrongs of the past\" and demonstrated \"the commitment of both parties to support the welfare\" of Chagossians. Why is there concern over the deal? Concerns over the deal include any future Mauritian government not adhering to the agreement and subsequently allowing China, which is heavily invested in Mauritius, to take over the base. US Secretary of State Marco Rubio echoed these concerns in February last year, saying the deal could cause potential threats to US security. While Conservative Party leader Kemi Badenoch said the deal made \"us and ​our NATO allies weaker\". Read more from Sky News:What is the Hillsborough Law?What UK social media ban on children could look like Some Chagossians, many of whom ended up living in Britain after being removed from the archipelago, have protested against the agreement on the grounds that they were not consulted on its detail. The UK's House of Lords also objected to elements of the deal in January of this year. The House inflicted four defeats over the details of the leasing of Diego Garcia and the publication of any detailed payments made to Mauritius."
    },
    {
        "title": "Man killed baby stepson while 'full of rage' after row with ex, court hears",
        "description": "A man killed his baby stepson while \"full of rage\" following an argument with his ex-girlfriend, a court has heard.",
        "url": "https://news.sky.com/story/man-killed-baby-stepson-while-full-of-rage-after-row-with-ex-court-hears-13496792",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jensen-lee-dougal-baby_6963516.jpg?20250712162917",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-20 20:08:00",
        "Headline": "The 29-year-old denies murder and inflicting serious injuries on the child and says he tried to save the baby after he fell ill in his care.",
        "Content": "A man killed his baby stepson while \"full of rage\" following an argument with his ex-girlfriend, a court has heard. Thomas Morgan is accused of inflicting fatal injuries on Jensen-Lee Dougal when he shook him at the family home in Swansea. The 29-year-old denies murder and inflicting serious injuries on the child.   Swansea Crown Court heard the five-month-old suffered catastrophic brain damage, numerous fractures, and extensive retinal bleeding to both of his eyes. Morgan was in a relationship with Jensen-Lee's mother, Jordan Dougal, and was treated as the baby's stepfather, the jury was told. But he \"seriously abused the trust placed in him\" when left with the baby on 30 March, 2024, said Caroline Rees KC, prosecuting. She said Morgan had argued with Georgia Griffiths, his former partner, on the day the baby was shaken. In an angry exchange of messages, he called his ex names like \"stinking rat\" and \"stinking little dog\", the jury heard. Ms Rees said: \"It is clear that this abusive exchange had flipped some kind of switch in Thomas Morgan. \"By the time he was alone with Jenson-Lee, he was angry and aggressive and in no state of mind to be caring for a young baby on his own.\" Ms Dougal, who was at work, received a call from Morgan in which he told her the baby was choking and had stopped breathing, the court heard. Morgan fled the house with the baby, before a neighbour performed CPR on the child and called an ambulance, jurors were told. Read more from Sky News:Trump warns 'you'll find out' - when asked how far he'll go to take GreenlandChina's controversial 'super' embassy in London approved In hospital, the baby was found to have a \"devastating\" brain injury. He was taken off life support the following day. Morgan, from Gorseinon, Swansea, is charged with murdering Jensen-Lee and three counts of causing him grievous bodily harm with intent. The 29-year-old denies the charges and says he tried to save the baby after he fell ill in his care. He said he left Jensen-Lee alone briefly while he fetched a clean babygro, and found him unresponsive with vomit in his mouth. Ms Rees said: \"It is the prosecution case that the defendant, his temper raised and his fuse short after an argument with Georgia Griffiths, must have snapped and shaken Jensen-Lee with such violence that he caused devastating injuries which led to Jensen-Lee's death in his mother's arms at only five months old.\" The trial continues."
    },
    {
        "title": "Woman says she 'begged for pain relief but was told no' - amid national call for birth stories",
        "description": "Women and families are being asked to share their maternity stories in a national call for action.",
        "url": "https://news.sky.com/story/woman-says-she-begged-for-pain-relief-but-was-told-no-amid-national-call-for-birth-stories-13496758",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kelly-redhead-maternity-crisis_7140809.jpg?20260120173950",
        "type": "UK",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2026-01-20 17:51:00",
        "Headline": "Kelly Redhead, whose daughter Harper lived for less than half-an-hour after being born at 18 weeks, hopes other women share their stories to help the national maternity investigation.",
        "Content": "By Laura Bundock, health correspondent  Women and families are being asked to share their maternity stories in a national call for action. Warning: This article contains details some may find distressing The findings will help inform the National Maternity and Neonatal Investigation (NMNI),which is being led by Baroness Amos. She told Sky News she understands many women have \"lost faith\" in the system but wants them to take part to ensure positive change can happen.  Kelly Redhead's daughter Harper lived for less than half-an-hour. She was born prematurely at 18 weeks and three days. \"She was laid on my chest and there was a beam of light coming in through the window… and I could just see her chest moving up and down and I watched until it wasn't,\" she said. \n                  Finger prick blood test trial 'could revolutionise' Alzheimer's diagnosis, say experts\n                 \n                  Call for urgent Holyrood statement after Glasgow health board's hospital infections admission\n                 \n                  Doctors warn of 'horrific' impact of tech and devices on children and young people's health\n                 Days earlier, Kelly had known something was wrong. But her medical team sent her home. \"I was begging for pain relief at this point because of how much pain I was in. And I was told 'no, you can't have anything'.\" Kelly was carrying an infection which led to pelvic inflammatory disease, sepsis and pre-term labour. \"When she said, 'I'm really sorry Kelly, your cervix is opening', I just remember screaming at my mum, saying 'no'. Because I knew if I gave birth to Harper, she wouldn't survive.\" Kelly keeps a memory box for Harper, containing scan photos and prints of her tiny hands and feet. She says she will never be the same again. Leeds Teaching Hospitals was responsible for Kelly's care and is facing its own independent inquiry. It welcomes the national call for evidence. The trust's deputy chief medical officer, Dr Elizabeth Garthwaite, said: \"We are truly sorry that Kelly did not feel listened to about her concerns during her pregnancy, and we offer our sincere condolences to Kelly and her family for their sad loss of baby Harper.\" The national review was ordered by Health Secretary Wes Streeting, following a series of scandals. Sky News has been highlighting the issues and speaking to many mothers about their birth trauma. Kelly still struggles with her loss and has suffered from post-natal depression and PTSD. But she thinks women should share their stories, if only to highlight how badly the system is failing. Read more on birth stories:Feeling ignored, bad staff behaviour, long-term trauma: Your maternity experiences \"I will be filling it in because we all have voices and as lost mums and lost families and lost parents and siblings, we deserve to be heard.\" The call for evidence will be open until 17 March. If you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853, emailing maternitystories@sky.uk or using 'Your Report' on the Sky News app."
    },
    {
        "title": "Prince Harry's privacy case is 'threadbare' and journalist sources were legitimate, lawyer for Mail publisher tells High Court",
        "description": "Prince Harry's privacy case against the publisher of the Daily Mail is \"threadbare\" and has been brought too late, a lawyer for the news outlet has told the High Court.",
        "url": "https://news.sky.com/story/prince-harrys-privacy-case-is-threadbare-and-journalist-sources-were-legitimate-lawyer-for-mail-publisher-tells-high-court-13496701",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7140395.jpg?20260120101058",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2026-01-20 15:58:00",
        "Headline": "Associated Newspapers, publishers of the Daily Mail and Mail On Sunday, are defending against allegations of unlawful information gathering brought by Prince Harry and other household names, including Sir Elton John and Elizabeth Hurley.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Prince Harry's privacy case against the publisher of the Daily Mail is \"threadbare\" and has been brought too late, a lawyer for the news outlet has told the High Court. Opening the case for the defence, Anthony White KC said journalists for the Daily Mail and Mail On Sunday sourced articles legitimately and have \"compelling\" accounts of doing so which will be shown during the trial. Along with Sir Elton John and his husband David Furnish, actresses Elizabeth Hurley and Sadie Frost, campaigner Baroness Lawrence and politician Sir Simon Hughes, Harry is accusing Associated Newspapers Limited (ANL) of unlawful information gathering during a period between 1993 and 2011. As it happened: Mail knew Harry gave ex set of keys, court case against publisher told  The allegations range from tapping their phones and bugging their homes to obtaining private information by \"blagging\", or deception, through the use of private investigators. ANL is defending against what it has called \"preposterous\" claims and strenuously denied any wrongdoing. Harry, Hurley and Sir Simon were in court for the second day of the trial on Tuesday. However, after their barrister David Sherborne finished his opening arguments, both the duke and Hurley left court during the lunch break, not waiting around to hear the ANL opening arguments. White, representing ANL, told the court the case was \"threadbare\". Journalists working for the publisher provide a \"compelling account of a pattern of legitimate sourcing of articles\" and a series of witnesses will show this throughout the trial, he said. This is in relation to 50-plus articles alleged to be the product of unlawful information gathering that the claimants are relying on to make their case, he added. \"We don't pretend that that account is perfect and covers every detail, and not every journalist can remember every article, but we do say that, overall, it provides a compelling account of a pattern of legitimate sourcing of articles.\" Multiple Associated journalists and editors, past and present, are expected to give evidence at the High Court, including former Daily Mail editor Paul Dacre. Mr White said the claims accuse a large number of journalists of using unlawful methods to obtain information, and that they cannot all be lying when they say this did not happen. The celebrities bringing the legal action had \"leaky\" social circles and information also came from sources including spokespeople and previous reporting, he said in his written opening argument to the court. And addressing allegations of payments to private investigators, Mr White said these were \"examples of clutching at straws in the wind and seeking to bind them together in a way that has no proper analytical foundation\". Why is ANL arguing the claims are too late? While strenuously denying allegations of wrongdoing, the barrister also argued the claims have been brought too late - as the law indicates that privacy claims should be brought within six years. Mr Sherborne, representing the claimants, said this part of the defence is a \"potential life raft in a sea of unlawful information gathering\", but that the publisher may not \"be able to climb aboard\". The legal action was launched in 2022. All seven of the claimants discovered they had \"worthwhile\" claims after 2016, he told the court. Mr Sherborne, who began his opening statement on Monday, concluded his arguments on Tuesday morning, telling the court that while ANL has described the allegations as \"preposterous\", the claimants say it is the publisher's \"position in this which is preposterous - and a particularly disgraceful one for the claimants to stomach, victims who have already suffered at the defendant's hands\". Read more:Why seven household names are suing Mail publisherThis is Harry's biggest case against the press - and stakes are high Referencing Harry's claim in particular, the barrister said the duke had suffered \"distress\" and \"paranoia\" due to unlawful information gathering. \"Given what we've seen, is it any wonder that he feels that way?\" Sherborne said, before telling the court that Harry \"feels he has endured a sustained campaign of attacks against him for having had the temerity to stand up to Associated in the way that he has so publicly done\". ANL \"strongly denies\" that there was any unlawful information gathering, including voicemail interception, directed at the duke or his named associates. Harry was expected to enter the witness box to give evidence on Thursday. However, due to a much briefer than expected opening argument by Mr White - which the judge noted was allowed due to full details being included in his written submissions - the duke could begin his evidence on Wednesday. The trial continues."
    },
    {
        "title": "Trump's Chagos broadside leaves Starmer walking an even thinner tightrope",
        "description": "Donald Trump detonated a series of bombshells on his Truth Social overnight.",
        "url": "https://news.sky.com/story/trumps-chagos-broadside-leaves-starmer-walking-an-even-thinner-tightrope-13496652",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-starmer_7138868.jpg?20260118135445",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-20 13:59:00",
        "Headline": "What's clear from sources around government is a sense that Donald Trump is trying to pressure the UK by going hostile on Chagos.",
        "Content": "\n          Political editor\n              @BethRigby\n Donald Trump detonated a series of bombshells on his Truth Social overnight. There was the leaking of private messages from France's President Emmanuel Macron, the posting of images of Canada and Greenland as part of the US, and then going all out on Sir Keir Starmer and the UK by calling the Chagos deal an \"act of great stupidity\" - opening him up to attacks from opposition MPs long-opposed to the deal. I've been speaking around government to get a sense of what the hell is going on after the prime minister sought to reiterate the UK's position on Greenland on Monday while also trying to de-escalate, stressing the strong relationship, dodging the matter of retaliatory tariffs (although not ruling it out) and avoiding any incendiary language adopted by other leaders clearly fed up with Trump. Politics latest: China's controversial 'super' embassy in London approved  What's clear is a sense that Trump is trying to pressure the UK by going hostile on Chagos - he clearly links the deal to Greenland in the post. But what is also clear is that the UK government is not going to change its position on Greenland, nor is it going to wobble on Chagos, and will press on with the agreement with Mauritius. Read more: What is in the Chagos Islands deal and why is it controversial? The lashing out against the UK and Starmer seems to be part of a bigger assault on allies - as Trump reveals private messages with Macron and shares a map of Canada as US territory, which will no doubt explode in Canada. This is what Work and Pensions Secretary Pat McFadden said: \"What we saw last night... was a series of posts criticising a number of world leaders. That may tell us that the president is frustrated right now. \"I don't really believe this is about Chagos. I think it's about Greenland and the best way to resolve that is through dialogue with the Danish government and that's what we've said all along.\" Trump is clearly frustrated that European allies are standing firm on Greenland and facing down his threats, regardless of the consequences of the tariffs. Meanwhile, his Board of Peace plan has also fallen flat as he demands $1bn (£744m) for membership of a club that seems intended to undermine the United Nations. France intends to reject Trump's invitation over concerns that it would call into question \"the principles and structure of the United Nations\", according to reports from the AFP news agency, while the UK government has \"severe reservations\" about the project's legal framework, according to The Times. On Monday, Danish foreign minister and former Danish PM Lars Lokke Rasmussen told me how surprised he'd been by Trump's public threats on social media over the weekend. He said he thought Denmark had come to an agreement with vice president JD Vance and secretary of state Marco Rubio that the profound disagreement on Greenland would be negotiated away from social media. \"The meeting we had last week left me with the clear impression that the president, honestly and full-heartedly, wanted to acquire Greenland. \"But we also made it crystal clear that this is a red line... we agreed that we should move this dialogue from social media and Truth Social and other arenas into a meeting room where we could discuss, whether there could be a solution building on what we already have agreed in the past. \"I thought, we have managed not to solve the problem, but to find a pathway forward. \"It was disrupted by the statement from the president. And that's a reality of life,\" he told me. Read more: Beth Rigby: NATO faces crisis - I've never seen PM look so grave It's a reality all leaders are dealing with, as Trump's increasingly erratic behaviour with allies makes the US almost impossible to deal with, though the UK's position is that it must continue to try. Last night I was told it was \"highly unlikely\" Starmer would attend Davos, given that there is no sign of any resolution or big set piece, multilateral meeting in resolution of the biggest matters for the UK and EU - Greenland and Ukraine. 👉Listen to Politics at Sam and Anne's on your podcast app👈 But I'm told there will be engagement with the US on Tuesday and a conversation in Davos between UK and US players. Trump turning on Starmer after all the prime minister's efforts to build a good relationship is undoubtedly a blow, and raises questions about how else Starmer might have dealt with Trump. For the UK's part, it managed to negotiate better trade terms during that purple patch. But now, this relationship is clearly under huge strain. I imagine Starmer will ignore it and carry on - his problem is that his opponents will not."
    },
    {
        "title": "Will Brooklyn regret launching a grenade at Brand Beckham?",
        "description": "It had been a while&#160;since&#160;we'd&#160;seen the whole Beckham family out together.",
        "url": "https://news.sky.com/story/will-brooklyn-regret-launching-a-grenade-at-brand-beckham-13496724",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckham-david-beckham_7140029.jpg?20260119210741",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2026-01-20 16:53:00",
        "Headline": "In a long statement on Instagram, the 26-year-old said he was \"standing up for myself for the first time in my life\".",
        "Content": "\n          Arts and entertainment correspondent\n       It had been a while since we'd seen the whole Beckham family out together. And while the tabloids had picked up last year on the fact that their eldest child had been noticeably missing from family photo-ops, few could have foreseen how Brooklyn would briefly break the internet. Will their eldest child come to regret the fallout? Had he really thought it through? The carefully worded references to his parents \"performative social media posts\", the \"inauthentic relationships…a fixture of the life I was born into\" certainly feels like words that weren't casually dashed off in the heat of the moment. Moreover, he was waiting for the right moment to press send. Read more:In full: Brooklyn Beckham's explosive statementSir David Beckham snubs question about Brooklyn in Davos There are of course two sides to every story and we're yet to hear his parents' take. But it's worth noting that behind the scenes the Beckhams have patently done quite a bit to try to launch their son's career. As a wannabe photographer, were it not for his surname, he likely wouldn't have secured a book deal with Penguin for his photographs. With journalists around the world reaching out to the Beckhams for comment, so far the couple has said nothing. Anything other than silence arguably lends weight to Brooklyn's argument that what they say is carefully stage-managed. \n                  Sir David Beckham refuses to answer Sky News questions in Davos\n                 \n                  Brooklyn Peltz Beckham 'doesn't want to reconcile with family'\n                 \n                  Prince Harry's privacy case is 'threadbare' and journalist sources were legitimate, lawyer for Mail publisher tells High Court\n                 So for now, Sir David's interview with CNBC in Davos might just be the closest we get to understanding what his parents are thinking. Said under the guise of how young people use social media, Sir David's reference to children being \"allowed to make mistakes, that's how they learn\" is seemingly rather telling right now. But of course this isn't a small mistake. Brooklyn's claims are akin to a grenade being thrown at the notoriously polished Brand Beckham."
    },
    {
        "title": "Teenage boy stabbed to death in Surrey woodland",
        "description": "A 15-year-old boy has been stabbed to death in a woodland near a park in Surrey.",
        "url": "https://news.sky.com/story/teenage-boy-stabbed-to-death-in-surrey-woodland-13496740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-car-police-tape_6916669.jpg?20250514222100",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-20 17:26:00",
        "Headline": "Officers have urged witnesses to come forward \"as a matter of urgency\", and the leader of the local council described the death as \"utterly devastating\".",
        "Content": "A 15-year-old boy has been stabbed to death in a woodland near a park in Surrey. Officers were called to reports of a stabbing off Lido Road in Stoke Park, Guildford, around 6.10pm on Monday. They attended along with fire and ambulance crews, but the boy was pronounced dead at the scene. Speaking on Tuesday afternoon, Detective Chief Superintendent Debbie White of Surrey Police asked witnesses to come forward \"as a matter of urgency\". She went on: \"We appreciate that this incident will have caused shock and concern amongst our local communities, and we want to reassure you that we are working at pace to establish the circumstances of the boy's death, gather as much evidence as possible and identify those responsible. \"Although the circumstances of the boy's death are not clear at this time, this is a fast-moving investigation, and we are pursuing a number of lines of inquiry. \"We would ask that people don't speculate about what might have happened while we work through these inquiries. \"A police cordon remains in place, and we respectfully ask that people stay away from the area while we carry out our investigation. \"A significant police presence will remain in the area for some time.\" Read more from Sky News:Beckham refuses to answer questions on BrooklynLucy Letby to face no further criminal charges A cordon has been placed around the wooded area known as Peacock Wood and Wild Wood Adventure, as well as the end of the car park on Lido Road. The nearby A25 is not affected. Julia McShane, leader of Guildford Borough Council, added: \"I am shocked and saddened at this tragic event. \"The loss of a young life in this way is utterly devastating. \"My heart goes out to their family and friends at this desperately sad time.\""
    },
    {
        "title": "Trump offers ominous message on Greenland ahead of crunch talks with European leaders",
        "description": "\"You'll find out.\"",
        "url": "https://news.sky.com/story/trump-offers-ominous-message-on-greenland-and-says-starmer-gets-a-little-rough-with-him-13496909",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7141126.jpg?20260120231956",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 23:13:00",
        "Headline": "It was an \"extraordinary inconsistent ramble… even by his standards\" said Sky's US correspondent Mark Stone, following the US president's surprise White House news conference on Tuesday.",
        "Content": "\"You'll find out.\" That was the ominous reply from Donald Trump when asked how far he would go to wrest control of Greenland. He offered the warning at the end of a long and rambling White House news conference on Tuesday, ahead of crunch talks with European leaders in Davos, Switzerland. Trump's news conference as it happened The briefing, held to mark a year since he took office, comes at a time of unprecedented tension between the US and Europe, fuelled by Mr Trump's desire to annex Greenland. Currently, the Arctic island is part of Denmark, an ally with which the US has a defensive pact, yet the president hasn't ruled out seizing it by force. Trump claims 'things are going to work out' Asked again whether he would endanger NATO by going after an ally's territory, Mr Trump doubled down on his belief that the US \"needs\" it. \"I think that we will work something out where NATO is going to be very happy, and where we're going to be very happy,\" he said. \"But we need it for security purposes, we need it for national security and even world security.\" He also said he would raise the matter at the World Economic Forum in Davos on Wednesday. \"And I think things are going to work out pretty well,\" he claimed. Starmer can 'get a little rough', says Trump So far, Mr Trump's designs on Greenland have faced vocal opposition from his NATO allies. When several European nations contributed troops to a reconnaissance mission in Greenland, he took it as a provocation. In response, he threatened the countries with 10% tariffs from 1 February, raising to 25% from 1 June, unless the US is allowed to buy the territory. Read more:What Trump's tariff threat means for Europe Against this backdrop, British Defence Secretary John Healey will travel to Copenhagen on Wednesday to meet his Danish counterpart Troels Lund Poulsen. While Mr Trump was positive when asked how he gets on with his British and French counterparts, he said Sir Keir Starmer and Emmanuel Macron - who have criticised his tariffs threat - \"get a little bit rough when I'm not around\". \"But when I'm around they treat me very nicely,\" he added. It comes after Mr Trump attacked Sir Keir's deal to hand over the Chagos Islands to Mauritius, despite having backed it just last year. Read more:What is the Chagos deal? He also used the occasion to address Venezuela, whose president Nicolas Maduro was abducted by the US in a raid on Caracas this month. Mr Trump said his administration had taken 50 million barrels of oil out of the South American country so far, and that it would bring down prices in the US. And he once again aired his grievances about not receiving a Nobel Peace Prize, saying he'd \"lost a lot of respect for Norway\" over the matter. But most of the briefing was concerned with singing his own praises, darting from subject to subject for nearly two hours. It was an \"extraordinary inconsistent ramble... even by his standards\" said Sky's US correspondent Mark Stone. \"The right-wing US news networks stuck with it, but others moved on, skipping the monologue, dipping back only for the questions,\" Stone said. He continued: \"I'd argue that his ramblings - today more than any day - are on a different level from what we saw with Biden. \"The numerous conservative policy achievements - job numbers up, immigration down, crime down - are lost behind the ramble.\""
    },
    {
        "title": "Driver killed and 37 injured after train derails near Barcelona",
        "description": "A train driver has been killed and 37 people injured after a commuter train derailed near Barcelona.",
        "url": "https://news.sky.com/story/driver-killed-and-20-injured-after-train-derails-near-barcelona-13496913",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-emergency-crews-spain_7141155.jpg?20260121004021",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 23:27:00",
        "Headline": "The accident occurred just two days after a train collision killed 42 people in southern Spain and injured dozens more.",
        "Content": "A train driver has been killed and 37 people injured after a commuter train derailed near Barcelona. A retaining wall \"collapsed on to the tracks\", causing the incident, the region's civil protection agency said on social media. The accident occurred just two days after a train collision killed 42 people in southern Spain and injured dozens. Following Tuesday's incident, 20 ambulances were dispatched to the site near Gelida, on the outskirts of Barcelona, along with 38 firefighter units, emergency services said. Four people were seriously injured, Claudi Gallardo, inspector at the Catalonia regional fire department, said in televised comments. The train was travelling south between Gelida and Sant Sadurni d'Anoia, according to Spanish newspaper El Mundo. The injured have been taken to the Moises Broggu, Bellvitge, and Vilafranca hospitals, the newspaper reports. Catalonia's fire service confirmed \"no one remained inside\" the train carriages after conducting a review of the site. \"We are reviewing the underside of the train and conducting a sweep of the area to rule out any further victims,\" it said on X. \"We continue securing the area to work safely.\" Spanish Prime Minister Pedro Sanchez acknowledged the Barcelona area crash, posting on X: \"All my affection and solidarity with the victims and their families.\" Read more from Sky News:Spain mourns for train crash victimsSurfer 'lucky to survive' shark attack Spain's railway operator ADIF said the containment wall likely collapsed due to heavy rainfall across the northeastern Spanish region this week. Commuter train services were cancelled along the line, it added. The accident occurred in a region that has struggled for a long time with underfunded rail services and ‌frequent incidents, according to Reuters."
    },
    {
        "title": "Surfer 'lucky to survive' Sydney's fourth shark attack in three days",
        "description": "A surfer has become the latest victim of a shark attack in Australia - the fourth off Sydney in just three days.",
        "url": "https://news.sky.com/story/surfer-lucky-to-survive-sydneys-fourth-shark-attack-in-three-days-13496507",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sydney-shark_7139443.jpg?20260119092200",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 08:25:00",
        "Headline": "A shark attacks the 39-year-old man's surfboard out at sea. It comes after earlier incidents left two people, including a 12-year-old boy,  in critical conditions.",
        "Content": "A surfer has become the latest victim of a shark attack in Australia - the fourth off Sydney in just three days. Officials in New South Wales said the shark attacked the man's surfboard while out at sea in Point Plomer, north of Sydney, at around 9am on Tuesday (10pm on Monday in the UK). Kempsey-Crescent Head Surf Life Saving Club captain Matt Worrall said that the 39-year-old man was left with minor cuts but was lucky to survive. \"The board seemed to take most of the impact,\" he told the Australian Broadcasting Corp (ABC). \"He made his own way into shore where he was assisted by locals.\" Three earlier shark attacks off Sydney on Sunday and Monday left two people, including a 12-year-old boy, in critical conditions. Beaches on New South Wales' northern coast and northern Sydney were closed on Tuesday. Authorities warned that recent heavy rainfall had left water off the beaches murky. It created ideal conditions for bull sharks, a species ⁠that thrives in brackish water. \n                  Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting\n                 \n                  Boy, 12, and man critically hurt in Sydney after three shark attacks in two days\n                 \n                  Australian author Craig Silvey charged with possessing and distributing child exploitation material\n                 The 12-year-old boy had been jumping ​off rocks with friends late on Sunday ​afternoon, when he was bitten. Police said he was pulled from the ‌water by friends and emergency services with severe injuries to both ‌legs. \"He's in for the fight of his ​life now, and the actions of emergency services yesterday gave him that chance,\" New South Wales Police Superintendent ‍Joseph McNulty told reporters. The two other attacks were reported by local media on Monday. One saw a surfer critically injured off North Steyne Beach in Manly. Read more from Sky News:What may have caused deadly train crash in SpainA chance to negotiate as Trump heads to Davos \"If you're thinking about going for a swim, think of going to a local pool because at this stage, we're advising that beaches are unsafe,\" Steven Pearce, the chief executive of Surf Life Saving New South Wales (NSW), told reporters on Tuesday. \"We have such poor water quality that's really conducive to some bull shark activity.\" "
    },
    {
        "title": "Australia fast-tracks tougher gun and hate laws after Bondi Beach shooting",
        "description": "Australia's politicians have fast-tracked reforms to toughen gun control and hate crime laws in response to December's Bondi Beach shooting.",
        "url": "https://news.sky.com/story/australia-fast-tracks-tougher-gun-and-hate-laws-after-bondi-beach-shooting-13496476",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gun-buyback-sydney_7140287.jpg?20260120083425",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 07:11:00",
        "Headline": "A national gun buyback scheme, tighter background checks for firearms licences and tougher penalties for those spreading hate are all set to be approved.",
        "Content": "Australia's politicians have fast-tracked reforms to toughen gun control and hate crime laws in response to December's Bondi Beach shooting. The House of Representatives met in a special session to vote for a national gun buyback scheme, tighter background checks for firearms licences and tougher penalties for those spreading hate. The legislation will now go to the Senate for debate, but is expected to pass, despite some opposition. Home Affairs Minister Tony Burke described the reforms as targeting people with \"hate in their hearts and guns in their hands\". Police allege that the father and son involved in the 14 December shooting that killed 15 people at a Hanukkah celebration were inspired by the Islamic State militant group. Naveed Akram, 24, has been charged with 59 offences, including 15 counts of murder. His father, 50-year-old Sajid Akram, was shot dead by police. Prime Minister Anthony Albanese recalled parliament early from its summer break for this ‌week's two-day session to debate tougher curbs after the shooting, which shocked the nation and prompted calls for more action on gun control and antisemitism. \n                  Surfer 'lucky to survive' Sydney's fourth shark attack in three days\n                 \n                  Boy, 12, and man critically hurt in Sydney after three shark attacks in two days\n                 \n                  Australian author Craig Silvey charged with possessing and distributing child exploitation material\n                 The proposed gun control measures include tougher background checks for firearm licences, using intelligence information from Australia's domestic spy agency. The bill will also enable the ‌largest national buyback scheme since a similar campaign after a 1996 massacre in Tasmania's Port Arthur, in which a lone gunman killed 35 people. While Mr Burke described the number of ‍firearms circulating within Australia as \"unsustainable\", opposition politician Andrew Wallace of the Liberal Party attacked what he called the government's \"contempt\" for gun owners. The bill passed by a vote of 96 to 45. Read more from Sky News:Couple tried to stop Bondi attackHero recalls tackling gunmanRelative hits out at 'evil' attackers On Sunday, the government released figures showing the number of firearms in Australia had reached an all-time high. There were a record 4.1 million registered guns in 2025, with ​1.1 million of those in the most populous ​state of New South Wales where the attack took place, according to data from the Department of Home Affairs. Earlier this month, Mr Albanese announced a national inquiry into antisemitism in Australia and the Bondi attack specifically. He added that a national day of mourning for those killed would be held on 22 January. A second bill, which had overwhelming support in The House, steps up ‌penalties for hate crimes, such as jail terms up to 12 years when a religious official or ⁠preacher is involved. It also provides ‌new powers to tackle those who spread hate by banning certain groups, and cancelling or refusing visas. The measures were originally planned for a single bill, but a backlash from opposition parties forced the government to split ​the package and drop provisions for an offence of racial vilification. Separately, New South Wales has also imposed extra restrictions on gun owners, limiting individuals to four firearms each. In the days after the attack, Jewish community groups and the Israeli government criticised the prime minister for failing to tackle rising antisemitic attacks and criticised protest marches against Israel's war in Gaza."
    },
    {
        "title": "Anthony Joshua's driver appears in court over fatal crash in Nigeria",
        "description": "A driver charged in connection with a fatal crash in Nigeria, which killed two passengers and injured boxer Anthony Joshua, has appeared in court.",
        "url": "https://news.sky.com/story/anthony-joshuas-driver-appears-in-court-over-fatal-crash-in-nigeria-13496615",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-adeniyi-mobolaji-kayode_7140525.jpg?20260120124502",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 12:44:00",
        "Headline": "Adeniyi Mobolaji Kayode, 46, faces four charges in connection with the December crash, which killed the boxer's friends Latif Ayodele and Sina Ghami.",
        "Content": "A driver charged in connection with a fatal crash in Nigeria, which killed two passengers and injured boxer Anthony Joshua, has appeared in court. Joshua, a two-time world champion, was travelling in the back of a black Lexus SUV when it struck a stationary truck on a major road, near Nigeria's largest city Lagos, on 29 December. His friends Latif Ayodele and Sina Ghami were killed. Ghami was Joshua's strength and conditioning coach, while Ayodele was a trainer and described as being like a \"twin brother\" to Joshua. Adeniyi Mobolaji Kayode, 46, has been charged with dangerous driving causing death, reckless and negligent driving, driving without due care and attention and driving without a valid national driver's licence. Kayode appeared at Sagamu Magistrate Court in southwestern Ogun State on Tuesday. The case was adjourned until 25 February at the prosecution's request. \n                  Anthony Joshua back in gym after car crash - as Eddie Hearn addresses whether boxer will return to ring\n                 \n                  Anthony Joshua pays tribute to 'special' friends killed in Nigeria crash\n                 \n                  Anthony Joshua shares photo in first public update since Nigeria car crash\n                 Joshua, who is British-Nigerian, left hospital a few days after the crash. He survived with minor injuries, police said. Read more from Sky News:Witness describes Nigeria crashJoshua issues update after crashHearn asked if Joshua will return The crash happened on the Lagos-Ibadan Expressway near Sagamu, at about midday local time (11am UK time) on 29 December, according to the Nigerian federal road safety corps (FRSC). Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria following his win over Jake Paul in Miami on 19 December."
    },
    {
        "title": "Spain begins three days of mourning as number killed in train crash could rise",
        "description": "The number of people killed in a high-speed train crash in Spain could rise in the coming hours as cranes begin moving the wreckage.&#160;",
        "url": "https://news.sky.com/story/number-killed-in-spain-train-crash-expected-to-rise-as-carriages-moved-13496557",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-spain-train-crash-king_7140636.jpg?20260120143528",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 10:37:00",
        "Headline": "Footage showed passengers climbing out of smashed windows, with some survivors describing decisions that may have saved their lives.",
        "Content": "The number of people killed in a high-speed train crash in Spain could rise in the coming hours as cranes begin moving the wreckage.  Another body was found overnight - taking the total number to 41 - following Sunday's collision in Cordoba province. Interior minister Fernando Grande-Marlaska said at least three deceased people had been seen still trapped in the debris. It is not clear if those bodies are included in the official count. Police also confirmed to Sky News that 43 people were \"missing\" following reports from their families, mirroring the provisional number of victims. At least 159 people were also injured in the collision, which involved two trains travelling around 130mph (209kmh). Health authorities said 39 remained in hospital on Tuesday morning, with 83 treated and discharged. Sky News Europe correspondent Alistair Bunkall, who's at the scene, said more bodies were expected to be recovered when cranes move at least one of the carriages on Tuesday morning. Officials have repeatedly warned that the death count may rise. People in Spain have started three days of mourning over the crash and the country's king and queen visited the rural crash site on Tuesday. The trains crashed near the town of Adamuz, about 230 miles (370km) south of Madrid, when the end of a Malaga to Madrid service derailed and crossed the tracks. It was hit by a train travelling from the Spanish capital to Huelva, in the southern Andalusia region. El Pais newspaper reported the 27-year-old driver was among those killed. A source told Reuters a faulty rail joint was a potential cause, but Bunkall said authorities seem \"totally baffled as to why the first train derailed\". Unions had previously complained about wear and tear on that stretch of track but it was upgraded at great expense in May, Bunkall added. Fernandez Heredia, the boss of Renfe, Spain's national railway company, has ruled out human error, while Spain's transport minister Oscar Puente called the crash \"truly strange\" as it happened on a flat stretch of track. He said the back of the derailed train had slammed into the other service, knocking its first two carriages off the track and down a 4m slope. Read more:How Spain's deadly train crash happened Footage showed passengers climbing out of smashed windows, and some survivors have described making decisions that may have saved their lives. Lola Beltran told Spanish broadcaster TVE she had moved seats from one of the worst-affected carriages to sit with a colleague moments before the crash. Bianca Birleanu, 23, who was travelling to Huelva, told newspaper El Pais: \"We felt the first jolt and, in a fraction of a second, another very strong one. \"The table in front of our seat fell on top of us, the lights went out, and the carriage roof collapsed.\" Spain's recent rail safety record is among the best in the EU, according to the European Commission. Eighteen people were killed in rail accidents in 2024, the equivalent of around one per 1,000km of tracks. The worst Spanish railway accident this century was a train derailment in Santiago de Compostela in July 2013, which killed 79 people."
    },
    {
        "title": "What is in the Chagos Islands deal and why is it controversial?",
        "description": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base.",
        "url": "https://news.sky.com/story/what-is-in-the-chagos-islands-deal-and-why-is-it-controversial-13496512",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260120072111",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 08:38:00",
        "Headline": "The UK government is standing firm on its decision to hand over sovereignty of the remote Chagos Islands to Mauritius after a decades-long dispute, despite criticism from Donald Trump.",
        "Content": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base. The US president said giving away the land was \"an act of great stupidity\", adding that the UK took the decision for \"no reason whatsoever\". But the UK government is standing firm. In a statement on 20 January, an official spokesperson said the government acted because the base on Diego Garcia was \"under threat after court decisions undermined our position and would have prevented it operating as intended in future\". \"The UK will never compromise on our national security,\" the spokesperson added. Follow the latest on Trump The UK and Mauritius have agreed to the deal, but it is yet to be ratified (made officially valid) by the UK parliament, so the islands currently remain British territory. So what is the deal really about, why has it sparked controversy and what does it mean for the UK-US military presence on the archipelago? Where are the Chagos Islands? The Chagos Islands are made up of more than 600 islands lying in the Indian Ocean, halfway between Africa and Indonesia. Around 4,000 people are stationed there. Why are they so controversial? The islands were a dependency of Mauritius when it was a French colony, but the UK claimed them as part of Mauritius in the early 19th Century and kept them beyond the country's independence in 1968. In the early 1970s, the UK expelled everyone from the archipelago so the US could build a naval support facility on the biggest island, Diego Garcia. Up to 2,000 native inhabitants, who are often referred to as Chagossians or Ilois, were removed to Mauritius or the Seychelles. The expulsions are regarded as one of the most shameful parts of Britain's modern colonial history and Chagossians have spent decades fighting to return. Why is the Diego Garcia base so important? Diego Garcia serves as a key military base for both the US and UK. It is leased to the US but operates as a joint UK-US base. Since 1971, only military employees have been allowed access. The UK government said its \"strategic location\" made it \"vital to UK and US power projection in the Indian Ocean and beyond\". It is described as \"a unique shared platform\" enabling a UK-US military presence across the Middle East, Indo-Pacific and Africa. Sir Keir Starmer has noted that it was used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\". More recent operations launched from the base include bombing strikes against ‍Houthi targets in Yemen in 2024 and 2025 and humanitarian aid deployments to Gaza. Why did the UK agree to return the islands? Mauritius and the UK have been in dispute over the islands for the past 50 years. In 2010, Mauritius started proceedings against the UK to challenge the legality of how Britain had declared sovereignty, including its declaration of a marine protected area around the archipelago, which it argued stopped Chagossians from returning. It demanded compensation and repatriation of former inhabitants. In 2018, the fight made it to the International Court of Justice. Under the Conservative government in 2022 sovereignty negotiations with Mauritius began, but halted a year later after a paper by three academics said transferring the islands would be a \"major self-inflicted blow\". Two years later, in October 2024, the UK agreed to transfer sovereignty of the Chagos Islands to Mauritius. The deal, however, drew some criticism from lawmakers as ‌well as Britons born on Diego Garcia. At the time, the US said it \"welcomed the historic agreement\", commending both countries' leaders for their vision. In February ​2025, ahead of the signing, Mr Trump also expressed preliminary support for the deal. Canada, Australia, New Zealand and India have also backed the agreement. What is in the final deal? Last May, Sir Keir Starmer's Labour government signed the deal to return the islands, which would mean Britain formally gives up sovereignty of the Indian Ocean territory. The deal states: • The UK will hand sovereignty of the territory over to Mauritius and lease the Diego Garcia base from the Mauritian government over 99 years;• It will ban other powers from using the islands around Diego Garcia without agreement with the UK;• Mauritius will be free to arrange for resettlement of Chagossians on all islands except Diego Garcia;• The period can be extended by a further 40 years, if both parties agree;• Sir Keir said the average cost per year is £101m. Sky News analysis suggests the total cost could rise as high as £30bn;• Both the Commons and the Mauritian parliament need to ratify the deal. Sir Keir said the UK might otherwise have lost the island over Mauritius's legal claim on the Chagos Islands, which may have allowed hostile countries to set up their own bases or carry out exercises. The government said the final deal also addressed \"wrongs of the past\" and demonstrated \"the commitment of both parties to support the welfare\" of Chagossians. Why is there concern over the deal? Concerns over the deal include any future Mauritian government not adhering to the agreement and subsequently allowing China, which is heavily invested in Mauritius, to take over the base. US Secretary of State Marco Rubio echoed these concerns in February last year, saying the deal could cause potential threats to US security. While Conservative Party leader Kemi Badenoch said the deal made \"us and ​our NATO allies weaker\". Read more from Sky News:What is the Hillsborough Law?What UK social media ban on children could look like Some Chagossians, many of whom ended up living in Britain after being removed from the archipelago, have protested against the agreement on the grounds that they were not consulted on its detail. The UK's House of Lords also objected to elements of the deal in January of this year. The House inflicted four defeats over the details of the leasing of Diego Garcia and the publication of any detailed payments made to Mauritius."
    },
    {
        "title": "North Korea's Kim Jong Un dismisses vice premier, comparing him to 'a goat yoked to pull an ox cart'",
        "description": "North Korean leader Kim Jong Un has dismissed a vice premier over a factory modernisation project in a rare public rebuke ahead of a ruling party congress, state media has reported.&#160;",
        "url": "https://news.sky.com/story/north-koreas-kim-jong-un-dismisses-vice-premier-comparing-him-to-a-goat-yoked-to-pull-an-ox-cart-13496580",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-north-korea-kim-jong-un_7140499.jpg?20260120121839",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 12:01:00",
        "Headline": "The North Korean leader said the vice premier had caused \"unnecessary man-made confusion\" during works to modernise the Ryongsong Machine Complex in the northeast of the country.",
        "Content": "North Korean leader Kim Jong Un has dismissed a vice premier over a factory modernisation project in a rare public rebuke ahead of a ruling party congress, state media has reported.  Mr Kim blamed Yang Sung Ho, a vice premier in charge of the machine-building industry, for causing what he called \"unnecessary man-made confusion\" during works to modernise the Ryongsong Machine Complex in the northeast of the country, the Korean Central News Agency (KCNA) said on Tuesday. In an apparent move to tighten discipline among officials ahead of the upcoming Workers' Party congress - which looks to establish new political and economic priorities - Mr Kim said the project had suffered \"not a small amount of economic loss\" because of irresponsible and incompetent officials. In a speech marking the completion of the complex's first-stage plan on Monday, he said authorities had wasted \"large amounts of funds and labour\" and that the munitions industry sector was subsequently left with a heavier burden, according to KCNA. The outlet also said Mr Kim had previously criticized Mr Yang during a party meeting last year and on Monday called his dismissal an \"incidental mistake\". Mr Kim said: \"To speak figuratively in simpler words, he [Mr Yang] was like a goat yoked to pull an ox cart. \"We should see this as an incidental mistake in our practice of personnel appointment. \"Could we expect a goat to pull a cart for an ox? \"As of today, I declare you dismissed, comrade vice premier.\" Read more from Sky News:North Korea touts progress on nuclear-powered submarineMan reveals what it's like celebrating Christmas in North Korea While a public rebuke is rare, the North Korean leader has occasionally criticised or fired senior officials in a bid to restore discipline or place blame on them for economic hardships and policy failures. In recent years, Mr Kim has pushed to overcome what he calls defeatism, irresponsibility and passiveness in economic sectors in an effort to address chronic difficulties with the country's economy, which suffered significant set-backs during the COVID-19 pandemic. North Korea's economy grew 3.7% in 2024, according to South Korea's central bank, but analysts say the country could find it difficult to achieve rapid growth because of a highly centralised economy, international sanctions and a focus on weapons programmes. The Workers' Party congress, the first of its kind in five years, is likely to open later in January or February, South Korea's spy service said."
    },
    {
        "title": "UN accuses Israel of 'unprecedented attack' as diggers start demolishing UNRWA site ",
        "description": "The United Nations has accused Israel of \"an unprecedented attack\" after diggers started demolition work at a compound used for decades by UNRWA, the UN agency that provides support to Palestinian refugees.",
        "url": "https://news.sky.com/story/un-accuses-israel-of-unprecedented-attack-as-diggers-start-demolishing-unrwa-site-13496573",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-unrwa-israel_7140485.jpg?20260120120530",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2026-01-20 11:36:00",
        "Headline": "The UN Palestinian refugee agency's former chief of staff says the move is \"another message to the world that Israel is the only country that can demolish international law and get away with it\".",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n The United Nations has accused Israel of \"an unprecedented attack\" after diggers started demolition work at a compound used for decades by UNRWA, the UN agency that provides support to Palestinian refugees. Heavy machinery smashed through structures on the site, including a former barracks building, as part of a plan to level the compound and eventually turn it into a new Israeli settlement. Itamar Ben-Gvir, Israel's uncompromising national security minister, visited the site during the demolition work and was clearly proud of what was being done, describing it as \"a very important day for the governance in Jerusalem\". He went on to claim that United Nations Relief and Works Agency (UNRWA) staff were \"supporters of terror\". The Israeli government has long alleged that the agency was \"infested\" with members of Hamas, including some who participated in the devastating attacks on 7 October 2023. UNRWA has always denied any systemic link to Hamas, and says it has investigated all alleged wrongdoing. In a statement, it said the demolition was \"a new level of open and deliberate defiance of international law\". The site, in East Jerusalem, had been used by UNRWA since 1951, shortly after the agency was first established. However, Israel introduced legislation in 2024 to ban UNRWA's operations, leading to staff leaving the compound, which includes a series of buildings, a year ago. The ban is widely contested outside Israel as a breach of both international law and the UN charter, which dictates that member states must work with UN agencies and respect their premises. The United Nations maintains that, under a 1946 charter, sites like this are \"inviolable\" - in other words, they cannot be entered without the permission of the UN. However, the Israeli government has claimed that UNRWA represents a danger to the state and cannot be tolerated. 'Greenhouse for terrorism' Oren Marmorstein, spokesperson for the Israeli foreign affairs minister, claimed that \"numerous employees within the organisation are Hamas and Palestinian Islamic Jihad terrorists\" and said that UNRWA has degraded from a humanitarian aid organisation into \"a greenhouse for terrorism\". Israel's foreign ministry said \"the seizure of this compound by Israeli authorities was carried out in accordance with both Israeli and international law.\" The UNRWA compound sits just inside East Jerusalem, meaning that, under most interpretations of international law, it is considered occupied territory, having been seized by Israel during the 1967 war. The United Nations still pays money to Jordan to lease the land, but Israel does not accept the legality of that agreement. In a statement, the Palestinian Authority's foreign ministry said the demolition work was a \"dangerous escalation, a blatant violation of international law and an infringement of the privileges and immunities of United Nations organisations\". Around a month ago, Israeli authorities entered the site, took away equipment and raised an Israeli flag. At that time, it was claimed that UNRWA owed taxes to the municipality. Now, the government has justified its work by saying that the site belongs to the Israeli state and that the UN can no longer claim immunity because the compound is vacant and unused. Read more from Sky News:Spain begins three days of mourning after train crash Surfer 'lucky to survive' Sydney's fourth shark attack in three days Israel claim 'absolute nonsense' A UN official described that claim as \"absolute nonsense\" and added: \"They can say what they like, but it doesn't make it real.\" The rows over the site are another example of the tension between Israel and the United Nations, which Israel considers to be institutionally biased against it. It has angrily rejected claims made by the UN of famine in Gaza, while a UN committee alleged that Israel was committing genocide, provoking a furious backlash from Jerusalem. Hakam Shahwan, UNRWA's former chief of staff, told Sky News: \"This is another message to the world that Israel is the only country that can demolish international law and get away with it. It's extremely sad and frustrating. UNRWA must remain strong and united in the face of this criminal act.\""
    },
    {
        "title": "Sir David Beckham refuses to answer Sky News questions in Davos",
        "description": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos.",
        "url": "https://news.sky.com/story/sir-david-beckham-refuses-to-answer-sky-news-questions-in-davos-13496537",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-beckham-davos_7140314.jpg?20260120095443",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-20 09:53:00",
        "Headline": "Sir David was asked if he had a message for his son and if he was disappointed that family business was being aired in public.",
        "Content": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos. On Tuesday, Brooklyn Peltz Beckham broke his silence about his estrangement from his parents, saying in a post on social media he does not want to reconcile with his family. Asked about his son's statement in Switzerland on Tuesday by Sky News business correspondent Paul Kelso, Sir David refused to comment. He was asked if he had a message for his son and if he was disappointed that family business was being aired in public. In a statement shared on his Instagram story, Brooklyn offered his explanation for the alleged rift. The 26-year-old wrote: \"I have been silent for years and made every effort to keep these matters private. \"I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life. \"All we want [is] peace, privacy and happiness for us and our future family.\" Read more:What Brooklyn's claims tell us about the Beckham rift Brooklyn, the eldest son of footballer Sir David and former Spice Girl Victoria Beckham, married Nicola Peltz in 2022. She is the daughter of American billionaire businessman Nelson Peltz and former model Claudia Heffner Peltz. The couple live together in Los Angeles. Sir David, who is now co-owner of Inter Miami CF and has made millions from endorsements and commercial partnerships, was in Davos recording a podcast. 'Children are allowed to make mistakes' Speaking about the economy and the sports business with CNBC, Sir David was also asked about young people and social media use. Pointing to his role as goodwill ambassador for UNICEF, as well as his relationship with his own children, he said: \"I've been able to use my platform and following for UNICEF, and it's been the biggest tool to make people aware of what's going on around the world for children. \"I've tried to do the same with my children, to educate them, they make mistakes. Children are allowed to make mistakes, that's how they learn... but you know you have to sometimes let them make those mistakes as well.\" 'Posh and Becks' - Britain's best known power couple The former midfielder received his knighthood for his services to sport and charity from the King at an investiture ceremony at Windsor Castle in November. He married his wife, Victoria, who is now a fashion designer and businesswoman, in 1999. Thanks to a combination of sports and entertainment credentials paired with savvy business instincts, \"Posh and Becks\" quickly became Britain's best-known power couple. They have four children together: three sons, Brooklyn, Romeo, 23, and Cruz, 20, and one daughter, Harper, 14. Read more:Nicola Peltz Beckham denies 'feud'Victoria awarded prize from daughterSir David Beckham gets knighthood There has been widespread media speculation about a rift in the Beckham family since Brooklyn's wedding to Nicola Peltz in 2022, but Brooklyn's six-page statement, shared with his 16.1 million followers, is the first public acknowledgement of any bad blood. It's been widely reported that Brooklyn did not attend his dad's 50th birthday celebrations in May. Brooklyn now claims he was in the UK, but that his dad only agreed to see him under the condition that his wife was not invited. I have been silent for years and made every effort to keep these matters private. Unfortunately my parents and their team have continued to go to the press, leaving me with no choice but to speak for myself and tell the truth about only some of the lies that have been printed. I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life.' For my entire life, my parents have controlled narratives in the press about our family. The performative social media posts, family events and inauthentic relationships have been a fixture of the life I was born into. To read the full statement, click or tap here. 'Overexplaining would most definitely backfire,' says celebrity crisis expert Laura Beeching, the founder of the crisis management agency Honest London told Sky News she would not expect the Beckhams to comment on Brooklyn's posts in a hurry. \"Silence is definitely key here. Anything more than a minimal response risks reinforcing what Brooklyn's argument is that everything is managed and strategic,\" she said. \"I would suggest no explanation, no rebuttal, no expansion, because overexplaining it would most definitely backfire. As you can see in Brooklyn's very long statement, it's very emotional. \"[I tell my clients] less is more when it comes to statements, because every actual word you put into a statement, that's another thing that people can analyse and dissect. Even down to the wedding dress comment that [Brooklyn] put out. \"People have already disputed that with what was written in Vogue back in 2022, I believe, and that's the issue when you go to detail. I would be very shocked at the Beckhams speaking out on this.\" The Beckham family are yet to publicly respond to Brooklyn's posts, but have shared promotional posts for Cruz's first music gig at the Courtyard Theatre in east London in March. Meanwhile, Nicola Peltz has not commented on social media, instead sharing tributes to late fashion designer Valentino in her Instagram stories. Sky News has contacted David and Victoria Beckham for comment."
    },
    {
        "title": "Trump offers ominous message on Greenland ahead of crunch talks with European leaders",
        "description": "\"You'll find out.\"",
        "url": "https://news.sky.com/story/trump-offers-ominous-message-on-greenland-and-says-starmer-gets-a-little-rough-with-him-13496909",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-greenland_7141126.jpg?20260120231956",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-20 23:13:00",
        "Headline": "It was an \"extraordinary inconsistent ramble… even by his standards\" said Sky's US correspondent Mark Stone, following the US president's surprise White House news conference on Tuesday.",
        "Content": "\"You'll find out.\" That was the ominous reply from Donald Trump when asked how far he would go to wrest control of Greenland. He offered the warning at the end of a long and rambling White House news conference on Tuesday, ahead of crunch talks with European leaders in Davos, Switzerland. Trump's news conference as it happened The briefing, held to mark a year since he took office, comes at a time of unprecedented tension between the US and Europe, fuelled by Mr Trump's desire to annex Greenland. Currently, the Arctic island is part of Denmark, an ally with which the US has a defensive pact, yet the president hasn't ruled out seizing it by force. Trump claims 'things are going to work out' Asked again whether he would endanger NATO by going after an ally's territory, Mr Trump doubled down on his belief that the US \"needs\" it. \"I think that we will work something out where NATO is going to be very happy, and where we're going to be very happy,\" he said. \"But we need it for security purposes, we need it for national security and even world security.\" He also said he would raise the matter at the World Economic Forum in Davos on Wednesday. \"And I think things are going to work out pretty well,\" he claimed. Starmer can 'get a little rough', says Trump So far, Mr Trump's designs on Greenland have faced vocal opposition from his NATO allies. When several European nations contributed troops to a reconnaissance mission in Greenland, he took it as a provocation. In response, he threatened the countries with 10% tariffs from 1 February, raising to 25% from 1 June, unless the US is allowed to buy the territory. Read more:What Trump's tariff threat means for Europe Against this backdrop, British Defence Secretary John Healey will travel to Copenhagen on Wednesday to meet his Danish counterpart Troels Lund Poulsen. While Mr Trump was positive when asked how he gets on with his British and French counterparts, he said Sir Keir Starmer and Emmanuel Macron - who have criticised his tariffs threat - \"get a little bit rough when I'm not around\". \"But when I'm around they treat me very nicely,\" he added. It comes after Mr Trump attacked Sir Keir's deal to hand over the Chagos Islands to Mauritius, despite having backed it just last year. Read more:What is the Chagos deal? He also used the occasion to address Venezuela, whose president Nicolas Maduro was abducted by the US in a raid on Caracas this month. Mr Trump said his administration had taken 50 million barrels of oil out of the South American country so far, and that it would bring down prices in the US. And he once again aired his grievances about not receiving a Nobel Peace Prize, saying he'd \"lost a lot of respect for Norway\" over the matter. But most of the briefing was concerned with singing his own praises, darting from subject to subject for nearly two hours. It was an \"extraordinary inconsistent ramble... even by his standards\" said Sky's US correspondent Mark Stone. \"The right-wing US news networks stuck with it, but others moved on, skipping the monologue, dipping back only for the questions,\" Stone said. He continued: \"I'd argue that his ramblings - today more than any day - are on a different level from what we saw with Biden. \"The numerous conservative policy achievements - job numbers up, immigration down, crime down - are lost behind the ramble.\""
    },
    {
        "title": "US chess grandmaster had multiple drugs in his system when he died",
        "description": "An American chess grandmaster had multiple drugs in his system when he died, a fresh toxicology report has revealed.",
        "url": "https://news.sky.com/story/us-chess-grandmaster-had-multiple-drugs-in-his-system-when-he-died-13496778",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-daniel-naroditsky-chess_7056917.jpg?20251021044834",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-20 19:12:00",
        "Headline": "Daniel Naroditsky, 29, was found dead at his home in North Carolina in October last year.",
        "Content": "An American chess grandmaster had multiple drugs in his system when he died, a fresh toxicology report has revealed. The chess world was rocked in October last year when Daniel Naroditsky was found unconscious at home on a sofa by his friends, in Charlotte, North Carolina. He was 29 years old. Now a new toxicology report has found the former child prodigy had methamphetamine, amphetamine, 7-hydroxymitragynine and mitragynine in his system, Sky's US partner network NBC News reports. Whilst methamphetamine and amphetamine are synthetic stimulants, 7-hydroxymitragynine and mitragynine are major psychoactive ingredients found in Kratom - a southeast Asian plant that can be used as a stimulant. Read more from Sky News:Russell Brand appearing in courtBeckham refuses to answer questions However, the plant can \"lead to psychotic symptoms, and psychological and physiological dependence,\" the American Drug Enforcement Administration warned. One of his friends who found him, fellow chess grandmaster Oleksandr Bortnyk, later said Mr Naroditsky had been distraught after one of his chess heroes, former world chess champion Vladimir Kramnik, accused him of cheating. \n                  Colombian rebels must unite to fight US, guerrilla leader says\n                 \n                  US senators vote to curb Trump's ability to take more Venezuela military action\n                 \n                  Motorcycles worth $40m seized in hunt for ex-Olympic snowboarder on FBI's Ten Most Wanted list\n                 Kramnik, 50, told NBC News that he has been the \"subject of a bullying and slandering PR campaign\", as well as ongoing threats to him and his family following Naroditsky's death. The World Chess Federation (known as FIDE) said Kramnik could be banned from the organisation entirely following Naroditsky's death. FIDE did not immediately respond to a request for comment, NBC reported."
    },
    {
        "title": "Russell Brand appears in court via video link from US to face further rape and sexual assault charges",
        "description": "Russell Brand has been granted bail after a video court appearance charged with two further sexual offences, including rape.",
        "url": "https://news.sky.com/story/russell-brand-granted-bail-after-appearing-in-court-on-video-link-from-us-charged-with-new-offences-13496663",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-russell-brand_7140638.jpg?20260120144211",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-20 14:22:00",
        "Headline": "The comedian and actor appeared at Westminster Magistrates' Court on Tuesday on a video link from the US accused of one count of rape and one of sexual assault. He had previously denied other charges of rape, indecent assault and sexual assault in relation to earlier alleged offences.",
        "Content": "Russell Brand has been granted bail after a video court appearance charged with two further sexual offences, including rape. The comedian and actor appeared at Westminster Magistrates' Court on Tuesday on a video link from the US accused of one count of rape and one of sexual assault, which are both alleged to have taken place in 2009. He had previously denied two other counts of rape, one count of indecent assault and two counts of sexual assault in relation to alleged offences between 1999 and 2005, involving four women. Brand, wearing a denim shirt with a number of buttons undone, spoke only to confirm his name and date of birth during the six-minute hearing. He was bailed to appear at Southwark Crown Court on 17 February. According to court documents, the two latest alleged offences took place in London. A trial is planned at Southwark Crown Court later this year in relation to the five original charges. Brand, 50, rose to prominence as a comedian in the mid-2000s, before finding success in Hollywood with the 2008 film Forgetting Sarah Marshall and its 2010 spin-off, Get Him To The Greek."
    },
    {
        "title": "Netflix boosts offer for Warner Bros Discovery",
        "description": "Netflix has boosted its offer for media giant Warner Bros Discovery (WBD) as it seeks to fend off a hostile takeover from entertainment conglomerate Paramount.",
        "url": "https://news.sky.com/story/netflix-boosts-offer-for-warner-bros-discovery-13496610",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-warner-bros-logo_7140599.jpg?20260120135548",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-20 12:45:00",
        "Headline": "The all-cash offer could mean a shareholder vote on the deal takes place in three months, an \"accelerated\" timeline, a joint statement said. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Netflix has boosted its offer for media giant Warner Bros Discovery (WBD) as it seeks to fend off a hostile takeover from entertainment conglomerate Paramount. The streaming giant is now offering to pay just cash, ditching a Netflix shares element, in an attempt to improve the attractiveness of its bid. The total value of the deal, $82.7bn (£61.4bn), is unchanged. The amount each WBD shareholder would receive is also unchanged at $27.75 (£20.63) per WBD share. The value price per share means Netflix's offer equates to $72bn (£53.50bn), but the deal gives the assets a total value of $82.7bn. Money blog: Date of next interest rate cut may have just become clearer Such an offer \"simplifies\" the purchase, \"provides greater certainty of value\" for WBD stockholders, and an \"expedited timeline\" for WBD stockholders to vote on Netflix's proposal, according to a statement from Netflix and WBD. It makes it clearer what each stockholder will get when the transaction closes, as Netflix's share price has fallen since it announced the merger plans. A vote could take place by April, the statement said. Paramount, which launched a hostile takeover bid for WBD, had gone over the heads of the WBD board, directly to shareholders and offered $30 (£22.30) cash for each share. The Netflix offer to buy the streaming portion of WBD's business was unanimously recommended to shareholders by the WBD board, while the Paramount Skydance offer has been rejected. Even if accepted by the shareholders, any deal is subject to regulatory approval. Why does it matter? A merger of WBD and either Paramount Skydance or Netflix would be one of the biggest media deals in history, with significant impacts on TV, filmmaking and the possible future of the cinema. Netflix has been sceptical over the future of cinema theatres, with the films it produces having short spells in theatres and some being released directly to streaming. Possible Netflix ownership of WBD's film production companies could mean fewer or shorter duration theatre runs for films. If Paramount Skydance is successful in its takeover attempt, it would own CNN, as well as CBS News, sparking concern about concentrating news services within a small number of companies linked to Donald Trump's allies. Paramount Skydance's chair and chief executive, David Ellison, is the son of billionaire Larry Ellison, an ally of the US president."
    },
    {
        "title": "Inside the new breed of 'zero bills' homes where you pay nothing for your energy",
        "description": "Elliott Wood has something you're probably going to want.",
        "url": "https://news.sky.com/story/what-cost-of-living-crisis-why-elliott-pays-absolutely-nothing-to-power-his-home-13496916",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-victoria-seabrook-elliott-wood_7141165.png?20260121013419",
        "type": "Business",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-20 23:33:00",
        "Headline": "The government's long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. Is this a realistic vision of the future?",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Elliott Wood has something you're probably going to want. Like most of us, every month he gets a bill for his monthly energy use. Only his bill… is free. He's living in a new breed of \"zero bills\" homes, which comes with solar panels, heat pumps and batteries. Together, that technology generates more electricity than Elliot uses. When combined with the right tariff - in his case a zero bills tariff with Octopus Energy - the excess electricity is sold back to the grid, and his bill comes in at a princely sum of £0 a month. \"It's amazing… you just don't have to worry,\" says 26-year-old Elliott, who lives in a one-bedroom rental house with his partner in Milton Keynes. \"There is no stress at the end of each month, [wondering] 'have we had too many showers, has the heating been on too much, have we used the microwave too many times?'\" The zero bills scheme does come with a few caveats: the tariff is only guaranteed for five to 10 years, and it doesn't include electric vehicle charging. But Octopus estimates it will save an average household of two to three beds approximately £1,758 a year on bills, based on current Ofgem price cap rates. Now for the bad news… But only a few hundred of these homes are up and running, meaning for most of us, the zero bill home remains a pipe dream. In fact Britain has some of the most leaky, drafty and gas reliant homes in Western Europe - and that's a major vulnerability. Approximately 85% of homes rely on gas for heating, more than half of which we import, only for some of that hard work to go to waste as the heat drifts out through uninsulated Victorian brickwork. That means cold, damp homes that are expensive to run, leaving a staggering 2.7m UK households living in fuel poverty. Housing and buildings are also the second biggest polluting sector in the UK, after transport, something that must fall if the country is to hit its climate targets. Quest to upgrade Britain's homes The government aims to tackle all these problems in one fell swoop. Its long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. The £14.7bn strategy will pay for measures like insulation, solar panels, batteries, and heat pumps that can lower bills and cut gas use. These won't see bills falls to zero, like Elliott's, but ministers say it could slash some bills by several hundred pounds. Ministers says the plan will upgrade five million homes and lift \"up to\" one million families out of fuel poverty by 2030. If done well, upgrading homes is an effective way to slash bills and reduce damp, and campaigners and industry have broadly welcomed the idea. But previous attempts to upgrade homes have tried and failed. It's not clear how officials can enforce landlords to upgrade properties, or who to trust to insulate homes, or whether electricity costs will come down enough to truly reap the benefits of a heat pump. Energy UK's CEO Dhara Vyas said: \"Supporting better access to clean heat systems, solar panels, batteries, and insulation will help millions of households across the UK bring down their energy bills. But she said to \"ensure the plan realises its full potential, it will be important to tackle the factors that currently make electricity artificially expensive.\" The key to the cost of living crisis? As more people get off gas heating and on to electric heat pumps, it should also reduce the UK's imports of gas. The government sees a geopolitical value in weaning the country off gas it has to buy from abroad, as opposed to clean power it can harness at home - albeit using Chinese components. First it wanted to reduce reliance on Russia, but now even buying gas from the US has taken on a new risk with a less predictable president in the White House. No one in government would say that out loud, yet, but who knows what levers Donald Trump might pull on Europe to get his way on Greenland. And while reducing energy imports is good for security, there's a risk that with fewer people paying gas bills, those left will shoulder higher costs to keep the system running. Read more from Sky News:Trump's ominous Greenland messageStarmer's biggest crisis could be closer to home On top of that, the Warm Homes plan is still just a plan - and previous attempts to deliver have failed. But the government has staked its reputation on easing the cost of living and slashing household bills. Prime Minister Sir Keir Starmer said: \"This is a government bearing down on the cost-of-living crisis… giving people the security and the fair shot they need to get on in life.\" That claim will be judged largely on whether this new plan to upgrade homes sinks or swims."
    },
    {
        "title": "Netflix disappoints investors after bid for Warner Bros simplified",
        "description": "Netflix has seen its shares fall sharply despite upbeat financial results revealed hours after it simplified an offer for Warner Bros in a bid to get the deal over the line.",
        "url": "https://news.sky.com/story/netflix-disappoints-investors-after-sweetened-bid-for-warner-bros-13496797",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-paramount-netflix-warner_7106396.jpg?20251210102854",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2026-01-20 20:18:00",
        "Headline": "There's plenty of excitement over the takeover battle but Netflix investors have taken some money off the table following its latest set of financial results.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Netflix has seen its shares fall sharply despite upbeat financial results revealed hours after it simplified an offer for Warner Bros in a bid to get the deal over the line. The world's largest streaming service by subscriber numbers said paid households had swelled to a record 325 million over the final three months of 2025. They had stood at 300 million a year earlier. Its fourth quarter results also showed revenues of $12.1bn during the crucial period, which includes Christmas, beating analysts' estimates. Money latest: How much you need for a house deposit across the UK But shares were down 5% in after-hours trading following a flat performance during the day. This was explained, analysts said, by its forward-looking guidance on revenue and profits missing expectations at a time of nerves over its move for Warner Bros. Netflix said earlier on Tuesday it had changed the terms of its $72bn (£53.5bn) offer for Warner Bros Discovery's (WBD's) studios, back catalogue and HBO Max streaming division. \n                  Inside the new breed of 'zero bills' homes where you pay nothing for your energy\n                 \n                  Private sector wage rises drop to a five year low\n                 \n                  Next steps forward with winning bid for Russell & Bromley \n                 The bid - already backed by WBD - now comprised only cash, removing an element of the deal that included Netflix shares, it said. The total value of the deal, $82.7bn (£61.4bn), is unchanged. The earlier cash-and-shares offer had been seen as adding complication, especially as shares offer no guarantee of future value in the face of a rival, hostile, all-cash bid from Paramount Skydance. WBD and Netflix said in a joint statement that the revised Netflix offer \"simplifies\" the purchase, \"provides greater certainty of value\" for WBD stockholders and an \"expedited timeline\" for WBD stockholders to vote on Netflix's proposal. During a video conference with analysts, co-chief executive Ted Sarandos said he was \"confident\" of securing all the necessary regulatory approvals globally, amid concerns including over existing streaming market dominance. The deal could be put to a shareholder vote in April. The bid on the table from Paramount Skydance is different in that it seeks to buy the whole of WBD for $108.4bn (£80bn) and has been rejected by the company. Paramount argues that its bid offers superior value. WBD says there are \"deficiencies\" in that bid. Its tender offer to acquire WBD - which gives WBD shareholders the opportunity to lend their support - is currently scheduled to expire late on Wednesday but is expected to be extended. Paramount may decide to revise its own terms or offer but the biggest clue to its intentions came when it confirmed plans for a so-called proxy fight in a bid to win the day. This amounts to a campaign seeking a clear out of the Warner Bros board in favour of directors who support its own bid."
    },
    {
        "title": "Private sector wage rises drop to a five year low",
        "description": "Private sector wage growth has dropped to the lowest rate in five years, new official figures show. ",
        "url": "https://news.sky.com/story/private-sector-wage-rises-drop-to-a-five-year-low-13496453",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-workers-london_6894544.jpg?20250423124824",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-20 06:19:00",
        "Headline": "New official figures also reveal unemployment has remained at 5.1%, up from 4.1% when Labour took office. Analysts predict the rate will now rise.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Private sector wage growth has dropped to the lowest rate in five years, new official figures show.  But in the public sector wages are still \"elevated\" according to the Office for National Statistics (ONS) due to the continued impact of earlier pay deals. Public sector workers saw their annual earnings increase by 7.9%, while private sector staff saw an average 3.6% pay increase. The figures mean people are still getting pay rises, but they are smaller than they had been. New unemployment figures were also released on Tuesday. They show the jobless rate remained at 5.1% in the three months to November - a period dominated by talk of a tough budget ahead - the data from the ONS revealed. The rate had stood at 4.1% when Labour took office in 2024. Falls to come \n                  'Major risk' to global economy from increased tariffs, IMF says\n                 \n                  High street giant Next has bumper Christmas but remains cautious amid worsening UK jobs market\n                 \n                  Major FTSE record as much about companies not in the index as the ones that are\n                 It is, however, expected to rise further in the coming months as higher employment costs dampen demand for new staff. Accounting firm, KPMG, expects unemployment to hit 5.3% by the end of the year, while investment bank Goldman Sachs thinks it could be 5.3% by March. Employers have already cut back on hiring. HMRC payroll figures from December show 184,000 fewer people employed compared to the same month in 2024. The increase in employers' national insurance contributions and \"skyrocketing\" staffing costs, combined with concerns over the Employment Rights Act, hampered hiring and limited pay awards, according to the Institute of Chartered Accountants in England and Wales (ICAEW). It warns that \"this slowdown in wage growth should gather pace in the coming months as elevated employment costs increasingly restrain pay settlements\", and lead to \"weaker consumer spending\". What does it mean for interest rates? The weakening jobs market is unlikely to prompt the Bank of England's interest rate setters to make borrowing cheaper when they meet next month. Tuesday's figures could be enough for them to delay an interest rate until April, according to economic research firm Pantheon Macroeconomics."
    },
    {
        "title": "Next steps forward with winning bid for Russell & Bromley ",
        "description": "Next is closing in on a deal to add Russell & Bromley (R&B) to its stable of brands as another prominent retail name prepares to disappear from the high street.",
        "url": "https://news.sky.com/story/next-steps-forward-with-winning-bid-for-russell-bromley-13496760",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-russell-and-bromley_7057589.jpg?20251021183834",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-20 18:18:00",
        "Headline": "The FTSE 100 fashion group and bidding partner Retail Realisation could strike a formal deal to take over the 145 year-old shoe retailer as early as Wednesday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Next is closing in on a deal to add Russell & Bromley (R&B) to its stable of brands as another prominent retail name prepares to disappear from the high street. Sky News has learnt that the fashion chain and its bidding partner, the stock clearance specialist Retail Realisation, could strike a deal to buy R&B as soon as Wednesday. People close to the situation cautioned that an agreement had yet to be struck and it remained possible that it could fall apart. Money latest: How much you need for house deposit around UK However, Next and Retail Realisation are understood to have emerged as the clear frontrunners to acquire the 145 year-old family-owned retailer. Newspaper reports at the weekend suggested that the groups which own fashion brands Bench and Weird Fish were also in the running for R&B. Sky News revealed earlier this month that Next had partnered with Retail Realisation on the deal, with a transaction likely to spell the end for the shoe chain's 37 stores. \n                  Inside the new breed of 'zero bills' homes where you pay nothing for your energy\n                 \n                  Netflix disappoints investors after bid for Warner Bros simplified\n                 \n                  Private sector wage rises drop to a five year low\n                 Next would become the owner of Russell & Bromley's brand, with Retail Realisation, which is affiliated with high street investor Modella Capital, taking charge of a stock liquidation process. Next has, however, stepped away from pursuing a similar deal for LK Bennett, the fashion brand which filed a notice of intention to appoint administrators this month. Employing more than 450 people, Russell & Bromley made its debut in 1880 with the opening of its first shop in Eastbourne. Seven years earlier, George Bromley and Elizabeth Russell, both of whom hailed from shoemaking families, were married, paving the way for the establishment of the business. Russell & Bromley is now run by Andrew Bromley, the fifth generation of his family to hold the reins. Billie Piper, the actress and singer, is the current face of the brand as it tries to appeal to younger consumers as part of a five-year turnaround plan. In recent years, Next has bought brands such as Cath Kidston, Joules and Seraphine, the maternitywear retailer for knockdown prices. Next also owns Made.com, the online furniture retailer, and FatFace, the high street fashion brand. Under Lord Wolfson, its veteran chief executive, Next has defied the wider high street gloom to become one of the UK's best-run businesses. It recently upgraded its full-year profit forecast after a successful Christmas trading period. Next did not respond to a request for comment, while Retail Realisation and Interpath, which is advising R&B, declined to comment."
    },
    {
        "title": "FCA braced for backlash over move to increase office attendance",
        "description": "The City regulator has told thousands of staff that they will be required to work in its offices or equivalent locations for at least half the time from later this year, risking the renewal of a showdown which last year led to threats of industrial action.",
        "url": "https://news.sky.com/story/fca-braced-for-backlash-over-move-to-increase-office-attendance-13496602",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-fca-financial-conduct_6759446.jpg?20241127163152",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-20 12:36:00",
        "Headline": "The City watchdog has warned thousands of employees that they will need to reduce the amount of time they spend working from home, in a memo seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The City regulator has told thousands of staff that they will be required to work in its offices or equivalent locations for at least half the time from later this year, risking the renewal of a showdown which last year led to threats of industrial action. Sky News has learnt that the Financial Conduct Authority (FCA) rushed out a communication to employees on Tuesday, which included a stipulation that all executive directors and directors will have to work at least 60% of their time in the office, beginning in September. The rest of its workforce will be set a 50% minimum office attendance level - up from the current ratio of 40%, or two days a week. The FCA had scheduled internal meetings with thousands of staff on January 28 to communicate the outcome of a review of its working from home policy. After Sky News revealed some details of the plans earlier in the day, executive director Sarah Pritchard wrote to staff to communicate \"our headline approach\". In her email, a copy of which has been seen by Sky News, Ms Pritchard said compliance with the revised policy would be assessed over a three-month period, rather than on a monthly basis. \"We believe that a minimum 50/50 split between time in the office and at home will deliver greater collaboration and innovation, support the mentoring and development of colleagues, help us to solve complex or novel problems more easily, reduce miscommunication and strengthen our shared senses of purpose,\" she wrote. \n                  Inside the new breed of 'zero bills' homes where you pay nothing for your energy\n                 \n                  Netflix disappoints investors after bid for Warner Bros simplified\n                 \n                  Private sector wage rises drop to a five year low\n                 The FCA has been contacted for comment. Last year, the Unite union which represents many FCA staff warned that strike action could not be ruled out if the office attendance requirement was increased. The response of the regulator's staff to the announcement will underline the sensitivities which remain around hybrid working, even after many of the companies that the FCA regulates have ordered some staff to resume full-time office working."
    },
    {
        "title": "Netflix boosts offer for Warner Bros Discovery",
        "description": "Netflix has boosted its offer for media giant Warner Bros Discovery (WBD) as it seeks to fend off a hostile takeover from entertainment conglomerate Paramount.",
        "url": "https://news.sky.com/story/netflix-boosts-offer-for-warner-bros-discovery-13496610",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-warner-bros-logo_7140599.jpg?20260120135548",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-20 12:45:00",
        "Headline": "The all-cash offer could mean a shareholder vote on the deal takes place in three months, an \"accelerated\" timeline, a joint statement said. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Netflix has boosted its offer for media giant Warner Bros Discovery (WBD) as it seeks to fend off a hostile takeover from entertainment conglomerate Paramount. The streaming giant is now offering to pay just cash, ditching a Netflix shares element, in an attempt to improve the attractiveness of its bid. The total value of the deal, $82.7bn (£61.4bn), is unchanged. The amount each WBD shareholder would receive is also unchanged at $27.75 (£20.63) per WBD share. The value price per share means Netflix's offer equates to $72bn (£53.50bn), but the deal gives the assets a total value of $82.7bn. Money blog: Date of next interest rate cut may have just become clearer Such an offer \"simplifies\" the purchase, \"provides greater certainty of value\" for WBD stockholders, and an \"expedited timeline\" for WBD stockholders to vote on Netflix's proposal, according to a statement from Netflix and WBD. It makes it clearer what each stockholder will get when the transaction closes, as Netflix's share price has fallen since it announced the merger plans. A vote could take place by April, the statement said. Paramount, which launched a hostile takeover bid for WBD, had gone over the heads of the WBD board, directly to shareholders and offered $30 (£22.30) cash for each share. The Netflix offer to buy the streaming portion of WBD's business was unanimously recommended to shareholders by the WBD board, while the Paramount Skydance offer has been rejected. Even if accepted by the shareholders, any deal is subject to regulatory approval. Why does it matter? A merger of WBD and either Paramount Skydance or Netflix would be one of the biggest media deals in history, with significant impacts on TV, filmmaking and the possible future of the cinema. Netflix has been sceptical over the future of cinema theatres, with the films it produces having short spells in theatres and some being released directly to streaming. Possible Netflix ownership of WBD's film production companies could mean fewer or shorter duration theatre runs for films. If Paramount Skydance is successful in its takeover attempt, it would own CNN, as well as CBS News, sparking concern about concentrating news services within a small number of companies linked to Donald Trump's allies. Paramount Skydance's chair and chief executive, David Ellison, is the son of billionaire Larry Ellison, an ally of the US president."
    },
    {
        "title": "M&S technology chief quits less than a year after cyber attack",
        "description": "Another of Marks & Spencer's (M&S) most senior technology executives is leaving the company less than a year after its operations were devastated by a cyber attack.",
        "url": "https://news.sky.com/story/ms-technology-chief-quits-less-than-a-year-after-cyberattack-13496516",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-marks-and-spencer-shop_6896501.jpg?20250425144859",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-20 08:45:00",
        "Headline": "Josie Smith is stepping down as Marks & Spencer's chief technology officer nine months after the cyber attack, which halted its online sales operations for weeks, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Another of Marks & Spencer's (M&S) most senior technology executives is leaving the company less than a year after its operations were devastated by a cyber attack. Sky News has learnt that Josie Smith, the retailer's chief technology officer, is stepping down just 18 months after joining the company. Her departure was disclosed internally this week in a memo which said she had \"decided to leave M&S\". Ms Smith, who previously worked at BT Group and Vodafone, will be replaced by Darren Gibson, the fashion, home and beauty technology transformation director. Her exit comes four months after Rachel Higham, M&S's chief digital and technology officer, left the business. Last year's cyber attack cost M&S hundreds of millions of pounds and underlined the extent to which leading British companies are now vulnerable to widespread disruption from hackers. The April incident, which was conducted by a group called Scattered Spider, brought its online operations to a halt for weeks. \n                  Ex-teen hackers warn parents are clueless as children steal 'millions'\n                 \n                  London councils hit by 'cyber attack' with data potentially compromised\n                 \n                  Direct cost of Jaguar Land Rover cyber attack which impacted UK economic growth revealed\n                 Earlier this month, it reported a fall in like-for-like clothing sales during the crucial Christmas trading period, which it partly blamed on \"the long tail\" effects of the cyber attack. Monday's internal memo also said that Krista Nordlund, M&S's chief product officer, would leave the company in July to return to the US. An M&S spokeswoman confirmed the contents of the memo."
    },
    {
        "title": "Beth Rigby: Forget Greenland for now, Starmer's biggest crisis could be closer to home",
        "description": "Sir Keir Starmer was not meant to be doing an emergency news conference on the Greenland crisis in the Downing Street briefing room on Monday.",
        "url": "https://news.sky.com/story/beth-rigby-starmers-bigger-crisis-could-be-closer-to-home-and-may-decide-his-fate-13496816",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-downing-street_7141156.png?20260121004658",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-20 21:11:00",
        "Headline": "While the prime minister focuses on foreign affairs, his deputy Labour leader has a message for those frustrated with his performance back home. But voters will soon have their say, and it looks ominous.",
        "Content": "\n          Political editor\n              @BethRigby\n Sir Keir Starmer was not meant to be doing an emergency news conference on the Greenland crisis in the Downing Street briefing room on Monday. The prime minister was meant to be about 200 miles away, delivering a speech much closer to voters' concerns around household budgets and what this Labour government is doing to try to help. 2026 was supposed to be the year in which he tried to win back disillusioned voters - and MPs - with a big push to cut the cost of living, be it around rail fares, energy bills, childcare or lifting the two-child benefit cap. Instead, he has found his agenda blown wildly off course by the whirlwind that is Donald Trump. But what matters on the global stage affects voters at home: tariffs will hurt the economy and could cost jobs. Conflicts drive up costs, be it in your shopping basket or heating your home. As the prime minister put it on Monday when he called out Trump on his tariff threat over Greenland: \"In today's world geopolitics is not something that happens somewhere else…when instability grows it's rarely those with the most power who pay the price… we must use every tool of government, domestic and international, to fight for the interests of ordinary people, tackling the cost of living today also means engagement beyond our borders.\" As Starmer does that, deputy Labour leader Lucy Powell is taking on the role of \"campaigner in chief\" for the party ahead of the May elections. Because as global crises keep rolling, Labour could be running into a polling crisis at home. Later this year, Labour will be contesting 4,000 council seats, representing 20 million voters, plus Scotland's Holyrood and Wales's Senedd. They come with the party trailing Reform and the Conservatives on 17% of the vote. It is a perilous predicament in what looks set to be a bloody set of elections which could see Labour pushed into third place behind Reform in Scotland and Wales, where Labour could control of the Senedd for the first time ever. The resignation of first minister and Welsh Labour leader Eluned Morgan would surely come shortly after if that becomes Welsh Labour's fate. But Powell, MP for Manchester Central, who became deputy leader in November, doesn't seem daunted by the task. The core message When I meet her in a community centre of her patch run by the Manchester Settlement, she has a clear message for her party: Labour must focus relentlessly on what matters to voters and get behind Starmer. \"The cost of living crisis and cost of living issues are absolutely in the fore of everyone's mind, and I think it's important for us as politicians […] to just constantly remind ourselves that for most people, they're struggling to pay their rent, they're struggling with their housing costs, they're struggling to pay the bills,\" she said. \"I think people really want to know we are on their side and working every single day as a government to rewire the country and reshape the economy so that life works better for them. I just don't know that we have really pulled it together more strongly as a story.\" Read more from Sky News:Beth Rigby: I've never seen PM look so graveEverything we know about China's new super-embassyWill EU unleash its most powerful trade weapon? 'Worst of all worlds' if Labour turn on PM Part of Powell's job is to remedy that - and the deputy leader is proving more loyal to the leadership than many of her colleagues had perhaps expected. The soft left Labour MP was sacked from the cabinet by Starmer and was not the leadership's choice in the battle to replace Angela Rayner. There were many who thought she would be a constant thorn in Starmer's side, but instead her message to colleagues is to \"not undermine Keir, not undermine ourselves\". \"I do think that's probably counter-intuitive for some people to see me saying that, because obviously part of my election was [because] people wanted to see us change a bit and have a course correction and do better than what we've been doing - and that is the mandate I've got,\" she admitted. \"But I strongly believe we're not going to do that if we all turn in on ourselves and have months and months and months of this constant speculation, that's the worst of all worlds. \"The Tories changed the prime minister three times in three months, and it didn't change the outcome for them at the election one jot. If we don't tell our story ourselves, no one is going to do it and that's what we've got to do.\" Who might challenge Starmer? Powell tells me Starmer will lead the party after the May elections and will be leading Labour into the next election. That she of course cannot know. But what is ringing clear in our conversation is her call for unity. It comes at a febrile time, with chatter over a possible Wes Streeting leadership bid constant as the briefings and counter-briefings roll on between Starmer supporters and allies of the health secretary. Streeting is constantly referenced by MPs as a politician with the ambition, network and funding to mount a leadership bid. Some MPs tell me it is in Streeting's interests to go sooner rather than later as the two obvious left candidates - Angela Rayner and Andy Burnham - are not ready for a challenge should it come (the former needs to get her tax situation solved and then rebuild, the latter lacks a seat in parliament). The upshot is that \"will he, won't he\" is a constant refrain in Labour circles. All of this reflects the difficult predicament Starmer is in. The situation got so bad in the run-up to Christmas, the PM's allies felt it necessary to tell MPs he would stay on and fight any rival rather than fold. That a PM was forced to say that just 18 months into his premiership, on the back of a landslide victory, was both astonishing and a reflection of just how bad things for this government had become. Foreign affairs to the rescue? But there is also huge reticence, anxiety even, about trying to turf out a sitting prime minister. As one cabinet minister put it to me last week: \"Changing the leader is a bit Tory for me. \"If we try to change the leader, the party will end up tacking to the left and that is not Labour's problem with the country, so it won't be the solution. It's probably better to try to work on making Keir Starmer better.\" The international crisis also helps Starmer, as attentions turn from domestic politics to managing the most serious rift in the transatlantic relationship in decades. As fellow party leaders fell in behind Starmer on his position on Greenland, it helped him look statesmanlike: this grave chapter in geopolitics is not a moment in which a rival would mount a leadership bid. In the meantime, Starmer will no doubt soon be back out and about, touring the country rather like he did during the 2024 election. The five pledges, six pillars and three foundations of this government - remember those? - have been buried in favour of a focus on the cost of living. As part of this, the government is now quickly ditching policies that are unpopular or distract from the core cost of living message. In Westminster parlance, this is known - to quote the former Conservative election chief Lynton Crosby - as \"scraping the barnacles off the boat\". The decision to water down the farms tax, business rates on pubs and ditch compulsory digital IDs has seen ministers get a battering in news studios for U-turns (and yes it does roil backbench MPs), but it is a short-term hit senior party figures think is worth taking. \"I think less is more,\" Powell tells me. \"I think people want to see a clearer agenda that they can connect to and that they see. And I think sometimes when you first come into government, there is this attraction of 'let's try to manage everything and do everything'. \"And you know, politics is painted in primary colours, our colour is red. Let's paint in that colour, let's paint in our primary colours and leave the kind of managing of things to other people whose job that is.\" Read more:Every Labour U-turn as Starmer rolls back on digital IDFarmers celebrate U-turn on inheritance taxSupport package for pubs expected shortly On U-turns, Powell concedes it \"would be much better to do a lot of that thinking and get things right beforehand\" - but the crux of the Labour challenge in 2026 is the government has to deliver. From Number 10 to new MPs, everyone in Labour agrees that voters - who were promised change in 2024 - need to begin to feel better off. Starmer is acutely aware that people haven't felt personally better off or seen public services improving since the 2008 financial crash, and saying it will get better isn't cutting much ice. \"People won't believe it until they feel it,\" is how one cabinet minister put it to me. To that end, there will be much more activity around cutting costs and improving the NHS, which Labour see as a proxy in voters' minds for better public services. There will be, I suspect, more barnacles off the boat, as Labour look to lessen the noise in the party and Westminster and campaign into the May elections and beyond. The government might delay reform of jury trails - the legislation is planned for March - in order to avoid a showdown with some of its backbenches. There will be many that see it as weakness from Starmer, but this is a PM who wants to dial the noise down in order to try to push Labour's dismal polling ratings up. It is a perhaps insurmountable task for a PM being tested to his limits at home and abroad. May will be a huge ballot box test for the Starmer administration - and could well determine his fate with his party."
    },
    {
        "title": "Trump's Chagos broadside leaves Starmer walking an even thinner tightrope",
        "description": "Donald Trump detonated a series of bombshells on his Truth Social overnight.",
        "url": "https://news.sky.com/story/trumps-chagos-broadside-leaves-starmer-walking-an-even-thinner-tightrope-13496652",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-trump-starmer_7138868.jpg?20260118135445",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2026-01-20 13:59:00",
        "Headline": "What's clear from sources around government is a sense that Donald Trump is trying to pressure the UK by going hostile on Chagos.",
        "Content": "\n          Political editor\n              @BethRigby\n Donald Trump detonated a series of bombshells on his Truth Social overnight. There was the leaking of private messages from France's President Emmanuel Macron, the posting of images of Canada and Greenland as part of the US, and then going all out on Sir Keir Starmer and the UK by calling the Chagos deal an \"act of great stupidity\" - opening him up to attacks from opposition MPs long-opposed to the deal. I've been speaking around government to get a sense of what the hell is going on after the prime minister sought to reiterate the UK's position on Greenland on Monday while also trying to de-escalate, stressing the strong relationship, dodging the matter of retaliatory tariffs (although not ruling it out) and avoiding any incendiary language adopted by other leaders clearly fed up with Trump. Politics latest: China's controversial 'super' embassy in London approved  What's clear is a sense that Trump is trying to pressure the UK by going hostile on Chagos - he clearly links the deal to Greenland in the post. But what is also clear is that the UK government is not going to change its position on Greenland, nor is it going to wobble on Chagos, and will press on with the agreement with Mauritius. Read more: What is in the Chagos Islands deal and why is it controversial? The lashing out against the UK and Starmer seems to be part of a bigger assault on allies - as Trump reveals private messages with Macron and shares a map of Canada as US territory, which will no doubt explode in Canada. This is what Work and Pensions Secretary Pat McFadden said: \"What we saw last night... was a series of posts criticising a number of world leaders. That may tell us that the president is frustrated right now. \"I don't really believe this is about Chagos. I think it's about Greenland and the best way to resolve that is through dialogue with the Danish government and that's what we've said all along.\" Trump is clearly frustrated that European allies are standing firm on Greenland and facing down his threats, regardless of the consequences of the tariffs. Meanwhile, his Board of Peace plan has also fallen flat as he demands $1bn (£744m) for membership of a club that seems intended to undermine the United Nations. France intends to reject Trump's invitation over concerns that it would call into question \"the principles and structure of the United Nations\", according to reports from the AFP news agency, while the UK government has \"severe reservations\" about the project's legal framework, according to The Times. On Monday, Danish foreign minister and former Danish PM Lars Lokke Rasmussen told me how surprised he'd been by Trump's public threats on social media over the weekend. He said he thought Denmark had come to an agreement with vice president JD Vance and secretary of state Marco Rubio that the profound disagreement on Greenland would be negotiated away from social media. \"The meeting we had last week left me with the clear impression that the president, honestly and full-heartedly, wanted to acquire Greenland. \"But we also made it crystal clear that this is a red line... we agreed that we should move this dialogue from social media and Truth Social and other arenas into a meeting room where we could discuss, whether there could be a solution building on what we already have agreed in the past. \"I thought, we have managed not to solve the problem, but to find a pathway forward. \"It was disrupted by the statement from the president. And that's a reality of life,\" he told me. Read more: Beth Rigby: NATO faces crisis - I've never seen PM look so grave It's a reality all leaders are dealing with, as Trump's increasingly erratic behaviour with allies makes the US almost impossible to deal with, though the UK's position is that it must continue to try. Last night I was told it was \"highly unlikely\" Starmer would attend Davos, given that there is no sign of any resolution or big set piece, multilateral meeting in resolution of the biggest matters for the UK and EU - Greenland and Ukraine. 👉Listen to Politics at Sam and Anne's on your podcast app👈 But I'm told there will be engagement with the US on Tuesday and a conversation in Davos between UK and US players. Trump turning on Starmer after all the prime minister's efforts to build a good relationship is undoubtedly a blow, and raises questions about how else Starmer might have dealt with Trump. For the UK's part, it managed to negotiate better trade terms during that purple patch. But now, this relationship is clearly under huge strain. I imagine Starmer will ignore it and carry on - his problem is that his opponents will not."
    },
    {
        "title": "What is in the Chagos Islands deal and why is it controversial?",
        "description": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base.",
        "url": "https://news.sky.com/story/what-is-in-the-chagos-islands-deal-and-why-is-it-controversial-13496512",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-diego-garcia-chagos_7140219.jpg?20260120072111",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-20 08:38:00",
        "Headline": "The UK government is standing firm on its decision to hand over sovereignty of the remote Chagos Islands to Mauritius after a decades-long dispute, despite criticism from Donald Trump.",
        "Content": "Donald Trump has slammed the UK's decision to hand the Chagos Islands to Mauritius, in a deal that includes a formal transfer of Diego Garcia, home to a key US military base. The US president said giving away the land was \"an act of great stupidity\", adding that the UK took the decision for \"no reason whatsoever\". But the UK government is standing firm. In a statement on 20 January, an official spokesperson said the government acted because the base on Diego Garcia was \"under threat after court decisions undermined our position and would have prevented it operating as intended in future\". \"The UK will never compromise on our national security,\" the spokesperson added. Follow the latest on Trump The UK and Mauritius have agreed to the deal, but it is yet to be ratified (made officially valid) by the UK parliament, so the islands currently remain British territory. So what is the deal really about, why has it sparked controversy and what does it mean for the UK-US military presence on the archipelago? Where are the Chagos Islands? The Chagos Islands are made up of more than 600 islands lying in the Indian Ocean, halfway between Africa and Indonesia. Around 4,000 people are stationed there. Why are they so controversial? The islands were a dependency of Mauritius when it was a French colony, but the UK claimed them as part of Mauritius in the early 19th Century and kept them beyond the country's independence in 1968. In the early 1970s, the UK expelled everyone from the archipelago so the US could build a naval support facility on the biggest island, Diego Garcia. Up to 2,000 native inhabitants, who are often referred to as Chagossians or Ilois, were removed to Mauritius or the Seychelles. The expulsions are regarded as one of the most shameful parts of Britain's modern colonial history and Chagossians have spent decades fighting to return. Why is the Diego Garcia base so important? Diego Garcia serves as a key military base for both the US and UK. It is leased to the US but operates as a joint UK-US base. Since 1971, only military employees have been allowed access. The UK government said its \"strategic location\" made it \"vital to UK and US power projection in the Indian Ocean and beyond\". It is described as \"a unique shared platform\" enabling a UK-US military presence across the Middle East, Indo-Pacific and Africa. Sir Keir Starmer has noted that it was used to deploy aircraft to \"defeat terrorists in Iraq and Afghanistan\". More recent operations launched from the base include bombing strikes against ‍Houthi targets in Yemen in 2024 and 2025 and humanitarian aid deployments to Gaza. Why did the UK agree to return the islands? Mauritius and the UK have been in dispute over the islands for the past 50 years. In 2010, Mauritius started proceedings against the UK to challenge the legality of how Britain had declared sovereignty, including its declaration of a marine protected area around the archipelago, which it argued stopped Chagossians from returning. It demanded compensation and repatriation of former inhabitants. In 2018, the fight made it to the International Court of Justice. Under the Conservative government in 2022 sovereignty negotiations with Mauritius began, but halted a year later after a paper by three academics said transferring the islands would be a \"major self-inflicted blow\". Two years later, in October 2024, the UK agreed to transfer sovereignty of the Chagos Islands to Mauritius. The deal, however, drew some criticism from lawmakers as ‌well as Britons born on Diego Garcia. At the time, the US said it \"welcomed the historic agreement\", commending both countries' leaders for their vision. In February ​2025, ahead of the signing, Mr Trump also expressed preliminary support for the deal. Canada, Australia, New Zealand and India have also backed the agreement. What is in the final deal? Last May, Sir Keir Starmer's Labour government signed the deal to return the islands, which would mean Britain formally gives up sovereignty of the Indian Ocean territory. The deal states: • The UK will hand sovereignty of the territory over to Mauritius and lease the Diego Garcia base from the Mauritian government over 99 years;• It will ban other powers from using the islands around Diego Garcia without agreement with the UK;• Mauritius will be free to arrange for resettlement of Chagossians on all islands except Diego Garcia;• The period can be extended by a further 40 years, if both parties agree;• Sir Keir said the average cost per year is £101m. Sky News analysis suggests the total cost could rise as high as £30bn;• Both the Commons and the Mauritian parliament need to ratify the deal. Sir Keir said the UK might otherwise have lost the island over Mauritius's legal claim on the Chagos Islands, which may have allowed hostile countries to set up their own bases or carry out exercises. The government said the final deal also addressed \"wrongs of the past\" and demonstrated \"the commitment of both parties to support the welfare\" of Chagossians. Why is there concern over the deal? Concerns over the deal include any future Mauritian government not adhering to the agreement and subsequently allowing China, which is heavily invested in Mauritius, to take over the base. US Secretary of State Marco Rubio echoed these concerns in February last year, saying the deal could cause potential threats to US security. While Conservative Party leader Kemi Badenoch said the deal made \"us and ​our NATO allies weaker\". Read more from Sky News:What is the Hillsborough Law?What UK social media ban on children could look like Some Chagossians, many of whom ended up living in Britain after being removed from the archipelago, have protested against the agreement on the grounds that they were not consulted on its detail. The UK's House of Lords also objected to elements of the deal in January of this year. The House inflicted four defeats over the details of the leasing of Diego Garcia and the publication of any detailed payments made to Mauritius."
    },
    {
        "title": "Starmer warned against fresh U-turn that could trigger row 'with 100 MPs' ",
        "description": "Sir Keir Starmer faces a showdown with over 100 of his backbenchers if he U-turns on a promise to cap ground rent for leaseholders, a senior Labour MP has warned. ",
        "url": "https://news.sky.com/story/starmer-warned-against-fresh-u-turn-that-could-trigger-row-with-100-mps-13496736",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-keir-starmer-politics_7135718.jpg?20260115020538",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2026-01-20 17:33:00",
        "Headline": "There is speculation the government could row back on its promise to cap ground rents amid concern from the Treasury about the impact on pension funds.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Sir Keir Starmer faces a showdown with over 100 of his backbenchers if he U-turns on a promise to cap ground rent for leaseholders, a senior Labour MP has warned.  Barry Gardiner told Sky News that it will be a \"betrayal\" of Labour's manifesto \"and of natural justice\" if the government rows back on one of its flagship housing promises. Politics Live: China's controversial 'super' embassy in London approved It comes amid cabinet divisions over leasehold reform, which has sparked a major intervention from former deputy prime minister and housing secretary Angela Rayner. Labour's manifesto promised to cap ground rents - a charge leaseholders have to pay so they can have a home on land they do not own. It does not require a service in return and is regarded by critics as emblematic of the feudal nature of England's centuries-old leasehold system, which Labour has ultimately pledged to abolish. However, the draft Leasehold and Commonhold Reform Bill intended to include these measures was delayed last year. Chancellor Rachel Reeves is said to be concerned that capping ground rents would deter pension fund investors - putting her at odds with Housing Secretary Steve Reed. Mr Gardiner, who has campaigned against leasehold for years, told Sky News: \"It is absolute nonsense to say that pension funds investors are dependent on ground rent, which forms only a tiny percentage of the capital tied up in a property.\" \n                  Beth Rigby: Forget Greenland for now, Starmer's biggest crisis could be closer to home\n                 \n                  Deputy Labour leader Lucy Powell calls for unity and respect\n                 \n                  Everything we know about China's new 'super embassy'\n                 He said there are 5.5 million leaseholders in the country and \"many of them were not regular Labour voters, but voted Labour last time because we promised to end this feudal system and to cap ground rent at a peppercorn [zero]\". \"It would be a total betrayal not only of those leaseholders, but of our manifesto and of natural justice, to go back on that now,\" he added. \"Over 100 Labour MPs are involved in groups representing leaseholders. I am confident that they will stick to their promise to leaseholders and don't want to see another government U-turn. \"Ultimately the government has to get this through MPs. Those MPs will not allow the government to go back on our commitment. I would almost guarantee it.\" The prime minister's spokesperson would not be drawn on cabinet divisions at the daily briefing with journalists on Tuesday, saying \"you've got our manifesto commitment\" when asked about the ground rent pledge. Reports had suggested Sir Keir would decide between his sparring team on Tuesday but it is understood no such deadline has been set. Another major U-turn would be deeply damaging for the prime minister who is fighting to survive following a series of major policy changes. Rayner intervenes  In her latest intervention since resigning, Ms Rayner - tipped by some to replace Sir Keir if he faces a leadership challenge - said the ground rent row was Labour's \"fresh opportunity to show whose side it is on\". In an article for The Guardian she wrote: \"If Labour cannot fix such an obvious injustice and show families whose living standards have been crushed that we will fight for them, then we shouldn't be surprised if they lose faith that anything can change. This battle is a symbol of so much more.\" Homeowners have faced escalating ground rent fees over the past decade, having historically been at a low or nominal value. Often this is due to hidden clauses in lease agreements allowing ground rent to rise periodically or in line with inflation, which can also cause problems with selling. Read More:Pensioner hit with £17k ground rent billLeaseholders still 'cash cows' despite update on abolishing 'feudal' system The Conservatives abolished ground rents on new leasehold properties, but plans to cap existing ones didn't make it through before the 2024 general election, which they lost. However, while trying to push through their plans, Tory ministers said government analysis showed less than 1% of pension fund assets were invested in residential property. Labour's manifesto said it would \"finally bring the feudal leasehold system to an end\" as well as \"tackle unregulated and unaffordable ground rent charges\". Abtisam Mohamed, the MP for Sheffield Central, urged the government to stick to its commitment. She told Sky News: \"Leaseholders are trapped in a system that extracts thousands from them through escalating ground rents, and every delay to the Leasehold and Commonhold Reform Bill leaves my constituents paying charges that exist only to line the pockets of wealthy investors. \"It's time to stop tiptoeing around them and publish the Bill, so we can deliver on our commitment to end this feudal system once and for all.\""
    },
    {
        "title": "Court to hear Reform UK's legal challenge to government's election delay plans",
        "description": "Reform UK's legal challenge to the government's plan to delay dozens of local council elections scheduled for May will be heard by a court next month.",
        "url": "https://news.sky.com/story/court-to-hear-reform-uks-legal-challenge-to-governments-election-delay-plans-13496713",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-polling-election_7113951.jpg?20251218130027",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2026-01-20 16:44:00",
        "Headline": "A two-day hearing will be held next month to determine whether the government can delay dozens of local council elections by a year.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Reform UK's legal challenge to the government's plan to delay dozens of local council elections scheduled for May will be heard by a court next month. Nigel Farage's party is taking legal action against the Ministry of Housing, Communities, and Local Government (MHCLG) over plans to allow councils to delay elections by a year due to the challenges of the local government reorganisation (LGR) programme. The case will be heard in full during a two-day hearing from 19 February. Any of the 63 local authorities seeking to be joined as an interested party or seeking permission to intervene must file an application by next Friday. Politics latest: China's controversial 'super' embassy in London approved The day before that deadline, the government must inform the court of \"the reasons for its decision\" to exercise its powers to delay local elections. In exchange for a full hearing within a month and the orders issued by the court, Reform UK's legal team agreed not to ask Mr Justice Chamberlain to issue a temporary injunction preventing the government from announcing delays to any local elections. Julian Blake, representing the MHCLG, said the secretary of state was content to agree to a \"reasonable amount of expedition\" in the matter so it could be resolved before 27 March, and therefore the application was \"unnecessary\". \n                  Social media ban for children being considered by UK government\n                 \n                  Robert Jenrick 'told Kemi Badenoch to kick Liz Truss out' of the Conservatives\n                 \n                  Defection of Tory MP Andrew Rosindell to Reform leaves Kemi Badenoch in an uncomfortable position\n                 In response to today's court order, a Reform UK spokesman said: \"We said we would fight Labour every step of the way on this and we are. Labour are disgracefully trying to deny democracy. We are determined to win this case next month.\" A spokesperson for MHCLG said: \"This is an ongoing process and no decisions have been made yet over any delays. There is a clear precedent for postponing local elections where local government reorganisation is in progress, as happened between 2019 and 2021. \"These are exceptional circumstances where councils have told us they're struggling to prepare for resource-intensive elections to councils that will shortly be abolished, while also reorganising into more efficient authorities that can better serve local residents.\" Has your council requested a delay? Use our search tool below. See the full list of councils that have asked for a delay. Sky News contacted all 63 councils that the government said could request a delay to their local elections, and nearly half have requested one. Twenty-nine councils have said they would like a delay or presented a case for one - 21 of which are Labour-run, four are Conservative, two are Liberal Democrat, one is Green, and one is independent. The final decision rests with the government, and ministers have said they will announce shortly which elections will not go ahead this year. Amid outrage from opposition parties that some local elections are being delayed for the second year in a row, Local Government Secretary Steve Reed argued on Sky's Politics Hub last week: \"The vast majority of elections are going ahead on schedule. \"Where we have asked councils to let us know if there needs to be a delay or a postponement is where we're going through the biggest reorganisation of councils in decades.\" He explained that a third of the country has two councils, rather than one, which is money that could be spent on local services, and so they are offering to postpone elections this year if holding them could mean a delay to elections next year. All the councils that have requested a delay cited the resources needed to deliver the government's LGR programme, and many said it would not make sense to spend hundreds of thousands of pounds to hold an election for councillor positions that would exist only for one year. But the Reform UK leader has described the government's move as \"absolutely monstrous\", and has previously accused Labour and the Tories of working together to lock his party out of power. The Tories, however, have also expressed their opposition to the government's plans, with shadow chancellor Sir Mel Stride telling broadcasters that it is \"not right\" that millions could be \"denied their democratic right to seek change in their councils\". \"We don't want to see councillors serving seven-year terms, and we need to get on with democracy,\" he added. The Liberal Democrats have also opposed the plans, with leader Sir Ed Davey calling for a change of the law \"so that ministers cannot simply delay elections at the stroke of a pen\"."
    },
    {
        "title": "What UK social media ban on children could look like - as government considers action",
        "description": "Ministers are consulting on banning social media for under-16s in the UK - just weeks after a ban in Australia came into force.",
        "url": "https://news.sky.com/story/what-uk-social-media-ban-on-children-could-look-like-as-government-considers-action-13496437",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-teenager-phone_7140145.jpg?20260120011659",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-20 01:18:00",
        "Headline": "There have been growing calls for Sir Keir Starmer to increase the minimum age for social media platforms, and Number 10 has signalled it is open to the idea. Sky News looks at where the government could look for inspiration, and what a ban may look like.",
        "Content": "Ministers are consulting on banning social media for under-16s in the UK - just weeks after a ban in Australia came into force. The government's consultation will look at various options, including increasing the digital age of consent and restricting potentially addictive app design features such as \"streaks\" and \"infinite scrolling\". There have been growing calls for Sir Keir Starmer to take action, and the announcement comes ahead of the Lords voting on a Conservative amendment to Labour's Children's Wellbeing and Schools Bill, which would force social media platforms to stop under-16s from using their platforms within a year of it passing. The Department for Science, Innovation and Technology (DSIT) said it will also be taking immediate action on children's social media use. This would include directing media regulator Ofsted to examine schools' mobile phone policies and how effectively they are put into practice during inspections. The government will also produce screen time guidance for parents of children aged between five and 16. It said guidance for parents of under-fives will be published in April. The government will seek views from parents and young people and it will respond in the summer. An Australian inspiration? Ministers will visit Australia as part of the consultation. A social media ban for under-16s was implemented there in December. Ten of the biggest social media platforms in Australia were ordered to bring in the ban or face fines of up to AU$49.5m (£25m). The companies were required to find ways to close existing accounts for under-16s and prevent new ones from being created. The law is designed to protect children from potential mental health risks, inappropriate content and cyber-bullying. Which platforms are affected by ban in Australia? The age-restricted platforms include: • Facebook• Instagram• Snapchat• Threads• TikTok• Twitch• X• YouTube• Kick More generally, age restrictions apply to social media platforms that meet three specific conditions, unless the Australian government determines they should be excluded. The conditions are: • The sole purpose, or a significant purpose, of the service is to enable online social interaction between two or more users • The service allows users to link to, or interact with, some or all of the other end-users • The service allows users to post material on the service Platforms are responsible for determining whether they fit the criteria and doing their own legal assessments. Which apps are not age-restricted? Australia's eSafety Commission has said the following platforms will not be age-restricted:• Discord• GitHub• Google Classroom• LEGO play• Messenger• Pinterest• Roblox• Steam and Steam Chat• WhatsApp• YouTube Kids But the Australian government has indicated the list could change as new products are launched, and young users switch to alternatives. How do social media companies comply with ban? Australia's Online Safety Amendment Act 2024 requires companies to take \"reasonable steps\" to prevent underage users from signing up and using their platform; they could face fines of up to $49.5m (£25m) for failing to comply. Of the initial 10 banned platforms, all but Elon Musk's X have said they will comply using age inference. This involves guessing a person's age from their online activity - or age estimation, which is usually based on a selfie. They may also check with uploaded identification documents or linked bank account details. But the Australian government has said requesting ID cannot be the only method to determine someone's age. Meta - the owner of Facebook, Instagram, and Threads - said in submissions to the Australian government last year that the legislation was \"a missed opportunity and overlooks the practical reality of age assurance technology as well as the views of a majority of mental health and youth safety organisations in the country\". The company, chaired by Mark Zuckerberg, began to exclude suspected young children from its platforms a week before the ban was implemented, but previously admitted that it expects issues with its technology, which could result in accounts belonging to people who are actually over 16 accidentally being shut down. TikTok said it will have a \"multi-layered approach to age assurance,\" while Snapchat will use behavioural signals for age estimations. Is the move controversial? Prior to the passing of the ban in Australia's parliament last year, more than 140 national and international academics with expertise in fields related to technology and child welfare signed an open letter to Prime Minister Anthony Albanese opposing a social media age limit as \"too blunt an instrument to address risks effectively\". In Sydney, two 15-year-olds have sued the Australian government over the ban. One of the claimants, Noah Jones, who turns 16 in August, has argued the ban will deny 2.6 million young Australians of a right to freedom of political communication implied in Australia's constitution. As Meta did in its submissions to the Australian government, several other platforms also hit out at the move. Google and YouTube Australia's public policy senior manager, Rachel Lord, said the site will automatically sign out users who are deemed to be under 16. But, she said, they can still view some YouTube videos while signed out, and parents will \"lose their ability to supervise their teen or tween's account\" and use controls such as blocking channels. In response, Australia's communications minister Anika Wells said it was \"outright weird that YouTube is always at pains to remind us all how unsafe their platform is in a logged out state\". What have people said about possible UK ban? Esther Ghey, whose daughter Brianna was murdered at the age of 16 by two other teenagers in 2023, said a ban would be \"a vital step in protecting children online\". In a letter to party leaders Sir Keir Starmer, Kemi Badenoch and Sir Ed Davey, Ms Ghey said her daughter had had a \"social media addiction\" and \"desperately wanted to be TikTok famous\", putting her \"in constant fear about who Brianna might be speaking to online\". Ms Badenoch has already said the Conservative Party would introduce a ban for under-16s if it was in power. The Tory leader said the consultation was \"more dither and delay\" from Labour. Paul Whiteman, general secretary at school leaders' union the NAHT, said: \"It's important that we learn from other countries and consider the unintended consequences as well as the advantages of such an approach.\" But he added: \"The vast majority of schools already have restrictions on the use of mobile phones on school sites. \"The government's suggestion that Ofsted should be 'policing' school policies is deeply unhelpful and misguided. School leaders need support from government, not the threat of heavy-handed inspection.\" Chris Sherwood, chief executive at the NSPCC, also welcomed the government consultation, saying tech companies \"have prioritised profit over children's safety\". \"Taking forward measures to ensure products are safe by design would be a vital step in redressing that balance,\" he added."
    },
    {
        "title": "Inside the new breed of 'zero bills' homes where you pay nothing for your energy",
        "description": "Elliott Wood has something you're probably going to want.",
        "url": "https://news.sky.com/story/what-cost-of-living-crisis-why-elliott-pays-absolutely-nothing-to-power-his-home-13496916",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-victoria-seabrook-elliott-wood_7141165.png?20260121013419",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-01-20 23:33:00",
        "Headline": "The government's long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. Is this a realistic vision of the future?",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Elliott Wood has something you're probably going to want. Like most of us, every month he gets a bill for his monthly energy use. Only his bill… is free. He's living in a new breed of \"zero bills\" homes, which comes with solar panels, heat pumps and batteries. Together, that technology generates more electricity than Elliot uses. When combined with the right tariff - in his case a zero bills tariff with Octopus Energy - the excess electricity is sold back to the grid, and his bill comes in at a princely sum of £0 a month. \"It's amazing… you just don't have to worry,\" says 26-year-old Elliott, who lives in a one-bedroom rental house with his partner in Milton Keynes. \"There is no stress at the end of each month, [wondering] 'have we had too many showers, has the heating been on too much, have we used the microwave too many times?'\" The zero bills scheme does come with a few caveats: the tariff is only guaranteed for five to 10 years, and it doesn't include electric vehicle charging. But Octopus estimates it will save an average household of two to three beds approximately £1,758 a year on bills, based on current Ofgem price cap rates. Now for the bad news… But only a few hundred of these homes are up and running, meaning for most of us, the zero bill home remains a pipe dream. In fact Britain has some of the most leaky, drafty and gas reliant homes in Western Europe - and that's a major vulnerability. Approximately 85% of homes rely on gas for heating, more than half of which we import, only for some of that hard work to go to waste as the heat drifts out through uninsulated Victorian brickwork. That means cold, damp homes that are expensive to run, leaving a staggering 2.7m UK households living in fuel poverty. Housing and buildings are also the second biggest polluting sector in the UK, after transport, something that must fall if the country is to hit its climate targets. Quest to upgrade Britain's homes The government aims to tackle all these problems in one fell swoop. Its long-awaited Warm Homes plan published on Wednesday is designed to upgrade homes to make them cheaper, better and warmer. The £14.7bn strategy will pay for measures like insulation, solar panels, batteries, and heat pumps that can lower bills and cut gas use. These won't see bills falls to zero, like Elliott's, but ministers say it could slash some bills by several hundred pounds. Ministers says the plan will upgrade five million homes and lift \"up to\" one million families out of fuel poverty by 2030. If done well, upgrading homes is an effective way to slash bills and reduce damp, and campaigners and industry have broadly welcomed the idea. But previous attempts to upgrade homes have tried and failed. It's not clear how officials can enforce landlords to upgrade properties, or who to trust to insulate homes, or whether electricity costs will come down enough to truly reap the benefits of a heat pump. Energy UK's CEO Dhara Vyas said: \"Supporting better access to clean heat systems, solar panels, batteries, and insulation will help millions of households across the UK bring down their energy bills. But she said to \"ensure the plan realises its full potential, it will be important to tackle the factors that currently make electricity artificially expensive.\" The key to the cost of living crisis? As more people get off gas heating and on to electric heat pumps, it should also reduce the UK's imports of gas. The government sees a geopolitical value in weaning the country off gas it has to buy from abroad, as opposed to clean power it can harness at home - albeit using Chinese components. First it wanted to reduce reliance on Russia, but now even buying gas from the US has taken on a new risk with a less predictable president in the White House. No one in government would say that out loud, yet, but who knows what levers Donald Trump might pull on Europe to get his way on Greenland. And while reducing energy imports is good for security, there's a risk that with fewer people paying gas bills, those left will shoulder higher costs to keep the system running. Read more from Sky News:Trump's ominous Greenland messageStarmer's biggest crisis could be closer to home On top of that, the Warm Homes plan is still just a plan - and previous attempts to deliver have failed. But the government has staked its reputation on easing the cost of living and slashing household bills. Prime Minister Sir Keir Starmer said: \"This is a government bearing down on the cost-of-living crisis… giving people the security and the fair shot they need to get on in life.\" That claim will be judged largely on whether this new plan to upgrade homes sinks or swims."
    },
    {
        "title": "What UK social media ban on children could look like - as government considers action",
        "description": "Ministers are consulting on banning social media for under-16s in the UK - just weeks after a ban in Australia came into force.",
        "url": "https://news.sky.com/story/what-uk-social-media-ban-on-children-could-look-like-as-government-considers-action-13496437",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-teenager-phone_7140145.jpg?20260120011659",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-01-20 01:18:00",
        "Headline": "There have been growing calls for Sir Keir Starmer to increase the minimum age for social media platforms, and Number 10 has signalled it is open to the idea. Sky News looks at where the government could look for inspiration, and what a ban may look like.",
        "Content": "Ministers are consulting on banning social media for under-16s in the UK - just weeks after a ban in Australia came into force. The government's consultation will look at various options, including increasing the digital age of consent and restricting potentially addictive app design features such as \"streaks\" and \"infinite scrolling\". There have been growing calls for Sir Keir Starmer to take action, and the announcement comes ahead of the Lords voting on a Conservative amendment to Labour's Children's Wellbeing and Schools Bill, which would force social media platforms to stop under-16s from using their platforms within a year of it passing. The Department for Science, Innovation and Technology (DSIT) said it will also be taking immediate action on children's social media use. This would include directing media regulator Ofsted to examine schools' mobile phone policies and how effectively they are put into practice during inspections. The government will also produce screen time guidance for parents of children aged between five and 16. It said guidance for parents of under-fives will be published in April. The government will seek views from parents and young people and it will respond in the summer. An Australian inspiration? Ministers will visit Australia as part of the consultation. A social media ban for under-16s was implemented there in December. Ten of the biggest social media platforms in Australia were ordered to bring in the ban or face fines of up to AU$49.5m (£25m). The companies were required to find ways to close existing accounts for under-16s and prevent new ones from being created. The law is designed to protect children from potential mental health risks, inappropriate content and cyber-bullying. Which platforms are affected by ban in Australia? The age-restricted platforms include: • Facebook• Instagram• Snapchat• Threads• TikTok• Twitch• X• YouTube• Kick More generally, age restrictions apply to social media platforms that meet three specific conditions, unless the Australian government determines they should be excluded. The conditions are: • The sole purpose, or a significant purpose, of the service is to enable online social interaction between two or more users • The service allows users to link to, or interact with, some or all of the other end-users • The service allows users to post material on the service Platforms are responsible for determining whether they fit the criteria and doing their own legal assessments. Which apps are not age-restricted? Australia's eSafety Commission has said the following platforms will not be age-restricted:• Discord• GitHub• Google Classroom• LEGO play• Messenger• Pinterest• Roblox• Steam and Steam Chat• WhatsApp• YouTube Kids But the Australian government has indicated the list could change as new products are launched, and young users switch to alternatives. How do social media companies comply with ban? Australia's Online Safety Amendment Act 2024 requires companies to take \"reasonable steps\" to prevent underage users from signing up and using their platform; they could face fines of up to $49.5m (£25m) for failing to comply. Of the initial 10 banned platforms, all but Elon Musk's X have said they will comply using age inference. This involves guessing a person's age from their online activity - or age estimation, which is usually based on a selfie. They may also check with uploaded identification documents or linked bank account details. But the Australian government has said requesting ID cannot be the only method to determine someone's age. Meta - the owner of Facebook, Instagram, and Threads - said in submissions to the Australian government last year that the legislation was \"a missed opportunity and overlooks the practical reality of age assurance technology as well as the views of a majority of mental health and youth safety organisations in the country\". The company, chaired by Mark Zuckerberg, began to exclude suspected young children from its platforms a week before the ban was implemented, but previously admitted that it expects issues with its technology, which could result in accounts belonging to people who are actually over 16 accidentally being shut down. TikTok said it will have a \"multi-layered approach to age assurance,\" while Snapchat will use behavioural signals for age estimations. Is the move controversial? Prior to the passing of the ban in Australia's parliament last year, more than 140 national and international academics with expertise in fields related to technology and child welfare signed an open letter to Prime Minister Anthony Albanese opposing a social media age limit as \"too blunt an instrument to address risks effectively\". In Sydney, two 15-year-olds have sued the Australian government over the ban. One of the claimants, Noah Jones, who turns 16 in August, has argued the ban will deny 2.6 million young Australians of a right to freedom of political communication implied in Australia's constitution. As Meta did in its submissions to the Australian government, several other platforms also hit out at the move. Google and YouTube Australia's public policy senior manager, Rachel Lord, said the site will automatically sign out users who are deemed to be under 16. But, she said, they can still view some YouTube videos while signed out, and parents will \"lose their ability to supervise their teen or tween's account\" and use controls such as blocking channels. In response, Australia's communications minister Anika Wells said it was \"outright weird that YouTube is always at pains to remind us all how unsafe their platform is in a logged out state\". What have people said about possible UK ban? Esther Ghey, whose daughter Brianna was murdered at the age of 16 by two other teenagers in 2023, said a ban would be \"a vital step in protecting children online\". In a letter to party leaders Sir Keir Starmer, Kemi Badenoch and Sir Ed Davey, Ms Ghey said her daughter had had a \"social media addiction\" and \"desperately wanted to be TikTok famous\", putting her \"in constant fear about who Brianna might be speaking to online\". Ms Badenoch has already said the Conservative Party would introduce a ban for under-16s if it was in power. The Tory leader said the consultation was \"more dither and delay\" from Labour. Paul Whiteman, general secretary at school leaders' union the NAHT, said: \"It's important that we learn from other countries and consider the unintended consequences as well as the advantages of such an approach.\" But he added: \"The vast majority of schools already have restrictions on the use of mobile phones on school sites. \"The government's suggestion that Ofsted should be 'policing' school policies is deeply unhelpful and misguided. School leaders need support from government, not the threat of heavy-handed inspection.\" Chris Sherwood, chief executive at the NSPCC, also welcomed the government consultation, saying tech companies \"have prioritised profit over children's safety\". \"Taking forward measures to ensure products are safe by design would be a vital step in redressing that balance,\" he added."
    },
    {
        "title": "Will Brooklyn regret launching a grenade at Brand Beckham?",
        "description": "It had been a while&#160;since&#160;we'd&#160;seen the whole Beckham family out together.",
        "url": "https://news.sky.com/story/will-brooklyn-regret-launching-a-grenade-at-brand-beckham-13496724",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckham-david-beckham_7140029.jpg?20260119210741",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2026-01-20 16:53:00",
        "Headline": "In a long statement on Instagram, the 26-year-old said he was \"standing up for myself for the first time in my life\".",
        "Content": "\n          Arts and entertainment correspondent\n       It had been a while since we'd seen the whole Beckham family out together. And while the tabloids had picked up last year on the fact that their eldest child had been noticeably missing from family photo-ops, few could have foreseen how Brooklyn would briefly break the internet. Will their eldest child come to regret the fallout? Had he really thought it through? The carefully worded references to his parents \"performative social media posts\", the \"inauthentic relationships…a fixture of the life I was born into\" certainly feels like words that weren't casually dashed off in the heat of the moment. Moreover, he was waiting for the right moment to press send. Read more:In full: Brooklyn Beckham's explosive statementSir David Beckham snubs question about Brooklyn in Davos There are of course two sides to every story and we're yet to hear his parents' take. But it's worth noting that behind the scenes the Beckhams have patently done quite a bit to try to launch their son's career. As a wannabe photographer, were it not for his surname, he likely wouldn't have secured a book deal with Penguin for his photographs. With journalists around the world reaching out to the Beckhams for comment, so far the couple has said nothing. Anything other than silence arguably lends weight to Brooklyn's argument that what they say is carefully stage-managed. \n                  Sir David Beckham refuses to answer Sky News questions in Davos\n                 \n                  Brooklyn Peltz Beckham 'doesn't want to reconcile with family'\n                 \n                  Prince Harry's privacy case is 'threadbare' and journalist sources were legitimate, lawyer for Mail publisher tells High Court\n                 So for now, Sir David's interview with CNBC in Davos might just be the closest we get to understanding what his parents are thinking. Said under the guise of how young people use social media, Sir David's reference to children being \"allowed to make mistakes, that's how they learn\" is seemingly rather telling right now. But of course this isn't a small mistake. Brooklyn's claims are akin to a grenade being thrown at the notoriously polished Brand Beckham."
    },
    {
        "title": "Sir David Beckham refuses to answer Sky News questions in Davos",
        "description": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos.",
        "url": "https://news.sky.com/story/sir-david-beckham-refuses-to-answer-sky-news-questions-in-davos-13496537",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-david-beckham-davos_7140314.jpg?20260120095443",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-20 09:53:00",
        "Headline": "Sir David was asked if he had a message for his son and if he was disappointed that family business was being aired in public.",
        "Content": "Sir David Beckham has refused to answer questions on his relationship with his son at the World Economic Forum in Davos. On Tuesday, Brooklyn Peltz Beckham broke his silence about his estrangement from his parents, saying in a post on social media he does not want to reconcile with his family. Asked about his son's statement in Switzerland on Tuesday by Sky News business correspondent Paul Kelso, Sir David refused to comment. He was asked if he had a message for his son and if he was disappointed that family business was being aired in public. In a statement shared on his Instagram story, Brooklyn offered his explanation for the alleged rift. The 26-year-old wrote: \"I have been silent for years and made every effort to keep these matters private. \"I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life. \"All we want [is] peace, privacy and happiness for us and our future family.\" Read more:What Brooklyn's claims tell us about the Beckham rift Brooklyn, the eldest son of footballer Sir David and former Spice Girl Victoria Beckham, married Nicola Peltz in 2022. She is the daughter of American billionaire businessman Nelson Peltz and former model Claudia Heffner Peltz. The couple live together in Los Angeles. Sir David, who is now co-owner of Inter Miami CF and has made millions from endorsements and commercial partnerships, was in Davos recording a podcast. 'Children are allowed to make mistakes' Speaking about the economy and the sports business with CNBC, Sir David was also asked about young people and social media use. Pointing to his role as goodwill ambassador for UNICEF, as well as his relationship with his own children, he said: \"I've been able to use my platform and following for UNICEF, and it's been the biggest tool to make people aware of what's going on around the world for children. \"I've tried to do the same with my children, to educate them, they make mistakes. Children are allowed to make mistakes, that's how they learn... but you know you have to sometimes let them make those mistakes as well.\" 'Posh and Becks' - Britain's best known power couple The former midfielder received his knighthood for his services to sport and charity from the King at an investiture ceremony at Windsor Castle in November. He married his wife, Victoria, who is now a fashion designer and businesswoman, in 1999. Thanks to a combination of sports and entertainment credentials paired with savvy business instincts, \"Posh and Becks\" quickly became Britain's best-known power couple. They have four children together: three sons, Brooklyn, Romeo, 23, and Cruz, 20, and one daughter, Harper, 14. Read more:Nicola Peltz Beckham denies 'feud'Victoria awarded prize from daughterSir David Beckham gets knighthood There has been widespread media speculation about a rift in the Beckham family since Brooklyn's wedding to Nicola Peltz in 2022, but Brooklyn's six-page statement, shared with his 16.1 million followers, is the first public acknowledgement of any bad blood. It's been widely reported that Brooklyn did not attend his dad's 50th birthday celebrations in May. Brooklyn now claims he was in the UK, but that his dad only agreed to see him under the condition that his wife was not invited. I have been silent for years and made every effort to keep these matters private. Unfortunately my parents and their team have continued to go to the press, leaving me with no choice but to speak for myself and tell the truth about only some of the lies that have been printed. I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life.' For my entire life, my parents have controlled narratives in the press about our family. The performative social media posts, family events and inauthentic relationships have been a fixture of the life I was born into. To read the full statement, click or tap here. 'Overexplaining would most definitely backfire,' says celebrity crisis expert Laura Beeching, the founder of the crisis management agency Honest London told Sky News she would not expect the Beckhams to comment on Brooklyn's posts in a hurry. \"Silence is definitely key here. Anything more than a minimal response risks reinforcing what Brooklyn's argument is that everything is managed and strategic,\" she said. \"I would suggest no explanation, no rebuttal, no expansion, because overexplaining it would most definitely backfire. As you can see in Brooklyn's very long statement, it's very emotional. \"[I tell my clients] less is more when it comes to statements, because every actual word you put into a statement, that's another thing that people can analyse and dissect. Even down to the wedding dress comment that [Brooklyn] put out. \"People have already disputed that with what was written in Vogue back in 2022, I believe, and that's the issue when you go to detail. I would be very shocked at the Beckhams speaking out on this.\" The Beckham family are yet to publicly respond to Brooklyn's posts, but have shared promotional posts for Cruz's first music gig at the Courtyard Theatre in east London in March. Meanwhile, Nicola Peltz has not commented on social media, instead sharing tributes to late fashion designer Valentino in her Instagram stories. Sky News has contacted David and Victoria Beckham for comment."
    },
    {
        "title": "Prince Harry's privacy case is 'threadbare' and journalist sources were legitimate, lawyer for Mail publisher tells High Court",
        "description": "Prince Harry's privacy case against the publisher of the Daily Mail is \"threadbare\" and has been brought too late, a lawyer for the news outlet has told the High Court.",
        "url": "https://news.sky.com/story/prince-harrys-privacy-case-is-threadbare-and-journalist-sources-were-legitimate-lawyer-for-mail-publisher-tells-high-court-13496701",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-prince-harry-court_7140395.jpg?20260120101058",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-01-20 15:58:00",
        "Headline": "Associated Newspapers, publishers of the Daily Mail and Mail On Sunday, are defending against allegations of unlawful information gathering brought by Prince Harry and other household names, including Sir Elton John and Elizabeth Hurley.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Prince Harry's privacy case against the publisher of the Daily Mail is \"threadbare\" and has been brought too late, a lawyer for the news outlet has told the High Court. Opening the case for the defence, Anthony White KC said journalists for the Daily Mail and Mail On Sunday sourced articles legitimately and have \"compelling\" accounts of doing so which will be shown during the trial. Along with Sir Elton John and his husband David Furnish, actresses Elizabeth Hurley and Sadie Frost, campaigner Baroness Lawrence and politician Sir Simon Hughes, Harry is accusing Associated Newspapers Limited (ANL) of unlawful information gathering during a period between 1993 and 2011. As it happened: Mail knew Harry gave ex set of keys, court case against publisher told  The allegations range from tapping their phones and bugging their homes to obtaining private information by \"blagging\", or deception, through the use of private investigators. ANL is defending against what it has called \"preposterous\" claims and strenuously denied any wrongdoing. Harry, Hurley and Sir Simon were in court for the second day of the trial on Tuesday. However, after their barrister David Sherborne finished his opening arguments, both the duke and Hurley left court during the lunch break, not waiting around to hear the ANL opening arguments. White, representing ANL, told the court the case was \"threadbare\". Journalists working for the publisher provide a \"compelling account of a pattern of legitimate sourcing of articles\" and a series of witnesses will show this throughout the trial, he said. This is in relation to 50-plus articles alleged to be the product of unlawful information gathering that the claimants are relying on to make their case, he added. \"We don't pretend that that account is perfect and covers every detail, and not every journalist can remember every article, but we do say that, overall, it provides a compelling account of a pattern of legitimate sourcing of articles.\" Multiple Associated journalists and editors, past and present, are expected to give evidence at the High Court, including former Daily Mail editor Paul Dacre. Mr White said the claims accuse a large number of journalists of using unlawful methods to obtain information, and that they cannot all be lying when they say this did not happen. The celebrities bringing the legal action had \"leaky\" social circles and information also came from sources including spokespeople and previous reporting, he said in his written opening argument to the court. And addressing allegations of payments to private investigators, Mr White said these were \"examples of clutching at straws in the wind and seeking to bind them together in a way that has no proper analytical foundation\". Why is ANL arguing the claims are too late? While strenuously denying allegations of wrongdoing, the barrister also argued the claims have been brought too late - as the law indicates that privacy claims should be brought within six years. Mr Sherborne, representing the claimants, said this part of the defence is a \"potential life raft in a sea of unlawful information gathering\", but that the publisher may not \"be able to climb aboard\". The legal action was launched in 2022. All seven of the claimants discovered they had \"worthwhile\" claims after 2016, he told the court. Mr Sherborne, who began his opening statement on Monday, concluded his arguments on Tuesday morning, telling the court that while ANL has described the allegations as \"preposterous\", the claimants say it is the publisher's \"position in this which is preposterous - and a particularly disgraceful one for the claimants to stomach, victims who have already suffered at the defendant's hands\". Read more:Why seven household names are suing Mail publisherThis is Harry's biggest case against the press - and stakes are high Referencing Harry's claim in particular, the barrister said the duke had suffered \"distress\" and \"paranoia\" due to unlawful information gathering. \"Given what we've seen, is it any wonder that he feels that way?\" Sherborne said, before telling the court that Harry \"feels he has endured a sustained campaign of attacks against him for having had the temerity to stand up to Associated in the way that he has so publicly done\". ANL \"strongly denies\" that there was any unlawful information gathering, including voicemail interception, directed at the duke or his named associates. Harry was expected to enter the witness box to give evidence on Thursday. However, due to a much briefer than expected opening argument by Mr White - which the judge noted was allowed due to full details being included in his written submissions - the duke could begin his evidence on Wednesday. The trial continues."
    },
    {
        "title": "Russell Brand appears in court via video link from US to face further rape and sexual assault charges",
        "description": "Russell Brand has been granted bail after a video court appearance charged with two further sexual offences, including rape.",
        "url": "https://news.sky.com/story/russell-brand-granted-bail-after-appearing-in-court-on-video-link-from-us-charged-with-new-offences-13496663",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-russell-brand_7140638.jpg?20260120144211",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-20 14:22:00",
        "Headline": "The comedian and actor appeared at Westminster Magistrates' Court on Tuesday on a video link from the US accused of one count of rape and one of sexual assault. He had previously denied other charges of rape, indecent assault and sexual assault in relation to earlier alleged offences.",
        "Content": "Russell Brand has been granted bail after a video court appearance charged with two further sexual offences, including rape. The comedian and actor appeared at Westminster Magistrates' Court on Tuesday on a video link from the US accused of one count of rape and one of sexual assault, which are both alleged to have taken place in 2009. He had previously denied two other counts of rape, one count of indecent assault and two counts of sexual assault in relation to alleged offences between 1999 and 2005, involving four women. Brand, wearing a denim shirt with a number of buttons undone, spoke only to confirm his name and date of birth during the six-minute hearing. He was bailed to appear at Southwark Crown Court on 17 February. According to court documents, the two latest alleged offences took place in London. A trial is planned at Southwark Crown Court later this year in relation to the five original charges. Brand, 50, rose to prominence as a comedian in the mid-2000s, before finding success in Hollywood with the 2008 film Forgetting Sarah Marshall and its 2010 spin-off, Get Him To The Greek."
    },
    {
        "title": "What we know about the Beckham rift: Wedding dress drama, 'hijacked' first dance and birthday snub",
        "description": "Brooklyn Peltz Beckham has addressed his estrangement from his parents in a dramatic social media post, saying he had \"remained silent for years\".",
        "url": "https://news.sky.com/story/what-we-know-about-the-beckham-rift-wedding-dress-drama-hijacked-first-dance-and-birthday-snub-13496608",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckahm-nicola-peltz_7140034.jpg?20260119211116",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-20 12:43:00",
        "Headline": "A scathing six-page statement shared by David and Victoria Beckham's eldest son on Instagram has opened a long-rumoured family rift up to the public.",
        "Content": "Brooklyn Peltz Beckham has addressed his estrangement from his parents in a dramatic social media post, saying he had \"remained silent for years\". A lengthy statement shared on the 26-year-old's Instagram story revealed details about his fallout with parents Sir David Beckham and Lady Victoria Beckham, which had been the subject of public speculation for years. He wrote: \"I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life.\" So what does Brooklyn claim happened between him and his family? Here's everything you need to know. Brooklyn addresses long-rumoured wedding dress drama Brooklyn married his actress and model wife Nicola Peltz, who is the daughter of American billionaire businessman Nelson Peltz in 2022. It was a lavish April event in Palm Beach rumoured to have cost millions. In the Instagram post shared with his 16 million followers, Brooklyn, who now lives in LA, said there were tensions around the wedding. He wrote: \"My parents have been trying endlessly to ruin my relationship since before my wedding, and it hasn't stopped. \"My mum cancelled making Nicola's dress in the eleventh hour despite how excited she was to wear her design, forcing her to urgently find a new dress.\" Peltz's Valentino Couture gown was the subject of media speculation just after the wedding, with reports suggesting she had chosen to wear it instead of one designed by Lady Victoria. In an interview with The Sunday Times that year, Peltz addressed the rumours by repeatedly saying there was \"no feud\" and adding: \"No family is perfect!\" She said that after some chats about the dress on a \"text chain\", Lady Victoria called her mother and said she couldn't make the dress because her \"atelier couldn't make the dress in time\". At the time, Brooklyn had called the feud rumours \"ridiculous\". Victoria 'hijacked' first dance, Brooklyn claims Much of Brooklyn's post centred around his wedding day and his parents' supposed disapproval. He claimed they \"repeatedly pressured and attempted to bribe me into signing away the rights to my name\" in the lead-up. He also claimed Lady Victoria called him \"evil\" during a row over seating at the wedding, suggesting she had taken issue with the couple's decision to have their grandmothers sit with them at their table, with both sets of parents at adjacent tables. He went on to claim his mother \"hijacked\" his first dance with his wife, and that she \"danced very inappropriately on me in front of everyone\". He added that he had never felt more \"uncomfortable or humiliated\" in his life. Brooklyn suggested such experiences were the reason he and his wife decided to renew their vows last year - a service where Peltz's family was present while the Beckhams were absent. \"We wanted to renew our vows so we could create new memories of our wedding day that bring us joy and happiness, not anxiety and embarrassment,\" Brooklyn wrote. Brooklyn 'rejected' amid dad's 50th birthday absence Brooklyn's absence from his family's public events last year made the rumours of a rift even louder. It stole headlines when he wasn't there for his father's extravagant 50th birthday celebrations last year - another thing Brooklyn addressed in his post. He claimed that despite family tensions, he and his wife travelled to London for Sir David's birthday but \"were rejected for a week as we waited in our hotel room trying to plan quality time with him\". \"He refused all of our attempts, unless it was at his big birthday party with a hundred guests and cameras at every corner,\" he wrote, adding: \"When he finally agreed to see me, it was under the condition that Nicola wasn't invited. It was a slap in the face.\" He claimed his family later travelled to his home city of LA and \"refused\" to see him. 'Brand Beckham comes first' Brooklyn went on to claim that his family \"values public promotion and endorsements above all else\". \"Brand Beckham comes first,\" he wrote. \"Family 'love' is decided by how much you post on social media. \"Since the moment I started standing up for myself with my family, I've received endless attacks from my parents, both privately and publicly, that were sent to the press on their orders.\" Near the conclusion of the scathing six-page statement, Brooklyn said: \"The narrative that my wife controls me is completely backwards. I have been controlled by my parents for most of my life.\" Sky News arts and entertainment correspondent Katie Spencer says the distance between Brooklyn and his family had been interpreted in the media as evidence of his wife's controlling influence, and suggests that the post was mainly about challenging that suggestion. David and Victoria remain coy The other members of the Beckham family have not responded to Brooklyn's comments. Sky News business correspondent Paul Kelso asked Sir David about his son's statement as he arrived for the World Economic Forum in Switzerland on Tuesday. Specifically, he asked if he had a message for his son and if he was disappointed that family business was being aired in public. Sir David refused to comment. He and Lady Victoria have been formally contacted for comment by Sky News."
    },
    {
        "title": "In full: Brooklyn Beckham's explosive statement addressing family rift",
        "description": "Brooklyn Beckham - the oldest child of Sir David Beckham and his wife Victoria - has spoken out for the first time acknowledging the feud between him and his parents.",
        "url": "https://news.sky.com/story/in-full-brooklyn-beckhams-explosive-statement-addressing-family-rift-13496601",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-brooklyn-beckham_7140541.jpg?20260120130159",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-20 12:35:00",
        "Headline": "The 26-year-old made a series of claims against his parents in a statement posted to social media.",
        "Content": "Brooklyn Beckham - the oldest child of Sir David Beckham and his wife Victoria - has spoken out for the first time acknowledging the feud between him and his parents. The 26-year-old posted a statement on Instagram on 19 January, in which he claimed his parents have been controlling narratives in the press about his family and tried to \"ruin\" his relationship with his wife Nicola Peltz Beckham. Here is his statement in full: I have been silent for years and made every effort to keep these matters private. Unfortunately my parents and their team have continued to go to the press, leaving me with no choice but to speak for myself and tell the truth about only some of the lies that have been printed. I do not want to reconcile with my family. I'm not being controlled, I'm standing up for myself for the first time in my life.' For my entire life, my parents have controlled narratives in the press about our family. The performative social media posts, family events and inauthentic relationships have been a fixture of the life I was born into. Recently, I have seen with my own eyes the lengths that they'll go through to place countless lies in the media, mostly at the expense of innocent people, to preserve their own facade. But I believe the truth always comes out. My parents have been trying endlessly to ruin my relationship since before my wedding, and it hasn't stopped. My mum cancelled making Nicola's dress in the eleventh hour despite how excited she was to wear her design, forcing her to urgently find a new dress. Weeks before our big day, my parents repeatedly pressured and attempted to bribe me into signing away the rights to my name, which would have affected me, my wife, and our future children. They were adamant on me signing before my wedding date because then the terms of the deal would be initiated. My holdout affected the payday, and they have never treated me the same since. During the wedding planning, my mum went so far as to call me \"evil\" because Nicola and I chose to include my Nanny Sandra, and Nicola's Naunni at our table, because they both didn't have their husbands. Both of our parents had their own tables equally adjacent to ours. The night before our wedding, members of my family told me that Nicola was \"not blood\" and \"not family.\" Since the moment I started standing up for myself with my family, I've received endless attacks from my parents, both privately and publicly, that were sent to the press on their orders. Even my brothers were sent to attack me on social media, before they ultimately blocked me out of nowhere this last Summer. My mum hijacked my first dance with my wife, which had been planned weeks in advance to a romantic love song. In front of our 500 wedding guests, Marc Anthony called me to the stage, where in the schedule was planned to be my romantic dance with my wife but instead my mum was waiting to dance with me instead. She danced very inappropriately on me in front of everyone. I've never felt more uncomfortable or humiliated in my entire life. We wanted to renew our vows so we could create new memories of our wedding day that bring us joy and happiness, not anxiety and embarrassment. My wife has been consistently disrespected by my family, no matter how hard we've tried to come together as one. My mum has repeatedly invited women from my past into our lives in ways that were clearly intended to make us both uncomfortable. Despite this, we still travelled to London for my dad's birthday and were rejected for a week as we waited in our hotel room trying to plan quality time with him. He refused all of our attempts, unless it was at his big birthday party with a hundred guests and cameras at every corner. When he finally agreed to see me, it was under the condition that Nicola wasn't invited. It was a slap in the face. Later, when my family travelled to LA, they refused to see me at all. My family values public promotion and endorsements above all else. Brand Beckham comes first. Family \"love\" is decided by how much you post on social media, or how quickly you drop everything to show up and pose for a family photo op even if it's at the expense of our professional obligations. We've gone out of our way for years to show up and support at every fashion show, every party, and every press activity to show \"our perfect family!\" But the one time my wife asked for my mum's support to save displaced dogs during the LA fires, my mum refused. The narrative that my wife controls me is completely backwards. I have been controlled by my parents for most of my life. I grew up with overwhelming anxiety. For the first time in my life, since stepping away from my family, that anxiety has disappeared. I wake up every morning grateful for the life I chose, and have found peace and relief. My wife and I do not want a life shaped by image, press, or manipulation. All we want peace, privacy and happiness for us and our future family. David and Victoria Beckham have been approched by Sky News for comment."
    },
    {
        "title": "Netflix boosts offer for Warner Bros Discovery",
        "description": "Netflix has boosted its offer for media giant Warner Bros Discovery (WBD) as it seeks to fend off a hostile takeover from entertainment conglomerate Paramount.",
        "url": "https://news.sky.com/story/netflix-boosts-offer-for-warner-bros-discovery-13496610",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-warner-bros-logo_7140599.jpg?20260120135548",
        "type": "Entertainment",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-20 12:45:00",
        "Headline": "The all-cash offer could mean a shareholder vote on the deal takes place in three months, an \"accelerated\" timeline, a joint statement said. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Netflix has boosted its offer for media giant Warner Bros Discovery (WBD) as it seeks to fend off a hostile takeover from entertainment conglomerate Paramount. The streaming giant is now offering to pay just cash, ditching a Netflix shares element, in an attempt to improve the attractiveness of its bid. The total value of the deal, $82.7bn (£61.4bn), is unchanged. The amount each WBD shareholder would receive is also unchanged at $27.75 (£20.63) per WBD share. The value price per share means Netflix's offer equates to $72bn (£53.50bn), but the deal gives the assets a total value of $82.7bn. Money blog: Date of next interest rate cut may have just become clearer Such an offer \"simplifies\" the purchase, \"provides greater certainty of value\" for WBD stockholders, and an \"expedited timeline\" for WBD stockholders to vote on Netflix's proposal, according to a statement from Netflix and WBD. It makes it clearer what each stockholder will get when the transaction closes, as Netflix's share price has fallen since it announced the merger plans. A vote could take place by April, the statement said. Paramount, which launched a hostile takeover bid for WBD, had gone over the heads of the WBD board, directly to shareholders and offered $30 (£22.30) cash for each share. The Netflix offer to buy the streaming portion of WBD's business was unanimously recommended to shareholders by the WBD board, while the Paramount Skydance offer has been rejected. Even if accepted by the shareholders, any deal is subject to regulatory approval. Why does it matter? A merger of WBD and either Paramount Skydance or Netflix would be one of the biggest media deals in history, with significant impacts on TV, filmmaking and the possible future of the cinema. Netflix has been sceptical over the future of cinema theatres, with the films it produces having short spells in theatres and some being released directly to streaming. Possible Netflix ownership of WBD's film production companies could mean fewer or shorter duration theatre runs for films. If Paramount Skydance is successful in its takeover attempt, it would own CNN, as well as CBS News, sparking concern about concentrating news services within a small number of companies linked to Donald Trump's allies. Paramount Skydance's chair and chief executive, David Ellison, is the son of billionaire Larry Ellison, an ally of the US president."
    }
]