[
    {
        "title": "Workers will not get unfair dismissal protection from first day in major U-turn",
        "description": "The business secretary has insisted Labour did not breach their manifesto as the government U-turned on its promise to protect workers from unfair dismissal from day one in a job.",
        "url": "https://news.sky.com/story/u-turn-over-plans-to-protect-workers-from-unfair-dismissal-from-day-one-13476235",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-employment-worker_7065173.jpg?20251028201923",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-27 16:48:00",
        "Headline": "People will need to have worked for six months to claim unfair dismissal against their employer - down from the current period of 24 months.",
        "Content": " The business secretary has insisted Labour did not breach their manifesto as the government U-turned on its promise to protect workers from unfair dismissal from day one in a job. In a watering down of one of the key measures in the Employment Rights Bill, the qualifying period for unfair dismissal will now be six months - down from 24 months currently. Labour wanted to bring in protections from day one in the job but faced opposition from some businesses. Responding to criticism, Peter Kyle, the business secretary, said \"compromise is strength\" and an \"art\" that had been lost in recent years, hailing the move as a \"great success\" for the economy, workers and employers.  The changes also mean there will be no statutory probation period and workers will still get sick pay from day one in the job and paternity leave from April next year. Ministers said reducing the qualifying period for unfair dismissal was a \"workable package\" that will \"benefit millions of working people who will gain new rights and offer business and employers much-needed clarity\". Businesses have largely welcomed the change, but unions gave a more hostile response. Sharon Graham, the general secretary of Unite, said the bill was now a \"shell of its former self\". \"With fire and rehire and zero-hours contracts not being banned, the bill is already unrecognisable,\" she said. \"These constant row backs will only damage workers' confidence that the protections promised will be worth the wait. Labour needs to keep its promises.\" The TUC urged the House of Lords to allow the rest of the legislation to pass. Paul Nowak, the TUC general secretary, said: \"The Employment Rights Bill is essential to better quality, more secure jobs for millions of workers across the economy. \"The absolute priority now is to get these rights - like day one sick pay - on the statute book so that working people can start benefitting from them from next April. \"Following the government's announcement, it is now vital that peers respect Labour's manifesto mandate and that this bill secures royal assent as quickly as possible.\"  The Employment Rights Bill was a cornerstone of Labour's 2024 election manifesto, and also contains measures that would ban zero-hours contracts. The legislation has been caught in parliamentary ping pong with the House of Lords. Last month, some peers objected to the provisions around unfair dismissal, suggesting that offering workers that right from day one in the job would deter businesses from hiring. They also opposed Labour's move to force employers to offer guaranteed hours to employees from day one, arguing that not all workers objected to having zero hours. The Resolution Foundation said the change in the unfair dismissal period was a \"sensible move that will speed up the delivery of improvements to working conditions and reduce the risk of firms being put off hiring\". It said the change \"strikes the right balance between strengthening worker protections and encouraging businesses to hire.\" Read more:Budget 2025: The key points at a glanceStarmer insists Labour 'kept to our manifesto' Nye Cominetti, principal economist at the Resolution Foundation, said: \"The UK currently has one of the longest qualifying periods for protection, which needs to come down. But scrapping it entirely would have meant lurching from one extreme to the other and putting firms off hiring new workers. \"This sensible move to a six-month qualifying period will bring the UK into line with other countries, deliver tangible improvements to working conditions, and help the Government move forward with other key aspects of the Employment Rights Bill.\" The Confederation of British Industry (CBI) added: \"Businesses will be relieved that the government has agreed to a key amendment to the Employment Rights Bill, which can pave the way to its initial acceptance. \"This agreement keeps a qualifying period that is simple, meaningful and understood within existing legislation. \"It is crucial for businesses confidence to hire and to support employment, at the same time as protecting workers.\" But Andrew Griffith, the shadow business and trade secretary, said: \"Rachel Reeves's benefits street budget contained little good news for businesses already struggling under the weight of last year's jobs tax. \"Inflation and unemployment are set to be higher for longer, wage costs are going up and business rate reliefs are being cut. \"It's hard to see anything in this budget which will boost confidence or stop the exodus of young people and wealth creators leaving.\""
    },
    {
        "title": "Budget 2025 is a big risk for Labour's election plans",
        "description": "Day two after a budget is always an important moment.",
        "url": "https://news.sky.com/story/budget-20205-is-a-big-risk-for-labours-election-plans-13476160",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-conway-rachel-reeves_7091118.jpg?20251125001626",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-11-27 14:45:00",
        "Headline": "While this was a budget to satisfy financial markets and Labour MPs, Sky's Ed Conway says the chancellor has gambled on the economy outperforming ahead of the next general election.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Day two after a budget is always an important moment. This is when the nerds and boffins of Britain's fiscal thinktanks assemble to deliver their snap verdict on the chancellor's decisions. The moment is more important than ever when, as was certainly the case this time, the budget is a big one. So what did the Institute for Fiscal Studies (IFS) and the Resolution Foundation make of this year's budget? Well, as you'd probably expect, they both fell short of distilling it into a single soundbite, but in broad terms, they both sounded somewhat positive. Money latest: Budget blow to holidays Yes, there were plenty of big provisos. The head of the IFS, Helen Miller, said Labour have broken their manifesto pledge not to raise National Insurance. \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 The Resolution Foundation argued that if only the chancellor had raised the basic rate of income tax instead of freezing personal allowances, it would have made the tax rise considerably fairer and more progressive.  And that's before one gets into the criticism of some of the other bits and pieces from the red book - the structure of the EV tax, for instance (why doesn't it try to penalise congestion?), or of the mansion tax (why not just overhaul council tax altogether?). But for the most part, these closely-followed institutions seemed pretty supportive of this year's budget - more so, certainly, than they were last year. Primarily, that's because while the last budget left only a very thin bit of headroom against Rachel Reeves's fiscal rules, this one was far more cautious, doubling that fiscal insurance policy to just over £21bn.  Yet that headroom is dependent on a couple of important factors. First, that the government will hold to its promises to keep spending growth constrained towards the end of the decade. Second, that it will be able to raise all the tax revenues it's promising in that year. That, in turn, gets to a deeper issue with the budget. Most of the tough stuff has been put off to the final year of the forecast - namely 2029. That year, the government will face a squeeze at the very same moment that Britons are all asked to pay more in taxes. And, critically, that's the very year Labour is due to face a general election. Does it really plan to fight an election off the back of a contracting economy? Consider, too, that for all the government's promises to get living standards growing this parliament, they are currently only forecast to rise at the slowest rate since the 1950s - save for the pandemic and energy price shock period. The economic backdrop, in other words, is hardly rosy. Still, for the time being, the chancellor has managed to put together a budget that has bolstered her position both in her party and in her job. Markets remain relatively sanguine - much more so than after Rachel Reeves's first budget last year - with bond yields lower today than before the event (albeit a little higher than yesterday). Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals £26bn of tax risesCash ISA limit slashed - but some are exempt However, this was a complex budget. And, as with all bits of complex engineering, there remains a distinct possibility of large chunks of the budget failing to work. But since so much of it isn't due to kick in for a few years, it may take quite a while before we find out which bits work and which, if any, don't."
    },
    {
        "title": "National Guard member Sarah Beckstrom has died after Washington DC shooting, Trump says",
        "description": "One of the National Guard members shot in Washington DC on Wednesday has died from her injuries, Donald Trump has said.",
        "url": "https://news.sky.com/story/trump-says-one-of-national-guard-members-shot-in-washington-dc-has-died-13476348",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-national-guard-sarah-beckstrom-i_7093666.jpg?20251127145833",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-27 23:35:00",
        "Headline": "The suspect, Rahmanullah Lakanwal, is said to have driven from the other side of the country to carry out the attack - which authorities are treating as terrorism.",
        "Content": " One of the National Guard members shot in Washington DC on Wednesday has died from her injuries, Donald Trump has said. The US president called 20-year-old Sarah Beckstrom, part of the West Virginia guard, a \"highly respected\" and \"magnificent person\". The other person who was shot, Andrew Wolfe, 24, remains in a critical condition. Mr Trump said he is \"fighting for his life\". The pair were ambushed while patrolling near the White House. Ms Beckstrom's father had earlier told The New York Times she was unlikely to survive, and he was \"holding her hand\". The suspected gunman, Afghan national Rahmanullah Lakanwal, 29, is in a serious condition, Mr Trump told reporters. Mr Trump described him as a \"savage monster\". He drove thousands of miles from his home in Washington state to carry out the attack with a powerful Magnum revolver, according to US attorney Jeanine Pirro. Lakanwal was injured in an exchange of fire and is now under guard in hospital. He's said to have worked in a CIA-backed Afghan army unit before coming to the US in 2021 under a resettlement scheme to protect people from Taliban reprisals. Lakanwal's asylum application was passed this year.  Investigators are treating the attack as terrorism and searched multiple properties on Thursday, including one linked to Lankanwal in Washington state, where the FBI seized electronic devices and interviewed relatives. Lakanwal has a wife and five children, but police said he appeared to have acted alone. Ms Beckstrom had been deployed since August as part of the president's plan to clamp down on what he says are high levels of crime and illegal immigration in some US cities. Mr Trump ordered 500 extra troops into the capital after the shooting, joining about 2,200 already there. A review of all asylum cases approved under Joe Biden's tenure has been launched as Mr Trump's administration seeks to blame his predecessor's policies. Green cards issued to citizens of 19 countries will also be reviewed and immigration requests from Afghans have been suspended. Read more from Sky News:Hong Kong reels from worst disaster in modern historyIsraeli forces kill two men after they appear to surrender 👉 Tap here to follow Trump100 wherever you get your podcasts👈  \"This individual - and so many others - should have never been allowed to come here,\" said CIA director John Ratcliffe in a statement. He said Lakanwal had entered America in September 2021 \"due to his prior work with the US government\". A Trump official, speaking anonymously to Reuters, said the suspected gunman had no known criminal history, while authorities have not yet given a motive."
    },
    {
        "title": "Horror in Hong Kong: Residents reel from its worst disaster in modern history",
        "description": "There is a thickness to the air outside Wang Fuk Court in Hong Kong's Tai Po district.",
        "url": "https://news.sky.com/story/horror-in-hong-kong-residents-reel-from-its-worst-disaster-in-modern-history-13476256",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hong-kong-wang-fuk_7093891.jpg?20251127195207",
        "type": "Home",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-11-27 18:08:00",
        "Headline": "More than 30 hours after the blaze began at Wang Fuk Court, there was still a sense that it is far from under control. At various points during the day the flames sprung up from different windows, as if the fire has found fresh tinder.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n There is a thickness to the air outside Wang Fuk Court in Hong Kong's Tai Po district. The smoke catches in your throat and the emotion catches you off guard. Seven of the eight tower blocks that make up this complex have been all but blackened. And through the shells that used to be windows, you can only imagine the horror and the panic that must have played out inside, the screams that went unanswered. More than 30 hours after the blaze began here there was still a sense that it is far from under control. At various points during the day the flames sprung up from different windows, as if the fire has found fresh tinder. Debris falls from the buildings periodically, ash still floats in the air. As of Friday morning here, 94 people are now confirmed to have died. There is no doubt the community is reeling. Along the surrounding streets hundreds came out to look on in horror, mostly in a stunned sort of silence. Occasionally the air was pierced with the terrible cries of relatives, who had received the news they were dreading. But much of the grief was quiet and held close, an arm around the shoulders or a quiet embrace.  Among the survivors is the Lam family, three generations of which had been living in the building for 40 years. They have lost their home and haven't heard from their neighbours. \"The alarm was all off because of the renovation of the outside. So there is no alarm to let all the people know. Many old people, elderly people, they were all having an afternoon sleep. So nobody knew,\" Ms Lam, whose father survived the fire, said. \"Once they know the fire has already burned down everything, and they cannot escape, they were all trapped in the house. This is a disaster, actually.\" Another survivor said: \"I feel sadness and hopeless and don't know what [I'm] going to do. I don't know. Cannot describe. So sad.\" Hong Kong is one of the world's most densely populated cities, fire in places like this has a significantly more deadly potential. And it also means many are displaced. Over 4,500 lived in this complex alone and are in need of emergency shelter. The government has offered temporary accommodation to many, but the community is filling the gaps. Armies of volunteers handed out food, water, blankets and clothes, including to those who had opted to sleep on the floor of a nearby shopping area. One man, who wanted to sleep on the floor close to his home, said he doesn't feel supported by the government. There is a thin line between grief and anger, and there's a feeling it's narrowing here. Many fingers have pointed towards the construction company running extensive renovations in the complex. A netted mesh, bamboo scaffolding and polystyrene that may have been used as part of the works have all been cited as potentially speeding the spread. Three construction bosses have already been arrested. But there is a sense that distrust of the authorities more broadly runs deep. \"It is very serious and people are starting to feel furious about the construction company and the construction materials,\" one woman said. \"There are so many layers of anger among the people. People feel that every party should take responsibility.\" Read more:At least 83 dead as police make arrests over fireAlmost 280 people missing as blaze engulfs flats Everyone we spoke to wanted to wear a mask to avoid being targeted, with volunteers actively encouraging the masks, and many hinted that the system shoulders its share of responsibility for what happened. This fire is already the worst disaster in the modern history of Hong Kong; many of the victims are elderly and many will struggle to rebuild. There will many days of pain to come, but many days of questions too."
    },
    {
        "title": "Israeli forces kill two Palestinian men in West Bank after they appear to surrender",
        "description": "Israeli forces killed two Palestinian men in the West Bank after they appeared to be surrendering.",
        "url": "https://news.sky.com/story/israeli-forces-kill-two-palestinian-men-in-west-bank-after-they-appear-to-surrender-13476319",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-west-bank-shooting_7094124.jpg?20251128011820",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-27 21:09:00",
        "Headline": "Palestinians said the killings, which were captured on video and shown on two Arab TV channels, were carried out \"in cold blood\".",
        "Content": " Israeli forces killed two Palestinian men in the West Bank after they appeared to be surrendering. Palestinians said the killings, which were captured on video and shown on two Arab TV channels, were carried out \"in cold blood\". In the video, the men were seen exiting a building and lying on the ground in front of Israeli forces in the northern West Bank city of Jenin. Both men lifted their T-shirts and held their hands in the air, apparently to show they were not carrying weapons or explosives. The soldiers then appeared to order the men back inside the building before they were shot. A Reuters journalist in the area saw the men leave the building, appearing to surrender, and later, after hearing shots fired, saw Israeli forces standing near what appeared to be a lifeless body. The men were identified as al Muntasir Abdullah, 26, and Yousef Asasa, 37, by Palestinian authorities. What has Israel said about the incident? A joint statement between the Israeli Defence Forces and Israeli police said: \"Earlier this evening (Thursday), during an Israel Border Police and IDF operation in the area of Jenin, the forces operated to apprehend wanted individuals who had carried out terror activities, including hurling explosives and firing at security forces. \"The wanted individuals were affiliated with a terror network in the area of Jenin. \"The forces entered the area, enclosed the structure in which the suspects were located, and initiated a surrender procedure that lasted several hours. Following the use of engineering tools on the structure, the two suspects exited. \"Following their exit, fire was directed toward the suspects. \"The incident is under review by the commanders on the ground, and will be transferred to the relevant professional bodies.\" Israel's far-right national security minister Itamar Ben-Gvir said the military and police unit involved in the shooting had his \"full backing\". \"The fighters acted exactly as expected of them - terrorists should die!\" he wrote on X. 'An outright extrajudicial killing' But Palestinians and human rights groups say Israeli investigations in such incidents yield few results, with Israeli troops rarely prosecuted. The Palestinian prime minister's office in Ramallah also accused Israel of executing the men \"in cold blood\", calling the shooting \"an outright extrajudicial killing in blatant violation of international humanitarian law\". Yuli Novak, the executive director of B'Tselem, an Israeli human rights organisation, said: \"The execution documented today is the result of an accelerated process of dehumanisation of Palestinians and the complete abandonment of their lives by the Israeli regime. \"In Israel, there is no mechanism that acts to stop the killing of Palestinians or is capable of prosecuting those responsible.\" Read more from Sky News:Hong Kongers reel from fire disasterNational Guard trooper shot in DC dies Israel's military has scaled up its military operations in the West Bank since the October 7 Hamas attack, which triggered the war in Gaza. Since October 2023, Israeli forces and settlers have killed more than 1,000 Palestinians in the West Bank, according to B'Tselem, which said the perpetrators were \"granted full impunity by Israel\"."
    },
    {
        "title": "Man jailed for keeping eight people enslaved in London car wash",
        "description": "A man has been jailed for keeping eight people enslaved in a car wash in London.",
        "url": "https://news.sky.com/story/man-jailed-for-keeping-eight-people-enslaved-in-london-car-wash-13476151",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-margai-modern-salvery_7093717.png?20251127154001",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-27 14:23:00",
        "Headline": "Hewa Margai, 45, was sentenced to eight years and six months in prison at Kingston Crown Court after being found guilty of eight counts of holding a person in slavery or servitude.",
        "Content": " A man has been jailed for keeping eight people enslaved in a car wash in London. Hewa Margai, 45, of Carshalton Road, Mitcham, London, was sentenced to eight years and six months in prison at Kingston Crown Court after being found guilty of eight counts of holding a person in slavery or servitude. The victims, including a 15-year-old boy, are Romanian nationals who were trafficked to the UK between November and December 2020 under false promises of accommodation, fair pay, food and legitimate employment. But after they arrived, they were forced to work at Margai's car wash in Mitcham, housed in a small shed on-site, and routinely subjected to physical, mental and psychological abuse. During the COVID lockdown, the victims were confined to the car wash premises without access to their travel documents. The 15-year-old victim contacted the Metropolitan Police on 1 February 2021, saying he had been lured to the UK with the promise of a job at the car wash, but had his ID confiscated by the manager upon arrival. When officers went to the car wash on the same day, they found two women in their 20s and five men aged in their teens, 20s and 30s, as well as the 15-year-old boy, who had been living in a shed on-site for months. The victims spoke minimal English, but disclosed to officers via Google Translate that they had come to the UK via bus and had only worked for a few weeks before the car wash was closed due to the COVID lockdown. After the business was closed, they said they had to pay rent to car wash owner Margai, who had confiscated their IDs. One of the rescued women developed a severe infection, resulting in hospitalisation and multiple surgeries. This was a direct consequence of the neglect and conditions she endured during her captivity, according to police. Margai was out of the country at the time of the raid and was arrested upon his return to the UK on 12 March 2021. Read more from Sky News:Man arrested over Manchester synagogue attackMultiple dead and more missing in Hong Kong fire Judge Mark Milliken-Smith KC said when sentencing Margai: \"In my opinion, your desire for financial profit trumped any care for these young people, once they arrived. \"You instructed them to remain within the car wash premises … they had no choice, and you knew it.\" The judge said when police arrived at the car wash, they found that \"the room was cold and damp and smelt terribly of old food and body odour\". He added: \"You intended them to live in this squalor, and you intended to profit from it,\" he added. \"Without their [ID] cards, they were effectively your captives, and you knew it.\" Detective Chief Inspector Mike Stubbins, from the Metropolitan Police's Central Specialist Crime unit, said: \"The trauma and ordeal the victims endured cannot be underestimated. \"They have shown remarkable strength throughout the investigation and played an essential role in providing evidence to ensure Margai is held accountable and receives the appropriate punishment for his crimes.\" DCI Stubbins added: \"I would like to thank the investigation team, who worked tirelessly to identify the victims, ensure their safety and help repatriate them to Romania, where they could be reunited with their friends and family. \"By engaging directly with the victims, the first officers on the scene were able to gather vital information and promptly safeguard the group, resulting in an effective investigation.\""
    },
    {
        "title": "Creator of AI actress Tilly Norwood addresses claims she'll 'steal jobs' from real stars",
        "description": "The creator of an AI actress has told Sky News that synthetic performers will get more actors working, rather than steal jobs. ",
        "url": "https://news.sky.com/story/creator-of-ai-actress-tilly-norwood-addresses-claims-shell-steal-jobs-from-real-stars-13476326",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eline-velden_7094045.jpg?20251127222323",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-27 22:02:00",
        "Headline": "An AI production studio has been roundly criticised by Hollywood - but its founder has insisted its creations will boost the entertainment industry, not hinder it. ",
        "Content": "The creator of an AI actress has told Sky News that synthetic performers will get more actors working, rather than steal jobs.  AI production studio Particle6 has ruffled feathers in Hollywood by unveiling Tilly Norwood - a 20-something actress created by artificial intelligence. Speaking to Sky News' Dominic Waghorn, actor and comedian Eline Van der Velden - who founded Particle6 - insisted Norwood is \"not meant to take jobs in the traditional film\". AI entertainment is \"developing as a completely separate genre\", she said, adding: \"And that's where Tilly is meant to stay. She's meant to stay in the AI genre and be a star in that.\" \"I don't want her to take real actors' jobs,\" she continued. \"I wanted to have her own creative path.\" Norwood has been labelled \"really, really scary\" by Mary Poppins Returns star Emily Blunt, while the US actors' union SAG-AFTRA said in a statement: \"Tilly Norwood is not an actor, it's a character generated by a computer program that was trained on the work of countless professional performers - without permission or compensation.\" Responding to the criticism, Ms Van der Velden argued that Hollywood is \"going to have to learn how to work with [AI] going forward\". \"We can't stop it,\" she said. \"If we put our head in the sand, then our jobs will be gone. However, instead, if we learn how to use these tools, if we use it going forward, especially in Britain, we can be that creative powerhouse.\" Read more:How AI music is fooling most of usTom Hollander 'not scared' of AI star Ms Van der Velden said her studio has already helped a number of projects that were struggling due to budget constraints. \"Some productions get stuck, not able to find the last 30% of their budget, and so they don't go into production,\" she said. \"Now with AI, by replacing some of the shots […] we can actually get that production going and working. So as a result, we get more jobs, we get more actors working, so that's all really, really positive news.\""
    },
    {
        "title": "Sally Rooney tells court new books may not be published in UK due to Palestine Action ban",
        "description": "Irish author Sally Rooney has told the High Court she may not be able to publish new books in the UK, and may have to withdraw previous titles from sale, because of the ban on Palestine Action.",
        "url": "https://news.sky.com/story/sally-rooney-tells-court-new-books-may-not-be-published-in-uk-due-to-palestine-action-ban-13476264",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sally-rooney-author_6994490.jpg?20250818162218",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-27 18:46:00",
        "Headline": "The Irish writer said it is currently \"unclear\" whether UK companies can pay her, after she said she would donate earnings to support Palestine Action.",
        "Content": "Irish author Sally Rooney has told the High Court she may not be able to publish new books in the UK, and may have to withdraw previous titles from sale, because of the ban on Palestine Action. The group's co-founder Huda Ammori is taking legal action against the Home Office over the decision to proscribe Palestine Action under anti-terror laws in July. The ban made being a member of, or supporting, Palestine Action a criminal offence punishable by up to 14 years in prison. Rooney was in August warned that she risked committing a terrorist offence after saying she would donate earnings from her books, and the TV adaptations of Normal People and Conversations With Friends, to support Palestine Action.  In a witness statement made public on Thursday, Rooney said the producer of the BBC dramas said they had been advised that they could not send money to her agent if the funds could be used to fund the group, as that would be a crime under anti-terror laws. Rooney added that it was \"unclear\" whether any UK company can pay her, stating that if she is prevented from profiting from her work, her income would be \"enormously restricted\". \n                  Bodycam footage of alleged sledgehammer attack on police shown at trial of Palestine Action activists\n                 \n                  Manhunt for prisoner who 'absconded' after being freed from HMP Wandsworth for brother's wedding\n                 \n                  More than a dozen Palestine Action protests planned next month despite ban on group\n                  She added: \"If I were to write another screenplay, television show or similar creative work, I would not be able to have it produced or distributed by a company based in England and Wales without, expressly or tacitly, accepting that I would not be paid.\" Rooney described how the publication of her books is based on royalties on sales, and that non-payment of royalties would mean she can terminate her contract. \"If, therefore, Faber and Faber Limited are legally prohibited from paying me the royalties I am owed, my existing works may have to be withdrawn from sale and would therefore no longer be available to readers in the UK,\" Rooney added, saying this would be \"a truly extreme incursion by the state into the realm of artistic expression\". Rooney added that it is \"almost certain\" that she cannot publish or produce new work in the UK while the Palestine Action ban remains in force. She said: \"If Palestine Action is still proscribed by the time my next book is due for publication, then that book will be available to readers all over the world and in dozens of languages, but will be unavailable to readers in the United Kingdom simply because no one will be permitted to publish it, unless I am content to give it away for free.\" Sir James Eadie KC, barrister for the Home Office, said in a written submission that the ban's aim is \"stifling organisations concerned in terrorism and for members of the public to face criminal liability for joining or supporting such organisations\". \"That serves to ensure proscribed organisations are deprived of the oxygen of publicity as well as both vocal and financial support,\" he continued. The High Court hearing is due to conclude on 2 December, with a decision expected in writing at a later date."
    },
    {
        "title": "Putin strikes conciliatory tone - then hardens it: Kremlin signals no breakthrough on US peace plan",
        "description": "This was the first time Vladimir Putin has commented on the latest US peace proposal. Will Russia agree? Is a deal close? It didn't sound like it.",
        "url": "https://news.sky.com/story/putin-strikes-conciliatory-tone-then-hardens-it-kremlin-signals-no-breakthrough-on-us-peace-plan-13476259",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-vladimir-putin-kyrgyzstan_7093264.jpg?20251127084250",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-27 18:28:00",
        "Headline": "In his first comments on Washington's latest proposal, the Russian leader praised the plan's \"basis for future agreements\", but doubled down on core territorial demands and issued fresh warnings to Kyiv — a sign that Moscow remains far from accepting a deal.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  This was the first time Vladimir Putin has commented on the latest US peace proposal. Will Russia agree? Is a deal close? It didn't sound like it. There was plenty of conciliatory language at the start of his press conference which was designed to show a willingness to reach an agreement. Donald Trump's plan can provide \"the basis for future agreements\", he said. Russia is ready for \"serious\" discussions. He even expressed a willingness to discuss European security. But \"discuss\" doesn't mean \"agree\", and it certainly doesn't mean \"compromise\". And as the questions grew more specific, and the focus turned to the various sticking points in a peace deal, the Kremlin leader's language hardened, revealing a familiar theme. On the most contentious point of territory, he described recognition of Russian sovereignty over Crimea and the Donbas as a \"key point\" to the negotiations with the US.  That recognition, remember, was one of the proposals that made the initial 28-point peace plan so unpalatable for Ukraine. \n                  Horror in Hong Kong: Residents reel from its worst disaster in modern history\n                 \n                  At least 83 dead and hundreds missing as police make arrests over Hong Kong fire\n                 \n                  Israeli forces kill two Palestinian men in West Bank after they appear to surrender\n                 They've managed to get it removed from the latest draft, but it's clear that Putin wants it back in. On this issue, there's clearly still no middle ground. And he also had a warning for Kyiv and its European allies regarding their demands for a ceasefire, saying: \"Ukrainian troops must withdraw from the territories they hold, and then the fighting will cease. If they don't leave, then we shall achieve this by armed means.\" Read more from Sky News:Washington DC shooting suspect worked with a CIA-backed unitFrance reveals new national military service It doesn't sound like the language of someone who wants peace. It sounds like someone who won't stop until they have what they want. Someone whose core demands remain undiluted. Whether it's on the battlefield or at the negotiating table, Russia is still pursuing a victory. Putin also reiterated a long-standing gripe over the legitimacy of Volodymyr Zelenskyy's presidency, claiming it means a legally-binding deal with Ukraine is impossible as things stand. It sounded suspiciously like Moscow's latest play for time. It's not Russia's fault there's no peace plan - it's the legal small print. So when US envoy Steve Witkoff visits Moscow next week for talks in the Kremlin, it seems very unlikely he'll leave with an unconditional agreement to America's latest peace plan."
    },
    {
        "title": "Man arrested at Manchester Airport in connection with attack at Heaton Park synagogue",
        "description": "A man has been arrested at an airport as part of the investigation into the terrorist attack at a Manchester synagogue.",
        "url": "https://news.sky.com/story/man-arrested-at-manchester-airport-over-attack-at-heaton-park-synagogue-13476154",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-police-manchester-uk-news_6955917.jpg?20250703074650",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-27 14:29:00",
        "Headline": "A man was arrested after landing at Manchester Airport on Thursday, becoming the seventh person detained in connection with October's fatal attack at Heaton Park Hebrew Congregation Synagogue.",
        "Content": "A man has been arrested at an airport as part of the investigation into the terrorist attack at a Manchester synagogue. The 31-year-old was detained at Manchester Airport on suspicion of the commission, preparation and instigation of acts of terrorism after arriving on an inbound flight, police said. It brings the total number of people arrested in connection with the incident at Heaton Park Hebrew Congregation Synagogue to seven. Jihad al Shamie launched the attack at the synagogue in Crumpsall on 2 October, driving his car at worshippers gathering on the Jewish holy day of Yom Kippur, before attacking others with a knife and trying to storm inside.  Armed police shot al Shamie after he ran towards officers \"aggressively\" while carrying a knife and what police feared was an explosive device - later identified as a fake. Worshippers Melvin Cravitz, 66, and Adrian Daulby, 53, were killed, with Mr Daulby being described as a \"quiet hero\" who leapt from his seat to block the doors of the synagogue as it came under attack. He died from a single gunshot wound to the chest fired by an armed police officer, while father-of-three Mr Cravitz died from multiple knife wounds inflicted by al Shamie, an inquest at Manchester Coroner's Court heard in October. The inquests into the deaths of both men have been adjourned until February next year. Three other men were treated in hospital for serious injuries. Two have since been released, police said on Thursday. An inquest into the death of al Shamie, a Syrian-born UK citizen, heard he was identified by his fingerprints and evidence, including his car, phone and inquiries with his immediate family in the aftermath of the attack. At the hearing in October, Judge Alexia Durran, the chief coroner of England and Wales, said her provisional findings were that al Shamie died of gunshot wounds. The Independent Office for Police Conduct found no misconduct in the police response.  Read more from Sky News:Father calls for unityKing visits synagogue In a statement on Thursday, Assistant Chief Constable Rob Potts, from Counter Terrorism Policing North West, said: \"The loved ones of Mr Daulby and Mr Cravitz have been updated on this development, as have those who were seriously injured in the attack. \"Our investigation is continuing, and I would once again appeal for anyone with information that they think could assist our enquiries to please come forward.\" Police also said a 30-year-old man arrested on 9 October on suspicion of failing to disclose information contrary to S38B of the Terrorism Act 2000 remains on bail."
    },
    {
        "title": "Budget 2025 is a big risk for Labour's election plans",
        "description": "Day two after a budget is always an important moment.",
        "url": "https://news.sky.com/story/budget-20205-is-a-big-risk-for-labours-election-plans-13476160",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-conway-rachel-reeves_7091118.jpg?20251125001626",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-11-27 14:45:00",
        "Headline": "While this was a budget to satisfy financial markets and Labour MPs, Sky's Ed Conway says the chancellor has gambled on the economy outperforming ahead of the next general election.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Day two after a budget is always an important moment. This is when the nerds and boffins of Britain's fiscal thinktanks assemble to deliver their snap verdict on the chancellor's decisions. The moment is more important than ever when, as was certainly the case this time, the budget is a big one. So what did the Institute for Fiscal Studies (IFS) and the Resolution Foundation make of this year's budget? Well, as you'd probably expect, they both fell short of distilling it into a single soundbite, but in broad terms, they both sounded somewhat positive. Money latest: Budget blow to holidays Yes, there were plenty of big provisos. The head of the IFS, Helen Miller, said Labour have broken their manifesto pledge not to raise National Insurance. \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 The Resolution Foundation argued that if only the chancellor had raised the basic rate of income tax instead of freezing personal allowances, it would have made the tax rise considerably fairer and more progressive.  And that's before one gets into the criticism of some of the other bits and pieces from the red book - the structure of the EV tax, for instance (why doesn't it try to penalise congestion?), or of the mansion tax (why not just overhaul council tax altogether?). But for the most part, these closely-followed institutions seemed pretty supportive of this year's budget - more so, certainly, than they were last year. Primarily, that's because while the last budget left only a very thin bit of headroom against Rachel Reeves's fiscal rules, this one was far more cautious, doubling that fiscal insurance policy to just over £21bn.  Yet that headroom is dependent on a couple of important factors. First, that the government will hold to its promises to keep spending growth constrained towards the end of the decade. Second, that it will be able to raise all the tax revenues it's promising in that year. That, in turn, gets to a deeper issue with the budget. Most of the tough stuff has been put off to the final year of the forecast - namely 2029. That year, the government will face a squeeze at the very same moment that Britons are all asked to pay more in taxes. And, critically, that's the very year Labour is due to face a general election. Does it really plan to fight an election off the back of a contracting economy? Consider, too, that for all the government's promises to get living standards growing this parliament, they are currently only forecast to rise at the slowest rate since the 1950s - save for the pandemic and energy price shock period. The economic backdrop, in other words, is hardly rosy. Still, for the time being, the chancellor has managed to put together a budget that has bolstered her position both in her party and in her job. Markets remain relatively sanguine - much more so than after Rachel Reeves's first budget last year - with bond yields lower today than before the event (albeit a little higher than yesterday). Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals £26bn of tax risesCash ISA limit slashed - but some are exempt However, this was a complex budget. And, as with all bits of complex engineering, there remains a distinct possibility of large chunks of the budget failing to work. But since so much of it isn't due to kick in for a few years, it may take quite a while before we find out which bits work and which, if any, don't."
    },
    {
        "title": "Sally Rooney tells court new books may not be published in UK due to Palestine Action ban",
        "description": "Irish author Sally Rooney has told the High Court she may not be able to publish new books in the UK, and may have to withdraw previous titles from sale, because of the ban on Palestine Action.",
        "url": "https://news.sky.com/story/sally-rooney-tells-court-new-books-may-not-be-published-in-uk-due-to-palestine-action-ban-13476264",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sally-rooney-author_6994490.jpg?20250818162218",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-27 18:46:00",
        "Headline": "The Irish writer said it is currently \"unclear\" whether UK companies can pay her, after she said she would donate earnings to support Palestine Action.",
        "Content": "Irish author Sally Rooney has told the High Court she may not be able to publish new books in the UK, and may have to withdraw previous titles from sale, because of the ban on Palestine Action. The group's co-founder Huda Ammori is taking legal action against the Home Office over the decision to proscribe Palestine Action under anti-terror laws in July. The ban made being a member of, or supporting, Palestine Action a criminal offence punishable by up to 14 years in prison. Rooney was in August warned that she risked committing a terrorist offence after saying she would donate earnings from her books, and the TV adaptations of Normal People and Conversations With Friends, to support Palestine Action.  In a witness statement made public on Thursday, Rooney said the producer of the BBC dramas said they had been advised that they could not send money to her agent if the funds could be used to fund the group, as that would be a crime under anti-terror laws. Rooney added that it was \"unclear\" whether any UK company can pay her, stating that if she is prevented from profiting from her work, her income would be \"enormously restricted\". \n                  Bodycam footage of alleged sledgehammer attack on police shown at trial of Palestine Action activists\n                 \n                  Manhunt for prisoner who 'absconded' after being freed from HMP Wandsworth for brother's wedding\n                 \n                  More than a dozen Palestine Action protests planned next month despite ban on group\n                  She added: \"If I were to write another screenplay, television show or similar creative work, I would not be able to have it produced or distributed by a company based in England and Wales without, expressly or tacitly, accepting that I would not be paid.\" Rooney described how the publication of her books is based on royalties on sales, and that non-payment of royalties would mean she can terminate her contract. \"If, therefore, Faber and Faber Limited are legally prohibited from paying me the royalties I am owed, my existing works may have to be withdrawn from sale and would therefore no longer be available to readers in the UK,\" Rooney added, saying this would be \"a truly extreme incursion by the state into the realm of artistic expression\". Rooney added that it is \"almost certain\" that she cannot publish or produce new work in the UK while the Palestine Action ban remains in force. She said: \"If Palestine Action is still proscribed by the time my next book is due for publication, then that book will be available to readers all over the world and in dozens of languages, but will be unavailable to readers in the United Kingdom simply because no one will be permitted to publish it, unless I am content to give it away for free.\" Sir James Eadie KC, barrister for the Home Office, said in a written submission that the ban's aim is \"stifling organisations concerned in terrorism and for members of the public to face criminal liability for joining or supporting such organisations\". \"That serves to ensure proscribed organisations are deprived of the oxygen of publicity as well as both vocal and financial support,\" he continued. The High Court hearing is due to conclude on 2 December, with a decision expected in writing at a later date."
    },
    {
        "title": "Man jailed for keeping eight people enslaved in London car wash",
        "description": "A man has been jailed for keeping eight people enslaved in a car wash in London.",
        "url": "https://news.sky.com/story/man-jailed-for-keeping-eight-people-enslaved-in-london-car-wash-13476151",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-margai-modern-salvery_7093717.png?20251127154001",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-27 14:23:00",
        "Headline": "Hewa Margai, 45, was sentenced to eight years and six months in prison at Kingston Crown Court after being found guilty of eight counts of holding a person in slavery or servitude.",
        "Content": " A man has been jailed for keeping eight people enslaved in a car wash in London. Hewa Margai, 45, of Carshalton Road, Mitcham, London, was sentenced to eight years and six months in prison at Kingston Crown Court after being found guilty of eight counts of holding a person in slavery or servitude. The victims, including a 15-year-old boy, are Romanian nationals who were trafficked to the UK between November and December 2020 under false promises of accommodation, fair pay, food and legitimate employment. But after they arrived, they were forced to work at Margai's car wash in Mitcham, housed in a small shed on-site, and routinely subjected to physical, mental and psychological abuse. During the COVID lockdown, the victims were confined to the car wash premises without access to their travel documents. The 15-year-old victim contacted the Metropolitan Police on 1 February 2021, saying he had been lured to the UK with the promise of a job at the car wash, but had his ID confiscated by the manager upon arrival. When officers went to the car wash on the same day, they found two women in their 20s and five men aged in their teens, 20s and 30s, as well as the 15-year-old boy, who had been living in a shed on-site for months. The victims spoke minimal English, but disclosed to officers via Google Translate that they had come to the UK via bus and had only worked for a few weeks before the car wash was closed due to the COVID lockdown. After the business was closed, they said they had to pay rent to car wash owner Margai, who had confiscated their IDs. One of the rescued women developed a severe infection, resulting in hospitalisation and multiple surgeries. This was a direct consequence of the neglect and conditions she endured during her captivity, according to police. Margai was out of the country at the time of the raid and was arrested upon his return to the UK on 12 March 2021. Read more from Sky News:Man arrested over Manchester synagogue attackMultiple dead and more missing in Hong Kong fire Judge Mark Milliken-Smith KC said when sentencing Margai: \"In my opinion, your desire for financial profit trumped any care for these young people, once they arrived. \"You instructed them to remain within the car wash premises … they had no choice, and you knew it.\" The judge said when police arrived at the car wash, they found that \"the room was cold and damp and smelt terribly of old food and body odour\". He added: \"You intended them to live in this squalor, and you intended to profit from it,\" he added. \"Without their [ID] cards, they were effectively your captives, and you knew it.\" Detective Chief Inspector Mike Stubbins, from the Metropolitan Police's Central Specialist Crime unit, said: \"The trauma and ordeal the victims endured cannot be underestimated. \"They have shown remarkable strength throughout the investigation and played an essential role in providing evidence to ensure Margai is held accountable and receives the appropriate punishment for his crimes.\" DCI Stubbins added: \"I would like to thank the investigation team, who worked tirelessly to identify the victims, ensure their safety and help repatriate them to Romania, where they could be reunited with their friends and family. \"By engaging directly with the victims, the first officers on the scene were able to gather vital information and promptly safeguard the group, resulting in an effective investigation.\""
    },
    {
        "title": "TGI Fridays' UK chain up for sale a month after changing hands",
        "description": "The future of TGI Fridays' British operations has been thrown into fresh doubt just a month after the well-known casual dining chain was bought by the manager of most of the brand&#8217;s global operations.",
        "url": "https://news.sky.com/story/tgi-fridays-uk-chain-up-for-sale-a-month-after-changing-hands-13476108",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tgi-fridays-gv_7094081.jpg?20251127225032",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-27 12:50:00",
        "Headline": "The fate of TGI's 49 British restaurants and 2,000-strong workforce is again uncertain after Interpath was hired to canvas appetite from potential investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The future of TGI Fridays' British operations has been thrown into fresh doubt just a month after the well-known casual dining chain was bought by the manager of most of the brand’s global operations. Sky News has learnt that the financial advisory firm Interpath has been appointed to explore strategic options for TGI Fridays' UK business, which comprises 49 sites and employs almost 2,000 people. Interpath has begun contacting potential investors in the last few days about a potential deal. Money latest: Budget blow to holidays It comes just a few weeks after TGI Fridays in the UK was acquired by Sugarloaf TGIF Management, a company run by the chain's former chief executive, Ray Blanchette. The reason for the rapid decision to market the business was unclear on Thursday, although the commencement of an investment process at the start of the festive trading period will raise questions among prospective bidders. In a statement issued to Sky News, Phil Broad, president, TGI Fridays International Franchising, said: \"The directors of TGI Fridays UK can confirm they are working closely with independent advisors to explore all available options for securing the long-term future of TGI Fridays in the UK. \n                  Politics latest: Government U-turns on key part of employment reforms\n                 \n                  Holidays blow with budget announcement most of us missed | Money blog\n                 \n                  Budget 2025 is a big risk for Labour's election plans\n                 \"Since assuming control last month, our priority has been to protect jobs, support our employees, and continue to deliver the welcoming, celebratory experience guests expect from TGI Fridays. \"These discussions are progressing constructively, and we will provide further updates when appropriate.\" TGI's British chain, was previously sold just over a year ago to Calveton UK and Breal Capital, two investment firms which are said to have stabilised the business's performance. While the hospitality sector was not hit as hard by this week's Budget as it had been in Rachel Reeves's inaugural fiscal statement in autumn 2024, it did not provide as much financial relief as the industry had been calling for."
    },
    {
        "title": "'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says",
        "description": "Sticking to Labour's manifesto pledge and freezing income tax thresholds rather than raising income tax has hurt low- and middle-income earners, an influential thinktank has said. ",
        "url": "https://news.sky.com/story/sticking-to-labour-manifesto-pledge-costs-millions-of-workers-resolution-foundation-says-13475963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-money-generic_7093188.jpg?20251127071705",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-27 05:50:00",
        "Headline": "There will be more \"bracing budgets\" to come as economic growth is a \"hurdle that remains to be cleared\", says the influential thinktank.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Sticking to Labour's manifesto pledge and freezing income tax thresholds rather than raising income tax has hurt low- and middle-income earners, an influential thinktank has said.  Millions of these workers \"would have been better off with their tax rates rising than their thresholds being frozen\", according to the Resolution Foundation's chief executive, Ruth Curtice. \"Ironically, sticking to her manifesto tax pledge has cost millions of low-to-middle earners\", she said. Chancellor Rachel Reeves announced in her budget speech that the point at which people start paying higher rates of tax has been held. It means earners are set to be dragged into higher tax bands as they get pay rises. The chancellor felt unable to raise income tax as the Labour Party pledged not to raise taxes on working people in its election manifesto.  But many are saying that pledge was broken regardless, as the tax burden has increased by £26bn in this budget. When asked by Sky News whether Ms Reeves would accept she broke the manifesto pledge, she said on Thursday: \"I do recognise that yesterday I have asked working people to contribute a bit more by freezing those thresholds for a further three years from 2028.\" \n                  Budget 2025 is a big risk for Labour's election plans\n                 \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \"I do recognise that that will mean that working people pay a bit more, but I've kept that contribution to an absolute minimum\". Read more:Budget 2025: The key points at a glanceBudget tax calculator: How much more will you pay? As a result of the freeze in income tax bands, another closely watched thinktank, the Institute for Fiscal Studies (IFS), said a basic-rate taxpayer will pay £220 more tax per year, while a higher-rate taxpayer will be charged £600 more annually. Welcome news The Resolution Foundation thinktank, which aims to raise living standards, welcomed measures designed to support people with the cost of living, such as the removal of the two-child benefit cap, which limited the number of children families could claim benefits for. The announced reduction in energy bills through the removal of as yet unspecified levies was similarly welcomed. The chancellor said bills would become £150 cheaper a year, but the foundation said typical energy bills will fall by around £130 annually for the next three years, \"though support then fades away\". Credit was also given to Ms Reeves for increasing the financial cushion she has against market shocks, like a spike in energy prices. This is part of her self-imposed fiscal rules to bring down debt and balance the budget by 2030. As a result, less policy speculation and more stability can be expected. \"The decision to increase her headroom, when she didn't strictly need to, deserves credit,\" said economics research institute, the IFS. \"It means that it will require a larger shock to blow the chancellor off course. This in turn should mean that we can expect a period of greater stability and more muted policy speculation.\" More money, however, will be borrowed as a result of the budget, said independent forecasters, the Office for Budget Responsibility (OBR). Budget spending and tax policies increase borrowing by an average of £5bn over the next three years, but then reduces it by roughly £13bn in the following two. More to come This budget won't be the last of it, the Resolution Foundation's Ms Curtice said, as economic growth forecasts have been downgraded by the OBR, and growth is a \"hurdle that remains to be cleared\". \"Until that challenge is taken on, we can expect plenty more bracing budgets,\" she added. It comes despite Ms Reeves saying as far back as last year, there would be no more tax increases. Ultimately, though, the foundation said: \"The great drumbeat of doom that preceded the chancellor's big day turned out to be over the top: the forecasts came in better than many had feared.\""
    },
    {
        "title": "Man who threw boy from 10th floor of Tate Modern guilty of attacking Broadmoor nurses",
        "description": "A man who threw a six-year-old boy from the 10th floor of the Tate Modern has been found guilty of attacking two nurses at Broadmoor hospital.",
        "url": "https://news.sky.com/story/man-who-threw-boy-from-10th-floor-of-tate-modern-guilty-of-attacking-broadmoor-nurses-13476118",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jonty-bravery-tate_7093589.jpg?20251127134946",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-27 13:19:00",
        "Headline": "Jonty Bravery kicked a female nurse in the thigh and \"clawed\" another in the face, leaving her with blood dripping down her cheek.",
        "Content": "A man who threw a six-year-old boy from the 10th floor of the Tate Modern has been found guilty of attacking two nurses at Broadmoor hospital. Jonty Bravery kicked a female nurse in the thigh and \"clawed\" another in the face, leaving her with blood dripping down her cheek. The 24-year-old was given a life sentence for throwing the French boy from a balcony of the London art gallery in 2019. The boy survived the 100ft (30m) fall, but was left with life-changing injuries, including multiple broken bones and a bleed on the brain. Bravery is now at Broadmoor, a high-security psychiatric hospital in Berkshire. He chose not to attend his trial at Westminster Magistrates' Court on Thursday, where he was found guilty of assaulting nurses Kate Mastalerz and Linda McKinlay in September last year. Prosecutor Tom Heslop told how Bravery has to be monitored by three staff members \"24-hours-a-day, seven-days-a-week\", and is kept in a room with only a mattress in it. \"At around 9.30 at night, Mr Bravery asked to go to the toilet,\" he said. \"After he used the bathroom, he attempted to climb a ledge and throw himself from it.\" The nurses attempted to restrain him, putting him on the mattress before turning him on to his back, Mr Heslop said. Bravery \"kicked out towards Ms Mastalerz\", striking her thigh, the court heard. He also \"clawed across\" Ms McKinlay's face, leaving her with blood dripping down her cheek, the prosecutor said. Body-worn footage played to the court showed the nurses struggling with Bravery on the floor before other staff rushed in to help. A staff member can be heard shouting, \"Jesus Christ, do something\". Read more from Sky News:Military chiefs in 'difficult meeting' as tensions mount over moneyNeck scan could detect risk of heart attack and stroke Ms McKinlay told the court it was the first time she had been attacked at Broadmoor in her long career. \"Jonty climbed up trying to get on to the windowsill,\" she said. She told the court Bravery had done this before to try and harm himself. \"We were trying to coax Jonty down. We didn't want him to hurt himself,\" she added. \"He was screaming and shouting and kicking. We shouted for assistance.\" Asked about her injuries, the grandmother said: \"He attacked my face, he was clawing at my face. \"My eye and my face were all scratched. \"In the aftermath, I was very shaken. In all my years of being in Broadmoor, I've never been attacked.\" Ms McKinlay was taken to hospital for treatment. Fellow nurse Ms Mastalerz said she started \"shouting for help\" when Bravery started kicking and scratching. She was left with a bruised thigh, and said it had been a \"very stressful situation\". Finding him guilty of both charges, Chief Magistrate Paul Goldspring said Bravery \"went too far\". He adjourned sentencing until 8 January, and asked for an update on Bravery's current mental health condition. In 2020, Bravery was imprisoned for another 14 weeks after he admitted attacking Broadmoor hospital staff. He punched nursing assistant Sarah Edwards in the head and face before pulling her hair. He also bit Maxwell King, a rehabilitation therapist assistant, on his finger after he came to his colleague's aid."
    },
    {
        "title": "No changes to Scottish income tax plan, First Minister John Swinney vows",
        "description": "The Scottish government does not intend to increase income tax rates or introduce new bands in next year's budget, First Minister John Swinney has vowed.",
        "url": "https://news.sky.com/story/no-changes-to-scottish-income-tax-plan-first-minister-john-swinney-vows-13476066",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-john-swinney-first-minister_7093566.jpg?20251127133522",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-11-27 11:17:00",
        "Headline": "At First Minister's Questions on Thursday, Scottish Tory leader Russell Findlay accused the UK chancellor of \"screwing taxpayers\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government does not intend to increase income tax rates or introduce new bands in next year's budget, First Minister John Swinney has vowed. However, the SNP leader did not disclose if the pay thresholds will remain the same. In the 2025 Budget, Chancellor Rachel Reeves announced £26bn worth of tax rises - including extending the freeze on tax thresholds which could see earners dragged into higher bands if they get a pay rise. At First Minister's Questions on Thursday, Scottish Tory leader Russell Findlay accused the UK chancellor of \"screwing taxpayers\". He added: \"She's also borrowing even more money, leaving more debt to future generations. And she did all of this, all of this, despite saying that she would do none of it. \"Does John Swinney intend to keep the SNP manifesto promise not to raise tax on Scottish workers?\" In Scotland, Holyrood ministers have used devolved powers to set up an income tax system with seven bands compared to the UK's four. \n                  First Minister John Swinney 'open' to national inquiry into grooming gangs in Scotland\n                 \n                  Bonds announcement a 'proud day for Scotland', says Swinney\n                 \n                  Scottish government yet to pay up after losing legal battle over definition of a woman\n                 Earlier in the day, Finance Secretary Shona Robison said the tax strategy in January's budget would remain the same ahead of next year's Holyrood election. Citing this, Mr Swinney said: \"Obviously, the government is giving consideration to the implications of the United Kingdom budget for the Scottish budget. \"But the finance secretary confirmed this morning that the Scottish government will not increase income tax rates or introduce any new bands.\"  Read more:Budget 2025: The key points at a glanceBudget calculator: See how your finances have changed The UK government's scrapping of the two-child benefit cap has freed up about £155m in Scottish government funding that was going to be used to mitigate the cap north of the border. Mr Findlay, MSP for West Scotland, urged Mr Swinney to now use that cash to lower income tax bills. He said: \"We believe that Scottish taxpayers deserve to keep more of their own hard-earned money. They deserve fairness and they deserve a break from higher bills.\" The first minister previously said the money would be invested in other initiatives to help reduce child poverty \"even further\". Mr Swinney said he was \"glad\" the Scottish government \"shamed the Labour Party into acting on this particular issue\". He added: \"So, when Mr Findlay attacks me for asking people on higher earnings to pay more in tax, I'm prepared to do that so that I can work to eradicate child poverty, which is the best thing for the future of our country.\""
    },
    {
        "title": "Horror in Hong Kong: Residents reel from its worst disaster in modern history",
        "description": "There is a thickness to the air outside Wang Fuk Court in Hong Kong's Tai Po district.",
        "url": "https://news.sky.com/story/horror-in-hong-kong-residents-reel-from-its-worst-disaster-in-modern-history-13476256",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hong-kong-wang-fuk_7093891.jpg?20251127195207",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-11-27 18:08:00",
        "Headline": "More than 30 hours after the blaze began at Wang Fuk Court, there was still a sense that it is far from under control. At various points during the day the flames sprung up from different windows, as if the fire has found fresh tinder.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n There is a thickness to the air outside Wang Fuk Court in Hong Kong's Tai Po district. The smoke catches in your throat and the emotion catches you off guard. Seven of the eight tower blocks that make up this complex have been all but blackened. And through the shells that used to be windows, you can only imagine the horror and the panic that must have played out inside, the screams that went unanswered. More than 30 hours after the blaze began here there was still a sense that it is far from under control. At various points during the day the flames sprung up from different windows, as if the fire has found fresh tinder. Debris falls from the buildings periodically, ash still floats in the air. As of Friday morning here, 94 people are now confirmed to have died. There is no doubt the community is reeling. Along the surrounding streets hundreds came out to look on in horror, mostly in a stunned sort of silence. Occasionally the air was pierced with the terrible cries of relatives, who had received the news they were dreading. But much of the grief was quiet and held close, an arm around the shoulders or a quiet embrace.  Among the survivors is the Lam family, three generations of which had been living in the building for 40 years. They have lost their home and haven't heard from their neighbours. \"The alarm was all off because of the renovation of the outside. So there is no alarm to let all the people know. Many old people, elderly people, they were all having an afternoon sleep. So nobody knew,\" Ms Lam, whose father survived the fire, said. \"Once they know the fire has already burned down everything, and they cannot escape, they were all trapped in the house. This is a disaster, actually.\" Another survivor said: \"I feel sadness and hopeless and don't know what [I'm] going to do. I don't know. Cannot describe. So sad.\" Hong Kong is one of the world's most densely populated cities, fire in places like this has a significantly more deadly potential. And it also means many are displaced. Over 4,500 lived in this complex alone and are in need of emergency shelter. The government has offered temporary accommodation to many, but the community is filling the gaps. Armies of volunteers handed out food, water, blankets and clothes, including to those who had opted to sleep on the floor of a nearby shopping area. One man, who wanted to sleep on the floor close to his home, said he doesn't feel supported by the government. There is a thin line between grief and anger, and there's a feeling it's narrowing here. Many fingers have pointed towards the construction company running extensive renovations in the complex. A netted mesh, bamboo scaffolding and polystyrene that may have been used as part of the works have all been cited as potentially speeding the spread. Three construction bosses have already been arrested. But there is a sense that distrust of the authorities more broadly runs deep. \"It is very serious and people are starting to feel furious about the construction company and the construction materials,\" one woman said. \"There are so many layers of anger among the people. People feel that every party should take responsibility.\" Read more:At least 83 dead as police make arrests over fireAlmost 280 people missing as blaze engulfs flats Everyone we spoke to wanted to wear a mask to avoid being targeted, with volunteers actively encouraging the masks, and many hinted that the system shoulders its share of responsibility for what happened. This fire is already the worst disaster in the modern history of Hong Kong; many of the victims are elderly and many will struggle to rebuild. There will many days of pain to come, but many days of questions too."
    },
    {
        "title": "At least 83 dead and hundreds missing as police make arrests over Hong Kong fire",
        "description": "At least 83 people have been killed, and police have made several arrests, after a huge fire engulfed a high-rise residential complex in Hong Kong.",
        "url": "https://news.sky.com/story/at-least-65-dead-and-hundreds-missing-as-police-make-arrests-over-hong-kong-fire-13475954",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wang-fuk-court-tai-po_7093180.jpg?20251127070128",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 03:56:00",
        "Headline": "Police arrest three people - two directors and an engineering consultant - of a construction company on suspicion of manslaughter.",
        "Content": " At least 83 people have been killed, and police have made several arrests, after a huge fire engulfed a high-rise residential complex in Hong Kong. Authorities said nearly 300 people are also missing following the blaze at Wang Fuk Court in Tai Po - a suburban district with around 300,000 residents, near the border with mainland China. At least 83 people died in the fire, according to South China Morning Post, citing the local fire department, and a further 70 people have been injured, including more than 40 who were described as critically ill in hospital on Wednesday night.  Around 900 people are also in shelters as a result of the blaze. Police have alleged its cause could have been a \"grossly negligent\" construction firm using unsafe materials. Three people - two directors and an engineering consultant - have been arrested on suspicion of manslaughter. \"We have reason to believe that the company's responsible parties were grossly negligent, which led to this accident and caused the fire to spread uncontrollably, resulting in major casualties,\" said police superintendent Eileen Chung. Police have not named the company. The complex, built in the 1980s, had been under renovation for a year.   One firefighter was among those killed tackling the blaze, which broke out at 2.51pm local time on Wednesday. Another 11 firefighters were among those injured. Fire crews said they had doused the flames in all seven of the affected blocks by Thursday morning, and were searching each floor for survivors. Records show the Wang Fuk Court site consists of eight blocks, with almost 2,000 flats housing around 4,800 residents, including many elderly people. Families have been identifying the bodies of relatives while others have been visiting shelters in the area, searching for missing loved ones. Hong Kong leader John Lee said on Thursday the government will set up a HK$300m (£29m) fund to help residents. The cause of the fire is being investigated, but it appears to have started in bamboo scaffolding and construction mesh sheets and then spread across seven of the complex's eight buildings - likely aided by windy conditions. Bamboo scaffolding is commonly used in Hong Kong, but is in the process of being phased out because of safety concerns. Hong Kong's Association for the Rights of Industrial Accident Victims said there have been at least three fires involving bamboo scaffolding this year. Read more from Sky News:Trump condemns 'monstrous' attackWoman killed in shark attackUK criticised over detained couple China's state broadcaster CCTV said President Xi Jinping has urged an \"all-out effort\" to extinguish the fire and minimise casualties and losses. Both the US and British Consulate Generals for Hong Kong have sent condolences to those affected, as has Taiwan's president. The number of dead is the highest in a Hong Kong fire since 1948, when 176 people were killed in a warehouse blaze. The fire has prompted comparisons to the Grenfell Tower blaze which killed 72 people in 2017, blamed on flammable cladding, as well as failings by the government and the construction industry. \"Our hearts go out to all those affected by the horrific fire in Hong Kong,\" the Grenfell United survivors' group said onsocial media. \"To the families, friends and communities, we stand with you. You are not alone.\""
    },
    {
        "title": "Israeli forces kill two Palestinian men in West Bank after they appear to surrender",
        "description": "Israeli forces killed two Palestinian men in the West Bank after they appeared to be surrendering.",
        "url": "https://news.sky.com/story/israeli-forces-kill-two-palestinian-men-in-west-bank-after-they-appear-to-surrender-13476319",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-west-bank-shooting_7094124.jpg?20251128011820",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 21:09:00",
        "Headline": "Palestinians said the killings, which were captured on video and shown on two Arab TV channels, were carried out \"in cold blood\".",
        "Content": " Israeli forces killed two Palestinian men in the West Bank after they appeared to be surrendering. Palestinians said the killings, which were captured on video and shown on two Arab TV channels, were carried out \"in cold blood\". In the video, the men were seen exiting a building and lying on the ground in front of Israeli forces in the northern West Bank city of Jenin. Both men lifted their T-shirts and held their hands in the air, apparently to show they were not carrying weapons or explosives. The soldiers then appeared to order the men back inside the building before they were shot. A Reuters journalist in the area saw the men leave the building, appearing to surrender, and later, after hearing shots fired, saw Israeli forces standing near what appeared to be a lifeless body. The men were identified as al Muntasir Abdullah, 26, and Yousef Asasa, 37, by Palestinian authorities. What has Israel said about the incident? A joint statement between the Israeli Defence Forces and Israeli police said: \"Earlier this evening (Thursday), during an Israel Border Police and IDF operation in the area of Jenin, the forces operated to apprehend wanted individuals who had carried out terror activities, including hurling explosives and firing at security forces. \"The wanted individuals were affiliated with a terror network in the area of Jenin. \"The forces entered the area, enclosed the structure in which the suspects were located, and initiated a surrender procedure that lasted several hours. Following the use of engineering tools on the structure, the two suspects exited. \"Following their exit, fire was directed toward the suspects. \"The incident is under review by the commanders on the ground, and will be transferred to the relevant professional bodies.\" Israel's far-right national security minister Itamar Ben-Gvir said the military and police unit involved in the shooting had his \"full backing\". \"The fighters acted exactly as expected of them - terrorists should die!\" he wrote on X. 'An outright extrajudicial killing' But Palestinians and human rights groups say Israeli investigations in such incidents yield few results, with Israeli troops rarely prosecuted. The Palestinian prime minister's office in Ramallah also accused Israel of executing the men \"in cold blood\", calling the shooting \"an outright extrajudicial killing in blatant violation of international humanitarian law\". Yuli Novak, the executive director of B'Tselem, an Israeli human rights organisation, said: \"The execution documented today is the result of an accelerated process of dehumanisation of Palestinians and the complete abandonment of their lives by the Israeli regime. \"In Israel, there is no mechanism that acts to stop the killing of Palestinians or is capable of prosecuting those responsible.\" Read more from Sky News:Hong Kongers reel from fire disasterNational Guard trooper shot in DC dies Israel's military has scaled up its military operations in the West Bank since the October 7 Hamas attack, which triggered the war in Gaza. Since October 2023, Israeli forces and settlers have killed more than 1,000 Palestinians in the West Bank, according to B'Tselem, which said the perpetrators were \"granted full impunity by Israel\"."
    },
    {
        "title": "France reveals new national military service amid fears of Russian threat",
        "description": "If you're still under any illusions about how seriously Ukraine's allies view the wider threat from Russia, the wave of countries bringing back military service should help clarify that.",
        "url": "https://news.sky.com/story/france-reveals-new-national-military-service-amid-fears-of-russian-threat-13476148",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-france-emmanuel-macron_7093643.jpg?20251127143653",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-11-27 14:18:00",
        "Headline": "As more countries look to strengthen their defences, Moscow has accused European leaders of warmongering and consistently denied any threat to wider Europe.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n  If you're still under any illusions about how seriously Ukraine's allies view the wider threat from Russia, the wave of countries bringing back military service should help clarify that. France is the latest, today announcing a new national service for over 18s. Ahead of the plan being unveiled, President Emmanuel Macron said: \"If the French want to protect ourselves, we must show that we are not weak in the face of one power that threatens us the most.\" That threat primarily comes from Russia, a country that numerous military chiefs have warned may be ready to attack a NATO member by 2030. In essence, with today's announcement, Mr Macron is trying to prepare a force to help protect France if attacked. The young recruits would help bolster the military, which is already the second largest in the EU after Poland. As more countries look to strengthen their defences, Moscow has accused European leaders of warmongering and consistently denied any threat to wider Europe. \n                  Vaccine reminder as mpox strain spreads in Europe\n                 \n                  The countries where digital ID already exists\n                 \n                  Man Utd and chemicals boss warns of 'moment of reckoning' for his industry\n                 However, its seeming unwillingness to stop the bloodshed in Ukraine, the recent drone and jet incursions into NATO airspace, and the intensifying hybrid war it's accused of carrying out across Europe mean few of Ukraine's allies still trust the Kremlin's word. Read more:Does Germany need to be ready for war? Uncertainly about whether the US could be relied upon in a fight has fuelled the unease. That hasn't been helped by the fact the first 28-point peace plan presented by the US appeared to come straight out Moscow's playbook. In these uncertain times, France isn't alone in looking to bolster its defences. Ten EU countries already have compulsory military service, while nations including Belgium, the Netherlands and Germany are opting for voluntary schemes. After years of neglecting its military, Germany is massively boosting defence spending, with the chancellor pledging to build the strongest conventional army in Europe. The German parliament is expected to vote on the military service plan in December. As one German general told me: \"We are not at war, but we are no longer living in peacetime... \"We do not want war, but we must be ready to defend our country.\""
    },
    {
        "title": "Washington DC shooting suspect is Afghan national who worked with a CIA-backed unit",
        "description": "A man suspected of opening fire on two members of the National Guard a few streets from the White House is an Afghan national who worked with a CIA-backed unit in Afghanistan, according to officials.",
        "url": "https://news.sky.com/story/dc-shooting-suspect-is-afghan-national-who-worked-with-a-cia-backed-unit-13476167",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-white-house-washington-dc_7092933.png?20251126205926",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 15:08:00",
        "Headline": "Investigators are searching for a motive behind the 'ambush' attack , as two members of the National Guard shot by the suspect remain in critical condition.",
        "Content": "A man suspected of opening fire on two members of the National Guard a few streets from the White House is an Afghan national who worked with a CIA-backed unit in Afghanistan, according to officials. He worked with \"the US government, including the CIA, as a member of a partner force in Kandahar\" during the US's war with the Taliban, CIA director John Ratcliffe has said. The suspect, who has been pictured for the first time, was wounded in an exchange of gunfire before he was arrested. He was identified by the Department of Homeland Security as Rahmanullah Lakanwal, 29. Attorney general Pam Bondi said the US government plans to bring terrorism charges against the gunman and seek a sentence of life in prison \"at a minimum\". \"A lone gunman opened fire without provocation, ambush style, armed with a .357 Smith & Wesson revolver,\" she told reporters. US attorney for Washington DC Jeanine Pirro identified the two wounded Guard members as Sarah Beckstrom, 20, and Andrew Wolfe, 24. \n                  Horror in Hong Kong: Residents reel from its worst disaster in modern history\n                 \n                  At least 83 dead and hundreds missing as police make arrests over Hong Kong fire\n                 \n                  Israeli forces kill two Palestinian men in West Bank after they appear to surrender\n                 Ms Pirro said the suspect ambushed them while they were patrolling near the White House. He is alleged to have shot one guardsman who fell and then shot again before firing multiple times at the second guardsman with the Magnum handgun.  Numerous electronic devices seized from suspect's home  The suspect \"drove his vehicle cross-country from the state of Washington with the intended target of coming to our nation's capital,\" Ms Pirro said. The FBI searched multiple properties in Washington state and San Diego on Thursday in what officials said was a terrorism probe into the DC shooting. Investigators seized numerous electronic devices from the suspect's house in Washington state, including cellphones, laptops and iPads, FBI director Kash Patel told a news conference. According to the Department of Homeland Security, Lakanwal entered the US in 2021 under Operation Allies Welcome, a Biden-era programme to resettle Afghans who assisted the US during the war and feared reprisals from the Taliban after the withdrawal. An unnamed relative of the suspect has said that Lakanwal served in the Afghan army for 10 years alongside US special forces troops and was stationed in Kandahar for part of that time. 👉 Follow Trump100 on your podcast app 👈 The relative also said Lakanwal was working for online retail giant Amazon the last time they spoke several months ago, according to Sky's US partner NBC News. A Trump administration official who spoke on condition of anonymity said that Lakanwal applied for asylum in December 2024 and was approved on 23 April of this year. Lakanwal had no known criminal history, the official said. US President Donald Trump, who was at his resort in Florida at the time of the attack, released a prerecorded video statement late on Wednesday calling the shooting \"an act of evil, an act of hatred and an act of terror\".  He said his administration would \"re-examine\" all Afghans who arrived in the US during the presidency of his predecessor, Joe Biden. The US Citizenship and Immigration Services agency has said it has halted processing of all immigration requests relating to Afghan nationals indefinitely, \"pending further review of security and vetting protocols\". In the wake of Wednesday's shooting, defence secretary Pete Hegseth said the president requested an additional 500 National Guard troops to bolster the more than 2,000 already deployed in the nation's capital. In August, Trump ordered the National Guard to the city to combat rising crime, a move that drew objections from District of Columbia officials who argued in court that it violated local authority."
    },
    {
        "title": "Putin strikes conciliatory tone - then hardens it: Kremlin signals no breakthrough on US peace plan",
        "description": "This was the first time Vladimir Putin has commented on the latest US peace proposal. Will Russia agree? Is a deal close? It didn't sound like it.",
        "url": "https://news.sky.com/story/putin-strikes-conciliatory-tone-then-hardens-it-kremlin-signals-no-breakthrough-on-us-peace-plan-13476259",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-vladimir-putin-kyrgyzstan_7093264.jpg?20251127084250",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-27 18:28:00",
        "Headline": "In his first comments on Washington's latest proposal, the Russian leader praised the plan's \"basis for future agreements\", but doubled down on core territorial demands and issued fresh warnings to Kyiv — a sign that Moscow remains far from accepting a deal.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  This was the first time Vladimir Putin has commented on the latest US peace proposal. Will Russia agree? Is a deal close? It didn't sound like it. There was plenty of conciliatory language at the start of his press conference which was designed to show a willingness to reach an agreement. Donald Trump's plan can provide \"the basis for future agreements\", he said. Russia is ready for \"serious\" discussions. He even expressed a willingness to discuss European security. But \"discuss\" doesn't mean \"agree\", and it certainly doesn't mean \"compromise\". And as the questions grew more specific, and the focus turned to the various sticking points in a peace deal, the Kremlin leader's language hardened, revealing a familiar theme. On the most contentious point of territory, he described recognition of Russian sovereignty over Crimea and the Donbas as a \"key point\" to the negotiations with the US.  That recognition, remember, was one of the proposals that made the initial 28-point peace plan so unpalatable for Ukraine. \n                  Horror in Hong Kong: Residents reel from its worst disaster in modern history\n                 \n                  At least 83 dead and hundreds missing as police make arrests over Hong Kong fire\n                 \n                  Israeli forces kill two Palestinian men in West Bank after they appear to surrender\n                 They've managed to get it removed from the latest draft, but it's clear that Putin wants it back in. On this issue, there's clearly still no middle ground. And he also had a warning for Kyiv and its European allies regarding their demands for a ceasefire, saying: \"Ukrainian troops must withdraw from the territories they hold, and then the fighting will cease. If they don't leave, then we shall achieve this by armed means.\" Read more from Sky News:Washington DC shooting suspect worked with a CIA-backed unitFrance reveals new national military service It doesn't sound like the language of someone who wants peace. It sounds like someone who won't stop until they have what they want. Someone whose core demands remain undiluted. Whether it's on the battlefield or at the negotiating table, Russia is still pursuing a victory. Putin also reiterated a long-standing gripe over the legitimacy of Volodymyr Zelenskyy's presidency, claiming it means a legally-binding deal with Ukraine is impossible as things stand. It sounded suspiciously like Moscow's latest play for time. It's not Russia's fault there's no peace plan - it's the legal small print. So when US envoy Steve Witkoff visits Moscow next week for talks in the Kremlin, it seems very unlikely he'll leave with an unconditional agreement to America's latest peace plan."
    },
    {
        "title": "France's Emmanuel Macron unveils new military service to combat Russia threat",
        "description": "French President Emmanuel Macron has unveiled a new military service plan to boost its armed forces in response to the threat posed by Russia.",
        "url": "https://news.sky.com/story/frances-emmanuel-macron-unveils-new-military-service-to-combat-russia-threat-13476106",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-france-emmanuel-macron_7093533.jpg?20251127125717",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 12:42:00",
        "Headline": "Volunteers aged 18 and 19 will begin serving next year in a 10-month military programme, a move motivated by Russia's full-scale invasion of Ukraine.",
        "Content": "French President Emmanuel Macron has unveiled a new military service plan to boost its armed forces in response to the threat posed by Russia. In an announcement, Mr Macron said volunteers aged 18 and 19 will start serving next year in a 10-month military service programme. He told French media: \"There is a generation ready to rise up for the fatherland. We cannot go back to the time of conscription, but we need mobilisation. \"Our young people will have to participate in at least one commemorative ceremony per year in each school. \"We will encourage students to complete their second-year internships in our armed forces.\" He added that young volunteers will serve in France's mainland and overseas territories only, not in the nation's military operations abroad. It follows his announcement earlier this year of his intention to provide French youth with a new option to serve voluntarily. France had ended conscription in 1996 and is not considering reintroducing it. Mr Macron said the move was driven by the threat posed by Russia following its full-scale invasion of Ukraine in 2022, which he warned put the European continent at \"great risk\". 'Russia will continue to advance' Speaking at the Varces military base in the French alps, Mr Macron said: \"A new national service is set to be gradually established, starting from next summer.\" He also told radio outlet RTL: \"The day that you send a signal of weakness to Russia, which for 10 years has made a strategic choice to become an imperial power again, that's to say advance wherever we are weak, well, it will continue to advance.\" Mr Macron also announced an investment of €6.5bn (£5.7bn) in extra military spending in the next two years. Read more:Louvre closes gallery as structure in a 'dire state' after jewel heistEx-French president Nicolas Sarkozy released from prison This comes as part of a €64bn (£56bn) spend in annual defence in 2027, the last year of his second term, he added. This would be double the €32bn (£28million) in annual spending when he became president in 2017. France currently has around 200,000 active military personnel and more than 40,000 reservists, making it the second largest military in the European Union, behind Poland. It wants to increase the number of reservists to 100,000 by 2030."
    },
    {
        "title": "Pope Leo arrives in Turkey for his first foreign visit with a message of peace",
        "description": "Pope Leo has arrived in Turkey on his first foreign visit since his inauguration in May.",
        "url": "https://news.sky.com/story/pope-leo-arrives-in-turkey-for-his-first-foreign-visit-with-a-message-of-peace-13476061",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-leo-pope-tayyip-erdogan_7093414.jpg?20251127113408",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 11:11:00",
        "Headline": "Pope Leo lands in the capital Ankara to begin a three-day visit before heading to Lebanon on Sunday. His visit comes at a crucial time in efforts to end the war in Ukraine and ease Middle East tensions.",
        "Content": " Pope Leo has arrived in Turkey on his first foreign visit since his inauguration in May. The pontiff wants to use the trip to push for world peace. His visit comes at a crucial time in efforts to end the war in Ukraine and ease Middle East tensions. Ankara has hosted rounds of low-level talks between Russia and Ukraine and has offered to take part in the stabilisation force in Gaza to help uphold the fragile ceasefire. Leo landed in the capital city on Thursday afternoon ahead of a meeting with president Recep Tayyip Erdogan, as he began a three-day itinerary in Turkey before a visit to Lebanon on Sunday. Leo, the first American pope, chose Turkey as his first overseas destination to mark the 1,700th anniversary of a landmark early Church council there that produced the Nicene Creed, which lays out what remain the core beliefs of most Christians today. Speaking to journalists aboard the flight from Rome, Leo said: \"We hope to... announce, transmit, proclaim how important peace is throughout the world. And to invite all people to come together, to search for greater unity, greater harmony.\" The Pope was welcomed on the tarmac of Ankara's Esenboga Airport by a military guard of honour and was greeted by a delegation led by the nation's culture and tourism minister. Read more from Sky News:At least 55 dead as police make arrests over Hong Kong fireTrump condemns 'monstrous' attack near White House The Pope went on to visit Anitkabir, the mausoleum of modern Turkey's founder Mustafa Kemal Ataturk. Leo's Mercedes limousine then received a horse-mounted escort to the presidential palace, where he was greeted by Mr Erdogan, officials and senior church members. The pontiff praised Turkey's historic role as a bridge between east and west and the crossroads of religions and cultures. \"May Turkey be a source of stability and rapprochement between peoples, in services of a just and lasting peace,\" he said. \"Today, more than ever, we need people who will promote dialogue and practice it with firm will and patient resolve.\" Leo, 70, was elected in May by the world's Catholic cardinals to succeed the late Pope Francis. Francis had been planning to visit Turkey and Lebanon but was unable to go because of his worsening health.  In a departure from normal practice, Leo is expected to speak English in his speeches in Turkey, a country of more than 85 million predominantly Sunni Muslims. Peace is also expected to be a key theme of Leo's visit to Lebanon. The country, which has the highest percentage of Christians in the Middle East, has been rocked by the spillover of the Gaza conflict. Significantly, Leo will not visit Lebanon's south, battered by last year's war between Israel and the Lebanese militant group Hezbollah and the site of intensified Israeli strikes in recent weeks.  Foreign travel has become a major part of the modern papacy. Popes can attract huge international attention as they head events with crowds sometimes in the millions, give foreign policy speeches and conduct international diplomacy. Leo was a relative unknown on the world stage before his election. He spent decades as a missionary in Peru and only became a Vatican official in 2023."
    },
    {
        "title": "Woman killed and man injured in shark attack in New South Wales, Australia",
        "description": "A woman has been killed by a shark and a man seriously injured at a popular beach in Australia.",
        "url": "https://news.sky.com/story/woman-killed-and-man-injured-in-shark-attack-in-new-south-wales-australia-13475996",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-crowdy-bay-australia_7093211.jpg?20251127075800",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 07:44:00",
        "Headline": "The pair had entered the water at Kylies Beach, a popular surfing spot, for an early morning swim.",
        "Content": "A woman has been killed by a shark and a man seriously injured at a popular beach in Australia. Emergency services were alerted to the attack at Crowdy Bay National Park, near Port Macquarie, around 218 miles north of Sydney, at 6.30am local time on Thursday. They were responding to reports two people had been bitten by a shark. The pair had entered the water at Kylies Beach, a popular surfing spot, for an early morning swim. The woman, who is believed to be in her 20s, died at the scene. She has not yet been identified. The man, also understood to be in his 20s, was airlifted to hospital in a critical condition. He is now said to be in a serious but stable condition, with police believing a bystander's first aid may have prevented a double fatality. Police Chief Inspector Timothy Bayly said: \"I just really need to have a shoutout to the bystander on the beach who put a makeshift tourniquet on the male's leg which obviously potentially saved his life and allowed New South Wales Ambulance paramedics to get to him and render first aid.\" The officer did not give any further details of the injuries or circumstances of the attack. He said: \"At this stage, all I'm prepared to say is they were known to each other and they were going for a swim and the shark attacked.\" Read more:Man killed in shark attack in Australia after screams heardGirl , 17, killed by shark while swimming in Queensland Experts said it is rare for a shark to attack more than one person. Gavin Naylor, director of the University of Florida's shark research programme, said: \"It is very unusual. Individual shark attacks are rare. And shark attacks on two people by the same individual is not unheard of, but it's very rare.\" He added: \"Sometimes younger sharks are less judicious and they can make mistakes. Where sharks are close to seal colonies and feeding, the probability (of attack) is higher. \"The few bites that we do have where a single shark has bitten multiple people, it's usually tiger sharks. We've never seen white sharks do that unless somebody's heroically jumping in the way.\" The beach - known for camping, fishing spots and hiking tracks - has been closed to the public as authorities work to determine the species of shark involved. "
    },
    {
        "title": "Lindsay and Craig Foreman: Son of British couple detained in Iran says government not doing enough",
        "description": "The son of a British couple detained in Iran has said the UK government is not doing enough to secure their release.",
        "url": "https://news.sky.com/story/lindsay-and-craig-foreman-son-of-british-couple-detained-in-iran-says-government-not-doing-enough-13475952",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-craig-foreman-lindsay-foreman_7017162.jpg?20251014130454",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-27 01:09:00",
        "Headline": "The couple, from East Sussex, were taken into custody in the Iranian city of Kerman in January, and are being held at Evin prison in Tehran.",
        "Content": "The son of a British couple detained in Iran has said the UK government is not doing enough to secure their release. Lindsay and Craig Foreman, from East Sussex, were taken into custody in Kerman in January during a motorcycle tour around the world and later charged with espionage, which they deny. In August, the pair were moved to different jails in Tehran, before being reunited in October at Evin prison, where British-Iranian national Nazanin Zaghari-Ratcliffe was held between 2016 and 2022. 'You need to stand up for your citizens' Lindsay's son, Joe Bennett, told Sky News there are too many similarities with Mrs Zaghari-Ratcliffe's situation. \"They themselves are being very passive,\" he said of the UK government. \"They've got two UK citizens that are accused of spying for the British state, but they're not coming out and defending them and calling [it out] for what it is. \"You need to stand up for your citizens and call it out.\" Speaking to The World With Dominic Waghorn, Mr Bennett dismissed Iran's accusation of espionage against his mother and her partner - and accused the regime of \"hostage taking\". 'They're not spies' Asked whether he had any sympathy with the argument that making too much of the situation makes their release less likely, Mr Bennett said there was \"no justification\" for the Foreign Office taking such an approach. \"If they're on charges of shoplifting, potentially that's understandable, let's see the court of law, let's go through it if they've been caught of some wrongdoing,\" he said. \"They haven't, and they've been accused of espionage, which is state-level political charges, right? \"They're not spies, it's quite simple.\" Read more from Sky News:Court hearing 'did not go well' for British coupleIran protests 'bring back memories' of helplessness Mrs Zaghari-Ratcliffe's husband Richard is supporting Mr Bennett's case. He told Sky News: \"It does feel to me that I'm hearing too many echoes of our experience in the experience of Joe's family and others.\" The Foreign Office warns all British and British-Iranian nationals against all travel to Iran because of \"significant risk of arrest, questioning, or detention\". In October, a spokesperson told Sky News the department was deeply concerned by reports that the Foremans had been charged with espionage and that it was providing them with consular support."
    },
    {
        "title": "National Guard member Sarah Beckstrom has died after Washington DC shooting, Trump says",
        "description": "One of the National Guard members shot in Washington DC on Wednesday has died from her injuries, Donald Trump has said.",
        "url": "https://news.sky.com/story/trump-says-one-of-national-guard-members-shot-in-washington-dc-has-died-13476348",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-national-guard-sarah-beckstrom-i_7093666.jpg?20251127145833",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-27 23:35:00",
        "Headline": "The suspect, Rahmanullah Lakanwal, is said to have driven from the other side of the country to carry out the attack - which authorities are treating as terrorism.",
        "Content": " One of the National Guard members shot in Washington DC on Wednesday has died from her injuries, Donald Trump has said. The US president called 20-year-old Sarah Beckstrom, part of the West Virginia guard, a \"highly respected\" and \"magnificent person\". The other person who was shot, Andrew Wolfe, 24, remains in a critical condition. Mr Trump said he is \"fighting for his life\". The pair were ambushed while patrolling near the White House. Ms Beckstrom's father had earlier told The New York Times she was unlikely to survive, and he was \"holding her hand\". The suspected gunman, Afghan national Rahmanullah Lakanwal, 29, is in a serious condition, Mr Trump told reporters. Mr Trump described him as a \"savage monster\". He drove thousands of miles from his home in Washington state to carry out the attack with a powerful Magnum revolver, according to US attorney Jeanine Pirro. Lakanwal was injured in an exchange of fire and is now under guard in hospital. He's said to have worked in a CIA-backed Afghan army unit before coming to the US in 2021 under a resettlement scheme to protect people from Taliban reprisals. Lakanwal's asylum application was passed this year.  Investigators are treating the attack as terrorism and searched multiple properties on Thursday, including one linked to Lankanwal in Washington state, where the FBI seized electronic devices and interviewed relatives. Lakanwal has a wife and five children, but police said he appeared to have acted alone. Ms Beckstrom had been deployed since August as part of the president's plan to clamp down on what he says are high levels of crime and illegal immigration in some US cities. Mr Trump ordered 500 extra troops into the capital after the shooting, joining about 2,200 already there. A review of all asylum cases approved under Joe Biden's tenure has been launched as Mr Trump's administration seeks to blame his predecessor's policies. Green cards issued to citizens of 19 countries will also be reviewed and immigration requests from Afghans have been suspended. Read more from Sky News:Hong Kong reels from worst disaster in modern historyIsraeli forces kill two men after they appear to surrender 👉 Tap here to follow Trump100 wherever you get your podcasts👈  \"This individual - and so many others - should have never been allowed to come here,\" said CIA director John Ratcliffe in a statement. He said Lakanwal had entered America in September 2021 \"due to his prior work with the US government\". A Trump official, speaking anonymously to Reuters, said the suspected gunman had no known criminal history, while authorities have not yet given a motive."
    },
    {
        "title": "Washington DC shooting suspect is Afghan national who worked with a CIA-backed unit",
        "description": "A man suspected of opening fire on two members of the National Guard a few streets from the White House is an Afghan national who worked with a CIA-backed unit in Afghanistan, according to officials.",
        "url": "https://news.sky.com/story/dc-shooting-suspect-is-afghan-national-who-worked-with-a-cia-backed-unit-13476167",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-white-house-washington-dc_7092933.png?20251126205926",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-27 15:08:00",
        "Headline": "Investigators are searching for a motive behind the 'ambush' attack , as two members of the National Guard shot by the suspect remain in critical condition.",
        "Content": "A man suspected of opening fire on two members of the National Guard a few streets from the White House is an Afghan national who worked with a CIA-backed unit in Afghanistan, according to officials. He worked with \"the US government, including the CIA, as a member of a partner force in Kandahar\" during the US's war with the Taliban, CIA director John Ratcliffe has said. The suspect, who has been pictured for the first time, was wounded in an exchange of gunfire before he was arrested. He was identified by the Department of Homeland Security as Rahmanullah Lakanwal, 29. Attorney general Pam Bondi said the US government plans to bring terrorism charges against the gunman and seek a sentence of life in prison \"at a minimum\". \"A lone gunman opened fire without provocation, ambush style, armed with a .357 Smith & Wesson revolver,\" she told reporters. US attorney for Washington DC Jeanine Pirro identified the two wounded Guard members as Sarah Beckstrom, 20, and Andrew Wolfe, 24. \n                  Horror in Hong Kong: Residents reel from its worst disaster in modern history\n                 \n                  At least 83 dead and hundreds missing as police make arrests over Hong Kong fire\n                 \n                  Israeli forces kill two Palestinian men in West Bank after they appear to surrender\n                 Ms Pirro said the suspect ambushed them while they were patrolling near the White House. He is alleged to have shot one guardsman who fell and then shot again before firing multiple times at the second guardsman with the Magnum handgun.  Numerous electronic devices seized from suspect's home  The suspect \"drove his vehicle cross-country from the state of Washington with the intended target of coming to our nation's capital,\" Ms Pirro said. The FBI searched multiple properties in Washington state and San Diego on Thursday in what officials said was a terrorism probe into the DC shooting. Investigators seized numerous electronic devices from the suspect's house in Washington state, including cellphones, laptops and iPads, FBI director Kash Patel told a news conference. According to the Department of Homeland Security, Lakanwal entered the US in 2021 under Operation Allies Welcome, a Biden-era programme to resettle Afghans who assisted the US during the war and feared reprisals from the Taliban after the withdrawal. An unnamed relative of the suspect has said that Lakanwal served in the Afghan army for 10 years alongside US special forces troops and was stationed in Kandahar for part of that time. 👉 Follow Trump100 on your podcast app 👈 The relative also said Lakanwal was working for online retail giant Amazon the last time they spoke several months ago, according to Sky's US partner NBC News. A Trump administration official who spoke on condition of anonymity said that Lakanwal applied for asylum in December 2024 and was approved on 23 April of this year. Lakanwal had no known criminal history, the official said. US President Donald Trump, who was at his resort in Florida at the time of the attack, released a prerecorded video statement late on Wednesday calling the shooting \"an act of evil, an act of hatred and an act of terror\".  He said his administration would \"re-examine\" all Afghans who arrived in the US during the presidency of his predecessor, Joe Biden. The US Citizenship and Immigration Services agency has said it has halted processing of all immigration requests relating to Afghan nationals indefinitely, \"pending further review of security and vetting protocols\". In the wake of Wednesday's shooting, defence secretary Pete Hegseth said the president requested an additional 500 National Guard troops to bolster the more than 2,000 already deployed in the nation's capital. In August, Trump ordered the National Guard to the city to combat rising crime, a move that drew objections from District of Columbia officials who argued in court that it violated local authority."
    },
    {
        "title": "A shooting on the streets of Washington DC",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈&#160; </a>&#160; ",
        "url": "https://news.sky.com/story/a-shooting-on-the-streets-of-washington-dc-13475970",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump100-100_7029094.jpg?20250923092054",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-27 06:43:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈     The podcast is a day earlier than normal - reacting to the shooting in the nation's capital on Wednesday afternoon. We'll tell you what we know so far. Plus - some good news for the president in the courts. Might Donald Trump's own personal legal woes be finally behind him? And who, and what, is the Venezuelan gang the president this week proscribed as a terrorist organisation? You can also watch all episodes on our YouTube channel. Email us on trump100@sky.uk with your comments and questions."
    },
    {
        "title": "TGI Fridays' UK chain up for sale a month after changing hands",
        "description": "The future of TGI Fridays' British operations has been thrown into fresh doubt just a month after the well-known casual dining chain was bought by the manager of most of the brand&#8217;s global operations.",
        "url": "https://news.sky.com/story/tgi-fridays-uk-chain-up-for-sale-a-month-after-changing-hands-13476108",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tgi-fridays-gv_7094081.jpg?20251127225032",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-27 12:50:00",
        "Headline": "The fate of TGI's 49 British restaurants and 2,000-strong workforce is again uncertain after Interpath was hired to canvas appetite from potential investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The future of TGI Fridays' British operations has been thrown into fresh doubt just a month after the well-known casual dining chain was bought by the manager of most of the brand’s global operations. Sky News has learnt that the financial advisory firm Interpath has been appointed to explore strategic options for TGI Fridays' UK business, which comprises 49 sites and employs almost 2,000 people. Interpath has begun contacting potential investors in the last few days about a potential deal. Money latest: Budget blow to holidays It comes just a few weeks after TGI Fridays in the UK was acquired by Sugarloaf TGIF Management, a company run by the chain's former chief executive, Ray Blanchette. The reason for the rapid decision to market the business was unclear on Thursday, although the commencement of an investment process at the start of the festive trading period will raise questions among prospective bidders. In a statement issued to Sky News, Phil Broad, president, TGI Fridays International Franchising, said: \"The directors of TGI Fridays UK can confirm they are working closely with independent advisors to explore all available options for securing the long-term future of TGI Fridays in the UK. \n                  Politics latest: Government U-turns on key part of employment reforms\n                 \n                  Holidays blow with budget announcement most of us missed | Money blog\n                 \n                  Budget 2025 is a big risk for Labour's election plans\n                 \"Since assuming control last month, our priority has been to protect jobs, support our employees, and continue to deliver the welcoming, celebratory experience guests expect from TGI Fridays. \"These discussions are progressing constructively, and we will provide further updates when appropriate.\" TGI's British chain, was previously sold just over a year ago to Calveton UK and Breal Capital, two investment firms which are said to have stabilised the business's performance. While the hospitality sector was not hit as hard by this week's Budget as it had been in Rachel Reeves's inaugural fiscal statement in autumn 2024, it did not provide as much financial relief as the industry had been calling for."
    },
    {
        "title": "Budget 2025 is a big risk for Labour's election plans",
        "description": "Day two after a budget is always an important moment.",
        "url": "https://news.sky.com/story/budget-20205-is-a-big-risk-for-labours-election-plans-13476160",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-conway-rachel-reeves_7091118.jpg?20251125001626",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-11-27 14:45:00",
        "Headline": "While this was a budget to satisfy financial markets and Labour MPs, Sky's Ed Conway says the chancellor has gambled on the economy outperforming ahead of the next general election.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Day two after a budget is always an important moment. This is when the nerds and boffins of Britain's fiscal thinktanks assemble to deliver their snap verdict on the chancellor's decisions. The moment is more important than ever when, as was certainly the case this time, the budget is a big one. So what did the Institute for Fiscal Studies (IFS) and the Resolution Foundation make of this year's budget? Well, as you'd probably expect, they both fell short of distilling it into a single soundbite, but in broad terms, they both sounded somewhat positive. Money latest: Budget blow to holidays Yes, there were plenty of big provisos. The head of the IFS, Helen Miller, said Labour have broken their manifesto pledge not to raise National Insurance. \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 The Resolution Foundation argued that if only the chancellor had raised the basic rate of income tax instead of freezing personal allowances, it would have made the tax rise considerably fairer and more progressive.  And that's before one gets into the criticism of some of the other bits and pieces from the red book - the structure of the EV tax, for instance (why doesn't it try to penalise congestion?), or of the mansion tax (why not just overhaul council tax altogether?). But for the most part, these closely-followed institutions seemed pretty supportive of this year's budget - more so, certainly, than they were last year. Primarily, that's because while the last budget left only a very thin bit of headroom against Rachel Reeves's fiscal rules, this one was far more cautious, doubling that fiscal insurance policy to just over £21bn.  Yet that headroom is dependent on a couple of important factors. First, that the government will hold to its promises to keep spending growth constrained towards the end of the decade. Second, that it will be able to raise all the tax revenues it's promising in that year. That, in turn, gets to a deeper issue with the budget. Most of the tough stuff has been put off to the final year of the forecast - namely 2029. That year, the government will face a squeeze at the very same moment that Britons are all asked to pay more in taxes. And, critically, that's the very year Labour is due to face a general election. Does it really plan to fight an election off the back of a contracting economy? Consider, too, that for all the government's promises to get living standards growing this parliament, they are currently only forecast to rise at the slowest rate since the 1950s - save for the pandemic and energy price shock period. The economic backdrop, in other words, is hardly rosy. Still, for the time being, the chancellor has managed to put together a budget that has bolstered her position both in her party and in her job. Markets remain relatively sanguine - much more so than after Rachel Reeves's first budget last year - with bond yields lower today than before the event (albeit a little higher than yesterday). Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals £26bn of tax risesCash ISA limit slashed - but some are exempt However, this was a complex budget. And, as with all bits of complex engineering, there remains a distinct possibility of large chunks of the budget failing to work. But since so much of it isn't due to kick in for a few years, it may take quite a while before we find out which bits work and which, if any, don't."
    },
    {
        "title": "'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says",
        "description": "Sticking to Labour's manifesto pledge and freezing income tax thresholds rather than raising income tax has hurt low- and middle-income earners, an influential thinktank has said. ",
        "url": "https://news.sky.com/story/sticking-to-labour-manifesto-pledge-costs-millions-of-workers-resolution-foundation-says-13475963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-money-generic_7093188.jpg?20251127071705",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-27 05:50:00",
        "Headline": "There will be more \"bracing budgets\" to come as economic growth is a \"hurdle that remains to be cleared\", says the influential thinktank.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Sticking to Labour's manifesto pledge and freezing income tax thresholds rather than raising income tax has hurt low- and middle-income earners, an influential thinktank has said.  Millions of these workers \"would have been better off with their tax rates rising than their thresholds being frozen\", according to the Resolution Foundation's chief executive, Ruth Curtice. \"Ironically, sticking to her manifesto tax pledge has cost millions of low-to-middle earners\", she said. Chancellor Rachel Reeves announced in her budget speech that the point at which people start paying higher rates of tax has been held. It means earners are set to be dragged into higher tax bands as they get pay rises. The chancellor felt unable to raise income tax as the Labour Party pledged not to raise taxes on working people in its election manifesto.  But many are saying that pledge was broken regardless, as the tax burden has increased by £26bn in this budget. When asked by Sky News whether Ms Reeves would accept she broke the manifesto pledge, she said on Thursday: \"I do recognise that yesterday I have asked working people to contribute a bit more by freezing those thresholds for a further three years from 2028.\" \n                  Budget 2025 is a big risk for Labour's election plans\n                 \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \"I do recognise that that will mean that working people pay a bit more, but I've kept that contribution to an absolute minimum\". Read more:Budget 2025: The key points at a glanceBudget tax calculator: How much more will you pay? As a result of the freeze in income tax bands, another closely watched thinktank, the Institute for Fiscal Studies (IFS), said a basic-rate taxpayer will pay £220 more tax per year, while a higher-rate taxpayer will be charged £600 more annually. Welcome news The Resolution Foundation thinktank, which aims to raise living standards, welcomed measures designed to support people with the cost of living, such as the removal of the two-child benefit cap, which limited the number of children families could claim benefits for. The announced reduction in energy bills through the removal of as yet unspecified levies was similarly welcomed. The chancellor said bills would become £150 cheaper a year, but the foundation said typical energy bills will fall by around £130 annually for the next three years, \"though support then fades away\". Credit was also given to Ms Reeves for increasing the financial cushion she has against market shocks, like a spike in energy prices. This is part of her self-imposed fiscal rules to bring down debt and balance the budget by 2030. As a result, less policy speculation and more stability can be expected. \"The decision to increase her headroom, when she didn't strictly need to, deserves credit,\" said economics research institute, the IFS. \"It means that it will require a larger shock to blow the chancellor off course. This in turn should mean that we can expect a period of greater stability and more muted policy speculation.\" More money, however, will be borrowed as a result of the budget, said independent forecasters, the Office for Budget Responsibility (OBR). Budget spending and tax policies increase borrowing by an average of £5bn over the next three years, but then reduces it by roughly £13bn in the following two. More to come This budget won't be the last of it, the Resolution Foundation's Ms Curtice said, as economic growth forecasts have been downgraded by the OBR, and growth is a \"hurdle that remains to be cleared\". \"Until that challenge is taken on, we can expect plenty more bracing budgets,\" she added. It comes despite Ms Reeves saying as far back as last year, there would be no more tax increases. Ultimately, though, the foundation said: \"The great drumbeat of doom that preceded the chancellor's big day turned out to be over the top: the forecasts came in better than many had feared.\""
    },
    {
        "title": "HSBC chair candidates to pitch to lender's board next week",
        "description": "The remaining candidates to chair HSBC Holdings have been asked to pitch to the board of Europe's biggest lender next week as it seeks to finalise the appointment of a successor to Sir Mark Tucker.",
        "url": "https://news.sky.com/story/hsbc-chair-candidates-to-pitch-to-lenders-board-next-week-13476037",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hsbc-canary-wharf_7005391.jpg?20250830084813",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-27 10:05:00",
        "Headline": "Contenders to replace Sir Mark Tucker, including the former chancellor George Osborne, have been asked to present their views on its strategy to the board of Europe's biggest lender early next month, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The remaining candidates to chair HSBC Holdings have been asked to pitch to the board of Europe's biggest lender next week as it seeks to finalise the appointment of a successor to Sir Mark Tucker. Sky News has learnt the contenders for one of Britain's plum corporate directorships - including George Osborne, the former chancellor - will present their views on the company's strategy and governance early next week. A person close to the bank said on Thursday that Mr Osborne and at least one other candidate, thought to be the former McKinsey chief Kevin Sneader, were expected to meet HSBC's directors, including acting chairman Brendan Nelson. However, Naguib Kheraj, the former Barclays finance chief and ex-Standard Chartered deputy chairman, is said to have pulled out of the recruitment process in recent days, the HSBC insider added. Money blog: See how much your take-home pay will reduce due to income tax threshold freeze  Mr Osborne's candidacy for the job was revealed by Sky News earlier this month. Although he has scant direct banking or plc boardroom experience, he has counselled HSBC on key strategic initiatives since becoming a partner at the advisory firm Robey Warshaw - now part of Evercore Partners - in 2021. He was also reported to have intervened on HSBC's behalf as it sought to avoid prosecution in the US in 2012 on money laundering charges. Mr Osborne, who was chancellor from 2010 until 2016, has amassed a portfolio of other corporate directorships, while he also chairs the British Museum. With a market capitalisation of almost £180bn, HSBC is the second-largest FTSE-100 company after drugs giant AstraZeneca. The bank has been looking for a replacement for Sir Mark for nearly a year, but has run what external critics have described as a chaotic succession process. Sir Mark, who has returned to the helm of insurer AIA as its non-executive chairman, stepped down at the end of September, but remains an adviser to the board. HSBC's shares have soared over the last year, rising by more than 40%, despite the headwinds posed by US President Donald Trump's sweeping global tariffs regime. Its biggest strategic move in 2025 has been to offer $14bn to buy the remaining shares of Hong Kong's Hang Seng Bank. When he was appointed, Sir Mark became the first outsider to take the post in the bank's 152-year history - and which has a big presence on the high street thanks to its acquisition of the Midland Bank in 1992. He oversaw a rapid change of leadership, appointing bank veteran John Flint to replace Stuart Gulliver as chief executive. The transition did not work out, however, with Mr Tucker deciding to sack Mr Flint after just 18 months. He was replaced on an interim basis by Noel Quinn in the summer of 2018, with that change becoming permanent in April 2020. Read more from Sky News:Reeves says 'working people will pay more'Budget was historic in at least two respects  Mr Quinn spent a further four years in the post before deciding to step down, and in July 2024 he was succeeded by Georges Elhedery, a long-serving executive in HSBC's markets unit and more recently the bank's chief financial officer. The new chief's first big move in the top job was to unveil a sweeping reorganisation of HSBC that sees it reshaped into eastern markets and western markets businesses. He also decided to merge its commercial and investment banking operations into a single division. The restructuring, which Mr Elhedery said would \"result in a simpler, more dynamic, and agile organisation\" has drawn a mixed reaction from analysts, although it has not interrupted a strong run for the stock. During Sir Mark's tenure, HSBC continued to exit non-core markets, selling operations in countries such as Canada and France as it sharpened its focus on its Asian operations. In late September, HSBC said in a statement: \"The process to select the permanent HSBC Group Chair, led by Ann Godbehere, Senior Independent Director, is ongoing. \"The company will provide further updates on this succession process in due course.\" HSBC has been contacted for comment."
    },
    {
        "title": "'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says",
        "description": "Sticking to Labour's manifesto pledge and freezing income tax thresholds rather than raising income tax has hurt low- and middle-income earners, an influential thinktank has said. ",
        "url": "https://news.sky.com/story/sticking-to-labour-manifesto-pledge-costs-millions-of-workers-resolution-foundation-says-13475963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-money-generic_7093188.jpg?20251127071705",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-27 05:50:00",
        "Headline": "There will be more \"bracing budgets\" to come as economic growth is a \"hurdle that remains to be cleared\", says the influential thinktank.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Sticking to Labour's manifesto pledge and freezing income tax thresholds rather than raising income tax has hurt low- and middle-income earners, an influential thinktank has said.  Millions of these workers \"would have been better off with their tax rates rising than their thresholds being frozen\", according to the Resolution Foundation's chief executive, Ruth Curtice. \"Ironically, sticking to her manifesto tax pledge has cost millions of low-to-middle earners\", she said. Chancellor Rachel Reeves announced in her budget speech that the point at which people start paying higher rates of tax has been held. It means earners are set to be dragged into higher tax bands as they get pay rises. The chancellor felt unable to raise income tax as the Labour Party pledged not to raise taxes on working people in its election manifesto.  But many are saying that pledge was broken regardless, as the tax burden has increased by £26bn in this budget. When asked by Sky News whether Ms Reeves would accept she broke the manifesto pledge, she said on Thursday: \"I do recognise that yesterday I have asked working people to contribute a bit more by freezing those thresholds for a further three years from 2028.\" \n                  Budget 2025 is a big risk for Labour's election plans\n                 \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 \"I do recognise that that will mean that working people pay a bit more, but I've kept that contribution to an absolute minimum\". Read more:Budget 2025: The key points at a glanceBudget tax calculator: How much more will you pay? As a result of the freeze in income tax bands, another closely watched thinktank, the Institute for Fiscal Studies (IFS), said a basic-rate taxpayer will pay £220 more tax per year, while a higher-rate taxpayer will be charged £600 more annually. Welcome news The Resolution Foundation thinktank, which aims to raise living standards, welcomed measures designed to support people with the cost of living, such as the removal of the two-child benefit cap, which limited the number of children families could claim benefits for. The announced reduction in energy bills through the removal of as yet unspecified levies was similarly welcomed. The chancellor said bills would become £150 cheaper a year, but the foundation said typical energy bills will fall by around £130 annually for the next three years, \"though support then fades away\". Credit was also given to Ms Reeves for increasing the financial cushion she has against market shocks, like a spike in energy prices. This is part of her self-imposed fiscal rules to bring down debt and balance the budget by 2030. As a result, less policy speculation and more stability can be expected. \"The decision to increase her headroom, when she didn't strictly need to, deserves credit,\" said economics research institute, the IFS. \"It means that it will require a larger shock to blow the chancellor off course. This in turn should mean that we can expect a period of greater stability and more muted policy speculation.\" More money, however, will be borrowed as a result of the budget, said independent forecasters, the Office for Budget Responsibility (OBR). Budget spending and tax policies increase borrowing by an average of £5bn over the next three years, but then reduces it by roughly £13bn in the following two. More to come This budget won't be the last of it, the Resolution Foundation's Ms Curtice said, as economic growth forecasts have been downgraded by the OBR, and growth is a \"hurdle that remains to be cleared\". \"Until that challenge is taken on, we can expect plenty more bracing budgets,\" she added. It comes despite Ms Reeves saying as far back as last year, there would be no more tax increases. Ultimately, though, the foundation said: \"The great drumbeat of doom that preceded the chancellor's big day turned out to be over the top: the forecasts came in better than many had feared.\""
    },
    {
        "title": "No changes to Scottish income tax plan, First Minister John Swinney vows",
        "description": "The Scottish government does not intend to increase income tax rates or introduce new bands in next year's budget, First Minister John Swinney has vowed.",
        "url": "https://news.sky.com/story/no-changes-to-scottish-income-tax-plan-first-minister-john-swinney-vows-13476066",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-john-swinney-first-minister_7093566.jpg?20251127133522",
        "type": "Politics",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-11-27 11:17:00",
        "Headline": "At First Minister's Questions on Thursday, Scottish Tory leader Russell Findlay accused the UK chancellor of \"screwing taxpayers\".",
        "Content": "\n          Scotland reporter\n              @Jenster13\n The Scottish government does not intend to increase income tax rates or introduce new bands in next year's budget, First Minister John Swinney has vowed. However, the SNP leader did not disclose if the pay thresholds will remain the same. In the 2025 Budget, Chancellor Rachel Reeves announced £26bn worth of tax rises - including extending the freeze on tax thresholds which could see earners dragged into higher bands if they get a pay rise. At First Minister's Questions on Thursday, Scottish Tory leader Russell Findlay accused the UK chancellor of \"screwing taxpayers\". He added: \"She's also borrowing even more money, leaving more debt to future generations. And she did all of this, all of this, despite saying that she would do none of it. \"Does John Swinney intend to keep the SNP manifesto promise not to raise tax on Scottish workers?\" In Scotland, Holyrood ministers have used devolved powers to set up an income tax system with seven bands compared to the UK's four. \n                  First Minister John Swinney 'open' to national inquiry into grooming gangs in Scotland\n                 \n                  Bonds announcement a 'proud day for Scotland', says Swinney\n                 \n                  Scottish government yet to pay up after losing legal battle over definition of a woman\n                 Earlier in the day, Finance Secretary Shona Robison said the tax strategy in January's budget would remain the same ahead of next year's Holyrood election. Citing this, Mr Swinney said: \"Obviously, the government is giving consideration to the implications of the United Kingdom budget for the Scottish budget. \"But the finance secretary confirmed this morning that the Scottish government will not increase income tax rates or introduce any new bands.\"  Read more:Budget 2025: The key points at a glanceBudget calculator: See how your finances have changed The UK government's scrapping of the two-child benefit cap has freed up about £155m in Scottish government funding that was going to be used to mitigate the cap north of the border. Mr Findlay, MSP for West Scotland, urged Mr Swinney to now use that cash to lower income tax bills. He said: \"We believe that Scottish taxpayers deserve to keep more of their own hard-earned money. They deserve fairness and they deserve a break from higher bills.\" The first minister previously said the money would be invested in other initiatives to help reduce child poverty \"even further\". Mr Swinney said he was \"glad\" the Scottish government \"shamed the Labour Party into acting on this particular issue\". He added: \"So, when Mr Findlay attacks me for asking people on higher earnings to pay more in tax, I'm prepared to do that so that I can work to eradicate child poverty, which is the best thing for the future of our country.\""
    },
    {
        "title": "Budget 2025 is a big risk for Labour's election plans",
        "description": "Day two after a budget is always an important moment.",
        "url": "https://news.sky.com/story/budget-20205-is-a-big-risk-for-labours-election-plans-13476160",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-conway-rachel-reeves_7091118.jpg?20251125001626",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-11-27 14:45:00",
        "Headline": "While this was a budget to satisfy financial markets and Labour MPs, Sky's Ed Conway says the chancellor has gambled on the economy outperforming ahead of the next general election.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Day two after a budget is always an important moment. This is when the nerds and boffins of Britain's fiscal thinktanks assemble to deliver their snap verdict on the chancellor's decisions. The moment is more important than ever when, as was certainly the case this time, the budget is a big one. So what did the Institute for Fiscal Studies (IFS) and the Resolution Foundation make of this year's budget? Well, as you'd probably expect, they both fell short of distilling it into a single soundbite, but in broad terms, they both sounded somewhat positive. Money latest: Budget blow to holidays Yes, there were plenty of big provisos. The head of the IFS, Helen Miller, said Labour have broken their manifesto pledge not to raise National Insurance. \n                  Starmer insists Labour 'kept to our manifesto' despite record-breaking tax rises\n                 \n                  'Sticking to Labour manifesto pledge costs millions of workers', Resolution Foundation says\n                 \n                  Budget 2025: Reeves to face further questions after being accused of broken promises\n                 The Resolution Foundation argued that if only the chancellor had raised the basic rate of income tax instead of freezing personal allowances, it would have made the tax rise considerably fairer and more progressive.  And that's before one gets into the criticism of some of the other bits and pieces from the red book - the structure of the EV tax, for instance (why doesn't it try to penalise congestion?), or of the mansion tax (why not just overhaul council tax altogether?). But for the most part, these closely-followed institutions seemed pretty supportive of this year's budget - more so, certainly, than they were last year. Primarily, that's because while the last budget left only a very thin bit of headroom against Rachel Reeves's fiscal rules, this one was far more cautious, doubling that fiscal insurance policy to just over £21bn.  Yet that headroom is dependent on a couple of important factors. First, that the government will hold to its promises to keep spending growth constrained towards the end of the decade. Second, that it will be able to raise all the tax revenues it's promising in that year. That, in turn, gets to a deeper issue with the budget. Most of the tough stuff has been put off to the final year of the forecast - namely 2029. That year, the government will face a squeeze at the very same moment that Britons are all asked to pay more in taxes. And, critically, that's the very year Labour is due to face a general election. Does it really plan to fight an election off the back of a contracting economy? Consider, too, that for all the government's promises to get living standards growing this parliament, they are currently only forecast to rise at the slowest rate since the 1950s - save for the pandemic and energy price shock period. The economic backdrop, in other words, is hardly rosy. Still, for the time being, the chancellor has managed to put together a budget that has bolstered her position both in her party and in her job. Markets remain relatively sanguine - much more so than after Rachel Reeves's first budget last year - with bond yields lower today than before the event (albeit a little higher than yesterday). Read more:Budget takes UK into uncharted territory to allow spending spreeMain budget announcements at a glanceReeves reveals £26bn of tax risesCash ISA limit slashed - but some are exempt However, this was a complex budget. And, as with all bits of complex engineering, there remains a distinct possibility of large chunks of the budget failing to work. But since so much of it isn't due to kick in for a few years, it may take quite a while before we find out which bits work and which, if any, don't."
    },
    {
        "title": "Did the budget breach Labour's manifesto?",
        "description": null,
        "url": "https://news.sky.com/story/did-the-budget-breach-labours-manifesto-13475969",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092370.jpg?20251126113344",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-27 06:39:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Should you be able to pick your baby’s genetic code? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>        ",
        "url": "https://news.sky.com/story/should-you-be-able-to-pick-your-baby8217s-genetic-code-13476240",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-baby-daily-podcast_7093807.jpg?20251127172115",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-27 17:18:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  A US clinic is offering would-be parents the chance to select traits like height and intelligence to \"genetically optimise\" their future babies on top of the usual screenings for hereditary diseases. Critics of the start-up company have questioned the ethics of this and experts in human genetics are also questioning the science behind it. Niall talks to Sky's science and technology editor Tom Clarke about what the concerns are. Producer: Tom GillespieEditor: Wendy Parker"
    },
    {
        "title": "Sally Rooney tells court new books may not be published in UK due to Palestine Action ban",
        "description": "Irish author Sally Rooney has told the High Court she may not be able to publish new books in the UK, and may have to withdraw previous titles from sale, because of the ban on Palestine Action.",
        "url": "https://news.sky.com/story/sally-rooney-tells-court-new-books-may-not-be-published-in-uk-due-to-palestine-action-ban-13476264",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sally-rooney-author_6994490.jpg?20250818162218",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-27 18:46:00",
        "Headline": "The Irish writer said it is currently \"unclear\" whether UK companies can pay her, after she said she would donate earnings to support Palestine Action.",
        "Content": "Irish author Sally Rooney has told the High Court she may not be able to publish new books in the UK, and may have to withdraw previous titles from sale, because of the ban on Palestine Action. The group's co-founder Huda Ammori is taking legal action against the Home Office over the decision to proscribe Palestine Action under anti-terror laws in July. The ban made being a member of, or supporting, Palestine Action a criminal offence punishable by up to 14 years in prison. Rooney was in August warned that she risked committing a terrorist offence after saying she would donate earnings from her books, and the TV adaptations of Normal People and Conversations With Friends, to support Palestine Action.  In a witness statement made public on Thursday, Rooney said the producer of the BBC dramas said they had been advised that they could not send money to her agent if the funds could be used to fund the group, as that would be a crime under anti-terror laws. Rooney added that it was \"unclear\" whether any UK company can pay her, stating that if she is prevented from profiting from her work, her income would be \"enormously restricted\". \n                  Bodycam footage of alleged sledgehammer attack on police shown at trial of Palestine Action activists\n                 \n                  Manhunt for prisoner who 'absconded' after being freed from HMP Wandsworth for brother's wedding\n                 \n                  More than a dozen Palestine Action protests planned next month despite ban on group\n                  She added: \"If I were to write another screenplay, television show or similar creative work, I would not be able to have it produced or distributed by a company based in England and Wales without, expressly or tacitly, accepting that I would not be paid.\" Rooney described how the publication of her books is based on royalties on sales, and that non-payment of royalties would mean she can terminate her contract. \"If, therefore, Faber and Faber Limited are legally prohibited from paying me the royalties I am owed, my existing works may have to be withdrawn from sale and would therefore no longer be available to readers in the UK,\" Rooney added, saying this would be \"a truly extreme incursion by the state into the realm of artistic expression\". Rooney added that it is \"almost certain\" that she cannot publish or produce new work in the UK while the Palestine Action ban remains in force. She said: \"If Palestine Action is still proscribed by the time my next book is due for publication, then that book will be available to readers all over the world and in dozens of languages, but will be unavailable to readers in the United Kingdom simply because no one will be permitted to publish it, unless I am content to give it away for free.\" Sir James Eadie KC, barrister for the Home Office, said in a written submission that the ban's aim is \"stifling organisations concerned in terrorism and for members of the public to face criminal liability for joining or supporting such organisations\". \"That serves to ensure proscribed organisations are deprived of the oxygen of publicity as well as both vocal and financial support,\" he continued. The High Court hearing is due to conclude on 2 December, with a decision expected in writing at a later date."
    },
    {
        "title": "Creator of AI actress Tilly Norwood addresses claims she'll 'steal jobs' from real stars",
        "description": "The creator of an AI actress has told Sky News that synthetic performers will get more actors working, rather than steal jobs. ",
        "url": "https://news.sky.com/story/creator-of-ai-actress-tilly-norwood-addresses-claims-shell-steal-jobs-from-real-stars-13476326",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eline-velden_7094045.jpg?20251127222323",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-27 22:02:00",
        "Headline": "An AI production studio has been roundly criticised by Hollywood - but its founder has insisted its creations will boost the entertainment industry, not hinder it. ",
        "Content": "The creator of an AI actress has told Sky News that synthetic performers will get more actors working, rather than steal jobs.  AI production studio Particle6 has ruffled feathers in Hollywood by unveiling Tilly Norwood - a 20-something actress created by artificial intelligence. Speaking to Sky News' Dominic Waghorn, actor and comedian Eline Van der Velden - who founded Particle6 - insisted Norwood is \"not meant to take jobs in the traditional film\". AI entertainment is \"developing as a completely separate genre\", she said, adding: \"And that's where Tilly is meant to stay. She's meant to stay in the AI genre and be a star in that.\" \"I don't want her to take real actors' jobs,\" she continued. \"I wanted to have her own creative path.\" Norwood has been labelled \"really, really scary\" by Mary Poppins Returns star Emily Blunt, while the US actors' union SAG-AFTRA said in a statement: \"Tilly Norwood is not an actor, it's a character generated by a computer program that was trained on the work of countless professional performers - without permission or compensation.\" Responding to the criticism, Ms Van der Velden argued that Hollywood is \"going to have to learn how to work with [AI] going forward\". \"We can't stop it,\" she said. \"If we put our head in the sand, then our jobs will be gone. However, instead, if we learn how to use these tools, if we use it going forward, especially in Britain, we can be that creative powerhouse.\" Read more:How AI music is fooling most of usTom Hollander 'not scared' of AI star Ms Van der Velden said her studio has already helped a number of projects that were struggling due to budget constraints. \"Some productions get stuck, not able to find the last 30% of their budget, and so they don't go into production,\" she said. \"Now with AI, by replacing some of the shots […] we can actually get that production going and working. So as a result, we get more jobs, we get more actors working, so that's all really, really positive news.\""
    },
    {
        "title": "Prince William tells John Cleese his kids have just discovered Fawlty Towers",
        "description": "Prince William wasn't close to being born when Fawlty Towers first aired - but now even his children have fallen in love with it.",
        "url": "https://news.sky.com/story/prince-william-tells-john-cleese-his-kids-have-just-discovered-fawlty-towers-13475955",
        "image_url": "https://e3.365dm.com/20/06/1920x1080/skynews-cleese-sachs-booth_5011395.jpg?20200612042332",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-27 03:58:00",
        "Headline": "The Prince of Wales told the sitcom's star his family are having \"a lot of family laughs\" watching the show, and his children \"love it\".",
        "Content": "Prince William wasn't close to being born when Fawlty Towers first aired - but now even his children have fallen in love with it. The Prince of Wales, 43, revealed his kids' love of the classic British sitcom - which first aired in 1975 - during a conversation with star John Cleese. The pair shared a few words at the Tusk Conservation Awards at London's Savoy Hotel on Wednesday night, which honoured those safeguarding the habitats and animals of Africa. William told Cleese they were having \"a lot of family laughs\" watching the show, and his children \"love it\". The future king said he has also been \"reminiscing\" on the series and enjoying it \"all over again\". \"It's brilliant,\" he added. After their chat, Cleese said of Fawlty Towers: \"I always explain it's about 'who's scared of who' and kids pick that up immediately. And mine, all those years ago, grew up watching it.\" Read more from Sky News:Reeves facing more questions over budgetTrump condemns 'monstrous' shooting in DC The veteran comic actor - an ambassador of the trust - was joined by his wife Jennifer Wade, and fellow ambassador Ronnie Wood, the Rolling Stones guitarist. Other guests were Zara Tindall and husband Mike, and William's cousins Lady Amelia and Lady Eliza Spencer. Winners included Laban Mwangi, a head ranger working in Kenya; Rahima Njaidi, who has established a Tanzanian community-led forest conservation network; and Kumara Wakjira, who was honoured for his work in Ethiopia. William said they \"should inspire us to drive change\". He added: \"If we all want to continue to enjoy and benefit from the wonders of the natural world we must not be the generation that stands by as wildlife and biodiversity disappears. \"What we choose to do will have an impact on future generations, and tonight we must choose to do more.\""
    }
]