[
    {
        "title": "US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela",
        "description": "Venezuela has accused the US of \"piracy\" after an oil tanker was seized off the country's coast.",
        "url": "https://news.sky.com/story/us-forces-seize-oil-tanker-off-coast-of-venezuela-reports-13481897",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-venezuela-oil-tanker_7106954.png?20251210221322",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-10 19:36:00",
        "Headline": "Dramatic footage released by the president's attorney general appears to show US troops descending on to the ship from helicopters, armed with weaponry.",
        "Content": " Venezuela has accused the US of \"piracy\" after an oil tanker was seized off the country's coast. Donald Trump announced the operation had taken place during a meeting of business leaders at the White House, telling reporters: \"We've just seized a tanker on the coast of Venezuela, a large tanker, very large, largest one ever seized, actually.\" Attorney General Pam Bondi shared a video of the operation, revealing the FBI, Homeland Security, US Coast Guard, and Department of Defence were involved. She said the US forces \"executed a seizure warrant for a crude oil tanker used to transport sanctioned oil from Venezuela and Iran\". Venezuela's government said the seizure \"constitutes a blatant theft and an act of international piracy.\" Ms Bondi said the seized vessel - believed to be a tanker named Skipper - has been sanctioned by the US for many years \"due to its involvement in an illicit oil shipping network supporting foreign terrorist organisations\". She did not name the vessel, what flag it sailed under, or exactly where the incident took place. UK maritime risk management group Vanguard said that the tanker Skipper - which the US sanctioned for alleged involvement in Iranian oil trading under the name Adisa - was believed to be the target. Trump offers ominous commentary Without giving additional information on the operation, Mr Trump added during the White House meeting that \"other things are happening\". Later, Mr Trump said the tanker was \"seized for a very good reason\", and when asked what will happen to the oil on board, he added: \"Well, we keep it, I suppose.\"  How did we get here? It marks another escalation from the US after months of pressure on Venezuelan President Nicolas Maduro. The White House accuses Mr Maduro of presiding over a narcotrafficking operation in Venezuela, which he denies. The US has escalated military deployments against the Latin American country over the last few months, with the president suggesting American forces could launch a land attack. Speaking to Politico on Tuesday, Mr Trump declined to comment on whether US troops would enter Venezuela, but warned Mr Maduro's \"days are numbered\". On 2 September, the White House posted on X that it had conducted a strike against so-called \"narcoterrorists\" shipping fentanyl to the US, without providing direct evidence of the alleged crime. Sky News has verified that in the past four months, 23 boats have been targeted in 22 strikes, killing 87 people. Read more: Is this what the beginning of a war looks like? US correspondent The seizing of an oil tanker off the coast of Venezuela is a significant escalation in US tactics. By targeting an oil shipment, rather than a suspected drug boat, Washington has signalled its willingness to disrupt exports. President Trump seems determined to shut down one of the last major sources of funding for Nicholas Maduro’s embattled government. Nine months ago, Trump imposed a 25% tariff on all goods imported into the US from any country buying oil or gas from Venezuela. This is even more aggressive and will be viewed in Caracas as a direct threat to the country’s economy and sovereignty. The interception of the tanker raises more questions about international maritime law and the reach of US enforcement powers. In the space of four months, the US has bombed 23 boats, killing 87 people, accusing the occupants of being \"narco-terrorists\". It will also fuel speculation that airstrikes are imminent, President Trump having posted two weeks ago that he had closed the airspace. Venezuela: 'It has always been about our oil' The Maduro government describes America's actions as a grab for Venezuela's oil reserves, which are among the biggest in the world. At a rally before a ruling-party-organised demonstration in Caracas on Wednesday, Mr Maduro did not address the seizure but told supporters Venezuela is \"prepared to break the teeth of the North American empire if necessary\". Flanked by senior officials, he said that only the ruling party can \"guarantee peace, stability, and the harmonious development of Venezuela, South America and the Caribbean\". His government did issue a statement, accusing the US of \"piracy\" and \"imperial abuses\". Of the US campaign, it said: \"It has always been about our natural resources, our oil, our energy, the resources that belong exclusively to the Venezuelan people.\" Read more on Venezuela:Hegseth cites 'fog of war' defenceUS aircraft carrier close to Venezuela  Is military confrontation possible? Geoffrey Corn, director of the Centre for Military Law at Texas Tech University, told Sky's Mark Austin on The World that Mr Trump's remarks on land strikes \"ostensibly\" refer to drug cartel members. Formerly a senior adviser to the US army on warfare law, Mr Corn added: \"That could very easily provide the pretext for some confrontation between Venezuelan armed forces and US armed forces. \"And then that would open the door to a broader campaign to basically negate the power of the Venezuelan military.\""
    },
    {
        "title": "'They know Britain is a soft country': The visa overstayers living under the radar",
        "description": "Ramesh lives in fear every day. A police siren is enough to alarm him.",
        "url": "https://news.sky.com/story/they-know-britain-is-a-soft-country-the-visa-overstayers-living-under-the-radar-13481811",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-teaser-visa-overstay_7106660.png?20251210151005",
        "type": "Home",
        "Author": "Lisa Holland",
        "Date Published": "2025-12-10 14:14:00",
        "Headline": "No data has been collated for five-and-a-half years on the number of visa of overstayers in Britain. But the picture painted by community leaders and lawyers is stark.",
        "Content": "\n          Communities correspondent\n              @LisaatSky\n  Ramesh lives in fear every day. A police siren is enough to alarm him. He's one of up to 400,000 visa overstayers in the UK, one lawyer we spoke to believes. It's only an estimate because the Home Office has stopped collecting figures - which were unreliable in the first place. Britain is being laughed at, one man told us, \"because they know it's a soft country\". We meet Ramesh (not his real name) at a Gurdwara, a Sikh place of worship, where he goes for food and support. He insists he can't return to India where he claims he was involved in political activism. Ramesh says he came to the UK on a student visa in 2023, but it was cancelled when he failed to continue his studies after being involved in a serious accident. He tells us he is doing cash-in-hand work for people who he knows through the community where he is living and is currently working on a house extension where he gets paid as little as £50 for nine hours labouring. \"It's very difficult for me to live in the UK without my Indian or Pakistani community - also because there are a lot of Pakistani people who give me work in their houses for cleaning and for household things,\" he adds. 'What will become of people like us?' Anike has lived in limbo for 12 years. Now living in Greater Manchester, she came to the UK from Nigeria when her sister Esther was diagnosed with a brain tumour - she had a multi-entry visa but was supposed to leave after three months. Esther had serious complications from brain surgery and says she is reliant on her sister for care. Immigration officials are in touch with her because she has to digitally sign in every month. Anike has had seven failed applications for leave to remain on compassionate grounds refused but is now desperate to have her status settled - afraid of the shifting public mood over migration. \"Everybody is thinking 'what will become of people like us?'\" she adds. 'It's a shambles' The government can't say with any degree of accuracy how many visa overstayers there are in Britain - no data has been collated for five-and-a-half years. But piecing together multiple accounts from community leaders and lawyers the picture we've built is stark. Immigration lawyer Harjap Singh Bhangal told us he believed there could be several hundred thousand visa overstayers currently in Britain. He says: \"At this time, there's definitely in excess of about 200,000 people overstaying in the UK. It might even be closer to 300,000, it could even be 400,000.\" Asked what evidence he has for this he replies: \"Every day I see at least one overstayer, any immigration lawyers like me see overstayers and that is the bulk of the work for immigration lawyers. \"The Home Office doesn't have any accurate data because we don't have exit controls. It's a shambles. It's an institution where every wall in the building is cracked.\" The number of those who are overstaying visas and working cash in hand is also virtually impossible to measure. 'They know Britain is a soft country' \"They're laughing at us because they know Britain is a soft country, where you won't be picked up easily,\" says the local man we've arranged to meet as part of our investigation. We're in Kingsbury in northwest London - an area which people say has been transformed over the past five years as post-Brexit visa opportunities opened up for people coming from South Asia. 'Mini-Mumbai' The man we're talking to lives in the community and helps with events here. He doesn't want to be identified but raises serious questions about visa abuse. \"Since the last five years, a huge amount of people have come in this country on this visiting visa, and they come with one thing in mind - to overstay and work in cash,\" he says. \"This area is easy to live in because they know they can survive. It looks like as if you are walking through mini-Mumbai.\"  'It's taxpayers who are paying' And he claims economic migrants are regularly arriving - who've paid strangers to pretend they're a friend or relative in order to obtain a visitor visa to get to Britain. He says: \"I've come across so many people who have come this way into this country. It's widespread. When I talk to these people, they literally tell me, 'Oh, someone is coming tomorrow, day after tomorrow, someone is coming'. \"Because they're hidden they may not be claiming benefits, but they can access emergency healthcare and their children can go to school. \"And who is paying for it? It's the taxpayers who are paying for all this,\" says the man we've met in north London. Read more from Sky News:Net migration figures hit four-year lowHow Denmark may inspire UK asylum reforms A Home Office spokesperson said: \"We will not tolerate any abuse of our immigration system and anyone found to be breaking the rules will be liable to have enforcement action taken against them. \"In the first year of this government, we have returned 35,000 people with no right to be here - a 13% rise compared to the previous year. \"Arrests and raids for illegal working have soared to their highest levels since records began, up 63% and 51%.\""
    },
    {
        "title": "The government doesn't know how many people are overstaying their visas - here's why",
        "description": "The government can't say with accuracy how many visa overstayers there are in Britain - no data has been collated for five-and-a-half years.",
        "url": "https://news.sky.com/story/the-government-doesnt-know-how-many-people-are-overstaying-their-visas-heres-why-13481844",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-border-control-immigration_7093574.jpg?20251127151213",
        "type": "Home",
        "Author": "Daniel Dunford",
        "Date Published": "2025-12-10 16:13:00",
        "Headline": "The Home Office's old method of tracking visa overstayers wasn't perfect, but now there's no such system in place at all.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n The government can't say with accuracy how many visa overstayers there are in Britain - no data has been collated for five-and-a-half years. Sky News has spoken to immigration lawyers about the numbers, and one believes there could be as many as 400,000 living across the country.  Why doesn't the government know? The Home Office used to gather data on visa overstayers by effectively checking a list of passport numbers associated with visas against a list of passport numbers of people leaving the UK, taken from airlines and other international travel providers. If there was a passport number match in the arrivals and departures part of their database, that person was recorded to have left when they should have. If there wasn't, they were a potential overstayer. They stopped producing the figures because a combination of Brexit and COVID added complications that made the Home Office conclude they wouldn't be able to get to a reliable number using the same method. It's now four and a half years since EU citizens had freedom of movement to the UK revoked, and more than three and a half years since pandemic-era travel restrictions ended. And yet we are still waiting to see what a new method might look like. Read more from Sky News:Is this what the beginning of a war looks like?There's one big problem with Australia's social media ban The old method wasn't perfect. If someone changed their passport while in the UK, for example, or if the airline or individual entered the number wrong when they were leaving, there wouldn't be a match. The Home Office regarded the statistics as likely overestimating the true number of overstayers, and the Office for National Statistics designated the figures as \"experimental\" rather than \"official\" statistics, meaning the conclusions should be treated with caution. But they were a reasonable best guess. With all that in mind, between April 2016 and March 2020 upwards of 250,000 people were flagged as potential overstayers, equivalent to 63,000 per year. That's more than the 190,000 people who are recorded to have arrived in the UK on small boats since 2018. It represents 3.5% of the seven million visas that expired over that period, so at least 96.5% of people left when they should. Other Home Office data reveals that more than 13 million visas were issued between 2020 and the end of June 2025, including a record 3.4 million in 2023. But what we don't know is how many have expired, which means it's difficult for us to even guess how many people might have overstayed."
    },
    {
        "title": "British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies",
        "description": "Tributes have been paid to a British soldier killed in Ukraine, as the country's allies prepare for talks before a crucial potential meeting with Donald Trump.",
        "url": "https://news.sky.com/story/exceptional-british-soldier-killed-in-ukraine-accident-pictured-13481870",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-russia-george-hooley_7106718.jpg?20251210170832",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-10 17:52:00",
        "Headline": "Lance Corporal George Hooley, 28, died on Tuesday. The UK has been one of Ukraine's biggest backers - and that support will again come into play on Thursday as European leaders scramble to keep Donald Trump on side.",
        "Content": " Tributes have been paid to a British soldier killed in Ukraine, as the country's allies prepare for talks before a crucial potential meeting with Donald Trump. Lance Corporal George Hooley, 28, has been named as the paratrooper who died in a \"tragic accident\" on Tuesday while observing Ukrainian forces testing a new defensive capability away from the frontline. The Ministry of Defence (MoD) said he joined the army in November 2015 and was \"an exceptional soldier\". Defence Secretary John Healey said he \"served our country with distinction and professionalism\" and \"will be very deeply missed\". He added: \"George's tragic death reminds us of the courage and commitment with which our outstanding armed forces serve every day to protect our nation.\" Coalition of the willing to meet Britain has been one of Ukraine's biggest backers since Russia launched its full-scale invasion in February 2022, and that support will again come into play on Thursday. Volodymyr Zelenskyy will hold a virtual meeting with members of the self-styled coalition of the willing, after reports Kyiv has handed its revised peace deal proposal to US negotiators. Mr Zelenskyy said the revised proposal has 20 points, after some \"obvious anti-Ukrainian points were removed\". The original US draft proposal had 28 points, and was seen as favouring Russia. Read more: Trump's 28-point Ukraine peace plan in full  Zelenskyy hopeful of progress Ukraine has sought to change some key clauses, such as territorial issues and security guarantees, following talks with US and European negotiators. In his nightly address on Wednesday, Mr Zelenskyy said his country is also drafting two additional documents: the first regarding US security guarantees and the second on the economy and reconstruction. He said Kyiv's peace delegation held a \"productive conversation\" with the US earlier, and \"discussed key issues for recovery, various mechanisms, and visions of reconstruction\". He also revealed he discussed the possibility of holding elections with Ukraine's parliament, but that holding elections under martial law was not easy. Trump has 'strong words' with European leaders It comes after Donald Trump used an interview with Politico to accuse Mr Zelenskyy of \"using war\" to avoid holding elections. The US president also claimed his Ukrainian counterpart had not read the original 28-point peace plan. Mr Trump held a call with coalition of the willing members Sir Keir Starmer, Emmanuel Macron, ad Friedrich Merz on Wednesday, and said some \"pretty strong words\" were exchanged. Earlier this week, he called Europe's leaders \"weak\" and criticising them for failing to end the war.  Speaking at the White House on Wednesday, Mr Trump said Mr Zelenskyy was keen on a meeting involving him and European leaders this weekend, but warned his attendance will be \"based on what they come back with\". Today's virtual meeting comes days after Sir Keir hosted Mr Zelenskyy, Mr Macron and Mr Merz in Downing Street.  The period of intense diplomacy comes as the fighting continues on the ground in Ukraine. Its military says it's still fending off a Russian assault launched on the key city of Pokrovsk, while energy infrastructure has been targeted by drones in southern Odesa."
    },
    {
        "title": "Sharaz Ali found guilty of murdering ex-partner's sister and her three children in Bradford house fire",
        "description": "A man has been found guilty of murdering his ex-partner's sister and her three children in a house fire. ",
        "url": "https://news.sky.com/story/man-found-guilty-of-murdering-ex-partners-sister-and-her-three-children-in-bradford-house-fire-13481276",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sharaz-ali-murder_7106516.jpg?20251210121944",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-10 11:40:00",
        "Headline": "Bryonie Gawith, 29, and her children Denisty Birtle, nine, Oscar Birtle, five, and 22-month-old Aubree Birtle died in the blaze in Bradford.",
        "Content": " A man has been found guilty of murdering his ex-partner's sister and her three children in a house fire.  Prosecutors said Sharaz Ali, 40, was \"motivated by jealousy and fuelled by drink and drugs\" when he set fire to Bryonie Gawith's home early on 21 August last year. Jurors heard that Ali went to the home in Westbury Road, Bradford, aiming to \"take revenge\" on his ex, Antonia Gawith, who was staying there after ending their \"abusive\" seven-year relationship earlier that month.  Antonia Gawith managed to escape, but Bryonie Gawith, 29, and her children Denisty Birtle, nine, Oscar Birtle, five, and 22-month-old Aubree Birtle died in the blaze. Ali told a jury he had no intention of harming others when the house went up in flames, saying: \"I didn't want to hurt anyone but myself.\" But after a trial at Doncaster Crown Court, he was found guilty of four counts of murder and attempting to murder Antonia Gawith. Calum Sunderland, 26, who went with Ali to the house and kicked the door in for him, was found guilty of the manslaughter of Bryonie Gawith and her three children, but cleared of the more serious charges of murder. He was also cleared of attempted murder, and an alternative count of attempting to cause grievous bodily harm, in relation to Antonia Gawith. Mohammed Shabir, 45, who had also been due to go on trial, died of a heart attack in October after collapsing in prison. Reading a statement on behalf of her family outside court, Antonia Gawith said her sister, nieces and nephew's futures have been \"stolen\". \"Even with justice, nothing will ever make this right,\" she said. \"Nothing will ever fill the silence where their laughter should be. Nothing will ever bring back our family. \"We will forever carry this brokenness, and yet we will hold on to them tightly in only ways we can now, through our memories, our photos and our precious videos. Those are all we have left now.\" After the verdicts, the judge, Mr Justice Hilliard, thanked jurors and said the case had been \"distressing beyond measure - three children and their mother murdered\". \"I don't think anyone who heard Antonia's desperate cries for help will ever forget them,\" he said. \"These are truly dreadful crimes.\" The judge also praised the \"extraordinary bravery\" of those who tried to save the children trapped in the house. Ali and Sunderland, a convicted arsonist, were driven to the house by Shabir, stopping on the way to fill a seven-litre canister with petrol, the court heard. Doorbell footage captured Ali telling Sunderland, who was carrying the petrol and a lighter, to \"kick the door in\", which he did before running back to the car. Antonia Gawith said she saw an \"angry\" Ali run into the house and begin pouring petrol on her while shouting before setting himself and the house on fire. 'I couldn't save them'  In a video interview played to jurors, she sobbed as she told police how she \"couldn't save\" her sister, nieces and nephew, as she tried frantically to get back in the house through the back door. \"I was just screaming, trying to get back in the house and I couldn't get in. I couldn't save them,\" she said. Read more from Sky News:'Depraved predator' jailed for rapes and sexual assaultsBritish soldier who died in Ukraine named West Yorkshire Police's Detective Chief Inspector Stacey Atkinson said: \"Bryonie and her three children would still be alive today if it wasn't for the horrific and truly callous actions of Ali and Sunderland that day. \"They left a mum and her three children completely helpless whilst her sister and their auntie watched on in horror.\"Our thoughts and sympathies are with the family, who despite their immense strength of character now face the rest of their lives without them.\" Senior Crown Prosecution Service prosecutor Amanda McInnes said Ali was a \"selfish killer who had no regard for anyone but himself\". \"He was motivated by jealousy and his actions have now needlessly robbed a family of their loved ones,\" she said.\"Both men played their role and caused the deaths of a young family who should still be with us today.\""
    },
    {
        "title": "Five Palestine Action prisoners taken to hospital as hunger strike continues",
        "description": "Five Palestine Action prisoners awaiting trial have been taken to hospital as a result of hunger strikes, lawyers representing them told the justice secretary in a letter shared with Sky News.",
        "url": "https://news.sky.com/story/five-palestine-action-prisoners-taken-to-hospital-as-hunger-strike-continues-13481923",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-palestine-action-protest_7106920.jpg?20251210215147",
        "type": "Home",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-12-10 20:45:00",
        "Headline": "A letter describes the deteriorating health of prisoners Kamran Ahmed, Qesser Zuhrah, and Amy Gardiner-Gibson as their hunger strike continues.",
        "Content": "\n          News correspondent\n              @esadiya\n Five Palestine Action prisoners awaiting trial have been taken to hospital as a result of hunger strikes, lawyers representing them told the justice secretary in a letter shared with Sky News. A total of eight prisoners are currently taking part in the action, thought to be the UK's biggest hunger strike since 1981, with two now on day 38 without food, according to the letter. It says prisoner Kamran Ahmed has been on hunger strike for 31 days, having spent a year on remand awaiting trial, and that he has been taken to hospital twice since collapsing in his cell on November 21. Sky News understands his latest admission was on Monday evening. His sister Shahmina Alam told Sky News her family fears \"the worst call\". \"I don't sleep through the night because I'm constantly anticipating a call - the worst call you can get,\" she said, holding back tears. \"I feel like that's the only point when we're going to receive any information about how he's doing. I'm having palpitations all the time.\" Asked what the worst call is, Shahmina says: \"That he hasn't made it.\" Shahmima told Sky News that Kamran, 28, was an emergency on-call mechanic before his arrest in November 2024. She added that his lengthy imprisonment is taking a toll on their parents. \n                  Gaza ceasefire negotiations at 'critical moment', says Qatar PM\n                 \n                  12-year-old girl from Gaza receives vital brain operation after Israeli bombing near her home\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 She said: \"I found my dad with a puffy face for the last two mornings because he's been crying. My mum seems lost. A lot of us are just broken apart. We're shattered, physically and mentally. There's an element of constantly being on edge because we don't know what's happening to him. \"Everyone's immediate reaction when they hear a family member is in hospital is to go and see them, speak to them, see how they're doing and give them comfort, and we've been restricted from that.\" The letter from law firm Imran Khan & Partners criticises prison conditions and warns of a \"real and increasingly likely potential that young British citizens will die in prison, having never been convicted of an offence\". It describes Qesser Zuhrah, on day 38 of her strike, as having a pulse rate above 100 beats per minute despite next to no physical activity. Amy Gardiner-Gibson, also on day 38, is described as experiencing twitching in her muscles and being offered a wheelchair due to her inability to walk. Read more:Nearly 500 arrested at pro-Palestine protest in LondonPalestine Action can challenge terror ban after court verdict Qesser Zuhrah faces the same charges as Kamran, for the same alleged incident. Amy Gardiner-Gibson is alleged to have participated in a break-in at RAF Brize Norton in Oxfordshire in June this year. She is charged with conspiracy to commit criminal damage, and conspiracy to enter a prohibited place knowingly for a purpose prejudicial to the safety or interests of the UK. The letter says Kamran Ahmed has been in hospital repeatedly with dangerous ketone levels after collapsing on 21 November and that he suffers with dizziness, shallow breath and a tightness in his chest. Mr Ahmed has lost over 10 kilograms in weight, it adds. \"He collapsed in his cell,\" Shamima told Sky News. \"He is not sure how long he passed out for, but he hit his back and head on the metal frame of his bed.\" \"When he was hospitalised he was allowed one call. He sounded really emotional on the phone but it seemed like he wasn't able to talk about anything else or had been instructed not to talk about anything else. Since then, we haven't heard from him and haven't been able to get any updates on him.\" Criticising the lack of engagement from the government, Labour MP John McDonnell raised a point of order in the House of Commons on Wednesday saying that the justice secretary had failed to respond to previous letters on the matter. He said: \"This is a matter of urgency and I would've expected at least the courtesy of some response even if he's not willing to meet us.\" Speaker Sir Lindsay Hoyle responded: \"It is totally unacceptable.\" Palestine Action told Sky News that all eight prisoners on hunger strike are accused of offences occurring before the group was proscribed and will have been in prison for well over a year before they are tried. A judicial review challenge to the proscription has concluded with judges reserving their decision until a later date. MP and co-founder of Your Party, Jeremy Corbyn, told Sky News that Deputy Prime Minister David Lammy rejected his invitation to meet to resolve the matter by saying \"considering the ongoing proceedings, it would not be appropriate for me to meet with you to discuss the situation.\" The response forwarded to Sky News by Mr Corbyn also assures him \"the safety of those who live and work in our prisons remains our paramount concern\". Sky News has contacted the Ministry of Justice for comment."
    },
    {
        "title": "Maria Corina Machado missed the ceremony, but the Nobel Peace Prize winner is heading to Oslo after 'extraordinary' day",
        "description": "The Venezuelan opposition leader Maria Corina Machado didn't&#160;make it to Oslo in time to receive the Nobel Peace Prize in person, in an extraordinary day shrouded in uncertainty over her whereabouts.",
        "url": "https://news.sky.com/story/maria-corina-machado160missed-the-ceremony-but-the-nobel-peace-prize-winner-is-heading-to-oslo-after-extraordinary-day-13481918",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maria-corina-machado_7047545.jpg?20251210211224",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-12-10 20:28:00",
        "Headline": "The politician, who left Venezuela amid heavy secrecy and probably with covert US help, is due to arrive in Norway on Wednesday night.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n  The Venezuelan opposition leader Maria Corina Machado didn't make it to Oslo in time to receive the Nobel Peace Prize in person, in an extraordinary day shrouded in uncertainty over her whereabouts. Machado isn't the first Nobel Laureate unable to attend, but her journey to Oslo was unprecedented in the history of the prestigious prize. Her departure from Venezuela, carried out amid heavy secrecy and probably with covert US help, was fraught with risk, but on Wednesday she was en route to Norway, where she is expected to land late in the evening.  Reports suggested she first travelled by boat to the Caribbean island of Curaçao before getting a private flight via the US. Two US F-16 jets were tracked in the skies close to Curaçao late Tuesday night. In a phone call with members of the Nobel Institute, released just after she took off, Machado said she was \"very sad\" not to make it in person but \"as soon as I arrive, I will be able to embrace all my family and children.\" In her absence, her daughter Ana Corina Sosa Machado, whom she hasn't seen for almost two years, collected the award in Oslo City Hall and delivered the speech her mother wrote. She spoke about 2,500 people who had been \"kidnapped, disappeared or tortured\" under Venezuelan president Nicolas Maduro's government and slammed the corruption that has brought Venezuela, once one of the world's richest nations, to its knees. \n                  US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela\n                 \n                  Trump's high seas raid may be followed by something much more severe\n                 \n                  British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies\n                 \"This prize carries profound meaning; it reminds the world that democracy is essential to peace. \"More than anything, what we Venezuelans can offer the world is the lesson forged through this long and difficult journey - that to have democracy, we must be willing to fight for freedom.\" To a standing ovation from an audience that included several South American leaders, Machado thanked the people of Norway and sent a message to her fellow countrymen and women, many of whom had travelled to Oslo from their homes outside Venezuela. \"Venezuela will breathe again,\" her daughter read. \"We will open prison doors and watch thousands who were unjustly detained step into the warm sun, embraced at last by those who never stopped fighting for them.  \"We will see our grandmothers settle children on their laps to tell them stories not of distant forefathers but of their own parents' courage. \"We will hug again. Fall in love again. Hear our streets fill with laughter and music. All the simple joys the world takes for granted will be ours.\" Ms Machado is the leader of a grassroots political movement fighting for democracy in Venezuela. She was banned by Nicolas Maduro from running for election, so she rallied a campaign behind a little-known veteran diplomat Edmundo Gonzalez. She organised and trained more than a million volunteers to monitor elections in 2024 and collect data. Those results, smuggled out of the country, were verified by independent experts and confirmed a landslide win for Gonzalez and Machado's party. Maduro refused to recognise the result and detained thousands of opponents. More on US-Venezuela crisis:US seizes Venezuelan oil tankerIs this how a war starts?Maduro ready for land strikes Protests have failed to dislodge him, although US president Donald Trump has stationed a massive naval force off the coast and has warned the Venezuelan leader his \"days are numbered\". Mr Trump had lobbied publicly to win this year's Nobel Prize himself, but rang Machado to congratulate her. Some members of Trump's administration had threatened the Nobel committee if he didn't win. Edmundo Gonzalez, who was at the ceremony in Oslo, has since gone into exile in Spain, but Machado has remained in Venezuela, spending most of her time in hiding. Her mother, sister and children have also travelled to Oslo to be reunited with her. The decision to travel to Norway is fraught with risk. Having successfully left the country, she faces a dangerous journey home again."
    },
    {
        "title": "CQC report raises pressure on NHS maternity services and will worry expectant mothers",
        "description": "The CQC report should make&#160;worrying&#160;reading for NHS leaders.&#160;",
        "url": "https://news.sky.com/story/cqc-report-raises-pressure-on-nhs-maternity-services-and-will-worry-expectant-mothers-13481894",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maternity-baby-birth_7106785.jpg?20251210192007",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-12-10 19:10:00",
        "Headline": "Small improvements are noted in areas such as communication and time given to expectant mothers' questions, but far too many women feel they are not listened to or were left alone at important times during labour.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  The CQC report should make worrying reading for NHS leaders.  It certainly does for expectant mothers and their loved ones. There have been marginal improvements (usually by one or two percentage points) in some areas of care, such as better communication around antenatal care or women being given enough time to ask questions about their pregnancies.  But what is clear is that far too many women felt they were not listened to or felt unsafe when left unattended at important times during labour. The most disappointing thing about these findings is that this is exactly what has been exposed during one maternity scandal after another. Mothers feeling unsafe, their worries brushed aside and having actions imposed on them without proper explanation. Sky News has been inundated by similar messages from mothers failed by NHS maternity services. \n                  One in five women in childbirth and labour feel concerns are not taken seriously\n                 \n                  Australian PM issues warning over under-16s social media ban\n                 \n                  There's one big problem with Australia's social media ban\n                  We analysed 169 birth trauma stories and one of the most common themes represented was people feeling like they were being ignored, neglected or left alone by medical staff, or that their feelings and experiences were being dismissed. Others said that staffing levels on maternity wards were not sufficient or that doctors, nurses and midwives were overstretched. Read more on maternity failings:Your birth stories'Nothing prepared me for this''We weren't listened to' Others mentioned being forced into surgery or other medical procedures either against their will or that they think contributed to worse health outcomes for either them or their child. Expectant mothers must not feel unsafe or feel that their unborn child will not receive the care they deserve. Each successive report draws the same conclusion. We know the problems. NHS maternity care needs urgent intervention."
    },
    {
        "title": "Peaky Blinders costumes land Afghan youths in trouble with the Taliban",
        "description": "Four Afghan youths who dressed up as the Peaky Blinders have been cautioned by the Taliban.",
        "url": "https://news.sky.com/story/peaky-blinders-costumes-land-afghan-youths-in-trouble-with-the-taliban-13481908",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peaky-blinders-afghanistan_7106823.png?20251210201754",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-10 20:09:00",
        "Headline": "The four young men became a hit on social media by evoking the fictional Shelby crime family with their dark suits, coats and flat caps.",
        "Content": "Four Afghan youths who dressed up as the Peaky Blinders have been cautioned by the Taliban. In posts on social media, the group pose in dark suits, coats and flat caps typical of the fictional Shelby crime family depicted in the drama. But now the men, aged in their early 20s, have been picked up by the ruling Taliban regime for wearing clothing \"in conflict with Afghan and Islamic values\". According to reports, the men are from Jebrael, in the western province of Herat. Saiful Islam Khyber, spokesman for the Taliban Ministry of the Propagation of Virtue and the Prevention of Vice, commented on the case. He posted on social media: \"They were then caught promoting screen culture and imitating film actors in Herat, and a program was started for their reform. \"Thank God, we Muslims and Afghans have our own religion, culture, and values. \n                  Is Trump's latest peace deal a total sham?\n                 \n                  In 'Little Kabul', Afghans feel they have to prove their US loyalty all over again\n                 \n                  Trump tells his immigration agents to target Somalians \n                 \"We have saved this country from the promotion of bad cultures through great sacrifices, and now we are defending it.\" However, speaking to CBS, he insisted that the young men were not arrested, \"only summoned and advised and released\". Videos of the group walking the streets of their hometown have collectively racked up more than a million views on TikTok. They were posted by one of the men using the name Thomas Shelby after Cillian Murphy's main character. Read more:Peaky Blinders film with Cillian Murphy announcedTaliban cuts internet and mobile phone signal across Afghanistan In a November interview on the YouTube channel Herat Mic, the young men said they had received largely positive feedback from local people. \"At first, we had our doubts, but as soon as we ventured outside, we found that people admired our style, approached us on the streets, and requested to take photos with us,\" Yaqoobi said. \"Despite a few negative remarks, our attention remained on the gratitude expressed towards us.\""
    },
    {
        "title": "'They know Britain is a soft country': The visa overstayers living under the radar",
        "description": "Ramesh lives in fear every day. A police siren is enough to alarm him.",
        "url": "https://news.sky.com/story/they-know-britain-is-a-soft-country-the-visa-overstayers-living-under-the-radar-13481811",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-teaser-visa-overstay_7106660.png?20251210151005",
        "type": "UK",
        "Author": "Lisa Holland",
        "Date Published": "2025-12-10 14:14:00",
        "Headline": "No data has been collated for five-and-a-half years on the number of visa of overstayers in Britain. But the picture painted by community leaders and lawyers is stark.",
        "Content": "\n          Communities correspondent\n              @LisaatSky\n  Ramesh lives in fear every day. A police siren is enough to alarm him. He's one of up to 400,000 visa overstayers in the UK, one lawyer we spoke to believes. It's only an estimate because the Home Office has stopped collecting figures - which were unreliable in the first place. Britain is being laughed at, one man told us, \"because they know it's a soft country\". We meet Ramesh (not his real name) at a Gurdwara, a Sikh place of worship, where he goes for food and support. He insists he can't return to India where he claims he was involved in political activism. Ramesh says he came to the UK on a student visa in 2023, but it was cancelled when he failed to continue his studies after being involved in a serious accident. He tells us he is doing cash-in-hand work for people who he knows through the community where he is living and is currently working on a house extension where he gets paid as little as £50 for nine hours labouring. \"It's very difficult for me to live in the UK without my Indian or Pakistani community - also because there are a lot of Pakistani people who give me work in their houses for cleaning and for household things,\" he adds. 'What will become of people like us?' Anike has lived in limbo for 12 years. Now living in Greater Manchester, she came to the UK from Nigeria when her sister Esther was diagnosed with a brain tumour - she had a multi-entry visa but was supposed to leave after three months. Esther had serious complications from brain surgery and says she is reliant on her sister for care. Immigration officials are in touch with her because she has to digitally sign in every month. Anike has had seven failed applications for leave to remain on compassionate grounds refused but is now desperate to have her status settled - afraid of the shifting public mood over migration. \"Everybody is thinking 'what will become of people like us?'\" she adds. 'It's a shambles' The government can't say with any degree of accuracy how many visa overstayers there are in Britain - no data has been collated for five-and-a-half years. But piecing together multiple accounts from community leaders and lawyers the picture we've built is stark. Immigration lawyer Harjap Singh Bhangal told us he believed there could be several hundred thousand visa overstayers currently in Britain. He says: \"At this time, there's definitely in excess of about 200,000 people overstaying in the UK. It might even be closer to 300,000, it could even be 400,000.\" Asked what evidence he has for this he replies: \"Every day I see at least one overstayer, any immigration lawyers like me see overstayers and that is the bulk of the work for immigration lawyers. \"The Home Office doesn't have any accurate data because we don't have exit controls. It's a shambles. It's an institution where every wall in the building is cracked.\" The number of those who are overstaying visas and working cash in hand is also virtually impossible to measure. 'They know Britain is a soft country' \"They're laughing at us because they know Britain is a soft country, where you won't be picked up easily,\" says the local man we've arranged to meet as part of our investigation. We're in Kingsbury in northwest London - an area which people say has been transformed over the past five years as post-Brexit visa opportunities opened up for people coming from South Asia. 'Mini-Mumbai' The man we're talking to lives in the community and helps with events here. He doesn't want to be identified but raises serious questions about visa abuse. \"Since the last five years, a huge amount of people have come in this country on this visiting visa, and they come with one thing in mind - to overstay and work in cash,\" he says. \"This area is easy to live in because they know they can survive. It looks like as if you are walking through mini-Mumbai.\"  'It's taxpayers who are paying' And he claims economic migrants are regularly arriving - who've paid strangers to pretend they're a friend or relative in order to obtain a visitor visa to get to Britain. He says: \"I've come across so many people who have come this way into this country. It's widespread. When I talk to these people, they literally tell me, 'Oh, someone is coming tomorrow, day after tomorrow, someone is coming'. \"Because they're hidden they may not be claiming benefits, but they can access emergency healthcare and their children can go to school. \"And who is paying for it? It's the taxpayers who are paying for all this,\" says the man we've met in north London. Read more from Sky News:Net migration figures hit four-year lowHow Denmark may inspire UK asylum reforms A Home Office spokesperson said: \"We will not tolerate any abuse of our immigration system and anyone found to be breaking the rules will be liable to have enforcement action taken against them. \"In the first year of this government, we have returned 35,000 people with no right to be here - a 13% rise compared to the previous year. \"Arrests and raids for illegal working have soared to their highest levels since records began, up 63% and 51%.\""
    },
    {
        "title": "The government doesn't know how many people are overstaying their visas - here's why",
        "description": "The government can't say with accuracy how many visa overstayers there are in Britain - no data has been collated for five-and-a-half years.",
        "url": "https://news.sky.com/story/the-government-doesnt-know-how-many-people-are-overstaying-their-visas-heres-why-13481844",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-border-control-immigration_7093574.jpg?20251127151213",
        "type": "UK",
        "Author": "Daniel Dunford",
        "Date Published": "2025-12-10 16:13:00",
        "Headline": "The Home Office's old method of tracking visa overstayers wasn't perfect, but now there's no such system in place at all.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n The government can't say with accuracy how many visa overstayers there are in Britain - no data has been collated for five-and-a-half years. Sky News has spoken to immigration lawyers about the numbers, and one believes there could be as many as 400,000 living across the country.  Why doesn't the government know? The Home Office used to gather data on visa overstayers by effectively checking a list of passport numbers associated with visas against a list of passport numbers of people leaving the UK, taken from airlines and other international travel providers. If there was a passport number match in the arrivals and departures part of their database, that person was recorded to have left when they should have. If there wasn't, they were a potential overstayer. They stopped producing the figures because a combination of Brexit and COVID added complications that made the Home Office conclude they wouldn't be able to get to a reliable number using the same method. It's now four and a half years since EU citizens had freedom of movement to the UK revoked, and more than three and a half years since pandemic-era travel restrictions ended. And yet we are still waiting to see what a new method might look like. Read more from Sky News:Is this what the beginning of a war looks like?There's one big problem with Australia's social media ban The old method wasn't perfect. If someone changed their passport while in the UK, for example, or if the airline or individual entered the number wrong when they were leaving, there wouldn't be a match. The Home Office regarded the statistics as likely overestimating the true number of overstayers, and the Office for National Statistics designated the figures as \"experimental\" rather than \"official\" statistics, meaning the conclusions should be treated with caution. But they were a reasonable best guess. With all that in mind, between April 2016 and March 2020 upwards of 250,000 people were flagged as potential overstayers, equivalent to 63,000 per year. That's more than the 190,000 people who are recorded to have arrived in the UK on small boats since 2018. It represents 3.5% of the seven million visas that expired over that period, so at least 96.5% of people left when they should. Other Home Office data reveals that more than 13 million visas were issued between 2020 and the end of June 2025, including a record 3.4 million in 2023. But what we don't know is how many have expired, which means it's difficult for us to even guess how many people might have overstayed."
    },
    {
        "title": "British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies",
        "description": "Tributes have been paid to a British soldier killed in Ukraine, as the country's allies prepare for talks before a crucial potential meeting with Donald Trump.",
        "url": "https://news.sky.com/story/exceptional-british-soldier-killed-in-ukraine-accident-pictured-13481870",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-russia-george-hooley_7106718.jpg?20251210170832",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-10 17:52:00",
        "Headline": "Lance Corporal George Hooley, 28, died on Tuesday. The UK has been one of Ukraine's biggest backers - and that support will again come into play on Thursday as European leaders scramble to keep Donald Trump on side.",
        "Content": " Tributes have been paid to a British soldier killed in Ukraine, as the country's allies prepare for talks before a crucial potential meeting with Donald Trump. Lance Corporal George Hooley, 28, has been named as the paratrooper who died in a \"tragic accident\" on Tuesday while observing Ukrainian forces testing a new defensive capability away from the frontline. The Ministry of Defence (MoD) said he joined the army in November 2015 and was \"an exceptional soldier\". Defence Secretary John Healey said he \"served our country with distinction and professionalism\" and \"will be very deeply missed\". He added: \"George's tragic death reminds us of the courage and commitment with which our outstanding armed forces serve every day to protect our nation.\" Coalition of the willing to meet Britain has been one of Ukraine's biggest backers since Russia launched its full-scale invasion in February 2022, and that support will again come into play on Thursday. Volodymyr Zelenskyy will hold a virtual meeting with members of the self-styled coalition of the willing, after reports Kyiv has handed its revised peace deal proposal to US negotiators. Mr Zelenskyy said the revised proposal has 20 points, after some \"obvious anti-Ukrainian points were removed\". The original US draft proposal had 28 points, and was seen as favouring Russia. Read more: Trump's 28-point Ukraine peace plan in full  Zelenskyy hopeful of progress Ukraine has sought to change some key clauses, such as territorial issues and security guarantees, following talks with US and European negotiators. In his nightly address on Wednesday, Mr Zelenskyy said his country is also drafting two additional documents: the first regarding US security guarantees and the second on the economy and reconstruction. He said Kyiv's peace delegation held a \"productive conversation\" with the US earlier, and \"discussed key issues for recovery, various mechanisms, and visions of reconstruction\". He also revealed he discussed the possibility of holding elections with Ukraine's parliament, but that holding elections under martial law was not easy. Trump has 'strong words' with European leaders It comes after Donald Trump used an interview with Politico to accuse Mr Zelenskyy of \"using war\" to avoid holding elections. The US president also claimed his Ukrainian counterpart had not read the original 28-point peace plan. Mr Trump held a call with coalition of the willing members Sir Keir Starmer, Emmanuel Macron, ad Friedrich Merz on Wednesday, and said some \"pretty strong words\" were exchanged. Earlier this week, he called Europe's leaders \"weak\" and criticising them for failing to end the war.  Speaking at the White House on Wednesday, Mr Trump said Mr Zelenskyy was keen on a meeting involving him and European leaders this weekend, but warned his attendance will be \"based on what they come back with\". Today's virtual meeting comes days after Sir Keir hosted Mr Zelenskyy, Mr Macron and Mr Merz in Downing Street.  The period of intense diplomacy comes as the fighting continues on the ground in Ukraine. Its military says it's still fending off a Russian assault launched on the key city of Pokrovsk, while energy infrastructure has been targeted by drones in southern Odesa."
    },
    {
        "title": "Sharaz Ali found guilty of murdering ex-partner's sister and her three children in Bradford house fire",
        "description": "A man has been found guilty of murdering his ex-partner's sister and her three children in a house fire. ",
        "url": "https://news.sky.com/story/man-found-guilty-of-murdering-ex-partners-sister-and-her-three-children-in-bradford-house-fire-13481276",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sharaz-ali-murder_7106516.jpg?20251210121944",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-10 11:40:00",
        "Headline": "Bryonie Gawith, 29, and her children Denisty Birtle, nine, Oscar Birtle, five, and 22-month-old Aubree Birtle died in the blaze in Bradford.",
        "Content": " A man has been found guilty of murdering his ex-partner's sister and her three children in a house fire.  Prosecutors said Sharaz Ali, 40, was \"motivated by jealousy and fuelled by drink and drugs\" when he set fire to Bryonie Gawith's home early on 21 August last year. Jurors heard that Ali went to the home in Westbury Road, Bradford, aiming to \"take revenge\" on his ex, Antonia Gawith, who was staying there after ending their \"abusive\" seven-year relationship earlier that month.  Antonia Gawith managed to escape, but Bryonie Gawith, 29, and her children Denisty Birtle, nine, Oscar Birtle, five, and 22-month-old Aubree Birtle died in the blaze. Ali told a jury he had no intention of harming others when the house went up in flames, saying: \"I didn't want to hurt anyone but myself.\" But after a trial at Doncaster Crown Court, he was found guilty of four counts of murder and attempting to murder Antonia Gawith. Calum Sunderland, 26, who went with Ali to the house and kicked the door in for him, was found guilty of the manslaughter of Bryonie Gawith and her three children, but cleared of the more serious charges of murder. He was also cleared of attempted murder, and an alternative count of attempting to cause grievous bodily harm, in relation to Antonia Gawith. Mohammed Shabir, 45, who had also been due to go on trial, died of a heart attack in October after collapsing in prison. Reading a statement on behalf of her family outside court, Antonia Gawith said her sister, nieces and nephew's futures have been \"stolen\". \"Even with justice, nothing will ever make this right,\" she said. \"Nothing will ever fill the silence where their laughter should be. Nothing will ever bring back our family. \"We will forever carry this brokenness, and yet we will hold on to them tightly in only ways we can now, through our memories, our photos and our precious videos. Those are all we have left now.\" After the verdicts, the judge, Mr Justice Hilliard, thanked jurors and said the case had been \"distressing beyond measure - three children and their mother murdered\". \"I don't think anyone who heard Antonia's desperate cries for help will ever forget them,\" he said. \"These are truly dreadful crimes.\" The judge also praised the \"extraordinary bravery\" of those who tried to save the children trapped in the house. Ali and Sunderland, a convicted arsonist, were driven to the house by Shabir, stopping on the way to fill a seven-litre canister with petrol, the court heard. Doorbell footage captured Ali telling Sunderland, who was carrying the petrol and a lighter, to \"kick the door in\", which he did before running back to the car. Antonia Gawith said she saw an \"angry\" Ali run into the house and begin pouring petrol on her while shouting before setting himself and the house on fire. 'I couldn't save them'  In a video interview played to jurors, she sobbed as she told police how she \"couldn't save\" her sister, nieces and nephew, as she tried frantically to get back in the house through the back door. \"I was just screaming, trying to get back in the house and I couldn't get in. I couldn't save them,\" she said. Read more from Sky News:'Depraved predator' jailed for rapes and sexual assaultsBritish soldier who died in Ukraine named West Yorkshire Police's Detective Chief Inspector Stacey Atkinson said: \"Bryonie and her three children would still be alive today if it wasn't for the horrific and truly callous actions of Ali and Sunderland that day. \"They left a mum and her three children completely helpless whilst her sister and their auntie watched on in horror.\"Our thoughts and sympathies are with the family, who despite their immense strength of character now face the rest of their lives without them.\" Senior Crown Prosecution Service prosecutor Amanda McInnes said Ali was a \"selfish killer who had no regard for anyone but himself\". \"He was motivated by jealousy and his actions have now needlessly robbed a family of their loved ones,\" she said.\"Both men played their role and caused the deaths of a young family who should still be with us today.\""
    },
    {
        "title": "How an 'outstanding' school humiliated pupils with harsh and harmful discipline",
        "description": "Mossbourne Victoria Park Academy, an \"outstanding\" secondary in east London, humiliated pupils with harsh and harmful discipline; a damning safeguarding review has found.  ",
        "url": "https://news.sky.com/story/how-an-outstanding-school-humiliated-pupils-with-harsh-and-harmful-discipline-13481723",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mossbourne-victoria-park_7106733.jpg?20251210174416",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-12-10 10:39:00",
        "Headline": "Success at high-performing Mossbourne Victoria Park Academy in Hackney, London,  was achieved \"at too high a cost for some pupils\", a safeguarding review has found.",
        "Content": "\n          Education reporter\n       Mossbourne Victoria Park Academy, an \"outstanding\" secondary in east London, humiliated pupils with harsh and harmful discipline; a damning safeguarding review has found.   Students at the Hackney school have been intimidated and shamed, according to the review led by Sir Alan Wood, a former director of children's services in the same London borough. It found there was \"public humiliation\" of pupils with shouting that was \"routine\" and used \"in a manner that humiliates and intimidates\". \"While these practices have the potential to impact any pupil, for a significant minority who are more vulnerable, have Special Educational Needs and Disabilities (SEND), or struggle to conform to an inflexible system, the school's approach to discipline has been particularly harmful,\" Sir Alan writes. His review found a \"stark contrast between the school's demonstrable success - exemplary academic results, strong attendance, and fervent support from most parents - and serious, persistent concerns being raised from a wide range of stakeholders about a harsh and damaging disciplinary culture\". Under Ofsted's former grading system, the school was rated \"outstanding\" across all areas at its most recent inspection by the watchdog in 2023. But the review found that this success came at a price. \n                  Children's home providers putting profit ahead of need, warns Ofsted\n                 \n                  Calls to trial four-day week for schools to boost teacher recruitment and retention\n                 \n                  Proposals tabled for schools in Scotland to move to four-day teaching weeks\n                 It quotes one former pupil saying: \"During year 9 I started to self-harm because the teachers made me feel as though I didn't deserve to live because of my grades.\" Sir Alan highlights the practice of \"desking\", used at the 11-16 school. \"Pupils are placed at desks in corridors as a punishment for minor infractions,\" he writes. \"This is isolating, shaming, and educationally unproductive, with no data collected to monitor how this sanction is used, its effectiveness and whether there is any disproportionate impact.\" His review warns: \"The leadership's defensive posture and the failure of governors to hold them accountable have allowed harmful practices to persist unchecked. \"In essence, the review finds that [the academy's] success has been achieved at too high a cost for some pupils.\" None of the evidence found by the review suggested that staff had not carried out their child protection responsibilities or failed in their performance. But the review made recommendations around complaints and communication with parents, that the has school accepted. The Mossbourne Federation, the trust that runs the academy, said the review was \"being considered carefully and in detail\" and it would reflect on \"a number of issues\" it raised. Read more:Children's home providers putting profit ahead of needFinal days of girl in care  A Department for Education spokesperson said the findings were \"serious and deeply concerning\". They said that school behaviour policies should promote respect and a positive environment, and that the department would continue to engage with the trust to ensure changes needed are implemented."
    },
    {
        "title": "CQC report raises pressure on NHS maternity services and will worry expectant mothers",
        "description": "The CQC report should make&#160;worrying&#160;reading for NHS leaders.&#160;",
        "url": "https://news.sky.com/story/cqc-report-raises-pressure-on-nhs-maternity-services-and-will-worry-expectant-mothers-13481894",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-maternity-baby-birth_7106785.jpg?20251210192007",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-12-10 19:10:00",
        "Headline": "Small improvements are noted in areas such as communication and time given to expectant mothers' questions, but far too many women feel they are not listened to or were left alone at important times during labour.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  The CQC report should make worrying reading for NHS leaders.  It certainly does for expectant mothers and their loved ones. There have been marginal improvements (usually by one or two percentage points) in some areas of care, such as better communication around antenatal care or women being given enough time to ask questions about their pregnancies.  But what is clear is that far too many women felt they were not listened to or felt unsafe when left unattended at important times during labour. The most disappointing thing about these findings is that this is exactly what has been exposed during one maternity scandal after another. Mothers feeling unsafe, their worries brushed aside and having actions imposed on them without proper explanation. Sky News has been inundated by similar messages from mothers failed by NHS maternity services. \n                  One in five women in childbirth and labour feel concerns are not taken seriously\n                 \n                  Australian PM issues warning over under-16s social media ban\n                 \n                  There's one big problem with Australia's social media ban\n                  We analysed 169 birth trauma stories and one of the most common themes represented was people feeling like they were being ignored, neglected or left alone by medical staff, or that their feelings and experiences were being dismissed. Others said that staffing levels on maternity wards were not sufficient or that doctors, nurses and midwives were overstretched. Read more on maternity failings:Your birth stories'Nothing prepared me for this''We weren't listened to' Others mentioned being forced into surgery or other medical procedures either against their will or that they think contributed to worse health outcomes for either them or their child. Expectant mothers must not feel unsafe or feel that their unborn child will not receive the care they deserve. Each successive report draws the same conclusion. We know the problems. NHS maternity care needs urgent intervention."
    },
    {
        "title": "Five Palestine Action prisoners taken to hospital as hunger strike continues",
        "description": "Five Palestine Action prisoners awaiting trial have been taken to hospital as a result of hunger strikes, lawyers representing them told the justice secretary in a letter shared with Sky News.",
        "url": "https://news.sky.com/story/five-palestine-action-prisoners-taken-to-hospital-as-hunger-strike-continues-13481923",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-palestine-action-protest_7106920.jpg?20251210215147",
        "type": "UK",
        "Author": "Sadiya Chowdhury",
        "Date Published": "2025-12-10 20:45:00",
        "Headline": "A letter describes the deteriorating health of prisoners Kamran Ahmed, Qesser Zuhrah, and Amy Gardiner-Gibson as their hunger strike continues.",
        "Content": "\n          News correspondent\n              @esadiya\n Five Palestine Action prisoners awaiting trial have been taken to hospital as a result of hunger strikes, lawyers representing them told the justice secretary in a letter shared with Sky News. A total of eight prisoners are currently taking part in the action, thought to be the UK's biggest hunger strike since 1981, with two now on day 38 without food, according to the letter. It says prisoner Kamran Ahmed has been on hunger strike for 31 days, having spent a year on remand awaiting trial, and that he has been taken to hospital twice since collapsing in his cell on November 21. Sky News understands his latest admission was on Monday evening. His sister Shahmina Alam told Sky News her family fears \"the worst call\". \"I don't sleep through the night because I'm constantly anticipating a call - the worst call you can get,\" she said, holding back tears. \"I feel like that's the only point when we're going to receive any information about how he's doing. I'm having palpitations all the time.\" Asked what the worst call is, Shahmina says: \"That he hasn't made it.\" Shahmima told Sky News that Kamran, 28, was an emergency on-call mechanic before his arrest in November 2024. She added that his lengthy imprisonment is taking a toll on their parents. \n                  Gaza ceasefire negotiations at 'critical moment', says Qatar PM\n                 \n                  12-year-old girl from Gaza receives vital brain operation after Israeli bombing near her home\n                 \n                  Gaza longs for normality, but quasi-anarchy reigns and Hamas is once again exerting control\n                 She said: \"I found my dad with a puffy face for the last two mornings because he's been crying. My mum seems lost. A lot of us are just broken apart. We're shattered, physically and mentally. There's an element of constantly being on edge because we don't know what's happening to him. \"Everyone's immediate reaction when they hear a family member is in hospital is to go and see them, speak to them, see how they're doing and give them comfort, and we've been restricted from that.\" The letter from law firm Imran Khan & Partners criticises prison conditions and warns of a \"real and increasingly likely potential that young British citizens will die in prison, having never been convicted of an offence\". It describes Qesser Zuhrah, on day 38 of her strike, as having a pulse rate above 100 beats per minute despite next to no physical activity. Amy Gardiner-Gibson, also on day 38, is described as experiencing twitching in her muscles and being offered a wheelchair due to her inability to walk. Read more:Nearly 500 arrested at pro-Palestine protest in LondonPalestine Action can challenge terror ban after court verdict Qesser Zuhrah faces the same charges as Kamran, for the same alleged incident. Amy Gardiner-Gibson is alleged to have participated in a break-in at RAF Brize Norton in Oxfordshire in June this year. She is charged with conspiracy to commit criminal damage, and conspiracy to enter a prohibited place knowingly for a purpose prejudicial to the safety or interests of the UK. The letter says Kamran Ahmed has been in hospital repeatedly with dangerous ketone levels after collapsing on 21 November and that he suffers with dizziness, shallow breath and a tightness in his chest. Mr Ahmed has lost over 10 kilograms in weight, it adds. \"He collapsed in his cell,\" Shamima told Sky News. \"He is not sure how long he passed out for, but he hit his back and head on the metal frame of his bed.\" \"When he was hospitalised he was allowed one call. He sounded really emotional on the phone but it seemed like he wasn't able to talk about anything else or had been instructed not to talk about anything else. Since then, we haven't heard from him and haven't been able to get any updates on him.\" Criticising the lack of engagement from the government, Labour MP John McDonnell raised a point of order in the House of Commons on Wednesday saying that the justice secretary had failed to respond to previous letters on the matter. He said: \"This is a matter of urgency and I would've expected at least the courtesy of some response even if he's not willing to meet us.\" Speaker Sir Lindsay Hoyle responded: \"It is totally unacceptable.\" Palestine Action told Sky News that all eight prisoners on hunger strike are accused of offences occurring before the group was proscribed and will have been in prison for well over a year before they are tried. A judicial review challenge to the proscription has concluded with judges reserving their decision until a later date. MP and co-founder of Your Party, Jeremy Corbyn, told Sky News that Deputy Prime Minister David Lammy rejected his invitation to meet to resolve the matter by saying \"considering the ongoing proceedings, it would not be appropriate for me to meet with you to discuss the situation.\" The response forwarded to Sky News by Mr Corbyn also assures him \"the safety of those who live and work in our prisons remains our paramount concern\". Sky News has contacted the Ministry of Justice for comment."
    },
    {
        "title": "Sophie Kinsella, author of Shopaholic series of novels, dies aged 55",
        "description": "Sophie Kinsella, the author of the Shopaholic series of novels, has died aged 55, her family have said.",
        "url": "https://news.sky.com/story/sophie-kinsella-author-of-shopaholic-series-of-novels-dies-aged-55-13481772",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sophie-kinsella-author_7106545.jpg?20251211005423",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-10 12:48:00",
        "Headline": "The writer, whose real name was Madeleine Sophie Wickham, revealed last year that she had been diagnosed with an aggressive form of brain cancer in 2022.",
        "Content": " Sophie Kinsella, the author of the Shopaholic series of novels, has died aged 55, her family have said. The writer, whose real name was Madeleine Sophie Wickham, revealed last year she had been diagnosed with an aggressive form of brain cancer in 2022. A statement posted to her Instagram account read: \"We are heartbroken to announce the passing this morning of our beloved Sophie (aka Maddy, aka Mummy). She died peacefully, with her final days filled with her true loves: family and music and warmth and Christmas and joy. \"We can't imagine what life will be like without her radiance and love of life. \"Despite her illness, which she bore with unimaginable courage, Sophie counted herself truly blessed - to have such wonderful family and friends, and to have had the extraordinary success of her writing career. She took nothing for granted and was forever grateful for the love she received. \"She will be missed so much our hearts are breaking.\" Kinsella's novels have sold more than 45 million copies in more than 60 countries, and have been translated into more than 40 languages. \n                  Iceland to boycott Eurovision over Israel's participation\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Why is Warner Bros for sale, what are the controversial bids – and how is Trump involved?\n                 In April 2024, she revealed she had been diagnosed with an aggressive form of brain cancer in 2022. In a post on social media, Kinsella said she had been receiving chemotherapy and radiotherapy at London's University College Hospital, and had undergone \"successful\" surgery. She said she \"wanted for a long time to share with you a health update and I've been waiting for the strength to do so\". \"At the end of 2022 I was diagnosed with glioblastoma, a form of aggressive brain cancer,\" she said. \"I did not share this before because I wanted to make sure that my children were able to hear and process the news in privacy and adapt to our 'new normal'. \"At the moment all is stable and I am feeling generally very well, though I get very tired and my memory is even worse than it was before! \"I am so grateful to my family and close friends who have been an incredible support to me, and to the wonderful doctors and nurses who have treated me.\" Kinsella's most recent book is What Does it Feel Like?, published in October 2024 and which \"is fiction, but it is my most autobiographical work to date\", the author wrote on her website. Read more:'Unacceptable' prostate supplement adverts bannedDavid Cameron reveals he has been treated for prostate cancer Other books by the London-born author include The Burnout, released in October 2023, Can You Keep A Secret? and The Undomestic Goddess. The first two novels in her hit eight-book Shopaholic series, The Secret Dreamworld Of A Shopaholic and Shopaholic Abroad, were adapted into the 2009 film Confessions Of A Shopaholic, starring Isla Fisher. She is survived by her children, four sons and a daughter, and her husband Henry Wickham. Author Jojo Moyes, who was friends with Kinsella for decades, told the UK Tonight With Sarah-Jane Mee her characters \"were flawed and messy but they were also relatable and you always finished a Sophie Kinsella book feeling better about yourself\". Describing her mentor as \"graceful\", \"kind\" and \"encouraging\", she said those who knew her \"will always be grateful to have had her in our lives. \"If the thing that you are remembered for is joy and grace and kindness, as well as your talent, what more can any of us ask?\" Bill Scott-Kerr, publisher at Transworld, the publishing home of Kinsella for the past 30 years, said: \"She has been such an unshakeable pillar of our publishing at Transworld for so many years that the thought of a year without a Sophie Kinsella to publish is inconceivable.\" He added: \"Maddy leaves behind a glorious and indelible legacy: a unique voice, an unquenchable spirit, a goodness of intent and a body of work that will continue to inspire us to reach higher and be better, just like so many of her characters. \"On a personal level Maddy was the embodiment of joy, an extraordinarily clever, funny, sassy, impish, kind and generous collaborator who brought light into our lives. She was as part of this company as anyone, and we will all truly miss her.\""
    },
    {
        "title": "GCHQ releases annual Christmas puzzle - can you solve it?",
        "description": "GCHQ has released its annual Christmas challenge, with seven puzzles aimed to put the nation's codebreaking skills to the test.",
        "url": "https://news.sky.com/story/gchq-releases-annual-christmas-puzzle-can-you-solve-it-13481794",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gchq-christmas-challenge_7106642.jpg?20251210145615",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-10 13:33:00",
        "Headline": "The puzzles are geared towards testing a range of skills that the UK's intelligence agency uses every day to keep the country safe.",
        "Content": "GCHQ has released its annual Christmas challenge, with seven puzzles aimed to put the nation's codebreaking skills to the test. Devised by in-house puzzlers at the UK's intelligence agency, the challenge is geared towards testing a range of skills to unlock a festive message. This year, for the first time, extra puzzles feature on the front of the card. These were designed by three schoolchildren, after more than 500 children entered the agency's competition to hunt down the best budding spies. Some challenges involve codebreaking, maths and analysis, while others test skills including lateral thinking, ingenuity and perseverance - the same blend of skills GCHQ said are used every day to keep the country safe. However \"no one will find them easy\", the agency's chief puzzler - known only as Colin - said. The Christmas card competition tasked schoolchildren with answering the question: 'What do you think GCHQ looks like on Christmas Day?' as well as putting hidden codes and puzzles into their designs. The winning designs came from Haoran, a year 8 student from Wilson's School in London, Mariia, a year 10 student at the Henry Beaufort School in Winchester, and year 12 student Amelie from South Wilts Grammar School in Salisbury. GCHQ director Anne Keast-Butler, was one of those tasked with picking the winners. She said she hopes the challenge will \"inspire the next generation to explore STEM subjects and consider the rewarding careers available in cybersecurity and intelligence\". Read more from Sky News:Author Sophie Kinsella diesStorm Bram brings winds, rain and flooding to parts of UK This year's Christmas cards - and challenges - are available to download from GCHQ.gov.uk. Answers will be published by the intelligence agency at 9pm on Wednesday 10 December."
    },
    {
        "title": "Attacks on men in Bristol park 'could be homophobic', say police as patrols stepped up",
        "description": "Police in Bristol are investigating a series of late-night attacks on men that they said \"may be homophobic in nature\".",
        "url": "https://news.sky.com/story/attacks-on-men-in-bristol-park-could-be-homophobic-say-police-as-patrols-stepped-up-13481854",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-castle-park-bristol_7106703.jpg?20251210164545",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-10 16:45:00",
        "Headline": "The incidents, which occurred late at night in the city centre park between 30 November and 5 December, are being linked by detectives, who arrested a 32-year-old man on suspicion of assault.",
        "Content": "Police in Bristol are investigating a series of late-night attacks on men that they said \"may be homophobic in nature\". The incidents in Castle Park, in Bristol city centre, happened between 30 November and 5 December, Avon and Somerset Police said on Wednesday. A man in his 30s was treated in hospital after being struck on the head in the most recent incident, the force said. A 32-year-old man has been arrested on suspicion of assault in connection with the incident, and released on police bail. The attacks began when a man in his 40s was hit on the head after being approached by two unidentified men who shone a light in his eyes at around 1.15am on 30 November. He suffered injuries to his wrist, back, shoulder and head. Two reports of similar incidents were made in the early hours of 3 December, between 12.30am and 1.30am. \n                  Seven men charged after investigation into child sexual exploitation in Bristol\n                 \n                  Man who killed couple and took bodies in suitcases to Bristol Clifton Suspension Bridge jailed for minimum of 42 years\n                 \n                  Man arrested after school coach crashes into ditch in Hampshire\n                 The victims, aged in their 20s and 40s, are not believed to have needed medical treatment for their injuries. A spokesman for the force, speaking about the attacks, said \"officers are concerned they may be homophobic in nature\". He said descriptions of the suspects were limited due to the time of night, but they are believed to be two males - one white - who were wearing face coverings and dark clothing. Members of the public are urged to remain \"vigilant\" in the area after dark, he said. Detective Inspector Alistair Norman, who is leading the investigation into the \"concerning incidents\", said that while detectives are \"open-minded\" about the investigation and the motivation for the assaults, they \"are currently treating these incidents as linked\". CCTV footage has been examined while interviews, and local inquiries have taken place. Read more from Sky News:'Depraved predator' jailed for rapesBritish soldier who died in Ukraine named Chief Inspector John Shaddick said: \"We understand this update will be distressing for members of our community. There is no place for hate crime in our city, and we will not tolerate such behaviour. \"We are taking matters of public safety in and around Castle Park, and the wider city centre, very seriously\", he said, including consulting with local LGBTQ+ leaders. \"We have implemented a number of measures, including the use of our mounted team, dog units and increased regular foot patrols, to enhance visibility, engagement and to deter further criminal activity.\""
    },
    {
        "title": "US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela",
        "description": "Venezuela has accused the US of \"piracy\" after an oil tanker was seized off the country's coast.",
        "url": "https://news.sky.com/story/us-forces-seize-oil-tanker-off-coast-of-venezuela-reports-13481897",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-venezuela-oil-tanker_7106954.png?20251210221322",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 19:36:00",
        "Headline": "Dramatic footage released by the president's attorney general appears to show US troops descending on to the ship from helicopters, armed with weaponry.",
        "Content": " Venezuela has accused the US of \"piracy\" after an oil tanker was seized off the country's coast. Donald Trump announced the operation had taken place during a meeting of business leaders at the White House, telling reporters: \"We've just seized a tanker on the coast of Venezuela, a large tanker, very large, largest one ever seized, actually.\" Attorney General Pam Bondi shared a video of the operation, revealing the FBI, Homeland Security, US Coast Guard, and Department of Defence were involved. She said the US forces \"executed a seizure warrant for a crude oil tanker used to transport sanctioned oil from Venezuela and Iran\". Venezuela's government said the seizure \"constitutes a blatant theft and an act of international piracy.\" Ms Bondi said the seized vessel - believed to be a tanker named Skipper - has been sanctioned by the US for many years \"due to its involvement in an illicit oil shipping network supporting foreign terrorist organisations\". She did not name the vessel, what flag it sailed under, or exactly where the incident took place. UK maritime risk management group Vanguard said that the tanker Skipper - which the US sanctioned for alleged involvement in Iranian oil trading under the name Adisa - was believed to be the target. Trump offers ominous commentary Without giving additional information on the operation, Mr Trump added during the White House meeting that \"other things are happening\". Later, Mr Trump said the tanker was \"seized for a very good reason\", and when asked what will happen to the oil on board, he added: \"Well, we keep it, I suppose.\"  How did we get here? It marks another escalation from the US after months of pressure on Venezuelan President Nicolas Maduro. The White House accuses Mr Maduro of presiding over a narcotrafficking operation in Venezuela, which he denies. The US has escalated military deployments against the Latin American country over the last few months, with the president suggesting American forces could launch a land attack. Speaking to Politico on Tuesday, Mr Trump declined to comment on whether US troops would enter Venezuela, but warned Mr Maduro's \"days are numbered\". On 2 September, the White House posted on X that it had conducted a strike against so-called \"narcoterrorists\" shipping fentanyl to the US, without providing direct evidence of the alleged crime. Sky News has verified that in the past four months, 23 boats have been targeted in 22 strikes, killing 87 people. Read more: Is this what the beginning of a war looks like? US correspondent The seizing of an oil tanker off the coast of Venezuela is a significant escalation in US tactics. By targeting an oil shipment, rather than a suspected drug boat, Washington has signalled its willingness to disrupt exports. President Trump seems determined to shut down one of the last major sources of funding for Nicholas Maduro’s embattled government. Nine months ago, Trump imposed a 25% tariff on all goods imported into the US from any country buying oil or gas from Venezuela. This is even more aggressive and will be viewed in Caracas as a direct threat to the country’s economy and sovereignty. The interception of the tanker raises more questions about international maritime law and the reach of US enforcement powers. In the space of four months, the US has bombed 23 boats, killing 87 people, accusing the occupants of being \"narco-terrorists\". It will also fuel speculation that airstrikes are imminent, President Trump having posted two weeks ago that he had closed the airspace. Venezuela: 'It has always been about our oil' The Maduro government describes America's actions as a grab for Venezuela's oil reserves, which are among the biggest in the world. At a rally before a ruling-party-organised demonstration in Caracas on Wednesday, Mr Maduro did not address the seizure but told supporters Venezuela is \"prepared to break the teeth of the North American empire if necessary\". Flanked by senior officials, he said that only the ruling party can \"guarantee peace, stability, and the harmonious development of Venezuela, South America and the Caribbean\". His government did issue a statement, accusing the US of \"piracy\" and \"imperial abuses\". Of the US campaign, it said: \"It has always been about our natural resources, our oil, our energy, the resources that belong exclusively to the Venezuelan people.\" Read more on Venezuela:Hegseth cites 'fog of war' defenceUS aircraft carrier close to Venezuela  Is military confrontation possible? Geoffrey Corn, director of the Centre for Military Law at Texas Tech University, told Sky's Mark Austin on The World that Mr Trump's remarks on land strikes \"ostensibly\" refer to drug cartel members. Formerly a senior adviser to the US army on warfare law, Mr Corn added: \"That could very easily provide the pretext for some confrontation between Venezuelan armed forces and US armed forces. \"And then that would open the door to a broader campaign to basically negate the power of the Venezuelan military.\""
    },
    {
        "title": "British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies",
        "description": "Tributes have been paid to a British soldier killed in Ukraine, as the country's allies prepare for talks before a crucial potential meeting with Donald Trump.",
        "url": "https://news.sky.com/story/exceptional-british-soldier-killed-in-ukraine-accident-pictured-13481870",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-russia-george-hooley_7106718.jpg?20251210170832",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 17:52:00",
        "Headline": "Lance Corporal George Hooley, 28, died on Tuesday. The UK has been one of Ukraine's biggest backers - and that support will again come into play on Thursday as European leaders scramble to keep Donald Trump on side.",
        "Content": " Tributes have been paid to a British soldier killed in Ukraine, as the country's allies prepare for talks before a crucial potential meeting with Donald Trump. Lance Corporal George Hooley, 28, has been named as the paratrooper who died in a \"tragic accident\" on Tuesday while observing Ukrainian forces testing a new defensive capability away from the frontline. The Ministry of Defence (MoD) said he joined the army in November 2015 and was \"an exceptional soldier\". Defence Secretary John Healey said he \"served our country with distinction and professionalism\" and \"will be very deeply missed\". He added: \"George's tragic death reminds us of the courage and commitment with which our outstanding armed forces serve every day to protect our nation.\" Coalition of the willing to meet Britain has been one of Ukraine's biggest backers since Russia launched its full-scale invasion in February 2022, and that support will again come into play on Thursday. Volodymyr Zelenskyy will hold a virtual meeting with members of the self-styled coalition of the willing, after reports Kyiv has handed its revised peace deal proposal to US negotiators. Mr Zelenskyy said the revised proposal has 20 points, after some \"obvious anti-Ukrainian points were removed\". The original US draft proposal had 28 points, and was seen as favouring Russia. Read more: Trump's 28-point Ukraine peace plan in full  Zelenskyy hopeful of progress Ukraine has sought to change some key clauses, such as territorial issues and security guarantees, following talks with US and European negotiators. In his nightly address on Wednesday, Mr Zelenskyy said his country is also drafting two additional documents: the first regarding US security guarantees and the second on the economy and reconstruction. He said Kyiv's peace delegation held a \"productive conversation\" with the US earlier, and \"discussed key issues for recovery, various mechanisms, and visions of reconstruction\". He also revealed he discussed the possibility of holding elections with Ukraine's parliament, but that holding elections under martial law was not easy. Trump has 'strong words' with European leaders It comes after Donald Trump used an interview with Politico to accuse Mr Zelenskyy of \"using war\" to avoid holding elections. The US president also claimed his Ukrainian counterpart had not read the original 28-point peace plan. Mr Trump held a call with coalition of the willing members Sir Keir Starmer, Emmanuel Macron, ad Friedrich Merz on Wednesday, and said some \"pretty strong words\" were exchanged. Earlier this week, he called Europe's leaders \"weak\" and criticising them for failing to end the war.  Speaking at the White House on Wednesday, Mr Trump said Mr Zelenskyy was keen on a meeting involving him and European leaders this weekend, but warned his attendance will be \"based on what they come back with\". Today's virtual meeting comes days after Sir Keir hosted Mr Zelenskyy, Mr Macron and Mr Merz in Downing Street.  The period of intense diplomacy comes as the fighting continues on the ground in Ukraine. Its military says it's still fending off a Russian assault launched on the key city of Pokrovsk, while energy infrastructure has been targeted by drones in southern Odesa."
    },
    {
        "title": "Maria Corina Machado missed the ceremony, but the Nobel Peace Prize winner is heading to Oslo after 'extraordinary' day",
        "description": "The Venezuelan opposition leader Maria Corina Machado didn't&#160;make it to Oslo in time to receive the Nobel Peace Prize in person, in an extraordinary day shrouded in uncertainty over her whereabouts.",
        "url": "https://news.sky.com/story/maria-corina-machado160missed-the-ceremony-but-the-nobel-peace-prize-winner-is-heading-to-oslo-after-extraordinary-day-13481918",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maria-corina-machado_7047545.jpg?20251210211224",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-12-10 20:28:00",
        "Headline": "The politician, who left Venezuela amid heavy secrecy and probably with covert US help, is due to arrive in Norway on Wednesday night.",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n  The Venezuelan opposition leader Maria Corina Machado didn't make it to Oslo in time to receive the Nobel Peace Prize in person, in an extraordinary day shrouded in uncertainty over her whereabouts. Machado isn't the first Nobel Laureate unable to attend, but her journey to Oslo was unprecedented in the history of the prestigious prize. Her departure from Venezuela, carried out amid heavy secrecy and probably with covert US help, was fraught with risk, but on Wednesday she was en route to Norway, where she is expected to land late in the evening.  Reports suggested she first travelled by boat to the Caribbean island of Curaçao before getting a private flight via the US. Two US F-16 jets were tracked in the skies close to Curaçao late Tuesday night. In a phone call with members of the Nobel Institute, released just after she took off, Machado said she was \"very sad\" not to make it in person but \"as soon as I arrive, I will be able to embrace all my family and children.\" In her absence, her daughter Ana Corina Sosa Machado, whom she hasn't seen for almost two years, collected the award in Oslo City Hall and delivered the speech her mother wrote. She spoke about 2,500 people who had been \"kidnapped, disappeared or tortured\" under Venezuelan president Nicolas Maduro's government and slammed the corruption that has brought Venezuela, once one of the world's richest nations, to its knees. \n                  US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela\n                 \n                  Trump's high seas raid may be followed by something much more severe\n                 \n                  British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies\n                 \"This prize carries profound meaning; it reminds the world that democracy is essential to peace. \"More than anything, what we Venezuelans can offer the world is the lesson forged through this long and difficult journey - that to have democracy, we must be willing to fight for freedom.\" To a standing ovation from an audience that included several South American leaders, Machado thanked the people of Norway and sent a message to her fellow countrymen and women, many of whom had travelled to Oslo from their homes outside Venezuela. \"Venezuela will breathe again,\" her daughter read. \"We will open prison doors and watch thousands who were unjustly detained step into the warm sun, embraced at last by those who never stopped fighting for them.  \"We will see our grandmothers settle children on their laps to tell them stories not of distant forefathers but of their own parents' courage. \"We will hug again. Fall in love again. Hear our streets fill with laughter and music. All the simple joys the world takes for granted will be ours.\" Ms Machado is the leader of a grassroots political movement fighting for democracy in Venezuela. She was banned by Nicolas Maduro from running for election, so she rallied a campaign behind a little-known veteran diplomat Edmundo Gonzalez. She organised and trained more than a million volunteers to monitor elections in 2024 and collect data. Those results, smuggled out of the country, were verified by independent experts and confirmed a landslide win for Gonzalez and Machado's party. Maduro refused to recognise the result and detained thousands of opponents. More on US-Venezuela crisis:US seizes Venezuelan oil tankerIs this how a war starts?Maduro ready for land strikes Protests have failed to dislodge him, although US president Donald Trump has stationed a massive naval force off the coast and has warned the Venezuelan leader his \"days are numbered\". Mr Trump had lobbied publicly to win this year's Nobel Prize himself, but rang Machado to congratulate her. Some members of Trump's administration had threatened the Nobel committee if he didn't win. Edmundo Gonzalez, who was at the ceremony in Oslo, has since gone into exile in Spain, but Machado has remained in Venezuela, spending most of her time in hiding. Her mother, sister and children have also travelled to Oslo to be reunited with her. The decision to travel to Norway is fraught with risk. Having successfully left the country, she faces a dangerous journey home again."
    },
    {
        "title": "Egypt and Iran complain to FIFA after World Cup match scheduled to coincide with Seattle Pride event",
        "description": "Iran and Egypt have complained after FIFA scheduled a World Cup match between the two nations in Seattle to coincide with the city's LGBTQ+ Pride festival.",
        "url": "https://news.sky.com/story/egypt-and-iran-complain-to-fifa-after-world-cup-match-scheduled-to-coincide-with-seattle-pride-event-13481678",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-seattle-stadium-lumen-field_7106456.jpg?20251210112943",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 08:22:00",
        "Headline": "The World Cup draw last week for the first rounds saw Iran and Egypt pitched against each other in Group G, and due to play at the Seattle Stadium on 26 June, with local organisers planning a \"moment to showcase and celebrate LGBTQIA+ communities\".",
        "Content": "Iran and Egypt have complained after FIFA scheduled a World Cup match between the two nations in Seattle to coincide with the city's LGBTQ+ Pride festival. Seattle's PrideFest 2026, which organisers say regularly sees more than 200,000 participants, takes place on 27 and 28 June - immediately following the match. Local organisers have said the 26 June game at the Seattle Stadium will include a \"once-in-a-lifetime moment to showcase and celebrate LGBTQIA+ communities in Washington\". In Iran, where gay couples can face the death penalty, the president of Iran's Football Federation, Mehdi Taj, condemned the decision to use Seattle as a venue and the timing of the match. Mr Taj told Iranian state TV: \"Both Egypt and we have objected, because this is an unreasonable and illogical move that essentially signals support for a particular group, and we must definitely address this point.\" He said Iran would bring up the issue at a FIFA Council meeting in Qatar next week. The football federation in Egypt, where Human Rights Watch says people from LGBTQ+ communities face persecution, said in a statement that it had written to FIFA \"categorically rejecting any activities related to supporting homosexuality during the match between the Egyptian national team and Iran.\" \n                  US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela\n                 \n                  Trump's high seas raid may be followed by something much more severe\n                 \n                  British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies\n                 The letter also stated: \"Information had circulated indicating the local organising committee's decision and plans to hold some activities related to supporting homosexuality during that match\" and the federation \"completely rejects such activities, which directly contradict the cultural, religious and social values in the region, especially in Arab and Islamic societies\". In Seattle, the local organising committee said it was \"moving forward as planned with our community programming outside the stadium during Pride weekend and throughout the tournament,\" having already promoted an art contest ahead of the match. Read more:Man charged with racially abusing Antoine SemenyoSteven Hutton: Three men and one woman jailed over 'frenzied' Dundee murder It added: \"We get to show the world that in Seattle, everyone is welcome.\" Seattle PrideFest has been organised in the city since 2007 by a nonprofit group which designated the 26 June match for celebration before FIFA carried out the World Cup draw on Friday. On Saturday, FIFA announced the Egypt-Iran game had been allocated to Seattle instead of Vancouver, where the teams' group rivals Belgium and New Zealand will play at the same time. FIFA has been asked for a comment."
    },
    {
        "title": "Peaky Blinders costumes land Afghan youths in trouble with the Taliban",
        "description": "Four Afghan youths who dressed up as the Peaky Blinders have been cautioned by the Taliban.",
        "url": "https://news.sky.com/story/peaky-blinders-costumes-land-afghan-youths-in-trouble-with-the-taliban-13481908",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peaky-blinders-afghanistan_7106823.png?20251210201754",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 20:09:00",
        "Headline": "The four young men became a hit on social media by evoking the fictional Shelby crime family with their dark suits, coats and flat caps.",
        "Content": "Four Afghan youths who dressed up as the Peaky Blinders have been cautioned by the Taliban. In posts on social media, the group pose in dark suits, coats and flat caps typical of the fictional Shelby crime family depicted in the drama. But now the men, aged in their early 20s, have been picked up by the ruling Taliban regime for wearing clothing \"in conflict with Afghan and Islamic values\". According to reports, the men are from Jebrael, in the western province of Herat. Saiful Islam Khyber, spokesman for the Taliban Ministry of the Propagation of Virtue and the Prevention of Vice, commented on the case. He posted on social media: \"They were then caught promoting screen culture and imitating film actors in Herat, and a program was started for their reform. \"Thank God, we Muslims and Afghans have our own religion, culture, and values. \n                  Is Trump's latest peace deal a total sham?\n                 \n                  In 'Little Kabul', Afghans feel they have to prove their US loyalty all over again\n                 \n                  Trump tells his immigration agents to target Somalians \n                 \"We have saved this country from the promotion of bad cultures through great sacrifices, and now we are defending it.\" However, speaking to CBS, he insisted that the young men were not arrested, \"only summoned and advised and released\". Videos of the group walking the streets of their hometown have collectively racked up more than a million views on TikTok. They were posted by one of the men using the name Thomas Shelby after Cillian Murphy's main character. Read more:Peaky Blinders film with Cillian Murphy announcedTaliban cuts internet and mobile phone signal across Afghanistan In a November interview on the YouTube channel Herat Mic, the young men said they had received largely positive feedback from local people. \"At first, we had our doubts, but as soon as we ventured outside, we found that people admired our style, approached us on the streets, and requested to take photos with us,\" Yaqoobi said. \"Despite a few negative remarks, our attention remained on the gratitude expressed towards us.\""
    },
    {
        "title": "Italian cuisine granted world heritage status by UNESCO, as prime minister says honour 'can only make us proud' ",
        "description": "Loved the world over for its pizzas and pasta, Italian cuisine has been given world heritage status by the UN's cultural agency. ",
        "url": "https://news.sky.com/story/italian-cuisine-granted-world-heritage-status-by-unesco-as-prime-minister-says-honour-can-only-make-us-proud-13481840",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-italy-rome-food-italian-food_7106707.jpg?20251210164829",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 16:03:00",
        "Headline": "The honour makes for Italy's 21st item on UNESCO's intangible list, joining Neapolitan pizza-making, Sicilian puppet theatre and Cremona's violin craftsmanship.",
        "Content": "Loved the world over for its pizzas and pasta, Italian cuisine has been given world heritage status by the UN's cultural agency.  After a panel vote in New Delhi on Wednesday, UNESCO recognised Italy's national cuisine as an \"intangible cultural heritage\", and added the rituals surrounding it to its list of the world's traditional practices and expressions. It is Italy's 21st entry on UNESCO's intangible list, joining Neapolitan pizza-making, Sicilian puppet theatre and Cremona's violin craftsmanship. In its submission for recognition of its cuisine, Italy emphasised the \"sustainability and biocultural diversity\" of its food. Campaigners noted how Italy's simple cuisine valued seasonality, fresh produce and limiting waste, while its variety highlighted its regional culinary differences and influences from migrants and others. The citation didn't mention specific dishes. However, it instead highlighted the cultural importance Italians place on the rituals of cooking and eating. Pier Luigi Petrillo, a member of the Italian UNESCO campaign and professor of comparative law at Rome's La Sapienza University, said that \"cooking is a gesture of love, a way in which we tell something about ourselves to others and how we take care of others\". \n                  Worker trapped under collapsed medieval tower for 11 hours dies \n                 \n                  Five mountaineers die after avalanche in Italy\n                 \n                  Prosecutors get new information about 2007 murder of Meredith Kercher in Perugia\n                 He added: \"This tradition of being at the table, of stopping for a while at lunch, a bit longer at dinner, and even longer for big occasions, it's not very common around the world.\" Mr Petrillo noted that after Neapolitan pizza-making was recognised, the number of accredited schools to train Neapolitan pizza makers increased by more than 400%. Read more from Sky News:Analysis: Is this what the start of a war looks like?Iran and Egypt don't want World Cup 'Pride' match Italian Prime Minister Giorgia Meloni hailed the recognition, saying in a statement that \"this is a distinction that can only make us proud\". \"For us Italians,\" she said, \"cuisine is not just food or a collection of recipes. It is much more: it is culture, tradition, work, wealth.\" Celebrations are planned in Rome on Wednesday night, with a sound and light show at the Colosseum to ring in the successful cultural bid."
    },
    {
        "title": "Iceland to boycott Eurovision over Israel's participation",
        "description": "Iceland has announced it is boycotting next year's Eurovision over Israel's participation in the competition, saying taking part would \"neither be a source of joy nor peace\".",
        "url": "https://news.sky.com/story/iceland-to-boycott-eurovision-over-israels-participation-13481807",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vaeb-eurovision_6919881.jpg?20250517211645",
        "type": "World",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-10 13:56:00",
        "Headline": "The announcement from Iceland's broadcaster, RUV, follows withdrawals by broadcasters from the Netherlands, Spain, Ireland and Slovenia.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Iceland has announced it is boycotting next year's Eurovision over Israel's participation in the competition, saying taking part would \"neither be a source of joy nor peace\". The announcement from Iceland's RUV follows withdrawals by broadcasters from the Netherlands, Spain, Ireland and Slovenia. In a statement, RUV said participation of Israeli national broadcaster KAN had \"created disunity\" among members of the European Broadcasting Union (EBU), which organises Eurovision, and the general public. Israel's place in the contest was confirmed at the EBU's general assembly last week. The past two events have attracted protests and fan boycotts over Israel's inclusion amid the country's military action in Gaza. This year, there were also allegations that voting had been manipulated in favour of their contestant. After growing criticism, members were asked to vote in a secret ballot last week on whether they were happy with tougher new rules introduced in November, or whether they wanted a second vote on participation for 2026. The majority agreed the changes were enough, although Sky News understands 11 countries were against accepting these without a further vote. Dutch broadcaster AVROTROS, Spain's RTVE, Ireland's RTE and Slovenia's RTV immediately issued statements announcing their withdrawal. Becoming the fifth broadcaster to pull out, RUV made the announcement following a board meeting. It said that while the new rules address many of the concerns it has raised, it believes there are \"still doubts\" about whether the changes are enough. Has issue damaged Eurovision? \"RUV has repeadly raised concerns that various Icelandic stakeholders, such as artist associations and the general public, were opposed to participation in the contest,\" the statement said. \"Furthermore, RUV had requested the EBU to exclude KAN from the contest in accordance to precedents. \"It is a complex matter which has already damaged the contest's reputation and EBU, emphasising the necessity of a solution for all concerned parties.\" Austria, which will host next year's show, last week said it was pleased to see Israel allowed to participate. Roland Weissmann, director-general for Austrian broadcaster ORF, said the contest was a \"competition for broadcasters, not governments\". KAN chief executive Golan Yochpaz has said attempts to remove them from the contest could \"only be understood as a cultural boycott\". What have other broadcasters said? The BBC, which broadcasts Eurovision in the UK, also said it supported the decision. Earlier on Wednesday, Poland's TVP confirmed its participation. In a statement, the broadcaster said it was aware of the scale of the tension surrounding the competition and understood the emotions and concerns raised. \"However, we believe that Eurovision still has a chance to once again become a space filled with music. And only music,\" a TVP statement said. Read more from Sky News:The teens hoping to outsmart Australia's social media banGCHQ releases Christmas puzzle - can you solve it? Despite some pressure from the cultural union in Belgium for a boycott, broadcaster RTBF also confirmed its participation last week. But the walkouts cast a shadow over what is meant to be a celebration of the unifying power of music. Countries have pulled out or been banned in previous years - most notably Russia in 2022, just days after the invasion of Ukraine - but this is perhap's Eurovision's biggest political crisis. Noa Kirel, who represented Israel in 2023, told Sky News in an interview in October that while the situation now is \"very different\" from when she took part in May of that year, she believes it should not be about politics and must \"focus on the music\". Today was the deadline for broadcasters to confirm participation. A final list of competing nations will be published early next week, the EBU said. In response to RUV's decision, Eurovision director Martin Green said: \"We respect the decision of all broadcasters who have chosen not to participate in next year's Eurovision Song Contest and hope to welcome them back soon... \"We look forward to welcoming around 35 broadcasters and their artists to Vienna next May.\""
    },
    {
        "title": "Double building collapse in Morocco leaves 22 dead and 16 injured",
        "description": "At least 22 people are dead and more than a dozen injured after a double building collapse in Morocco.",
        "url": "https://news.sky.com/story/double-building-collapse-in-morocco-leaves-22-dead-and-16-injured-13481827",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-fez-morocco-building-collapse_7106655.jpg?20251210150322",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 14:53:00",
        "Headline": "One of the four-storey buildings was home to eight families,  the authorities said.",
        "Content": "At least 22 people are dead and more than a dozen injured after a double building collapse in Morocco. The disaster in Fez unfolded while one building was hosting an Aqiqah, a traditional Muslim celebration marking the birth of a child. This building was home to eight families, the local authorities said, while the other was unoccupied. A survivor, who lost his wife and three children in the overnight collapse, told a local TV station that rescuers had only been able to retrieve one body. Another survivor, interviewed by SNRT News, Morocco's national broadcaster, said: \"My son who lives upstairs told me the building is coming down.\" She added: \"When we went out, we saw the building collapsing.\" Witnesses said the buildings had shown signs of cracking for some time, when interviewed at the scene by SRNT. \n                  Cameroon re-elects world's oldest president\n                 \n                  Why African campaign groups want the traditional world map scrapped\n                 \n                  Teens unable to walk, mothers with rash-covered babies: How the drug kush is ruining lives\n                 Both buildings, in the Al-Mustaqbal neighbourhood, were four-storeys high. Announcing an investigation, the Fez prosecutor said 16 people had also been injured, citing preliminary figures. Some 38,800 buildings across the country are classified as being at risk of collapse, according to Adib Ben Ibrahim, housing secretary of state. The latest collapse is one of the worst in Morocco since a minaret fell in the historic northern city of Meknes, killing 41 people in 2010. Fez, a former Moroccan capital, is the country's third most-populous city, as well as one of its oldest, dating back to the eighth century. But deteriorating living conditions, and poor public services, sparked a wave of anti-government protests there, and in other cities, two months ago. Read more:Hundreds injured as Morocco youth protests turn violentMiliband shuns £25bn UK-Morocco renewable energy project The unrest, which was driven by younger Moroccans, revealed deep-seated anger over poverty and public services. It comes at a time when the government is pushing ahead with ambitious infrastructure projects, including modern stadiums, ahead of the 2030 FIFA World Cup. Fez, one of the host cities, has some of the country's poorest neighbourhoods."
    },
    {
        "title": "Meghan contacts estranged father Thomas Markle in Philippines hospital",
        "description": "The Duchess of Sussex has been able to contact her estranged father in hospital via a letter, her spokesperson has confirmed.",
        "url": "https://news.sky.com/story/meghan-contacts-estranged-father-thomas-markle-in-philippines-hospital-13481717",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-meghan-markle-duchess-of-sussex_7106390.jpg?20251210102144",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-10 09:56:00",
        "Headline": "Thomas Markle, who reportedly had his left leg amputated while in the Philippines, had said he did not want to die while distanced from his daughter.",
        "Content": "The Duchess of Sussex has been able to contact her estranged father in hospital via a letter, her spokesperson has confirmed. Thomas Markle, who according to reports has had his left leg amputated while in the Philippines, had said he did not want to die while distanced from his daughter. Mr Markle also expressed his desire to meet his two grandchildren and Prince Harry. Meghan has been estranged from her father since her 2018 wedding when he was caught staging paparazzi photos in the run-up to the event.  In a statement, her spokesperson appeared to criticise her father's ongoing relationship with tabloids and the media. The duchess's spokesperson said: \"Given that a Daily Mail reporter has remained at her father's bedside throughout, broadcasting each interaction and breaching clear ethical boundaries, it has been exceedingly difficult for the duchess to contact her father privately, despite her efforts over the past several days. \"With the support of reliable and trusted contacts, her correspondence is now safely in his hands.\" It is understood the royal contacted reporters at the Mail to provide any means of contacting her father - as well as the name of the hospital he is staying at but is said to have not received a response. She is understood to have called several hospitals in the country but was unable to locate her father. Read more from Sky News:Australian PM issues warning over under-16s social media banUS plans to start checking all tourists' social media Her latest statement comes after The Mail On Sunday appeared to refute a statement from Meghan's spokesperson last Friday that she had \"reached out\" to her father. Meanwhile, a spokesperson for the Daily Mail's parent company DMG Media said the journalist in question and Mr Markle had a \"close relationship\" since 2018 and it was Mr Markle who contacted them when he was taken ill and asked for them to travel to the Philippines to be with him. \"Nothing has been published without his specific consent, and that of his son,\" they said, adding that the journalist \"confirmed to the Duchess of Sussex's representative that Mr Markle does not have an active email address but that his phone number, which the duchess has previously used for him, remains unchanged\". They said the reporter has \"made clear that if she can do anything to facilitate contact between Mr Markle and his daughter to have a conversation, then she would be happy to do so\". \"Any suggestion we have 'puppeteered' Mr Markle is entirely false and strongly denied,\" the spokesperson added. The Duchess of Sussex gave up her HRH (Her Royal Highness) title along with husband Prince Harry when they stepped down as senior royals in March 2020."
    },
    {
        "title": "US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela",
        "description": "Venezuela has accused the US of \"piracy\" after an oil tanker was seized off the country's coast.",
        "url": "https://news.sky.com/story/us-forces-seize-oil-tanker-off-coast-of-venezuela-reports-13481897",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-venezuela-oil-tanker_7106954.png?20251210221322",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-10 19:36:00",
        "Headline": "Dramatic footage released by the president's attorney general appears to show US troops descending on to the ship from helicopters, armed with weaponry.",
        "Content": " Venezuela has accused the US of \"piracy\" after an oil tanker was seized off the country's coast. Donald Trump announced the operation had taken place during a meeting of business leaders at the White House, telling reporters: \"We've just seized a tanker on the coast of Venezuela, a large tanker, very large, largest one ever seized, actually.\" Attorney General Pam Bondi shared a video of the operation, revealing the FBI, Homeland Security, US Coast Guard, and Department of Defence were involved. She said the US forces \"executed a seizure warrant for a crude oil tanker used to transport sanctioned oil from Venezuela and Iran\". Venezuela's government said the seizure \"constitutes a blatant theft and an act of international piracy.\" Ms Bondi said the seized vessel - believed to be a tanker named Skipper - has been sanctioned by the US for many years \"due to its involvement in an illicit oil shipping network supporting foreign terrorist organisations\". She did not name the vessel, what flag it sailed under, or exactly where the incident took place. UK maritime risk management group Vanguard said that the tanker Skipper - which the US sanctioned for alleged involvement in Iranian oil trading under the name Adisa - was believed to be the target. Trump offers ominous commentary Without giving additional information on the operation, Mr Trump added during the White House meeting that \"other things are happening\". Later, Mr Trump said the tanker was \"seized for a very good reason\", and when asked what will happen to the oil on board, he added: \"Well, we keep it, I suppose.\"  How did we get here? It marks another escalation from the US after months of pressure on Venezuelan President Nicolas Maduro. The White House accuses Mr Maduro of presiding over a narcotrafficking operation in Venezuela, which he denies. The US has escalated military deployments against the Latin American country over the last few months, with the president suggesting American forces could launch a land attack. Speaking to Politico on Tuesday, Mr Trump declined to comment on whether US troops would enter Venezuela, but warned Mr Maduro's \"days are numbered\". On 2 September, the White House posted on X that it had conducted a strike against so-called \"narcoterrorists\" shipping fentanyl to the US, without providing direct evidence of the alleged crime. Sky News has verified that in the past four months, 23 boats have been targeted in 22 strikes, killing 87 people. Read more: Is this what the beginning of a war looks like? US correspondent The seizing of an oil tanker off the coast of Venezuela is a significant escalation in US tactics. By targeting an oil shipment, rather than a suspected drug boat, Washington has signalled its willingness to disrupt exports. President Trump seems determined to shut down one of the last major sources of funding for Nicholas Maduro’s embattled government. Nine months ago, Trump imposed a 25% tariff on all goods imported into the US from any country buying oil or gas from Venezuela. This is even more aggressive and will be viewed in Caracas as a direct threat to the country’s economy and sovereignty. The interception of the tanker raises more questions about international maritime law and the reach of US enforcement powers. In the space of four months, the US has bombed 23 boats, killing 87 people, accusing the occupants of being \"narco-terrorists\". It will also fuel speculation that airstrikes are imminent, President Trump having posted two weeks ago that he had closed the airspace. Venezuela: 'It has always been about our oil' The Maduro government describes America's actions as a grab for Venezuela's oil reserves, which are among the biggest in the world. At a rally before a ruling-party-organised demonstration in Caracas on Wednesday, Mr Maduro did not address the seizure but told supporters Venezuela is \"prepared to break the teeth of the North American empire if necessary\". Flanked by senior officials, he said that only the ruling party can \"guarantee peace, stability, and the harmonious development of Venezuela, South America and the Caribbean\". His government did issue a statement, accusing the US of \"piracy\" and \"imperial abuses\". Of the US campaign, it said: \"It has always been about our natural resources, our oil, our energy, the resources that belong exclusively to the Venezuelan people.\" Read more on Venezuela:Hegseth cites 'fog of war' defenceUS aircraft carrier close to Venezuela  Is military confrontation possible? Geoffrey Corn, director of the Centre for Military Law at Texas Tech University, told Sky's Mark Austin on The World that Mr Trump's remarks on land strikes \"ostensibly\" refer to drug cartel members. Formerly a senior adviser to the US army on warfare law, Mr Corn added: \"That could very easily provide the pretext for some confrontation between Venezuelan armed forces and US armed forces. \"And then that would open the door to a broader campaign to basically negate the power of the Venezuelan military.\""
    },
    {
        "title": "US plans to start checking all tourists' social media",
        "description": "All tourists - including those from Britain - will have to undergo a social media screening before being allowed entry into the US under new plans being considered by the country's border force.",
        "url": "https://news.sky.com/story/us-plans-to-start-checking-all-tourists-social-media-13481642",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-us-airport-customs-and-border_7106197.jpg?20251210052646",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-10 03:29:00",
        "Headline": "The potential social media mandate being proposed by Customs and Border Protection (CBP) would apply to anyone visiting, whether they require a visa or not.",
        "Content": "All tourists - including those from Britain - will have to undergo a social media screening before being allowed entry into the US under new plans being considered by the country's border force. At the moment, Britons are among those who can visit for up to 90 days without a visa. They just have to obtain an electronic travel authorisation, known as an ESTA, for $40 (£30). The potential social media mandate being proposed by Customs and Border Protection (CBP) would apply to anyone visiting, whether they require a visa or not. According to a notice published in America's federal register on Tuesday, foreign tourists would need to provide their social media from the last five years. It will be \"mandatory\" to hand over the information, and other details - including email addresses and telephone numbers used in the last five years, as well as the names, addresses, numbers, and birthdays of family members - will also be required. Currently, as part of the ESTA application process, a tourist from Britain would have to provide an email address, home address, phone number, and emergency contact details. If approved, the ESTA lasts for two years. CBP is proposing that moving forward, ESTA applications would require a selfie. It further wants to collect biometrics - face, fingerprints DNA and iris - as part of the ESTA application. It currently only records face and fingerprints upon arrival at the US border. The proposed changes are open for public consultation for 60 days. So much for free speech? There have been several reports of travellers already having been denied entry into the US over social media posts and messages found on their personal devices after President Donald Trump took office in January. This includes a French scientist who was turned away at the US border in March after messages \"that reflect hatred toward Trump and can be described as terrorism\" were found on his phone. Despite Mr Trump vowing to \"restore freedom of speech\" on online platforms and end \"federal censorship\" when he took office, he has found himself at the centre of various free speech rows since. In September, talk show host Jimmy Kimmel was taken off-air by Disney-owned ABC over comments he made about the assassination of the right-wing influencer Charlie Kirk. Mr Kimmel accused the Trump administration and its allies of \"working very hard to capitalise on the murder of Charlie Kirk\", with the president among those to pin it on left-wing extremism. At the time, Mr Trump suggested certain networks should have their licenses revoked over a lack of support for him. Mr Kimmel's show was reinstated less than a week after his suspension following widespread backlash from celebrities and viewers. Read more from Sky News:This is the reality of Trump's trade warTrump's verdict on America's traditional allies And in April, Harvard University sued the Trump administration for seeking \"unprecedented and improper\" control of the school, after it froze $2.6bn (£1.9bn) of its federal funding. Harvard's lawsuit accused the government of waging a retaliation campaign against the university after it rejected a list of 10 demands from a federal antisemitism task force, which included sweeping changes related to campus protests, academics and admissions. A judge ruled in September that the Trump administration's freeze of billions in research funding to Harvard was unconstitutional and retaliatory, a decision the US government vowed to appeal. An agreement has not yet been reached, so the fight between the Ivy League university and Mr Trump rages on."
    },
    {
        "title": "Fed signals rate cut pause as central bank prepares for Donald Trump showdown",
        "description": "The US central bank has signalled a pause in interest rates cuts demanded by the president as it grapples pressures from both elevated inflation and a weak jobs market. ",
        "url": "https://news.sky.com/story/fed-signals-rate-cut-pause-as-central-bank-prepares-for-trump-showdown-13481829",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-us-federal-reserve_6689767.jpg?20240918220202",
        "type": "US",
        "Author": "James Sillars",
        "Date Published": "2025-12-10 14:59:00",
        "Headline": "The Federal Reserve takes US borrowing costs down to a near-three year low, but says it's now taking a more cautious approach - a switch that is unlikely to please the White House.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The US central bank has signalled a pause in interest rates cuts demanded by the president as it grapples pressures from both elevated inflation and a weak jobs market.  The Federal Reserve, which has a dual mandate to promote stable prices and maximum employment, guided that just one rate cut was currently likely in 2026 after it announced a third consecutive reduction in the cost of borrowing. Its key rate was trimmed to a near three-year low to around 3.6%, though there were three dissenting votes which argued for no change to the Fed funds rate, despite recent weakness in US hiring numbers. Money latest: Big rise in pension drawdowns The Fed's caution over the outlook for rate cuts comes as US economic growth is projected to pick up, with the jobless rate easing sharply next year. At the same time, its projections see a level of 2.4% for the pace of price growth by the end of next year, down from the current rate around 3%, as the effects of US trade tariffs are slowly removed from the inflation calculations. The central bank, worried about the impact on the world's largest economy from Donald Trump's trade war, said that its future decisions would be guided by the data. \n                  Hundreds of jobs at risk as LEON moves to cut unprofitable restaurants\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Revenues of water company to be cut by regulator Ofwat\n                  \"I would note that having reduced our policy rate by 75 basis points since September, and 175 basis points since lastSeptember, the Fed funds rate is now within a broad range of estimates of its neutral value, and we are well positioned to wait to see how the economy evolves,\" Fed chair Jay Powell told reporters. Financial market attention was already firmly on 2026 ahead of the Fed meeting, as the central bank's impartiality is placed at risk by the departure of Mr Powell in mid-May. President Trump has already taken action to place supporters of rapid interest rate reductions within the bank's rate-setting ranks. He is set to double down on that effort through his nomination for Mr Powell's successor. Mr Trump is seeking a monetary policy focus on promoting economic growth. There is speculation an announcement on his pick could come before the end of the year. If, as markets and commentators fear, that successor to Mr Powell is a champion for rate reductions, it renders the Fed's current guidance as effectively worthless. That may have played a part in the market reaction on Wednesday evening as the dollar and US bond yields, which reflect government borrowing costs, were little moved after the rate-setting committee's decisions and findings were released. Stock markets however appeared to surge on the back of the Fed's higher growth predictions, with the Dow Jones Industrial Average up by more than 1.2%. Danni Hewson, head of financial analysis at AJ Bell, said of the succession situation ahead of the rate decision: \"This is understandably making bond markets skittish. There are checks and balances in the Federal Reserve system, but the appointment of a dovish chair, and rising political influence on the US central bank, will call into question its independence, and its grip on monetary policy. \"That could push shorter dated US bond yields down, and longer dated Treasury yields up, as markets factor in both the sugar rush of interest rate cuts and the hangover of inflation. \"Along with fears about the US budget deficit, that goes a long way to explaining why 20-year US Treasury yields are nudging up towards 5% even in the middle of a rate cutting cycle.\""
    },
    {
        "title": "Egypt and Iran complain to FIFA after World Cup match scheduled to coincide with Seattle Pride event",
        "description": "Iran and Egypt have complained after FIFA scheduled a World Cup match between the two nations in Seattle to coincide with the city's LGBTQ+ Pride festival.",
        "url": "https://news.sky.com/story/egypt-and-iran-complain-to-fifa-after-world-cup-match-scheduled-to-coincide-with-seattle-pride-event-13481678",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-seattle-stadium-lumen-field_7106456.jpg?20251210112943",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-10 08:22:00",
        "Headline": "The World Cup draw last week for the first rounds saw Iran and Egypt pitched against each other in Group G, and due to play at the Seattle Stadium on 26 June, with local organisers planning a \"moment to showcase and celebrate LGBTQIA+ communities\".",
        "Content": "Iran and Egypt have complained after FIFA scheduled a World Cup match between the two nations in Seattle to coincide with the city's LGBTQ+ Pride festival. Seattle's PrideFest 2026, which organisers say regularly sees more than 200,000 participants, takes place on 27 and 28 June - immediately following the match. Local organisers have said the 26 June game at the Seattle Stadium will include a \"once-in-a-lifetime moment to showcase and celebrate LGBTQIA+ communities in Washington\". In Iran, where gay couples can face the death penalty, the president of Iran's Football Federation, Mehdi Taj, condemned the decision to use Seattle as a venue and the timing of the match. Mr Taj told Iranian state TV: \"Both Egypt and we have objected, because this is an unreasonable and illogical move that essentially signals support for a particular group, and we must definitely address this point.\" He said Iran would bring up the issue at a FIFA Council meeting in Qatar next week. The football federation in Egypt, where Human Rights Watch says people from LGBTQ+ communities face persecution, said in a statement that it had written to FIFA \"categorically rejecting any activities related to supporting homosexuality during the match between the Egyptian national team and Iran.\" \n                  US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela\n                 \n                  Trump's high seas raid may be followed by something much more severe\n                 \n                  British soldier killed in Ukraine named - as Trump exchanges 'strong words' with Kyiv's allies\n                 The letter also stated: \"Information had circulated indicating the local organising committee's decision and plans to hold some activities related to supporting homosexuality during that match\" and the federation \"completely rejects such activities, which directly contradict the cultural, religious and social values in the region, especially in Arab and Islamic societies\". In Seattle, the local organising committee said it was \"moving forward as planned with our community programming outside the stadium during Pride weekend and throughout the tournament,\" having already promoted an art contest ahead of the match. Read more:Man charged with racially abusing Antoine SemenyoSteven Hutton: Three men and one woman jailed over 'frenzied' Dundee murder It added: \"We get to show the world that in Seattle, everyone is welcome.\" Seattle PrideFest has been organised in the city since 2007 by a nonprofit group which designated the 26 June match for celebration before FIFA carried out the World Cup draw on Friday. On Saturday, FIFA announced the Egypt-Iran game had been allocated to Seattle instead of Vancouver, where the teams' group rivals Belgium and New Zealand will play at the same time. FIFA has been asked for a comment."
    },
    {
        "title": "Meghan contacts estranged father Thomas Markle in Philippines hospital",
        "description": "The Duchess of Sussex has been able to contact her estranged father in hospital via a letter, her spokesperson has confirmed.",
        "url": "https://news.sky.com/story/meghan-contacts-estranged-father-thomas-markle-in-philippines-hospital-13481717",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-meghan-markle-duchess-of-sussex_7106390.jpg?20251210102144",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-10 09:56:00",
        "Headline": "Thomas Markle, who reportedly had his left leg amputated while in the Philippines, had said he did not want to die while distanced from his daughter.",
        "Content": "The Duchess of Sussex has been able to contact her estranged father in hospital via a letter, her spokesperson has confirmed. Thomas Markle, who according to reports has had his left leg amputated while in the Philippines, had said he did not want to die while distanced from his daughter. Mr Markle also expressed his desire to meet his two grandchildren and Prince Harry. Meghan has been estranged from her father since her 2018 wedding when he was caught staging paparazzi photos in the run-up to the event.  In a statement, her spokesperson appeared to criticise her father's ongoing relationship with tabloids and the media. The duchess's spokesperson said: \"Given that a Daily Mail reporter has remained at her father's bedside throughout, broadcasting each interaction and breaching clear ethical boundaries, it has been exceedingly difficult for the duchess to contact her father privately, despite her efforts over the past several days. \"With the support of reliable and trusted contacts, her correspondence is now safely in his hands.\" It is understood the royal contacted reporters at the Mail to provide any means of contacting her father - as well as the name of the hospital he is staying at but is said to have not received a response. She is understood to have called several hospitals in the country but was unable to locate her father. Read more from Sky News:Australian PM issues warning over under-16s social media banUS plans to start checking all tourists' social media Her latest statement comes after The Mail On Sunday appeared to refute a statement from Meghan's spokesperson last Friday that she had \"reached out\" to her father. Meanwhile, a spokesperson for the Daily Mail's parent company DMG Media said the journalist in question and Mr Markle had a \"close relationship\" since 2018 and it was Mr Markle who contacted them when he was taken ill and asked for them to travel to the Philippines to be with him. \"Nothing has been published without his specific consent, and that of his son,\" they said, adding that the journalist \"confirmed to the Duchess of Sussex's representative that Mr Markle does not have an active email address but that his phone number, which the duchess has previously used for him, remains unchanged\". They said the reporter has \"made clear that if she can do anything to facilitate contact between Mr Markle and his daughter to have a conversation, then she would be happy to do so\". \"Any suggestion we have 'puppeteered' Mr Markle is entirely false and strongly denied,\" the spokesperson added. The Duchess of Sussex gave up her HRH (Her Royal Highness) title along with husband Prince Harry when they stepped down as senior royals in March 2020."
    },
    {
        "title": "Keir Starmer belatedly defends Sadiq Khan after 'horrible mayor' jibe - and calls out Donald Trump comments",
        "description": "Downing Street has belatedly hit back at comments made by Donald Trump about the Mayor of London, saying the remarks were \"wrong\".",
        "url": "https://news.sky.com/story/keir-starmer-belatedly-defends-sadiq-khan-after-horrible-mayor-jibe-and-calls-out-donald-trump-comments-13481832",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sadiq-khan-sir-keir-starmer_7106681.jpg?20251210160547",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-10 15:31:00",
        "Headline": "The US president has labelled the Mayor of London a \"disaster\" in office - but the prime minister is \"hugely proud\" of his record.",
        "Content": "Downing Street has belatedly hit back at comments made by Donald Trump about the Mayor of London, saying the remarks were \"wrong\". The US president used an interview with Politico on Tuesday to hit out at Sir Sadiq Khan, who he called a \"disgusting mayor\", and implied the Labour politician gets elected only \"because so many people have come in\". Politics latest - follow live Mr Trump told the publication's podcast, The Conversation: \"Look at… your mayor of London. He's a disaster. He's a disaster. \"He's got a totally different ideology of what he's supposed to have. And he gets elected because so many people have come in.\" Mr Trump added: \"He's a horrible mayor. He's an incompetent mayor, but he's a horrible, vicious, disgusting mayor. I think he's done a terrible job. London's a different place.\" In a wide-ranging interview, the president also hit out at European leaders for wanting to be \"so politically correct\", and warned that Europe is being led by \"weak\" people who are failing to control immigration. \n                  Trump's high seas raid may be followed by something much more severe\n                 \n                  US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela\n                 \n                  US plans to start checking all tourists' social media\n                 Downing Street initially declined to criticise Mr Trump's comments on Tuesday, insisting that Sir Keir Starmer has a \"strong relationship\" both with the US president and with Labour mayor, Sir Sadiq. The PM also held a planned closed-doors meeting with the US ambassador Warren Stephens on Tuesday. Read more:Trump is 'racist, sexist and Islamophobic', says KhanKhan a 'terrible mayor', London wants Sharia law - Trump But, in an apparent about-turn, the prime minister's spokesperson openly criticised Mr Trump's comments on Wednesday, saying that Sir Keir has \"made clear\" that they were \"wrong\". They added: \"The mayor is doing an excellent job. The PM is hugely proud of the mayor's record, and he's proud to call him a colleague and a friend.\" Pushed again on Mr Trump's comments, the spokesperson pointed back to Sir Keir's comments to the US president following his state visit to the UK in September.  Speaking to the UN General Assembly that month, Mr Trump attacked both Sir Sadiq - he called him \"a terrible mayor\" - and London, which he said wants \"to go to Sharia law\". The mayor responded by branding Mr Trump as \"racist, sexist, misogynistic\" and \"Islamophobic\", adding that he was \"living rent-free\" in the president's head. Sir Keir later responded to that incident by saying he was \"really proud of the fact we have a Muslim mayor of a very diverse city\", and that \"on this issue, I disagree\" with the US president. The latest mudslinging between two men between whom there is no love lost Mr Trump's comments about Sir Sadiq are merely the latest insults hurled across the Atlantic in a public spat that dates back to the US president's first state visit in 2018, when the mayor gave permission to protestors to fly a giant blimp of the president styled as a baby. Sir Sadiq responded to Mr Trump's latest comments in his own interview with Politico, where he suggested the US president had become \"obsessed\" with him. He also suggested that Americans are \"flocking\" to live in London - because its values are the \"antithesis\" of the US."
    },
    {
        "title": "Hundreds of jobs at risk as LEON moves to cut unprofitable restaurants",
        "description": "The fast food chain LEON has taken a swipe at \"unsustainable taxes\" while moving to secure its future through the appointment of an administrator, leaving hundreds of jobs at risk. ",
        "url": "https://news.sky.com/story/hundreds-of-jobs-at-risk-as-leon-moves-to-cut-unprofitable-restaurants-13481836",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-leon-restaurant_7106673.jpg?20251210155144",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-10 15:40:00",
        "Headline": "The announcement leaves the natural food-focused chain's 1,100 staff fearing for their jobs beyond Christmas.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The fast food chain LEON has taken a swipe at \"unsustainable taxes\" while moving to secure its future through the appointment of an administrator, leaving hundreds of jobs at risk.  The loss-making company, bought back from Asda by its co-founder John Vincent in October, said it had begun a process that aimed to bring forward the closure of unprofitable sites. It was to form part of a turnaround plan to restore the brand to its roots around natural foods. It was unclear at this stage how many of its 71 restaurants - 44 of them directly owned - and approximately 1,100 staff would be affected by the plans for the so-called Company Voluntary Arrangement (CVA). Money latest: Big rise in pension drawdowns \"The restructuring will involve the closure of several of LEON's restaurants and a number of job losses\", a statement said. \"The company has created a programme to support anyone made redundant.\" It added: \"LEON and Quantuma intend to spend the next few weeks discussing the plans with its landlords and laying out options for the future of the Company. \n                  Fed signals rate cut pause as central bank prepares for Donald Trump showdown\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Revenues of water company to be cut by regulator Ofwat\n                 \"LEON then plans to emerge from administration as a leaner business that can return to its founding values and principles more easily. \"In the meantime, all the group's restaurants remain open, serving customers as usual. The LEON grocery business will not be affected in any way by the CVA.\" Mr Vincent said. \"If you look at the performance of LEON's peers, you will see that everyone is facing challenges - companies are reporting significant losses due to working patterns and increasingly unsustainable taxes.\" Mr Vincent sold the chain to Asda in 2021 for £100m but it struggled, like rivals, to make headway after the pandemic and cost of living crisis that followed the public health emergency. The hospitality sector has taken aim at the chancellor's business rates adjustments alongside heightened employer national insurance contributions and minimum wage levels, accusing the government of placing jobs and businesses in further peril."
    },
    {
        "title": "Fed signals rate cut pause as central bank prepares for Donald Trump showdown",
        "description": "The US central bank has signalled a pause in interest rates cuts demanded by the president as it grapples pressures from both elevated inflation and a weak jobs market. ",
        "url": "https://news.sky.com/story/fed-signals-rate-cut-pause-as-central-bank-prepares-for-trump-showdown-13481829",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-us-federal-reserve_6689767.jpg?20240918220202",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-12-10 14:59:00",
        "Headline": "The Federal Reserve takes US borrowing costs down to a near-three year low, but says it's now taking a more cautious approach - a switch that is unlikely to please the White House.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The US central bank has signalled a pause in interest rates cuts demanded by the president as it grapples pressures from both elevated inflation and a weak jobs market.  The Federal Reserve, which has a dual mandate to promote stable prices and maximum employment, guided that just one rate cut was currently likely in 2026 after it announced a third consecutive reduction in the cost of borrowing. Its key rate was trimmed to a near three-year low to around 3.6%, though there were three dissenting votes which argued for no change to the Fed funds rate, despite recent weakness in US hiring numbers. Money latest: Big rise in pension drawdowns The Fed's caution over the outlook for rate cuts comes as US economic growth is projected to pick up, with the jobless rate easing sharply next year. At the same time, its projections see a level of 2.4% for the pace of price growth by the end of next year, down from the current rate around 3%, as the effects of US trade tariffs are slowly removed from the inflation calculations. The central bank, worried about the impact on the world's largest economy from Donald Trump's trade war, said that its future decisions would be guided by the data. \n                  Hundreds of jobs at risk as LEON moves to cut unprofitable restaurants\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Revenues of water company to be cut by regulator Ofwat\n                  \"I would note that having reduced our policy rate by 75 basis points since September, and 175 basis points since lastSeptember, the Fed funds rate is now within a broad range of estimates of its neutral value, and we are well positioned to wait to see how the economy evolves,\" Fed chair Jay Powell told reporters. Financial market attention was already firmly on 2026 ahead of the Fed meeting, as the central bank's impartiality is placed at risk by the departure of Mr Powell in mid-May. President Trump has already taken action to place supporters of rapid interest rate reductions within the bank's rate-setting ranks. He is set to double down on that effort through his nomination for Mr Powell's successor. Mr Trump is seeking a monetary policy focus on promoting economic growth. There is speculation an announcement on his pick could come before the end of the year. If, as markets and commentators fear, that successor to Mr Powell is a champion for rate reductions, it renders the Fed's current guidance as effectively worthless. That may have played a part in the market reaction on Wednesday evening as the dollar and US bond yields, which reflect government borrowing costs, were little moved after the rate-setting committee's decisions and findings were released. Stock markets however appeared to surge on the back of the Fed's higher growth predictions, with the Dow Jones Industrial Average up by more than 1.2%. Danni Hewson, head of financial analysis at AJ Bell, said of the succession situation ahead of the rate decision: \"This is understandably making bond markets skittish. There are checks and balances in the Federal Reserve system, but the appointment of a dovish chair, and rising political influence on the US central bank, will call into question its independence, and its grip on monetary policy. \"That could push shorter dated US bond yields down, and longer dated Treasury yields up, as markets factor in both the sugar rush of interest rate cuts and the hangover of inflation. \"Along with fears about the US budget deficit, that goes a long way to explaining why 20-year US Treasury yields are nudging up towards 5% even in the middle of a rate cutting cycle.\""
    },
    {
        "title": "Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer",
        "description": "Tax changes announced in the budget could have \"devastating, unintended consequences\" on live music venues, including widespread closures and job losses, trade bodies have warned.",
        "url": "https://news.sky.com/story/live-music-venues-warn-of-devastating-consequences-of-budget-tax-changes-in-letter-to-sir-keir-starmer-13481872",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-live-music-stock_7106780.jpg?20251210191128",
        "type": "Business",
        "Author": "Ben Bloch",
        "Date Published": "2025-12-10 18:02:00",
        "Headline": "Trade bodies representing grassroots music venues, as well as arenas such as the OVO Wembley Arena, The O2, and Co-op Live, are warning of price increases, closures and job losses if changes aren't made.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Tax changes announced in the budget could have \"devastating, unintended consequences\" on live music venues, including widespread closures and job losses, trade bodies have warned. The bodies, representing nearly 1,000 live music venues, including grassroots sites as well as arenas such as the OVO Wembley Arena, The O2, and Co-op Live, are calling for an urgent rethink on the chancellor's changes to the business rates system. If not, they warn that hundreds of venues could close, ticket prices could increase, and thousands could lose their jobs across the country. Politics latest: Ex-Olympic swimmer nominated for peerages Business rates, which are a tax on commercial properties in England and Wales, are calculated through a complex formula of the value of the property, assessed by a government agency every three years. That is then combined with a national \"multiplier\" set by the Treasury, giving a final cash amount. The chancellor declared in her budget speech that although she is removing the business rates discount for small hospitality businesses, they would benefit from \"permanently lower tax rates\". The burden, she said, would instead be shifted onto large companies with big spaces, such as Amazon. But both small and large companies have seen the assessed values of their properties shoot up, which more than wipes out any discount on the tax rate for small businesses, and will see the bills of arena spaces increase dramatically. \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 \n                  Rachel Reeves acknowledges damage of 'too many' budget leaks\n                 \n                  Did Keir Starmer and Rachel Reeves mislead us?\n                 In the letter, coordinated by Live, the trade bodies write that the effect of Rachel Reeves's changes are \"chilling\", saying: \"Hundreds of grassroots music venues will close in the coming years as revaluations drive costs up. This will deprive communities of valuable cultural spaces and limit the UK creative sector's potential. These venues are where artists like Ed Sheeran began their career. \"Ticket prices for consumers attending arena shows will increase as the dramatic rise in arena's tax costs will likely trickle through to ticket prices, undermining the government's own efforts to combat the cost of living crisis. Many of these arenas are seeing 100%+ increases in their business rates liability. \"Smaller arenas in towns and cities across the UK will teeter on the edge of closure, potentially resulting in thousands of jobs losses and hollowing out the cultural spaces that keep places thriving.\" They go on to warn that the government will \"undermine its own Industrial Strategy and Creative Sector Plan which committed to reducing barriers to growth for live events\", and will also reduce spending in hotels, bars, restaurants and other high street businesses across the country. To mitigate the impact of the tax changes, they are calling for an immediate 40% discount on business rates for live venues, in line with film studios, as well as \"fundamental reform\" to the system used to value commercial properties in the UK, and a \"rapid inquiry\" into how events spaces are valued.  In response, a Treasury spokesperson told Sky News: \"With Covid support ending and valuations rising, some music venues may face higher costs - so we have stepped in to cap bills with a £4.3bn support package and by keeping corporation tax at 25% - the lowest rate in the G7. \"For the music sector, we are also relaxing temporary admission rules to cut the cost of bringing in equipment for gigs, providing 40% orchestra tax relief for live concerts, and investing up to £10m to support venues and live music.\" But Conservative shadow business secretary Andrew Griffith told Sky News: \"The government has failed to deliver the reform to business rates they promised, and need to change course before more jobs and venues are lost forever.\" The warning from the live music industry comes after small retail, hospitality and leisure businesses warned of the potential for widespread closures due to the changes to the business rates system.  Sky News reported after the budget that the increase in business rates over the next three years following vast increases in the assessed values of commercial properties has left small retail, hospitality and leisure businesses questioning whether their businesses will be viable beyond April next year. Analysis by UK Hospitality, the trade body that represents hospitality businesses, has found that over the next three years, the average pub will pay an extra £12,900 in business rates, even with the transitional arrangements, while an average hotel will see its bill soar by £205,200. Read more: Hospitality pleads for 'lifeline' A Treasury spokesperson said their cap for small businesses will see \"a typical independent pub pay around £4,800 less next year than they otherwise would have\". \"This comes on top of cutting licensing costs to help more venues offer pavement drinks and al fresco dining, maintaining our cut to alcohol duty on draught pints, and capping corporation tax,\" they added."
    },
    {
        "title": "Revenues of water company to be cut by regulator Ofwat",
        "description": "The UK's biggest water supplier has been dealt another blow as the regulator decided to reduce its income.",
        "url": "https://news.sky.com/story/revenues-of-water-company-to-be-cut-by-regulator-ofwat-13481685",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mogden-sewage-treatment_6969742.jpg?20250721101325",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-10 08:37:00",
        "Headline": "The change will take place in the five years to 2030 and ultimately reflects good news for customers.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK's biggest water supplier has been dealt another blow as the regulator decided to reduce its income. Thames Water, which supplies 16 million people in England, has been told by the watchdog Ofwat its revenues will be cut by more than £187m. It comes as the utility struggles under a £17.6bn debt pile and the government has lined up insolvency practitioners for its potential collapse. Money blog: Nine-year-old set up Christmas tree business to pay for university Overall, water firms face a sector-wide revenue reduction of nearly £309m as a result of Ofwat's determination. Thames Water's £187.1m cut is the largest revenue reduction. This will take effect from next year and up to 2030 as part of water companies' regulator-approved five-year spending and investment plans. The downward revenue revision has been made as Ofwat believes the companies will perform better than first thought and therefore require less money. \n                  Thames Water to decide on controversial £2m payouts to bosses\n                 \n                  Bond giant Pimco sells bulk of Thames Water debt position\n                 \n                  English water firms get lowest environmental rating since records began\n                 Better financial performance is ultimately good news for customers. The change published on Wednesday is a technical update; the initial revenue projections published in December 2024 were based on projected financial performance but after financial results were published in the summer and Ofwat was able to apply these figures.  Thames Water and industry body Water UK have been contacted for comment."
    },
    {
        "title": "Fintech unicorn Zilch lands payments licence from City watchdog",
        "description": "One of Britain&#8217;s most prominent fintech unicorns has secured a payments services licence from UK regulators as it hunts for acquisition targets ahead of an eventual move to list its shares publicly.",
        "url": "https://news.sky.com/story/fintech-unicorn-zilch-lands-payments-licence-from-city-watchdog-13481828",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-zilch-fintech_7106806.png?20251210200407",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-10 14:57:00",
        "Headline": "The FCA’s move to hand Zilch a payments services licence is another step towards one of the UK’s most prominent fintechs listing its shares on a major stock exchange, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of Britain’s most prominent fintech unicorns has secured a payments services licence from UK regulators as it hunts for acquisition targets ahead of an eventual move to list its shares publicly. Sky News understands that Zilch, which has more than five million customers, will announce on Thursday that it has been awarded the licence by the Financial Conduct Authority (FCA). It is also expected to say that it has deepened its relationship with Visa, the global payments network, by becoming a direct, principal member, which will pave the way for new payment-related collaborations between the two companies. Money latest: Big rise in pension drawdowns The licensing move will be hailed by Zilch as an important milestone for the company ahead of the full-scale launch of Zilch Pay next year which is aimed at capturing a greater chunk of consumers' spending through a one-click checkout process. \"This is a major step change for Zilch, bringing us firmly into the payments tent and giving us a true seat at the table to shape the ecosystem\", said Philip Belamant, co-founder and chief executive of Zilch. \"It opens the door to new opportunities, setting us up to move even faster, more efficiently and cost-effectively. \n                  Hundreds of jobs at risk as LEON moves to cut unprofitable restaurants\n                 \n                  Fed signals rate cut pause as central bank prepares for Donald Trump showdown\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \"In just five years, we've amassed over 5.3 million users and thousands of retail partners based on the strength of our proposition and product.\" The announcement will come weeks after Zilch, which has a commercial partnership with Arsenal Football Club, confirmed that it had secured a further $175m of debt and equity funding. Zilch is valued at about $2bn, making it one of the UK's most valuable fintechs, and rendering its ultimate choice of listing venue of intense interest to investors, peers and ministers who have set the objective of improving London's lure as an IPO destination. Mr Belamant has been an active participant in talks with regulators and policymakers about reforms to London's listings regime. Last year, he warned that Zilch could float outside the UK without meaningful efforts to incentivise \"retail investors to buy and hold British stocks\". Sources close to the company said Zilch had generated well over £750m in savings on interest and fees for customers since its launch. Zilch has annual revenues of more than £150m, making it well-placed to snap up rivals which are too small to raise additional capital or list on the public markets, Sky News reported earlier this year. The company's investors include eBay, Goldman Sachs and Ventura Capital. Zilch secured authorisation from the City watchdog in 2020, and offers customers a digital debit Visa card earning up to 5% of spending in rewards. In the same app, customers can switch to a credit card, allowing them to spread repayments with zero interest over six weeks or three months, enabling them to build their credit record."
    },
    {
        "title": "Reeves misses opportunity to end loop of permanent budget speculation",
        "description": "Whatever your political bent or economic creed, it is hard to argue that the build up to last month's budget was anything but hapless.",
        "url": "https://news.sky.com/story/reeves-misses-opportunity-to-end-loop-of-permanent-budget-speculation-13481799",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-select-committee_7106384.jpg?20251210101552",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-12-10 13:43:00",
        "Headline": "Sky's Paul Kelso says the chancellor's evidence to MPs was a chance for her to take control after the chaotic lead-up to the budget and she only partially took it.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Whatever your political bent or economic creed, it is hard to argue that the build up to last month's budget was anything but hapless. The prolonged wait for the fiscal event was punctuated by trails and leaks and capped by an unusual scene-setting speech by the chancellor herself, in which she gave a hefty nudge-and-a-wink towards income tax rises, before climbing down days later. When the moment to deliver finally came, Rachel Reeves was upstaged by the Office for Budget Responsibility (OBR) effectively publishing her budget online, 90 minutes before she stood up in Parliament. Money latest: Big rise in pension drawdowns Appearing before the Treasury select committee of MPs - a routine post-budget date for any chancellor - she had her best opportunity yet to explain the apparent chaos. She only partially took it. Ms Reeves insisted that the leaks were unauthorised and unhelpful, but failed to say explicitly why she dropped income tax rises having intentionally flagged they were coming to plug a hole in the public finances. We did learn the focus of the leak inquiry is a story published by the Financial Times on 13 November, nine days after her Downing Street speech, which revealed that the income tax changes had been ditched. \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Rachel Reeves acknowledges damage of 'too many' budget leaks\n                 \n                  Did Keir Starmer and Rachel Reeves mislead us?\n                  It moved markets, pushing the price of UK bonds down, and the price the government pays to service that debt up. The story, she said, was inaccurate, partial and \"very damaging\" because it gave the impression that she was abandoning the \"core elements\" of her strategy, crucially increasing the headroom against her fiscal rules.  What many people took from it was that a key decision had been reversed before it had been taken, adding to pervading uncertainty and a general sense of chaos. It looked even more curious post-budget when the OBR revealed it had told her before the nudge-and-a-wink speech that the total funding gap was not as wide as first feared. The chancellor did confirm she had considered breaking a manifesto pledge on income tax and that the final decision was made in tandem with the prime minister \"as a team\". \"In the end it was not necessary,\" she said. She was more bullish when questions moved from the style to the substance of the budget, defending her blend of backdated tax rises and upfront spending pledges from the charge they do nothing to promote growth. She was also tempted into making two firm commitments - not to levy capital gains taxes on primary residences or dilute the triple-lock on pensions - underlining the sense that, for this government, budget speculation is now a permanent loop. Committee chair Dame Meg Hillier concluded by describing her appearance as the \"full stop\" on the budget process. The chancellor will hope so."
    },
    {
        "title": "Former NHS England chair Meddings in frame to head Prudential",
        "description": "A former chairman of NHS England is among the candidates being considered as the next chair of Prudential, the FTSE 100 insurance group.",
        "url": "https://news.sky.com/story/former-nhs-england-chair-meddings-in-frame-to-head-prudential-13481823",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-prudential-hq_7106643.jpg?20251210145641",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-10 14:45:00",
        "Headline": "Richard Meddings, who has chaired TSB and been finance chief of Standard Chartered, is among a small number of candidates being considered to replace Baroness Vadera at the Pru, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A former chairman of NHS England is among the candidates being considered as the next chair of Prudential, the FTSE 100 insurance group. Sky News has learnt that Richard Meddings, whose financial services pedigree includes stints at TSB and Deutsche Bank, is among a small number of contenders to replace Baroness Shriti Vadera as the Pru's chairman. City sources said on Wednesday that the search process was at an advanced stage, although it was unclear how many candidates remained in talks with the company and its advisers. Money latest: Big rise in pension drawdowns Mr Meddings would be a logical choice for the job, given his extensive boardroom experience and, more importantly, his tenure as chief financial officer of Standard Chartered, the emerging markets lender. Although it is listed in London, the Pru no longer has any meaningful UK operations, having demerged M&G Investments in 2019. It is now an Asia-led financial services group, with a market capitalisation of just over £28bn. \n                  Hundreds of jobs at risk as LEON moves to cut unprofitable restaurants\n                 \n                  Fed signals rate cut pause as central bank prepares for Donald Trump showdown\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 The Pru is in the process of taking its Indian joint venture public via a separate listing, a decision which has prompted a rise in its own share price. Mr Meddings was chairman of NHS England for three years, having been appointed in 2022. His other public service roles have included a seven-year stint as a non-executive director of the Treasury. A spokesman for Prudential declined to comment, while Mr Meddings did not respond to a request for comment."
    },
    {
        "title": "Rachel Reeves acknowledges damage of 'too many' budget leaks",
        "description": "The Chancellor Rachel Reeves has acknowledged there were \"too many leaks\" in the run-up to last month's budget.",
        "url": "https://news.sky.com/story/rachel-reeves-acknowledges-damage-of-too-many-budget-leaks-13481744",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-downing-street_7105492.jpg?20251209114945",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-10 11:36:00",
        "Headline": "The chancellor describes leaks as \"unacceptable\" and \"inaccurate\". The cost of UK government borrowing briefly spiked after news reports of a reversal of an expected income tax rise. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The Chancellor Rachel Reeves has acknowledged there were \"too many leaks\" in the run-up to last month's budget. The flow of budget content to news organisations was \"very damaging\", Ms Reeves told MPs on the Treasury select committee on Wednesday. \"Leaks are unacceptable. The budget had too much speculation. There were too many leaks, and much of those leaks and speculation were inaccurate, very damaging\", she said. Money blog: Nine-year-old set up Christmas tree business to pay for university The cost of UK government borrowing briefly spiked after news reports that income taxes would not rise as first expected and Labour would not break its manifesto pledge. An inquiry into the leaks from the Treasury to members of the media is to take place. But James Bowler, the Treasury's top official, who was also giving evidence to MPs, would not say the results of it would be published. Committee chair Dame Meg Hillier asked if the group of MPs could see the full inquiry. \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 \n                  Did Keir Starmer and Rachel Reeves mislead us?\n                 \"I'd have to engage with the people in the inquiry about the views on that\", replied Mr Bowler, permanent secretary to the Treasury.  The entire contents of the budget ended up being released 40 minutes early via independent forecasters, the Office for Budget Responsibility (OBR). A report into this error found the OBR had uploaded documents containing their calculations of budget numbers to a link on the watchdog's website it had mistakenly believed was inaccessible to the public. Tax rises ruled out The chancellor ruled out future revenue-raising measures, including applying capital gains tax to primary residences and changing the state pension triple. Committee member and former chair Dame Harriet Baldwin had noted that the chancellor's previous statement to the MPs when she said she would not overhaul council tax and look at road pricing, turned out to be inaccurate. During the budget, an electric vehicle charge per mile was introduced, as was an additional council tax for those with properties worth £2m or more."
    },
    {
        "title": "Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer",
        "description": "Tax changes announced in the budget could have \"devastating, unintended consequences\" on live music venues, including widespread closures and job losses, trade bodies have warned.",
        "url": "https://news.sky.com/story/live-music-venues-warn-of-devastating-consequences-of-budget-tax-changes-in-letter-to-sir-keir-starmer-13481872",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-live-music-stock_7106780.jpg?20251210191128",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-12-10 18:02:00",
        "Headline": "Trade bodies representing grassroots music venues, as well as arenas such as the OVO Wembley Arena, The O2, and Co-op Live, are warning of price increases, closures and job losses if changes aren't made.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Tax changes announced in the budget could have \"devastating, unintended consequences\" on live music venues, including widespread closures and job losses, trade bodies have warned. The bodies, representing nearly 1,000 live music venues, including grassroots sites as well as arenas such as the OVO Wembley Arena, The O2, and Co-op Live, are calling for an urgent rethink on the chancellor's changes to the business rates system. If not, they warn that hundreds of venues could close, ticket prices could increase, and thousands could lose their jobs across the country. Politics latest: Ex-Olympic swimmer nominated for peerages Business rates, which are a tax on commercial properties in England and Wales, are calculated through a complex formula of the value of the property, assessed by a government agency every three years. That is then combined with a national \"multiplier\" set by the Treasury, giving a final cash amount. The chancellor declared in her budget speech that although she is removing the business rates discount for small hospitality businesses, they would benefit from \"permanently lower tax rates\". The burden, she said, would instead be shifted onto large companies with big spaces, such as Amazon. But both small and large companies have seen the assessed values of their properties shoot up, which more than wipes out any discount on the tax rate for small businesses, and will see the bills of arena spaces increase dramatically. \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 \n                  Rachel Reeves acknowledges damage of 'too many' budget leaks\n                 \n                  Did Keir Starmer and Rachel Reeves mislead us?\n                 In the letter, coordinated by Live, the trade bodies write that the effect of Rachel Reeves's changes are \"chilling\", saying: \"Hundreds of grassroots music venues will close in the coming years as revaluations drive costs up. This will deprive communities of valuable cultural spaces and limit the UK creative sector's potential. These venues are where artists like Ed Sheeran began their career. \"Ticket prices for consumers attending arena shows will increase as the dramatic rise in arena's tax costs will likely trickle through to ticket prices, undermining the government's own efforts to combat the cost of living crisis. Many of these arenas are seeing 100%+ increases in their business rates liability. \"Smaller arenas in towns and cities across the UK will teeter on the edge of closure, potentially resulting in thousands of jobs losses and hollowing out the cultural spaces that keep places thriving.\" They go on to warn that the government will \"undermine its own Industrial Strategy and Creative Sector Plan which committed to reducing barriers to growth for live events\", and will also reduce spending in hotels, bars, restaurants and other high street businesses across the country. To mitigate the impact of the tax changes, they are calling for an immediate 40% discount on business rates for live venues, in line with film studios, as well as \"fundamental reform\" to the system used to value commercial properties in the UK, and a \"rapid inquiry\" into how events spaces are valued.  In response, a Treasury spokesperson told Sky News: \"With Covid support ending and valuations rising, some music venues may face higher costs - so we have stepped in to cap bills with a £4.3bn support package and by keeping corporation tax at 25% - the lowest rate in the G7. \"For the music sector, we are also relaxing temporary admission rules to cut the cost of bringing in equipment for gigs, providing 40% orchestra tax relief for live concerts, and investing up to £10m to support venues and live music.\" But Conservative shadow business secretary Andrew Griffith told Sky News: \"The government has failed to deliver the reform to business rates they promised, and need to change course before more jobs and venues are lost forever.\" The warning from the live music industry comes after small retail, hospitality and leisure businesses warned of the potential for widespread closures due to the changes to the business rates system.  Sky News reported after the budget that the increase in business rates over the next three years following vast increases in the assessed values of commercial properties has left small retail, hospitality and leisure businesses questioning whether their businesses will be viable beyond April next year. Analysis by UK Hospitality, the trade body that represents hospitality businesses, has found that over the next three years, the average pub will pay an extra £12,900 in business rates, even with the transitional arrangements, while an average hotel will see its bill soar by £205,200. Read more: Hospitality pleads for 'lifeline' A Treasury spokesperson said their cap for small businesses will see \"a typical independent pub pay around £4,800 less next year than they otherwise would have\". \"This comes on top of cutting licensing costs to help more venues offer pavement drinks and al fresco dining, maintaining our cut to alcohol duty on draught pints, and capping corporation tax,\" they added."
    },
    {
        "title": "Rachel Reeves acknowledges damage of 'too many' budget leaks",
        "description": "The Chancellor Rachel Reeves has acknowledged there were \"too many leaks\" in the run-up to last month's budget.",
        "url": "https://news.sky.com/story/rachel-reeves-acknowledges-damage-of-too-many-budget-leaks-13481744",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-rachel-reeves-downing-street_7105492.jpg?20251209114945",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-10 11:36:00",
        "Headline": "The chancellor describes leaks as \"unacceptable\" and \"inaccurate\". The cost of UK government borrowing briefly spiked after news reports of a reversal of an expected income tax rise. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The Chancellor Rachel Reeves has acknowledged there were \"too many leaks\" in the run-up to last month's budget. The flow of budget content to news organisations was \"very damaging\", Ms Reeves told MPs on the Treasury select committee on Wednesday. \"Leaks are unacceptable. The budget had too much speculation. There were too many leaks, and much of those leaks and speculation were inaccurate, very damaging\", she said. Money blog: Nine-year-old set up Christmas tree business to pay for university The cost of UK government borrowing briefly spiked after news reports that income taxes would not rise as first expected and Labour would not break its manifesto pledge. An inquiry into the leaks from the Treasury to members of the media is to take place. But James Bowler, the Treasury's top official, who was also giving evidence to MPs, would not say the results of it would be published. Committee chair Dame Meg Hillier asked if the group of MPs could see the full inquiry. \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 \n                  Did Keir Starmer and Rachel Reeves mislead us?\n                 \"I'd have to engage with the people in the inquiry about the views on that\", replied Mr Bowler, permanent secretary to the Treasury.  The entire contents of the budget ended up being released 40 minutes early via independent forecasters, the Office for Budget Responsibility (OBR). A report into this error found the OBR had uploaded documents containing their calculations of budget numbers to a link on the watchdog's website it had mistakenly believed was inaccessible to the public. Tax rises ruled out The chancellor ruled out future revenue-raising measures, including applying capital gains tax to primary residences and changing the state pension triple. Committee member and former chair Dame Harriet Baldwin had noted that the chancellor's previous statement to the MPs when she said she would not overhaul council tax and look at road pricing, turned out to be inaccurate. During the budget, an electric vehicle charge per mile was introduced, as was an additional council tax for those with properties worth £2m or more."
    },
    {
        "title": "PM issues warning to European leaders ahead of ECHR talks",
        "description": "Sir Keir Starmer has called for a tougher approach to policing Europe's borders ahead of a meeting between leaders to discuss a potential shake-up of the European Convention on Human Rights (ECHR).",
        "url": "https://news.sky.com/story/pm-issues-warning-to-european-leaders-ahead-of-echr-talks-13481640",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-starmer-frederiksen_7106193.jpg?20251210041125",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-10 00:30:00",
        "Headline": "The prime minister said European leaders must modernise how the European Convention on Human Rights (ECHR) is interpreted in courts after critics said the agreement was a major barrier to deportations of illegal migrants.",
        "Content": "Sir Keir Starmer has called for a tougher approach to policing Europe's borders ahead of a meeting between leaders to discuss a potential shake-up of the European Convention on Human Rights (ECHR). The prime minister said the way in which the ECHR is interpreted in courts must be modernised, with critics long claiming the charter is a major barrier to deportations of illegal migrants. His deputy, David Lammy, will today be in Strasbourg, France, with fellow European ministers to discuss reforms of how the agreement is interpreted in law across the continent. In an opinion piece for The Guardian, Sir Keir and his Danish counterpart, Mette Frederiksen, said the change was necessary to prevent voters from turning to populist political opponents. What's the issue with the ECHR? The ECHR, which is the foundation of Britain's Human Rights Act, includes the right to family life in its Article 8. That is often used as grounds to prevent deportations of illegal migrants from the UK. \n                  The asylum seeker whose claim has taken so long to process that he's had time to start a family\n                 \n                  Asylum seekers to be banned from using taxis for medical appointments\n                 \n                  Rise in number of asylum seekers being housed in hotels, as official net migration stats are released\n                 There has also been a rise in cases where Article 3 rights, prohibiting torture, were used to halt deportations over claims migrants' healthcare needs could not be met in their home country, according to the Home Office. The Conservatives and Reform UK have both said they would leave the ECHR if in power, while the Labour government has insisted it will remain a member of the treaty. But Sir Keir admitted in his joint op-ed that the \"current asylum framework was created for another era\". \"In a world with mass mobility, yesterday's answers do not work. We will always protect those fleeing war and terror - but the world has changed, and asylum systems must change with it,\" the two prime ministers wrote, as they push for a \"modernisation of the interpretation\" of the ECHR.  What is happening today? Mr Lammy is attending an informal summit of the Council of Europe. He is expected to say: \"We must strike a careful balance between individual rights and the public's interest. \"The definition of 'family life' can't be stretched to prevent the removal of people with no right to remain in the country [and] the threshold of 'inhuman and degrading treatment' must be constrained to the most serious issues.\" It is understood that a political declaration signed by the gathered ministers could carry enough weight to directly influence how the European Court of Human Rights interprets the treaty. The UK government is expected to bring forward its own legislation to change how Article 8 is interpreted in UK courts, and is also considering a re-evaluation of the threshold for Article 3 rights. The plans have been criticised by Amnesty International UK, which described them as weakening protections. \"Human rights were never meant to be optional or reserved for comfortable and secure times. They were designed to be a compass, our conscience, when the politics of fear and division try to steer us wrong,\" Steve Valdez-Symonds, the organisation's refugee and migrant rights programme director, said. Sir Keir's government has already adopted several hardline immigration measures - modelled on those introduced by Ms Federiksen's Danish government - to decrease the number of migrants crossing the Channel via small boats. Read more: UK's immigration shake-up explained  Starmer-Macron deal 'a sticking plaster' Meanwhile, French far-right leader Jordan Bardella told The Daily Telegraph he would rewrite his country's border policy to allow British patrol boats to push back small vessels carrying migrants into France's waters if he were elected. The National Rally leader called Sir Keir's \"one-in, one-out\" agreement with Emmanuel Macron, which includes Britain returning illegal arrivals in exchange for accepting a matching number of legitimate asylum seekers, a \"sticking plaster\" and \"smokescreen\". Read more from Sky News:PM warns of 'lost decade of kids'Storm Bram brings 90mph winds and rain  He said that only a complete overhaul of French immigration policy would stop the Channel crossings. Mr Bardella is currently leading in opinion polls to win the first round of France's next presidential election, expected to happen in 2027, to replace Mr Macron."
    },
    {
        "title": "Ex-Olympic swimmer Sharron Davies and former chief of staff to Rachel Reeves among those to receive peerages",
        "description": "The boss of a supermarket chain, a former head of communications for No 10 and an Olympic swimmer turned women's rights activist are among those to have received a peerage.",
        "url": "https://news.sky.com/story/ex-olympic-swimmer-sharron-davies-and-former-chief-of-staff-to-rachel-reeves-among-those-to-receive-peerages-13481867",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-peerages-katie-martin_7106757.png?20251210182506",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-10 17:37:00",
        "Headline": "Thirty-four people have been put forward for peerages by politicians, with Labour looking to address a House of Lords \"imbalance\".",
        "Content": "The boss of a supermarket chain, a former head of communications for No 10 and an Olympic swimmer turned women's rights activist are among those to have received a peerage. Dozens of people have been nominated for gongs by politicians this afternoon, which are formally conferred by the King. Sir Keir Starmer has put forward 25 people, while Tory leader Kemi Badenoch has nominated three. The Liberal Democrats have put forward five. Politics latest - follow live One person has been put forward by peers in the House of Lords, bringing the total to 34. Among those set to join the upper chamber are Richard Walker, the executive chairman of the supermarket chain Iceland, Matthew Doyle, a former No 10 director of communications, ex-Olympian Sharron Davies and Tory ex-cabinet minister Sir John Redwood. Rachel Reeves's former chief of staff, Katie Martin, is also among those nominated. \n                  With new 25 Labour lords and ladies, Keir Starmer plots end of the peer show for the Tories\n                 \n                  Lord Dannatt and Lord Evans set for House of Lords suspensions over cash for access sting\n                 \n                  Record number of peers expected to join historic assisted dying debate\n                 A Labour source said: \"⁠The Tories stuffed the House of Lords, creating a serious imbalance that has allowed them to frustrate our plans to make working families better off. This needs to be corrected to deliver on our mandate from the British people. \"We will continue to progress our programme of reform, which includes removing the right of hereditary peers to sit and vote in the Lords.\" Despite the Labour appointments, the Tories will remain the largest party in the upper chamber. Other prominent people given peerages by Labour include Carol Linforth, who has been a senior member of the party for years, and most prominently was the one to assist Sir Keir Starmer after a protester threw glitter at him during the 2023 party conference. Len Duvall, the chair of the London Assembly and leader of the Labour group there has also been nominated, as has Sir Michael Barber, an adviser to the prime minister on effective delivery, and councillor Dr Sara Hyde, the chair of the left-leaning thinktank, the Fabian Society. For the Lib Dems, their nominations include party CEO Mike Dixon, ex-chief of staff to Sir Ed Davey, Rhiannon Leaman, and two hereditary peers. It was Ms Badenoch who nominated Ms Davies, who spoke at the Tory party conference, and has been a vocal defender of women's rights - clashing with trans rights activists. Responding to the announcement, a Conservative Party source said: \"We are pleased to have put forward three excellent peers, who will be great additions to the House of Lords. \"We are, however, appalled that the government has broken all precedent by giving the Lib Dems more places than the official Opposition, because they know they can count on the Lib Dems weakly falling into line with everything Labour does in the Lords.\" The Lib Dems, meanwhile, said they are \"delighted\" by the appointments, with Sir Ed Davey insisting that their nominees are \"passionate campaigners... who will continue fighting hard to deliver the change our country desperately needs\". The list can be read in full here."
    },
    {
        "title": "Ministers 'falling short' with £3.5bn plan to halve homelessness, charities warn",
        "description": "Homelessness charities have warned that ministers are \"falling short of what is desperately needed to end Britain's homelessness crisis\".",
        "url": "https://news.sky.com/story/ministers-falling-short-with-16335bn-plan-to-halve-homelessness-charities-warn-13481848",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-homelessness-homeless_7106867.jpg?20251210205231",
        "type": "Politics",
        "Author": "Will Charley",
        "Date Published": "2025-12-10 16:28:00",
        "Headline": "The government has published its new strategy to tackle rough sleeping, but charities say it \"falls short\".",
        "Content": "\n          Political reporter\n              @WillCharley1\n Homelessness charities have warned that ministers are \"falling short of what is desperately needed to end Britain's homelessness crisis\". It comes as the government published its new plan to tackle rough sleeping in Britain, which pledges £3.5bn of funding to crackdown on the issue. But charities have said Labour's National Plan to End Homelessness \"falls short\" and contains \"important gaps\", meaning the party will not be able to achieve their stated goal of halving the number of homeless people by 2029/30. Politics latest - follow live Crisis, an organisation that supports the homeless, also argues that only £100m of the funding announced in the strategy is new. Meanwhile, Labour MP Paula Barker, who co-chairs the All-Party Parliamentary Group (APPG) for ending homelessness, has told Sky News that the strategy has a \"depressing lack of meat on the bone\", looks like it has been \"rushed out\", and has left her \"disappointed\". It comes as Shelter warns that 382,618 people in England - including a record 175,025 children - will be homeless this Christmas, equivalent to one in every 153 people. \n                  Prince William marks 20 years as patron of Centrepoint, a homelessness charity Princess Diana championed\n                 \n                  'Abject failure' as UK's homeless deaths rise - including children\n                 \n                  Nine out of 10 homeless women missing from official government figures, charities warn\n                 What does the government's plan to reduce rough sleeping involve? The government has made three key pledges in its new plan, unveiled on Wednesday evening. It says that it is aiming to halve the number of long-term rough sleepers by the end of the parliament, reduce the time families spend living in bed and breakfasts (B&Bs), and prevent more people from becoming homeless in the first place.  To achieve this, the party has set out numerous new measures, schemes and extra funding. The main objectives are: A new £124m supported housing scheme is also being established, and the government hopes that it will help get 2,500 people in England off the streets. Housing Secretary Steve Reed said homelessness is \"one of the most profound challenges we face\", and suggested that the strategy will build \"a future where homelessness is rare, brief, and not repeated\". How has the plan been received? Ms Barker told Sky News she welcomes \"the scale of investment\", but is \"disappointed by what I have seen\". The Labour MP explained: \"From what I have seen so far, it leaves more questions than it answers - where are the clear measures around prevention? Where is the accommodation for people sleeping rough coming from - has it already been built? What about specialised provision for those fleeing domestic abuse? \"We needed this strategy to be bold.\" Meanwhile, organisations working to support those on the streets have welcomed the plan for its focus on the issue, but warn it leaves it \"almost impossible\" for many families to avoid homelessness. Matt Downie, the chief executive of Crisis, said: \"Housing benefit remains frozen until at least 2030; there is no coherent approach for supporting refugees and stopping them becoming homeless; and we hear no assurances that the new homes government has pledged to build will be allocated to households experiencing homelessness at the scale required. \"There is a long way to go. Ministers are taking steps in the right direction, but falling short of what's desperately needed to end Britain's homelessness crisis.\" Sarah Elliott, head of Shelter, also warned the proposals do not go far enough, saying: \"Until a lot more of these social homes are built, one of the only ways to escape homelessness is if you can afford to pay a private rent. \"We know from our frontline services this is almost impossible to do when housing benefit remains frozen, and that is where the homelessness strategy falls short.\" Centrepoint, a charity that supports young people facing homelessness, said that the strategy is \"an important step\", and could be \"transformative\". But it added that \"gaps in the government's approach remain\", and said increases in funding \"don't face up to the scale of homelessness\". The Conservatives have said that the strategy means Labour \"has completely failed on homelessness\". Paul Holmes, shadow housing minister, said the number of households and children in temporary accommodation has risen to \"record levels\", and pointed to the government's \"abysmal record on house-building\" and tackling immigration."
    },
    {
        "title": "Keir Starmer belatedly defends Sadiq Khan after 'horrible mayor' jibe - and calls out Donald Trump comments",
        "description": "Downing Street has belatedly hit back at comments made by Donald Trump about the Mayor of London, saying the remarks were \"wrong\".",
        "url": "https://news.sky.com/story/keir-starmer-belatedly-defends-sadiq-khan-after-horrible-mayor-jibe-and-calls-out-donald-trump-comments-13481832",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sadiq-khan-sir-keir-starmer_7106681.jpg?20251210160547",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-10 15:31:00",
        "Headline": "The US president has labelled the Mayor of London a \"disaster\" in office - but the prime minister is \"hugely proud\" of his record.",
        "Content": "Downing Street has belatedly hit back at comments made by Donald Trump about the Mayor of London, saying the remarks were \"wrong\". The US president used an interview with Politico on Tuesday to hit out at Sir Sadiq Khan, who he called a \"disgusting mayor\", and implied the Labour politician gets elected only \"because so many people have come in\". Politics latest - follow live Mr Trump told the publication's podcast, The Conversation: \"Look at… your mayor of London. He's a disaster. He's a disaster. \"He's got a totally different ideology of what he's supposed to have. And he gets elected because so many people have come in.\" Mr Trump added: \"He's a horrible mayor. He's an incompetent mayor, but he's a horrible, vicious, disgusting mayor. I think he's done a terrible job. London's a different place.\" In a wide-ranging interview, the president also hit out at European leaders for wanting to be \"so politically correct\", and warned that Europe is being led by \"weak\" people who are failing to control immigration. \n                  Trump's high seas raid may be followed by something much more severe\n                 \n                  US accused of 'piracy' after footage shows armed troops storm tanker off Venezuela\n                 \n                  US plans to start checking all tourists' social media\n                 Downing Street initially declined to criticise Mr Trump's comments on Tuesday, insisting that Sir Keir Starmer has a \"strong relationship\" both with the US president and with Labour mayor, Sir Sadiq. The PM also held a planned closed-doors meeting with the US ambassador Warren Stephens on Tuesday. Read more:Trump is 'racist, sexist and Islamophobic', says KhanKhan a 'terrible mayor', London wants Sharia law - Trump But, in an apparent about-turn, the prime minister's spokesperson openly criticised Mr Trump's comments on Wednesday, saying that Sir Keir has \"made clear\" that they were \"wrong\". They added: \"The mayor is doing an excellent job. The PM is hugely proud of the mayor's record, and he's proud to call him a colleague and a friend.\" Pushed again on Mr Trump's comments, the spokesperson pointed back to Sir Keir's comments to the US president following his state visit to the UK in September.  Speaking to the UN General Assembly that month, Mr Trump attacked both Sir Sadiq - he called him \"a terrible mayor\" - and London, which he said wants \"to go to Sharia law\". The mayor responded by branding Mr Trump as \"racist, sexist, misogynistic\" and \"Islamophobic\", adding that he was \"living rent-free\" in the president's head. Sir Keir later responded to that incident by saying he was \"really proud of the fact we have a Muslim mayor of a very diverse city\", and that \"on this issue, I disagree\" with the US president. The latest mudslinging between two men between whom there is no love lost Mr Trump's comments about Sir Sadiq are merely the latest insults hurled across the Atlantic in a public spat that dates back to the US president's first state visit in 2018, when the mayor gave permission to protestors to fly a giant blimp of the president styled as a baby. Sir Sadiq responded to Mr Trump's latest comments in his own interview with Politico, where he suggested the US president had become \"obsessed\" with him. He also suggested that Americans are \"flocking\" to live in London - because its values are the \"antithesis\" of the US."
    },
    {
        "title": "GCHQ releases annual Christmas puzzle - can you solve it?",
        "description": "GCHQ has released its annual Christmas challenge, with seven puzzles aimed to put the nation's codebreaking skills to the test.",
        "url": "https://news.sky.com/story/gchq-releases-annual-christmas-puzzle-can-you-solve-it-13481794",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-gchq-christmas-challenge_7106642.jpg?20251210145615",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-10 13:33:00",
        "Headline": "The puzzles are geared towards testing a range of skills that the UK's intelligence agency uses every day to keep the country safe.",
        "Content": "GCHQ has released its annual Christmas challenge, with seven puzzles aimed to put the nation's codebreaking skills to the test. Devised by in-house puzzlers at the UK's intelligence agency, the challenge is geared towards testing a range of skills to unlock a festive message. This year, for the first time, extra puzzles feature on the front of the card. These were designed by three schoolchildren, after more than 500 children entered the agency's competition to hunt down the best budding spies. Some challenges involve codebreaking, maths and analysis, while others test skills including lateral thinking, ingenuity and perseverance - the same blend of skills GCHQ said are used every day to keep the country safe. However \"no one will find them easy\", the agency's chief puzzler - known only as Colin - said. The Christmas card competition tasked schoolchildren with answering the question: 'What do you think GCHQ looks like on Christmas Day?' as well as putting hidden codes and puzzles into their designs. The winning designs came from Haoran, a year 8 student from Wilson's School in London, Mariia, a year 10 student at the Henry Beaufort School in Winchester, and year 12 student Amelie from South Wilts Grammar School in Salisbury. GCHQ director Anne Keast-Butler, was one of those tasked with picking the winners. She said she hopes the challenge will \"inspire the next generation to explore STEM subjects and consider the rewarding careers available in cybersecurity and intelligence\". Read more from Sky News:Author Sophie Kinsella diesStorm Bram brings winds, rain and flooding to parts of UK This year's Christmas cards - and challenges - are available to download from GCHQ.gov.uk. Answers will be published by the intelligence agency at 9pm on Wednesday 10 December."
    },
    {
        "title": "Do you have ringing in your ears? For millions who do, there could now be a solution",
        "description": "Do you suffer from ringing in your ears? For millions of people in the UK who do, researchers say they may have found a solution.",
        "url": "https://news.sky.com/story/do-you-have-ringing-in-your-ears-for-millions-who-do-there-could-now-be-a-solution-13481300",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-woman-tinnitus_7105568.jpg?20251209125647",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-12-10 00:01:00",
        "Headline": "A new sound therapy was found to have quietened tinnitus by around 10% on average, which lasted for around three weeks after the treatment finished.",
        "Content": "Do you suffer from ringing in your ears? For millions of people in the UK who do, researchers say they may have found a solution. Experts are hopeful that a new sound therapy for tinnitus could one day be available as a smartphone app. The therapy involves patients listening to modified sounds in an effort to disrupt patterns of activity in their brains and quieten the ringing. The trial, led by Newcastle University and part-funded by RNID, the national charity for deaf people, included 77 patients with tinnitus, which can be caused by hearing loss, certain medications or depression and anxiety. Tinnitus leaves people with the perception of noises such as buzzing, humming, throbbing or hissing, despite there being no outside sound. Dr Will Sedley, consultant neurologist and researcher at Newcastle University, said: \"At the moment, there aren't really very good treatments to get rid of the tinnitus sound, and it's all about helping people disengage and learn to live better with the symptom.\" The researchers made small changes to synthetic musical notes for one group, while other patients were given placebo sounds to listen to, which had been modified to different frequencies. The groups listened to sounds online for an hour a day over six weeks, before having a three-week break. They then listened for another six weeks, with the sounds swapped, although patients were not aware which sound was the modified musical note and which was the placebo. Read more from Sky News:'Unacceptable' maternity careCOVID fraud cost taxpayers £11bn Dr Sedley said, on average, \"people listening to the active ones, but not the placebo ones, during that phase did get a significant quieting of their tinnitus\". The therapy quietened tinnitus by around 10% on average, which lasted for around three weeks after the treatment finished, the study found. Researchers are hopeful that the therapy can be developed further. Dr Sedley added: \"There's all manner of different modifications we can make to the sounds themselves, or how long a day you listen for. \"If we could build this into the normal, listening to music, and talk radio, podcasts, people are doing anyway, they could rack up hours and hours of listening every day.\""
    },
    {
        "title": "Iceland to boycott Eurovision over Israel's participation",
        "description": "Iceland has announced it is boycotting next year's Eurovision over Israel's participation in the competition, saying taking part would \"neither be a source of joy nor peace\".",
        "url": "https://news.sky.com/story/iceland-to-boycott-eurovision-over-israels-participation-13481807",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-vaeb-eurovision_6919881.jpg?20250517211645",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-12-10 13:56:00",
        "Headline": "The announcement from Iceland's broadcaster, RUV, follows withdrawals by broadcasters from the Netherlands, Spain, Ireland and Slovenia.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Iceland has announced it is boycotting next year's Eurovision over Israel's participation in the competition, saying taking part would \"neither be a source of joy nor peace\". The announcement from Iceland's RUV follows withdrawals by broadcasters from the Netherlands, Spain, Ireland and Slovenia. In a statement, RUV said participation of Israeli national broadcaster KAN had \"created disunity\" among members of the European Broadcasting Union (EBU), which organises Eurovision, and the general public. Israel's place in the contest was confirmed at the EBU's general assembly last week. The past two events have attracted protests and fan boycotts over Israel's inclusion amid the country's military action in Gaza. This year, there were also allegations that voting had been manipulated in favour of their contestant. After growing criticism, members were asked to vote in a secret ballot last week on whether they were happy with tougher new rules introduced in November, or whether they wanted a second vote on participation for 2026. The majority agreed the changes were enough, although Sky News understands 11 countries were against accepting these without a further vote. Dutch broadcaster AVROTROS, Spain's RTVE, Ireland's RTE and Slovenia's RTV immediately issued statements announcing their withdrawal. Becoming the fifth broadcaster to pull out, RUV made the announcement following a board meeting. It said that while the new rules address many of the concerns it has raised, it believes there are \"still doubts\" about whether the changes are enough. Has issue damaged Eurovision? \"RUV has repeadly raised concerns that various Icelandic stakeholders, such as artist associations and the general public, were opposed to participation in the contest,\" the statement said. \"Furthermore, RUV had requested the EBU to exclude KAN from the contest in accordance to precedents. \"It is a complex matter which has already damaged the contest's reputation and EBU, emphasising the necessity of a solution for all concerned parties.\" Austria, which will host next year's show, last week said it was pleased to see Israel allowed to participate. Roland Weissmann, director-general for Austrian broadcaster ORF, said the contest was a \"competition for broadcasters, not governments\". KAN chief executive Golan Yochpaz has said attempts to remove them from the contest could \"only be understood as a cultural boycott\". What have other broadcasters said? The BBC, which broadcasts Eurovision in the UK, also said it supported the decision. Earlier on Wednesday, Poland's TVP confirmed its participation. In a statement, the broadcaster said it was aware of the scale of the tension surrounding the competition and understood the emotions and concerns raised. \"However, we believe that Eurovision still has a chance to once again become a space filled with music. And only music,\" a TVP statement said. Read more from Sky News:The teens hoping to outsmart Australia's social media banGCHQ releases Christmas puzzle - can you solve it? Despite some pressure from the cultural union in Belgium for a boycott, broadcaster RTBF also confirmed its participation last week. But the walkouts cast a shadow over what is meant to be a celebration of the unifying power of music. Countries have pulled out or been banned in previous years - most notably Russia in 2022, just days after the invasion of Ukraine - but this is perhap's Eurovision's biggest political crisis. Noa Kirel, who represented Israel in 2023, told Sky News in an interview in October that while the situation now is \"very different\" from when she took part in May of that year, she believes it should not be about politics and must \"focus on the music\". Today was the deadline for broadcasters to confirm participation. A final list of competing nations will be published early next week, the EBU said. In response to RUV's decision, Eurovision director Martin Green said: \"We respect the decision of all broadcasters who have chosen not to participate in next year's Eurovision Song Contest and hope to welcome them back soon... \"We look forward to welcoming around 35 broadcasters and their artists to Vienna next May.\""
    },
    {
        "title": "Sophie Kinsella, author of Shopaholic series of novels, dies aged 55",
        "description": "Sophie Kinsella, the author of the Shopaholic series of novels, has died aged 55, her family have said.",
        "url": "https://news.sky.com/story/sophie-kinsella-author-of-shopaholic-series-of-novels-dies-aged-55-13481772",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sophie-kinsella-author_7106545.jpg?20251211005423",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-10 12:48:00",
        "Headline": "The writer, whose real name was Madeleine Sophie Wickham, revealed last year that she had been diagnosed with an aggressive form of brain cancer in 2022.",
        "Content": " Sophie Kinsella, the author of the Shopaholic series of novels, has died aged 55, her family have said. The writer, whose real name was Madeleine Sophie Wickham, revealed last year she had been diagnosed with an aggressive form of brain cancer in 2022. A statement posted to her Instagram account read: \"We are heartbroken to announce the passing this morning of our beloved Sophie (aka Maddy, aka Mummy). She died peacefully, with her final days filled with her true loves: family and music and warmth and Christmas and joy. \"We can't imagine what life will be like without her radiance and love of life. \"Despite her illness, which she bore with unimaginable courage, Sophie counted herself truly blessed - to have such wonderful family and friends, and to have had the extraordinary success of her writing career. She took nothing for granted and was forever grateful for the love she received. \"She will be missed so much our hearts are breaking.\" Kinsella's novels have sold more than 45 million copies in more than 60 countries, and have been translated into more than 40 languages. \n                  Iceland to boycott Eurovision over Israel's participation\n                 \n                  Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer\n                 \n                  Why is Warner Bros for sale, what are the controversial bids – and how is Trump involved?\n                 In April 2024, she revealed she had been diagnosed with an aggressive form of brain cancer in 2022. In a post on social media, Kinsella said she had been receiving chemotherapy and radiotherapy at London's University College Hospital, and had undergone \"successful\" surgery. She said she \"wanted for a long time to share with you a health update and I've been waiting for the strength to do so\". \"At the end of 2022 I was diagnosed with glioblastoma, a form of aggressive brain cancer,\" she said. \"I did not share this before because I wanted to make sure that my children were able to hear and process the news in privacy and adapt to our 'new normal'. \"At the moment all is stable and I am feeling generally very well, though I get very tired and my memory is even worse than it was before! \"I am so grateful to my family and close friends who have been an incredible support to me, and to the wonderful doctors and nurses who have treated me.\" Kinsella's most recent book is What Does it Feel Like?, published in October 2024 and which \"is fiction, but it is my most autobiographical work to date\", the author wrote on her website. Read more:'Unacceptable' prostate supplement adverts bannedDavid Cameron reveals he has been treated for prostate cancer Other books by the London-born author include The Burnout, released in October 2023, Can You Keep A Secret? and The Undomestic Goddess. The first two novels in her hit eight-book Shopaholic series, The Secret Dreamworld Of A Shopaholic and Shopaholic Abroad, were adapted into the 2009 film Confessions Of A Shopaholic, starring Isla Fisher. She is survived by her children, four sons and a daughter, and her husband Henry Wickham. Author Jojo Moyes, who was friends with Kinsella for decades, told the UK Tonight With Sarah-Jane Mee her characters \"were flawed and messy but they were also relatable and you always finished a Sophie Kinsella book feeling better about yourself\". Describing her mentor as \"graceful\", \"kind\" and \"encouraging\", she said those who knew her \"will always be grateful to have had her in our lives. \"If the thing that you are remembered for is joy and grace and kindness, as well as your talent, what more can any of us ask?\" Bill Scott-Kerr, publisher at Transworld, the publishing home of Kinsella for the past 30 years, said: \"She has been such an unshakeable pillar of our publishing at Transworld for so many years that the thought of a year without a Sophie Kinsella to publish is inconceivable.\" He added: \"Maddy leaves behind a glorious and indelible legacy: a unique voice, an unquenchable spirit, a goodness of intent and a body of work that will continue to inspire us to reach higher and be better, just like so many of her characters. \"On a personal level Maddy was the embodiment of joy, an extraordinarily clever, funny, sassy, impish, kind and generous collaborator who brought light into our lives. She was as part of this company as anyone, and we will all truly miss her.\""
    },
    {
        "title": "Live music venues warn of 'devastating consequences' of budget tax changes in letter to Sir Keir Starmer",
        "description": "Tax changes announced in the budget could have \"devastating, unintended consequences\" on live music venues, including widespread closures and job losses, trade bodies have warned.",
        "url": "https://news.sky.com/story/live-music-venues-warn-of-devastating-consequences-of-budget-tax-changes-in-letter-to-sir-keir-starmer-13481872",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-live-music-stock_7106780.jpg?20251210191128",
        "type": "Entertainment",
        "Author": "Ben Bloch",
        "Date Published": "2025-12-10 18:02:00",
        "Headline": "Trade bodies representing grassroots music venues, as well as arenas such as the OVO Wembley Arena, The O2, and Co-op Live, are warning of price increases, closures and job losses if changes aren't made.",
        "Content": "\n          Political reporter\n              @realBenBloch\n Tax changes announced in the budget could have \"devastating, unintended consequences\" on live music venues, including widespread closures and job losses, trade bodies have warned. The bodies, representing nearly 1,000 live music venues, including grassroots sites as well as arenas such as the OVO Wembley Arena, The O2, and Co-op Live, are calling for an urgent rethink on the chancellor's changes to the business rates system. If not, they warn that hundreds of venues could close, ticket prices could increase, and thousands could lose their jobs across the country. Politics latest: Ex-Olympic swimmer nominated for peerages Business rates, which are a tax on commercial properties in England and Wales, are calculated through a complex formula of the value of the property, assessed by a government agency every three years. That is then combined with a national \"multiplier\" set by the Treasury, giving a final cash amount. The chancellor declared in her budget speech that although she is removing the business rates discount for small hospitality businesses, they would benefit from \"permanently lower tax rates\". The burden, she said, would instead be shifted onto large companies with big spaces, such as Amazon. But both small and large companies have seen the assessed values of their properties shoot up, which more than wipes out any discount on the tax rate for small businesses, and will see the bills of arena spaces increase dramatically. \n                  Reeves misses opportunity to end loop of permanent budget speculation\n                 \n                  Rachel Reeves acknowledges damage of 'too many' budget leaks\n                 \n                  Did Keir Starmer and Rachel Reeves mislead us?\n                 In the letter, coordinated by Live, the trade bodies write that the effect of Rachel Reeves's changes are \"chilling\", saying: \"Hundreds of grassroots music venues will close in the coming years as revaluations drive costs up. This will deprive communities of valuable cultural spaces and limit the UK creative sector's potential. These venues are where artists like Ed Sheeran began their career. \"Ticket prices for consumers attending arena shows will increase as the dramatic rise in arena's tax costs will likely trickle through to ticket prices, undermining the government's own efforts to combat the cost of living crisis. Many of these arenas are seeing 100%+ increases in their business rates liability. \"Smaller arenas in towns and cities across the UK will teeter on the edge of closure, potentially resulting in thousands of jobs losses and hollowing out the cultural spaces that keep places thriving.\" They go on to warn that the government will \"undermine its own Industrial Strategy and Creative Sector Plan which committed to reducing barriers to growth for live events\", and will also reduce spending in hotels, bars, restaurants and other high street businesses across the country. To mitigate the impact of the tax changes, they are calling for an immediate 40% discount on business rates for live venues, in line with film studios, as well as \"fundamental reform\" to the system used to value commercial properties in the UK, and a \"rapid inquiry\" into how events spaces are valued.  In response, a Treasury spokesperson told Sky News: \"With Covid support ending and valuations rising, some music venues may face higher costs - so we have stepped in to cap bills with a £4.3bn support package and by keeping corporation tax at 25% - the lowest rate in the G7. \"For the music sector, we are also relaxing temporary admission rules to cut the cost of bringing in equipment for gigs, providing 40% orchestra tax relief for live concerts, and investing up to £10m to support venues and live music.\" But Conservative shadow business secretary Andrew Griffith told Sky News: \"The government has failed to deliver the reform to business rates they promised, and need to change course before more jobs and venues are lost forever.\" The warning from the live music industry comes after small retail, hospitality and leisure businesses warned of the potential for widespread closures due to the changes to the business rates system.  Sky News reported after the budget that the increase in business rates over the next three years following vast increases in the assessed values of commercial properties has left small retail, hospitality and leisure businesses questioning whether their businesses will be viable beyond April next year. Analysis by UK Hospitality, the trade body that represents hospitality businesses, has found that over the next three years, the average pub will pay an extra £12,900 in business rates, even with the transitional arrangements, while an average hotel will see its bill soar by £205,200. Read more: Hospitality pleads for 'lifeline' A Treasury spokesperson said their cap for small businesses will see \"a typical independent pub pay around £4,800 less next year than they otherwise would have\". \"This comes on top of cutting licensing costs to help more venues offer pavement drinks and al fresco dining, maintaining our cut to alcohol duty on draught pints, and capping corporation tax,\" they added."
    }
]