[
    {
        "title": "Putin has agreed Ukraine can have 'NATO-style' security guarantee, Trump envoy says",
        "description": "Vladimir Putin has agreed to allow Ukraine's allies to offer it a NATO-like security guarantee as part of an eventual deal to end the war, according to US special envoy Steve Witkoff.",
        "url": "https://news.sky.com/story/putin-has-agreed-ukraine-can-have-nato-style-security-guarantee-trump-envoy-says-13413433",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-putin-vladimir_6993936.jpg?20250817182658",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-17 11:36:00",
        "Headline": "Steve Witkoff said it was the first time he had heard the Russian president agree to the suggestion - and called it \"game-changing\".",
        "Content": " Vladimir Putin has agreed to allow Ukraine's allies to offer it a NATO-like security guarantee as part of an eventual deal to end the war, according to US special envoy Steve Witkoff. Mr Witkoff said the Russian president agreed to the move when he met with Donald Trump in Alaska on Friday. Speaking to CNN on Sunday, Mr Witkoff, who was by the US president's side at the summit, said: \"We were able to win the following concession: That the United States could offer Article 5-like protection, which is one of the real reasons why Ukraine wants to be in NATO.\" Article 5 is a core principle of the 32-member collective, which states that an armed attack against one or more of its members shall be considered an attack against all. It has only been invoked once, by the US, in the wake of the 9/11 attacks in 2001. Russia has repeatedly insisted that Ukraine cannot be allowed to join NATO and has dismissed the idea that NATO member forces could be peacekeepers under some sort of ceasefire deal. Mr Witkoff, who has previously met with Mr Putin to discuss an end to the Ukraine war, said Friday's summit was the first time he had heard the Russian president agree to the suggestion of NATO-like protection - and called it \"game-changing\". His comments came as Volodymyr Zelenskyy met with European Commission President Ursula von der Leyen in Brussels. The Ukrainian president said in a post on X: \"This is a historic decision that the United States is ready to take part in security guarantees for Ukraine. \"Security guarantees, as a result of our joint work, must really be very practical, delivering protection on land, in the air, and at sea, and must be developed with Europe's participation.\" Ms von der Leyen, speaking at a news conference with the Ukrainian president, said the European Union \"is ready to do its share\". EU leaders to join Zelenskyy at White House Sunday afternoon also saw Ms von der Leyen and Mr Zelenskyy dial in to a meeting with the coalition of the willing, a peacekeeping alliance of European leaders - some of whom will accompany Mr Zelenskyy to meet with Mr Trump tomorrow. Ms von der Leyen will be at the crunch talks in Washington DC, as will Sir Keir Starmer, France's Emmanuel Macron and Italy's Giorgia Meloni. Germany's Chancellor Friedrich Merz and NATO Secretary General Mark Rutte will also be in attendance, after the US president reportedly extended an invitation to European leaders. Read more: Why is Zelenskyy bringing a posse of leaders? Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine during his summit with Mr Trump as a condition for ending the war. In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Mr Trump is said to be planning to urge Mr Zelenskyy to agree to the conditions as part of a peace deal to end the war. That's despite the Ukrainian president previously ruling out formally handing any territory to Moscow, which he says would be impossible under the country's constitution, and would deprive Ukraine of defensive lines and open the way for Moscow to conduct further offensives. In coordinated statements following the Alaska summit, European leaders said Mr Zelenskyy must play a greater role in future talks, and that peace cannot be achieved without him. The US president said the Washington talk with Mr Zelenskyy could potentially pave the way for a three-way meeting with Mr Putin. Read more from Sky News:The territory Ukraine could be told to surrenderBody language expert unpacks Alaska summit On Saturday, Downing Street insisted Sir Keir and other allies stand ready to support the next phase of talks to end the war. \"At the meeting that will take place at the White House tomorrow, the Prime Minister, with other European partners, stands ready to support this next phase of further talks and will reaffirm that his backing for Ukraine will continue as long as it takes,\" a statement from No 10 said."
    },
    {
        "title": "The stakes are high - and the unity of the alliance against Putin has never been so threatened",
        "description": "When Volodymyr Zelenskyy and his European allies meet Donald Trump in Washington, a huge amount is at stake.",
        "url": "https://news.sky.com/story/the-stakes-are-high-and-the-unity-of-the-alliance-against-putin-has-never-been-so-threatened-13413864",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_6994111.jpg?20250817231856",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "The challenge for Volodymyr Zelenskyy for his talks with Donald Trump at the White House is to avoid a repeat of the disastrous encounter the last time they met there.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  When Volodymyr Zelenskyy and his European allies meet Donald Trump in Washington, a huge amount is at stake. Ukrainian officials are reported to feel betrayed by the US president, who appears to have shifted position to side with Vladimir Putin on a number of key points in the wake of the meeting with him in Alaska. Trump has undermined the unity of the Western alliance by abandoning their calls for an immediate ceasefire in Ukraine. He is no longer threatening more severe sanctions, and more worryingly still he seems open to the idea of making the Ukrainians hand over territory the Russians have not yet captured. He and his real estate lawyer turned rookie negotiator Steve Witkoff seem to believe the conflict can be resolved by an exchange of territory. Putin on the other hand has made it clear he is fighting to extinguish Ukraine as an independent and democratic entity. Read more:Putin has 'agreed NATO-style security guarantee'How a chaotic 24 hours unfoldedWhy is Zelenskyy bringing posse of leaders to talks? Ukrainians say that for Zelenskyy, handing over land his troops have been fighting to defend since 2014 would be politically suicidal and strategically insane. Sergeant Andriy Poluhin, from the Ukrainian 24th Brigade, has fought the Russians in Donetsk on and off since 2015 and is currently based in the fiercely embattled town of Chasiv Yar. 👉 Follow Trump100 on your podcast app 👈 He's typical of many Ukrainians, appalled at the idea his country would have to hand over land so many of their comrades have died fighting for. Putin's claim that he wants to end the war and stop the killing, he says, is self-evidently false. \"It's a lie, it's obviously a lie. I think it's not only my thoughts or Ukrainian ones, but everyone who deals with Russia understands he just lies,\" he says.  Many would agree - except the US president himself, who says he believes the Russian leader wants the killing to end. The challenge for Zelenskyy and his European outriders when they go to the White House is avoiding a repeat of the disastrous Oval Office encounter between him and Trump and his vice president in February. They need to steer Trump back to their side of the argument without angering the famously thin-skinned president and driving him further towards Moscow. The unity of the alliance against Putin has never been so threatened."
    },
    {
        "title": "'Not in our name': Israelis protest against Gaza war - but Netanyahu seems unmoved",
        "description": "The coordinates came through last minute. The instruction was to get there fast.",
        "url": "https://news.sky.com/story/not-in-our-name-israelis-protest-against-gaza-war-but-netanyahu-seems-unmoved-13413778",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza_6993991.jpg?20250817191330",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-17 17:45:00",
        "Headline": "Tyres were set alight and roads blocked as Israelis took their anger with the Gaza conflict onto the streets for what was called a \"day of stoppage\".",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  The coordinates came through last minute. The instruction was to get there fast. People organising demonstrations, blocking motorways and major intersections, did not want police getting wind of their plans. The one we found ourselves at, near the town of Lod, halfway between Tel Aviv and Jerusalem, felt a bit like a flash-mob protest, done and dusted in less than half an hour. The protestors had set fire to tyres, which blazed across the motorway, filling the sky with thick black smoke. They waved the Israeli flag and other yellow flags to show solidarity with the remaining hostages still in Gaza, whose photos they carried - their faces and names seared on the collective consciousness now - a collective trauma. \"We want the war to end, we want our hostages back, we want our soldiers back safe home, and we want the humanitarian disaster in Gaza to end\", one of the protestors told me. \"We do not want to have these crimes made in our name.\" And then she was gone, off to the next location as the group vanished in a matter of minutes, leaving police to put out the fire. This was a day of stoppage, a nationwide strike - a change of tactics by the hostage families to up the ante with the government in their calls to stop the war, make a deal and bring the hostages home. Benjamin Netanyahu was unmoved. \"Those who are calling for an end to the war today without defeating Hamas are not only hardening Hamas's stance and delaying the release of our hostages, they are also ensuring that the horrors of October 7 will recur again and again\", he said at the start of the weekly cabinet meeting. Netanyahu 'broke contract' with us Ahead of the day of strike action, we spoke to a former Air Force reservist who quit in April in protest over Netanyahu's decision to break the ceasefire. \"I felt he hadn't broken the contract with Hamas, he'd broken the contract with us - with the people, releasing the hostages, stopping the war. That was my breaking point.\" He wanted to be anonymous, identifying himself by the call sign 'F'. He had done three tours since the war began, mostly spent with eyes on Gaza - coordinating air strikes to support ground operations and ensuring the Air Force gets the target right.  'This is eternal war' \"It's very complicated, very demanding and very hectic. The main problem is to see that you follow the rules and there are lots of rules - safety rules, international law rules, military doctrine rules. \"And to see that there are no mistakes because you can check all the rules, you can make everything perfect, if there's a mistake, it bypasses everything you did and the bomb would fall on someone you didn't want it to fall on.\" I ask him how he feels about the huge death toll in Gaza. \"Look, the uninvolved death toll is tough. It's tough personally, it's tough emotionally, it's tough professionally. It shouldn't happen. \"When you conduct a war at this scale, it will happen. It will happen because of mistakes, because of the chaos of war.\"  He is softly spoken, considered and thoughtful, but says he's prepared to take part in the more radical protest actions, such as blocking motorways and starting fires, to try and get the message through. Read more on Sky News:'More than 100 killed in a day'Gaza's hospitals 'overwhelmed'Madonna urges papal intervention \"Hamas is probably the weakest enemy we have had since 1948,\" he says. \"In '48, in the liberation of Israel, we fought seven armies, much better equipped, better ordered than us, and the war took less time. \"We stopped the war with Iran after 12 days. They are much more dangerous than Hamas. We stopped a war with Hezbollah in a couple of months, and they are still a much bigger threat than Hamas. \"You cannot eliminate a terror organisation to the last person. From my point of view, this way - this is eternal war.\""
    },
    {
        "title": "Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness",
        "description": "Chrystal Hendry finished her psychology degree in 2021 and was excited to move to the next phase of her life - working towards becoming a counsellor - when she first became homeless.",
        "url": "https://news.sky.com/story/waiting-for-the-bailiffs-but-nowhere-to-go-sharp-rise-in-number-of-disabled-homeless-people-13411687",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-disability-housing_6990722.png?20250818025510",
        "type": "Home",
        "Author": "Joely Santa Cruz, data journalist, and Becky Johnson, social affairs correspondent",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "A Sky News investigation finds there is a severe shortage of homes suitable for those with a disability, leaving many across England in need of a safe place to live - and most councils don't even know how many disabled people need social housing.",
        "Content": "By Joely Santa Cruz, data journalist, and Becky Johnson, social affairs correspondent   Chrystal Hendry finished her psychology degree in 2021 and was excited to move to the next phase of her life - working towards becoming a counsellor - when she first became homeless. Chrystal, 30, has spinal muscular atrophy and uses a wheelchair. She needs round-the-clock care, as well as home adaptations, such as a bed hoist and wet room, to live comfortably. Several months after being evicted in 2021, and following a \"really awful\" period in inappropriate housing, she managed to find somewhere to rent in a different town, where she now lives. It has never been the ideal home - the temporary ramps are a struggle. But it was better than the alternatives suggested by her council, including moving her live-in care team and equipment into one bedroom in an elderly dementia care home. Four years on, she's being evicted again. Chrystal is one of the 70,000 households with a physical disability in England now facing homelessness. Her landlord wants to redevelop the home she lives in and has issued a 'no fault' eviction notice, which has progressed to a court repossession order. \n                  A-level results show deepening inequality despite vows to tackle attainment gaps\n                 \n                  More small boat arrivals under Starmer than Sunak, despite ex-PM being in power seven months longer\n                 \n                  What does the data tell us about road traffic accidents in the UK?\n                 Now, she's waiting for the bailiffs to arrive. \"It just never ended, it's still not ended four years later. I still can't even think about building a career or giving back to anybody because I'm so consumed with it,\" Chrystal told Sky News. \"At this moment in time, I have no idea where I'm going to go,\" she said. \"For anybody a bailiff knocking on your door is scary, but when you've got fundamental pieces of equipment that you cannot live without it's even scarier.\" Chrystal's experience is not unique. Among households who approached their local council for homelessness assistance in the latest year, one in five had physical ill health and disability support needs. It's a growing issue - there were nearly 70,000 such households in 2024/25, up from around 40,000 four years earlier, according to Sky News analysis of government data. This represents a 72% increase, more than three times the 20% rise in the overall number of households seeking homelessness support. The number of homeless or at-risk households with a physical disability support need increased more than any other demographic over the period. They now represent 21% of households, up from 13% of households in 2020/21. Councils 'not taking it seriously' Sky News and housing campaigner Kwajo Tweneboa sent Freedom of Information requests to English councils asking how many people were waiting for accessible social housing, and how long they wait on average. Their responses reveal a troubling lack of understanding of accessible housing needs in their areas. Two in three couldn't say how many people with disabilities were waiting, while four in five weren't able to estimate how long they could expect to wait. Kensington and Chelsea Council disclosed one of the longest waits among those who did respond. It said people waited more than six and a half years for accessible social housing, a year and three months longer than for one-bedroom properties. But we don't have the full picture, as most simply couldn't provide figures. \"The fact most didn't provide data on this issue shows the lack of seriousness shown towards those with disabilities and their needs,\" Mr Tweneboa said. \"All it takes is for any of us to have an accident and we may need those services. \"We also have an ageing population; no doubt more and more people are going to have additional needs,\" he added. There are five million more people in the UK with a disability than there were a decade ago, according to the government's Family Resources Survey. Mobility issues are most common, affecting just under half of those with a disability. Home builders bypassing 'very simple things' \"We currently do not have enough accessible homes here in England,\" Millie Brown, deputy director for the homes team at the Centre for Ageing Better, told Sky News. \"We know that 20% of people are currently living with a disability, but only 13% of homes across England are built to accessibility standards which support them to live healthy and independent lives. \"Things such as step-free access to the home, a toilet on the ground level, doors that are wide enough to fit wheelchairs, for example. \"Very simple things that make it so disabled and older people can live in their homes independently.\" These criteria, alongside a 'flush threshold' - where the floor on either side of doorways are level - are outlined as the four basic criteria for accessibility, which 13% of homes in England meet as of the latest data for 2022. It's not always possible to retrofit existing homes to these standards, but campaigners argue they should be mandatory for new-build properties. Plans under the previous government to raise accessibility standards for new homes never materialised and there has been a \"lack of action from both the previous government and the current government\", said Ms Brown. 'Couldn't even get through the door' Many councils told us they operate a \"choice-based letting system\" - meaning people waiting for social housing can bid for properties that suit their needs - but that they don't actively monitor applicants' accessibility requirements. Constantly bidding for properties can be an exhausting process, especially for someone like Chrystal. After her first eviction, when she was on North Hertfordshire's housing register, she said she bid for over 100 properties but only secured viewings at six. \"None of them were accessible in any shape or form,\" she said. \"In five of them I couldn't get through the front door. Only one of the properties was adapted, but they told me my needs weren't enough, so I was turned down.\" Now, she doesn't even have the luxury of joining a housing register. Because she moved to a different local authority in 2022 in search of housing, she is now ineligible for support in either her old area, where she hasn't lived recently enough, or her new one, where she hasn't lived for long enough. 'Affordability problems compounded' \"The picture across the board is that it's a struggle for everyone at the moment to find a suitable rented home,\" Deborah Garvie, policy manager at Shelter, told Sky News. She said the biggest difficulty is affordability, especially for those relying on housing benefit, which has been frozen and not kept up with inflation. People with disabilities, or those caring for them, may be particularly affected as they are less likely to be working full time. \"There's that big affordability problem which is likely to be compounded for people who either have disabilities themselves or have a household member with disabilities,\" added Ms Garvie. \"And then on top of that you have the physical access problems as well.\" A parliamentary inquiry into disabled people in the housing sector ended earlier this year and the government has said it intends to set out policies on the accessibility of new homes soon. A Ministry for Housing, Communities and Local Government spokesperson said: \"Cases like Chrystal's are unacceptable and is why we are taking urgent and decisive action to ban section 21 evictions, build 1.5 million new homes and give people housing security. \"Through our Plan for Change, we will build more accessible housing so everyone has a home that meets their needs, alongside delivering the biggest boost to social and affordable housing in a generation backed by £39bn investment.\" Read more:Labour promised to fix housing - but are they leading by example?Leaseholders to get rights to more easily challenge service charges Broxbourne Council, which is responsible for housing in Chrystal's area, responded: \"At present, there are more than 1,600 households on the Housing Register. \"Ms Hendry has been provided with a personalised plan to support her to resolve her housing situation which acknowledges that specialist accommodation is required. \"It sets out what the council is doing to support Ms Hendry and also details other housing options that she can pursue.\" Chrystal acknowledges the council has given her a plan, but argues it doesn't provide any real solutions. \"I've been told numerous times that they have no housing in the area,\" she said. \"They have told me to look for places to rent, but finding private rentals that I can live in is like finding a needle in a haystack - and even if I do, housing benefit won't cover it. \"I'm lucky enough that I can advocate for myself, but there are loads of people in my position that can't do that. \"Trying to wade my way through these broken systems is upsetting and frustrating. I get angry because it seems like nobody wants to fix the problem.\" Production and additional reporting by Emily Jennings, social affairs producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Terence Stamp, Superman villain and star of The Adventures of Priscilla, Queen of the Desert, has died",
        "description": "British actor Terence Stamp - who famously played General Zod in Superman and Superman II - has died at the age of 87.",
        "url": "https://news.sky.com/story/terence-stamp-superman-villan-and-star-of-the-adventures-of-pricilla-queen-of-the-desert-has-died-13413590",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-terence-stamp-actor_6993722.jpg?20250817155921",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-17 14:46:00",
        "Headline": "The Oscar-nominated actor, who was born in London's East End, died on Sunday morning at the age of 87.",
        "Content": "British actor Terence Stamp - who famously played General Zod in Superman and Superman II - has died at the age of 87. The Oscar-nominated actor, who was born in London's East End, also starred in hits such as Theorem, A Season in Hell, and The Adventures of Priscilla, Queen of the Desert. He formed one of Britain's most glamorous couples with Julie Christie, with whom he starred in Far From the Madding Crowd in 1967. In a statement, his family said he died on Sunday morning, adding: \"He leaves behind an extraordinary body of work, both as an actor and as a writer that will continue to touch and inspire people for years to come.\" Stamp was born on 22 July 1938 and was the son of a tugboat stoker. Growing up in London during the Second World War, he endured the Blitz as a child and left school to work initially in advertising before later securing a scholarship to go to drama school. Stamp received various accolades during his career, including a Golden Globe in 1962 for most promising newcomer for Billy Budd and a Cannes Film Festival best actor award in 1965 for The Collector. He also received Academy Award and BAFTA nominations for his performance in Billy Budd, as well as a second BAFTA nod in 1994 for his role in The Adventures of Priscilla, Queen of the Desert - which co-starred Hugo Weaving and Guy Pearce. His most high-profile role was that of General Zod, the villainous leader of three Kryptonian criminals in the 1978 movie Superman and its 1980 sequel Superman II - which starred Christopher Reeve in the lead role. His other films also include Young Guns, The Limey and Valkyrie with Tom Cruise. Most recently, Stamp starred in director Edgar Wright's Last Night in Soho. The 2021 psychological horror film also featured Diana Rigg, Anya Taylor-Joy and Matt Smith. As well as appearing on television and on stage, Stamp additionally lent his voice for video games - appearing in the likes of Halo 3 and The Elder Scrolls IV: Oblivion. Read more from Sky News:Cara Delevingne reveals how Topshop inspired her fashion senseComedian reveals he's cancer free Stamp liked to recall how he was on the verge of becoming a tantric sex teacher at an ashram in India when, in 1977, he received a telegram from his London agent with news that he was being considered for the Superman film. \"I was on the night flight the next day,\" Stamp said in an interview with his publisher Watkins Books in 2015. After eight years largely out of work, landing the role of villain General Zod - the megalomaniacal leader of the Kryptonians - the full glare of Hollywood's limelight fell on the London-born star. Buoyed by his new role, Stamp said he would respond to curious looks from passers-by with a command of: \"Kneel before Zod, you b***ards,\" which was said to have gone down a storm."
    },
    {
        "title": "'Tradwife', 'delulu' and 'skibidi' among new words added to Cambridge Dictionary",
        "description": "The Cambridge Dictionary has officially welcomed 6,000 new words this year - including a wave of new slang inspired by social media.",
        "url": "https://news.sky.com/story/tradwife-delulu-and-skibidi-among-new-words-added-to-cambridge-dictionary-13412150",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dictionary-glasses_6994115.jpg?20250817232721",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "Social media influencers are now a firmly established part of internet culture and marketing - and it seems they're also changing the way we speak.",
        "Content": "The Cambridge Dictionary has officially welcomed 6,000 new words this year - including a wave of new slang inspired by social media. Delulu, tradwife, broligarcy, and lewk, have all been added because experts believe the words will not be just a fad, but will have linguistic staying power. The words have grown in use across social and mainstream media and beyond, linked to celebrities and influencers such as Kim Kardashian (skibidi), Hannah Neeleman of @ballerinafarm (tradwife) and Australian Prime Minister Anthony Albanese (delulu with no solulu). Other words linked to working from home, such as \"mouse jiggler\" - a device or app that simulates mouse movement and stops your computer going into sleep mode - and climate change-related phrases like \"forever chemical\", have also been added. The dictionary, published by Cambridge University Press, draws its entries not just from the written word but from a huge database of real-world English usage. Some of this year's new words include: Colin McIntosh, lexical programme manager at the Cambridge Dictionary, believes the words added to the latest edition won't just be a flash in the pan. \"We only add words where we think they'll have staying power,\" he said. \"Internet culture is changing the English language and the effect is fascinating to observe and capture in the dictionary.\" So what does 'skibidi' mean? Skibidi can have a number of different meanings, including good, bad, cool or even weird. It can even have no meaning and can just be a gibberish sound. It was popularised by the creator of a viral animated YouTube series called Skibidi Toilet - about toilets with human heads sticking out of the bowl. The phrase featured on a necklace given as a present to Kim Kardashian by her 12-year-old daughter, North West. The show is popular among Gen Alpha - referring to people born roughly between 2010 and 2024. Phrases such as \"What the skibidi are you doing?\" and \"That wasn't very skibidi rizz of you\" have entered mainstream usage."
    },
    {
        "title": "Spain deploys extra 500 soldiers to tackle major wildfires - with weather 'not on our side'",
        "description": "Spain has deployed a further 500 soldiers to battle wildfires that have spread across parts of the country in scorching conditions - taking the total number of troops to 1,900.",
        "url": "https://news.sky.com/story/spain-deploys-extra-500-soldiers-to-tackle-major-wildfires-with-weather-not-on-our-side-13413858",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ourense-spain-fire_6994082.jpg?20250817220245",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-17 20:53:00",
        "Headline": "Up to 20 major wildfires are burning in total, the majority in Spain's northwestern region of Galicia, while there are several blazes in neighbouring Portugal.",
        "Content": "Spain has deployed a further 500 soldiers to battle wildfires that have spread across parts of the country in scorching conditions - taking the total number of troops to 1,900. The fires have burned 158,000 hectares so far this year, according to the EU's European Forest Fire Information System - an area roughly as big as metropolitan London - and three people have died in the last week. Up to 20 major wildfires are burning in total, including several in Spain's northwestern region of Galicia. Some have converged to form a large blaze, forcing the closure of roads and rail services. Two water-dumping planes from the Netherlands are expected to join aircraft from France and Italy already helping Spanish authorities, and firefighters from other countries are also set to arrive in the coming days, Civil Protection Agency chief Virginia Barcones told public broadcaster RTVE. Read more:Why fires in Spain are impacting weather in UKMosquito bite warning after rise in chikungunya cases  Southern Europe is experiencing one of its worst wildfire seasons in 20 years, with Spain among the hardest-hit countries. While Southern Europe lived through wildfires, droughts and heatwaves long before humans started to change the climate by burning fossil fuels, hotter global temperatures can supercharge some of the conditions for these types of extreme weather, according to climate scientists. Greece, Bulgaria, Montenegro and Albania have also requested help from the EU's firefighting force in recent days. Thousands of firefighters are also battling eight large blazes in central and northern Portugal, the largest of them near the mountainous area of Piodao. The smoke from the wildfires in Spain and Portugal also recently brought hazy conditions to the UK. Portugal is set for cooler weather in the coming days, but temperatures were expected to reach up to 45C (113F) in some areas of Spain on Sunday.  Prime Minister Pedro Sanchez said there remained \"some challenging days ahead and, unfortunately, the weather is not on our side\". Alfonso Rueda, head of the Galician regional government, said lockdowns were in place and evacuations were being carried out, with homes \"still under threat\"."
    },
    {
        "title": "Tear gas deployed as protesters clash with Serbian police in latest violent demonstration",
        "description": "Tear gas was deployed in the latest violent clash between protesters and police in Serbia.",
        "url": "https://news.sky.com/story/tear-gas-deployed-as-protesters-clash-with-serbian-police-in-latest-violent-demonstration-13413411",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-serbia-protest_6993656.jpg?20250817150131",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-17 10:27:00",
        "Headline": "The protests calling for snap elections and an end to the 12-year rule of President Aleksandar Vucic have been largely peaceful in the past month before escalating to violence this week.",
        "Content": "Tear gas was deployed in the latest violent clash between protesters and police in Serbia. Tensions soared in the Balkan nation on Saturday after a group of young men wearing scarves over their faces threw flares at President Aleksandar Vucic's Serbian Progressive Party offices in Valjevo, 100km (60 miles) from the capital Belgrade. The protesters, who were chanting slogans against Mr Vucic, set fire to the offices before clashing with riot police, who used multiple rounds of tear gas to fight and charged at demonstrators who were hurling bottles, rocks and flares at them. There were similar clashes in Belgrade and the northern city of Novi Sad, with police also deploying tear gas after protesters set bins on fire. In the town of Valjevo, thousands of people took to the streets to protest after a young man was injured by police who kicked him and hit him with batons. One policeman was injured in the demonstration and 18 people were arrested so far, interior minister Ivica Dacic said.  The protests calling for snap elections and an end to the 12-year rule of President Aleksandar Vucic have been largely peaceful in the past month before escalating to violence this week. University students have been a key force behind nationwide demonstrations that started after a renovated rail station canopy collapsed, killing 16 people in November last year. Many blamed the concrete roof crash on government corruption and negligence in state infrastructure projects, leading to recurring protests. Read more from Sky News:European leaders to join Zelenskyy for Trump talkProtesters go on strike in Israel demanding ceasefire Mr Vucic and his right-wing party have repeatedly refused the demand for an early parliamentary vote and accused protesters of planning to spur violence on orders from abroad, which they have not specified. A former extreme nationalist, Mr Vucic has become increasingly authoritarian since coming to power more than a decade ago. He formally says he wants Serbia to join the European Union, but critics say he has stifled democratic freedoms and strengthened ties with Russia and China. Serbia's parliamentary elections are due in 2027."
    },
    {
        "title": "Appeal for 100th birthday cards for Second World War veteran Dougie Shelley",
        "description": "Well-wishers are being urged to send 100th birthday cards to a Second World War veteran who served in the Arctic Convoys to make his surprise celebration extra special.",
        "url": "https://news.sky.com/story/appeal-for-100th-birthday-cards-for-second-world-war-veteran-13413382",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-essex-royal-navy-dougie-shelley_6993427.jpg?20250817094311",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-17 08:28:00",
        "Headline": "Mr Shelley, who has no known surviving family, joined the Royal Navy at 17 and will turn 100 on 23 September.",
        "Content": "Well-wishers are being urged to send 100th birthday cards to a Second World War veteran who served in the Arctic Convoys to make his surprise celebration extra special. Dougie Shelley, who has no known surviving family, joined the Royal Navy at 17, served as a seaman gunner and said earlier this year: \"There's not many of us left.\" The sailor, of Southend in Essex, was on a ship in Hong Kong when news came through of Germany's surrender, and said in a previous interview that it \"couldn't have been better\". He said: \"The war killed so many people, it's unbelievable. All around, the Americans, Russians, all the Allies, the same with the Germans. \"But you were doing a job, the same as they had to. It's either kill or be killed. \"When we heard about victory in Europe, everybody got together and we all had a good old drink up and jolly up, and couldn't welcome it much better.\" Mr Shelley will turn 100 on 23 September. \n                  Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 \n                  Woman told she may have to lose leg to stay alive after liquid Brazilian butt lift\n                 John Hawes, chairman of the Southend branch of the Royal Naval Association, is appealing for people to send birthday cards for Mr Shelley, which will be shown to him at a party on the day. 'Loves a tot of rum' Mr Hawes told Sky News Mr Shelley was the branch's \"last Arctic convoy veteran and also he was at D-Day\". Mr Shelley \"will love this\", Mr Hawes said, adding that the veteran is \"very talkative and loves to talk about his naval career\" and \"likes a tot of rum on a daily basis, so we're hoping that when he joins us, we can have a tot of rum with him\". Mr Hawes is hoping to collate at least 100 birthday cards and may get some help from France. He has contacted an English teacher at a school in Normandy to ask students there to send cards, as they do to British veterans at Christmas. Dougie Shelley was a gunlayer, Mr Hawes said, and was responsible for aiming a ship's guns, serving on the Royal Navy Destroyer HMS Milne. 'Brought a tear to his eye' He \"would have gone through quite a bit\" and, among other things, would have been responsible for \"chipping ice off the guns\" while \"wearing his duffle coat and maybe three or four pairs of gloves\". \"He did tell me about ships being torpedoed, and it brought a tear to his eye when he saw what had actually happened.\" He was also on the Milne when it was deployed off the Normandy coast in support of the D-Day landings, and \"might have been shelling some of the fortifications there\", Mr Hawes said. \"Dougie really had his work cut out there being a gunlayer.\" A tea party and cake A tea party is being laid on for the big day, with Mr Hawes, who was a chef and baker on the aircraft carrier HMS Eagle, down to bake a Victoria sandwich birthday cake, and a lot of guests are expected. \"Dougie will have a lot of friends there, especially shipmates from our branch,\" Mr Hawes said. Read more from Sky News:Zelenskyy risks Oval Office ambushHospitals in Gaza 'overwhelmed'Leading 60s movie star dies Earlier, Mr Hawes said he \"really deserves something, he has been one of our founder members way back in 1980 I think it was when the actual club opened. \"He's always been with us on Remembrance Sunday in his wheelchair, and somebody's pushed him up to the cenotaph at Southend. \"I think he's going to thoroughly enjoy it, he really will, he'll be over the moon,\" said Mr Hawes. \"Dougie always likes to let everybody know he's there, and this will blow his socks off I think.\" Mr Shelley's carer Paul Bennett said he was on the HMS Milne on D-Day \"supporting the chaps going off to land in craft ashore in Normandy, and he was a gunner keeping the skies clear of enemy aircraft\". The birthday cards can be sent to the Royal Naval Association club, 73-79 East Street, Southend-on-Sea, Essex, SS2 6LQ."
    },
    {
        "title": "Waiting for the bailiffs but nowhere to go: Sharp rise in disabled people facing homelessness",
        "description": "Chrystal Hendry finished her psychology degree in 2021 and was excited to move to the next phase of her life - working towards becoming a counsellor - when she first became homeless.",
        "url": "https://news.sky.com/story/waiting-for-the-bailiffs-but-nowhere-to-go-sharp-rise-in-number-of-disabled-homeless-people-13411687",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-disability-housing_6990722.png?20250818025510",
        "type": "UK",
        "Author": "Joely Santa Cruz, data journalist, and Becky Johnson, social affairs correspondent",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "A Sky News investigation finds there is a severe shortage of homes suitable for those with a disability, leaving many across England in need of a safe place to live - and most councils don't even know how many disabled people need social housing.",
        "Content": "By Joely Santa Cruz, data journalist, and Becky Johnson, social affairs correspondent   Chrystal Hendry finished her psychology degree in 2021 and was excited to move to the next phase of her life - working towards becoming a counsellor - when she first became homeless. Chrystal, 30, has spinal muscular atrophy and uses a wheelchair. She needs round-the-clock care, as well as home adaptations, such as a bed hoist and wet room, to live comfortably. Several months after being evicted in 2021, and following a \"really awful\" period in inappropriate housing, she managed to find somewhere to rent in a different town, where she now lives. It has never been the ideal home - the temporary ramps are a struggle. But it was better than the alternatives suggested by her council, including moving her live-in care team and equipment into one bedroom in an elderly dementia care home. Four years on, she's being evicted again. Chrystal is one of the 70,000 households with a physical disability in England now facing homelessness. Her landlord wants to redevelop the home she lives in and has issued a 'no fault' eviction notice, which has progressed to a court repossession order. \n                  A-level results show deepening inequality despite vows to tackle attainment gaps\n                 \n                  More small boat arrivals under Starmer than Sunak, despite ex-PM being in power seven months longer\n                 \n                  What does the data tell us about road traffic accidents in the UK?\n                 Now, she's waiting for the bailiffs to arrive. \"It just never ended, it's still not ended four years later. I still can't even think about building a career or giving back to anybody because I'm so consumed with it,\" Chrystal told Sky News. \"At this moment in time, I have no idea where I'm going to go,\" she said. \"For anybody a bailiff knocking on your door is scary, but when you've got fundamental pieces of equipment that you cannot live without it's even scarier.\" Chrystal's experience is not unique. Among households who approached their local council for homelessness assistance in the latest year, one in five had physical ill health and disability support needs. It's a growing issue - there were nearly 70,000 such households in 2024/25, up from around 40,000 four years earlier, according to Sky News analysis of government data. This represents a 72% increase, more than three times the 20% rise in the overall number of households seeking homelessness support. The number of homeless or at-risk households with a physical disability support need increased more than any other demographic over the period. They now represent 21% of households, up from 13% of households in 2020/21. Councils 'not taking it seriously' Sky News and housing campaigner Kwajo Tweneboa sent Freedom of Information requests to English councils asking how many people were waiting for accessible social housing, and how long they wait on average. Their responses reveal a troubling lack of understanding of accessible housing needs in their areas. Two in three couldn't say how many people with disabilities were waiting, while four in five weren't able to estimate how long they could expect to wait. Kensington and Chelsea Council disclosed one of the longest waits among those who did respond. It said people waited more than six and a half years for accessible social housing, a year and three months longer than for one-bedroom properties. But we don't have the full picture, as most simply couldn't provide figures. \"The fact most didn't provide data on this issue shows the lack of seriousness shown towards those with disabilities and their needs,\" Mr Tweneboa said. \"All it takes is for any of us to have an accident and we may need those services. \"We also have an ageing population; no doubt more and more people are going to have additional needs,\" he added. There are five million more people in the UK with a disability than there were a decade ago, according to the government's Family Resources Survey. Mobility issues are most common, affecting just under half of those with a disability. Home builders bypassing 'very simple things' \"We currently do not have enough accessible homes here in England,\" Millie Brown, deputy director for the homes team at the Centre for Ageing Better, told Sky News. \"We know that 20% of people are currently living with a disability, but only 13% of homes across England are built to accessibility standards which support them to live healthy and independent lives. \"Things such as step-free access to the home, a toilet on the ground level, doors that are wide enough to fit wheelchairs, for example. \"Very simple things that make it so disabled and older people can live in their homes independently.\" These criteria, alongside a 'flush threshold' - where the floor on either side of doorways are level - are outlined as the four basic criteria for accessibility, which 13% of homes in England meet as of the latest data for 2022. It's not always possible to retrofit existing homes to these standards, but campaigners argue they should be mandatory for new-build properties. Plans under the previous government to raise accessibility standards for new homes never materialised and there has been a \"lack of action from both the previous government and the current government\", said Ms Brown. 'Couldn't even get through the door' Many councils told us they operate a \"choice-based letting system\" - meaning people waiting for social housing can bid for properties that suit their needs - but that they don't actively monitor applicants' accessibility requirements. Constantly bidding for properties can be an exhausting process, especially for someone like Chrystal. After her first eviction, when she was on North Hertfordshire's housing register, she said she bid for over 100 properties but only secured viewings at six. \"None of them were accessible in any shape or form,\" she said. \"In five of them I couldn't get through the front door. Only one of the properties was adapted, but they told me my needs weren't enough, so I was turned down.\" Now, she doesn't even have the luxury of joining a housing register. Because she moved to a different local authority in 2022 in search of housing, she is now ineligible for support in either her old area, where she hasn't lived recently enough, or her new one, where she hasn't lived for long enough. 'Affordability problems compounded' \"The picture across the board is that it's a struggle for everyone at the moment to find a suitable rented home,\" Deborah Garvie, policy manager at Shelter, told Sky News. She said the biggest difficulty is affordability, especially for those relying on housing benefit, which has been frozen and not kept up with inflation. People with disabilities, or those caring for them, may be particularly affected as they are less likely to be working full time. \"There's that big affordability problem which is likely to be compounded for people who either have disabilities themselves or have a household member with disabilities,\" added Ms Garvie. \"And then on top of that you have the physical access problems as well.\" A parliamentary inquiry into disabled people in the housing sector ended earlier this year and the government has said it intends to set out policies on the accessibility of new homes soon. A Ministry for Housing, Communities and Local Government spokesperson said: \"Cases like Chrystal's are unacceptable and is why we are taking urgent and decisive action to ban section 21 evictions, build 1.5 million new homes and give people housing security. \"Through our Plan for Change, we will build more accessible housing so everyone has a home that meets their needs, alongside delivering the biggest boost to social and affordable housing in a generation backed by £39bn investment.\" Read more:Labour promised to fix housing - but are they leading by example?Leaseholders to get rights to more easily challenge service charges Broxbourne Council, which is responsible for housing in Chrystal's area, responded: \"At present, there are more than 1,600 households on the Housing Register. \"Ms Hendry has been provided with a personalised plan to support her to resolve her housing situation which acknowledges that specialist accommodation is required. \"It sets out what the council is doing to support Ms Hendry and also details other housing options that she can pursue.\" Chrystal acknowledges the council has given her a plan, but argues it doesn't provide any real solutions. \"I've been told numerous times that they have no housing in the area,\" she said. \"They have told me to look for places to rent, but finding private rentals that I can live in is like finding a needle in a haystack - and even if I do, housing benefit won't cover it. \"I'm lucky enough that I can advocate for myself, but there are loads of people in my position that can't do that. \"Trying to wade my way through these broken systems is upsetting and frustrating. I get angry because it seems like nobody wants to fix the problem.\" Production and additional reporting by Emily Jennings, social affairs producer. The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Body pulled from river in search for missing boy, 12",
        "description": "A body has been pulled from a river in the search for a missing 12-year-old boy.",
        "url": "https://news.sky.com/story/body-pulled-from-river-in-search-for-missing-boy-12-13413347",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-river-swale-richmond_6993378.jpg?20250817065634",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-17 05:36:00",
        "Headline": "The body was found in the River Swale in Richmond late Saturday, North Yorkshire Police said.",
        "Content": "A body has been pulled from a river in the search for a missing 12-year-old boy. The body was found in the River Swale in Richmond late Saturday, North Yorkshire Police said. Police launched a search for the boy after receiving reports at 5pm that a boy had entered the river and not been seen since. Specialist search teams as well as fire and rescue officers were deployed to help with the search, with crews \"recovering a child's body from the water\" at 10.45pm. Read more from Sky News:Why wildfires abroad are impacting UK weatherNHS to use AI to help free up hospital beds \"The body is yet to be identified, but the boy's family have been informed and are receiving support from specially-trained officers,\" police said in a statement. The death is not being treated as suspicious."
    },
    {
        "title": "Appeal for 100th birthday cards for Second World War veteran Dougie Shelley",
        "description": "Well-wishers are being urged to send 100th birthday cards to a Second World War veteran who served in the Arctic Convoys to make his surprise celebration extra special.",
        "url": "https://news.sky.com/story/appeal-for-100th-birthday-cards-for-second-world-war-veteran-13413382",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-essex-royal-navy-dougie-shelley_6993427.jpg?20250817094311",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-17 08:28:00",
        "Headline": "Mr Shelley, who has no known surviving family, joined the Royal Navy at 17 and will turn 100 on 23 September.",
        "Content": "Well-wishers are being urged to send 100th birthday cards to a Second World War veteran who served in the Arctic Convoys to make his surprise celebration extra special. Dougie Shelley, who has no known surviving family, joined the Royal Navy at 17, served as a seaman gunner and said earlier this year: \"There's not many of us left.\" The sailor, of Southend in Essex, was on a ship in Hong Kong when news came through of Germany's surrender, and said in a previous interview that it \"couldn't have been better\". He said: \"The war killed so many people, it's unbelievable. All around, the Americans, Russians, all the Allies, the same with the Germans. \"But you were doing a job, the same as they had to. It's either kill or be killed. \"When we heard about victory in Europe, everybody got together and we all had a good old drink up and jolly up, and couldn't welcome it much better.\" Mr Shelley will turn 100 on 23 September. \n                  Battle to prevent The Bell Hotel in Epping from housing asylum seekers reaches High Court\n                 \n                  Man staying at hotel that has been focus of protests denies sexual assault charge\n                 \n                  Woman told she may have to lose leg to stay alive after liquid Brazilian butt lift\n                 John Hawes, chairman of the Southend branch of the Royal Naval Association, is appealing for people to send birthday cards for Mr Shelley, which will be shown to him at a party on the day. 'Loves a tot of rum' Mr Hawes told Sky News Mr Shelley was the branch's \"last Arctic convoy veteran and also he was at D-Day\". Mr Shelley \"will love this\", Mr Hawes said, adding that the veteran is \"very talkative and loves to talk about his naval career\" and \"likes a tot of rum on a daily basis, so we're hoping that when he joins us, we can have a tot of rum with him\". Mr Hawes is hoping to collate at least 100 birthday cards and may get some help from France. He has contacted an English teacher at a school in Normandy to ask students there to send cards, as they do to British veterans at Christmas. Dougie Shelley was a gunlayer, Mr Hawes said, and was responsible for aiming a ship's guns, serving on the Royal Navy Destroyer HMS Milne. 'Brought a tear to his eye' He \"would have gone through quite a bit\" and, among other things, would have been responsible for \"chipping ice off the guns\" while \"wearing his duffle coat and maybe three or four pairs of gloves\". \"He did tell me about ships being torpedoed, and it brought a tear to his eye when he saw what had actually happened.\" He was also on the Milne when it was deployed off the Normandy coast in support of the D-Day landings, and \"might have been shelling some of the fortifications there\", Mr Hawes said. \"Dougie really had his work cut out there being a gunlayer.\" A tea party and cake A tea party is being laid on for the big day, with Mr Hawes, who was a chef and baker on the aircraft carrier HMS Eagle, down to bake a Victoria sandwich birthday cake, and a lot of guests are expected. \"Dougie will have a lot of friends there, especially shipmates from our branch,\" Mr Hawes said. Read more from Sky News:Zelenskyy risks Oval Office ambushHospitals in Gaza 'overwhelmed'Leading 60s movie star dies Earlier, Mr Hawes said he \"really deserves something, he has been one of our founder members way back in 1980 I think it was when the actual club opened. \"He's always been with us on Remembrance Sunday in his wheelchair, and somebody's pushed him up to the cenotaph at Southend. \"I think he's going to thoroughly enjoy it, he really will, he'll be over the moon,\" said Mr Hawes. \"Dougie always likes to let everybody know he's there, and this will blow his socks off I think.\" Mr Shelley's carer Paul Bennett said he was on the HMS Milne on D-Day \"supporting the chaps going off to land in craft ashore in Normandy, and he was a gunner keeping the skies clear of enemy aircraft\". The birthday cards can be sent to the Royal Naval Association club, 73-79 East Street, Southend-on-Sea, Essex, SS2 6LQ."
    },
    {
        "title": "Chadwell Heath: Three arrested after death of woman in east London",
        "description": "Police investigating the death of a woman in east London have arrested three men.",
        "url": "https://news.sky.com/story/chadwell-heath-three-arrested-after-death-of-woman-in-east-london-13413665",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chadwell-heath-essex_6993847.jpg?20250817171331",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-17 15:39:00",
        "Headline": "A 35-year-old man has been arrested on suspicion of murder, while two others have been arrested on suspicion of assisting an offender.",
        "Content": "Police investigating the death of a woman in east London have arrested three men. A 35-year-old man has been arrested on suspicion of murder, while two men, aged 21 and 22, have been arrested on suspicion of assisting an offender, the Metropolitan Police said on Sunday. Detectives opened a murder investigation after the death of the woman in Chadwell Heath early on Saturday morning. Police and the London Ambulance Service were called to reports that a woman had been assaulted in Chadwell Heath Lane at around 5.30am. \"Despite the best efforts of emergency services, she was sadly pronounced dead at the scene,\" the force said in a statement. She has not been formally identified, but officers believe the victim was in her 20s. The Metropolitan Police said their early enquiries suggested it was an isolated incident in which those involved knew each other. The woman's family have been informed and are being supported by specially-trained family liaison officers. Read more on Sky News:Girl, 11, dies at beauty spotBritish movie star, 87, diesMeet the UK's next fishermen A post-mortem examination will be carried out in due course. Appealing for the public's help, Detective Superintendent Brian Hobbs said: \"Our thoughts remain with the victim's family and friends in light of this truly tragic event. \"Although we have now made arrests, local residents will continue to see an increased number of officers in and around the area while our investigative work is carried out.\""
    },
    {
        "title": "Terence Stamp, Superman villain and star of The Adventures of Priscilla, Queen of the Desert, has died",
        "description": "British actor Terence Stamp - who famously played General Zod in Superman and Superman II - has died at the age of 87.",
        "url": "https://news.sky.com/story/terence-stamp-superman-villan-and-star-of-the-adventures-of-pricilla-queen-of-the-desert-has-died-13413590",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-terence-stamp-actor_6993722.jpg?20250817155921",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-17 14:46:00",
        "Headline": "The Oscar-nominated actor, who was born in London's East End, died on Sunday morning at the age of 87.",
        "Content": "British actor Terence Stamp - who famously played General Zod in Superman and Superman II - has died at the age of 87. The Oscar-nominated actor, who was born in London's East End, also starred in hits such as Theorem, A Season in Hell, and The Adventures of Priscilla, Queen of the Desert. He formed one of Britain's most glamorous couples with Julie Christie, with whom he starred in Far From the Madding Crowd in 1967. In a statement, his family said he died on Sunday morning, adding: \"He leaves behind an extraordinary body of work, both as an actor and as a writer that will continue to touch and inspire people for years to come.\" Stamp was born on 22 July 1938 and was the son of a tugboat stoker. Growing up in London during the Second World War, he endured the Blitz as a child and left school to work initially in advertising before later securing a scholarship to go to drama school. Stamp received various accolades during his career, including a Golden Globe in 1962 for most promising newcomer for Billy Budd and a Cannes Film Festival best actor award in 1965 for The Collector. He also received Academy Award and BAFTA nominations for his performance in Billy Budd, as well as a second BAFTA nod in 1994 for his role in The Adventures of Priscilla, Queen of the Desert - which co-starred Hugo Weaving and Guy Pearce. His most high-profile role was that of General Zod, the villainous leader of three Kryptonian criminals in the 1978 movie Superman and its 1980 sequel Superman II - which starred Christopher Reeve in the lead role. His other films also include Young Guns, The Limey and Valkyrie with Tom Cruise. Most recently, Stamp starred in director Edgar Wright's Last Night in Soho. The 2021 psychological horror film also featured Diana Rigg, Anya Taylor-Joy and Matt Smith. As well as appearing on television and on stage, Stamp additionally lent his voice for video games - appearing in the likes of Halo 3 and The Elder Scrolls IV: Oblivion. Read more from Sky News:Cara Delevingne reveals how Topshop inspired her fashion senseComedian reveals he's cancer free Stamp liked to recall how he was on the verge of becoming a tantric sex teacher at an ashram in India when, in 1977, he received a telegram from his London agent with news that he was being considered for the Superman film. \"I was on the night flight the next day,\" Stamp said in an interview with his publisher Watkins Books in 2015. After eight years largely out of work, landing the role of villain General Zod - the megalomaniacal leader of the Kryptonians - the full glare of Hollywood's limelight fell on the London-born star. Buoyed by his new role, Stamp said he would respond to curious looks from passers-by with a command of: \"Kneel before Zod, you b***ards,\" which was said to have gone down a storm."
    },
    {
        "title": "'Tradwife', 'delulu' and 'skibidi' among new words added to Cambridge Dictionary",
        "description": "The Cambridge Dictionary has officially welcomed 6,000 new words this year - including a wave of new slang inspired by social media.",
        "url": "https://news.sky.com/story/tradwife-delulu-and-skibidi-among-new-words-added-to-cambridge-dictionary-13412150",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dictionary-glasses_6994115.jpg?20250817232721",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "Social media influencers are now a firmly established part of internet culture and marketing - and it seems they're also changing the way we speak.",
        "Content": "The Cambridge Dictionary has officially welcomed 6,000 new words this year - including a wave of new slang inspired by social media. Delulu, tradwife, broligarcy, and lewk, have all been added because experts believe the words will not be just a fad, but will have linguistic staying power. The words have grown in use across social and mainstream media and beyond, linked to celebrities and influencers such as Kim Kardashian (skibidi), Hannah Neeleman of @ballerinafarm (tradwife) and Australian Prime Minister Anthony Albanese (delulu with no solulu). Other words linked to working from home, such as \"mouse jiggler\" - a device or app that simulates mouse movement and stops your computer going into sleep mode - and climate change-related phrases like \"forever chemical\", have also been added. The dictionary, published by Cambridge University Press, draws its entries not just from the written word but from a huge database of real-world English usage. Some of this year's new words include: Colin McIntosh, lexical programme manager at the Cambridge Dictionary, believes the words added to the latest edition won't just be a flash in the pan. \"We only add words where we think they'll have staying power,\" he said. \"Internet culture is changing the English language and the effect is fascinating to observe and capture in the dictionary.\" So what does 'skibidi' mean? Skibidi can have a number of different meanings, including good, bad, cool or even weird. It can even have no meaning and can just be a gibberish sound. It was popularised by the creator of a viral animated YouTube series called Skibidi Toilet - about toilets with human heads sticking out of the bowl. The phrase featured on a necklace given as a present to Kim Kardashian by her 12-year-old daughter, North West. The show is popular among Gen Alpha - referring to people born roughly between 2010 and 2024. Phrases such as \"What the skibidi are you doing?\" and \"That wasn't very skibidi rizz of you\" have entered mainstream usage."
    },
    {
        "title": "Man arrested after mobility scooter driver 'punched in the head' in South Shields",
        "description": "A man in his 70s has been arrested after a mobility scooter driver was left in a critical condition in hospital after allegedly being punched in the head.",
        "url": "https://news.sky.com/story/man-arrested-after-mobility-scooter-driver-punched-in-the-head-in-south-shields-13413569",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-whiteleas-way-roundabout_6993694.jpg?20250817154151",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-17 14:27:00",
        "Headline": "An altercation was said to have taken place between a man in a Nissan Micra and a man travelling on a mobility scooter on the road.",
        "Content": "A man in his 70s has been arrested after a mobility scooter driver was left in a critical condition in hospital after allegedly being punched in the head. Northumbria Police said officers received a report shortly before 3.30pm on Saturday of a serious assault at Whiteleas Way roundabout, at the junction with Nevinson Avenue, in South Shields. An altercation was said to have taken place between a man in a Nissan Micra and a man travelling on a mobility scooter. The man in the car allegedly got out and punched the victim in the head and neck, causing him to fall to the ground. Emergency crews attended and the victim - a man in his 60s - was taken to hospital with serious head injuries, where he remains in a critical condition. A man in his 70s was arrested on suspicion of causing grievous bodily harm with intent, police said. Read more from Sky News:Girl, 11, dies at beauty spot after incident in waterThree dead and eight wounded in shooting The suspect has been released on bail pending further inquiries. The force has appealed to the public for information, saying it is \"keen to trace any witnesses who were in the area at the time\"."
    },
    {
        "title": "Putin has agreed Ukraine can have 'NATO-style' security guarantee, Trump envoy says",
        "description": "Vladimir Putin has agreed to allow Ukraine's allies to offer it a NATO-like security guarantee as part of an eventual deal to end the war, according to US special envoy Steve Witkoff.",
        "url": "https://news.sky.com/story/putin-has-agreed-ukraine-can-have-nato-style-security-guarantee-trump-envoy-says-13413433",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-putin-vladimir_6993936.jpg?20250817182658",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-17 11:36:00",
        "Headline": "Steve Witkoff said it was the first time he had heard the Russian president agree to the suggestion - and called it \"game-changing\".",
        "Content": " Vladimir Putin has agreed to allow Ukraine's allies to offer it a NATO-like security guarantee as part of an eventual deal to end the war, according to US special envoy Steve Witkoff. Mr Witkoff said the Russian president agreed to the move when he met with Donald Trump in Alaska on Friday. Speaking to CNN on Sunday, Mr Witkoff, who was by the US president's side at the summit, said: \"We were able to win the following concession: That the United States could offer Article 5-like protection, which is one of the real reasons why Ukraine wants to be in NATO.\" Article 5 is a core principle of the 32-member collective, which states that an armed attack against one or more of its members shall be considered an attack against all. It has only been invoked once, by the US, in the wake of the 9/11 attacks in 2001. Russia has repeatedly insisted that Ukraine cannot be allowed to join NATO and has dismissed the idea that NATO member forces could be peacekeepers under some sort of ceasefire deal. Mr Witkoff, who has previously met with Mr Putin to discuss an end to the Ukraine war, said Friday's summit was the first time he had heard the Russian president agree to the suggestion of NATO-like protection - and called it \"game-changing\". His comments came as Volodymyr Zelenskyy met with European Commission President Ursula von der Leyen in Brussels. The Ukrainian president said in a post on X: \"This is a historic decision that the United States is ready to take part in security guarantees for Ukraine. \"Security guarantees, as a result of our joint work, must really be very practical, delivering protection on land, in the air, and at sea, and must be developed with Europe's participation.\" Ms von der Leyen, speaking at a news conference with the Ukrainian president, said the European Union \"is ready to do its share\". EU leaders to join Zelenskyy at White House Sunday afternoon also saw Ms von der Leyen and Mr Zelenskyy dial in to a meeting with the coalition of the willing, a peacekeeping alliance of European leaders - some of whom will accompany Mr Zelenskyy to meet with Mr Trump tomorrow. Ms von der Leyen will be at the crunch talks in Washington DC, as will Sir Keir Starmer, France's Emmanuel Macron and Italy's Giorgia Meloni. Germany's Chancellor Friedrich Merz and NATO Secretary General Mark Rutte will also be in attendance, after the US president reportedly extended an invitation to European leaders. Read more: Why is Zelenskyy bringing a posse of leaders? Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine during his summit with Mr Trump as a condition for ending the war. In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Mr Trump is said to be planning to urge Mr Zelenskyy to agree to the conditions as part of a peace deal to end the war. That's despite the Ukrainian president previously ruling out formally handing any territory to Moscow, which he says would be impossible under the country's constitution, and would deprive Ukraine of defensive lines and open the way for Moscow to conduct further offensives. In coordinated statements following the Alaska summit, European leaders said Mr Zelenskyy must play a greater role in future talks, and that peace cannot be achieved without him. The US president said the Washington talk with Mr Zelenskyy could potentially pave the way for a three-way meeting with Mr Putin. Read more from Sky News:The territory Ukraine could be told to surrenderBody language expert unpacks Alaska summit On Saturday, Downing Street insisted Sir Keir and other allies stand ready to support the next phase of talks to end the war. \"At the meeting that will take place at the White House tomorrow, the Prime Minister, with other European partners, stands ready to support this next phase of further talks and will reaffirm that his backing for Ukraine will continue as long as it takes,\" a statement from No 10 said."
    },
    {
        "title": "Why is Zelenskyy bringing a posse of European leaders to the US for peace talks?",
        "description": "A posse of European leaders will join the meeting between Donald Trump and Volodymyr Zelenskyy in Washington.",
        "url": "https://news.sky.com/story/eu-commission-president-among-european-leaders-to-accompany-zelenskyy-to-trump-talk-13413375",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6975464.jpg?20250727184756",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-17 07:59:00",
        "Headline": "European Commission President Ursula von der Leyen said she will join the talk \"at the request of President Zelenskyy\", adding that she \"and other European leaders\" will be meeting at the White House on Monday.",
        "Content": " A posse of European leaders will join the meeting between Donald Trump and Volodymyr Zelenskyy in Washington. European Commission President Ursula von der Leyen said she will join the talk \"at the request of President Zelenskyy\", adding that she \"and other European leaders\" will be meeting at the White House on Monday. Also set to join in are Sir Keir Starmer, German Chancellor Friedrich Merz, France's Emmanuel Macron, Italy's Prime Minister Giorgia Meloni, NATO Secretary General Mark Rutte and Finnish President Alexander Stubb. Mr Stubb's friendship with Mr Trump is said to have blossomed since the pair bonded over their love of golf during a tournament at Mar-a-Lago in March. Follow the latest developments on the Ukraine war Mr Stubb previously said that Mr Trump is \"the only person who can broker a peace\" deal, saying the US president was \"the only one that Putin is afraid of\". Bringing a gang of leaders along could be an attempt by Mr Zelenskyy to prevent a repeat of the infamous Oval Office showdown with Mr Trump and the vice-president, JD Vance, in February. They were set to discuss a potential ceasefire with Russia and a mineral deal between Ukraine and the US, but their meeting descended into chaos when Mr Vance berated Ukraine's leader for being insufficiently grateful for US help - in front of the media. He completed his ambush of Mr Zelenskyy by mocking him for not wearing a suit, with Mr Trump adding that the Ukrainian didn't \"have the cards right now with us\". The disastrous meeting ended with Mr Zelenskyy prematurely leaving the White House. He later said the bust-up was \"not good for both sides\". Analysis: Zelenskyy knows he risks another ambush At the US-Russia summit on Friday, Mr Trump (quite literally) rolled out the red carpet for Mr Putin and even let the Russian leader take a ride with him in the presidential limousine dubbed The Beast. Mr Zelenskyy is set for a less warm welcome, with no red carpet or fly past, no round of applause, according to Sky News' US correspondent Martha Kelner. The atmosphere may be more businesslike with European leaders like Mr Stubb in Mr Zelenskyy's corner, and their inclusion as mediators could help prevent a repeat of the Oval Office clash. Mr Stubb has repeatedly voiced support for Ukraine, and Finland, along with other Nordic countries and the three Baltic states, has been among the country's staunchest supporters. The 2022 invasion prompted Finland, which shares a 1,340-km (833-mile) border with Russia, to join NATO two years ago, upending decades of non-alignment. Read more from Sky News:Putin 'demands key regions of Ukraine'Body language expert unpacks summit Two days before the Alaska summit, Mr Zelenskyy, Mr Trump and European leaders, including Mr Stubb, were on a conference call, after which the Finnish leader wrote on X: \"Excellent meeting with @Potus and European leaders, including @ZelenskyyUA. Aligned views and unity. \"We are working together for a ceasefire and a sustainable peace. We are there for Ukraine every step of the way. The next few days and weeks can be decisive.\" Keir Starmer: Donald Trump repeatedly said he likes Sir Keir, even calling him \"a very good person\" as he highlighted their \"very good relationship\".\nThe US president also praised the prime minister in January for having \"done a very good job\" so far.\nHe added that Mr Starmer is \"slightly more liberal than I am, but I like him\" during a trip to Scotland in July. Alexander Stubb: Mr Stubb has developed a blossoming friendship with Mr Trump, including texts and calls at odd hours, after the two bonded over their shared love of golf during a tournament at Mar-a-Lago in March.\nAfter their game, the US president took to Truth Social to praise his Finnish counterpart, writing that Mr Stubb was \"a very good player\".\nMeanwhile, Mr Stubb hailed Mr Trump as \"the only person who can broker a peace\". Giorgia Meloni:  Another European leader who enjoys a good relationship with Mr Trump is Giorgia Meloni, who has been known to be an admirer of many of his policies. \nThe populist Italian prime minister was the only European head of state to be invited to Mr Trump's inauguration.\nEarlier this year, a Trump aide described Ms Meloni as a \"valuable interlocutor with the EU\" and she has even been labelled \"Europe's Trump whisperer\". Mark Rutte:  The NATO secretary general has perhaps the closest relationship with Mr Trump among the visiting European leaders. \nMr Rutte has praised Mr Trump on various occasions, lauding him as a \"man of strength… and peace\" and even calling him \"daddy\" in a comment about breaking up fighting between Middle Eastern adversaries. \nMr Trump later said about Mr Rutte: \"I think he likes me.\" Emmanuel Macron: The French president was the first European leader to be invited to the White House after Mr Trump took office for a second time in January. \nThe two leaders have built a friendly rapport over the years, and during their Oval Office meeting, Mr Macron praised and flattered Mr Trump's leadership. \nJust last month, Mr Trump said during a news conference that he liked Mr Macron and that he was \"a very good guy\". Ursula von der Leyen: As the president of the European Commission, Ms von der Leyen was responsible for striking a trade deal between the US and EU and faced difficult negotiations with Mr Trump.\nAs part of the final deal, the US is now imposing 15% tariffs on most EU imports - down from Mr Trump's originally proposed 30% - but Ms von der Leyen's deal has attracted criticism from politicians in EU member states. \nThis includes Hungarian Prime Minister Viktor Orban, who dubbed her a \"featherweight\" and said: \"It wasn't a deal that President Donald Trump made with Ursula von der Leyen. It was Donald Trump eating Ursula von der Leyen for breakfast.\" Friedrich Merz: A conservative like Mr Trump, German Chancellor Friedrich Merz bonded with Mr Trump over their shared criticism of former German chancellor Angela Merkel's policy of opening up the borders for refugees. \nDuring their first meeting in the Oval Office in June after Mr Merz was elected four months prior, the German chancellor also presented Mr Trump with a copy of his grandfather Friedrich Trump's German birth certificate from 1869.\nAfter their meeting, Mr Merz told German media that the US president was someone he could \"speak with very well on a personal relationship\". Whether any other European leaders will accompany Mr Zelenskyy will likely be confirmed late Sunday following a conference call between members of the \"coalition of the willing\". Retired French General Dominique Trinquand, a former head of France's military mission at the United Nations, said European leaders were \"very afraid of the Oval Office scene being repeated and so they want to support Mr Zelenskyy to the hilt\". \"It's a power struggle and a position of strength that might work with Trump,\" he added."
    },
    {
        "title": "Spain deploys extra 500 soldiers to tackle major wildfires - with weather 'not on our side'",
        "description": "Spain has deployed a further 500 soldiers to battle wildfires that have spread across parts of the country in scorching conditions - taking the total number of troops to 1,900.",
        "url": "https://news.sky.com/story/spain-deploys-extra-500-soldiers-to-tackle-major-wildfires-with-weather-not-on-our-side-13413858",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ourense-spain-fire_6994082.jpg?20250817220245",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-17 20:53:00",
        "Headline": "Up to 20 major wildfires are burning in total, the majority in Spain's northwestern region of Galicia, while there are several blazes in neighbouring Portugal.",
        "Content": "Spain has deployed a further 500 soldiers to battle wildfires that have spread across parts of the country in scorching conditions - taking the total number of troops to 1,900. The fires have burned 158,000 hectares so far this year, according to the EU's European Forest Fire Information System - an area roughly as big as metropolitan London - and three people have died in the last week. Up to 20 major wildfires are burning in total, including several in Spain's northwestern region of Galicia. Some have converged to form a large blaze, forcing the closure of roads and rail services. Two water-dumping planes from the Netherlands are expected to join aircraft from France and Italy already helping Spanish authorities, and firefighters from other countries are also set to arrive in the coming days, Civil Protection Agency chief Virginia Barcones told public broadcaster RTVE. Read more:Why fires in Spain are impacting weather in UKMosquito bite warning after rise in chikungunya cases  Southern Europe is experiencing one of its worst wildfire seasons in 20 years, with Spain among the hardest-hit countries. While Southern Europe lived through wildfires, droughts and heatwaves long before humans started to change the climate by burning fossil fuels, hotter global temperatures can supercharge some of the conditions for these types of extreme weather, according to climate scientists. Greece, Bulgaria, Montenegro and Albania have also requested help from the EU's firefighting force in recent days. Thousands of firefighters are also battling eight large blazes in central and northern Portugal, the largest of them near the mountainous area of Piodao. The smoke from the wildfires in Spain and Portugal also recently brought hazy conditions to the UK. Portugal is set for cooler weather in the coming days, but temperatures were expected to reach up to 45C (113F) in some areas of Spain on Sunday.  Prime Minister Pedro Sanchez said there remained \"some challenging days ahead and, unfortunately, the weather is not on our side\". Alfonso Rueda, head of the Galician regional government, said lockdowns were in place and evacuations were being carried out, with homes \"still under threat\"."
    },
    {
        "title": "Protesters go on strike in Israel demanding ceasefire and release of Gaza hostages",
        "description": "More than 30 people have been arrested in Israel for \"disruption of order\" as families of hostages held in Gaza step up their campaign with a nationwide strike.",
        "url": "https://news.sky.com/story/protesters-go-on-strike-in-israel-demanding-ceasefire-and-release-of-gaza-hostages-13413394",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-protest_6993460.jpg?20250817110931",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-17 09:15:00",
        "Headline": "The campaign escalated on Sunday, with demonstrators staging a \"day of stoppage\" that blocked traffic and closed businesses.",
        "Content": " More than 30 people have been arrested in Israel for \"disruption of order\" as families of hostages held in Gaza step up their campaign with a nationwide strike. Protestors are demanding the Israel government make a deal to secure the release of hostages held by militants in Gaza. The campaign escalated on Sunday, with demonstrators staging a \"day of stoppage\" that blocked traffic and closed businesses. Protesters gathered at dozens of points throughout Israel, including outside politicians' homes, military headquarters and on major highways, where they were sprayed with water cannons as they blocked lanes and lit bonfires that cloaked roads in smoke. Police said they had arrested 32 people as part of the nationwide demonstration - one of the fiercest since the uproar over six hostages found dead in Gaza last September. The action comes weeks after militant groups released videos of hostages and Israel signalled plans for a new Gaza offensive. Protesters fear further fighting could endanger the 50 hostages believed to remain in Gaza, only about 20 of whom are thought to be alive. The demonstrators chanted: \"We don't win a war over the bodies of hostages.\" \"Military pressure doesn't bring hostages back - it only kills them,\" former hostage Arbel Yehoud said at a demonstration in Tel Aviv's Hostage Square. \"The only way to bring them back is through a deal, all at once, without games.\" Anat Angrest, mother of hostage Matan Angrest, added: \"Today, we stop everything to save and bring back the hostages and soldiers. \"Today, we stop everything to remember the supreme value of the sanctity of life. \"Today, we stop everything to join hands - right, left, centre and everything in between.\" Prime Minister Benjamin Netanyahu has demanded the immediate release of the hostages but is haunted by the potential for mutiny within his coalition. Far-right members of his cabinet insist they won't support any deal that allows Hamas to retain power. The last time Israel agreed to a ceasefire that released hostages, they threatened to topple Mr Netanyahu's government. Finance Minister Bezalel Smotrich branded the stoppage \"a bad and harmful campaign that plays into Hamas' hands, buries the hostages in the tunnels and attempts to get Israel to surrender to its enemies and jeopardise its security and future\".  Read more:Remaining hospitals in Gaza overwhelmed with malnutrition casesIsrael silences more crucial reporting voices from inside Gaza Israel is currently preparing for an invasion of Gaza City and other populated parts of the besieged strip, aimed at destroying Hamas. The military body that coordinates its humanitarian aid to Gaza said that the supply of tents to the territory would resume. Coordinator of Government Activities in the Territories (COGAT) said it would allow the United Nations to resume importing tents and shelter equipment into Gaza ahead of plans to forcibly evacuate people from combat zones \"for their protection\". Meanwhile in Gaza, the health ministry said two children died on Sunday due to malnutrition-related causes - reportedly bringing the total over the last 24 hours to seven. Also on Sunday, Israeli airstrikes targeted a power plant in Yemen's capital of Sanaa. The action escalates strikes on Iran-backed Houthis, who since the war began have fired missiles at Israel and targeted ships in the Red Sea. Israel's military said the strikes targeted energy infrastructure it claimed was being used by the Houthis, and were launched in response to missiles and drones aimed at Israel."
    },
    {
        "title": "The stakes are high - and the unity of the alliance against Putin has never been so threatened",
        "description": "When Volodymyr Zelenskyy and his European allies meet Donald Trump in Washington, a huge amount is at stake.",
        "url": "https://news.sky.com/story/the-stakes-are-high-and-the-unity-of-the-alliance-against-putin-has-never-been-so-threatened-13413864",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_6994111.jpg?20250817231856",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "The challenge for Volodymyr Zelenskyy for his talks with Donald Trump at the White House is to avoid a repeat of the disastrous encounter the last time they met there.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  When Volodymyr Zelenskyy and his European allies meet Donald Trump in Washington, a huge amount is at stake. Ukrainian officials are reported to feel betrayed by the US president, who appears to have shifted position to side with Vladimir Putin on a number of key points in the wake of the meeting with him in Alaska. Trump has undermined the unity of the Western alliance by abandoning their calls for an immediate ceasefire in Ukraine. He is no longer threatening more severe sanctions, and more worryingly still he seems open to the idea of making the Ukrainians hand over territory the Russians have not yet captured. He and his real estate lawyer turned rookie negotiator Steve Witkoff seem to believe the conflict can be resolved by an exchange of territory. Putin on the other hand has made it clear he is fighting to extinguish Ukraine as an independent and democratic entity. Read more:Putin has 'agreed NATO-style security guarantee'How a chaotic 24 hours unfoldedWhy is Zelenskyy bringing posse of leaders to talks? Ukrainians say that for Zelenskyy, handing over land his troops have been fighting to defend since 2014 would be politically suicidal and strategically insane. Sergeant Andriy Poluhin, from the Ukrainian 24th Brigade, has fought the Russians in Donetsk on and off since 2015 and is currently based in the fiercely embattled town of Chasiv Yar. 👉 Follow Trump100 on your podcast app 👈 He's typical of many Ukrainians, appalled at the idea his country would have to hand over land so many of their comrades have died fighting for. Putin's claim that he wants to end the war and stop the killing, he says, is self-evidently false. \"It's a lie, it's obviously a lie. I think it's not only my thoughts or Ukrainian ones, but everyone who deals with Russia understands he just lies,\" he says.  Many would agree - except the US president himself, who says he believes the Russian leader wants the killing to end. The challenge for Zelenskyy and his European outriders when they go to the White House is avoiding a repeat of the disastrous Oval Office encounter between him and Trump and his vice president in February. They need to steer Trump back to their side of the argument without angering the famously thin-skinned president and driving him further towards Moscow. The unity of the alliance against Putin has never been so threatened."
    },
    {
        "title": "'Not in our name': Israelis protest against Gaza war - but Netanyahu seems unmoved",
        "description": "The coordinates came through last minute. The instruction was to get there fast.",
        "url": "https://news.sky.com/story/not-in-our-name-israelis-protest-against-gaza-war-but-netanyahu-seems-unmoved-13413778",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza_6993991.jpg?20250817191330",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-08-17 17:45:00",
        "Headline": "Tyres were set alight and roads blocked as Israelis took their anger with the Gaza conflict onto the streets for what was called a \"day of stoppage\".",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n  The coordinates came through last minute. The instruction was to get there fast. People organising demonstrations, blocking motorways and major intersections, did not want police getting wind of their plans. The one we found ourselves at, near the town of Lod, halfway between Tel Aviv and Jerusalem, felt a bit like a flash-mob protest, done and dusted in less than half an hour. The protestors had set fire to tyres, which blazed across the motorway, filling the sky with thick black smoke. They waved the Israeli flag and other yellow flags to show solidarity with the remaining hostages still in Gaza, whose photos they carried - their faces and names seared on the collective consciousness now - a collective trauma. \"We want the war to end, we want our hostages back, we want our soldiers back safe home, and we want the humanitarian disaster in Gaza to end\", one of the protestors told me. \"We do not want to have these crimes made in our name.\" And then she was gone, off to the next location as the group vanished in a matter of minutes, leaving police to put out the fire. This was a day of stoppage, a nationwide strike - a change of tactics by the hostage families to up the ante with the government in their calls to stop the war, make a deal and bring the hostages home. Benjamin Netanyahu was unmoved. \"Those who are calling for an end to the war today without defeating Hamas are not only hardening Hamas's stance and delaying the release of our hostages, they are also ensuring that the horrors of October 7 will recur again and again\", he said at the start of the weekly cabinet meeting. Netanyahu 'broke contract' with us Ahead of the day of strike action, we spoke to a former Air Force reservist who quit in April in protest over Netanyahu's decision to break the ceasefire. \"I felt he hadn't broken the contract with Hamas, he'd broken the contract with us - with the people, releasing the hostages, stopping the war. That was my breaking point.\" He wanted to be anonymous, identifying himself by the call sign 'F'. He had done three tours since the war began, mostly spent with eyes on Gaza - coordinating air strikes to support ground operations and ensuring the Air Force gets the target right.  'This is eternal war' \"It's very complicated, very demanding and very hectic. The main problem is to see that you follow the rules and there are lots of rules - safety rules, international law rules, military doctrine rules. \"And to see that there are no mistakes because you can check all the rules, you can make everything perfect, if there's a mistake, it bypasses everything you did and the bomb would fall on someone you didn't want it to fall on.\" I ask him how he feels about the huge death toll in Gaza. \"Look, the uninvolved death toll is tough. It's tough personally, it's tough emotionally, it's tough professionally. It shouldn't happen. \"When you conduct a war at this scale, it will happen. It will happen because of mistakes, because of the chaos of war.\"  He is softly spoken, considered and thoughtful, but says he's prepared to take part in the more radical protest actions, such as blocking motorways and starting fires, to try and get the message through. Read more on Sky News:'More than 100 killed in a day'Gaza's hospitals 'overwhelmed'Madonna urges papal intervention \"Hamas is probably the weakest enemy we have had since 1948,\" he says. \"In '48, in the liberation of Israel, we fought seven armies, much better equipped, better ordered than us, and the war took less time. \"We stopped the war with Iran after 12 days. They are much more dangerous than Hamas. We stopped a war with Hezbollah in a couple of months, and they are still a much bigger threat than Hamas. \"You cannot eliminate a terror organisation to the last person. From my point of view, this way - this is eternal war.\""
    },
    {
        "title": "Zelenskyy knows he risks another Oval Office ambush - but has to be a willing participant in peace talks",
        "description": "There will be no red carpet or fly past, no round of applause when Volodymyr Zelenskyy arrives in Washington DC on Monday.",
        "url": "https://news.sky.com/story/zelenskyy-knows-he-risks-another-oval-office-ambush-but-has-to-be-a-willing-participant-in-peace-talks-13413338",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-zelenskyy-oval-office_6842493.jpg?20250304160138",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-08-17 03:10:00",
        "Headline": "Ukrainian President Volodymyr Zelenskyy is due to meet Donald Trump at the White House following the US leader's summit with Vladimir Putin.",
        "Content": "\n          US correspondent\n              @marthakelner\n  There will be no red carpet or fly past, no round of applause when Volodymyr Zelenskyy arrives in Washington DC on Monday. But the bitter memory of his last visit to the White House will feature prominently in the Ukrainian president's thoughts. In February, he was mocked for not wearing a suit and told he didn't \"have the cards\" by US President Donald Trump, before being walked off the premises early, like an unruly patron being thrown out of the bar.  Zelenskyy knows he is risking another ambush in the Oval Office but has to present himself as a willing participant in peace talks, out of fear of being painted as the obstacle to a resolution. There was initially measured optimism in Kyiv after Trump's summit with Russian President Vladimir Putin, because it appeared that no deal had been cut between Washington and the Kremlin without Ukraine in the room, as had been feared. But that restrained positivity quickly evaporated with the release of a statement by Trump the morning after the night before. In the heady heights of a meeting with strongman Putin, he seemed to have abandoned the one key thing that European leaders had impressed upon him - that there had to be an unconditional ceasefire in Ukraine as an absolute starting point to a permanent resolution. Trump had apparently reached the conclusion that no ceasefire was required. \"The best way to end the horrific war between Russia and Ukraine... is to go directly to a peace agreement,\" is how he put it on his Truth Social media account. Read more:Key takeaways from Sky correspondentsBody language expert unpacks the summit  That sent shockwaves through Kyiv. Many there and elsewhere believe Russia has no intention of stopping the war yet, and will use its military advantage on the battlefield to pressure Ukraine in drawn-out negotiations to give up more territory. In the meantime, the slaughter of Ukrainians will continue. It is the most dramatic of 180s from Trump, who before the meeting and after lobbying from European leaders had said he would not be happy if Putin failed to agree to a ceasefire, and even promised \"severe consequences\". Yet now reports suggest Trump is giving credence to the Russian position - in a phone call to Zelenskyy he laid out Putin's proposal that Ukraine relinquishes even more territory, in return for an end to the war. The Ukrainian president will have, no doubt, been distressed to see the pictures of Putin being greeted like a king on an American military base in Alaska. It is in direct contrast to how he was hosted on US soil. In Trump's orbit everything is a personality contest, and where he has very obvious deference to Putin, he has disdain for Zelenskyy. That makes the Ukrainian's position very difficult."
    },
    {
        "title": "Tear gas deployed as protesters clash with Serbian police in latest violent demonstration",
        "description": "Tear gas was deployed in the latest violent clash between protesters and police in Serbia.",
        "url": "https://news.sky.com/story/tear-gas-deployed-as-protesters-clash-with-serbian-police-in-latest-violent-demonstration-13413411",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-serbia-protest_6993656.jpg?20250817150131",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-17 10:27:00",
        "Headline": "The protests calling for snap elections and an end to the 12-year rule of President Aleksandar Vucic have been largely peaceful in the past month before escalating to violence this week.",
        "Content": "Tear gas was deployed in the latest violent clash between protesters and police in Serbia. Tensions soared in the Balkan nation on Saturday after a group of young men wearing scarves over their faces threw flares at President Aleksandar Vucic's Serbian Progressive Party offices in Valjevo, 100km (60 miles) from the capital Belgrade. The protesters, who were chanting slogans against Mr Vucic, set fire to the offices before clashing with riot police, who used multiple rounds of tear gas to fight and charged at demonstrators who were hurling bottles, rocks and flares at them. There were similar clashes in Belgrade and the northern city of Novi Sad, with police also deploying tear gas after protesters set bins on fire. In the town of Valjevo, thousands of people took to the streets to protest after a young man was injured by police who kicked him and hit him with batons. One policeman was injured in the demonstration and 18 people were arrested so far, interior minister Ivica Dacic said.  The protests calling for snap elections and an end to the 12-year rule of President Aleksandar Vucic have been largely peaceful in the past month before escalating to violence this week. University students have been a key force behind nationwide demonstrations that started after a renovated rail station canopy collapsed, killing 16 people in November last year. Many blamed the concrete roof crash on government corruption and negligence in state infrastructure projects, leading to recurring protests. Read more from Sky News:European leaders to join Zelenskyy for Trump talkProtesters go on strike in Israel demanding ceasefire Mr Vucic and his right-wing party have repeatedly refused the demand for an early parliamentary vote and accused protesters of planning to spur violence on orders from abroad, which they have not specified. A former extreme nationalist, Mr Vucic has become increasingly authoritarian since coming to power more than a decade ago. He formally says he wants Serbia to join the European Union, but critics say he has stifled democratic freedoms and strengthened ties with Russia and China. Serbia's parliamentary elections are due in 2027."
    },
    {
        "title": "'Tradwife', 'delulu' and 'skibidi' among new words added to Cambridge Dictionary",
        "description": "The Cambridge Dictionary has officially welcomed 6,000 new words this year - including a wave of new slang inspired by social media.",
        "url": "https://news.sky.com/story/tradwife-delulu-and-skibidi-among-new-words-added-to-cambridge-dictionary-13412150",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dictionary-glasses_6994115.jpg?20250817232721",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "Social media influencers are now a firmly established part of internet culture and marketing - and it seems they're also changing the way we speak.",
        "Content": "The Cambridge Dictionary has officially welcomed 6,000 new words this year - including a wave of new slang inspired by social media. Delulu, tradwife, broligarcy, and lewk, have all been added because experts believe the words will not be just a fad, but will have linguistic staying power. The words have grown in use across social and mainstream media and beyond, linked to celebrities and influencers such as Kim Kardashian (skibidi), Hannah Neeleman of @ballerinafarm (tradwife) and Australian Prime Minister Anthony Albanese (delulu with no solulu). Other words linked to working from home, such as \"mouse jiggler\" - a device or app that simulates mouse movement and stops your computer going into sleep mode - and climate change-related phrases like \"forever chemical\", have also been added. The dictionary, published by Cambridge University Press, draws its entries not just from the written word but from a huge database of real-world English usage. Some of this year's new words include: Colin McIntosh, lexical programme manager at the Cambridge Dictionary, believes the words added to the latest edition won't just be a flash in the pan. \"We only add words where we think they'll have staying power,\" he said. \"Internet culture is changing the English language and the effect is fascinating to observe and capture in the dictionary.\" So what does 'skibidi' mean? Skibidi can have a number of different meanings, including good, bad, cool or even weird. It can even have no meaning and can just be a gibberish sound. It was popularised by the creator of a viral animated YouTube series called Skibidi Toilet - about toilets with human heads sticking out of the bowl. The phrase featured on a necklace given as a present to Kim Kardashian by her 12-year-old daughter, North West. The show is popular among Gen Alpha - referring to people born roughly between 2010 and 2024. Phrases such as \"What the skibidi are you doing?\" and \"That wasn't very skibidi rizz of you\" have entered mainstream usage."
    },
    {
        "title": "Putin has agreed Ukraine can have 'NATO-style' security guarantee, Trump envoy says",
        "description": "Vladimir Putin has agreed to allow Ukraine's allies to offer it a NATO-like security guarantee as part of an eventual deal to end the war, according to US special envoy Steve Witkoff.",
        "url": "https://news.sky.com/story/putin-has-agreed-ukraine-can-have-nato-style-security-guarantee-trump-envoy-says-13413433",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-putin-vladimir_6993936.jpg?20250817182658",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-17 11:36:00",
        "Headline": "Steve Witkoff said it was the first time he had heard the Russian president agree to the suggestion - and called it \"game-changing\".",
        "Content": " Vladimir Putin has agreed to allow Ukraine's allies to offer it a NATO-like security guarantee as part of an eventual deal to end the war, according to US special envoy Steve Witkoff. Mr Witkoff said the Russian president agreed to the move when he met with Donald Trump in Alaska on Friday. Speaking to CNN on Sunday, Mr Witkoff, who was by the US president's side at the summit, said: \"We were able to win the following concession: That the United States could offer Article 5-like protection, which is one of the real reasons why Ukraine wants to be in NATO.\" Article 5 is a core principle of the 32-member collective, which states that an armed attack against one or more of its members shall be considered an attack against all. It has only been invoked once, by the US, in the wake of the 9/11 attacks in 2001. Russia has repeatedly insisted that Ukraine cannot be allowed to join NATO and has dismissed the idea that NATO member forces could be peacekeepers under some sort of ceasefire deal. Mr Witkoff, who has previously met with Mr Putin to discuss an end to the Ukraine war, said Friday's summit was the first time he had heard the Russian president agree to the suggestion of NATO-like protection - and called it \"game-changing\". His comments came as Volodymyr Zelenskyy met with European Commission President Ursula von der Leyen in Brussels. The Ukrainian president said in a post on X: \"This is a historic decision that the United States is ready to take part in security guarantees for Ukraine. \"Security guarantees, as a result of our joint work, must really be very practical, delivering protection on land, in the air, and at sea, and must be developed with Europe's participation.\" Ms von der Leyen, speaking at a news conference with the Ukrainian president, said the European Union \"is ready to do its share\". EU leaders to join Zelenskyy at White House Sunday afternoon also saw Ms von der Leyen and Mr Zelenskyy dial in to a meeting with the coalition of the willing, a peacekeeping alliance of European leaders - some of whom will accompany Mr Zelenskyy to meet with Mr Trump tomorrow. Ms von der Leyen will be at the crunch talks in Washington DC, as will Sir Keir Starmer, France's Emmanuel Macron and Italy's Giorgia Meloni. Germany's Chancellor Friedrich Merz and NATO Secretary General Mark Rutte will also be in attendance, after the US president reportedly extended an invitation to European leaders. Read more: Why is Zelenskyy bringing a posse of leaders? Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine during his summit with Mr Trump as a condition for ending the war. In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Mr Trump is said to be planning to urge Mr Zelenskyy to agree to the conditions as part of a peace deal to end the war. That's despite the Ukrainian president previously ruling out formally handing any territory to Moscow, which he says would be impossible under the country's constitution, and would deprive Ukraine of defensive lines and open the way for Moscow to conduct further offensives. In coordinated statements following the Alaska summit, European leaders said Mr Zelenskyy must play a greater role in future talks, and that peace cannot be achieved without him. The US president said the Washington talk with Mr Zelenskyy could potentially pave the way for a three-way meeting with Mr Putin. Read more from Sky News:The territory Ukraine could be told to surrenderBody language expert unpacks Alaska summit On Saturday, Downing Street insisted Sir Keir and other allies stand ready to support the next phase of talks to end the war. \"At the meeting that will take place at the White House tomorrow, the Prime Minister, with other European partners, stands ready to support this next phase of further talks and will reaffirm that his backing for Ukraine will continue as long as it takes,\" a statement from No 10 said."
    },
    {
        "title": "The stakes are high - and the unity of the alliance against Putin has never been so threatened",
        "description": "When Volodymyr Zelenskyy and his European allies meet Donald Trump in Washington, a huge amount is at stake.",
        "url": "https://news.sky.com/story/the-stakes-are-high-and-the-unity-of-the-alliance-against-putin-has-never-been-so-threatened-13413864",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_6994111.jpg?20250817231856",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-08-17 23:01:00",
        "Headline": "The challenge for Volodymyr Zelenskyy for his talks with Donald Trump at the White House is to avoid a repeat of the disastrous encounter the last time they met there.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  When Volodymyr Zelenskyy and his European allies meet Donald Trump in Washington, a huge amount is at stake. Ukrainian officials are reported to feel betrayed by the US president, who appears to have shifted position to side with Vladimir Putin on a number of key points in the wake of the meeting with him in Alaska. Trump has undermined the unity of the Western alliance by abandoning their calls for an immediate ceasefire in Ukraine. He is no longer threatening more severe sanctions, and more worryingly still he seems open to the idea of making the Ukrainians hand over territory the Russians have not yet captured. He and his real estate lawyer turned rookie negotiator Steve Witkoff seem to believe the conflict can be resolved by an exchange of territory. Putin on the other hand has made it clear he is fighting to extinguish Ukraine as an independent and democratic entity. Read more:Putin has 'agreed NATO-style security guarantee'How a chaotic 24 hours unfoldedWhy is Zelenskyy bringing posse of leaders to talks? Ukrainians say that for Zelenskyy, handing over land his troops have been fighting to defend since 2014 would be politically suicidal and strategically insane. Sergeant Andriy Poluhin, from the Ukrainian 24th Brigade, has fought the Russians in Donetsk on and off since 2015 and is currently based in the fiercely embattled town of Chasiv Yar. 👉 Follow Trump100 on your podcast app 👈 He's typical of many Ukrainians, appalled at the idea his country would have to hand over land so many of their comrades have died fighting for. Putin's claim that he wants to end the war and stop the killing, he says, is self-evidently false. \"It's a lie, it's obviously a lie. I think it's not only my thoughts or Ukrainian ones, but everyone who deals with Russia understands he just lies,\" he says.  Many would agree - except the US president himself, who says he believes the Russian leader wants the killing to end. The challenge for Zelenskyy and his European outriders when they go to the White House is avoiding a repeat of the disastrous Oval Office encounter between him and Trump and his vice president in February. They need to steer Trump back to their side of the argument without angering the famously thin-skinned president and driving him further towards Moscow. The unity of the alliance against Putin has never been so threatened."
    },
    {
        "title": "Zelenskyy knows he risks another Oval Office ambush - but has to be a willing participant in peace talks",
        "description": "There will be no red carpet or fly past, no round of applause when Volodymyr Zelenskyy arrives in Washington DC on Monday.",
        "url": "https://news.sky.com/story/zelenskyy-knows-he-risks-another-oval-office-ambush-but-has-to-be-a-willing-participant-in-peace-talks-13413338",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-zelenskyy-oval-office_6842493.jpg?20250304160138",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-08-17 03:10:00",
        "Headline": "Ukrainian President Volodymyr Zelenskyy is due to meet Donald Trump at the White House following the US leader's summit with Vladimir Putin.",
        "Content": "\n          US correspondent\n              @marthakelner\n  There will be no red carpet or fly past, no round of applause when Volodymyr Zelenskyy arrives in Washington DC on Monday. But the bitter memory of his last visit to the White House will feature prominently in the Ukrainian president's thoughts. In February, he was mocked for not wearing a suit and told he didn't \"have the cards\" by US President Donald Trump, before being walked off the premises early, like an unruly patron being thrown out of the bar.  Zelenskyy knows he is risking another ambush in the Oval Office but has to present himself as a willing participant in peace talks, out of fear of being painted as the obstacle to a resolution. There was initially measured optimism in Kyiv after Trump's summit with Russian President Vladimir Putin, because it appeared that no deal had been cut between Washington and the Kremlin without Ukraine in the room, as had been feared. But that restrained positivity quickly evaporated with the release of a statement by Trump the morning after the night before. In the heady heights of a meeting with strongman Putin, he seemed to have abandoned the one key thing that European leaders had impressed upon him - that there had to be an unconditional ceasefire in Ukraine as an absolute starting point to a permanent resolution. Trump had apparently reached the conclusion that no ceasefire was required. \"The best way to end the horrific war between Russia and Ukraine... is to go directly to a peace agreement,\" is how he put it on his Truth Social media account. Read more:Key takeaways from Sky correspondentsBody language expert unpacks the summit  That sent shockwaves through Kyiv. Many there and elsewhere believe Russia has no intention of stopping the war yet, and will use its military advantage on the battlefield to pressure Ukraine in drawn-out negotiations to give up more territory. In the meantime, the slaughter of Ukrainians will continue. It is the most dramatic of 180s from Trump, who before the meeting and after lobbying from European leaders had said he would not be happy if Putin failed to agree to a ceasefire, and even promised \"severe consequences\". Yet now reports suggest Trump is giving credence to the Russian position - in a phone call to Zelenskyy he laid out Putin's proposal that Ukraine relinquishes even more territory, in return for an end to the war. The Ukrainian president will have, no doubt, been distressed to see the pictures of Putin being greeted like a king on an American military base in Alaska. It is in direct contrast to how he was hosted on US soil. In Trump's orbit everything is a personality contest, and where he has very obvious deference to Putin, he has disdain for Zelenskyy. That makes the Ukrainian's position very difficult."
    },
    {
        "title": "How a chaotic 24 hours unfolded ahead of Trump and Zelenskyy's crunch White House talks",
        "description": "If there's one thing the past 24 hours has confirmed, it's that it's still Donald Trump's world, and we're all just living in it.",
        "url": "https://news.sky.com/story/how-a-chaotic-24-hours-unfolded-ahead-of-trump-and-zelenskyys-crunch-white-house-talks-13413857",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zelenskyy-volodymyr_6994084.jpg?20250817221126",
        "type": "US",
        "Author": "Liz Bates",
        "Date Published": "2025-08-17 20:44:00",
        "Headline": "The US president's deal-making skills came under question after his summit with Vladimir Putin in Alaska - but it's clear he's retained his ability to catch the world off guard.",
        "Content": "\n          Political correspondent\n              @wizbates\n If there's one thing the past 24 hours has confirmed, it's that it's still Donald Trump's world, and we're all just living in it. In the aftermath of the Alaska meeting, the US president's deal-making skills came under question when he seemingly walked away empty-handed. But it was clear he had retained his ability to catch everyone off guard, as a meeting between him and President Volodymyr Zelenskyy unexpectedly became a last-minute White House peace summit.  The invitation to European leaders drifted out, and within hours, the cast list had grown to include six more, as world leaders dropped everything to fit in with Mr Trump's unpredictable timetable. There were signs of disorganisation behind the scenes. When the British Prime Minister's spokesman was asked who the invite had come from - the White House or the Ukrainian president - they replied: \"A bit of both.\"  Read more:The land Ukraine could be told to give upKey takeaways from Alaska summit Meanwhile, the meeting of the coalition of the willing - a Starmer and Macron-led group of Ukraine's European allies - had a nervous feel to it as members resolved to stand firm with Ukraine - even if it puts them at odds with the US. At times, it sounded like they were trying to convince themselves they could do it. And as all of this frantic diplomatic reaction played out, the man in the middle of it all headed to the golf course - calm at the centre of the diplomatic storm he created as his allies swirl around him."
    },
    {
        "title": "Ronnie Rondell Jr: Veteran Hollywood stuntman set on fire for Pink Floyd album cover dies",
        "description": "Veteran stuntman Ronnie Rondell Jr, who was set on fire for the front cover of Pink Floyd's Wish You Were Here album, has died, his family has said. ",
        "url": "https://news.sky.com/story/ronnie-rondell-jr-veteran-hollywood-stuntman-set-on-fire-for-pink-floyd-album-cover-dies-13413539",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ronnie-rondell-pink-floyd_6993635.jpg?20250817145137",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-17 13:54:00",
        "Headline": "He worked on numerous films and TV shows and was pictured as a businessman on fire on the cover of the 1975 album Wish You Were Here, having his moustache singed off during the shoot on the Warner Bros studio lot",
        "Content": "Veteran stuntman Ronnie Rondell Jr, who was set on fire for the front cover of Pink Floyd's Wish You Were Here album, has died, his family has said.  Rondell Jr, who performed in a host of Hollywood films, including How the West Was Won, Ice Station Zebra, Twister and The Matrix Reloaded, was 88. He died at a care home in Osage Beach, Missouri, earlier this week, his family said in a statement posted on the Hedges-Scott-Millard funeral homes website. Rondell Jr was pictured as a businessman on fire on the cover of the British rock band's multi-million-selling 1975 album. His moustache was singed off during the shoot on the Warner Bros studio lot in Burbank, California, according to The Hollywood Reporter. Rondell Jr also racked up numerous TV credits and was known for taking on daring stunts involving diving, gymnastics and hang-gliding skills. One of his best-known stunts was leaping from a pole that was on fire as it toppled over in the 1963 adventure film Kings of the Sun. Two years later, he could be seen in midair flying upside down above a cannon in the 1965 western Shenandoah. Among his other movie credits are the James Bond adventure, Diamonds Are Forever (1971), Mel Brooks's Blazing Saddles (1974), Lethal Weapon (1987), Thelma & Louise (1991), Speed (1994) and Star Trek: First Contact (1996). He later came out of retirement to take part in a spectacular car chase in The Matrix Reloaded (2003), on which his son R A Rondell was the supervising stunt coordinator. Rondell came from a family steeped in the movies, with his father, Ronald R Rondell, an extra who graduated to working as an assistant director on films like Around the World in 80 Days and various TV shows. Read more on Sky News:Terence Stamp diesTopshop's catwalk relaunchWarning over AI-authored books One of his sons, R A Rondell, is a stunt performer and coordinator, while another son, Reid Rondell, 22, died in 1985 in a helicopter crash in California while performing a stunt on the TV series Airwolf. Born in Hollywood in 1937, Rondell excelled in gymnastics and diving at school before entering the US Navy, where he specialised in scuba diving and mine force demolition. He began as an extra before graduating to TV stunt work, eventually setting up Stunts Unlimited, which represented top motorcycle racers, car drivers, horsemen, pilots, aerial specialists and fight choreographers. He is survived by his wife of 56 years, Mary Rondell, his son, R A Rondell, as well as grandchildren and great-grandchildren."
    },
    {
        "title": "Three dead and eight wounded in shooting at Brooklyn lounge in New York",
        "description": "Three men have been killed and another eight people injured in an overnight shooting at a lounge in New York.",
        "url": "https://news.sky.com/story/three-dead-and-eight-wounded-in-shooting-at-brooklyn-lounge-in-new-york-13413434",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jessica-tisch-nypd_6993505.png?20250817125354",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-17 11:37:00",
        "Headline": "Police Commissioner Jessica Tisch said multiple shooters were involved in the incident at the Crown Heights venue, with at least 36 shell casings recovered.",
        "Content": "Three men have been killed and another eight people injured in an overnight shooting at a lounge in New York. NYPD said multiple shooters were involved in the incident after a \"dispute\" and a hunt is under way to find those responsible. The shooting occurred at around 3.30am on Sunday at Taste Of The City Lounge in the Crown Heights neighbourhood of Brooklyn. Police Commissioner Jessica Tisch told a news conference three men had died - a 27-year-old, a 35-year-old, and a male of an unknown age. Eight others - five men and three females - have been taken to local hospitals. Ms Tisch said the 11 victims ranged in age from 27 to 61. The police chief said multiple shooters were involved in the incident at the Franklin Avenue venue, with at least 36 shell casings recovered. \n                  Harvey Weinstein to be tried for third time in New York after mistrial on rape charge\n                 \n                  Remains of three 9/11 victims identified more than 20 years after attacks\n                 \n                  Heavy rain and flash floods batter US east coast with emergency declared in New York\n                 A firearm has been recovered in the nearby vicinity of Bedford Avenue and Eastern Parkway, with detectives continuing to canvass available CCTV. Ms Tisch said: \"At this time, no one is in custody.\" She added: \"It's a terrible thing that happened this morning, but we're going to investigate and get to the bottom of what went down.\" Read more from Sky News:Remaining hospitals in Gaza overwhelmed with malnutrition casesBody pulled from river in search for missing boy The shooting comes amid a record low year for gun violence in New York City, however follows on from a separate shooting in Times Square this month in which three people were left injured."
    },
    {
        "title": "Miniature classic car-maker Hedley Studios revs up rescue deal",
        "description": "A company which makes miniaturised electric versions of classic cars has secured a rescue deal led by an American merchant banking group.",
        "url": "https://news.sky.com/story/miniature-classic-car-maker-hedley-studios-revs-up-rescue-deal-13413458",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hedley-studios-car_6993516.jpg?20250817140105",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-17 12:33:00",
        "Headline": "Hedley Studios, which makes driveable miniature models of brands such as Bugatti and Ferrari, has been sold to a vehicle controlled by US merchant bank Island Capital Group, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A company which makes miniaturised electric versions of classic cars has secured a rescue deal led by an American merchant banking group. Sky News understands that the future of Hedley Studios - formerly known as The Little Car Company - has been salvaged through a pre-pack administration deal. FRP Advisory is understood to have acted as administrator before selling the business to an entity controlled by Island Capital Group. Hedley Studios was founded in 2018, when luxury car-maker Bugatti approached Ben Hedley to see if he could recreate a 1920s Type 35 racing car at half-scale to mark its 110th anniversary. In a statement issued in response to an enquiry from Sky News, the company said it had built and delivered more than 500 vehicles to clients in more than 60 countries in the last 17 months. Hedley Studios manufactures its cars at three-quarters the size of the original model, with the resulting vehicles typically costing £75,000 or more. \"We're thrilled to welcome Island Capital Group as a strategic partner in the next phase of Hedley Studios' growth,\" Mr Hedley said. \n                  Whitehall on alert for collapse of Gupta's steel empire\n                 \n                  Cara Delevingne reveals how Topshop inspired her fashion sense - as brand relaunches in London\n                 \n                  Government will not offer bailout to UK's largest bioethanol plant\n                 \"Its investment and belief in our vision mark a pivotal moment for the company as we accelerate our expansion and reach new global audiences. Hedley Studios makes its cars in partnership with a range of luxury manufacturers, including Aston Martin, Bentley and Ferrari. Andrew Farkas, founder, chairman and CEO of Island Capital, which initially backed Hedley Studios in 2023, said: \"This latest investment is testament to the entrepreneurial spirit of Ben and his team in building a successful British luxury brand in a short period of time. \"Automotive enthusiasts globally are increasingly keen to honour these historic icons, bringing them to new audiences in a new, fully electric way. \"Our broader investment marks the beginning of a new chapter for Hedley Studios, reinforcing its position as a leader in the creation of luxury, driveable artworks, and Island Capital is excited to be part of that growth journey.\""
    },
    {
        "title": "How a chaotic 24 hours unfolded ahead of Trump and Zelenskyy's crunch White House talks",
        "description": "If there's one thing the past 24 hours has confirmed, it's that it's still Donald Trump's world, and we're all just living in it.",
        "url": "https://news.sky.com/story/how-a-chaotic-24-hours-unfolded-ahead-of-trump-and-zelenskyys-crunch-white-house-talks-13413857",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zelenskyy-volodymyr_6994084.jpg?20250817221126",
        "type": "Politics",
        "Author": "Liz Bates",
        "Date Published": "2025-08-17 20:44:00",
        "Headline": "The US president's deal-making skills came under question after his summit with Vladimir Putin in Alaska - but it's clear he's retained his ability to catch the world off guard.",
        "Content": "\n          Political correspondent\n              @wizbates\n If there's one thing the past 24 hours has confirmed, it's that it's still Donald Trump's world, and we're all just living in it. In the aftermath of the Alaska meeting, the US president's deal-making skills came under question when he seemingly walked away empty-handed. But it was clear he had retained his ability to catch everyone off guard, as a meeting between him and President Volodymyr Zelenskyy unexpectedly became a last-minute White House peace summit.  The invitation to European leaders drifted out, and within hours, the cast list had grown to include six more, as world leaders dropped everything to fit in with Mr Trump's unpredictable timetable. There were signs of disorganisation behind the scenes. When the British Prime Minister's spokesman was asked who the invite had come from - the White House or the Ukrainian president - they replied: \"A bit of both.\"  Read more:The land Ukraine could be told to give upKey takeaways from Alaska summit Meanwhile, the meeting of the coalition of the willing - a Starmer and Macron-led group of Ukraine's European allies - had a nervous feel to it as members resolved to stand firm with Ukraine - even if it puts them at odds with the US. At times, it sounded like they were trying to convince themselves they could do it. And as all of this frantic diplomatic reaction played out, the man in the middle of it all headed to the golf course - calm at the centre of the diplomatic storm he created as his allies swirl around him."
    },
    {
        "title": "Terence Stamp, Superman villain and star of The Adventures of Priscilla, Queen of the Desert, has died",
        "description": "British actor Terence Stamp - who famously played General Zod in Superman and Superman II - has died at the age of 87.",
        "url": "https://news.sky.com/story/terence-stamp-superman-villan-and-star-of-the-adventures-of-pricilla-queen-of-the-desert-has-died-13413590",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-terence-stamp-actor_6993722.jpg?20250817155921",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-17 14:46:00",
        "Headline": "The Oscar-nominated actor, who was born in London's East End, died on Sunday morning at the age of 87.",
        "Content": "British actor Terence Stamp - who famously played General Zod in Superman and Superman II - has died at the age of 87. The Oscar-nominated actor, who was born in London's East End, also starred in hits such as Theorem, A Season in Hell, and The Adventures of Priscilla, Queen of the Desert. He formed one of Britain's most glamorous couples with Julie Christie, with whom he starred in Far From the Madding Crowd in 1967. In a statement, his family said he died on Sunday morning, adding: \"He leaves behind an extraordinary body of work, both as an actor and as a writer that will continue to touch and inspire people for years to come.\" Stamp was born on 22 July 1938 and was the son of a tugboat stoker. Growing up in London during the Second World War, he endured the Blitz as a child and left school to work initially in advertising before later securing a scholarship to go to drama school. Stamp received various accolades during his career, including a Golden Globe in 1962 for most promising newcomer for Billy Budd and a Cannes Film Festival best actor award in 1965 for The Collector. He also received Academy Award and BAFTA nominations for his performance in Billy Budd, as well as a second BAFTA nod in 1994 for his role in The Adventures of Priscilla, Queen of the Desert - which co-starred Hugo Weaving and Guy Pearce. His most high-profile role was that of General Zod, the villainous leader of three Kryptonian criminals in the 1978 movie Superman and its 1980 sequel Superman II - which starred Christopher Reeve in the lead role. His other films also include Young Guns, The Limey and Valkyrie with Tom Cruise. Most recently, Stamp starred in director Edgar Wright's Last Night in Soho. The 2021 psychological horror film also featured Diana Rigg, Anya Taylor-Joy and Matt Smith. As well as appearing on television and on stage, Stamp additionally lent his voice for video games - appearing in the likes of Halo 3 and The Elder Scrolls IV: Oblivion. Read more from Sky News:Cara Delevingne reveals how Topshop inspired her fashion senseComedian reveals he's cancer free Stamp liked to recall how he was on the verge of becoming a tantric sex teacher at an ashram in India when, in 1977, he received a telegram from his London agent with news that he was being considered for the Superman film. \"I was on the night flight the next day,\" Stamp said in an interview with his publisher Watkins Books in 2015. After eight years largely out of work, landing the role of villain General Zod - the megalomaniacal leader of the Kryptonians - the full glare of Hollywood's limelight fell on the London-born star. Buoyed by his new role, Stamp said he would respond to curious looks from passers-by with a command of: \"Kneel before Zod, you b***ards,\" which was said to have gone down a storm."
    },
    {
        "title": "Ronnie Rondell Jr: Veteran Hollywood stuntman set on fire for Pink Floyd album cover dies",
        "description": "Veteran stuntman Ronnie Rondell Jr, who was set on fire for the front cover of Pink Floyd's Wish You Were Here album, has died, his family has said. ",
        "url": "https://news.sky.com/story/ronnie-rondell-jr-veteran-hollywood-stuntman-set-on-fire-for-pink-floyd-album-cover-dies-13413539",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ronnie-rondell-pink-floyd_6993635.jpg?20250817145137",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-17 13:54:00",
        "Headline": "He worked on numerous films and TV shows and was pictured as a businessman on fire on the cover of the 1975 album Wish You Were Here, having his moustache singed off during the shoot on the Warner Bros studio lot",
        "Content": "Veteran stuntman Ronnie Rondell Jr, who was set on fire for the front cover of Pink Floyd's Wish You Were Here album, has died, his family has said.  Rondell Jr, who performed in a host of Hollywood films, including How the West Was Won, Ice Station Zebra, Twister and The Matrix Reloaded, was 88. He died at a care home in Osage Beach, Missouri, earlier this week, his family said in a statement posted on the Hedges-Scott-Millard funeral homes website. Rondell Jr was pictured as a businessman on fire on the cover of the British rock band's multi-million-selling 1975 album. His moustache was singed off during the shoot on the Warner Bros studio lot in Burbank, California, according to The Hollywood Reporter. Rondell Jr also racked up numerous TV credits and was known for taking on daring stunts involving diving, gymnastics and hang-gliding skills. One of his best-known stunts was leaping from a pole that was on fire as it toppled over in the 1963 adventure film Kings of the Sun. Two years later, he could be seen in midair flying upside down above a cannon in the 1965 western Shenandoah. Among his other movie credits are the James Bond adventure, Diamonds Are Forever (1971), Mel Brooks's Blazing Saddles (1974), Lethal Weapon (1987), Thelma & Louise (1991), Speed (1994) and Star Trek: First Contact (1996). He later came out of retirement to take part in a spectacular car chase in The Matrix Reloaded (2003), on which his son R A Rondell was the supervising stunt coordinator. Rondell came from a family steeped in the movies, with his father, Ronald R Rondell, an extra who graduated to working as an assistant director on films like Around the World in 80 Days and various TV shows. Read more on Sky News:Terence Stamp diesTopshop's catwalk relaunchWarning over AI-authored books One of his sons, R A Rondell, is a stunt performer and coordinator, while another son, Reid Rondell, 22, died in 1985 in a helicopter crash in California while performing a stunt on the TV series Airwolf. Born in Hollywood in 1937, Rondell excelled in gymnastics and diving at school before entering the US Navy, where he specialised in scuba diving and mine force demolition. He began as an extra before graduating to TV stunt work, eventually setting up Stunts Unlimited, which represented top motorcycle racers, car drivers, horsemen, pilots, aerial specialists and fight choreographers. He is survived by his wife of 56 years, Mary Rondell, his son, R A Rondell, as well as grandchildren and great-grandchildren."
    }
]