[
    {
        "title": "Trump 'p***ed' off' and 'very angry' with Putin after Zelenskyy comments",
        "description": "Donald Trump has said he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's President Volodymyr Zelenskyy, in a phone call with Sky News' US partner network, NBC News.",
        "url": "https://news.sky.com/story/no-one-will-be-fired-over-signal-chat-group-blunder-says-president-trump-13338576",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-vladimir-putin_6860593.jpg?20250318202423",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-30 09:24:00",
        "Headline": "In a phone call with Sky's US partner network, NBC News, Mr Trump said the Russian president's recent comments, calling for a transitional government to be put in place in Ukraine, were \"not going in the right direction\".",
        "Content": "Donald Trump has said he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's President Volodymyr Zelenskyy, in a phone call with Sky News' US partner network, NBC News. Mr Trump said the Russian president's recent comments, calling for a transitional government to be put in place in Ukraine in a move that could effectively push out Mr Zelenskyy, were \"not going in the right direction\". He told NBC's Kirsten Welker: \"If I feel we're in the midst of a negotiation, you could say that I was very angry, pissed off, when Putin said yesterday that - you know, when Putin started getting into Zelenskyy's credibility, because that's not going in the right direction.\" It is a rare move by Mr Trump to criticise Mr Putin, whom he has generally spoken positively about during discussions to end the war in Ukraine. Last month, he also released a barrage of critical comments about Mr Zelenskyy's leadership, calling him a \"dictator\" and making unfounded claims that he had \"poor approval\" ratings in Ukraine. The president added that if Russia is unable to make a deal on \"stopping bloodshed in Ukraine\" - and Mr Trump felt that Moscow was to blame - then he would put secondary tariffs on \"all oil coming out of Russia\". \"That would be that if you buy oil from Russia, you can't do business in the United States. There will be a 25% tariff on all oil, a 25 to 50-point tariff on all oil,\" he said. US correspondent Industrial language from the US president.  \"Very angry\" and \"p***ed off\" he said he was with Vladimir Putin. What's upsetting him is an intervention by the Russian leader at the end of last week. Mr Putin questioned Volodymyr Zelenskyy's legitimacy - he said a peace agreement brokered by the Ukrainian president could be challenged by future governments.  Donald Trump didn't like that and doesn't see that as productive in terms of progress towards peace.  A rare rebuke from Mr Trump for Mr Putin on the face of it, the like of which we have not heard from the president for a while. Remember that Mr Trump himself has undermined the credibility of Mr Zelenskyy in the past, so clearly Trump is in the middle of a two-way negotiation. This has the sound, at least, of an even-handedness, that for most outside Moscow has been lacking on the part of the US president up until now. Mr Trump said Mr Putin knows he is angry, but added that he has \"a very good relationship with him\" and \"the anger dissipates quickly... if he does the right thing\". He said he plans to speak with the Russian president again this week. In the wide-ranging interview with NBC, Mr Trump also discussed:• The possibility of seeking a third term in office;• Imposing secondary tariffs on Iran;• Not ruling out military rule to annex Greenland;• Confirmed no one will be fired over Signal group chat blunder. 👉 Follow Trump 100 on your podcast app 👈 'Not joking' about seeking a third term When asked if he will seek to stay in the White House for a third term, which is prohibited by the Constitution under the 22nd Amendment, Mr Trump told NBC: \"A lot of people want me to do it.\" He added: \"I basically tell them we have a long way to go, you know, it's very early in the administration. I'm focused on the current.\" The president said he liked working, and would be interested in staying in the role for another four years after his second term comes to an end in 2028. \"I'm not joking,\" he said, when asked to clarify. \"But I'm not - it is far too early to think about it.\" Mr Trump said one method in which a third term could be possible is by Vice President JD Vance running for office and then handing the responsibility over to him. He refused to share details on other methods he claims exist. Threatening Iran with bombing and tariffs Mr Trump said if Tehran did not make a deal with the US to ensure it did not develop a nuclear weapon, there could be bombing and secondary tariffs. The tariffs would affect buyers of the country's goods. It comes after he signed an executive order last week authorising such tariffs on buyers of Venezuelan oil. Iranian President Masoud Pezeshkian said on Sunday that Iran had rejected direct negotiations with the US, but left open the possibility of indirect negotiations with Washington.  No one will be fired over Signal group chat blunder Addressing the national security blunder, which saw a journalist mistakenly added to a Signal chat group discussing planned strikes on Yemen, Mr Trump confirmed no one will be fired. It was revealed this week that national security adviser Michael Waltz accidentally added The Atlantic's editor-in-chief Jeffrey Goldberg to a group chat with senior members of the Trump administration who were discussing plans to strike Houthi militants earlier this month. Read more from Sky News:Could the US really become a Commonwealth member?JD Vance felt the cold in Greenland - and it wasn't just the weather The president said he doesn't fire people \"because of fake news and because of witch hunts\", adding that he still had confidence in Mr Waltz and defence secretary Pete Hegseth, who was also in the Signal chat. Military option to annex Greenland not off the table Mr Trump also discussed his commitment to annexing Greenland - a semi-autonomous territory which is part of the Kingdom of Denmark - and said that using military force was \"not off the table\".  \"We'll get Greenland. Yeah, 100%,\" the president said. He added: \"[There's a] good possibility that we could do it without military force. [But] I don't take anything off the table.\" Greenland Prime Minister Jens-Frederik Nielsen responded to Mr Trump's comments by reiterating that the US will not take control of the Arctic territory, and that it \"controls its own future\"."
    },
    {
        "title": "Starmer and Trump discuss 'productive negotiations' towards US-UK 'prosperity' deal",
        "description": "Sir Keir Starmer and Donald Trump have discussed the \"productive negotiations\" towards a UK-US \"economic prosperity deal\", Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-and-trump-discuss-productive-negotiations-towards-us-uk-trade-deal-downing-street-says-13339017",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-keir-starmer_6841896.jpg?20250228025726",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:48:00",
        "Headline": "The leaders also agreed that the negotiations on an \"economic prosperity deal\" would continue \"at pace\" this week, Downing Street said.",
        "Content": "Sir Keir Starmer and Donald Trump have discussed the \"productive negotiations\" towards a UK-US \"economic prosperity deal\", Downing Street has said. The two leaders discussed a possible deal in a phone call on Sunday and agreed negotiations will \"continue at pace\", according to a statement. A Downing Street spokesperson said: \"The prime minister spoke to President Trump this evening. \"The president opened by wishing His Majesty the King best wishes and good health. \"They discussed the productive negotiations between their respective teams on a UK-US economic prosperity deal, agreeing that these will continue at pace this week. \"Discussing Ukraine, the prime minister updated the president on the productive discussions at the meeting of the Coalition of Willing in Paris this week. The leaders agreed on the need to keep up the collective pressure on Putin. \"They agreed to stay in touch in the coming days.\" Earlier this week, Mr Trump announced a new 25% tariff on all imported cars - threatening UK producers' largest single export market. Signing an executive order on Wednesday, Mr Trump said the tax would kick in on 2 April - what he has called \"liberation day\". British manufacturers such as Jaguar Land Rover, Bentley, Aston Martin and Rolls-Royce stand to be worst affected by the tariffs.  But the UK government has signalled it will not retaliate - mirroring its response to the tariffs on steel and aluminium imposed globally by the Trump administration earlier this month. Tariffs are a key part of Mr Trump's efforts to reshape global trade relations. He plans to impose a swathe of what he calls \"reciprocal\" taxes on \"liberation day\" that would match tariffs and sales taxes levied by other nations. President Trump told reporters on Sunday that the reciprocal tariffs will include all nations that charge fees on US exports. Read more:Trump 'p***ed off' with Putin after Zelenskyy comments How will Trump's economic tariffs affect the UK?Vance hits out at Denmark during Greenland visit The UK hopes an economic deal with the US will spare the country from a broader round of these tariffs. On Friday, Mr Trump said he was open to carving out deals with countries seeking to avoid US tariffs, but those agreements would be negotiated after 2 April. Mr Trump has already placed a 20% tax on all imports from China. He also placed 25% tariffs on Mexico and Canada - before later suspending them on certain goods - with a lower 10% tariff on Canadian energy products in addition to the duties on all steel and aluminium imports, including those from the UK. The two leaders spoke last Sunday in a \"brief call\" about the economic prosperity deal, and again nearly three weeks ago ahead of the US-Ukraine talks in Saudi Arabia. Mr Starmer and Mr Trump appeared to have a warm personal relationship when they met in the Oval Office last month. But just a day later, the US president along with vice president JD Vance delivered a dressing down to Ukrainian president Volodymyr Zelenskyy. That meeting marked a major shift in the US approach to Ukraine, while Mr Starmer cemented his position as a bridge between Europe and Washington in the peace talks by hosting Mr Zelenskyy and other European leaders in London days later. Mr Starmer and Mr Trump also spoke twice before they met in person."
    },
    {
        "title": "Charity boss says Prince Harry asked for public message of support for Meghan after polo fundraiser 'went badly'",
        "description": "The chair of a charity set up by Prince Harry says he asked for a public message of support for Meghan after a polo fundraiser \"went badly\".",
        "url": "https://news.sky.com/story/prince-harry-number-one-risk-to-his-own-charity-says-chair-who-accused-him-of-bullying-and-harassment-13338522",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-sophie-meghan_6871302.jpg?20250330140046",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-30 06:28:00",
        "Headline": "In a wide-ranging interview on Sky's Sunday Morning with Trevor Phillips, Sophie Chandauka said the charity lost sponsors and donors when the prince left the UK. A source has denied the claims as \"completely baseless\".",
        "Content": " The chair of a charity set up by Prince Harry says he asked for a public message of support for Meghan after a polo fundraiser \"went badly\". In a wide-ranging interview with Sky News' Trevor Phillips, chair of Sentebale Dr Sophie Chandauka also claimed: • The charity lost sponsors and donors when the Sussexes left the UK - but she wasn't allowed to discuss the problem• Harry is the \"number one risk\" to the charity• He tried to \"eject\" her from the organisation• He would appoint board members without consulting her Sentebale was set up by the prince in 2006 in memory of his mother, Princess Diana, to help young people with HIV in Lesotho and Botswana.  Dr Chandauka has already accused the prince of \"harassment and bullying at scale\" by \"unleashing\" the Sussex PR machine - an allegation a source denied as \"completely baseless\". On Tuesday, Prince Harry quit as patron of the charity along with several other senior members after disagreements with the chair. Polo fundraiser 'went badly' \n                  Will we ever love Meghan?\n                 \n                  With Love, Meghan: Questions remain about how royal couple's new life is working out - and show needs to succeed\n                 \n                  Meghan shares video of Princess Lilibet to mark countdown to Netflix show\n                 In a full interview with Sunday Morning with Trevor Phillips, Dr Chandauka discussed Prince Harry's filming of a Netflix show, which she said resulted in the charity losing the venue for an event they were holding. She said the duke phoned her team, saying he'd like to bring a Netflix crew to the polo event. She said the venue owners were originally \"happy for us to use their polo grounds at a material discount\". But as a result of the request, the price increased as it had become a commercial venture. The charity was forced to pull out of the venue as it couldn't afford the fee, according to Dr Chandauka, but then was \"lucky enough\" to find another through Prince Harry's connections. On the day, however, she claimed there were more problems. \"The duchess decided to attend, but she told us she wasn't attending, and she brought a friend, a very famous friend,\" Dr Chandauka said. \"The choreography went badly on stage because we had too many people on stage. \"The international press captured this, and there was a lot of talk about the duchess and the choreography on stage and whether she should have been there and her treatment of me.\" She claimed the media attention around Meghan's treatment of her prompted Prince Harry to ask Dr Chandauka to issue a statement in support of the duchess. \"I said I wouldn't. Not because I didn't care about the duchess, but because I knew what would happen if I did so, number one. And number two, because we cannot be an extension of the Sussexes,\" she said. A source close to the former trustees of the Sentebale charity described Dr Chandauka's account of the polo match as \"highly misleading\". Sky News also contacted Netflix, who declined to comment. 'Number one risk' Dr Chandauka was asked if the Duke of Sussex is the \"number one risk\" to the charity, and replied \"yes\". She added that when she asked why there was a loss of sponsors at the time the Sussexes left the UK, she was told: \"It's an uncomfortable conversation to have with Prince Harry in the room.\" \"What you discovered was essentially, donors were walking because of the prince's reputation?\" asked Trevor Phillips. \"Yes,\" Dr Chandauka replied.  She also accused the prince of trying to \"eject\" her from the organisation. \"There were board meetings where members of the executive team and external strategic advisors were sending me messages saying, 'Should I interrupt?', 'Should I stop this?' 'Oh my gosh, this is so bad',\" she said. \"In fact, our strategic adviser for fundraising then sent me a message saying she wouldn't want to ever attend any more board meetings or bring her colleagues because of the treatment.\" When she didn't leave, Dr Chandauka suggested Prince Harry tried to force the failure of the charity he set up in his mother's memory. \"Prince Harry started to brief, and his team, sponsors that I had been speaking to, against me and the charity, because that is a sure way of getting me out if it's seen as though I'm not being successful in my fundraising efforts,\" she said.  When asked about a Sky News interview with former trustee Dr Kelello Lerotholi who said he was \"surprised\" by her accusations about the prince, Dr Chandauka said she wasn't \"surprised that he didn't know much of what was going on in the organisation\". \"He had the worst attendance record and even when he was in the meetings, he didn't actually contribute that much,\" she said. 'Everybody's shocked and quiet' Dr Chandauka gave an example of the prince's behaviour in board meetings. \"Prince Harry decides, on this specific occasion, that he wants to appoint an individual to the board, with immediate effect, without having talked to me,\" she said. \"His proxy on the board says, 'Yes, I second that motion'. The third proxy on the board says, 'Welcome to the board, Brian'. \"And everybody's shocked and quiet, but this is what happens when the prince is in the room and no one has the courage to speak.\" Royal correspondent The anger and acrimony is palpable. This is a catastrophic row risking the reputation of Prince Harry's beloved charity. Sentebale is so much more than a cause he supports. It is a deeply personal tribute to the memory of his late mother. When Harry visited Lesotho he came alive, it was like his second home. His passion and connection with the communities was clear. And for years he's helped raise huge funds. But here we are with the charity seemingly imploding, caught up in a bitter and confusing boardroom blame game. Some of the allegations are incredibly serious and relations appear irreparable. Read Laura's analysis in full. Sky News contacted the Duke and Duchess of Sussex about the contents of Sophie Chandauka's interview with Trevor Phillips, and they declined to offer any formal response. But the source close to the former trustees of the Sentebale charity has described as categorically false Dr Chandauka's claims that Dr Lerotholi did not attend meetings and did not contribute much when he was in meetings and that the Duke of Sussex leaving the UK impacted the charity, caused it to lose sponsors, or that the duke posed the biggest risk to the charity. The source also described as \"completely baseless\" Dr Chandauka's claims that she was bullied and harassed, briefed against by Prince Harry, or that the Sussex machine was unleashed on her and that the people on the board of Sentebale were scared to speak up when the duke was in the room. The claim that the press was informed about the royal patrons departure as trustees before the charity, has been described by the source as \"categorically untrue\". In response to Dr Chandauka's claim that the Duke of Sussex was 'forcing the failure' of the charity 'as a last resort', the source pointed to the public statement of Prince Harry and his co-founder of the Sentebale charity, Prince Seeiso of Lesotho, which read: \"It is devastating that the relationship between the charity's trustees and the chair of the board broke down beyond repair, creating an untenable situation. \"These trustees acted in the best interest of the charity in asking the chair to step down, while keeping the wellbeing of staff in mind. In turn, she sued the charity to remain in this voluntary position, further underscoring the broken relationship.\""
    },
    {
        "title": "Alexander Sloley: Police offer £10k reward for information about teen who disappeared 17 years ago",
        "description": "Police have issued a &#163;10,000 reward for information about a teenager who disappeared from his home nearly 17 years ago.&#160;",
        "url": "https://news.sky.com/story/alexander-sloley-police-offer-16310k-reward-for-information-about-teen-who-disappeared-17-years-ago-13339010",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alex-sloley-missing-persons_6871642.jpg?20250330203742",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:34:00",
        "Headline": "Alexander Sloley, an accountancy student, had little money, no wallet and no passport when he went missing in Islington, north London two days before his birthday in August 2008.",
        "Content": "Police have issued a £10,000 reward for information about a teenager who disappeared from his home nearly 17 years ago.  Alexander Sloley, a 16-year-old accountancy student, had little money, no wallet and no passport when he went missing in Islington, north London, two days before his birthday in August, 2008. He had been visiting a friend's home in Edmonton, but had set off home at around midday. His family and friends have not heard from him since, and, despite repeated appeals and enquiries, police have never been able to find him. Mr Sloley had no belongings or spare clothes that would indicate he planned to run away, and his phone, bank account, and National Insurance number have not been used since he went missing. He has also never been spotted on CCTV. In 2009, his case was one of the first to be publicised on nearly 13.5 million milk cartons at supermarket chain Iceland. When he went missing, Mr Sloley was described as a light-skinned black male, 5ft 5ins tall and of medium build, with striking blue eyes. According to the Camden New Journal, in 2012 a police officer said about Mr Sloley's disappearance: \"It's like he disappeared off the face of the planet.\" In 2017, Mick Neville, a retired head of the Metropolitan Police's Central Images Unit, said he believed there was a possible connection between Alex and missing 14-year-old Andrew Gosden. Mr Gosden was last seen in King's Cross Station in London after taking a train from Doncaster, where he lived with his parents and sister. There has been no trace of him since. However, in 2019, detectives said there was no proof that Mr Sloley had been harmed and there was no evidence that it was linked to any other cases. Speaking about the Metropolitan Police's £10,000 reward, detective chief inspector Sarb Kaur, who is leading the investigation into his disappearance, said: \"Alex was reported missing to police on 8 August, 2008. \"Since then, there have been extensive enquiries made by police, but sadly Alex has not yet been found. \"We are now offering a reward of up to £10,000 for anyone who has information relating to Alex's whereabouts. \"This remains an active missing person investigation, subject to regular review by senior officers, with the aim of locating Alex and bringing some comfort to his family. We have recently met with Alex's mother to outline how we intend to progress our investigation to find him. \"I would ask anyone with information who could help to please get in contact immediately, no matter how insignificant you think this could be.\""
    },
    {
        "title": "First orbital rocket launched from Europe crashes into sea - but company says test 'met all expectations'",
        "description": "The first orbital rocket launched from mainland Europe took off from Norway on Sunday - but crashed into the sea and exploded 40 seconds later.",
        "url": "https://news.sky.com/story/first-orbital-rocket-launched-from-europe-crashes-into-sea-but-company-says-test-met-all-expectations-13338992",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rocket-europe-norway_6871641.jpg?20250330203622",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:04:00",
        "Headline": "Isar Aerospace, the German company that built the rocket, had warned that the launch could end prematurely, and maintained that the flight had produced extensive data that its team can learn from.",
        "Content": " The first orbital rocket launched from mainland Europe took off from Norway on Sunday - but crashed into the sea and exploded 40 seconds later. The unmanned Spectrum rocket blasted off from the Arctic Andoeya Spaceport, on Sunday at 12.30pm local time before it was terminated less than a minute later. Isar Aerospace, the German company that built the rocket, had warned that the launch could end prematurely. It maintained that despite being short, the flight had produced extensive data that its team could learn from. \"Our first test flight met all our expectations, achieving a great success,\" Daniel Metzler, Isar's chief executive and co-founder, said. \"We had a clean lift-off, 30 seconds of flight and even got to validate our flight termination system.\" Spectrum is a two-stage launch vehicle specifically designed to put small and medium satellites into orbit. Its maiden voyage was aimed at kickstarting satellite launches from Europe. Several European nations, including the UK and Sweden, have said they want to be an active player in the growing market of commercial space missions. Big global companies already ahead in the satellite launch game include Elon Musk's SpaceX, which launches from the US, and French company ArianeGroup, a joint venture between Airbus and Safran that uses a spaceport in South America's French Guiana. Mr Musk's SpaceX also operates the Starlink satellite service, a communications network that can provide much of the globe with access to the internet. Germany's BDLI aerospace industries association said Isar's first flight would lead to further progress. BDLI managing director, Marie-Christine von Hahn, said: \"Europe urgently needs to ensure its sovereignty in space. Elon Musk's Starlink is not without alternatives - nor should it be.\" Read more from Sky News:Should daylight savings be scrapped?New AI test set to transform diagnosis of lung condition Sweden, with its Esrange launch site, and Britain with its SaxaVord Spaceport in the Scottish Shetland Islands, are the nearest rivals to the Norwegian site, all of which aim to give Europe greater autonomy in space flights. SaxaVord, which suffered a setback when a rocket engine exploded during a test last year, is planning its first satellite launch later this year."
    },
    {
        "title": "Myanmar earthquake: Military regime targeting 'civilian areas' with airstrikes in wake of disaster, armed group claims",
        "description": "An armed resistance group in Myanmar has accused the ruling military government of continuing to carry out airstrikes on \"civilian areas\" in the wake of the huge earthquake in the country.",
        "url": "https://news.sky.com/story/myanmar-earthquake-military-regime-targeting-civilian-areas-with-airstrikes-in-wake-of-disaster-armed-group-says-13338552",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mandalay-myanmar-earthquake_6871561.jpg?20250330181835",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-30 08:19:00",
        "Headline": "The powerful 7.7 magnitude quake struck at around 12.50pm local time (6.20am UK time) near the second-biggest city Mandalay on Friday.",
        "Content": " An armed resistance group in Myanmar has accused the ruling military government of continuing to carry out airstrikes on \"civilian areas\" in the wake of the huge earthquake in the country. The 7.7 magnitude quake struck near the city of Mandalay at around 12.50m local time (6.20am UK time) on Friday while Myanmar is in the grips of a bloody civil war. The death toll from the quake stands at 1,700, with 3,400 others injured and 300 missing, according to pro-military government Telegram channels, citing the country's rulers. But the US Geological Survey's (USGS) predictive modelling estimates that the number of dead will increase into the thousands, and could reach 10,000. It comes as rescue and relief efforts in the country have been hampered by the ongoing civil war, which has raged since 2021.  The Karen National Union (KNU), one of Myanmar's oldest ethnic armies, has said in a statement that the military government, known as a junta, is continuing to \"carry out airstrikes targeting civilian areas\". It said the strikes come \"even as the population suffers tremendously from the earthquake\". The KNU said that under normal circumstances, the military would be prioritising relief efforts after an earthquake, but instead it is focused on \"deploying forces to attack its people\". The Free Burma Rangers, a relief organisation, said military jets launched airstrikes and drone attacks in Karen state, near the KNU headquarters, in the south of the country, shortly after the quake on Friday. It came before there were reports of mortar and drone attacks on Saturday. The junta has not confirmed whether or not it has been carrying out strikes since the disaster. The epicentre of the quake was in an area held by junta forces, but the devastation is widespread and also affected some territory held by armed resistance movements. On Sunday, the opposition National Unity Government, which includes remnants of the government ousted in a 2021 coup, said anti-junta militias under its command would pause all offensive military action for two weeks.  Richard Horsey, the senior Myanmar adviser at Crisis Group, which works to resolve armed conflicts, said some anti-junta forces have halted their offensives, but fighting continues elsewhere. \"The regime also continues to launch airstrikes, including in affected areas. That needs to stop,\" he said. He claimed that the junta was not providing much visible support in quake-hit areas. \"Local fire brigades, ambulance crews, and community organisations have mobilised, but the military - who would normally be mobilised to support in such a crisis - are nowhere to be seen,\" Mr Horsey said. The junta broke its self-imposed isolation to appeal for help from the outside world following the earthquake. However, the country's inaccessibility will likely remain a huge obstacle to aid efforts. Read more:Families of those trapped in rubble face agonising waitWhy Friday's earthquake was so destructiveInside Myanmar - the hidden warQuake is first major disaster to suffer the brunt of Trump cuts  The junta has said the earthquake is one of Myanmar's strongest in a century - while the USGS suggests financial losses due to the disaster could exceed the country's annual economic output. While emergency rescue teams have started trickling into the area hardest hit by the quake, efforts have been hindered by damaged roads, downed bridges, poor communications and the challenges of operating in a country in the middle of a civil war. Many areas still have not been reached. Most rescues occur within the first 24 hours after a disaster, with the chances of survival diminishing as each day passes. Neighbouring Thailand was also shaken, such as in the capital, Bangkok, where 18 people were killed, including 11 who died when an under-construction skyscraper collapsed. At least 76 people are missing and believed to be trapped under the debris. Twelve Chinese nationals are among the injured, according to Chinese state media. An initial report on earthquake relief efforts issued on Saturday by the UN Office for the Coordination of Humanitarian Affairs noted the severe damage or destruction of many health facilities in Myanmar. And it warned that a \"severe shortage of medical supplies is hampering response efforts, including trauma kits, blood bags, anaesthetics, assistive devices, essential medicines, and tents for health workers\". India, China and Thailand are among the neighbours that have sent relief materials and teams, along with aid and personnel. The UK government has announced a package of £10m to support the people of Myanmar in the aftermath of the quake. Four years of civil war Myanmar has been locked in a conflict involving multiple armed opposition groups since a 2021 coup, when the military seized power from the elected government of Nobel Peace Prize laureate Aung San Suu Kyi. Many places are now dangerous or impossible for aid groups to reach. More than three million people have been displaced by the fighting and nearly 20 million are in need, according to the United Nations."
    },
    {
        "title": "Are tariffs the answer to save America's declining aluminium industry?",
        "description": "On the banks of the Ohio River in a rural corner of one of America's poorest states sit two factories, one next to the other.&#160;",
        "url": "https://news.sky.com/story/are-tariffs-the-answer-to-save-americas-declining-aluminium-industry-13338875",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-tariffs_6871513.jpg?20250330173805",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "The aluminium industry is in steep decline in the US. Donald Trump thinks he has the answer, but if his tariff blueprint fails, it will be places like West Virginia that will be hit hardest.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  On the banks of the Ohio River in a rural corner of one of America's poorest states sit two factories, one next to the other.  One is open. The other is shuttered. Both cut to the heart of what Donald Trump hopes he can do to transform America's industrial base. Ravenswood, West Virginia, is a town built on aluminium. Since the 1950s, the wonder-metal has kept this place on the map. Once upon a time, the metal itself was produced here. A massive smelting plant dominated the skyline, and inside, huge furnaces, transforming American aluminium ore (alumina) into the metal we recognise. The newly smelted metal was then sent by river, rail and road to other factories dotted across the country to be cast - turned to sheet and coil for the nation's cars, planes, trucks and so much more. Kaiser Aluminium closed its smelters in 2009. The plant now sits idle. Fencing surrounds it; grass partially obscures the entrance, where hundreds of workers would once have passed. Two hundred metres down the road, there is a different story. \n                  Trump's Scotland course will not host Open Championship because of commercial 'challenges'\n                 \n                  Starmer and Trump discuss 'productive negotiations' towards US-UK 'prosperity' deal\n                 \n                  Trump 'p***ed' off' and 'very angry' with Putin after Zelenskyy comments\n                 Constellium Ravenswood is one of the world's largest factories of its kind. With over a thousand employees it produces plate, sheet and coiled aluminium for numerous industries: aerospace, defence, transportation, marine and more. Its products are custom designed for clients including Boeing, Lockheed Martin and NASA. But here's the problem. The Constellium plant uses aluminium now sourced from abroad. America's primary aluminium production has dropped off a cliff over the past few decades. The Kaiser plant next door which could have provided the metal for its neighbour to process and press was instead the victim of cheap foreign competition and high energy costs. Smelting aluminium requires huge amounts of constant energy. If the smelters are ever turned off, the metal inside will solidify, destroying the facility. In 2023, the annual rate of US primary aluminium production fell 21.4% on the previous year, according to the Aluminium Association. However, the Canadian Aluminium Association projected that their annual production would be up by 6.12% in 2024 compared to the previous year. The story is clear - this industry, like so many in America, is in steep decline. Competition and high production and energy costs are having a huge impact. The danger ahead is that secondary aluminium production in America could go the way of primary production: firms down the supply chain could choose to buy their sheeting and coils from abroad too. The answer, says President Trump, is tariffs. And the chief executive of Constellium agrees with him. \"We believe in free AND fair trade,\" Jean-Marc Germain told Sky News from the company's corporate headquarters in Baltimore. \"And the point is that trade has been free but not fair.\" \"There has been massive growth in the capacity installed in China. Kudos to the Chinese people, that is admirable, but a lot of that has been allowed by illegal subsidies. What it means is that overall, trade of aluminium products is broken as an international system. And I think those tariffs are a way to address some of that very uneven playing field that we are seeing today.\" Mr Germain says the tariff plan will reset the market. He accepts that blanket tariffs are a blunt and risky tool, but cuts out circumvention by one country to another. \"Obviously, this process creates some collateral damage. It is clear that not all countries and not all products are unfairly traded. But because of the sheer size of China and the history of Chinese production making its way through certain countries into the US… a blunt approach is required,\" he says. The White House 25% tariff plan for steel and aluminium is global and causing huge angst. Experts say a long-term domestic rebalance, revitalising the American industrial sector, will take many years and is not guaranteed. But upending the status quo and disrupting established supply chains risks significant short and medium-term disruption, both at source and destination. The foreign aluminium arriving at Ravenswood's Constellium plant to be pressed will now cost 25% more - a hike in price which Mr Germain says his firm can ride out to achieve the longer-term rebalance. \"I'm not going to say that an increase in cost is a good thing for customers. But I think it's important to look at things and put them in proportion…\" he says. Proportion is not a luxury all can afford. 250 miles to the east, in Washington DC and just four miles from the frenetic policy decisions at the White House, the Right Proper Brewing Company is a dream realised for Thor Cheston. Thor shows me around his small warehouse-based business that is clearly thriving. He takes me to the grain silos around the back. The grain is from Canada. Thor relies on an international supply chain - the cans are aluminium and from Canada too. Some of the malt is from Germany and from Britain. It is a complex global web of manufacturing to make American beer. Margins are tight. Read more:What are Donald Trump's tariffs and how does it affect the UK?Starmer: 'Everything is on the table over US tariffs' \"We don't have the luxury of just raising our prices. We're in a competitive landscape,\" Thor says. Competition with big breweries, who can more easily absorb increased costs. The cans will probably go up in price on his next order. He doesn't yet know how much of the 25% will be passed on to him by his supplier. \"We've dealt with major problems like this before. We've had to pivot a lot. We have survived the global pandemic. We've done it before, but we don't want to. We just need a break.\" What about the government's argument to 'buy American'? \"It's not as simple as that,\" Thor says.  Back in West Virginia the mighty Ohio River snakes past the Ravenswood factories. It still carries what's left of America's heavy industry. A vast multi-vessel barge full of coal passed as I chatted to locals in the nearby town of Parkersburg, a pleasant place but not the thriving industrial community it once was. \"We used to have a really nice aluminium plant right down the river here and it shut down,\" one resident reflects in a passing conversation. Here you can see why many rolled the dice for Trump. \"In West Virginia, we're big on coal,\" Sam Cumpstone tells me. He works in the railways to transport coal. The industry went through economic devastation in the late noughties, the closure of hundreds of mines causing huge unemployment. Sam is clear on who he blames: \"Obama shut down mines and made ghost towns in West Virginia. It ruined a lot of people's lives.\" There is recognition here that Trump's sweeping economic plans could cause prices to rise, at least in the short term. But for Trump voter Kathy Marcum, the pain would be worth it. \"He's putting tariffs on other countries that bring their things in, and that way it equals out. It has to be even-stevens as far as I'm concerned… He is a smart businessman. He knows what the hell he's talking about. \"It might be rough for a little while, but in the long run I think it will be best for the country.\" Communities have been let down over generations - either by politicians or by inevitable globalisation. There is still deep scepticism here. \"No politician worth millions or billions of dollars cares about me or you. Nobody,\" Sam tells me at the end of our conversation. The Trump tariff blueprint is full of jeopardy. If it fails, it will be places like West Virginia, that will be hit hardest again."
    },
    {
        "title": "Trump's Scotland course will not host Open Championship because of commercial 'challenges'",
        "description": "Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said.",
        "url": "https://news.sky.com/story/trumps-scotland-course-will-not-host-open-championship-because-of-commercial-challenges-13337390",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-trump-turnberry_6869622.jpg?20250328165449",
        "type": "Home",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "Mark Darbon, chief executive of the R&A, tells Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said. Mark Darbon, chief executive of the R&A, told Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue. Mr Trump has made no secret of his desire to return the Open to a course he bought in 2014, with his son Eric Trump leading efforts for it to stage a first championship since 2009. Sources close to Mr Trump's golf interests have told Sky News the Open would be a valuable bargaining tool in the UK's trade negotiations with the US, and the King went as far as to mention Turnberry in the invitation for a state visit hand delivered by the prime minister last month. In his first broadcast interview since becoming chief executive last November, Mr Darbon said logistics and finances currently rule out a course that may have been outgrown by the demands of a modern Open. \"The area where there's a bit of challenge is around the logistical and commercial side. The last time we were at Turnbury in 2009 we had 120,000 people there,\" he said. \"These days a modern Open caters for 250,000 people-plus, and so we need the road and rail infrastructure to get our fan base there. We need hotel accommodation for the 60,000 bed nights we need to stage our championship and it's challenging at that venue.\" Mr Darbon did not deny there was pressure to consider Turnberry, and indicated that politics, and the prospect of Mr Trump overshadowing any event, would also be a factor. \"We need to be confident that the focus will be on the sport and we need to ensure that the venue works for our requirement,\" he added. Read more: Man charged over vandalism at Trump golf course in Scotland Competition for Turnberry is likely to increase from larger, less remote facilities. The R&A draws Open venues from a rota of courses, with Royal Portrush staging this year's championship following a sellout return after almost 70 years in 2019. Mr Darbon confirmed Portmarnock near Dublin is being actively considered for the first-ever Open outside the UK. Maximising income from the Open matters because the R&A, which governs the game everywhere save the US, uses the revenue to fund a grassroots game still enjoying a post-COVID boom. \"We work with over 140 countries around the world, and in those markets there are now more than 62 million golfers, more than ever before,\" Mr Darbon said. \"Some 40-odd million are playing golf regularly on nine and 18-hole golf courses, another 20 million are playing what we would call non-traditional formats like driving ranges, adventure golf, simulator golf. So the game is actually in rude health and our job is to continue to foster that and support it over time.\" Read more from Sky News:Could the US really become a Commonwealth member?Trump 'p***ed' off' with Putin after Zelenskyy comments He is optimistic too that an end may be in sight for golf's own trade war, between the US PGA Tour and the Saudi Arabian-funded LIV Golf league, a multi-billion dollar schism in the men's professional game that has enriched scores of players while alienating many fans. \"There's been too much talk about cash and not enough talk about competition and courses and all the other wonderful things that underpin our sport. So we're optimistic for some positive change on that front. We're not a negotiating table, but our job is to try and influence those discussions,\" he said. The Open and golf's other major championships, including next month's Masters, have benefitted from the dispute as the only platforms for all of the best male players, and Mr Darbon says the game retains its lucrative appeal to business & sponsors. \"I think golf is maintaining its commercial appeal and I think there are a number of things that support that,\" he said. \"The game has a really rich history and heritage, the values of the sport are really strong, and brands of businesses can continue to tell really rich stories about the game of golf that links to their own products and services. On top of that, golf has a genuinely global audience.\" Among them is the world's most powerful man, his ambitions to host the Open still unfulfilled."
    },
    {
        "title": "At least 91,000 new affordable homes could be built with cladding money, social housing providers say",
        "description": "Social housing providers are warning their ability to build new affordable and social rent homes is plummeting, thanks to the soaring costs of the post-Grenfell Tower cladding crisis.",
        "url": "https://news.sky.com/story/at-least-91000-new-affordable-homes-could-be-built-with-cladding-money-social-housing-providers-say-13337229",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-housing-venables_6869506.jpg?20250328140642",
        "type": "Home",
        "Author": "Rachael Venables",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "The National Audit Office thinks it will have to spend £3.8bn in total to remove non-ACM, combustible cladding on buildings over 11m high. New research suggests that's the cost-equivalent of building 91,000 much-needed new affordable homes.",
        "Content": "\n          News correspondent\n              @rachaelvenables\n Social housing providers are warning their ability to build new affordable and social rent homes is plummeting, thanks to the soaring costs of the post-Grenfell Tower cladding crisis. Some 72 people were killed in the 2017 tragedy, but eight years on, as many as 12,000 buildings are thought to be wrapped in the kinds of flammable materials that led to it. Work hasn't even begun on half of the affected buildings, with an estimated 7,000 at-risk blocks not yet identified by the government. It's thought the bill to remove those products across the country will run to the tens of billions. But Housing Associations - not-for-profit organisations who provide social rented housing - are excluded from most government funding. Instead the money for much of their remediation is coming from social tenants' rent and being diverted from other projects. The National Audit Office thinks it will have to spend £3.8bn in total to remove non-ACM, combustible cladding on buildings over 11m high. New research suggests that's the cost-equivalent of building 91,000 much-needed new affordable homes. \n                  Seven companies named and shamed in Grenfell Inquiry face being placed on blacklist\n                 \n                  Grenfell Tower – what happens now?\n                 \n                  Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision\n                 It's as we're seeing a huge drop in the number of new social rent and affordable homes being built by these providers. Across England, the National Housing Federation (NHF) says affordable housing starts have decreased by 39% to 43,439 - the lowest number since 2016. In London affordable housing starts have collapsed by 90% in the year to March, compared to the year before. The housing association Peabody says they have already spent £300m on cladding remediation, and that bill will keep rising. At one of their sprawling development sites in east London, tower blocks spring from the ground. But only phase one of the 10-year project (905 new homes) is secure. Plans for the other 2,500 flats have been put at risk - precisely because of funds being diverted to building safety. \"If we don't if we don't find a way of funding the future phases, then I'm afraid we would have to stop at the end of phase one,\" their chief executive Ian McDermott said. The numbers are stark: \"Normally we build about 2,000 homes a year. This year we will build fewer than 100 homes. \"It's at a time when one in 21 children in London are living in temporary accommodation, so the need for social housing has never been greater.\" Read more from Sky News:'Disgraceful': Decision to demolish Grenfell Tower attackedBuilding owners could face prison over unsafe cladding The data seems to pour cold water on the government's pledge to build 1.5 million new homes by the end of this parliament. \"The numbers are going in the wrong direction,\" said Rhys Moore, executive director of the NHF. \"I think it is now widely accepted that there is no way to meet the 1.5 million homes target without a significant increase in social and affordable house building.\" Earlier this month, a committee of MPs warned the government hadn't taken the risks seriously enough and called for a formal assessment to be published by the end of the year on the way remediation costs are impacting house building targets. Mr Moore is calling on the government to expand the Building Safety Scheme to include housing associations: \"What we think is indefensible is that some of the poorest families in the country, social tenants, are having to pick up the costs with their rents, to make those buildings safe.\" Giles Grover, from End Our Cladding Scandal, agrees with that call: \"Our campaign position has always been that social housing providers should have full and equal access to the funding.\" But unlike the housing associations and NHF, he's concerned about too much of their focus being on development. Throughout the cladding crisis some housing associations have faced criticism for their handling of building safety issues, particularly with regard to shared owners. Mr Grover said: \"We do need to make sure that social housing providers focus on their core purpose, which is making those homes decent, making those homes safe, and actually treating people like vulnerable, shared owners with a lot more respect.\" If there's a safety issue, he said, \"let shared owners sublet, let them sell - or buy back their flats. Because right now associations are just carrying on, wanting to be tinpot developers\". A Ministry of Housing, Communities & Local Government spokesperson said: \"We are determined to make Britain's homes safer and deliver change for residents who have suffered for too long, and it is right that developers pay their fair share. \"This government will deliver 1.5 million homes as part of our Plan for Change and just this week we committed £2bn to deliver thousands of new social and affordable homes. We continue to work closely with industry so we can deliver on our housing ambitions.\""
    },
    {
        "title": "Starmer and Trump discuss 'productive negotiations' towards US-UK 'prosperity' deal",
        "description": "Sir Keir Starmer and Donald Trump have discussed the \"productive negotiations\" towards a UK-US \"economic prosperity deal\", Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-and-trump-discuss-productive-negotiations-towards-us-uk-trade-deal-downing-street-says-13339017",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-keir-starmer_6841896.jpg?20250228025726",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:48:00",
        "Headline": "The leaders also agreed that the negotiations on an \"economic prosperity deal\" would continue \"at pace\" this week, Downing Street said.",
        "Content": "Sir Keir Starmer and Donald Trump have discussed the \"productive negotiations\" towards a UK-US \"economic prosperity deal\", Downing Street has said. The two leaders discussed a possible deal in a phone call on Sunday and agreed negotiations will \"continue at pace\", according to a statement. A Downing Street spokesperson said: \"The prime minister spoke to President Trump this evening. \"The president opened by wishing His Majesty the King best wishes and good health. \"They discussed the productive negotiations between their respective teams on a UK-US economic prosperity deal, agreeing that these will continue at pace this week. \"Discussing Ukraine, the prime minister updated the president on the productive discussions at the meeting of the Coalition of Willing in Paris this week. The leaders agreed on the need to keep up the collective pressure on Putin. \"They agreed to stay in touch in the coming days.\" Earlier this week, Mr Trump announced a new 25% tariff on all imported cars - threatening UK producers' largest single export market. Signing an executive order on Wednesday, Mr Trump said the tax would kick in on 2 April - what he has called \"liberation day\". British manufacturers such as Jaguar Land Rover, Bentley, Aston Martin and Rolls-Royce stand to be worst affected by the tariffs.  But the UK government has signalled it will not retaliate - mirroring its response to the tariffs on steel and aluminium imposed globally by the Trump administration earlier this month. Tariffs are a key part of Mr Trump's efforts to reshape global trade relations. He plans to impose a swathe of what he calls \"reciprocal\" taxes on \"liberation day\" that would match tariffs and sales taxes levied by other nations. President Trump told reporters on Sunday that the reciprocal tariffs will include all nations that charge fees on US exports. Read more:Trump 'p***ed off' with Putin after Zelenskyy comments How will Trump's economic tariffs affect the UK?Vance hits out at Denmark during Greenland visit The UK hopes an economic deal with the US will spare the country from a broader round of these tariffs. On Friday, Mr Trump said he was open to carving out deals with countries seeking to avoid US tariffs, but those agreements would be negotiated after 2 April. Mr Trump has already placed a 20% tax on all imports from China. He also placed 25% tariffs on Mexico and Canada - before later suspending them on certain goods - with a lower 10% tariff on Canadian energy products in addition to the duties on all steel and aluminium imports, including those from the UK. The two leaders spoke last Sunday in a \"brief call\" about the economic prosperity deal, and again nearly three weeks ago ahead of the US-Ukraine talks in Saudi Arabia. Mr Starmer and Mr Trump appeared to have a warm personal relationship when they met in the Oval Office last month. But just a day later, the US president along with vice president JD Vance delivered a dressing down to Ukrainian president Volodymyr Zelenskyy. That meeting marked a major shift in the US approach to Ukraine, while Mr Starmer cemented his position as a bridge between Europe and Washington in the peace talks by hosting Mr Zelenskyy and other European leaders in London days later. Mr Starmer and Mr Trump also spoke twice before they met in person."
    },
    {
        "title": "At least 91,000 new affordable homes could be built with cladding money, social housing providers say",
        "description": "Social housing providers are warning their ability to build new affordable and social rent homes is plummeting, thanks to the soaring costs of the post-Grenfell Tower cladding crisis.",
        "url": "https://news.sky.com/story/at-least-91000-new-affordable-homes-could-be-built-with-cladding-money-social-housing-providers-say-13337229",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-housing-venables_6869506.jpg?20250328140642",
        "type": "UK",
        "Author": "Rachael Venables",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "The National Audit Office thinks it will have to spend £3.8bn in total to remove non-ACM, combustible cladding on buildings over 11m high. New research suggests that's the cost-equivalent of building 91,000 much-needed new affordable homes.",
        "Content": "\n          News correspondent\n              @rachaelvenables\n Social housing providers are warning their ability to build new affordable and social rent homes is plummeting, thanks to the soaring costs of the post-Grenfell Tower cladding crisis. Some 72 people were killed in the 2017 tragedy, but eight years on, as many as 12,000 buildings are thought to be wrapped in the kinds of flammable materials that led to it. Work hasn't even begun on half of the affected buildings, with an estimated 7,000 at-risk blocks not yet identified by the government. It's thought the bill to remove those products across the country will run to the tens of billions. But Housing Associations - not-for-profit organisations who provide social rented housing - are excluded from most government funding. Instead the money for much of their remediation is coming from social tenants' rent and being diverted from other projects. The National Audit Office thinks it will have to spend £3.8bn in total to remove non-ACM, combustible cladding on buildings over 11m high. New research suggests that's the cost-equivalent of building 91,000 much-needed new affordable homes. \n                  Seven companies named and shamed in Grenfell Inquiry face being placed on blacklist\n                 \n                  Grenfell Tower – what happens now?\n                 \n                  Grenfell Tower fire: Survivor calls on Angela Rayner to reconsider demolition decision\n                 It's as we're seeing a huge drop in the number of new social rent and affordable homes being built by these providers. Across England, the National Housing Federation (NHF) says affordable housing starts have decreased by 39% to 43,439 - the lowest number since 2016. In London affordable housing starts have collapsed by 90% in the year to March, compared to the year before. The housing association Peabody says they have already spent £300m on cladding remediation, and that bill will keep rising. At one of their sprawling development sites in east London, tower blocks spring from the ground. But only phase one of the 10-year project (905 new homes) is secure. Plans for the other 2,500 flats have been put at risk - precisely because of funds being diverted to building safety. \"If we don't if we don't find a way of funding the future phases, then I'm afraid we would have to stop at the end of phase one,\" their chief executive Ian McDermott said. The numbers are stark: \"Normally we build about 2,000 homes a year. This year we will build fewer than 100 homes. \"It's at a time when one in 21 children in London are living in temporary accommodation, so the need for social housing has never been greater.\" Read more from Sky News:'Disgraceful': Decision to demolish Grenfell Tower attackedBuilding owners could face prison over unsafe cladding The data seems to pour cold water on the government's pledge to build 1.5 million new homes by the end of this parliament. \"The numbers are going in the wrong direction,\" said Rhys Moore, executive director of the NHF. \"I think it is now widely accepted that there is no way to meet the 1.5 million homes target without a significant increase in social and affordable house building.\" Earlier this month, a committee of MPs warned the government hadn't taken the risks seriously enough and called for a formal assessment to be published by the end of the year on the way remediation costs are impacting house building targets. Mr Moore is calling on the government to expand the Building Safety Scheme to include housing associations: \"What we think is indefensible is that some of the poorest families in the country, social tenants, are having to pick up the costs with their rents, to make those buildings safe.\" Giles Grover, from End Our Cladding Scandal, agrees with that call: \"Our campaign position has always been that social housing providers should have full and equal access to the funding.\" But unlike the housing associations and NHF, he's concerned about too much of their focus being on development. Throughout the cladding crisis some housing associations have faced criticism for their handling of building safety issues, particularly with regard to shared owners. Mr Grover said: \"We do need to make sure that social housing providers focus on their core purpose, which is making those homes decent, making those homes safe, and actually treating people like vulnerable, shared owners with a lot more respect.\" If there's a safety issue, he said, \"let shared owners sublet, let them sell - or buy back their flats. Because right now associations are just carrying on, wanting to be tinpot developers\". A Ministry of Housing, Communities & Local Government spokesperson said: \"We are determined to make Britain's homes safer and deliver change for residents who have suffered for too long, and it is right that developers pay their fair share. \"This government will deliver 1.5 million homes as part of our Plan for Change and just this week we committed £2bn to deliver thousands of new social and affordable homes. We continue to work closely with industry so we can deliver on our housing ambitions.\""
    },
    {
        "title": "Alexander Sloley: Police offer £10k reward for information about teen who disappeared 17 years ago",
        "description": "Police have issued a &#163;10,000 reward for information about a teenager who disappeared from his home nearly 17 years ago.&#160;",
        "url": "https://news.sky.com/story/alexander-sloley-police-offer-16310k-reward-for-information-about-teen-who-disappeared-17-years-ago-13339010",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-alex-sloley-missing-persons_6871642.jpg?20250330203742",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:34:00",
        "Headline": "Alexander Sloley, an accountancy student, had little money, no wallet and no passport when he went missing in Islington, north London two days before his birthday in August 2008.",
        "Content": "Police have issued a £10,000 reward for information about a teenager who disappeared from his home nearly 17 years ago.  Alexander Sloley, a 16-year-old accountancy student, had little money, no wallet and no passport when he went missing in Islington, north London, two days before his birthday in August, 2008. He had been visiting a friend's home in Edmonton, but had set off home at around midday. His family and friends have not heard from him since, and, despite repeated appeals and enquiries, police have never been able to find him. Mr Sloley had no belongings or spare clothes that would indicate he planned to run away, and his phone, bank account, and National Insurance number have not been used since he went missing. He has also never been spotted on CCTV. In 2009, his case was one of the first to be publicised on nearly 13.5 million milk cartons at supermarket chain Iceland. When he went missing, Mr Sloley was described as a light-skinned black male, 5ft 5ins tall and of medium build, with striking blue eyes. According to the Camden New Journal, in 2012 a police officer said about Mr Sloley's disappearance: \"It's like he disappeared off the face of the planet.\" In 2017, Mick Neville, a retired head of the Metropolitan Police's Central Images Unit, said he believed there was a possible connection between Alex and missing 14-year-old Andrew Gosden. Mr Gosden was last seen in King's Cross Station in London after taking a train from Doncaster, where he lived with his parents and sister. There has been no trace of him since. However, in 2019, detectives said there was no proof that Mr Sloley had been harmed and there was no evidence that it was linked to any other cases. Speaking about the Metropolitan Police's £10,000 reward, detective chief inspector Sarb Kaur, who is leading the investigation into his disappearance, said: \"Alex was reported missing to police on 8 August, 2008. \"Since then, there have been extensive enquiries made by police, but sadly Alex has not yet been found. \"We are now offering a reward of up to £10,000 for anyone who has information relating to Alex's whereabouts. \"This remains an active missing person investigation, subject to regular review by senior officers, with the aim of locating Alex and bringing some comfort to his family. We have recently met with Alex's mother to outline how we intend to progress our investigation to find him. \"I would ask anyone with information who could help to please get in contact immediately, no matter how insignificant you think this could be.\""
    },
    {
        "title": "Charity boss says Prince Harry asked for public message of support for Meghan after polo fundraiser 'went badly'",
        "description": "The chair of a charity set up by Prince Harry says he asked for a public message of support for Meghan after a polo fundraiser \"went badly\".",
        "url": "https://news.sky.com/story/prince-harry-number-one-risk-to-his-own-charity-says-chair-who-accused-him-of-bullying-and-harassment-13338522",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-sophie-meghan_6871302.jpg?20250330140046",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-30 06:28:00",
        "Headline": "In a wide-ranging interview on Sky's Sunday Morning with Trevor Phillips, Sophie Chandauka said the charity lost sponsors and donors when the prince left the UK. A source has denied the claims as \"completely baseless\".",
        "Content": " The chair of a charity set up by Prince Harry says he asked for a public message of support for Meghan after a polo fundraiser \"went badly\". In a wide-ranging interview with Sky News' Trevor Phillips, chair of Sentebale Dr Sophie Chandauka also claimed: • The charity lost sponsors and donors when the Sussexes left the UK - but she wasn't allowed to discuss the problem• Harry is the \"number one risk\" to the charity• He tried to \"eject\" her from the organisation• He would appoint board members without consulting her Sentebale was set up by the prince in 2006 in memory of his mother, Princess Diana, to help young people with HIV in Lesotho and Botswana.  Dr Chandauka has already accused the prince of \"harassment and bullying at scale\" by \"unleashing\" the Sussex PR machine - an allegation a source denied as \"completely baseless\". On Tuesday, Prince Harry quit as patron of the charity along with several other senior members after disagreements with the chair. Polo fundraiser 'went badly' \n                  Will we ever love Meghan?\n                 \n                  With Love, Meghan: Questions remain about how royal couple's new life is working out - and show needs to succeed\n                 \n                  Meghan shares video of Princess Lilibet to mark countdown to Netflix show\n                 In a full interview with Sunday Morning with Trevor Phillips, Dr Chandauka discussed Prince Harry's filming of a Netflix show, which she said resulted in the charity losing the venue for an event they were holding. She said the duke phoned her team, saying he'd like to bring a Netflix crew to the polo event. She said the venue owners were originally \"happy for us to use their polo grounds at a material discount\". But as a result of the request, the price increased as it had become a commercial venture. The charity was forced to pull out of the venue as it couldn't afford the fee, according to Dr Chandauka, but then was \"lucky enough\" to find another through Prince Harry's connections. On the day, however, she claimed there were more problems. \"The duchess decided to attend, but she told us she wasn't attending, and she brought a friend, a very famous friend,\" Dr Chandauka said. \"The choreography went badly on stage because we had too many people on stage. \"The international press captured this, and there was a lot of talk about the duchess and the choreography on stage and whether she should have been there and her treatment of me.\" She claimed the media attention around Meghan's treatment of her prompted Prince Harry to ask Dr Chandauka to issue a statement in support of the duchess. \"I said I wouldn't. Not because I didn't care about the duchess, but because I knew what would happen if I did so, number one. And number two, because we cannot be an extension of the Sussexes,\" she said. A source close to the former trustees of the Sentebale charity described Dr Chandauka's account of the polo match as \"highly misleading\". Sky News also contacted Netflix, who declined to comment. 'Number one risk' Dr Chandauka was asked if the Duke of Sussex is the \"number one risk\" to the charity, and replied \"yes\". She added that when she asked why there was a loss of sponsors at the time the Sussexes left the UK, she was told: \"It's an uncomfortable conversation to have with Prince Harry in the room.\" \"What you discovered was essentially, donors were walking because of the prince's reputation?\" asked Trevor Phillips. \"Yes,\" Dr Chandauka replied.  She also accused the prince of trying to \"eject\" her from the organisation. \"There were board meetings where members of the executive team and external strategic advisors were sending me messages saying, 'Should I interrupt?', 'Should I stop this?' 'Oh my gosh, this is so bad',\" she said. \"In fact, our strategic adviser for fundraising then sent me a message saying she wouldn't want to ever attend any more board meetings or bring her colleagues because of the treatment.\" When she didn't leave, Dr Chandauka suggested Prince Harry tried to force the failure of the charity he set up in his mother's memory. \"Prince Harry started to brief, and his team, sponsors that I had been speaking to, against me and the charity, because that is a sure way of getting me out if it's seen as though I'm not being successful in my fundraising efforts,\" she said.  When asked about a Sky News interview with former trustee Dr Kelello Lerotholi who said he was \"surprised\" by her accusations about the prince, Dr Chandauka said she wasn't \"surprised that he didn't know much of what was going on in the organisation\". \"He had the worst attendance record and even when he was in the meetings, he didn't actually contribute that much,\" she said. 'Everybody's shocked and quiet' Dr Chandauka gave an example of the prince's behaviour in board meetings. \"Prince Harry decides, on this specific occasion, that he wants to appoint an individual to the board, with immediate effect, without having talked to me,\" she said. \"His proxy on the board says, 'Yes, I second that motion'. The third proxy on the board says, 'Welcome to the board, Brian'. \"And everybody's shocked and quiet, but this is what happens when the prince is in the room and no one has the courage to speak.\" Royal correspondent The anger and acrimony is palpable. This is a catastrophic row risking the reputation of Prince Harry's beloved charity. Sentebale is so much more than a cause he supports. It is a deeply personal tribute to the memory of his late mother. When Harry visited Lesotho he came alive, it was like his second home. His passion and connection with the communities was clear. And for years he's helped raise huge funds. But here we are with the charity seemingly imploding, caught up in a bitter and confusing boardroom blame game. Some of the allegations are incredibly serious and relations appear irreparable. Read Laura's analysis in full. Sky News contacted the Duke and Duchess of Sussex about the contents of Sophie Chandauka's interview with Trevor Phillips, and they declined to offer any formal response. But the source close to the former trustees of the Sentebale charity has described as categorically false Dr Chandauka's claims that Dr Lerotholi did not attend meetings and did not contribute much when he was in meetings and that the Duke of Sussex leaving the UK impacted the charity, caused it to lose sponsors, or that the duke posed the biggest risk to the charity. The source also described as \"completely baseless\" Dr Chandauka's claims that she was bullied and harassed, briefed against by Prince Harry, or that the Sussex machine was unleashed on her and that the people on the board of Sentebale were scared to speak up when the duke was in the room. The claim that the press was informed about the royal patrons departure as trustees before the charity, has been described by the source as \"categorically untrue\". In response to Dr Chandauka's claim that the Duke of Sussex was 'forcing the failure' of the charity 'as a last resort', the source pointed to the public statement of Prince Harry and his co-founder of the Sentebale charity, Prince Seeiso of Lesotho, which read: \"It is devastating that the relationship between the charity's trustees and the chair of the board broke down beyond repair, creating an untenable situation. \"These trustees acted in the best interest of the charity in asking the chair to step down, while keeping the wellbeing of staff in mind. In turn, she sued the charity to remain in this voluntary position, further underscoring the broken relationship.\""
    },
    {
        "title": "Driving test waiting times hit record high in Britain",
        "description": "Driving test waiting times in Britain have reached a record high.",
        "url": "https://news.sky.com/story/driving-test-waiting-times-hit-record-high-in-britain-13339059",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-driving-cars_6871730.jpg?20250331002501",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "The average waiting time to book a driving test was 20 weeks in February - up from 14 weeks last year.",
        "Content": "Driving test waiting times in Britain have reached a record high. The average waiting time to book a test was 20 weeks in February, according to figures obtained by the AA Driving School. That's up from 14 weeks last year - as the Department for Transport (DfT) aims to tackle the backlog. The DfT has launched a campaign to recruit and train 450 new driving examiners. And the notice period for making any changes to a booked test slot will be extended from three working days to 10 working days from 8 April. Seven weeks or below is the DVSA's nationwide target for the end of the year, but as of February only 14 centres met that. The number of test centres with a 24-week waiting time nearly doubled from 94 to 183 over the 12-month period. \n                  PM unveils £2bn transport boost to stop North being 'held ransom' by outdated system\n                 \n                  Lower Thames Crossing plan for Kent and Essex approved - 16 years after work on road scheme started\n                 \n                  ULEZ lowers air pollution most in London boroughs that opposed it, data reveals\n                 Emma Bush, managing director of the AA Driving School, said it was \"pleased\" the DVSA had set out its plans to reduce waiting times. \"It is crucial efforts to meet this target are effective and result in this significant reduction,\" she added. \"Bringing down driving test waiting times is vital to ensure a lack of driving licence does not become an ongoing barrier for young people trying to access education and employment.\" Latest statistics from the DfT show the percentage of 17 to 20-year-olds in England with a driving licence fell from 35% in 2019 to 29% in 2023. Read more:Driving test bosses 'bullying examiners to be lenient with learners'Tougher laws on unlicensed drivers to be considered A DVSA spokesperson said waiting times remained high \"due to an increase in demand and low customer confidence in driving test availability\". \"We continue to work on implementing our seven-point plan to reduce waiting times and encouraging learner drivers to only book their driving test when their instructor agrees they are ready.\""
    },
    {
        "title": "Trump's Scotland course will not host Open Championship because of commercial 'challenges'",
        "description": "Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said.",
        "url": "https://news.sky.com/story/trumps-scotland-course-will-not-host-open-championship-because-of-commercial-challenges-13337390",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-trump-turnberry_6869622.jpg?20250328165449",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "Mark Darbon, chief executive of the R&A, tells Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said. Mark Darbon, chief executive of the R&A, told Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue. Mr Trump has made no secret of his desire to return the Open to a course he bought in 2014, with his son Eric Trump leading efforts for it to stage a first championship since 2009. Sources close to Mr Trump's golf interests have told Sky News the Open would be a valuable bargaining tool in the UK's trade negotiations with the US, and the King went as far as to mention Turnberry in the invitation for a state visit hand delivered by the prime minister last month. In his first broadcast interview since becoming chief executive last November, Mr Darbon said logistics and finances currently rule out a course that may have been outgrown by the demands of a modern Open. \"The area where there's a bit of challenge is around the logistical and commercial side. The last time we were at Turnbury in 2009 we had 120,000 people there,\" he said. \"These days a modern Open caters for 250,000 people-plus, and so we need the road and rail infrastructure to get our fan base there. We need hotel accommodation for the 60,000 bed nights we need to stage our championship and it's challenging at that venue.\" Mr Darbon did not deny there was pressure to consider Turnberry, and indicated that politics, and the prospect of Mr Trump overshadowing any event, would also be a factor. \"We need to be confident that the focus will be on the sport and we need to ensure that the venue works for our requirement,\" he added. Read more: Man charged over vandalism at Trump golf course in Scotland Competition for Turnberry is likely to increase from larger, less remote facilities. The R&A draws Open venues from a rota of courses, with Royal Portrush staging this year's championship following a sellout return after almost 70 years in 2019. Mr Darbon confirmed Portmarnock near Dublin is being actively considered for the first-ever Open outside the UK. Maximising income from the Open matters because the R&A, which governs the game everywhere save the US, uses the revenue to fund a grassroots game still enjoying a post-COVID boom. \"We work with over 140 countries around the world, and in those markets there are now more than 62 million golfers, more than ever before,\" Mr Darbon said. \"Some 40-odd million are playing golf regularly on nine and 18-hole golf courses, another 20 million are playing what we would call non-traditional formats like driving ranges, adventure golf, simulator golf. So the game is actually in rude health and our job is to continue to foster that and support it over time.\" Read more from Sky News:Could the US really become a Commonwealth member?Trump 'p***ed' off' with Putin after Zelenskyy comments He is optimistic too that an end may be in sight for golf's own trade war, between the US PGA Tour and the Saudi Arabian-funded LIV Golf league, a multi-billion dollar schism in the men's professional game that has enriched scores of players while alienating many fans. \"There's been too much talk about cash and not enough talk about competition and courses and all the other wonderful things that underpin our sport. So we're optimistic for some positive change on that front. We're not a negotiating table, but our job is to try and influence those discussions,\" he said. The Open and golf's other major championships, including next month's Masters, have benefitted from the dispute as the only platforms for all of the best male players, and Mr Darbon says the game retains its lucrative appeal to business & sponsors. \"I think golf is maintaining its commercial appeal and I think there are a number of things that support that,\" he said. \"The game has a really rich history and heritage, the values of the sport are really strong, and brands of businesses can continue to tell really rich stories about the game of golf that links to their own products and services. On top of that, golf has a genuinely global audience.\" Among them is the world's most powerful man, his ambitions to host the Open still unfulfilled."
    },
    {
        "title": "Blackwall Tunnel charges to start and Silvertown tunnel to open - what you need to know",
        "description": "From next week, drivers using London's Blackwall Tunnel will have to pay a toll.",
        "url": "https://news.sky.com/story/blackwall-tunnel-charges-to-start-and-silvertown-tunnel-to-open-everything-you-need-to-know-13328434",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-blackwall-tunnel-london_6856336.jpg?20250314154200",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "From 7 April drivers using the Blackwall Tunnel and the new Silvertown Tunnel will have to pay a toll. Here is everything you need to know.",
        "Content": "From next week, drivers using London's Blackwall Tunnel will have to pay a toll. The charge is being implemented the same day the new Silvertown Tunnel - which will link east London to southeast London - also opens to drivers. For car drivers, a return journey at peak times will cost £8, jumping up to £13 for large vans. Here is everything you need to know about the new tunnel, the tolls and the decision behind its implementation. What is the Silvertown Tunnel? The 1.4km (just under one mile) long tunnel stretches from Silvertown in Newham, east London, to the Greenwich Peninsula in southeast London. It will run adjacent to the Victorian-era Blackwall Tunnel which takes drivers near The O2 Arena under the River Thames to the East India Dock Road (A13) in Blackwall. The project, which has cost £2.2bn, was approved by London Mayor Saqid Khan, having been first proposed back in 2012. It is being funded through private finance and Transport for London (TfL) will pay back £100m a year through money made on the toll. Why was it built? The new tunnel aims to reduce congestion that currently builds up on the approach to the Blackwall Tunnel. Transport for London claims the Silvertown Tunnel will save commuters up to 20 minutes. The government body says the Blackwall Tunnel was never designed to carry the levels of traffic it currently does, leading to more frequent incidents that cause traffic to tailback for miles and negatively impacting air quality. As well as private vehicles, around 21 buses will travel through the new tunnel every hour from 7am until 7pm Monday to Friday, which TfL has said will help to offer new routes for more people. A dedicated bike bus shuttle service will also transport cyclists and their bikes across the river. How much will it cost and how do you pay? After 7 April charges will apply to both the Silvertown and Blackwall tunnels. How much you are charged depends on what you drive and at what time. Peak hours through the northbound tunnel will run from 6am to 10am Monday to Friday. For the southbound tunnel peak hours are 4pm until 7pm Monday to Friday. All other times will be classed as off-peak, including weekends. Both tunnels will be open 24 hours a day, seven days a week. The toll has to be paid by phone or online. The TfL website states the easiest way to pay is to use Auto Pay, which allows people to link their payment cards to an account that will automatically take payment. Once the tunnel opens, local residents will be able to use cross-river bus routes for free for a year. Residents who are on certain benefits and live in local boroughs will also be eligible for a 50% discount. Why is it so controversial? Ever since the Silvertown Tunnel was given the green light, it has been met with criticism from opposition parties and campaign groups. The Liberal Democrats have argued against the project from the start, claiming Mr Khan hasn't listened to environmental concerns. It believes more roads will lead to more people using them, creating bottlenecks through areas including Greenwich, Blackheath and Eltham. Read more from Sky News:£10k reward for details about boy who disappeared 17 years agoGig economy bosses could face jail time if checks missed Rob Blackie, who was the Lib Dem's candidate for Mayor of London, has previously said: \"The way to cut pollution and climate change is to encourage people to walk, bicycle and use public transport. \"This multi-billion pound project, the Silvertown Tunnel, does exactly the opposite!\" Campaign group Stop Silvertown Tunnel Coalition argues the opening of the tunnel will actually increase congestion and emissions and impose a toll on Londoners to compensate for construction costs. TfL maintains the project will \"help to reduce congestion at the Blackwall Tunnel, deliver faster journeys during peak times, help manage overall air quality and allow for better cross-river public transport\"."
    },
    {
        "title": "Catastrophic row risks Harry's deeply personal tribute to Princess Diana",
        "description": "The anger and acrimony is palpable.",
        "url": "https://news.sky.com/story/catastrophic-row-risks-harrys-deeply-personal-tribute-to-princess-diana-13338673",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-harry-lesotho_6871257.jpg?20250330132839",
        "type": "UK",
        "Author": "Laura Bundock",
        "Date Published": "2025-03-30 12:08:00",
        "Headline": "The Sentebale charity is one of the pieces of Prince Harry's former life that he kept - his dramatic departure from the charity will have been a difficult decision. But you have to ask, how has it got to this?",
        "Content": "\n          Royal correspondent\n              @laurabundock\n  The anger and acrimony is palpable. This is a catastrophic row risking the reputation of Prince Harry's beloved charity. Sentebale is so much more than a cause he supports. It is a deeply personal tribute to the memory of his late mother. Read more: Charity boss says Harry asked for public message of support for Meghan When Harry visited Lesotho he came alive, it was like his second home. His passion and connection with the communities was clear. And for years he's helped raise huge funds. But here we are with the charity seemingly imploding, caught up in a bitter and confusing boardroom blame game. Read more: Prince Harry accused of 'harassment and bullying at scale' by Sentebale chair \n                  Charity boss says Prince Harry asked for public message of support for Meghan after polo fundraiser 'went badly'\n                 \n                  Prince Harry accused of 'harassment and bullying at scale' by Sentebale chair Sophie Chandauka\n                 \n                  Misconduct claims at charity set up by Prince Harry 'a surprise', says Sentebale trustee\n                 Some of the allegations are incredibly serious and relations appear irreparable. What's worse is that all this is being played out so publicly. Prince Harry's hatred of the press is well-documented, but these are headlines that will hurt. Since he stepped back from his royal role and responsibilities, Harry left a lot behind. Sentebale is one of the pieces of his past he's kept. His dramatic departure from the charity will have been a difficult decision.  But you have to ask, how has it got to this? Prince Harry, stepping away from the charity he loved so much. And a chair, who is a much-respected, experienced international lawyer, calling him out.  While those at the top are in turmoil, the charity's name is being torn apart. It might not be on the brink of collapse, but this is deeply damaging for the charity. Damaging too for Prince Harry, facing uncomfortable questions about his conduct and behaviour. Read more from Sky News:Police criticised after raid on Quaker meeting houseIrish politicians roundly reject McGregor's presidential bidMorning-after pill set to be made free from pharmacies Sky News contacted the Duke and Duchess of Sussex about the contents of Sophie Chandauka's interview with Trevor Phillips, and they declined to offer any formal response. But a source close to the former trustees of the Sentebale charity has described as \"completely baseless\" Dr Chandauka's claims that she was bullied and harassed, briefed against by Prince Harry, or that the Sussex machine was unleashed on her and that the people on the board of Sentebale were scared to speak up when the duke was in the room. In response to Dr Chandauka's claim that the Duke of Sussex was 'forcing the failure' of the charity 'as a last resort', the source pointed to the public statement of Prince Harry and his co-founder of the Sentebale charity, Prince Seeiso of Lesotho, which read: \"It is devastating that the relationship between the charity's trustees and the chair of the board broke down beyond repair, creating an untenable situation. \"These trustees acted in the best interest of the charity in asking the chair to step down, while keeping the wellbeing of staff in mind. In turn, she sued the charity to remain in this voluntary position, further underscoring the broken relationship.\""
    },
    {
        "title": "'Two-tier justice' row: Government plans to change law to overrule Sentencing Council",
        "description": "The government plans to change the law so it can overrule Sentencing Council guidelines following a row over \"two-tier justice\", Sky News understands.",
        "url": "https://news.sky.com/story/two-tier-justice-row-government-could-change-law-on-monday-to-overrule-sentencing-council-13338782",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-shabana-mahmood-justice_6756107.jpg?20250306031400",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-30 14:21:00",
        "Headline": "The Sentencing Council changed guidance to judges and magistrates to advise they get a pre-sentence report for criminals from an ethnic, cultural or faith minority.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The government plans to change the law so it can overrule Sentencing Council guidelines following a row over \"two-tier justice\", Sky News understands. The independent Sentencing Council, which sets out sentencing guidance to courts in England and Wales, has been at odds with Justice Secretary Shabana Mahmood for weeks after it updated its guidance. It said that from April, a pre-sentence report, the results of which are taken into account when considering a criminal's sentence, will \"usually be necessary\" before handing out punishment for someone from an ethnic, cultural or faith minority, alongside other groups such as young adults aged 18 to 25, women and pregnant women. Conservative shadow justice minister Robert Jenrick called the guidance \"two-tier justice\" and said there was \"blatant bias\" against Christians and straight white men, as he said it would make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\". Ms Mahmood had called on the Sentencing Council to reverse the guidance, but it refused, which Sir Keir Starmer said he was \"disappointed\" with, and the justice secretary called \"unacceptable\". Before the weekend, Sir Keir said \"all options are on the table\" over how the government might respond. But sources have now told Sky News the Ministry of Justice plans to legislate at the \"earliest opportunity\" to be able to overrule sentencing guidelines. Ministers could introduce the legislation as early as Monday so they can \"push it through parliament\", so the current guidelines can be changed quickly. Until the law is changed so the government can dismiss the Sentencing Council guidelines, the body can plough ahead with the changes as it is independent of the state. Read more:Sentencing Council rejects minister's call for guidance rethinkWhat are pre-sentence reports and why the controversy?  In reply to Ms Mahmood's letter calling for a reversal, the Sentencing Council's chair, Lord Justice William Davis, said on Friday that the reforms reflect evidence of disparities in sentencing outcomes, disadvantages faced within the criminal justice system and complexities in the circumstances of individual offenders. He said pre-sentence reports allow judges to be \"better equipped\" to \"avoid a difference in outcome based on ethnicity\". \"The cohort of ethnic, cultural and faith minority groups may be a cohort about which judges and magistrates are less well informed,\" he added. Sky News has contacted the Sentencing Council for a comment on the potential law changes."
    },
    {
        "title": "Northamptonshire: Police to take no further action against man arrested after fatal house fire",
        "description": "Police say they have released a man arrested on suspicion of murder following the deaths of three people, including a four-year-old girl, in a fire in Northamptonshire on Friday.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-murder-after-three-die-in-rushton-station-house-fire-13338776",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rushton-fire_6870687.jpg?20250329175231",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-30 14:14:00",
        "Headline": "A 30-year-old woman, a 23-year-old man, and a four-year-old girl died after a blaze at a former station house in Rushton, near Kettering, on Friday night, Northamptonshire Police said.",
        "Content": "Police say they have released a man arrested on suspicion of murder following the deaths of three people, including a four-year-old girl, in a fire in Northamptonshire on Friday. Police said they would take no further action against the 54-year-old, who was arrested on suspicion of murder on Saturday, and said that the fire was not believed to have been caused by a criminal act. The man is now being supported by specialist officers, Northamptonshire Police said in a statement. It comes after a 30-year-old woman and a 23-year-old man died alongside the four-year-old girl after a blaze at a former station house in the village of Rushton, near Kettering, on Friday night. Detective chief inspector Ruby Burrow, of the East Midlands Special Operations Unit, said in a statement: \"It is only right that an incident such as this is treated with the utmost seriousness, to make sure we have done all we can to understand what has happened for the sake of those who have died and their loved ones. \"In some cases, this requires arrests to be made in order to best secure potential evidence. \"Our team has been working at pace on this investigation and after rigorous examination of the available information, we do not believe there is any evidence of criminal wrongdoing at this point. \"As a result, the arrested man has been released without charge and will now be supported by specialist officers as he continues to assist the investigation team. \"The families involved have been kept updated on this development and I would repeat our request for their privacy to be respected at this incredibly distressing time.\" The victims' next of kin have been informed and are being supported by specially trained officers. Formal identification has yet to take place because of the complexities of the scene, Northamptonshire Police said on Sunday. After the fire, one person was taken to hospital by the East Midlands Ambulance Service, and three officers were assessed because of smoke inhalation, Northamptonshire Police said. Photographs show a large hole burned through the roof of the building - a 19th-century former station master's house at the now-closed Glendon and Rushton railway station. It is a Grade II-listed building, according to the Historic England website, and is now believed to be a residential property. Train services between London St Pancras International and Corby, Derby, Nottingham and Sheffield were disrupted on Saturday after the fire. The disruption was due to damage caused to a railway line, according to the National Rail website."
    },
    {
        "title": "Myanmar earthquake: Military regime targeting 'civilian areas' with airstrikes in wake of disaster, armed group claims",
        "description": "An armed resistance group in Myanmar has accused the ruling military government of continuing to carry out airstrikes on \"civilian areas\" in the wake of the huge earthquake in the country.",
        "url": "https://news.sky.com/story/myanmar-earthquake-military-regime-targeting-civilian-areas-with-airstrikes-in-wake-of-disaster-armed-group-says-13338552",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mandalay-myanmar-earthquake_6871561.jpg?20250330181835",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-30 08:19:00",
        "Headline": "The powerful 7.7 magnitude quake struck at around 12.50pm local time (6.20am UK time) near the second-biggest city Mandalay on Friday.",
        "Content": " An armed resistance group in Myanmar has accused the ruling military government of continuing to carry out airstrikes on \"civilian areas\" in the wake of the huge earthquake in the country. The 7.7 magnitude quake struck near the city of Mandalay at around 12.50m local time (6.20am UK time) on Friday while Myanmar is in the grips of a bloody civil war. The death toll from the quake stands at 1,700, with 3,400 others injured and 300 missing, according to pro-military government Telegram channels, citing the country's rulers. But the US Geological Survey's (USGS) predictive modelling estimates that the number of dead will increase into the thousands, and could reach 10,000. It comes as rescue and relief efforts in the country have been hampered by the ongoing civil war, which has raged since 2021.  The Karen National Union (KNU), one of Myanmar's oldest ethnic armies, has said in a statement that the military government, known as a junta, is continuing to \"carry out airstrikes targeting civilian areas\". It said the strikes come \"even as the population suffers tremendously from the earthquake\". The KNU said that under normal circumstances, the military would be prioritising relief efforts after an earthquake, but instead it is focused on \"deploying forces to attack its people\". The Free Burma Rangers, a relief organisation, said military jets launched airstrikes and drone attacks in Karen state, near the KNU headquarters, in the south of the country, shortly after the quake on Friday. It came before there were reports of mortar and drone attacks on Saturday. The junta has not confirmed whether or not it has been carrying out strikes since the disaster. The epicentre of the quake was in an area held by junta forces, but the devastation is widespread and also affected some territory held by armed resistance movements. On Sunday, the opposition National Unity Government, which includes remnants of the government ousted in a 2021 coup, said anti-junta militias under its command would pause all offensive military action for two weeks.  Richard Horsey, the senior Myanmar adviser at Crisis Group, which works to resolve armed conflicts, said some anti-junta forces have halted their offensives, but fighting continues elsewhere. \"The regime also continues to launch airstrikes, including in affected areas. That needs to stop,\" he said. He claimed that the junta was not providing much visible support in quake-hit areas. \"Local fire brigades, ambulance crews, and community organisations have mobilised, but the military - who would normally be mobilised to support in such a crisis - are nowhere to be seen,\" Mr Horsey said. The junta broke its self-imposed isolation to appeal for help from the outside world following the earthquake. However, the country's inaccessibility will likely remain a huge obstacle to aid efforts. Read more:Families of those trapped in rubble face agonising waitWhy Friday's earthquake was so destructiveInside Myanmar - the hidden warQuake is first major disaster to suffer the brunt of Trump cuts  The junta has said the earthquake is one of Myanmar's strongest in a century - while the USGS suggests financial losses due to the disaster could exceed the country's annual economic output. While emergency rescue teams have started trickling into the area hardest hit by the quake, efforts have been hindered by damaged roads, downed bridges, poor communications and the challenges of operating in a country in the middle of a civil war. Many areas still have not been reached. Most rescues occur within the first 24 hours after a disaster, with the chances of survival diminishing as each day passes. Neighbouring Thailand was also shaken, such as in the capital, Bangkok, where 18 people were killed, including 11 who died when an under-construction skyscraper collapsed. At least 76 people are missing and believed to be trapped under the debris. Twelve Chinese nationals are among the injured, according to Chinese state media. An initial report on earthquake relief efforts issued on Saturday by the UN Office for the Coordination of Humanitarian Affairs noted the severe damage or destruction of many health facilities in Myanmar. And it warned that a \"severe shortage of medical supplies is hampering response efforts, including trauma kits, blood bags, anaesthetics, assistive devices, essential medicines, and tents for health workers\". India, China and Thailand are among the neighbours that have sent relief materials and teams, along with aid and personnel. The UK government has announced a package of £10m to support the people of Myanmar in the aftermath of the quake. Four years of civil war Myanmar has been locked in a conflict involving multiple armed opposition groups since a 2021 coup, when the military seized power from the elected government of Nobel Peace Prize laureate Aung San Suu Kyi. Many places are now dangerous or impossible for aid groups to reach. More than three million people have been displaced by the fighting and nearly 20 million are in need, according to the United Nations."
    },
    {
        "title": "Trump 'p***ed' off' and 'very angry' with Putin after Zelenskyy comments",
        "description": "Donald Trump has said he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's President Volodymyr Zelenskyy, in a phone call with Sky News' US partner network, NBC News.",
        "url": "https://news.sky.com/story/no-one-will-be-fired-over-signal-chat-group-blunder-says-president-trump-13338576",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-vladimir-putin_6860593.jpg?20250318202423",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-30 09:24:00",
        "Headline": "In a phone call with Sky's US partner network, NBC News, Mr Trump said the Russian president's recent comments, calling for a transitional government to be put in place in Ukraine, were \"not going in the right direction\".",
        "Content": "Donald Trump has said he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's President Volodymyr Zelenskyy, in a phone call with Sky News' US partner network, NBC News. Mr Trump said the Russian president's recent comments, calling for a transitional government to be put in place in Ukraine in a move that could effectively push out Mr Zelenskyy, were \"not going in the right direction\". He told NBC's Kirsten Welker: \"If I feel we're in the midst of a negotiation, you could say that I was very angry, pissed off, when Putin said yesterday that - you know, when Putin started getting into Zelenskyy's credibility, because that's not going in the right direction.\" It is a rare move by Mr Trump to criticise Mr Putin, whom he has generally spoken positively about during discussions to end the war in Ukraine. Last month, he also released a barrage of critical comments about Mr Zelenskyy's leadership, calling him a \"dictator\" and making unfounded claims that he had \"poor approval\" ratings in Ukraine. The president added that if Russia is unable to make a deal on \"stopping bloodshed in Ukraine\" - and Mr Trump felt that Moscow was to blame - then he would put secondary tariffs on \"all oil coming out of Russia\". \"That would be that if you buy oil from Russia, you can't do business in the United States. There will be a 25% tariff on all oil, a 25 to 50-point tariff on all oil,\" he said. US correspondent Industrial language from the US president.  \"Very angry\" and \"p***ed off\" he said he was with Vladimir Putin. What's upsetting him is an intervention by the Russian leader at the end of last week. Mr Putin questioned Volodymyr Zelenskyy's legitimacy - he said a peace agreement brokered by the Ukrainian president could be challenged by future governments.  Donald Trump didn't like that and doesn't see that as productive in terms of progress towards peace.  A rare rebuke from Mr Trump for Mr Putin on the face of it, the like of which we have not heard from the president for a while. Remember that Mr Trump himself has undermined the credibility of Mr Zelenskyy in the past, so clearly Trump is in the middle of a two-way negotiation. This has the sound, at least, of an even-handedness, that for most outside Moscow has been lacking on the part of the US president up until now. Mr Trump said Mr Putin knows he is angry, but added that he has \"a very good relationship with him\" and \"the anger dissipates quickly... if he does the right thing\". He said he plans to speak with the Russian president again this week. In the wide-ranging interview with NBC, Mr Trump also discussed:• The possibility of seeking a third term in office;• Imposing secondary tariffs on Iran;• Not ruling out military rule to annex Greenland;• Confirmed no one will be fired over Signal group chat blunder. 👉 Follow Trump 100 on your podcast app 👈 'Not joking' about seeking a third term When asked if he will seek to stay in the White House for a third term, which is prohibited by the Constitution under the 22nd Amendment, Mr Trump told NBC: \"A lot of people want me to do it.\" He added: \"I basically tell them we have a long way to go, you know, it's very early in the administration. I'm focused on the current.\" The president said he liked working, and would be interested in staying in the role for another four years after his second term comes to an end in 2028. \"I'm not joking,\" he said, when asked to clarify. \"But I'm not - it is far too early to think about it.\" Mr Trump said one method in which a third term could be possible is by Vice President JD Vance running for office and then handing the responsibility over to him. He refused to share details on other methods he claims exist. Threatening Iran with bombing and tariffs Mr Trump said if Tehran did not make a deal with the US to ensure it did not develop a nuclear weapon, there could be bombing and secondary tariffs. The tariffs would affect buyers of the country's goods. It comes after he signed an executive order last week authorising such tariffs on buyers of Venezuelan oil. Iranian President Masoud Pezeshkian said on Sunday that Iran had rejected direct negotiations with the US, but left open the possibility of indirect negotiations with Washington.  No one will be fired over Signal group chat blunder Addressing the national security blunder, which saw a journalist mistakenly added to a Signal chat group discussing planned strikes on Yemen, Mr Trump confirmed no one will be fired. It was revealed this week that national security adviser Michael Waltz accidentally added The Atlantic's editor-in-chief Jeffrey Goldberg to a group chat with senior members of the Trump administration who were discussing plans to strike Houthi militants earlier this month. Read more from Sky News:Could the US really become a Commonwealth member?JD Vance felt the cold in Greenland - and it wasn't just the weather The president said he doesn't fire people \"because of fake news and because of witch hunts\", adding that he still had confidence in Mr Waltz and defence secretary Pete Hegseth, who was also in the Signal chat. Military option to annex Greenland not off the table Mr Trump also discussed his commitment to annexing Greenland - a semi-autonomous territory which is part of the Kingdom of Denmark - and said that using military force was \"not off the table\".  \"We'll get Greenland. Yeah, 100%,\" the president said. He added: \"[There's a] good possibility that we could do it without military force. [But] I don't take anything off the table.\" Greenland Prime Minister Jens-Frederik Nielsen responded to Mr Trump's comments by reiterating that the US will not take control of the Arctic territory, and that it \"controls its own future\"."
    },
    {
        "title": "'Not a hope in hell': Irish politicians roundly reject Conor McGregor's presidential bid",
        "description": "Not one of 134 Irish politicians who replied to a Sky News survey would support Conor McGregor's ambition to become the country's president.",
        "url": "https://news.sky.com/story/not-a-hope-in-hell-irish-politicians-roundly-reject-conor-mcgregors-presidential-bid-13337260",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-conor-mcgregor-white-house_6860642.jpg?20250318162358",
        "type": "World",
        "Author": "Stephen Murphy",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "Responses ranged from \"not a hope in hell\" to \"I could not think of anyone more unfit\" and \"I would genuinely rather we didn't have a president at all\".",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n  Not one of 134 Irish politicians who replied to a Sky News survey would support Conor McGregor's ambition to become the country's president. Comments ranged from \"not a hope in hell\" to \"I could not think of anyone more unfit\" and \"I would genuinely rather we didn't have a president at all\". The former MMA champion, who is appealing a civil case in which a jury found that he raped a woman, needs significant backing before he would be allowed to stand.  McGregor used a St Patrick's Day meeting with Donald Trump in the Oval Office to further his aim to run in the election, which must be held by November. Days later he formally announced on social media he would seek election and stand on an anti-immigration platform. Candidates must garner the support of 20 Oireachtas (parliament) members, or the backing of four of Ireland's local authorities in order to stand. There are 234 Oireachtas members: 174 TDs or members of the lower house, the Dail, and 60 senators. Sky News asked each one if they would give McGregor a nomination. A total of 104 TDs and 30 senators replied. Every one of the 134 politicians said they would not support McGregor running. None chose the \"maybe\" option. Read more: Why McGregor has 'close to zero chance' of becoming Ireland's next president  \"I consider him to be a tacky, moronic vulgarian. I would never consider him even remotely a suitable person for a nomination.\" - Senator \"He's a misogynist and a thug. On behalf of the women of Ireland he can f*** off.\" - TD \"McGregor has become the cheerleader for misogyny in Ireland… a populist buffoon.\" - Senator \"I genuinely would struggle to think of anyone worse to hold that position.\" - Garret Ahearn, Fine Gael senator \"I could not think of anyone more unfit for public office.\" - Duncan Smith, Labour TD \"There is no evidence Mr McGregor has the necessary skillset for the role.\" - Malcolm Byrne, Fianna Fail TD \"There isn't a snowball's chance… he made a show of himself in Washington DC last week and with no elected mandate he certainly does not \"speak for Irish people\" when he travels overseas.\" - Cathal Crowe, Fianna Fail TD \"Conor McGregor's divisive behaviour and rhetoric would be completely unsuitable for such a role.\" - Maeve O'Connell, Fine Gael TD \"As a mother of four young boys I have far more ambition for them than to have someone like that in a position of respectability.\" - Erin McGreehan, Fianna Fail TD Sky News has approached McGregor's representative for comment on our findings. None has yet been received. If McGregor chooses to pursue the council route to a nomination, he may not find it much easier, according to Gary Murphy, professor of politics at Dublin City University. \"The difficulty there is they are also dominated by the political parties. And so I think he would find this extremely difficult to actually get on the ballot. \"Now there is a big independent vote in Ireland, and maybe McGregor is targeting that, but the problem with that independent vote here in Ireland is that it's very left wing and he's not.\" Ireland correspondent This is not an exhaustive or a very scientific poll, and several strong-willed independent politicians declined to give a view, despite repeated emails, calls and WhatsApps. So it is still possible Conor McGregor could pick up a few nominations from the Oireachtas… should he ask. But the 134-strong No camp – combined with the scathing replies we received – paints a picture of the strength of opposition to McGregor running. That is of course, assuming he actually wants to be president. There are many who don't believe he does.  Pretty much anyone can run in Irish general elections, and we had one of those a few short months ago. McGregor was nowhere to be seen. But every time he posts about his political ambitions, he is lauded as the \"Irish Trump\" by a mostly American fanbase. It could be a strategy to further burnish his reputation and brand in America, rather than a sincere desire to embrace a restrictive seven-year stint of often symbolic public service back home. McGregor is currently appealing the result of a civil case in which a Dublin jury found he had raped a woman, Nikita Hand, in 2018 and ordered him to pay her damages. He also faces a civil case in Florida, where a woman claims he sexually assaulted her at a basketball game in Miami in 2023. His legal team says the allegation is \"false\"."
    },
    {
        "title": "Two women killed and two children injured in County Cork crash",
        "description": "Two women have been killed and two children injured in a crash in Ireland.",
        "url": "https://news.sky.com/story/two-women-killed-and-two-children-injured-in-county-cork-crash-13339054",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-county-cork-ireland_6871727.png?20250330232548",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-30 21:57:00",
        "Headline": "A woman in her 60s and another woman in her 40s died at the scene.",
        "Content": "Two women have been killed and two children injured in a crash in Ireland. The two-car crash happened on the N72 at Navigation Road in Mallow, County Cork, at around 3.30pm on Sunday. A woman in her 60s and another woman in her 40s, the drivers of the cars, died at the scene. A boy and a girl, who were passengers in the car driven by the woman in her 40s, were taken to Cork University Hospital. The children's injuries are not believed to be life-threatening, Gardai say. A post-mortem of the two women is due to be carried out at the hospital mortuary. Read more from Sky News:Trump 'p***** off' and 'very angry' with PutinCouple arrested over school WhatsApps \n                  Conor McGregor says he wants to be Ireland's next president\n                 \n                  Why Conor McGregor has 'close to zero chance' of becoming Ireland's next president\n                 \n                  Kate, Princess of Wales enjoys Guinness at St Patrick's Day event - and buys round of drinks for troops\n                 Local diversions remain in place after the road was closed pending examination by forensic investigators. Officers are appealing for witnesses to the incident and anyone with footage to get in touch."
    },
    {
        "title": "First orbital rocket launched from Europe crashes into sea - but company says test 'met all expectations'",
        "description": "The first orbital rocket launched from mainland Europe took off from Norway on Sunday - but crashed into the sea and exploded 40 seconds later.",
        "url": "https://news.sky.com/story/first-orbital-rocket-launched-from-europe-crashes-into-sea-but-company-says-test-met-all-expectations-13338992",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rocket-europe-norway_6871641.jpg?20250330203622",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:04:00",
        "Headline": "Isar Aerospace, the German company that built the rocket, had warned that the launch could end prematurely, and maintained that the flight had produced extensive data that its team can learn from.",
        "Content": " The first orbital rocket launched from mainland Europe took off from Norway on Sunday - but crashed into the sea and exploded 40 seconds later. The unmanned Spectrum rocket blasted off from the Arctic Andoeya Spaceport, on Sunday at 12.30pm local time before it was terminated less than a minute later. Isar Aerospace, the German company that built the rocket, had warned that the launch could end prematurely. It maintained that despite being short, the flight had produced extensive data that its team could learn from. \"Our first test flight met all our expectations, achieving a great success,\" Daniel Metzler, Isar's chief executive and co-founder, said. \"We had a clean lift-off, 30 seconds of flight and even got to validate our flight termination system.\" Spectrum is a two-stage launch vehicle specifically designed to put small and medium satellites into orbit. Its maiden voyage was aimed at kickstarting satellite launches from Europe. Several European nations, including the UK and Sweden, have said they want to be an active player in the growing market of commercial space missions. Big global companies already ahead in the satellite launch game include Elon Musk's SpaceX, which launches from the US, and French company ArianeGroup, a joint venture between Airbus and Safran that uses a spaceport in South America's French Guiana. Mr Musk's SpaceX also operates the Starlink satellite service, a communications network that can provide much of the globe with access to the internet. Germany's BDLI aerospace industries association said Isar's first flight would lead to further progress. BDLI managing director, Marie-Christine von Hahn, said: \"Europe urgently needs to ensure its sovereignty in space. Elon Musk's Starlink is not without alternatives - nor should it be.\" Read more from Sky News:Should daylight savings be scrapped?New AI test set to transform diagnosis of lung condition Sweden, with its Esrange launch site, and Britain with its SaxaVord Spaceport in the Scottish Shetland Islands, are the nearest rivals to the Norwegian site, all of which aim to give Europe greater autonomy in space flights. SaxaVord, which suffered a setback when a rocket engine exploded during a test last year, is planning its first satellite launch later this year."
    },
    {
        "title": "Trump 100 Day 70: Q&A - Executive orders, election stealing, and you're fired!",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-70-qa-executive-orders-election-stealing-and-youre-fired-13337658",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-trump-100_6869518.jpg?20250328141734",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On Day 70, US correspondents James Matthews and Martha Kelner answer your questions.  They discuss the executive orders being challenged in court, Martha's interaction with congresswoman Marjorie Taylor Greene, and is President Donald Trump running the country like he's still on The Apprentice? If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk. Help us understand more about our listeners by taking our survey! 👉 This form 👈 should only take a few minutes to complete, and Sky anonymises the responses as much as possible. Thank you. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Are tariffs the answer to save America's declining aluminium industry?",
        "description": "On the banks of the Ohio River in a rural corner of one of America's poorest states sit two factories, one next to the other.&#160;",
        "url": "https://news.sky.com/story/are-tariffs-the-answer-to-save-americas-declining-aluminium-industry-13338875",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-tariffs_6871513.jpg?20250330173805",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "The aluminium industry is in steep decline in the US. Donald Trump thinks he has the answer, but if his tariff blueprint fails, it will be places like West Virginia that will be hit hardest.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  On the banks of the Ohio River in a rural corner of one of America's poorest states sit two factories, one next to the other.  One is open. The other is shuttered. Both cut to the heart of what Donald Trump hopes he can do to transform America's industrial base. Ravenswood, West Virginia, is a town built on aluminium. Since the 1950s, the wonder-metal has kept this place on the map. Once upon a time, the metal itself was produced here. A massive smelting plant dominated the skyline, and inside, huge furnaces, transforming American aluminium ore (alumina) into the metal we recognise. The newly smelted metal was then sent by river, rail and road to other factories dotted across the country to be cast - turned to sheet and coil for the nation's cars, planes, trucks and so much more. Kaiser Aluminium closed its smelters in 2009. The plant now sits idle. Fencing surrounds it; grass partially obscures the entrance, where hundreds of workers would once have passed. Two hundred metres down the road, there is a different story. \n                  Trump's Scotland course will not host Open Championship because of commercial 'challenges'\n                 \n                  Starmer and Trump discuss 'productive negotiations' towards US-UK 'prosperity' deal\n                 \n                  Trump 'p***ed' off' and 'very angry' with Putin after Zelenskyy comments\n                 Constellium Ravenswood is one of the world's largest factories of its kind. With over a thousand employees it produces plate, sheet and coiled aluminium for numerous industries: aerospace, defence, transportation, marine and more. Its products are custom designed for clients including Boeing, Lockheed Martin and NASA. But here's the problem. The Constellium plant uses aluminium now sourced from abroad. America's primary aluminium production has dropped off a cliff over the past few decades. The Kaiser plant next door which could have provided the metal for its neighbour to process and press was instead the victim of cheap foreign competition and high energy costs. Smelting aluminium requires huge amounts of constant energy. If the smelters are ever turned off, the metal inside will solidify, destroying the facility. In 2023, the annual rate of US primary aluminium production fell 21.4% on the previous year, according to the Aluminium Association. However, the Canadian Aluminium Association projected that their annual production would be up by 6.12% in 2024 compared to the previous year. The story is clear - this industry, like so many in America, is in steep decline. Competition and high production and energy costs are having a huge impact. The danger ahead is that secondary aluminium production in America could go the way of primary production: firms down the supply chain could choose to buy their sheeting and coils from abroad too. The answer, says President Trump, is tariffs. And the chief executive of Constellium agrees with him. \"We believe in free AND fair trade,\" Jean-Marc Germain told Sky News from the company's corporate headquarters in Baltimore. \"And the point is that trade has been free but not fair.\" \"There has been massive growth in the capacity installed in China. Kudos to the Chinese people, that is admirable, but a lot of that has been allowed by illegal subsidies. What it means is that overall, trade of aluminium products is broken as an international system. And I think those tariffs are a way to address some of that very uneven playing field that we are seeing today.\" Mr Germain says the tariff plan will reset the market. He accepts that blanket tariffs are a blunt and risky tool, but cuts out circumvention by one country to another. \"Obviously, this process creates some collateral damage. It is clear that not all countries and not all products are unfairly traded. But because of the sheer size of China and the history of Chinese production making its way through certain countries into the US… a blunt approach is required,\" he says. The White House 25% tariff plan for steel and aluminium is global and causing huge angst. Experts say a long-term domestic rebalance, revitalising the American industrial sector, will take many years and is not guaranteed. But upending the status quo and disrupting established supply chains risks significant short and medium-term disruption, both at source and destination. The foreign aluminium arriving at Ravenswood's Constellium plant to be pressed will now cost 25% more - a hike in price which Mr Germain says his firm can ride out to achieve the longer-term rebalance. \"I'm not going to say that an increase in cost is a good thing for customers. But I think it's important to look at things and put them in proportion…\" he says. Proportion is not a luxury all can afford. 250 miles to the east, in Washington DC and just four miles from the frenetic policy decisions at the White House, the Right Proper Brewing Company is a dream realised for Thor Cheston. Thor shows me around his small warehouse-based business that is clearly thriving. He takes me to the grain silos around the back. The grain is from Canada. Thor relies on an international supply chain - the cans are aluminium and from Canada too. Some of the malt is from Germany and from Britain. It is a complex global web of manufacturing to make American beer. Margins are tight. Read more:What are Donald Trump's tariffs and how does it affect the UK?Starmer: 'Everything is on the table over US tariffs' \"We don't have the luxury of just raising our prices. We're in a competitive landscape,\" Thor says. Competition with big breweries, who can more easily absorb increased costs. The cans will probably go up in price on his next order. He doesn't yet know how much of the 25% will be passed on to him by his supplier. \"We've dealt with major problems like this before. We've had to pivot a lot. We have survived the global pandemic. We've done it before, but we don't want to. We just need a break.\" What about the government's argument to 'buy American'? \"It's not as simple as that,\" Thor says.  Back in West Virginia the mighty Ohio River snakes past the Ravenswood factories. It still carries what's left of America's heavy industry. A vast multi-vessel barge full of coal passed as I chatted to locals in the nearby town of Parkersburg, a pleasant place but not the thriving industrial community it once was. \"We used to have a really nice aluminium plant right down the river here and it shut down,\" one resident reflects in a passing conversation. Here you can see why many rolled the dice for Trump. \"In West Virginia, we're big on coal,\" Sam Cumpstone tells me. He works in the railways to transport coal. The industry went through economic devastation in the late noughties, the closure of hundreds of mines causing huge unemployment. Sam is clear on who he blames: \"Obama shut down mines and made ghost towns in West Virginia. It ruined a lot of people's lives.\" There is recognition here that Trump's sweeping economic plans could cause prices to rise, at least in the short term. But for Trump voter Kathy Marcum, the pain would be worth it. \"He's putting tariffs on other countries that bring their things in, and that way it equals out. It has to be even-stevens as far as I'm concerned… He is a smart businessman. He knows what the hell he's talking about. \"It might be rough for a little while, but in the long run I think it will be best for the country.\" Communities have been let down over generations - either by politicians or by inevitable globalisation. There is still deep scepticism here. \"No politician worth millions or billions of dollars cares about me or you. Nobody,\" Sam tells me at the end of our conversation. The Trump tariff blueprint is full of jeopardy. If it fails, it will be places like West Virginia, that will be hit hardest again."
    },
    {
        "title": "Trump 'p***ed' off' and 'very angry' with Putin after Zelenskyy comments",
        "description": "Donald Trump has said he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's President Volodymyr Zelenskyy, in a phone call with Sky News' US partner network, NBC News.",
        "url": "https://news.sky.com/story/no-one-will-be-fired-over-signal-chat-group-blunder-says-president-trump-13338576",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-vladimir-putin_6860593.jpg?20250318202423",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-30 09:24:00",
        "Headline": "In a phone call with Sky's US partner network, NBC News, Mr Trump said the Russian president's recent comments, calling for a transitional government to be put in place in Ukraine, were \"not going in the right direction\".",
        "Content": "Donald Trump has said he was \"very angry\" and \"pissed off\" after Vladimir Putin criticised the credibility of Ukraine's President Volodymyr Zelenskyy, in a phone call with Sky News' US partner network, NBC News. Mr Trump said the Russian president's recent comments, calling for a transitional government to be put in place in Ukraine in a move that could effectively push out Mr Zelenskyy, were \"not going in the right direction\". He told NBC's Kirsten Welker: \"If I feel we're in the midst of a negotiation, you could say that I was very angry, pissed off, when Putin said yesterday that - you know, when Putin started getting into Zelenskyy's credibility, because that's not going in the right direction.\" It is a rare move by Mr Trump to criticise Mr Putin, whom he has generally spoken positively about during discussions to end the war in Ukraine. Last month, he also released a barrage of critical comments about Mr Zelenskyy's leadership, calling him a \"dictator\" and making unfounded claims that he had \"poor approval\" ratings in Ukraine. The president added that if Russia is unable to make a deal on \"stopping bloodshed in Ukraine\" - and Mr Trump felt that Moscow was to blame - then he would put secondary tariffs on \"all oil coming out of Russia\". \"That would be that if you buy oil from Russia, you can't do business in the United States. There will be a 25% tariff on all oil, a 25 to 50-point tariff on all oil,\" he said. US correspondent Industrial language from the US president.  \"Very angry\" and \"p***ed off\" he said he was with Vladimir Putin. What's upsetting him is an intervention by the Russian leader at the end of last week. Mr Putin questioned Volodymyr Zelenskyy's legitimacy - he said a peace agreement brokered by the Ukrainian president could be challenged by future governments.  Donald Trump didn't like that and doesn't see that as productive in terms of progress towards peace.  A rare rebuke from Mr Trump for Mr Putin on the face of it, the like of which we have not heard from the president for a while. Remember that Mr Trump himself has undermined the credibility of Mr Zelenskyy in the past, so clearly Trump is in the middle of a two-way negotiation. This has the sound, at least, of an even-handedness, that for most outside Moscow has been lacking on the part of the US president up until now. Mr Trump said Mr Putin knows he is angry, but added that he has \"a very good relationship with him\" and \"the anger dissipates quickly... if he does the right thing\". He said he plans to speak with the Russian president again this week. In the wide-ranging interview with NBC, Mr Trump also discussed:• The possibility of seeking a third term in office;• Imposing secondary tariffs on Iran;• Not ruling out military rule to annex Greenland;• Confirmed no one will be fired over Signal group chat blunder. 👉 Follow Trump 100 on your podcast app 👈 'Not joking' about seeking a third term When asked if he will seek to stay in the White House for a third term, which is prohibited by the Constitution under the 22nd Amendment, Mr Trump told NBC: \"A lot of people want me to do it.\" He added: \"I basically tell them we have a long way to go, you know, it's very early in the administration. I'm focused on the current.\" The president said he liked working, and would be interested in staying in the role for another four years after his second term comes to an end in 2028. \"I'm not joking,\" he said, when asked to clarify. \"But I'm not - it is far too early to think about it.\" Mr Trump said one method in which a third term could be possible is by Vice President JD Vance running for office and then handing the responsibility over to him. He refused to share details on other methods he claims exist. Threatening Iran with bombing and tariffs Mr Trump said if Tehran did not make a deal with the US to ensure it did not develop a nuclear weapon, there could be bombing and secondary tariffs. The tariffs would affect buyers of the country's goods. It comes after he signed an executive order last week authorising such tariffs on buyers of Venezuelan oil. Iranian President Masoud Pezeshkian said on Sunday that Iran had rejected direct negotiations with the US, but left open the possibility of indirect negotiations with Washington.  No one will be fired over Signal group chat blunder Addressing the national security blunder, which saw a journalist mistakenly added to a Signal chat group discussing planned strikes on Yemen, Mr Trump confirmed no one will be fired. It was revealed this week that national security adviser Michael Waltz accidentally added The Atlantic's editor-in-chief Jeffrey Goldberg to a group chat with senior members of the Trump administration who were discussing plans to strike Houthi militants earlier this month. Read more from Sky News:Could the US really become a Commonwealth member?JD Vance felt the cold in Greenland - and it wasn't just the weather The president said he doesn't fire people \"because of fake news and because of witch hunts\", adding that he still had confidence in Mr Waltz and defence secretary Pete Hegseth, who was also in the Signal chat. Military option to annex Greenland not off the table Mr Trump also discussed his commitment to annexing Greenland - a semi-autonomous territory which is part of the Kingdom of Denmark - and said that using military force was \"not off the table\".  \"We'll get Greenland. Yeah, 100%,\" the president said. He added: \"[There's a] good possibility that we could do it without military force. [But] I don't take anything off the table.\" Greenland Prime Minister Jens-Frederik Nielsen responded to Mr Trump's comments by reiterating that the US will not take control of the Arctic territory, and that it \"controls its own future\"."
    },
    {
        "title": "Greenland's new PM shares defiant message after Trump claims US will take control of the island",
        "description": "The new prime minister of Greenland has pushed back against claims from Donald Trump that the US will take control of the island.",
        "url": "https://news.sky.com/story/greenlands-new-pm-shares-defiant-message-after-trump-claims-us-will-take-control-of-the-island-13339002",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-jens-frederik-nielsen_6871659.jpg?20250330205138",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:24:00",
        "Headline": "Jens-Frederik Nielsen has told Greenlanders they decide their \"own future\" after the US president didn't rule out using military force to annex the island, which is an autonomous territory of the Kingdom of Denmark.",
        "Content": "The new prime minister of Greenland has pushed back against claims from Donald Trump that the US will take control of the island. Jens-Frederik Nielsen also urged Greenlanders to \"calmly show the American president\" that the island \"is ours\" after Mr Trump didn't rule out using military force to capture the territory. In a Facebook post shared two days after becoming prime minister, Mr Nielsen wrote: \"We must listen when others talk about us. But we must not be shaken. \"President Trump says the United States is 'getting Greenland'. Let me make this clear: The US is not getting that. \"We don't belong to anyone else. We decide our own future.\" Mr Nielsen also told islanders \"they must not act out of fear\" and must respond to Mr Trump's remarks with \"peace, dignity and unity\". He continued: \"And it is through these values that we must clearly, clearly and calmly show the American president that Greenland is ours. \"It was like that yesterday. That's how it is today. And that's how it will be in the future.\" Greenland, a huge, resource-rich island, is a self-governing territory of Denmark - a NATO ally of the US.  Mr Trump has said he wants to annex the territory, claiming the US needs it for national security purposes. Meanwhile, a White House official has said Greenland's supply of rare earth minerals would power the next generation of the US economy. On Saturday, the US president told Sky News' US partner network NBC News that military force was not off the table with regards to acquiring Greenland. In Saturday's interview, Mr Trump said: \"I think there's a good possibility that we could do it without military force. \"This is world peace, this is international security.\" He added: \"I don't take anything off the table.\" Jens-Frederik Nielsen, a 33-year-old former minister of industry and minerals, was sworn in as the youngest ever prime minister of Greenland on Friday. In his first press conference as prime minister in his hometown Nuuk, he called for political unity to combat external pressures. \n His message was clear: \"At a time when we as a people are under pressure, we must stand together.\" Nielsen's economic vision for Greenland is ambitious. He aims to shift the focus from discussions about Denmark's block grant - a little less than $1bn each year that keeps the economy afloat - to business development and the creation of a self-sustaining economy. His ultimate goal is for Greenland, a semi-autonomous Danish territory, to achieve independence through economic self-reliance. As well as his life in politics, Mr Nielsen, sworn in just hours before a high-profile US delegation arrived on the island, is best known as a sportsman and hunter. Born and raised in Greenland, Mr Nielsen poses with reindeer he has shot on Facebook posts and has several national badminton championships under his belt. Greenland's residents and politicians have reacted with anger to his repeated suggestions, with Danish leaders also criticising them. Mr Trump said \"I don't care\" when asked in the NBC interview what message the annexation of Greenland would send to Russian President Vladimir Putin, who has invaded Ukraine and captured several of its provinces in defiance of international law. Read more from Sky News:Trump 'p***ed off' with PutinCould US become Commonwealth member?Who is MAGA's most aggressive loyalist?  Mr Nielsen's remarks come days after US Vice President JD Vance visited Greenland with his wife Usha and senior US officials. Mr Vance visited an American military base on the island and claimed Denmark has \"not done a good job\" in relation to the territory. He said: \"Our message to Denmark is very simple: you have not done a good job by the people of Greenland. \"You have underinvested in the people of Greenland, and you have underinvested in the security architecture of this incredible, beautiful landmass filled with incredible people.\""
    },
    {
        "title": "Trump's Scotland course will not host Open Championship because of commercial 'challenges'",
        "description": "Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said.",
        "url": "https://news.sky.com/story/trumps-scotland-course-will-not-host-open-championship-because-of-commercial-challenges-13337390",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-trump-turnberry_6869622.jpg?20250328165449",
        "type": "US",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "Mark Darbon, chief executive of the R&A, tells Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said. Mark Darbon, chief executive of the R&A, told Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue. Mr Trump has made no secret of his desire to return the Open to a course he bought in 2014, with his son Eric Trump leading efforts for it to stage a first championship since 2009. Sources close to Mr Trump's golf interests have told Sky News the Open would be a valuable bargaining tool in the UK's trade negotiations with the US, and the King went as far as to mention Turnberry in the invitation for a state visit hand delivered by the prime minister last month. In his first broadcast interview since becoming chief executive last November, Mr Darbon said logistics and finances currently rule out a course that may have been outgrown by the demands of a modern Open. \"The area where there's a bit of challenge is around the logistical and commercial side. The last time we were at Turnbury in 2009 we had 120,000 people there,\" he said. \"These days a modern Open caters for 250,000 people-plus, and so we need the road and rail infrastructure to get our fan base there. We need hotel accommodation for the 60,000 bed nights we need to stage our championship and it's challenging at that venue.\" Mr Darbon did not deny there was pressure to consider Turnberry, and indicated that politics, and the prospect of Mr Trump overshadowing any event, would also be a factor. \"We need to be confident that the focus will be on the sport and we need to ensure that the venue works for our requirement,\" he added. Read more: Man charged over vandalism at Trump golf course in Scotland Competition for Turnberry is likely to increase from larger, less remote facilities. The R&A draws Open venues from a rota of courses, with Royal Portrush staging this year's championship following a sellout return after almost 70 years in 2019. Mr Darbon confirmed Portmarnock near Dublin is being actively considered for the first-ever Open outside the UK. Maximising income from the Open matters because the R&A, which governs the game everywhere save the US, uses the revenue to fund a grassroots game still enjoying a post-COVID boom. \"We work with over 140 countries around the world, and in those markets there are now more than 62 million golfers, more than ever before,\" Mr Darbon said. \"Some 40-odd million are playing golf regularly on nine and 18-hole golf courses, another 20 million are playing what we would call non-traditional formats like driving ranges, adventure golf, simulator golf. So the game is actually in rude health and our job is to continue to foster that and support it over time.\" Read more from Sky News:Could the US really become a Commonwealth member?Trump 'p***ed' off' with Putin after Zelenskyy comments He is optimistic too that an end may be in sight for golf's own trade war, between the US PGA Tour and the Saudi Arabian-funded LIV Golf league, a multi-billion dollar schism in the men's professional game that has enriched scores of players while alienating many fans. \"There's been too much talk about cash and not enough talk about competition and courses and all the other wonderful things that underpin our sport. So we're optimistic for some positive change on that front. We're not a negotiating table, but our job is to try and influence those discussions,\" he said. The Open and golf's other major championships, including next month's Masters, have benefitted from the dispute as the only platforms for all of the best male players, and Mr Darbon says the game retains its lucrative appeal to business & sponsors. \"I think golf is maintaining its commercial appeal and I think there are a number of things that support that,\" he said. \"The game has a really rich history and heritage, the values of the sport are really strong, and brands of businesses can continue to tell really rich stories about the game of golf that links to their own products and services. On top of that, golf has a genuinely global audience.\" Among them is the world's most powerful man, his ambitions to host the Open still unfulfilled."
    },
    {
        "title": "Make America a Commonwealth member? Trump would see himself as equal to the King",
        "description": "Donald Trump wants to redraw the political map of the world. His vision seems to be that smaller countries - such as perhaps Greenland, Ukraine and Taiwan - should fall under the sway of their local big power as the US, Russia and China expand their regional zones of influence.",
        "url": "https://news.sky.com/story/make-america-a-commonwealth-member-trump-would-see-himself-as-equal-to-the-king-13337188",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-the-king-donald-trump_6869732.png?20250328185425",
        "type": "US",
        "Author": "Adam Boulton",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "There are astonishing reports that the King might invite the US to become an associate member of the Commonwealth - but it is not up to the King or the UK government. Still, stranger things have happened - and will happen again now Donald Trump is back in the White House.",
        "Content": "\n          Sky News commentator\n              @adamboultonTABB\n Donald Trump wants to redraw the political map of the world. His vision seems to be that smaller countries - such as perhaps Greenland, Ukraine and Taiwan - should fall under the sway of their local big power as the US, Russia and China expand their regional zones of influence. There is a vicious logic to this new world order if one excludes the principles of democracy, independence, co-existence, borders and basic rights for all nations, regardless of size. It simply asserts that might is right. Mr Trump believes the US is the mightiest country and he is set on Making America Great Again at home and abroad. Sucking up to the presidency This is a grim prospect for a middle-sized post-imperial power like the United Kingdom. The leaders of Labour, the Conservatives, and Reform UK have chosen not to go public with any private misgivings they may have about the Trump administration's intentions. They have all concluded that sucking up is the best way to handle the new presidency. This explains the astonishing reports that the King might invite the United States to become an associate member of the Commonwealth when Mr Trump visits him in Scotland later this year to plan his second state visit to this country. Mr Trump has already welcomed the news about joining up with the Commonwealth. \"I love King Charles. Sounds good to me!\" he posted on his Truth Social platform. There has been no official invitation to the president. \"Associate\" membership of the organisation does not exist. New members require the agreement of all 56 existing member countries. It is not up to the King, who is nominal head of the Commonwealth, or even the British government. And it is not called \"the British\" Commonwealth anymore. \n                  King Charles attends first Commonwealth Day service since cancer diagnosis\n                 \n                  King shares playlist for Commonwealth Day radio show - and reveals the Kylie Minogue song that brings him joy\n                 \n                  Kemi Badenoch would likely be 'deeply sceptical' of dropping 'empire' from British honours\n                 Still, stranger things have happened - will happen again now Mr Trump is back in the White House. 👉 Follow Trump 100 on your podcast app 👈 The first approach may merely be an invitation to become an associate of the Royal Commonwealth Society (RCS), which describes itself as \"a network of individuals and organisations committed to improving the lives and prospects of Commonwealth citizens across the world\". The RCS has already offered that to Mr Trump in 2017 shortly after his first election. Nigel Farage delivered the letter in person. Like most clubs the RCS is hungry to expand and has also put out feelers to Ireland and Nordic countries. Neither Mr Trump nor the British government would leave it at this trivial level. He is a great disrupter always on the lookout for the upside in any deal and with a record of turning some ideas which seemed laughable into reality.  Starmer government has overlooked everything The prime minister laid it on thick in the Oval Office with the \"unprecedented\", \"historic\" second state visit invitation. Most US presidents, including those who have been conspicuous friends of this country, never get one. The Starmer government has decided not to criticise the Trump administration. They have overlooked everything from claiming Canada as the 51st state to top officials breaching security on a Signal phone group in which they expressed \"hate\" for \"PATHETIC\" European \"freeloaders\". In direct contrast to their Americanophilia, ministers are reluctant to discuss closer ties with Europeans. It would be entirely consistent with this government's sycophancy to try to engineer a further inducement to the US in the form of closer involvement in the Commonwealth, a last vestige of UK soft power. Trump as the King's successor? Mr Trump would see any deal as a takeover in which he was the equal to the King, and his probable successor as head of the Commonwealth. He would be likely to try to remake the organisation with a so-called \"White Commonwealth\" dominating the other members. That would go down well with his ethno-nationalist supporters back home. It is already the vision of one British champion of US participation. \"Commonwealth union - not least a CANZUK union between Australia, Canada, New Zealand and the UK - really should be a cross-party no-brainer for the British. What exactly does the UK have to lose?\" asks the political commentator Jonathan Saxty in The Daily Express. This nation's integrity would be at stake. Only a truly \"perfidious Albion\" would let Mr Trump into the Commonwealth in the hope of buying his favour.  The King would not be happy The King, who has done his best to indicate support for his realm of Canada against Mr Trump's threats, would not be happy. The legs would still be knocked out from under Canada's resistance. All Commonwealth members would face the option of going it alone outside the alliance or bowing to Mr Trump. The US would meanwhile try to exploit old British ties to counter China's growing influence in Africa and Asia. There are already some in the UK ready to throw in their lot with the US. But not all of the coalition which elected Mr Trump agrees with his imperialistic expansionism. America First isolationists tore into him after his \"sounds good\" comment, on his own Truth Social network. One wrote: \"HELL NO !!! We left UK & kicked their asses once, NEVER going back. Personally I don't associate with TYRANTS. All of their 'commonwealth' can F off, eh !!! SCUMBAGS !!!\" Another posted: \"No! King Charles has been amongst the top players of WEF, for years. He's a globalist. Americans do not want to join their Commonwealth. The U.K. allowed itself to fall to muslim invaders & Charles has 'secret offer' for you? Hard no from ALL of your supporters!\" Alex Jones of the conspiracy website Infowars warned: \"If you really try to make America join the British Commonwealth, 1776 will commence again!\" adding, \"I love Trump overall… but sometimes he does just the most terrible things.\" No sign Trump's fanbase is deserting him Terrible or not, there is no sign this fanbase is deserting the president. As their Signal chat showed his closest aides embrace his simplistic, extractive, what's the \"economic upside\" for us approach to foreign relations. The British government should think very carefully about what they are prepared to offer up voluntarily to a rapacious American bully in this global geopolitical struggle."
    },
    {
        "title": "Trump 100 Day 70: Q&A - Executive orders, election stealing, and you're fired!",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/trump-100-day-70-qa-executive-orders-election-stealing-and-youre-fired-13337658",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trump-trump-100_6869518.jpg?20250328141734",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈   On Day 70, US correspondents James Matthews and Martha Kelner answer your questions.  They discuss the executive orders being challenged in court, Martha's interaction with congresswoman Marjorie Taylor Greene, and is President Donald Trump running the country like he's still on The Apprentice? If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk. Help us understand more about our listeners by taking our survey! 👉 This form 👈 should only take a few minutes to complete, and Sky anonymises the responses as much as possible. Thank you. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "Dr Kildare and Shogun actor Richard Chamberlain dies ",
        "description": "Richard Chamberlain, who starred in the TV medical drama \"Dr Kildare\" and the 1980s mini-series \"Shogun\", has died at the age of 90, his publicist said.",
        "url": "https://news.sky.com/story/dr-kildare-and-shogun-actor-richard-chamberlain-dies-13338744",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-richard-chamberlain_6871318.jpg?20250330144113",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-30 13:37:00",
        "Headline": "Most of Chamberlain's roles were as romantic leading men, which is why he did not publicly reveal he was gay until he was 68 years old.",
        "Content": "Richard Chamberlain, who starred in the TV medical drama \"Dr Kildare\" and the 1980s mini-series \"Shogun\", has died at the age of 90, his publicist said. Chamberlain became a heartthrob as the handsome Dr James Kildare in the medical drama that ran from 1961 to 1966. Photoplay magazine named him \"most popular male star\" three years in a row from 1963 to 1965. His breakout role in Dr Kildare marked the start of a six-decade career that spanned theatre, films and television. The California-born actor was dubbed the \"king of the mini-series\" after appearing in several TV dramas in the 1980s. This included being the original Jason Bourne in the 1988 mini-series The Bourne Identity. Chamberlain was nominated for Emmys for his roles in two mini-series - Shogun (1981) and The Thorn Birds (1983). He was also nominated for Emmys for his roles in the 1985 movie \"Wallenberg: A Hero's Story\" and the title role in the 1975 movie \"The Count of Monte-Cristo\". He also earned plaudits for his appearances on stage - including Professor Henry Higgins in \"My Fair Lady\", Captain von Trapp in \"The Sound of Music\" and Shakespeare's Hamlet and Richard II. Most of his roles were as romantic leading men, which is why he did not publicly reveal he was gay until he was 68 years old. He feared it would ruin his career, and so for much of his life, he said he pretended to be someone else. \"When you grow up in the '30s, '40s and '50s being gay, it's not only ain't easy, it's just impossible,\" he told the New YorkTimes in 2014. \"I assumed there was something terribly wrong with me. And even becoming famous and all that, it was still there.\" Chamberlain said it was a huge relief after he acknowledged his sexuality in his 2003 autobiography \"Shattered Love: A Memoir\". He said in a 2019 interview: \"I had no fear left... It was a wonderful experience. People were open, friendly and sweet.\" After coming out publicly, he played both gay and straight characters in TV shows including \"Brothers & Sisters,\" \"Will & Grace\" and \"Desperate Housewives.\" Born George Richard Chamberlain on 31 March 1934, he was the youngest of two sons. He had hoped to be an artist but switched to acting after attending Pomona College in California. His acting career was put on hold when he was drafted into the US Army in 1956 and served in Korea. Read more from Sky News:Trump 'p***ed off' with PutinPolice raid Quaker meeting houseThe Who singer says he's going blind In the late 1960s, Chamberlain moved to England, where he honed his acting skills in the BBC series \"The Portrait of a Lady\" and as Hamlet at the Birmingham Repertory Theatre. \"Dr Kildare was a huge hit in England, and I heard that all the London reviewers were coming to rip this interloper topieces,\" he said in an interview. \"But we got very good reviews.\" Chamberlain lived in Hawaii for many years and had a three-decade relationship with actor and writer Martin Rabbett, his co-star in the 1986 adventure film \"Allan Quatermain and the Lost City of Gold\". The couple parted in 2010 but remained close friends. \"He is free and soaring to those loved ones before us. How blessed were we to have known such an amazing and loving soul,\" Rabbett said in a statement after Chamberlain's death. Chamberlain's publicist said the star died from complications from a stroke in Hawaii on Saturday."
    },
    {
        "title": "Harrods revises compensation payouts for al Fayed abuse victims",
        "description": "Harrods has revised the terms of a compensation scheme to be offered to hundreds of sexual abuse victims of the department store&#8217;s former owner, Mohamed al Fayed, ahead of its formal launch this week.",
        "url": "https://news.sky.com/story/harrods-revises-compensation-payouts-for-al-fayed-abuse-victims-13338577",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mohamed-al-fayed-harrods_6863855.jpg?20250322073310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-30 09:26:00",
        "Headline": "The Qatar-owned department store has increased maximum payments to survivors of Mohamed al Fayed’s sexual abuse to closer to £400,000 under a redress scheme to be launched on Monday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods has revised the terms of a compensation scheme to be offered to hundreds of sexual abuse victims of the department store’s former owner, Mohamed al Fayed, ahead of its formal launch this week. Sky News has learnt that lawyers for Harrods have increased the maximum potential payout for survivors of Mr al Fayed from roughly £330,000 to a sum closer to £400,000, following consultation with claimants' legal representatives. Sources said final proposals for the compensation scheme would be published on Monday - although some victims may still face a lengthy wait to receive their payouts. Harrods, which is owned by a Qatari sovereign wealth fund controlled by the Gulf state's ruling family, said last year that it was \"utterly appalled\" by the disclosure that Mr al Fayed had sexually abused numerous female employees during his 25-year ownership of the Knightsbridge store.  People close to the talks about the compensation scheme said the final proposals included general damages lump sums of up to £110,000 or £200,000 - with the higher figure available to claimants willing to submit to psychiatric assessments arranged by the company. These figures are unchanged from draft proposals which were subject to consultation in recent weeks, although other elements of the proposed compensation payments have been revised upwards, with the effect of increasing the potential maximum sums that could be paid out, the people added. The redress scheme is being coordinated by MPL Legal, an Essex-based law firm. \n                  Harrods proposes six-figure payouts to victims of al Fayed abuse\n                 \n                  Former Harrods employee accuses Mohamed al Fayed and his brother Salah of assaulting her in 1990s\n                 \n                  Investigation into Met Police's handling of some Mohamed al Fayed allegations\n                 Last weekend, Sky News reported the contents of a document produced by MPL Legal which said that victims of Mr al Fayed who chose a \"non-medical pathway\" - which would not require any form of medical assessment - would be eligible for \"general damages limited to compensation for sexual assault of up to £110,000\", with \"aggravated damages [of] up to £15,000\", and \"wrongful testing fixed payment(s) up to £7,500\".  Claimants who agreed to an assessment by a scheme consultant psychiatrist - referred to in the document as the \"medical pathway\" - would be eligible for general damages of up to £200,000, further payments equivalent to those potentially awarded to non-medical claimants, as well as treatment costs \"past and future supported by the medical report\" and a \"work impact payment capped at £110,000\". The \"wrongful testing\" payments refer to women who were forced to undergo unnecessary and intrusive medical examinations demanded by Mr al Fayed, while the \"work impact payments\" relate to loss of earnings triggered by, for example, the unjustified termination of victims' employment at Harrods. One source said the revised maximum compensation sum to be disclosed on Monday was now expected to be between £350,000 and £400,000. The requirement to undergo a psychiatric assessment by a medical practitioner selected by Harrods in order to access the largest payouts risks angering claimants who have endured years of psychological trauma after being abused by Mr al Fayed.  A person close to the store said this was a necessary legal step. External law firms which have been organising separate cases against Harrods are likely to argue that the terms being published on Monday are not sufficiently generous, and impose too many legal restrictions and disclosure obligations on victims of the store's former owner. Depending upon how many women submit compensation claims either through the MPL Legal scheme or via another law firm, Harrods' compensation bill is ultimately expected to run to tens of millions of pounds. A Harrods spokesperson reissued a statement previously given to Sky News, saying: \"It would be premature for us to comment on the nature and details of a scheme that is currently under consultation. \"We are actively inviting the valuable input from Survivors and their legal representatives to establish the final scheme that aims to be survivor-first, trauma-informed, and fair in its approach to compensation. \"Further updates will be provided once the consultation period is complete.\" According to a website set up by MPL Legal for the purposes of administering the scheme, \"Harrods and MPL Legal are undertaking a period of consultation regarding the compensation scheme in which we will receive detailed feedback from interested parties, including several legal firms representing survivors, leading Counsel and Dame Jasvinder [Sanghera], the Independent Survivor Advocate\". \"It is anticipated the final compensation scheme will be published and survivors will be able to access application forms from 31 March 2025.\" Mr al Fayed, who died in 2023, owned Harrods for a quarter of a century, selling it in 2010 to Qatar Holding for £1.5bn. His reign of terror at the Knightsbridge store is thought to have involved hundreds of predominantly young female victims, with former Fulham women's players also alleging sexual abuse by the billionaire Egyptian. Mr al Fayed also owned Fulham Football Club, as well as the Ritz Hotel in Paris, for a number of years. The MPL Legal document previously reported by Sky News said the redress scheme would \"provide options for survivors - an alternative route to the court process\", and that it would \"hopefully avoid an adversarial approach which also risks retraumatising survivors\". It added that the scheme would be \"as inclusive as possible - we want the scheme to work for as many survivors as we can\". Under the heading \"Scheme principles\", MPL said it represented \"an alternative to litigation, but a survivor can leave the scheme at any time and pursue the claim through the court system\". It said it hoped that law firms engaging with the scheme \"will ensure survivors receive 100% of the compensation\". \"The level of compensation available through the scheme has been designed to mirror the court's approach,\" it added. Last October, lawyers acting for victims of Mr al Fayed said they had received more than 420 enquiries about potential claims, although it is unclear how many more have come forward in the six months since."
    },
    {
        "title": "Trump's Scotland course will not host Open Championship because of commercial 'challenges'",
        "description": "Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said.",
        "url": "https://news.sky.com/story/trumps-scotland-course-will-not-host-open-championship-because-of-commercial-challenges-13337390",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-trump-turnberry_6869622.jpg?20250328165449",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "Mark Darbon, chief executive of the R&A, tells Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Donald Trump's dreams of hosting golf's Open Championship at his Turnberry course in Scotland will not be realised until the course is logistically and commercially viable, the game's governing body has said. Mark Darbon, chief executive of the R&A, told Sky News Turnberry is a \"challenging\" venue and, despite suggestions of diplomatic pressure from London and Washington, it has no immediate plans to schedule a championship at the Ayrshire venue. Mr Trump has made no secret of his desire to return the Open to a course he bought in 2014, with his son Eric Trump leading efforts for it to stage a first championship since 2009. Sources close to Mr Trump's golf interests have told Sky News the Open would be a valuable bargaining tool in the UK's trade negotiations with the US, and the King went as far as to mention Turnberry in the invitation for a state visit hand delivered by the prime minister last month. In his first broadcast interview since becoming chief executive last November, Mr Darbon said logistics and finances currently rule out a course that may have been outgrown by the demands of a modern Open. \"The area where there's a bit of challenge is around the logistical and commercial side. The last time we were at Turnbury in 2009 we had 120,000 people there,\" he said. \"These days a modern Open caters for 250,000 people-plus, and so we need the road and rail infrastructure to get our fan base there. We need hotel accommodation for the 60,000 bed nights we need to stage our championship and it's challenging at that venue.\" Mr Darbon did not deny there was pressure to consider Turnberry, and indicated that politics, and the prospect of Mr Trump overshadowing any event, would also be a factor. \"We need to be confident that the focus will be on the sport and we need to ensure that the venue works for our requirement,\" he added. Read more: Man charged over vandalism at Trump golf course in Scotland Competition for Turnberry is likely to increase from larger, less remote facilities. The R&A draws Open venues from a rota of courses, with Royal Portrush staging this year's championship following a sellout return after almost 70 years in 2019. Mr Darbon confirmed Portmarnock near Dublin is being actively considered for the first-ever Open outside the UK. Maximising income from the Open matters because the R&A, which governs the game everywhere save the US, uses the revenue to fund a grassroots game still enjoying a post-COVID boom. \"We work with over 140 countries around the world, and in those markets there are now more than 62 million golfers, more than ever before,\" Mr Darbon said. \"Some 40-odd million are playing golf regularly on nine and 18-hole golf courses, another 20 million are playing what we would call non-traditional formats like driving ranges, adventure golf, simulator golf. So the game is actually in rude health and our job is to continue to foster that and support it over time.\" Read more from Sky News:Could the US really become a Commonwealth member?Trump 'p***ed' off' with Putin after Zelenskyy comments He is optimistic too that an end may be in sight for golf's own trade war, between the US PGA Tour and the Saudi Arabian-funded LIV Golf league, a multi-billion dollar schism in the men's professional game that has enriched scores of players while alienating many fans. \"There's been too much talk about cash and not enough talk about competition and courses and all the other wonderful things that underpin our sport. So we're optimistic for some positive change on that front. We're not a negotiating table, but our job is to try and influence those discussions,\" he said. The Open and golf's other major championships, including next month's Masters, have benefitted from the dispute as the only platforms for all of the best male players, and Mr Darbon says the game retains its lucrative appeal to business & sponsors. \"I think golf is maintaining its commercial appeal and I think there are a number of things that support that,\" he said. \"The game has a really rich history and heritage, the values of the sport are really strong, and brands of businesses can continue to tell really rich stories about the game of golf that links to their own products and services. On top of that, golf has a genuinely global audience.\" Among them is the world's most powerful man, his ambitions to host the Open still unfulfilled."
    },
    {
        "title": "Gig economy bosses could face jail time if they fail to check employees can legally work in UK",
        "description": "Company bosses hiring in the gig economy could face up to five years in prison if they fail to check if their employees can legally work in the UK, the Home Office has said.",
        "url": "https://news.sky.com/story/gig-economy-bosses-could-face-jail-time-if-they-fail-to-check-employers-can-legally-work-in-uk-13338420",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bike-gig-economy_6870974.jpg?20250329220809",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "The Home Office has announced a crackdown on illegal working which it claims will \"undermine\" people smugglers using \"the false promise of jobs for migrants\".",
        "Content": "Company bosses hiring in the gig economy could face up to five years in prison if they fail to check if their employees can legally work in the UK, the Home Office has said. The employers could also be banned from operating as company directors, have their business closed down, or be hit with fines of up to £60,000 for every worker who isn't checked as part of the government crackdown. The announcement comes as Home Secretary Yvette Cooper prepares to speak to Sky News breakfast show Sunday Morning with Trevor Phillips today. Her department has said \"thousands\" of companies which hire gig economy and zero-hour contract workers are not legally required to check whether they have the right to work in the UK. Politics latest: Follow live updates The gig economy refers to an employment arrangement where work is assigned on a short-term or job-by-job basis in sectors such as construction, food delivery, beauty salons and courier services. Food delivery firms Deliveroo, Just Eat and Uber Eats all use this approach to employment. \n                  Home Office cancels hotel company's contract to house asylum seekers\n                 \n                  Apple vs Home Office encryption court battle must be held in public, say MPs\n                 \n                  What is the loophole that allowed a family in Gaza permission to come to UK on a Ukraine resettlement scheme?\n                 However, all three of those employers already voluntarily carry out checks to ensure their delivery riders are eligible to work in the UK. The Home Office has now announced that all employers who hire gig economy or zero-hour contract workers will have to carry out these \"vital checks\" which take \"just minutes to complete\". This amendment to the Border Security, Asylum and Immigration Bill will help \"level the playing field for the majority of honest companies who do the right thing\", the government department added. The Home Office said it will provide the checks free of charge and that \"clamping down\" on illegal working forms a \"critical part of the government's plan to strengthen the entire immigration system\". The move is also intended to \"undermine people smugglers using the false promise of jobs for migrants\", it added. Ms Cooper said: \"Turning a blind eye to illegal working plays into the hands of callous people smugglers trying to sell spaces on flimsy, overcrowded boats with the promise of work and a life in the UK. \"These exploitative practices are often an attempt to undercut competitors who are doing the right thing. But we are clear that the rules need to be respected and enforced.\" Read more politics news:What Labour is doing to keep welfare rebels quietThe 'horrific' content teens are being exposed to onlinePM says national interest 'must come first' amid Trump tariffs Meanwhile the government is preparing to host the first international summit in the UK on how to tackle people-smuggling gangs. Ministers and enforcement staff from 40 countries will meet in London on Monday and Tuesday to discuss international cooperation, supply routes, criminal finances and online adverts for dangerous journeys. Countries including Albania, Vietnam and Iraq - where migrants have travelled from to the UK - will join the talks as well as France, the US and China. The government will also hand counter-terror style powers to police and enforcement agencies to crack down on people-smuggling gangs as part of amendments to the bill."
    },
    {
        "title": "Blackwall Tunnel charges to start and Silvertown tunnel to open - what you need to know",
        "description": "From next week, drivers using London's Blackwall Tunnel will have to pay a toll.",
        "url": "https://news.sky.com/story/blackwall-tunnel-charges-to-start-and-silvertown-tunnel-to-open-everything-you-need-to-know-13328434",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-blackwall-tunnel-london_6856336.jpg?20250314154200",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-30 23:01:00",
        "Headline": "From 7 April drivers using the Blackwall Tunnel and the new Silvertown Tunnel will have to pay a toll. Here is everything you need to know.",
        "Content": "From next week, drivers using London's Blackwall Tunnel will have to pay a toll. The charge is being implemented the same day the new Silvertown Tunnel - which will link east London to southeast London - also opens to drivers. For car drivers, a return journey at peak times will cost £8, jumping up to £13 for large vans. Here is everything you need to know about the new tunnel, the tolls and the decision behind its implementation. What is the Silvertown Tunnel? The 1.4km (just under one mile) long tunnel stretches from Silvertown in Newham, east London, to the Greenwich Peninsula in southeast London. It will run adjacent to the Victorian-era Blackwall Tunnel which takes drivers near The O2 Arena under the River Thames to the East India Dock Road (A13) in Blackwall. The project, which has cost £2.2bn, was approved by London Mayor Saqid Khan, having been first proposed back in 2012. It is being funded through private finance and Transport for London (TfL) will pay back £100m a year through money made on the toll. Why was it built? The new tunnel aims to reduce congestion that currently builds up on the approach to the Blackwall Tunnel. Transport for London claims the Silvertown Tunnel will save commuters up to 20 minutes. The government body says the Blackwall Tunnel was never designed to carry the levels of traffic it currently does, leading to more frequent incidents that cause traffic to tailback for miles and negatively impacting air quality. As well as private vehicles, around 21 buses will travel through the new tunnel every hour from 7am until 7pm Monday to Friday, which TfL has said will help to offer new routes for more people. A dedicated bike bus shuttle service will also transport cyclists and their bikes across the river. How much will it cost and how do you pay? After 7 April charges will apply to both the Silvertown and Blackwall tunnels. How much you are charged depends on what you drive and at what time. Peak hours through the northbound tunnel will run from 6am to 10am Monday to Friday. For the southbound tunnel peak hours are 4pm until 7pm Monday to Friday. All other times will be classed as off-peak, including weekends. Both tunnels will be open 24 hours a day, seven days a week. The toll has to be paid by phone or online. The TfL website states the easiest way to pay is to use Auto Pay, which allows people to link their payment cards to an account that will automatically take payment. Once the tunnel opens, local residents will be able to use cross-river bus routes for free for a year. Residents who are on certain benefits and live in local boroughs will also be eligible for a 50% discount. Why is it so controversial? Ever since the Silvertown Tunnel was given the green light, it has been met with criticism from opposition parties and campaign groups. The Liberal Democrats have argued against the project from the start, claiming Mr Khan hasn't listened to environmental concerns. It believes more roads will lead to more people using them, creating bottlenecks through areas including Greenwich, Blackheath and Eltham. Read more from Sky News:£10k reward for details about boy who disappeared 17 years agoGig economy bosses could face jail time if checks missed Rob Blackie, who was the Lib Dem's candidate for Mayor of London, has previously said: \"The way to cut pollution and climate change is to encourage people to walk, bicycle and use public transport. \"This multi-billion pound project, the Silvertown Tunnel, does exactly the opposite!\" Campaign group Stop Silvertown Tunnel Coalition argues the opening of the tunnel will actually increase congestion and emissions and impose a toll on Londoners to compensate for construction costs. TfL maintains the project will \"help to reduce congestion at the Blackwall Tunnel, deliver faster journeys during peak times, help manage overall air quality and allow for better cross-river public transport\"."
    },
    {
        "title": "Starmer and Trump discuss 'productive negotiations' towards US-UK 'prosperity' deal",
        "description": "Sir Keir Starmer and Donald Trump have discussed the \"productive negotiations\" towards a UK-US \"economic prosperity deal\", Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-and-trump-discuss-productive-negotiations-towards-us-uk-trade-deal-downing-street-says-13339017",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-keir-starmer_6841896.jpg?20250228025726",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:48:00",
        "Headline": "The leaders also agreed that the negotiations on an \"economic prosperity deal\" would continue \"at pace\" this week, Downing Street said.",
        "Content": "Sir Keir Starmer and Donald Trump have discussed the \"productive negotiations\" towards a UK-US \"economic prosperity deal\", Downing Street has said. The two leaders discussed a possible deal in a phone call on Sunday and agreed negotiations will \"continue at pace\", according to a statement. A Downing Street spokesperson said: \"The prime minister spoke to President Trump this evening. \"The president opened by wishing His Majesty the King best wishes and good health. \"They discussed the productive negotiations between their respective teams on a UK-US economic prosperity deal, agreeing that these will continue at pace this week. \"Discussing Ukraine, the prime minister updated the president on the productive discussions at the meeting of the Coalition of Willing in Paris this week. The leaders agreed on the need to keep up the collective pressure on Putin. \"They agreed to stay in touch in the coming days.\" Earlier this week, Mr Trump announced a new 25% tariff on all imported cars - threatening UK producers' largest single export market. Signing an executive order on Wednesday, Mr Trump said the tax would kick in on 2 April - what he has called \"liberation day\". British manufacturers such as Jaguar Land Rover, Bentley, Aston Martin and Rolls-Royce stand to be worst affected by the tariffs.  But the UK government has signalled it will not retaliate - mirroring its response to the tariffs on steel and aluminium imposed globally by the Trump administration earlier this month. Tariffs are a key part of Mr Trump's efforts to reshape global trade relations. He plans to impose a swathe of what he calls \"reciprocal\" taxes on \"liberation day\" that would match tariffs and sales taxes levied by other nations. President Trump told reporters on Sunday that the reciprocal tariffs will include all nations that charge fees on US exports. Read more:Trump 'p***ed off' with Putin after Zelenskyy comments How will Trump's economic tariffs affect the UK?Vance hits out at Denmark during Greenland visit The UK hopes an economic deal with the US will spare the country from a broader round of these tariffs. On Friday, Mr Trump said he was open to carving out deals with countries seeking to avoid US tariffs, but those agreements would be negotiated after 2 April. Mr Trump has already placed a 20% tax on all imports from China. He also placed 25% tariffs on Mexico and Canada - before later suspending them on certain goods - with a lower 10% tariff on Canadian energy products in addition to the duties on all steel and aluminium imports, including those from the UK. The two leaders spoke last Sunday in a \"brief call\" about the economic prosperity deal, and again nearly three weeks ago ahead of the US-Ukraine talks in Saudi Arabia. Mr Starmer and Mr Trump appeared to have a warm personal relationship when they met in the Oval Office last month. But just a day later, the US president along with vice president JD Vance delivered a dressing down to Ukrainian president Volodymyr Zelenskyy. That meeting marked a major shift in the US approach to Ukraine, while Mr Starmer cemented his position as a bridge between Europe and Washington in the peace talks by hosting Mr Zelenskyy and other European leaders in London days later. Mr Starmer and Mr Trump also spoke twice before they met in person."
    },
    {
        "title": "'Two-tier justice' row: Government plans to change law to overrule Sentencing Council",
        "description": "The government plans to change the law so it can overrule Sentencing Council guidelines following a row over \"two-tier justice\", Sky News understands.",
        "url": "https://news.sky.com/story/two-tier-justice-row-government-could-change-law-on-monday-to-overrule-sentencing-council-13338782",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-shabana-mahmood-justice_6756107.jpg?20250306031400",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-30 14:21:00",
        "Headline": "The Sentencing Council changed guidance to judges and magistrates to advise they get a pre-sentence report for criminals from an ethnic, cultural or faith minority.",
        "Content": "\n          Political reporter\n              @alixculbertson\n The government plans to change the law so it can overrule Sentencing Council guidelines following a row over \"two-tier justice\", Sky News understands. The independent Sentencing Council, which sets out sentencing guidance to courts in England and Wales, has been at odds with Justice Secretary Shabana Mahmood for weeks after it updated its guidance. It said that from April, a pre-sentence report, the results of which are taken into account when considering a criminal's sentence, will \"usually be necessary\" before handing out punishment for someone from an ethnic, cultural or faith minority, alongside other groups such as young adults aged 18 to 25, women and pregnant women. Conservative shadow justice minister Robert Jenrick called the guidance \"two-tier justice\" and said there was \"blatant bias\" against Christians and straight white men, as he said it would make \"a custodial sentence less likely for those from an ethnic minority, cultural minority, and/or faith minority community\". Ms Mahmood had called on the Sentencing Council to reverse the guidance, but it refused, which Sir Keir Starmer said he was \"disappointed\" with, and the justice secretary called \"unacceptable\". Before the weekend, Sir Keir said \"all options are on the table\" over how the government might respond. But sources have now told Sky News the Ministry of Justice plans to legislate at the \"earliest opportunity\" to be able to overrule sentencing guidelines. Ministers could introduce the legislation as early as Monday so they can \"push it through parliament\", so the current guidelines can be changed quickly. Until the law is changed so the government can dismiss the Sentencing Council guidelines, the body can plough ahead with the changes as it is independent of the state. Read more:Sentencing Council rejects minister's call for guidance rethinkWhat are pre-sentence reports and why the controversy?  In reply to Ms Mahmood's letter calling for a reversal, the Sentencing Council's chair, Lord Justice William Davis, said on Friday that the reforms reflect evidence of disparities in sentencing outcomes, disadvantages faced within the criminal justice system and complexities in the circumstances of individual offenders. He said pre-sentence reports allow judges to be \"better equipped\" to \"avoid a difference in outcome based on ethnicity\". \"The cohort of ethnic, cultural and faith minority groups may be a cohort about which judges and magistrates are less well informed,\" he added. Sky News has contacted the Sentencing Council for a comment on the potential law changes."
    },
    {
        "title": "Government looking at other countries to process asylum seekers in, home secretary says",
        "description": "The government is looking at other countries it could process asylum seekers in, Home Secretary Yvette Cooper has told Sky News.",
        "url": "https://news.sky.com/story/government-looking-at-other-countries-to-process-asylum-seekers-in-home-secretary-says-13338561",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-dover-migrants-channel_6871169.jpg?20250330111855",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-30 08:53:00",
        "Headline": "Yvette Cooper said she has been talking to Italy about its agreement to process asylum seekers in Albania, and is looking at other countries as well.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The government is looking at other countries it could process asylum seekers in, Home Secretary Yvette Cooper has told Sky News. Speaking to Sunday Morning With Trevor Phillips, Ms Cooper said the government has been talking to Italy about its arrangements with Albania and with the EU Commission about other options. Ms Cooper said she has been speaking to the Italian interior minister about their deal, which means asylum seekers wanting to settle in Italy will be processed in Albania. Politics latest: Nobody had courage to speak up when Prince Harry was in room Asked if she wants the same deal for the UK, following reports the government is looking at a deal with Albania, Ms Cooper said: \"We will always look at what works. \"There has to be practical things that will work, not gimmicks.\" She criticised the Conservative government's Rwanda deal, which was meant to see UK asylum seekers processed in Rwanda. It cost £700m but only saw four volunteers sent there. \n                  Home Office cancels hotel company's contract to house asylum seekers\n                 \n                  'Migrant hub' plan will send alarm bells clanging for many Labour MPs - as Tories smell blood\n                 \n                  Government considering sending failed asylum seekers to overseas 'migrant hubs'\n                 Former Labour home secretary Lord Blunkett has suggested the government should create bespoke agreements with designated \"safe\" countries to deport foreign criminals and illegal immigrants, as this would override any claims through the Convention on Human Rights (ECHR). Asked about that, and whether the UK is talking to Albania or any other countries about an \"Italian-style deal\", Ms Cooper said: \"We've talked to the Italian government about the arrangements that they have, and we've always said we'll look at what works. \"We're also talking to the EU Commission who are interested in different approaches around return hubs, that's the kind of thing that you're talking about. \"But our central focus is on the borders, the summit, the organised immigration crime summit and on tackling the criminal gangs.\" Read more:Gig company bosses who fail to check employees' immigration status could face jailItalian court deals Albania migrant scheme another blow  The UK is hosting an \"unprecedented\" border security summit on Monday with interior ministers and law enforcement from more than 40 countries, Ms Cooper said. She said the summit was necessary because illegal immigration is a \"global problem\". \"The criminal gang networks that end up with people arriving in the UK, stretch back through northern France, through Germany, across Europe, to places like the hills of Kurdistan or the money markets in Kabul,\" the home secretary said. \"So you need to tackle this as a global problem.\" Ms Cooper added that the government has got new agreements with France and the French government has changed the rules so its police force will now \"take action\" in the Channel to prevent migrants crossing to the UK in small boats. Sir Keir Starmer has pledged to \"smash the gangs\", which Ms Cooper said can be seen through the 20% increase in migrant returns since Labour was voted in last summer, a 40% increase in illegal working raids and a 40% increase in arrests for illegal working. The Home Office announced on Sunday that company bosses hiring in the gig economy could face up to five years in prison if they fail to check if their employees can legally work in the UK. Ms Cooper told Sunday Morning With Trevor Phillips: \"Frankly, it is too easy at the moment for employers to take people on illegally through those contract mechanisms without those checks in place.\""
    },
    {
        "title": "MP's £900 claim for her dog's 'pet rent' prompts ministers to call for expenses review",
        "description": "A senior Labour MP's &#163;900 \"pet rent\" expenses claim has prompted ministers to call for a review of what MPs can claim back.",
        "url": "https://news.sky.com/story/mps-163900-claim-for-her-dogs-pet-rent-prompts-ministers-to-call-for-expenses-review-13338662",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-taiwo-owatemi-dog-pet-rent_6871217.png?20250330124713",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-30 11:34:00",
        "Headline": "Taiwo Owatemi legitimately claimed for the pet surcharge on her London home but the use of public money has triggered an angry response.",
        "Content": "\n          Political reporter\n              @alixculbertson\n A senior Labour MP's £900 \"pet rent\" expenses claim has prompted ministers to call for a review of what MPs can claim back. Taiwo Owatemi, a government whip and the MP for Coventry North West, made the claim after the landlord at her second home in London charged her extra to allow her cockapoo, Bella, to stay at the property. Parliamentary authorities paid the £900 claim, submitted as \"pet rent\" in August 2024, as it is not in breach of the current rules governing MPs' expenses. Politics latest: Trump tariffs could hurt whole world economy It is not known how many other MPs claim for pet surcharges as they are not normally listed individually, but included in rent claims. The rules say MPs, who will now earn £93,904 a year after a recent pay rise, can claim expenses to help cover work and living costs in London if their constituency is outside the capital. Disability campaigners have called the claim a \"disgrace\" as Ms Owatemi, 32, is currently helping the government push through £5bn in cuts to disability benefits. The TaxPayers' Alliance called on MPs to pay for their pets out of their own pockets. Security minister Dan Jarvis has now said the government will urge the Independent Parliamentary Standards Authority (IPSA) to change the rules. He said Ms Owatemi had followed the rules and did nothing wrong, but told LBC: \"I wouldn't do that, haven't done that. Therefore, I think it can't be right that the rules allow any Member of Parliament to do that. \"That is why the government will be making representations to IPSA, the Independent Parliamentary Standards Authority, to ask them to look very carefully at the detail of this particular rule.\" Ms Owatemi, who became an MP in 2019, often posts on social media about her dog, and is a supporter of Battersea Dogs and Cats Home and other animal charities. Read more politics news:Gig economy bosses could face jail time if checks missedGovt looking at other countries to process asylum seekers in  IPSA told Sky News it gave the MP \"incorrect advice\" as to how the surcharge should be described. \"We have apologised directly to the MP and are sorry for any confusion,\" a spokesman said. He added that IPSA is committed to helping MPs fund having to work in both Westminster and their constituency so those without the private finances to do so \"are not prevented from becoming an MP\". \"That is why we fund accommodation costs, within strict limits. It is common for landlords to include additional surcharges in rental agreements,\" he said."
    },
    {
        "title": "Gig economy bosses could face jail time if they fail to check employees can legally work in UK",
        "description": "Company bosses hiring in the gig economy could face up to five years in prison if they fail to check if their employees can legally work in the UK, the Home Office has said.",
        "url": "https://news.sky.com/story/gig-economy-bosses-could-face-jail-time-if-they-fail-to-check-employers-can-legally-work-in-uk-13338420",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-bike-gig-economy_6870974.jpg?20250329220809",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "The Home Office has announced a crackdown on illegal working which it claims will \"undermine\" people smugglers using \"the false promise of jobs for migrants\".",
        "Content": "Company bosses hiring in the gig economy could face up to five years in prison if they fail to check if their employees can legally work in the UK, the Home Office has said. The employers could also be banned from operating as company directors, have their business closed down, or be hit with fines of up to £60,000 for every worker who isn't checked as part of the government crackdown. The announcement comes as Home Secretary Yvette Cooper prepares to speak to Sky News breakfast show Sunday Morning with Trevor Phillips today. Her department has said \"thousands\" of companies which hire gig economy and zero-hour contract workers are not legally required to check whether they have the right to work in the UK. Politics latest: Follow live updates The gig economy refers to an employment arrangement where work is assigned on a short-term or job-by-job basis in sectors such as construction, food delivery, beauty salons and courier services. Food delivery firms Deliveroo, Just Eat and Uber Eats all use this approach to employment. \n                  Home Office cancels hotel company's contract to house asylum seekers\n                 \n                  Apple vs Home Office encryption court battle must be held in public, say MPs\n                 \n                  What is the loophole that allowed a family in Gaza permission to come to UK on a Ukraine resettlement scheme?\n                 However, all three of those employers already voluntarily carry out checks to ensure their delivery riders are eligible to work in the UK. The Home Office has now announced that all employers who hire gig economy or zero-hour contract workers will have to carry out these \"vital checks\" which take \"just minutes to complete\". This amendment to the Border Security, Asylum and Immigration Bill will help \"level the playing field for the majority of honest companies who do the right thing\", the government department added. The Home Office said it will provide the checks free of charge and that \"clamping down\" on illegal working forms a \"critical part of the government's plan to strengthen the entire immigration system\". The move is also intended to \"undermine people smugglers using the false promise of jobs for migrants\", it added. Ms Cooper said: \"Turning a blind eye to illegal working plays into the hands of callous people smugglers trying to sell spaces on flimsy, overcrowded boats with the promise of work and a life in the UK. \"These exploitative practices are often an attempt to undercut competitors who are doing the right thing. But we are clear that the rules need to be respected and enforced.\" Read more politics news:What Labour is doing to keep welfare rebels quietThe 'horrific' content teens are being exposed to onlinePM says national interest 'must come first' amid Trump tariffs Meanwhile the government is preparing to host the first international summit in the UK on how to tackle people-smuggling gangs. Ministers and enforcement staff from 40 countries will meet in London on Monday and Tuesday to discuss international cooperation, supply routes, criminal finances and online adverts for dangerous journeys. Countries including Albania, Vietnam and Iraq - where migrants have travelled from to the UK - will join the talks as well as France, the US and China. The government will also hand counter-terror style powers to police and enforcement agencies to crack down on people-smuggling gangs as part of amendments to the bill."
    },
    {
        "title": "Birmingham bin strikes: Government urged to hold COBRA meeting over dispute",
        "description": "The government should hold an urgent COBRA meeting to deal with Birmingham's ongoing bin strikes, the Conservatives say.",
        "url": "https://news.sky.com/story/birmingham-bin-strikes-government-urged-to-hold-cobra-meeting-over-dispute-13338489",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-birmingham-bins-strikes_6871022.jpg?20250330024507",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-30 01:09:00",
        "Headline": "Conservative shadow ministers have written to Deputy Prime Minister Angela Rayner, urging the government to help end the dispute.",
        "Content": "The government should hold an urgent COBRA meeting to deal with Birmingham's ongoing bin strikes, the Conservatives say. The party has written a letter to Deputy Prime Minister and Communities Secretary Angela Rayner, in which it also urged the government to send in private sector binmen. The long-running strike is continuing, with rubbish piling up on the city's streets, despite talks aimed at ending the pay dispute. Members of the Unite union met with Birmingham City Council on Thursday, but the talks have so far failed. Unite says the dispute will not end unless the \"hugely damaging\" cuts to bin collectors' wages are reversed. But Birmingham City Council says the aim of the restructuring is to create a \"modern, sustainable and consistently reliable waste collection service\".  Shadow communities secretary Kevin Hollinrake and shadow Cabinet Office minister Alex Burghart have called on the government to hold a COBRA meeting to respond to the dispute. \n                  Man killed after collision with police car in Birmingham was 'beloved' father-of-two\n                 \n                  As Birmingham grapples with bin strikes and 'rats as big as cats', councils fear further cuts\n                 \n                  Man killed after collision with police car in Birmingham\n                 The Tories said the meeting would \"ensure that there is a co-ordinated response between national and local government\". The government sent in commissioners to oversee Birmingham City Council after it effectively declared bankruptcy in 2023. In their letter, Mr Hollinrake and Mr Burghart also said the commissioners should \"cut the pay of local councillors and redistribute the funding to local services\". Read more from Sky News:Couple arrested after school WhatsApp chat messagesPrince Harry accused of 'harassment and bullying' Last week, environment minister Mary Creagh told the House of Commons that resolving the strikes was a \"matter [for] the council\". She added that both parties needed to \"sort this out for the benefit of the people of Birmingham\"."
    },
    {
        "title": "Morning-after pill set to be made free from pharmacies in bid to end 'unfair postcode lottery'",
        "description": "The morning-after pill could become free from pharmacies in order to end an \"unfair postcode lottery\", according to a health minister.&#160;",
        "url": "https://news.sky.com/story/morning-after-pill-to-be-made-free-from-pharmacies-in-bid-to-end-unfair-postcode-lottery-13338506",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pharmacy-pill_6871028.jpg?20250330065815",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-30 05:52:00",
        "Headline": "Emergency contraception is free from most GPs and sexual health clinics, but pharmacies can charge up to £30.",
        "Content": "The morning-after pill could become free from pharmacies in order to end an \"unfair postcode lottery\", according to a health minister.  The morning-after pill is a type of emergency contraception taken to prevent an unwanted pregnancy. Despite its name, it can be taken up to five days after unprotected sex, but the sooner it is taken, the more effective it is. Emergency contraception is free from most GPs and sexual health clinics, but pharmacies can charge up to £30. Health minister Stephen Kinnock said women \"face an unfair postcode lottery when seeking emergency contraception, with access varying dramatically depending on where they live\". He described equal access to safe contraception as \"a cornerstone of a fair society\". The proposal, which will be announced on Monday as part of a wider investment in community pharmacies, would come into effect later this year. \n                  Lung conditions: New AI test set to transform diagnosis\n                 \n                  Norovirus levels 'stubbornly high' for time of year, NHS data shows\n                 \n                  Software provider fined £3m over ransomware attack that disrupted key NHS services\n                  As well as making access to the pill more equal, it is hoped the plans will free up appointments for GPs as women will no longer have to book in to receive the medicine. The government is making a raft of changes to the healthcare system, including scrapping NHS England, the administrative body that runs the national health service."
    },
    {
        "title": "First orbital rocket launched from Europe crashes into sea - but company says test 'met all expectations'",
        "description": "The first orbital rocket launched from mainland Europe took off from Norway on Sunday - but crashed into the sea and exploded 40 seconds later.",
        "url": "https://news.sky.com/story/first-orbital-rocket-launched-from-europe-crashes-into-sea-but-company-says-test-met-all-expectations-13338992",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rocket-europe-norway_6871641.jpg?20250330203622",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-30 19:04:00",
        "Headline": "Isar Aerospace, the German company that built the rocket, had warned that the launch could end prematurely, and maintained that the flight had produced extensive data that its team can learn from.",
        "Content": " The first orbital rocket launched from mainland Europe took off from Norway on Sunday - but crashed into the sea and exploded 40 seconds later. The unmanned Spectrum rocket blasted off from the Arctic Andoeya Spaceport, on Sunday at 12.30pm local time before it was terminated less than a minute later. Isar Aerospace, the German company that built the rocket, had warned that the launch could end prematurely. It maintained that despite being short, the flight had produced extensive data that its team could learn from. \"Our first test flight met all our expectations, achieving a great success,\" Daniel Metzler, Isar's chief executive and co-founder, said. \"We had a clean lift-off, 30 seconds of flight and even got to validate our flight termination system.\" Spectrum is a two-stage launch vehicle specifically designed to put small and medium satellites into orbit. Its maiden voyage was aimed at kickstarting satellite launches from Europe. Several European nations, including the UK and Sweden, have said they want to be an active player in the growing market of commercial space missions. Big global companies already ahead in the satellite launch game include Elon Musk's SpaceX, which launches from the US, and French company ArianeGroup, a joint venture between Airbus and Safran that uses a spaceport in South America's French Guiana. Mr Musk's SpaceX also operates the Starlink satellite service, a communications network that can provide much of the globe with access to the internet. Germany's BDLI aerospace industries association said Isar's first flight would lead to further progress. BDLI managing director, Marie-Christine von Hahn, said: \"Europe urgently needs to ensure its sovereignty in space. Elon Musk's Starlink is not without alternatives - nor should it be.\" Read more from Sky News:Should daylight savings be scrapped?New AI test set to transform diagnosis of lung condition Sweden, with its Esrange launch site, and Britain with its SaxaVord Spaceport in the Scottish Shetland Islands, are the nearest rivals to the Norwegian site, all of which aim to give Europe greater autonomy in space flights. SaxaVord, which suffered a setback when a rocket engine exploded during a test last year, is planning its first satellite launch later this year."
    },
    {
        "title": "Lung conditions: New AI test set to transform diagnosis",
        "description": "A rapid test harnessing the power of AI is set to transform the diagnosis of a lung condition that affects 3 million people in the UK.",
        "url": "https://news.sky.com/story/lung-conditions-new-ai-test-set-to-transform-diagnosis-13338483",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-n-tidal-lung-conditions_6871009.jpg?20250329230506",
        "type": "Technology",
        "Author": "Emma Birchley",
        "Date Published": "2025-03-30 00:01:00",
        "Headline": "It is hoped the handheld device, called N-Tidal Diagnose, will speed up diagnosis and cut costs for the NHS.",
        "Content": "\n          News correspondent\n        A rapid test harnessing the power of AI is set to transform the diagnosis of a lung condition that affects 3 million people in the UK. Two thirds of those with chronic obstructive pulmonary disease (COPD) don't even know they've got it, but it's the second most common cause of emergency hospital admissions. Until now, confirmation has required a spirometry test involving forced exhalation. It can take half an hour or more, and that's once you've managed to get an appointment. Dr Simon Rudland, a GP in Suffolk, is excited about the potential to provide quick, accessible diagnosis. \"Spirometry is delivered out of a hub, so patients have to travel,\" he said. \"We need to employ experts within those hubs that require specialist training. And the biggest issue is the wait.\" Instead, the handheld device called N-Tidal Diagnose will enable a patient to walk into their doctor's surgery and find out in as little as five minutes if their symptoms like breathlessness and a persistent cough are caused by COPD. \n                  British authors 'absolutely sick' to discover books on 'shadow library' allegedly used by Meta to train AI\n                 \n                  Hacking by criminals and spies has reached 'unprecedented complexity', Microsoft says\n                 \n                  Humanoid machine performs real-world task in significant development in robot revolution\n                 \"It completely changes the whole pathway,\" said Dr Rudland. \"With that diagnosis I can initiate treatment. I don't have to wait. They don't get put on the wrong drugs. It's revolutionary.\" COPD isn't curable but it is treatable, but the sooner that treatment starts, the better it is long-term for the patient. Flare-ups account for one in eight people being admitted to hospital and a third won't have been diagnosed before that. 'Only five minutes' Colin Best, 67, from Stowmarket in Suffolk, was gasping for breath at the slightest exertion when he went to the doctor's eight years ago. He had multiple different tests before it was decided he had the disease, including spirometry four or five times. \"The spirometry test is exhausting. You have to have several tests and each one has a gap of five [to] 10 minutes between to let you relax,\" he said. \"It took me a year to convince them there was something seriously wrong whereas with that machine it's only five minutes.\" The patient breathes normally into the handset, which logs carbon dioxide and sends data to a cloud platform where it is analysed in real-time by AI software. Dr Ameera Patel, chief executive of TidalSense which makes the device, said: \"In total, we've collected over 2.5 million patient breaths from every cardio-respiratory condition that you can think of and then we've trained the machine learning model. \"We've taught it to discriminate COPD from everything else that can look like COPD. So that's asthma, heart failure, lung cancer.\" Read more from Sky News:Couple arrested after school WhatsApp chat messagesPrince Harry accused of 'harassment and bullying' And it only takes 10 minutes to train staff to use it. The sensor has been approved for use across the EU and is expected to start being used in doctors' surgeries in a matter of weeks. The hope is it will transform diagnosis and cut costs for a cash-strapped NHS."
    },
    {
        "title": "Dr Kildare and Shogun actor Richard Chamberlain dies ",
        "description": "Richard Chamberlain, who starred in the TV medical drama \"Dr Kildare\" and the 1980s mini-series \"Shogun\", has died at the age of 90, his publicist said.",
        "url": "https://news.sky.com/story/dr-kildare-and-shogun-actor-richard-chamberlain-dies-13338744",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-richard-chamberlain_6871318.jpg?20250330144113",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-30 13:37:00",
        "Headline": "Most of Chamberlain's roles were as romantic leading men, which is why he did not publicly reveal he was gay until he was 68 years old.",
        "Content": "Richard Chamberlain, who starred in the TV medical drama \"Dr Kildare\" and the 1980s mini-series \"Shogun\", has died at the age of 90, his publicist said. Chamberlain became a heartthrob as the handsome Dr James Kildare in the medical drama that ran from 1961 to 1966. Photoplay magazine named him \"most popular male star\" three years in a row from 1963 to 1965. His breakout role in Dr Kildare marked the start of a six-decade career that spanned theatre, films and television. The California-born actor was dubbed the \"king of the mini-series\" after appearing in several TV dramas in the 1980s. This included being the original Jason Bourne in the 1988 mini-series The Bourne Identity. Chamberlain was nominated for Emmys for his roles in two mini-series - Shogun (1981) and The Thorn Birds (1983). He was also nominated for Emmys for his roles in the 1985 movie \"Wallenberg: A Hero's Story\" and the title role in the 1975 movie \"The Count of Monte-Cristo\". He also earned plaudits for his appearances on stage - including Professor Henry Higgins in \"My Fair Lady\", Captain von Trapp in \"The Sound of Music\" and Shakespeare's Hamlet and Richard II. Most of his roles were as romantic leading men, which is why he did not publicly reveal he was gay until he was 68 years old. He feared it would ruin his career, and so for much of his life, he said he pretended to be someone else. \"When you grow up in the '30s, '40s and '50s being gay, it's not only ain't easy, it's just impossible,\" he told the New YorkTimes in 2014. \"I assumed there was something terribly wrong with me. And even becoming famous and all that, it was still there.\" Chamberlain said it was a huge relief after he acknowledged his sexuality in his 2003 autobiography \"Shattered Love: A Memoir\". He said in a 2019 interview: \"I had no fear left... It was a wonderful experience. People were open, friendly and sweet.\" After coming out publicly, he played both gay and straight characters in TV shows including \"Brothers & Sisters,\" \"Will & Grace\" and \"Desperate Housewives.\" Born George Richard Chamberlain on 31 March 1934, he was the youngest of two sons. He had hoped to be an artist but switched to acting after attending Pomona College in California. His acting career was put on hold when he was drafted into the US Army in 1956 and served in Korea. Read more from Sky News:Trump 'p***ed off' with PutinPolice raid Quaker meeting houseThe Who singer says he's going blind In the late 1960s, Chamberlain moved to England, where he honed his acting skills in the BBC series \"The Portrait of a Lady\" and as Hamlet at the Birmingham Repertory Theatre. \"Dr Kildare was a huge hit in England, and I heard that all the London reviewers were coming to rip this interloper topieces,\" he said in an interview. \"But we got very good reviews.\" Chamberlain lived in Hawaii for many years and had a three-decade relationship with actor and writer Martin Rabbett, his co-star in the 1986 adventure film \"Allan Quatermain and the Lost City of Gold\". The couple parted in 2010 but remained close friends. \"He is free and soaring to those loved ones before us. How blessed were we to have known such an amazing and loving soul,\" Rabbett said in a statement after Chamberlain's death. Chamberlain's publicist said the star died from complications from a stroke in Hawaii on Saturday."
    },
    {
        "title": "The Who's lead singer Roger Daltrey tells fans he's going blind during live show",
        "description": "The Who's Roger Daltrey has told fans he's going \"blind\" while performing live at a charity concert.",
        "url": "https://news.sky.com/story/the-whos-lead-singer-roger-daltrey-tells-fans-hes-going-blind-during-live-show-13338583",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-pete-townshend-roger-daltrey_6871131.jpg?20250330122755",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-03-30 09:33:00",
        "Headline": "Daltrey says age is robbing him of his sight and hearing, while guitarist Pete Townshend says dancing like Mick Jagger knackered his knee.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n The Who's Roger Daltrey has told fans he's going \"blind\" while performing live at a charity concert. The 81-year-old lead singer was performing alongside his bandmate Pete Townshend on Thursday in the first of a series of gigs at London's Royal Albert Hall in aid of the Teenage Cancer Trust. Daltrey told the 5,000-strong audience: \"The joys of getting old mean you go deaf. I also now have got the joy of going blind. \"Fortunately, I still have my voice.\" He went on to say if he lost his voice too, he'd have a \"full Tommy\" - referring to the title character of The Who's 1969 album. \"Deaf, dumb and blind kid\" Tommy is also mentioned in Pinball Wizard from the same record. Daltrey has long worn purple-tinted glasses when out and about. During a later song at Thursday's gig, Daltrey's voice cracked, which he called a \"senior moment\", before adding: \"No apologies, I f***** up.\" \n                  Roger Daltrey responds to backlash over post-Brexit music touring comments\n                 Guitarist Townshend, 79, also revealed an age-related ailment, saying: \"Four and a half weeks ago, I had my left knee replaced.\" He said he had done it by dancing in the style of Sir Mick Jagger, lead singer of the Rolling Stones, who is two years his senior. Daltrey is stepping back from his role as curator of the Teenage Cancer Trust's Royal Albert Hall concerts, having launched the series in 2000. However, he will remain an honorary patron of the charity. Read more entertainment news:Five on 90s fame and finally reunitingExpert predicts cost of next GTA gameBAFTA TV nominations announced  The trust will now work with a series of guest curators, with The Cure's Robert Smith announced as the first musician to oversee duties next year. Daltrey and Townshend have been performing together for six decades, and are the only surviving original members of The Who. With hits including I Can't Explain, My Generation and Substitute, The Who are widely considered to be one of the most influential rock bands of the 20th century. The Who will return to the Royal Albert Hall for another gig in aid of Teenage Cancer Trust later today."
    }
]