[
    {
        "title": "'At least 59 killed' in Gaza after Israeli military opens fire near aid centre and carries out strikes",
        "description": "At least 59 Palestinians have reportedly been killed after the Israeli military opened fire near an aid centre in Gaza and carried out strikes across the territory.",
        "url": "https://news.sky.com/story/at-least-59-killed-after-israeli-military-opens-fire-near-gaza-aid-centre-and-carries-out-strikes-13395908",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rafah-aid_6963621.jpg?20250712183330",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 16:51:00",
        "Headline": "A woman tells Sky News her son was killed after being shot dead near an aid centre - as the IDF says it fired \"warning shots\" but is not aware of any injuries.",
        "Content": " At least 59 Palestinians have reportedly been killed after the Israeli military opened fire near an aid centre in Gaza and carried out strikes across the territory. The Red Cross, which operates a field hospital in Rafah, said 25 people were \"declared dead upon arrival\" and \"six more died after admittance\" following gunfire near an aid distribution centre in the southern Gazan city. The humanitarian organisation added that it also received 132 patients \"suffering from weapon-related injuries\" after the incident. The Red Cross said: \"The overwhelming majority of these patients sustained gunshot wounds, and all responsive individuals reported they were attempting to access food distribution sites.\" The organisation said the number of deaths marks the hospital's \"largest influx of fatalities\" since it began operations in May last year. The Israel Defence Forces (IDF) has said it fired \"warning shots\" near the aid distribution site but it was \"not aware of injured individuals\" as a result. It said in a statement: \"Earlier today, several suspects were identified approaching IDF troops operating in the Rafah area, posing a threat to the troops, hundreds of metres from the aid distribution site. \"IDF troops operated in order to prevent the suspects from approaching them and fired warning shots.\" Mother's despair over shooting Somia Alshaar told Sky News her 17-year-old son Nasir was shot dead while visiting the aid centre after she told him not to go. She said: \"He went to get us tahini so we could eat. \"He went to get flour. He told me 'mama, we don't have tahini. Today I'll bring you flour. Even if it kills me, I will get you flour'. \"He left the house and didn't return. They told me at the hospital: your son...'Oh God, oh Lord'.\" Asked where her son was shot, she replied: \"In the chest. Yes, in the chest.\" 'A policy of mass murder' Hassan Omran, a paramedic with Gaza's ministry of health, told Sky News after the incident that humanitarian aid centres in Gaza are now \"centres of mass death\". Speaking in Khan Younis, he said: \"Today, there were more than 150 injuries and more than 20 martyrs at the aid distribution centres... the Israeli occupation deliberately kills and commits genocide. The Israeli occupation is carrying out a policy of mass murder. \"They call people to come get their daily food, and then, when citizens arrive at these centres, they are killed in cold blood. \"All the victims have gunshot wounds to the head and chest, meaning the enemy is committing these crimes deliberately.\" Israel has rejected genocide accusations and denies targeting civilians. 'Lies being peddled' The Gaza Humanitarian Foundation (GHF), the controversial US and Israeli-backed group which operates the distribution centre near Rafah, said: \"Hamas is claiming there was violence at our aid distribution sites today. False. \"Once again, there were no incidents at or in the immediate vicinity of our sites. \"But that's not stopping some from spreading the lies being peddled by 'officials' at the Hamas-controlled Nasser Hospital.\" The Red Cross said its field hospital in Rafah has recorded more than 250 fatalities and treated more than 3,400 \"weapon-wounded patients\" since new food distribution sites were set up in Gaza on 27 May. Read more:'At least 798 killed' at Gaza aid points'10 children killed' waiting for Gaza health clinic to openIsrael says permanent ceasefire 'questionable' It comes after four children and two women were among at least 13 people who died in Deir al Balah, in central Gaza, after Israeli strikes pounded the area starting late on Friday, officials in Al Aqsa Martyrs hospital in the territory said. Fifteen others died in Israeli airstrikes in Khan Younis, in southern Gaza, according to Nasser Hospital. The IDF has not responded to a request for comment on the reported deaths. Israel has been carrying out attacks in Gaza since Hamas-led militants killed some 1,200 people and took 251 hostages on 7 October 2023. Hamas still holds 50 hostages, with fewer than half of them believed to be alive, after most of the rest were released in ceasefire agreements or other deals. Israel's offensive in Gaza has killed more than 57,000 Palestinians, more than half of them women and children, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. US President Donald Trump has said he is closing in on another ceasefire agreement that would see more hostages released and potentially wind down the war. But after two days of talks this week with Israeli Prime Minister Benjamin Netanyahu, there were no signs of a breakthrough. Palestinian-US man 'beaten to death' The latest fatalities in Gaza come as a 20-year-old Palestinian-American man was beaten to death by settlers in the Israeli-occupied West Bank on Friday, the Palestinian health ministry said. Sayafollah Musallet, also known as Saif, was killed during a confrontation between Palestinians and settlers in Sinjil, north of Ramallah, the ministry said. A second man, 23-year-old Hussein Al-Shalabi, died after being shot in the chest, it added. Mr Musallet's family, from Tampa Florida, has called on the US state department to lead an \"immediate investigation\". A state department spokesperson said it was aware of the incident but it had no further comment \"out of respect for the privacy of the family and loved ones\" of the reported victim. The Israeli military said the confrontation broke out after Palestinians threw rocks at Israelis, lightly injuring them. It added that military said forces were dispatched to the scene and used non-lethal weapons to disperse the crowds."
    },
    {
        "title": "Backlash as Air India crash report points to possible human error - here's what experts think",
        "description": "As investigators continue to piece together the full picture, early findings of the Air India crash are pointing towards a critical area of concern &#8212; the aircraft&#8217;s fuel control switches. ",
        "url": "https://news.sky.com/story/backlash-as-air-india-crash-report-points-to-possible-human-error-heres-what-experts-think-13395845",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-ahmedabad_6940057.jpg?20250612115435",
        "type": "Home",
        "Author": "Neville Lazarus",
        "Date Published": "2025-07-12 14:50:00",
        "Headline": "There has been a backlash over the findings in India, with some saying the report points to pilot error without much information and almost dismisses the possibility of a mechanical or electric failure.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  As investigators continue to piece together the full picture, early findings of the Air India crash are pointing towards a critical area of concern — the aircraft’s fuel control switches.  The flight, bound for London Gatwick, crashed just moments after taking off from Ahmedabad airport on 12 June, killing all but one of the 242 people on board the plane and at least 19 on the ground. According to the preliminary report by India's Aircraft Accident Investigation Bureau (AAIB), the two engine fuel control switches on the plane were moved from the \"RUN\" to \"CUTOFF\" position. These switches control fuel flow to the engines and should only be used when the aircraft is on ground, first to start the engines before a flight and later to shut them down at the gate. They are designed so they're unlikely to be changed accidentally, pointing to possible human error on the Air India flight. The findings include the final conversation between the pilots and show there was confusion in the cockpit as well. When one pilot asked the other why he cut off the fuel, he responded to say he did not do so. Moments later, a Mayday call was made from the cockpit, but the plane could not regain power quickly enough and plummeted to the ground. Captain Amit Singh, founder of Safety Matters Foundation, an organisation dedicated to aviation safety, told Sky News: \"This exchange indicates that the engine shutdowns were uncommanded. \"However, the report does not identify the cause - whether it was crew error, mechanical malfunction, or electronic failure.\" Previous warning of 'possible fuel switch issue' \"The Boeing 787 uses spring-loaded locking mechanisms on its fuel control switches to prevent accidental movement,\" Mr Singh explained. But a previous bulletin from the Federal Aviation Administration (FAA) \"warned that these switches might be installed with the locking feature disengaged,\" he said. This could \"make them susceptible to unintended movement due to vibration, contact, or quadrant flex\", he added. Speaking to Sky News, aviation expert Terry Tozner said: \"The take-off was normal, the aircraft rotated at the correct speed left the ground and almost immediately, the cut-off switches were selected to off, one then two. \"But nobody has said with any clarity whether or not the latch mechanisms worked okay on this particular aircraft. So we can only assume that they were in normal working order.\" In India, there has been a backlash over the findings, with some saying the report points to pilot error without much information and almost dismisses the possibility of a mechanical or electric failure. Indian government responds India's civil aviation minister Kinjarapu Ram Mohan Naidu has been quick to respond, saying: \"We care for the welfare and the wellbeing of pilots so let's not jump to any conclusions at this stage, let us wait for the final report. \"I believe we have the most wonderful workforce of pilots and crew in the whole world.\"  Both pilots were experienced, with around 19,000 flying hours between them, including more than 9,000 on Boeing 787s. The report says the aircraft maintenance checks were on schedule and that there are no signs of fuel contamination or a bird strike. So far, no safety recommendations have been issued to Boeing or General Electric, the engine manufacturers. Concern over destroyed flight recorder  Mr Singh said \"the survivability of the flight recorders also raises concern\". The plane's rear flight recorder, designed to withstand impact forces of 3,400 Gs and temperatures of 1,100C for 60 minutes, \"was damaged beyond recovery\". Read more:Everything you need to know about the crashAir India's lone survivor is nothing short of miracle \"The Ram Air Turbine (RAT), which deploys automatically when both engines fail and power drops below a threshold, was observed as deployed in CCTV footage when the aircraft was approximately 60ft above ground level,\" Mr Singh said. \"This suggests that the dual engine failure likely occurred before the official timestamp of 08:08:42 UTC, implying a possible discrepancy.\" Mr Singh said it was also \"of particular note\" that the plane's emergency locator transmitter (ELT) did not send any signal after the crash. \"Was the ELT damaged, unarmed, mis-wired, or malfunctioning?\" he said. The report has generated more questions than answers on topics including human error, power source failures and mechanical or electrical malfunction. The final report is expected to take a year. Meanwhile, families grapple with the unimaginable loss of loved ones in one of the worst disasters in India's aviation history."
    },
    {
        "title": "Donald Trump threatens to revoke Rosie O'Donnell's US citizenship",
        "description": "Donald Trump has said he is considering \"taking away\" the US citizenship of actress and comedian Rosie O'Donnell, despite a Supreme Court ruling that expressly prohibits a government from doing so.",
        "url": "https://news.sky.com/story/donald-trump-threatens-to-revoke-rosie-odonnells-us-citizenship-13395988",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6963725.jpg?20250712223157",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 21:24:00",
        "Headline": "O'Donnell responded to the US president's threat by posting a photograph of him with Jeffrey Epstein on Instagram.",
        "Content": "Donald Trump has said he is considering \"taking away\" the US citizenship of actress and comedian Rosie O'Donnell, despite a Supreme Court ruling that expressly prohibits a government from doing so. In a post on Truth Social on Saturday, the US president said: \"Because of the fact that Rosie O'Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship.\" He also labelled O'Donnell, who has moved to Ireland, as a \"threat to humanity\" and said she should \"remain in the wonderful country of Ireland, if they want her\". O'Donnell responded on Instagram by posting a photograph of Mr Trump with Jeffrey Epstein. \"You are everything that is wrong with America and I'm everything you hate about what's still right with it,\" she wrote in the caption. \"I'm not yours to silence. I never was.\" O'Donnell moved to Ireland with her 12-year-old son in January after Mr Trump had secured a second term. She has said she's in the process of obtaining Irish citizenship based on family lineage and that she would only return to the US \"when it is safe for all citizens to have equal rights there in America\". O'Donnell and the US president have criticised each other publicly for years, in an often-bitter back-and-forth that predates Mr Trump's move into politics.  This is just the latest threat by the president to revoke the citizenship of someone he has disagreed with, most recently his former ally Elon Musk. But the two situations are different as while Musk was born in South Africa, O'Donnell was born in the US and has a constitutional right to American citizenship. Read more from Sky News:Kate's 'emotional' words for tearful tennis starMusic festival cancelled as headliner pulls out Amanda Frost, a law professor at the University of Virginia School of Law, said the Supreme Court ruled in a 1967 case that the fourteenth amendment of the constitution prevents the government from taking away citizenship. \"The president has no authority to take away the citizenship of a native-born US citizen,\" he added. \"In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.\""
    },
    {
        "title": "Amanda Anisimova reveals 'emotional' words of comfort from Kate after crushing Wimbledon final defeat",
        "description": "Tennis star Amanda Anisimova has revealed the \"emotional\" words of comfort she received from the Princess of Wales after her crushing defeat in the Wimbledon women's singles final. ",
        "url": "https://news.sky.com/story/princess-of-wales-consoles-tearful-amanda-anisimova-after-crushing-wimbledon-final-defeat-13395834",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kate-princess-anisimova_6963700.jpg?20250712215202",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 14:14:00",
        "Headline": "Kate, who is patron of the All England Lawn Tennis Club, presented the prizes at the Wimbledon women's singles final on Saturday. ",
        "Content": "Tennis star Amanda Anisimova has revealed the \"emotional\" words of comfort she received from the Princess of Wales after her crushing defeat in the Wimbledon women's singles final.  Anisimova broke down in tears after the match and briefly left the court before returning for a TV interview and the trophy presentations. Kate, who is patron of the All England Lawn Tennis Club, handed the Wimbledon trophy to Polish player Iga Swiatek, who beat Anisimova 6-0, 6-0 in a match that lasted just 57 minutes.  The princess then consoled Anisimova as she collected her runner-up prize in her first Grand Slam final. Speaking after the match, the 23-year-old American player said Kate told her to \"keep (her) head high\". Anisimova said: \"I wasn't sure if she was going to come out today, if she was going to be there, so it's just really nice to see her. \"She definitely had a few things to say that were making me emotional again. \"She was really kind and she told me to keep my head high.\" Kate also spoke to ball boys and girls as she came on to Centre Court for the presentation. Prior to the final, the princess waved to crowds as she arrived at the championships in SW19. Kate shook hands with children, including 12-year-old Sophie Kneen, who performed the coin toss at the ladies' final. She also met Bob Flint, Wimbledon's longest serving honorary steward, and Ziying Wang, the champion of the ladies singles wheelchair final. It is unknown if the princess will be back at Wimbledon on Sunday when Carlos Alcaraz and Jannik Sinner go head-to-head for the men's singles final. Her arrival came shortly after British duo Julian Cash and Lloyd Glasspool made Wimbledon history by winning the men's doubles title for the first time in 89 years. The pair became the first all-British pair to win the title since Pat Hughes and Raymond Tuckey in 1936. Last year, Kate presented the Wimbledon men's final trophy to Alcaraz, in what was her second public engagement since she announced her cancer diagnosis. She watched the match between the current world number two and Novak Djokovic from the royal box with her daughter, Princess Charlotte. However, she missed the chance to present Barbora Krejcikova with the trophy after she defeated Jasmine Paolini at last year's women's singles final. Already this year, the Princess of Wales's parents, Carole and Michael Middleton, have been seen in the royal box, with the Duchess of Edinburgh and the Duchess of Gloucester also in attendance. Read more from Sky News:Scotland and Wales record their hottest days of the yearEleventh night bonfire lit on asbestos site criticised Earlier this week, Queen Camilla sat in Centre Court to watch Novak Djokovic in the tournament's quarter-finals. Famous faces in the royal box at this year's Wimbledon have included Leonardo DiCaprio, Dame Anna Wintour, Sir Mo Farah and Ellie Goulding."
    },
    {
        "title": "BST Hyde Park's final day cancelled as Jeff Lynne's ELO pulls out of headline slot",
        "description": "BST Hyde Park festival has cancelled its final night after Jeff Lynne's Electric Light Orchestra pulled out of the headline slot. ",
        "url": "https://news.sky.com/story/bst-hyde-parks-final-day-cancelled-as-jeff-lynnes-elo-pulls-out-of-headline-slot-13395959",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lynne-elo_6963675.jpg?20250712210640",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 19:59:00",
        "Headline": "ELO frontman Jeff Lynne has been forced to pull out of the gig on the advice of doctors. ",
        "Content": "BST Hyde Park festival has cancelled its final night after Jeff Lynne's Electric Light Orchestra pulled out of the headline slot.  Lynne, 77, was due to play alongside his band on Sunday but has been forced to withdraw from the event following a \"systemic infection\". The London show was supposed to be a \"final goodbye\" from ELO following their farewell US tour. Organisers said on Saturday that Lynne was \"heartbroken\" at being unable to perform. A statement read: \"Jeff has been battling a systemic infection and is currently in the care of a team of doctors who have advised him that performing is simply not possible at this time nor will he be able to reschedule. \"The legacy of the band and his longtime fans are foremost in Jeff's mind today - and while he is so sorry that he cannot perform, he knows that he must focus on his health and rehabilitation at this time.\" They later confirmed the whole of Sunday's event would be cancelled. \"Ticket holders will be refunded and contacted directly by their ticket agent with further details,\" another statement said. Stevie Wonder played the festival on Saturday - now its final event of 2025. Read more from Sky News:Scotland, Wales and Northern Ireland record hottest days of yearTennis star in tears after Wimbledon final drubbing  US rock band The Doobie Brothers and blues rock singer Steve Winwood were among those who had been due to perform to before ELO's headline performance. The cancellation comes after the band, best known for their hit Mr Blue Sky, pulled out of a performance due to take place at Manchester's Co-Op Live Arena on Thursday. ELO was formed in Birmingham in 1970 by Lynne, multi-instrumentalist Roy Wood and drummer Bev Bevan. They first split in 1986, before frontman Lynne resurrected the band in 2014."
    },
    {
        "title": "Police hunt four people who fled from Mercedes after fatal M40 crash",
        "description": "Police are trying to locate four people who got out of a Mercedes car and ran off after it was involved in a motorway crash that left a man dead.",
        "url": "https://news.sky.com/story/police-hunt-four-people-who-fled-from-mercedes-after-fatal-m40-crash-13395968",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-m40-motorway_6963685.jpg?20250712212448",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 20:25:00",
        "Headline": "A 27-year-old man who was driving a Volkswagen Golf died after the collision on the M40 in the early hours of Saturday.",
        "Content": "Police are trying to locate four people who got out of a Mercedes car and ran off after it was involved in a motorway crash that left a man dead. The vehicle was travelling northbound on the M40 when it was involved in a collision with a black Volkswagen Golf that was travelling in the same direction just before 1.15am on Saturday. Thames Valley Police has said the driver of the Volkswagen, a 27-year-old man from High Wycombe, died of his injuries. The force added that his passenger, a man in his 20s, sustained serious but non life-threatening injuries and has been taken to hospital. A 26-year-old man from Beaconsfield has been arrested on suspicion of causing death by dangerous driving and possession of a knife blade/sharp pointed article in a public place. He remains in custody. However, police are still trying to locate two men and two women who got out of the blue Mercedes and left the scene on foot. Police are appealing for witnesses and dashcam footage following the collision near junction two. Read more UK news:Scotland and Wales record hottest days of yearTwo men in court over care home crash Detective Sergeant Edward Crofts said some witnesses had reported seeing the Mercedes AMG C250 being \"driven erratically\". He said: \"Tragically, as a result of this collision, a man has died of his injuries. His next of kin are aware and are being supported by specially trained family liaison officers. \"Four people in the Mercedes left the scene of the collision and work is ongoing to identify and locate these individuals. \"I am appealing to anybody who was driving on that stretch of the M40 in the early hours of this morning and witnessed the collision to please get in touch with Thames Valley Police.\""
    },
    {
        "title": "Scotland, Wales and Northern Ireland record hottest days of the year as UK-wide heatwave peaks",
        "description": "Scotland, Wales and Northern Ireland recorded their hottest day of the year so far, as the third heatwave of the summer hit its peak on Saturday. ",
        "url": "https://news.sky.com/story/scotland-and-wales-record-their-hottest-days-of-the-year-as-uk-wide-heatwave-peaks-13395663",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-folkestone-weather_6963417.jpg?20250712163850",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 02:54:00",
        "Headline": "England was the only country in the UK to not exceed its highest temperature of 2025 so far on Saturday. ",
        "Content": " Scotland, Wales and Northern Ireland recorded their hottest day of the year so far, as the third heatwave of the summer hit its peak on Saturday.  Temperatures hit 32.2C in Aviemore in Scotland, while in Wales, a high of 33.1C was recorded at Cardiff's Bute Park. In Northern Ireland, 30C was recorded in Magilligan, County Londonderry. Temperatures across England were in the high 20s and low 30s, but not quite hot enough to break the country's record for 2025, which remains at 35.8C recorded in Kent at the beginning of July. Check the latest weather forecast here  The UK is currently experiencing its third heatwave of the year, and amber heat health alerts are in place for the Midlands and southern and eastern England until 9am on Monday. The alert warns of a potential rise in deaths, particularly among those aged 65 and over or with health conditions. Fire chiefs have warned people to stay safe, while cautioning of the increased risks of wildfires and drowning during the heatwave.  The National Fire Chiefs Council (NFCC) asked people not to enter water to try to cool down and urged parents and carers to ensure children are supervised around water at all times. HM Coastguard also issued safety advice for people heading to the coast, saying data from the water incident database shows over the last three years most drownings occurred in July. While today is expected to be the hottest day of the weekend, it will remain \"very warm\" across the country on Sunday, the Met Office said. Read more:What July's weather has in storeWhat you need to know about the hosepipe bans \"We're probably looking at maximum temperatures around 30C, 31C degrees across central and southern England, but still widely across the whole UK, mid to high 20s,\" meteorologist Greg Dewhurst said. \"It could still get to around 29 or 30C across southeast England on Monday, and then everyone into the fresher air by Tuesday, temperatures more like 23C, 24C as the maximum temperature.\" In addition to the amber alerts, the UK Health Security Agency also has yellow alerts in place until Monday for the North East, North West, and Yorkshire and Humber. On Friday, Yorkshire Water brought in hosepipe restrictions, as part of efforts to protect supplies in the face of further dry weather forecast for the coming weeks. It means customers in Kent and Sussex are banned from using a hosepipe to water gardens and plants, clean vehicles, fill swimming pool or ponds or to clean paths, walls or windows, with anyone ignoring the ban potentially facing fines of up to £1,000."
    },
    {
        "title": "More than 70 arrests at protests over Palestine Action ban",
        "description": "More than 70 people have been arrested at protests against Palestine Action being designated a proscribed terrorist group. ",
        "url": "https://news.sky.com/story/more-than-70-arrests-at-protests-over-palestine-action-ban-13395938",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-protest_6963654.jpg?20250712200240",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-12 18:35:00",
        "Headline": "Demonstrations are held in London, Manchester, Cardiff and Leeds over the group being added to a list of proscribed terrorist groups.",
        "Content": "More than 70 people have been arrested at protests against Palestine Action being designated a proscribed terrorist group.  Protesters gathered for the second week in a row in central London, where the Metropolitan Police made 42 arrests. Other demonstrations took place around the UK, including in Manchester, where police said 16 arrests were made, in Cardiff, where South Wales Police arrested 13 people, and in Leeds, where West Yorkshire Police made one arrest. In London, two groups of protesters gathered underneath statues of Mahatma Gandhi and Nelson Mandela in Parliament Square, shortly before 1pm. They wrote the message \"I oppose genocide, I support Palestine Action\" on pieces of cardboard and silently held the signs in the air as they were surrounded by police officers and members of the media. Some demonstrators could be seen lying on top of each other on the floor as police searched their bags, and took their ID cards and signs. Officers then carried away a number of protesters, lifting them off the ground and into waiting police vans. The last protester was lifted from the Nelson Mandela statue shortly after 2.30pm. Forty-one of the 42 arrests at the London protest were for showing support for a proscribed organisation, while one person was arrested for common assault, the Met Police said. Read more:Palestine Action has been proscribed - but what does that mean? Palestine Action's terror group designation means membership of, or support for, the group is a criminal offence punishable by up to 14 years in prison. Greater Manchester Police said it had arrested 16 people under the Terrorism Act 2000 after responding to a protest in St Peter's Square at around 2.30pm. South Wales Police confirmed 13 people were arrested on suspicion of offences under the same act in the vicinity of Central Square in Cardiff. West Yorkshire Police said a person was arrested in Leeds on suspicion of demonstrating support for Palestine Action. The Met Police arrested 29 people at a similar protest last weekend. Read more from Sky News:Tennis star in tears after crushing Wimbledon defeatCare whistleblower could face removal from Britain Scotland Yard has said its stance remains that officers will act where criminal offences, including support of proscribed groups or organisations, are committed. It added that this includes \"chanting, wearing clothing or displaying articles such as flags, signs or logos\". The move to ban Palestine Action came after two aircraft were damaged at RAF Brize Norton in Oxfordshire last month. Police said the incident caused around £7m worth of damage."
    },
    {
        "title": "Nearly two-thirds of UK workers turning to drink because of job pressures, survey says",
        "description": "Some 64% of UK workers drink alcohol for work-related reasons, according to a survey.",
        "url": "https://news.sky.com/story/nearly-two-thirds-of-uk-workers-turning-to-drink-because-of-job-pressures-survey-says-13395997",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-alcohol-beer_6963749.jpg?20250713002602",
        "type": "Home",
        "Author": "Oliver Whitfield Miocic, news correspondent",
        "Date Published": "2025-07-12 23:01:00",
        "Headline": "Job stress, pressure and anxiety led employees to drink more over the past year, according to Alcohol Change UK.",
        "Content": "By Oliver Whitfield Miocic, news correspondent   Some 64% of UK workers drink alcohol for work-related reasons, according to a survey. It's not just colleagues having a few pints at the end of the business day. Job stress, pressure and anxiety led employees to drink more over the past year, according to Alcohol Change UK. The research also found one in five workers drinks to deal with deadlines, while nearly 10% feel pressured to drink by their boss or colleagues. The charity now wants employers to move away from alcohol-based team building and social events so everyone can feel included. Jane Gardiner from Alcohol Change UK told Sky News: \"We're not saying don't go to the pub, don't have after-work drinks, but try to be more inclusive and create sort of healthier, more inclusive workplaces, recognising that not everyone does drink for a variety of different reasons.\" Patrick Fox is a former city banker who gave up alcohol in 2018 after years of drunken nights out. He told Sky News his colleagues would often pressure him to drink, and he ended up prioritising going out over his romantic relationship. \"I'd be going out drinking on a Thursday and Friday after work. That would probably continue into the weekend. So come Sunday afternoon I'd be feeling pretty terrible and dreading going to work on a Monday,\" he said. He added: \"There's so many different businesses out there where alcohol is the focal point a lot of the time at team building exercises, so there is a pressure to be a part of that.\" Read more from Sky News:Low-level drinkers 'have increased cancer and cardiovascular risk'Alcohol-related deaths hit record high Employee absence due to work-related drinking is estimated to cost England's economy £4bn per year. However, the number of adults drinking alcohol has decreased in recent years. According to the latest data, 56% of adults reported having an alcoholic drink in 2022, down from 61% in 2012. Generation Z has markedly turned away from booze, abstinence periods like Dry January have become more mainstream, and there has been a proliferation of no or low alcohol alternatives.  Dhati Holohan, sales director at Asahi UK, told Sky News: \"What we are seeing is over 40% of adults in the UK are looking to moderate their alcohol consumption.\" One way drinkers are doing that is by switching in soft drinks. Ms Holohan added: \"We are calling that zebra striping. So alternating alcoholic drinks with non-alcoholic drinks. One in three adults in the UK are actually using that as a way to pace their consumption.\""
    },
    {
        "title": "Police hunt four people who fled from Mercedes after fatal M40 crash",
        "description": "Police are trying to locate four people who got out of a Mercedes car and ran off after it was involved in a motorway crash that left a man dead.",
        "url": "https://news.sky.com/story/police-hunt-four-people-who-fled-from-mercedes-after-fatal-m40-crash-13395968",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-m40-motorway_6963685.jpg?20250712212448",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-12 20:25:00",
        "Headline": "A 27-year-old man who was driving a Volkswagen Golf died after the collision on the M40 in the early hours of Saturday.",
        "Content": "Police are trying to locate four people who got out of a Mercedes car and ran off after it was involved in a motorway crash that left a man dead. The vehicle was travelling northbound on the M40 when it was involved in a collision with a black Volkswagen Golf that was travelling in the same direction just before 1.15am on Saturday. Thames Valley Police has said the driver of the Volkswagen, a 27-year-old man from High Wycombe, died of his injuries. The force added that his passenger, a man in his 20s, sustained serious but non life-threatening injuries and has been taken to hospital. A 26-year-old man from Beaconsfield has been arrested on suspicion of causing death by dangerous driving and possession of a knife blade/sharp pointed article in a public place. He remains in custody. However, police are still trying to locate two men and two women who got out of the blue Mercedes and left the scene on foot. Police are appealing for witnesses and dashcam footage following the collision near junction two. Read more UK news:Scotland and Wales record hottest days of yearTwo men in court over care home crash Detective Sergeant Edward Crofts said some witnesses had reported seeing the Mercedes AMG C250 being \"driven erratically\". He said: \"Tragically, as a result of this collision, a man has died of his injuries. His next of kin are aware and are being supported by specially trained family liaison officers. \"Four people in the Mercedes left the scene of the collision and work is ongoing to identify and locate these individuals. \"I am appealing to anybody who was driving on that stretch of the M40 in the early hours of this morning and witnessed the collision to please get in touch with Thames Valley Police.\""
    },
    {
        "title": "Amanda Anisimova reveals 'emotional' words of comfort from Kate after crushing Wimbledon final defeat",
        "description": "Tennis star Amanda Anisimova has revealed the \"emotional\" words of comfort she received from the Princess of Wales after her crushing defeat in the Wimbledon women's singles final. ",
        "url": "https://news.sky.com/story/princess-of-wales-consoles-tearful-amanda-anisimova-after-crushing-wimbledon-final-defeat-13395834",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-kate-princess-anisimova_6963700.jpg?20250712215202",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-12 14:14:00",
        "Headline": "Kate, who is patron of the All England Lawn Tennis Club, presented the prizes at the Wimbledon women's singles final on Saturday. ",
        "Content": "Tennis star Amanda Anisimova has revealed the \"emotional\" words of comfort she received from the Princess of Wales after her crushing defeat in the Wimbledon women's singles final.  Anisimova broke down in tears after the match and briefly left the court before returning for a TV interview and the trophy presentations. Kate, who is patron of the All England Lawn Tennis Club, handed the Wimbledon trophy to Polish player Iga Swiatek, who beat Anisimova 6-0, 6-0 in a match that lasted just 57 minutes.  The princess then consoled Anisimova as she collected her runner-up prize in her first Grand Slam final. Speaking after the match, the 23-year-old American player said Kate told her to \"keep (her) head high\". Anisimova said: \"I wasn't sure if she was going to come out today, if she was going to be there, so it's just really nice to see her. \"She definitely had a few things to say that were making me emotional again. \"She was really kind and she told me to keep my head high.\" Kate also spoke to ball boys and girls as she came on to Centre Court for the presentation. Prior to the final, the princess waved to crowds as she arrived at the championships in SW19. Kate shook hands with children, including 12-year-old Sophie Kneen, who performed the coin toss at the ladies' final. She also met Bob Flint, Wimbledon's longest serving honorary steward, and Ziying Wang, the champion of the ladies singles wheelchair final. It is unknown if the princess will be back at Wimbledon on Sunday when Carlos Alcaraz and Jannik Sinner go head-to-head for the men's singles final. Her arrival came shortly after British duo Julian Cash and Lloyd Glasspool made Wimbledon history by winning the men's doubles title for the first time in 89 years. The pair became the first all-British pair to win the title since Pat Hughes and Raymond Tuckey in 1936. Last year, Kate presented the Wimbledon men's final trophy to Alcaraz, in what was her second public engagement since she announced her cancer diagnosis. She watched the match between the current world number two and Novak Djokovic from the royal box with her daughter, Princess Charlotte. However, she missed the chance to present Barbora Krejcikova with the trophy after she defeated Jasmine Paolini at last year's women's singles final. Already this year, the Princess of Wales's parents, Carole and Michael Middleton, have been seen in the royal box, with the Duchess of Edinburgh and the Duchess of Gloucester also in attendance. Read more from Sky News:Scotland and Wales record their hottest days of the yearEleventh night bonfire lit on asbestos site criticised Earlier this week, Queen Camilla sat in Centre Court to watch Novak Djokovic in the tournament's quarter-finals. Famous faces in the royal box at this year's Wimbledon have included Leonardo DiCaprio, Dame Anna Wintour, Sir Mo Farah and Ellie Goulding."
    },
    {
        "title": "Nearly two-thirds of UK workers turning to drink because of job pressures, survey says",
        "description": "Some 64% of UK workers drink alcohol for work-related reasons, according to a survey.",
        "url": "https://news.sky.com/story/nearly-two-thirds-of-uk-workers-turning-to-drink-because-of-job-pressures-survey-says-13395997",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-alcohol-beer_6963749.jpg?20250713002602",
        "type": "UK",
        "Author": "Oliver Whitfield Miocic, news correspondent",
        "Date Published": "2025-07-12 23:01:00",
        "Headline": "Job stress, pressure and anxiety led employees to drink more over the past year, according to Alcohol Change UK.",
        "Content": "By Oliver Whitfield Miocic, news correspondent   Some 64% of UK workers drink alcohol for work-related reasons, according to a survey. It's not just colleagues having a few pints at the end of the business day. Job stress, pressure and anxiety led employees to drink more over the past year, according to Alcohol Change UK. The research also found one in five workers drinks to deal with deadlines, while nearly 10% feel pressured to drink by their boss or colleagues. The charity now wants employers to move away from alcohol-based team building and social events so everyone can feel included. Jane Gardiner from Alcohol Change UK told Sky News: \"We're not saying don't go to the pub, don't have after-work drinks, but try to be more inclusive and create sort of healthier, more inclusive workplaces, recognising that not everyone does drink for a variety of different reasons.\" Patrick Fox is a former city banker who gave up alcohol in 2018 after years of drunken nights out. He told Sky News his colleagues would often pressure him to drink, and he ended up prioritising going out over his romantic relationship. \"I'd be going out drinking on a Thursday and Friday after work. That would probably continue into the weekend. So come Sunday afternoon I'd be feeling pretty terrible and dreading going to work on a Monday,\" he said. He added: \"There's so many different businesses out there where alcohol is the focal point a lot of the time at team building exercises, so there is a pressure to be a part of that.\" Read more from Sky News:Low-level drinkers 'have increased cancer and cardiovascular risk'Alcohol-related deaths hit record high Employee absence due to work-related drinking is estimated to cost England's economy £4bn per year. However, the number of adults drinking alcohol has decreased in recent years. According to the latest data, 56% of adults reported having an alcoholic drink in 2022, down from 61% in 2012. Generation Z has markedly turned away from booze, abstinence periods like Dry January have become more mainstream, and there has been a proliferation of no or low alcohol alternatives.  Dhati Holohan, sales director at Asahi UK, told Sky News: \"What we are seeing is over 40% of adults in the UK are looking to moderate their alcohol consumption.\" One way drinkers are doing that is by switching in soft drinks. Ms Holohan added: \"We are calling that zebra striping. So alternating alcoholic drinks with non-alcoholic drinks. One in three adults in the UK are actually using that as a way to pace their consumption.\""
    },
    {
        "title": "Scotland, Wales and Northern Ireland record hottest days of the year as UK-wide heatwave peaks",
        "description": "Scotland, Wales and Northern Ireland recorded their hottest day of the year so far, as the third heatwave of the summer hit its peak on Saturday. ",
        "url": "https://news.sky.com/story/scotland-and-wales-record-their-hottest-days-of-the-year-as-uk-wide-heatwave-peaks-13395663",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-folkestone-weather_6963417.jpg?20250712163850",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-12 02:54:00",
        "Headline": "England was the only country in the UK to not exceed its highest temperature of 2025 so far on Saturday. ",
        "Content": " Scotland, Wales and Northern Ireland recorded their hottest day of the year so far, as the third heatwave of the summer hit its peak on Saturday.  Temperatures hit 32.2C in Aviemore in Scotland, while in Wales, a high of 33.1C was recorded at Cardiff's Bute Park. In Northern Ireland, 30C was recorded in Magilligan, County Londonderry. Temperatures across England were in the high 20s and low 30s, but not quite hot enough to break the country's record for 2025, which remains at 35.8C recorded in Kent at the beginning of July. Check the latest weather forecast here  The UK is currently experiencing its third heatwave of the year, and amber heat health alerts are in place for the Midlands and southern and eastern England until 9am on Monday. The alert warns of a potential rise in deaths, particularly among those aged 65 and over or with health conditions. Fire chiefs have warned people to stay safe, while cautioning of the increased risks of wildfires and drowning during the heatwave.  The National Fire Chiefs Council (NFCC) asked people not to enter water to try to cool down and urged parents and carers to ensure children are supervised around water at all times. HM Coastguard also issued safety advice for people heading to the coast, saying data from the water incident database shows over the last three years most drownings occurred in July. While today is expected to be the hottest day of the weekend, it will remain \"very warm\" across the country on Sunday, the Met Office said. Read more:What July's weather has in storeWhat you need to know about the hosepipe bans \"We're probably looking at maximum temperatures around 30C, 31C degrees across central and southern England, but still widely across the whole UK, mid to high 20s,\" meteorologist Greg Dewhurst said. \"It could still get to around 29 or 30C across southeast England on Monday, and then everyone into the fresher air by Tuesday, temperatures more like 23C, 24C as the maximum temperature.\" In addition to the amber alerts, the UK Health Security Agency also has yellow alerts in place until Monday for the North East, North West, and Yorkshire and Humber. On Friday, Yorkshire Water brought in hosepipe restrictions, as part of efforts to protect supplies in the face of further dry weather forecast for the coming weeks. It means customers in Kent and Sussex are banned from using a hosepipe to water gardens and plants, clean vehicles, fill swimming pool or ponds or to clean paths, walls or windows, with anyone ignoring the ban potentially facing fines of up to £1,000."
    },
    {
        "title": "BST Hyde Park's final day cancelled as Jeff Lynne's ELO pulls out of headline slot",
        "description": "BST Hyde Park festival has cancelled its final night after Jeff Lynne's Electric Light Orchestra pulled out of the headline slot. ",
        "url": "https://news.sky.com/story/bst-hyde-parks-final-day-cancelled-as-jeff-lynnes-elo-pulls-out-of-headline-slot-13395959",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lynne-elo_6963675.jpg?20250712210640",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-12 19:59:00",
        "Headline": "ELO frontman Jeff Lynne has been forced to pull out of the gig on the advice of doctors. ",
        "Content": "BST Hyde Park festival has cancelled its final night after Jeff Lynne's Electric Light Orchestra pulled out of the headline slot.  Lynne, 77, was due to play alongside his band on Sunday but has been forced to withdraw from the event following a \"systemic infection\". The London show was supposed to be a \"final goodbye\" from ELO following their farewell US tour. Organisers said on Saturday that Lynne was \"heartbroken\" at being unable to perform. A statement read: \"Jeff has been battling a systemic infection and is currently in the care of a team of doctors who have advised him that performing is simply not possible at this time nor will he be able to reschedule. \"The legacy of the band and his longtime fans are foremost in Jeff's mind today - and while he is so sorry that he cannot perform, he knows that he must focus on his health and rehabilitation at this time.\" They later confirmed the whole of Sunday's event would be cancelled. \"Ticket holders will be refunded and contacted directly by their ticket agent with further details,\" another statement said. Stevie Wonder played the festival on Saturday - now its final event of 2025. Read more from Sky News:Scotland, Wales and Northern Ireland record hottest days of yearTennis star in tears after Wimbledon final drubbing  US rock band The Doobie Brothers and blues rock singer Steve Winwood were among those who had been due to perform to before ELO's headline performance. The cancellation comes after the band, best known for their hit Mr Blue Sky, pulled out of a performance due to take place at Manchester's Co-Op Live Arena on Thursday. ELO was formed in Birmingham in 1970 by Lynne, multi-instrumentalist Roy Wood and drummer Bev Bevan. They first split in 1986, before frontman Lynne resurrected the band in 2014."
    },
    {
        "title": "More than 70 arrests at protests over Palestine Action ban",
        "description": "More than 70 people have been arrested at protests against Palestine Action being designated a proscribed terrorist group. ",
        "url": "https://news.sky.com/story/more-than-70-arrests-at-protests-over-palestine-action-ban-13395938",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-protest_6963654.jpg?20250712200240",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-12 18:35:00",
        "Headline": "Demonstrations are held in London, Manchester, Cardiff and Leeds over the group being added to a list of proscribed terrorist groups.",
        "Content": "More than 70 people have been arrested at protests against Palestine Action being designated a proscribed terrorist group.  Protesters gathered for the second week in a row in central London, where the Metropolitan Police made 42 arrests. Other demonstrations took place around the UK, including in Manchester, where police said 16 arrests were made, in Cardiff, where South Wales Police arrested 13 people, and in Leeds, where West Yorkshire Police made one arrest. In London, two groups of protesters gathered underneath statues of Mahatma Gandhi and Nelson Mandela in Parliament Square, shortly before 1pm. They wrote the message \"I oppose genocide, I support Palestine Action\" on pieces of cardboard and silently held the signs in the air as they were surrounded by police officers and members of the media. Some demonstrators could be seen lying on top of each other on the floor as police searched their bags, and took their ID cards and signs. Officers then carried away a number of protesters, lifting them off the ground and into waiting police vans. The last protester was lifted from the Nelson Mandela statue shortly after 2.30pm. Forty-one of the 42 arrests at the London protest were for showing support for a proscribed organisation, while one person was arrested for common assault, the Met Police said. Read more:Palestine Action has been proscribed - but what does that mean? Palestine Action's terror group designation means membership of, or support for, the group is a criminal offence punishable by up to 14 years in prison. Greater Manchester Police said it had arrested 16 people under the Terrorism Act 2000 after responding to a protest in St Peter's Square at around 2.30pm. South Wales Police confirmed 13 people were arrested on suspicion of offences under the same act in the vicinity of Central Square in Cardiff. West Yorkshire Police said a person was arrested in Leeds on suspicion of demonstrating support for Palestine Action. The Met Police arrested 29 people at a similar protest last weekend. Read more from Sky News:Tennis star in tears after crushing Wimbledon defeatCare whistleblower could face removal from Britain Scotland Yard has said its stance remains that officers will act where criminal offences, including support of proscribed groups or organisations, are committed. It added that this includes \"chanting, wearing clothing or displaying articles such as flags, signs or logos\". The move to ban Palestine Action came after two aircraft were damaged at RAF Brize Norton in Oxfordshire last month. Police said the incident caused around £7m worth of damage."
    },
    {
        "title": "Man charged with murder of five-month-old baby in Wales",
        "description": "A man has been charged with the murder of a five-month-old baby in Wales.",
        "url": "https://news.sky.com/story/man-charged-with-murder-of-five-month-old-baby-in-wales-13395774",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-jensen-lee-dougal-baby_6963516.jpg?20250712162917",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-12 11:32:00",
        "Headline": "Thomas Morgan has appeared in court over the death of Jensen-Lee Dougal who died in Clydach on 30 March last year.",
        "Content": "A man has been charged with the murder of a five-month-old baby in Wales. Thomas Morgan, 28, appeared at Swansea Magistrates' Court on Friday over the death of Jensen-Lee Dougal in Clydach on 30 March last year. Morgan, of Gorseinon, Swansea, was remanded in custody, South Wales Police said. He is due to appear at Swansea Crown Court on Monday. Read more UK news:Scotland and Wales record hottest days of year'I've ditched wine for LEGO'Two men in court over care home crash"
    },
    {
        "title": "Michael Frison: Mother of British man missing in Sardinia describes 'never-ending nightmare'",
        "description": "The mother of a British man who has gone missing on Sardinia says she is living a \"never-ending nightmare\" - and has called for Interpol to intervene. ",
        "url": "https://news.sky.com/story/michael-frison-mother-of-british-man-missing-in-sardinia-describes-never-ending-nightmare-13395712",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-frison-mum_6963275.jpg?20250712144725",
        "type": "UK",
        "Author": "Claire Gilbody-Dickerson",
        "Date Published": "2025-07-12 08:11:00",
        "Headline": "Cristina Pittalis tells Sky News she has been \"broken\" since her 26-year-old son disappeared on the Italian island, adding: \"I'm trying not to lose my mind.\"",
        "Content": "\n          Reporter\n              @ClaireGilbodyD\n The mother of a British man who has gone missing on Sardinia says she is living a \"never-ending nightmare\" - and has called for Interpol to intervene.  Cristina Pittalis told Sky News she has been \"broken\" since her 26-year-old son Michael Frison disappeared in the northwest of the Italian island on 13 July 2024. \"I'm trying not to lose my mind,\" said Ms Pittalis as she recounted the last time she heard her son's voice. \"He was in a rush but absolutely clear in his speech, I didn't detect any confusion in his state of mind.\" The mother-of-two from Somerset added: \"Human beings do not disappear from the face of earth without leaving traces unless […] something extremely bad happened to them.\" Mr Frison went missing the day after he arrived on a farm where he was meant to do volunteer work. He reportedly went for a walk and returned in a state of confusion and symptoms of heatstroke. He then went on a second walk and never returned. His clothes, including his trainers, were found nearby. His mother believes it would have been \"completely out of character\" for her son to wander off barefoot and leave all his personal belongings behind. She also said it was \"extremely unlikely\" he suffered a heatstroke as he had previously lived on the island and was used to its climate. Ms Pittalis, who has moved to Sardinia with her other 11-year-old son in a bid to find Mr Frison, said she was \"extremely worried because there are no traces of Michael\". Read more from Sky News:Fear in town where more than 200 children poisonedFuel to engines of doomed Air India plane 'cut off moments after take-off' She said \"during the past 12 months, the area was constantly searched, through woodland, caves, mountains\" but there was \"absolutely nothing\". Ms Pittalis is originally from Sassari in the northwest of Sardinia but had lived in the UK since 1966 until she moved to Sardinia following her son's disappearance. A local criminal investigation launched into Mr Frison's disappearance is ongoing, but Ms Pittalis has called for Interpol - the international crime-fighting organisation - to step in to try to find her son. \"It's a never-ending nightmare,\" she said. \"There's no real accountability... I am here and I am broken.\" She is also calling for a woman from Jersey, who was with Mr Frison in the days before his disappearance, to come forward with any information she may have. Ms Pittalis spoke of the toll that Mr Frison's disappearance has taken on his younger half-brother Emanuele, whose father died in 2017. \"He's devastated,\" she said. \"The three of us were extremely close, the two of them, they used to do everything together. \"For Mani [Emanuele] it's horrible, he lost his father and now he lost his brother.\" Interpol has been approached for comment."
    },
    {
        "title": "'At least 59 killed' in Gaza after Israeli military opens fire near aid centre and carries out strikes",
        "description": "At least 59 Palestinians have reportedly been killed after the Israeli military opened fire near an aid centre in Gaza and carried out strikes across the territory.",
        "url": "https://news.sky.com/story/at-least-59-killed-after-israeli-military-opens-fire-near-gaza-aid-centre-and-carries-out-strikes-13395908",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rafah-aid_6963621.jpg?20250712183330",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-12 16:51:00",
        "Headline": "A woman tells Sky News her son was killed after being shot dead near an aid centre - as the IDF says it fired \"warning shots\" but is not aware of any injuries.",
        "Content": " At least 59 Palestinians have reportedly been killed after the Israeli military opened fire near an aid centre in Gaza and carried out strikes across the territory. The Red Cross, which operates a field hospital in Rafah, said 25 people were \"declared dead upon arrival\" and \"six more died after admittance\" following gunfire near an aid distribution centre in the southern Gazan city. The humanitarian organisation added that it also received 132 patients \"suffering from weapon-related injuries\" after the incident. The Red Cross said: \"The overwhelming majority of these patients sustained gunshot wounds, and all responsive individuals reported they were attempting to access food distribution sites.\" The organisation said the number of deaths marks the hospital's \"largest influx of fatalities\" since it began operations in May last year. The Israel Defence Forces (IDF) has said it fired \"warning shots\" near the aid distribution site but it was \"not aware of injured individuals\" as a result. It said in a statement: \"Earlier today, several suspects were identified approaching IDF troops operating in the Rafah area, posing a threat to the troops, hundreds of metres from the aid distribution site. \"IDF troops operated in order to prevent the suspects from approaching them and fired warning shots.\" Mother's despair over shooting Somia Alshaar told Sky News her 17-year-old son Nasir was shot dead while visiting the aid centre after she told him not to go. She said: \"He went to get us tahini so we could eat. \"He went to get flour. He told me 'mama, we don't have tahini. Today I'll bring you flour. Even if it kills me, I will get you flour'. \"He left the house and didn't return. They told me at the hospital: your son...'Oh God, oh Lord'.\" Asked where her son was shot, she replied: \"In the chest. Yes, in the chest.\" 'A policy of mass murder' Hassan Omran, a paramedic with Gaza's ministry of health, told Sky News after the incident that humanitarian aid centres in Gaza are now \"centres of mass death\". Speaking in Khan Younis, he said: \"Today, there were more than 150 injuries and more than 20 martyrs at the aid distribution centres... the Israeli occupation deliberately kills and commits genocide. The Israeli occupation is carrying out a policy of mass murder. \"They call people to come get their daily food, and then, when citizens arrive at these centres, they are killed in cold blood. \"All the victims have gunshot wounds to the head and chest, meaning the enemy is committing these crimes deliberately.\" Israel has rejected genocide accusations and denies targeting civilians. 'Lies being peddled' The Gaza Humanitarian Foundation (GHF), the controversial US and Israeli-backed group which operates the distribution centre near Rafah, said: \"Hamas is claiming there was violence at our aid distribution sites today. False. \"Once again, there were no incidents at or in the immediate vicinity of our sites. \"But that's not stopping some from spreading the lies being peddled by 'officials' at the Hamas-controlled Nasser Hospital.\" The Red Cross said its field hospital in Rafah has recorded more than 250 fatalities and treated more than 3,400 \"weapon-wounded patients\" since new food distribution sites were set up in Gaza on 27 May. Read more:'At least 798 killed' at Gaza aid points'10 children killed' waiting for Gaza health clinic to openIsrael says permanent ceasefire 'questionable' It comes after four children and two women were among at least 13 people who died in Deir al Balah, in central Gaza, after Israeli strikes pounded the area starting late on Friday, officials in Al Aqsa Martyrs hospital in the territory said. Fifteen others died in Israeli airstrikes in Khan Younis, in southern Gaza, according to Nasser Hospital. The IDF has not responded to a request for comment on the reported deaths. Israel has been carrying out attacks in Gaza since Hamas-led militants killed some 1,200 people and took 251 hostages on 7 October 2023. Hamas still holds 50 hostages, with fewer than half of them believed to be alive, after most of the rest were released in ceasefire agreements or other deals. Israel's offensive in Gaza has killed more than 57,000 Palestinians, more than half of them women and children, according to Gaza's health ministry, which does not distinguish between civilians and combatants in its count. US President Donald Trump has said he is closing in on another ceasefire agreement that would see more hostages released and potentially wind down the war. But after two days of talks this week with Israeli Prime Minister Benjamin Netanyahu, there were no signs of a breakthrough. Palestinian-US man 'beaten to death' The latest fatalities in Gaza come as a 20-year-old Palestinian-American man was beaten to death by settlers in the Israeli-occupied West Bank on Friday, the Palestinian health ministry said. Sayafollah Musallet, also known as Saif, was killed during a confrontation between Palestinians and settlers in Sinjil, north of Ramallah, the ministry said. A second man, 23-year-old Hussein Al-Shalabi, died after being shot in the chest, it added. Mr Musallet's family, from Tampa Florida, has called on the US state department to lead an \"immediate investigation\". A state department spokesperson said it was aware of the incident but it had no further comment \"out of respect for the privacy of the family and loved ones\" of the reported victim. The Israeli military said the confrontation broke out after Palestinians threw rocks at Israelis, lightly injuring them. It added that military said forces were dispatched to the scene and used non-lethal weapons to disperse the crowds."
    },
    {
        "title": "Backlash as Air India crash report points to possible human error - here's what experts think",
        "description": "As investigators continue to piece together the full picture, early findings of the Air India crash are pointing towards a critical area of concern &#8212; the aircraft&#8217;s fuel control switches. ",
        "url": "https://news.sky.com/story/backlash-as-air-india-crash-report-points-to-possible-human-error-heres-what-experts-think-13395845",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-air-india-ahmedabad_6940057.jpg?20250612115435",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-07-12 14:50:00",
        "Headline": "There has been a backlash over the findings in India, with some saying the report points to pilot error without much information and almost dismisses the possibility of a mechanical or electric failure.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  As investigators continue to piece together the full picture, early findings of the Air India crash are pointing towards a critical area of concern — the aircraft’s fuel control switches.  The flight, bound for London Gatwick, crashed just moments after taking off from Ahmedabad airport on 12 June, killing all but one of the 242 people on board the plane and at least 19 on the ground. According to the preliminary report by India's Aircraft Accident Investigation Bureau (AAIB), the two engine fuel control switches on the plane were moved from the \"RUN\" to \"CUTOFF\" position. These switches control fuel flow to the engines and should only be used when the aircraft is on ground, first to start the engines before a flight and later to shut them down at the gate. They are designed so they're unlikely to be changed accidentally, pointing to possible human error on the Air India flight. The findings include the final conversation between the pilots and show there was confusion in the cockpit as well. When one pilot asked the other why he cut off the fuel, he responded to say he did not do so. Moments later, a Mayday call was made from the cockpit, but the plane could not regain power quickly enough and plummeted to the ground. Captain Amit Singh, founder of Safety Matters Foundation, an organisation dedicated to aviation safety, told Sky News: \"This exchange indicates that the engine shutdowns were uncommanded. \"However, the report does not identify the cause - whether it was crew error, mechanical malfunction, or electronic failure.\" Previous warning of 'possible fuel switch issue' \"The Boeing 787 uses spring-loaded locking mechanisms on its fuel control switches to prevent accidental movement,\" Mr Singh explained. But a previous bulletin from the Federal Aviation Administration (FAA) \"warned that these switches might be installed with the locking feature disengaged,\" he said. This could \"make them susceptible to unintended movement due to vibration, contact, or quadrant flex\", he added. Speaking to Sky News, aviation expert Terry Tozner said: \"The take-off was normal, the aircraft rotated at the correct speed left the ground and almost immediately, the cut-off switches were selected to off, one then two. \"But nobody has said with any clarity whether or not the latch mechanisms worked okay on this particular aircraft. So we can only assume that they were in normal working order.\" In India, there has been a backlash over the findings, with some saying the report points to pilot error without much information and almost dismisses the possibility of a mechanical or electric failure. Indian government responds India's civil aviation minister Kinjarapu Ram Mohan Naidu has been quick to respond, saying: \"We care for the welfare and the wellbeing of pilots so let's not jump to any conclusions at this stage, let us wait for the final report. \"I believe we have the most wonderful workforce of pilots and crew in the whole world.\"  Both pilots were experienced, with around 19,000 flying hours between them, including more than 9,000 on Boeing 787s. The report says the aircraft maintenance checks were on schedule and that there are no signs of fuel contamination or a bird strike. So far, no safety recommendations have been issued to Boeing or General Electric, the engine manufacturers. Concern over destroyed flight recorder  Mr Singh said \"the survivability of the flight recorders also raises concern\". The plane's rear flight recorder, designed to withstand impact forces of 3,400 Gs and temperatures of 1,100C for 60 minutes, \"was damaged beyond recovery\". Read more:Everything you need to know about the crashAir India's lone survivor is nothing short of miracle \"The Ram Air Turbine (RAT), which deploys automatically when both engines fail and power drops below a threshold, was observed as deployed in CCTV footage when the aircraft was approximately 60ft above ground level,\" Mr Singh said. \"This suggests that the dual engine failure likely occurred before the official timestamp of 08:08:42 UTC, implying a possible discrepancy.\" Mr Singh said it was also \"of particular note\" that the plane's emergency locator transmitter (ELT) did not send any signal after the crash. \"Was the ELT damaged, unarmed, mis-wired, or malfunctioning?\" he said. The report has generated more questions than answers on topics including human error, power source failures and mechanical or electrical malfunction. The final report is expected to take a year. Meanwhile, families grapple with the unimaginable loss of loved ones in one of the worst disasters in India's aviation history."
    },
    {
        "title": "Donald Trump announces 30% tariff on imports from EU",
        "description": "Donald Trump has announced he will impose a 30% tariff on imports from the European Union from 1 August.",
        "url": "https://news.sky.com/story/donald-trump-announces-30-tariff-on-imports-from-eu-13395817",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6853911.jpg?20250312090340",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-12 13:21:00",
        "Headline": "European Commission president Ursula von der Leyen said the EU could adopt \"proportionate countermeasures\" if the tariff is imposed.",
        "Content": " Donald Trump has announced he will impose a 30% tariff on imports from the European Union from 1 August. The tariffs could make everything from French cheese and Italian leather goods to German electronics and Spanish pharmaceuticals more expensive in the US. Mr Trump has also imposed a 30% tariff on goods from Mexico, according to a post from his Truth Social account.Announcing the moves in separate letters posted on his account, the president said the US trade deficit was a national security threat. In his letter to the EU, he wrote: \"We have had years to discuss our trading relationship with The European Union, and we have concluded we must move away from these long-term, large, and persistent, trade Deficits, engendered by your tariff, and non-Tariff, policies, and trade barriers. \"Our relationship has been, unfortunately, far from reciprocal.\" In his letter to Mexico, Mr Trump said he did not think the country had done enough to stop the US from turning into a \"narco-trafficking playground\". The president of the European Commission, Ursula von der Leyen, said the EU could adopt \"proportionate countermeasures\" if the US proceeds with imposing the 30% tariff. Ms von der Leyen, who heads the EU's executive arm, said in a statement that the bloc remained ready \"to continue working towards an agreement by Aug 1\". \"Few economies in the world match the European Union's level of openness and adherence to fair trading practices,\" she added. \"We will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required.\" 'Very concerning' Ms von der Leyen has also said imposing tariffs on EU exports would \"disrupt essential transatlantic supply chains\". Meanwhile, Dutch Prime Minister Dick Schoof said on the X social media platform that Mr Trump's announcement was \"very concerning and not the way forward\". He added: \"The European Commission can count on our full support. As the EU we must remain united and resolute in pursuing an outcome with the United States that is mutually beneficial.\" Mexico's economy ministry said a bilateral working group aims to reach an alternative to the 30% US tariffs before they are due to take effect. The country was informed by the US that it would receive a letter about the tariffs, the ministry's statement said, adding that Mexico was negotiating. Read more US news:Trump plans to hit Canada with 35% tariffMore than 160 missing after Texas floodsRobot performs realistic surgery  Trump's tariff threats and delays On his so-called \"liberation day\" in April, Mr Trump unleashed \"reciprocal tariffs\" on many of America's trade partners. The US president said he was targeting countries with which America had a trade imbalance. However, since then he has backed down in a spiralling tit-for-tat tariff face-off with China, and struck a deal with the UK. The US imposed a 20% tariff on imported goods from the EU in April but it was later paused and the bloc has since been paying a baseline tariff of 10% on goods it exports to the US. In May, while the US and EU where holding trade negotiations, Mr Trump threated to impose a 50% tariff on the bloc as talks didn't progress as he would have liked. However, he later announced he was delaying the imposition of that tariff while negotiations over a trade deal took place. Earlier this week, the EU's executive commission, which handles trade issues for the bloc's 27-member nations, said its leaders were still hoping to strike a trade deal with the Trump administration. Without one, the EU said it was prepared to retaliate with tariffs on hundreds of American products, ranging from beef and auto parts to beer and Boeing aeroplanes."
    },
    {
        "title": "Michael Frison: Mother of British man missing in Sardinia describes 'never-ending nightmare'",
        "description": "The mother of a British man who has gone missing on Sardinia says she is living a \"never-ending nightmare\" - and has called for Interpol to intervene. ",
        "url": "https://news.sky.com/story/michael-frison-mother-of-british-man-missing-in-sardinia-describes-never-ending-nightmare-13395712",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-frison-mum_6963275.jpg?20250712144725",
        "type": "World",
        "Author": "Claire Gilbody-Dickerson",
        "Date Published": "2025-07-12 08:11:00",
        "Headline": "Cristina Pittalis tells Sky News she has been \"broken\" since her 26-year-old son disappeared on the Italian island, adding: \"I'm trying not to lose my mind.\"",
        "Content": "\n          Reporter\n              @ClaireGilbodyD\n The mother of a British man who has gone missing on Sardinia says she is living a \"never-ending nightmare\" - and has called for Interpol to intervene.  Cristina Pittalis told Sky News she has been \"broken\" since her 26-year-old son Michael Frison disappeared in the northwest of the Italian island on 13 July 2024. \"I'm trying not to lose my mind,\" said Ms Pittalis as she recounted the last time she heard her son's voice. \"He was in a rush but absolutely clear in his speech, I didn't detect any confusion in his state of mind.\" The mother-of-two from Somerset added: \"Human beings do not disappear from the face of earth without leaving traces unless […] something extremely bad happened to them.\" Mr Frison went missing the day after he arrived on a farm where he was meant to do volunteer work. He reportedly went for a walk and returned in a state of confusion and symptoms of heatstroke. He then went on a second walk and never returned. His clothes, including his trainers, were found nearby. His mother believes it would have been \"completely out of character\" for her son to wander off barefoot and leave all his personal belongings behind. She also said it was \"extremely unlikely\" he suffered a heatstroke as he had previously lived on the island and was used to its climate. Ms Pittalis, who has moved to Sardinia with her other 11-year-old son in a bid to find Mr Frison, said she was \"extremely worried because there are no traces of Michael\". Read more from Sky News:Fear in town where more than 200 children poisonedFuel to engines of doomed Air India plane 'cut off moments after take-off' She said \"during the past 12 months, the area was constantly searched, through woodland, caves, mountains\" but there was \"absolutely nothing\". Ms Pittalis is originally from Sassari in the northwest of Sardinia but had lived in the UK since 1966 until she moved to Sardinia following her son's disappearance. A local criminal investigation launched into Mr Frison's disappearance is ongoing, but Ms Pittalis has called for Interpol - the international crime-fighting organisation - to step in to try to find her son. \"It's a never-ending nightmare,\" she said. \"There's no real accountability... I am here and I am broken.\" She is also calling for a woman from Jersey, who was with Mr Frison in the days before his disappearance, to come forward with any information she may have. Ms Pittalis spoke of the toll that Mr Frison's disappearance has taken on his younger half-brother Emanuele, whose father died in 2017. \"He's devastated,\" she said. \"The three of us were extremely close, the two of them, they used to do everything together. \"For Mani [Emanuele] it's horrible, he lost his father and now he lost his brother.\" Interpol has been approached for comment."
    },
    {
        "title": "Tribalism without toxicity - and other reasons why this Women's Euros is so appealing",
        "description": "When orange-clad Dutch fans marched to the Zurich stadium to play England this week, their rivals were encouraged to join the procession.",
        "url": "https://news.sky.com/story/tribalism-without-toxicity-and-other-reasons-why-this-womens-euros-is-so-appealing-13395661",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-euros-zurich_6963104.jpg?20250712030325",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-07-12 00:42:00",
        "Headline": "Female fans do feel safer at women's football. And this part of the sport can project an image of being more inclusive without fear of abuse.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  When orange-clad Dutch fans marched to the Zurich stadium to play England this week, their rivals were encouraged to join the procession. No need for segregated paths, nor heavy policing. The Women's European Championship has a different feel from men's football tournaments. Of course, there isn't a desire for games to be completely sedate or sanitised. Wins are as fiercely fought over, but encouraging tribalism without toxicity is so much of the appeal. \"I would describe the male behaviour as aggressive or violent,\" fan Amy Cleall reflected on men's matches. \"Whereas the women's experience, there's still that banter element, of home and away and competitiveness, but it's not scary or intimidating.\" There is alcohol allowed in Swiss stadiums at Euro 2025, unlike at any professional games in England. And the Football Association even staged a Lionesses fan event flowing with booze throughout Wednesday. But there was no sense of anyone overdoing it as England beat the Netherlands 4-0 here on Wednesday night. No signs either of rowdiness as victorious fans mixed with their humbled rivals. Female fans do feel safer at women's football. And this part of the sport can project an image of being more inclusive without fear of abuse. A male Wales fan we encountered during a sightseeing spot at FIFA HQ in Zurich contrasted going to women's and men's football. He said: \"It's over-drinking, the use of substances which shouldn't be anywhere near a football ground and then it's hooliganism which you won't get at a women's game.\" The England and Wales faithful were mixing in the fan zone in Zurich last night ahead of their group-stage showdown, an hour away in St Gallen on Sunday. England fan Libby Bale said: \"When you're at women's football you all come together.\" Two male fans - both football coaches who often follow England men's matches abroad - found this Women's Euros experience refreshing. \"It feels more positive isn't it,\" James Rose said, turning to his friend. Watching Spain beat Italy, Connor Falp added: \"A little bit more friendly. You can go and have a bit more conversation with other people we spoke to a lot.\" Read more:A complete guide to the Women's Euros And England players have sensed the positive vibe when leaving their base to go into the city. Forward Lauren Hemp said: \"When walking around Zurich, it's so nice to see younger girls, younger boys, wanting to grow up to be like you. \"It's incredible and makes me so proud and remembering the journey that I had once when I was a young girl.\""
    },
    {
        "title": "Donald Trump announces 30% tariff on imports from EU",
        "description": "Donald Trump has announced he will impose a 30% tariff on imports from the European Union from 1 August.",
        "url": "https://news.sky.com/story/donald-trump-announces-30-tariff-on-imports-from-eu-13395817",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-ursula-von-der-leyen_6853911.jpg?20250312090340",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-12 13:21:00",
        "Headline": "European Commission president Ursula von der Leyen said the EU could adopt \"proportionate countermeasures\" if the tariff is imposed.",
        "Content": " Donald Trump has announced he will impose a 30% tariff on imports from the European Union from 1 August. The tariffs could make everything from French cheese and Italian leather goods to German electronics and Spanish pharmaceuticals more expensive in the US. Mr Trump has also imposed a 30% tariff on goods from Mexico, according to a post from his Truth Social account.Announcing the moves in separate letters posted on his account, the president said the US trade deficit was a national security threat. In his letter to the EU, he wrote: \"We have had years to discuss our trading relationship with The European Union, and we have concluded we must move away from these long-term, large, and persistent, trade Deficits, engendered by your tariff, and non-Tariff, policies, and trade barriers. \"Our relationship has been, unfortunately, far from reciprocal.\" In his letter to Mexico, Mr Trump said he did not think the country had done enough to stop the US from turning into a \"narco-trafficking playground\". The president of the European Commission, Ursula von der Leyen, said the EU could adopt \"proportionate countermeasures\" if the US proceeds with imposing the 30% tariff. Ms von der Leyen, who heads the EU's executive arm, said in a statement that the bloc remained ready \"to continue working towards an agreement by Aug 1\". \"Few economies in the world match the European Union's level of openness and adherence to fair trading practices,\" she added. \"We will take all necessary steps to safeguard EU interests, including the adoption of proportionate countermeasures if required.\" 'Very concerning' Ms von der Leyen has also said imposing tariffs on EU exports would \"disrupt essential transatlantic supply chains\". Meanwhile, Dutch Prime Minister Dick Schoof said on the X social media platform that Mr Trump's announcement was \"very concerning and not the way forward\". He added: \"The European Commission can count on our full support. As the EU we must remain united and resolute in pursuing an outcome with the United States that is mutually beneficial.\" Mexico's economy ministry said a bilateral working group aims to reach an alternative to the 30% US tariffs before they are due to take effect. The country was informed by the US that it would receive a letter about the tariffs, the ministry's statement said, adding that Mexico was negotiating. Read more US news:Trump plans to hit Canada with 35% tariffMore than 160 missing after Texas floodsRobot performs realistic surgery  Trump's tariff threats and delays On his so-called \"liberation day\" in April, Mr Trump unleashed \"reciprocal tariffs\" on many of America's trade partners. The US president said he was targeting countries with which America had a trade imbalance. However, since then he has backed down in a spiralling tit-for-tat tariff face-off with China, and struck a deal with the UK. The US imposed a 20% tariff on imported goods from the EU in April but it was later paused and the bloc has since been paying a baseline tariff of 10% on goods it exports to the US. In May, while the US and EU where holding trade negotiations, Mr Trump threated to impose a 50% tariff on the bloc as talks didn't progress as he would have liked. However, he later announced he was delaying the imposition of that tariff while negotiations over a trade deal took place. Earlier this week, the EU's executive commission, which handles trade issues for the bloc's 27-member nations, said its leaders were still hoping to strike a trade deal with the Trump administration. Without one, the EU said it was prepared to retaliate with tariffs on hundreds of American products, ranging from beef and auto parts to beer and Boeing aeroplanes."
    },
    {
        "title": "Donald Trump threatens to revoke Rosie O'Donnell's US citizenship",
        "description": "Donald Trump has said he is considering \"taking away\" the US citizenship of actress and comedian Rosie O'Donnell, despite a Supreme Court ruling that expressly prohibits a government from doing so.",
        "url": "https://news.sky.com/story/donald-trump-threatens-to-revoke-rosie-odonnells-us-citizenship-13395988",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6963725.jpg?20250712223157",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-12 21:24:00",
        "Headline": "O'Donnell responded to the US president's threat by posting a photograph of him with Jeffrey Epstein on Instagram.",
        "Content": "Donald Trump has said he is considering \"taking away\" the US citizenship of actress and comedian Rosie O'Donnell, despite a Supreme Court ruling that expressly prohibits a government from doing so. In a post on Truth Social on Saturday, the US president said: \"Because of the fact that Rosie O'Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship.\" He also labelled O'Donnell, who has moved to Ireland, as a \"threat to humanity\" and said she should \"remain in the wonderful country of Ireland, if they want her\". O'Donnell responded on Instagram by posting a photograph of Mr Trump with Jeffrey Epstein. \"You are everything that is wrong with America and I'm everything you hate about what's still right with it,\" she wrote in the caption. \"I'm not yours to silence. I never was.\" O'Donnell moved to Ireland with her 12-year-old son in January after Mr Trump had secured a second term. She has said she's in the process of obtaining Irish citizenship based on family lineage and that she would only return to the US \"when it is safe for all citizens to have equal rights there in America\". O'Donnell and the US president have criticised each other publicly for years, in an often-bitter back-and-forth that predates Mr Trump's move into politics.  This is just the latest threat by the president to revoke the citizenship of someone he has disagreed with, most recently his former ally Elon Musk. But the two situations are different as while Musk was born in South Africa, O'Donnell was born in the US and has a constitutional right to American citizenship. Read more from Sky News:Kate's 'emotional' words for tearful tennis starMusic festival cancelled as headliner pulls out Amanda Frost, a law professor at the University of Virginia School of Law, said the Supreme Court ruled in a 1967 case that the fourteenth amendment of the constitution prevents the government from taking away citizenship. \"The president has no authority to take away the citizenship of a native-born US citizen,\" he added. \"In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.\""
    },
    {
        "title": "Lloyds Banking Group in talks to buy digital wallet provider Curve",
        "description": "Britain's biggest high street bank is in talks to buy Curve, the digital wallet provider, amid growing regulatory pressure on Apple to open its payment services to rivals.",
        "url": "https://news.sky.com/story/lloyds-banking-group-in-talks-to-buy-digital-wallet-provider-curve-13395702",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lloyds-bank-money_6963171.jpg?20250712090927",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-12 09:26:00",
        "Headline": "A deal for the UK's biggest high street bank to buy Curve, which could cost in the region of £120m, would see it pushing further into digital payments infrastructure, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Britain's biggest high street bank is in talks to buy Curve, the digital wallet provider, amid growing regulatory pressure on Apple to open its payment services to rivals. Sky News has learnt that Lloyds Banking Group is in advanced discussions to acquire Curve for a price believed to be up to £120m. City sources said this weekend that if the negotiations were successfully concluded, a deal could be announced by the end of September. Curve was founded by Shachar Bialick, a former Israeli special forces soldier, in 2016. Three years later, he told an interviewer: \"In 10 years time we are going to be IPOed [listed on the public equity markets]... and hopefully worth around $50bn to $60bn.\" One insider said this weekend that Curve was being advised by KBW, part of the investment bank Stifel, on the discussions with Lloyds. If a mooted price range of £100m-£120m turns out to be accurate, that would represent a lower valuation than the £133m Curve raised in its Series C funding round, which concluded in 2023. \n                  Britain's biggest mortgage lender expects three interest rate cuts this year\n                 \n                  Bank exodus sparks row with UK lending standards body\n                 \n                  New National Wealth Fund to unveil £1bn social housing deal\n                 That round included backing from Britannia, IDC Ventures, Cercano Management - the venture arm of Microsoft co-founder Paul Allen's estate - and Outward VC. It was also reported to have raised more than £40m last year, while reducing employee numbers and suspending its US expansion. In total, the company has raised more than £200m in equity since it was founded. Curve has been positioned as a rival to Apple Pay in recent years, having initially launched as an app enabling consumers to combine their debit and credit cards in a single wallet. One source close to the prospective deal said that Lloyds had identified Curve as a strategically attractive bid target as it pushes deeper into payments infrastructure under chief executive Charlie Nunn. Lloyds is also said to believe that Curve would be a financially rational asset to own because of the fees Apple charges consumers to use its Apple Pay service. In March, the Financial Conduct Authority and Payment Systems Regulator began working with the Competition and Markets Authority to examine the implications of the growth of digital wallets owned by Apple and Google. Lloyds owns stakes in a number of fintechs, including the banking-as-a-service platform ThoughtMachine, but has set expanding its tech capabilities as a key strategic objective. The group employs more than 70,000 people and operates more than 750 branches across Britain. Curve is chaired by Lord Fink, the former Man Group chief executive who has become a prolific investor in British technology start-ups. When he was appointed to the role in January, he said: \"Working alongside Curve as an investor, I have had a ringside seat to the company's unassailable and well-earned rise. \"Beginning as a card which combines all your cards into one, to the all-encompassing digital wallet it has evolved into, Curve offers a transformative financial management experience to its users. \"I am proud to have been part of the journey so far, and welcome the chance to support the company through its next, very significant period of growth.\" IDC Ventures, one of the investors in Curve's Series C funding round, said at the time of its last major fundraising: \"Thanks to their unique technology…they have the capability to intercept the transaction and supercharge the customer experience, with its Double Dip Rewards, [and] eliminating nasty hidden fees. \"And they do it seamlessly, without any need for the customer to change the cards they pay with.\" News of the talks between Lloyds and Curve comes days before Rachel Reeves, the chancellor, is expected to outline plans to bolster Britain's fintech sector by endorsing a concierge service to match start-ups with investors. Lord Fink declined to comment when contacted by Sky News on Saturday morning, while Curve did not respond to an enquiry sent by email. Lloyds also declined to comment, while Stifel KBW could not be reached for comment."
    },
    {
        "title": "Dozens of MPs call for UK government to recognise Palestine as state",
        "description": "Nearly 60 Labour MPs have called on David Lammy and the Foreign Office to immediately recognise Palestine as a state.",
        "url": "https://news.sky.com/story/dozens-of-mps-call-for-uk-government-to-recognise-palestine-as-state-13395782",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestine-palestinian_6963497.jpg?20250712161422",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-07-12 11:58:00",
        "Headline": "In a letter to the foreign secretary, the group of 59 Labour MPs say \"by not recognising [Palestine] as a state, we undermine our own policy of a two-state solution\".",
        "Content": "\n          Political correspondent\n              @serenabarksing\n Nearly 60 Labour MPs have called on David Lammy and the Foreign Office to immediately recognise Palestine as a state. A mix of centrist and left-wing MPs, including some committee chairs, wrote to the foreign secretary this week to say \"by not recognising [Palestine] as a state, we undermine our own policy of a two-state solution and set an expectation that the status quo can continue and see the effective erasure and annexation of Palestinian territory\". The 59 MPs suggest the government pursue five different measures to prevent the Israeli government from carrying out its Rafah plan, adding that they believed Gaza was being \"ethnically cleansed\" - a claim vehemently denied by Israel. The letter was organised by Labour Friends of Palestine and the Middle East group. It states that the Israeli plan, which would see the \"population transfer to the southern tip of Gaza in preparation for deportation outside the strip\", is an accurate description, but that they believe a clearer way to describe it is the \"ethnic cleansing of Gaza\". Israeli officials have said they want to separate the civilian population from Hamas, which still controls parts of Gaza and holds dozens of hostages abducted in the October 7 attack that triggered the war 21 months ago. Emmanuel Macron discussed recognising Palestine as a state at a joint news conference with Sir Keir Starmer on Thursday - the same day the letter was signed. The French president said: \"Today, working together in order to recognise the state of Palestine and to initiate this political momentum is the only path to peace.\" While France has not yet recognised a Palestinian state yet, Norway, Ireland and Spain coordinated their recognition last year. The letter demands ministers take five different measures to: • Recognise the state of Palestine• Continue support for the UN Agency for Palestinian Refugees (UNRWA)• Secure the release of hostages• Press for the full and unhindered resumption of humanitarian aid• Fully review and place restrictions on trade with and financial support of illegal Israeli settlements in the West Bank The government says it is already providing funding for the UNRWA and working to secure the release of hostages held by Hamas, but immediate recognition of Palestinian statehood will be a much more controversial move. Sky News understands this is the second time MPs have formally called on the government to immediately recognise the state of Palestine, with previous letters signed by some parliamentary aides and even junior ministers. Read more:MPs call for Ukraine-style visas for Gazans'At least 798 killed' at Gaza aid points Ministers have indicated their plan to recognise Palestine would be \"at a time that is most conducive to the peace process\" without further clarity of when that might be. They have also indicated that it would not be suitable to speculate about future sanctions, as this could reduce their impact. A Foreign Office spokesperson said: \"Since day one, this government has been clear that we need to see an immediate ceasefire, the release of all hostages cruelly detained by Hamas, better protection of civilians, much-needed food aid, medicines, shelter and other supplies immediately being allowed to enter Gaza, and a path to long-term peace and stability. \"The situation on the ground in Gaza is horrendous - for the hostages and for Palestinians - and we urgently want to see a deal done, to end the suffering on all sides. \"We are committed to recognising a Palestinian state and to doing so when will have most impact in support of a peace process. We continue to provide lifesaving aid to supporting Palestinians in Gaza and the West Bank, and to work closely in support of the Palestinian Authority.\""
    },
    {
        "title": "BST Hyde Park's final day cancelled as Jeff Lynne's ELO pulls out of headline slot",
        "description": "BST Hyde Park festival has cancelled its final night after Jeff Lynne's Electric Light Orchestra pulled out of the headline slot. ",
        "url": "https://news.sky.com/story/bst-hyde-parks-final-day-cancelled-as-jeff-lynnes-elo-pulls-out-of-headline-slot-13395959",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-lynne-elo_6963675.jpg?20250712210640",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-12 19:59:00",
        "Headline": "ELO frontman Jeff Lynne has been forced to pull out of the gig on the advice of doctors. ",
        "Content": "BST Hyde Park festival has cancelled its final night after Jeff Lynne's Electric Light Orchestra pulled out of the headline slot.  Lynne, 77, was due to play alongside his band on Sunday but has been forced to withdraw from the event following a \"systemic infection\". The London show was supposed to be a \"final goodbye\" from ELO following their farewell US tour. Organisers said on Saturday that Lynne was \"heartbroken\" at being unable to perform. A statement read: \"Jeff has been battling a systemic infection and is currently in the care of a team of doctors who have advised him that performing is simply not possible at this time nor will he be able to reschedule. \"The legacy of the band and his longtime fans are foremost in Jeff's mind today - and while he is so sorry that he cannot perform, he knows that he must focus on his health and rehabilitation at this time.\" They later confirmed the whole of Sunday's event would be cancelled. \"Ticket holders will be refunded and contacted directly by their ticket agent with further details,\" another statement said. Stevie Wonder played the festival on Saturday - now its final event of 2025. Read more from Sky News:Scotland, Wales and Northern Ireland record hottest days of yearTennis star in tears after Wimbledon final drubbing  US rock band The Doobie Brothers and blues rock singer Steve Winwood were among those who had been due to perform to before ELO's headline performance. The cancellation comes after the band, best known for their hit Mr Blue Sky, pulled out of a performance due to take place at Manchester's Co-Op Live Arena on Thursday. ELO was formed in Birmingham in 1970 by Lynne, multi-instrumentalist Roy Wood and drummer Bev Bevan. They first split in 1986, before frontman Lynne resurrected the band in 2014."
    },
    {
        "title": "Donald Trump threatens to revoke Rosie O'Donnell's US citizenship",
        "description": "Donald Trump has said he is considering \"taking away\" the US citizenship of actress and comedian Rosie O'Donnell, despite a Supreme Court ruling that expressly prohibits a government from doing so.",
        "url": "https://news.sky.com/story/donald-trump-threatens-to-revoke-rosie-odonnells-us-citizenship-13395988",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-donald-trump_6963725.jpg?20250712223157",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-07-12 21:24:00",
        "Headline": "O'Donnell responded to the US president's threat by posting a photograph of him with Jeffrey Epstein on Instagram.",
        "Content": "Donald Trump has said he is considering \"taking away\" the US citizenship of actress and comedian Rosie O'Donnell, despite a Supreme Court ruling that expressly prohibits a government from doing so. In a post on Truth Social on Saturday, the US president said: \"Because of the fact that Rosie O'Donnell is not in the best interests of our Great Country, I am giving serious consideration to taking away her Citizenship.\" He also labelled O'Donnell, who has moved to Ireland, as a \"threat to humanity\" and said she should \"remain in the wonderful country of Ireland, if they want her\". O'Donnell responded on Instagram by posting a photograph of Mr Trump with Jeffrey Epstein. \"You are everything that is wrong with America and I'm everything you hate about what's still right with it,\" she wrote in the caption. \"I'm not yours to silence. I never was.\" O'Donnell moved to Ireland with her 12-year-old son in January after Mr Trump had secured a second term. She has said she's in the process of obtaining Irish citizenship based on family lineage and that she would only return to the US \"when it is safe for all citizens to have equal rights there in America\". O'Donnell and the US president have criticised each other publicly for years, in an often-bitter back-and-forth that predates Mr Trump's move into politics.  This is just the latest threat by the president to revoke the citizenship of someone he has disagreed with, most recently his former ally Elon Musk. But the two situations are different as while Musk was born in South Africa, O'Donnell was born in the US and has a constitutional right to American citizenship. Read more from Sky News:Kate's 'emotional' words for tearful tennis starMusic festival cancelled as headliner pulls out Amanda Frost, a law professor at the University of Virginia School of Law, said the Supreme Court ruled in a 1967 case that the fourteenth amendment of the constitution prevents the government from taking away citizenship. \"The president has no authority to take away the citizenship of a native-born US citizen,\" he added. \"In short, we are nation founded on the principle that the people choose the government; the government cannot choose the people.\""
    }
]