[
    {
        "title": "Starmer 'playing whack-a-mole' to keep US on side - but will it be enough?",
        "description": "Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal.",
        "url": "https://news.sky.com/story/starmer-playing-whack-a-mole-to-keep-us-on-side-but-will-it-be-enough-13474045",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-g20_7088645.jpg?20251122164142",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-22 16:57:00",
        "Headline": "The prime minister said there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva.",
        "Content": "\n          Political editor\n              @BethRigby\n  Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal. As he prepared to depart for London, the prime minister confirmed he was dispatching national security adviser Jonathan Powell to Geneva for talks with US officials, other European security advisers and Ukrainian representatives - as Europe and Ukraine scramble to reinsert themselves into a plan drawn up between Washington and Moscow. The prime minister said on Saturday there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva. Follow the latest: European leaders raise concerns over plan for Ukraine   After speaking on the phone to Donald Trump, Downing Street said the pair agreed their teams would work together on the US leader's proposal in the Swiss city on Sunday. Starmer also reiterated Britain's \"steadfast support for Ukraine\" in a call with President Zelenskyy - as allies try to swing this deal more in Ukraine's favour, with the UK and other international leaders clear on their concerns to limit the size of the Ukrainian army and give up territory to Russia. But in his remarks on camera, the prime minister was at pains to neither criticise the current deal nor President Trump. One figure told me that the PM wants to act as a bridge between the Europeans and the US and has been playing a \"game of whack-a-mole\" over the past couple of days in an effort to keep others from publicly saying the deal is unacceptable for fear it would only serve to irritate President Trump and hurt Ukraine. Earlier, the prime minister said he would talk to his US counterpart in the coming days. \"I'm absolutely clear in my mind that President Trump wants a just and lasting peace, not just from the actions he's taken towards that end, but also from the private discussions that I've had with him,\" Mr Starmer said. \"So I know what he's trying to achieve. We all want to achieve that.\" But there will be a question about what the alternative options are if allies cannot improve this deal by President Trump's Thursday deadline. The first option is to try to improve it and also slow down the process and buy more time, but if that fails, are allies looking at scenarios where they try to shore up Ukraine's war efforts without the US support? The prime minister responded by talking about point five in the 28-point plan, in which Ukraine is offered security guarantees from the US. Read more:Trump's 28-point Ukraine peace plan in fullAnalysis: We could all pay if Europe doesn't step upStarmer addresses G20 summit - but Trump boycotts talks \"That fortifies in me the belief that what we're all trying to achieve here is a just and lasting peace will only be just as lasting if there are security guarantees,\" Mr Starmer said. \"And if we bear in mind that matters for Ukraine are always to be determined by Ukraine.\" The next 24 hours will be critical as the Europeans, Ukraine and other allies try to improve this deal."
    },
    {
        "title": "Starmer urges anyone with information on Epstein case to come forward - after Andrew misses Congress deadline",
        "description": "Sir Keir Starmer has urged anyone with information on the Jeffrey Epstein case to come forward after Andrew Mountbatten Windsor missed the deadline to appear in front of US Congress.",
        "url": "https://news.sky.com/story/starmer-urges-anyone-with-information-on-epstein-case-to-come-forward-after-andrew-misses-congress-deadline-13473921",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-22 13:28:00",
        "Headline": "US legislators have criticised Andrew for what they describe as \"silence\" over the Epstein probe after he failed to respond to their interview request.",
        "Content": "Sir Keir Starmer has urged anyone with information on the Jeffrey Epstein case to come forward after Andrew Mountbatten Windsor missed the deadline to appear in front of US Congress. US legislators have criticised Andrew for what they describe as \"silence\" amid their probe into Epstein after he failed to respond to their request for an interview. When asked about Andrew missing the deadline and whether the former prince should help the case in any way he can, Sir Keir said on his way to the G20 summit in South Africa: \"I don't comment on this particular case.\"   He added that \"a general principle I've held for a very long time is that anybody who has got relevant information in relation to these kind of cases should give that evidence to those that need it\". Andrew is not legally obliged to talk to Congress and has always vigorously denied any wrongdoing. \n                  'Silence speaks volumes': Andrew criticised by US politicians after missing interview deadline \n                 \n                  Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk\n                 \n                  Epstein said Andrew did have photo taken with Virginia Giuffre, emails show\n                 It comes as Marjorie Taylor Greene, a loyal supporter-turned-critic of US President Donald Trump, said on Friday she is resigning from Congress in January. Ms Greene's resignation followed a public falling-out with Mr Trump in recent months, as the congresswoman criticised him for his stance on files related to Epstein, as well as on foreign policy and healthcare. Members of the House Oversight Committee had requested a \"transcribed interview\" with Andrew in connection with his \"long-standing friendship\" with Epstein, the paedophile financier who took his own life in a New York prison in 2019 while awaiting trial on sex trafficking and conspiracy charges.  But after saying they had not heard back, Democrats Robert Garcia and Suhas Subramanyam accused Andrew of hiding. Their statement read: \"Andrew Mountbatten Windsor's silence in the face of the Oversight Democrat's demand for testimony speaks volumes. \"The documents we've reviewed, along with public records and Virginia Roberts Giuffre's testimony, raise serious questions he must answer, yet he continues to hide. \"Our work will move forward with or without him, and we will hold anyone who was involved in these crimes accountable, no matter their wealth, status, or political party. We will get justice for the survivors.\"  It follows Andrew being stripped of his prince and Duke of York titles earlier this month. He had previously agreed to stop using his titles, but had expected to remain a prince and retain his dukedom, ahead of the publication of the memoirs of the late Ms Giuffre, who had accused him of sexually assaulting her when she was a teenager - an accusation he denies."
    },
    {
        "title": "Countries agree compromise climate deal at COP30 - but omit mention of fossil fuels",
        "description": "Countries attending COP30, the biggest climate meeting of the year, have agreed to a compromise deal setting out steps to help speed up climate action.",
        "url": "https://news.sky.com/story/cop30-countries-reach-draft-deal-to-help-speed-up-climate-action-13473945",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lago-president-cop30_7088753.jpg?20251122172212",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-22 14:21:00",
        "Headline": "The deal would boost finance for poor nations coping with global warming but it omits any mention of the fossil fuels driving it.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Countries attending COP30, the biggest climate meeting of the year, have agreed to a compromise deal setting out steps to help speed up climate action. The deal would boost finance for poor nations coping with global warming, but it fails to namecheck the fossil fuels driving it. As the United Nations summit wrapped up in Brazil, applause masked disappointment in the many weak parts of the agreement.   But what many were celebrating was that they had agreed on anything at all - with countries around the world distracted by conflict and the cost of living, and the United States missing from the talks altogether. The outlook for COP30 was bleak after two other similar forums this year - on green shipping and plastics pollution - fell apart entirely. The UK's Energy Secretary Ed Miliband told Sky News in the Amazon city Belem: \"Donald Trump and the United States withdrew from the Paris climate agreement. \"Some people said that means lots of countries are going to [pull out] as well, a domino effect. That hasn't happened.\" Rather than spelling out the fossil fuel problem, the agreement promises to \"accelerate implementation\" of existing commitments, nodding to an old promise from COP28 in Dubai. The UN secretary-general Antonio Guterres said: \"I cannot pretend that COP30 has delivered everything that is needed. The gap between where we are and what science demands remains dangerously wide.\" Panama negotiator Juan Carlos Monterrey Gomez said: \"A climate decision that cannot even say 'fossil fuels' is not neutrality, it is complicity. And what is happening here transcends incompetence.\" He added: \"Science has been deleted from COP30 because it offends the polluters.\" Despite no transition plan being included in the deal, the summit's president Andre Correa do Lago said voluntary plans on fossil fuels and forests would be mapped out instead. Next year, hardline Colombia, which is trying to leave its coal in the ground, will host a summit for those interested in the proposed fossil fuel plan.  Each year, the United Nations climate talks bring together world leaders, scientists, campaigners, and negotiators from across the globe, who agree on collective next steps for tackling climate change. The two-week conference in Belem was a rollercoaster - from indigenous people storming the entrance to demand a greater role, to a brief fire in one of the tents, and sleep-deprived negotiators battling it out over the future of their countries. COP30 was due to end at 6pm local time (9pm UK time) on Friday, but it dragged well into overtime - not uncommon for the annual, heated talks. The standoff was between the EU, which was the last one standing on the transition away from fossil fuels, and the Arab Group of nations, including major oil exporter Saudi Arabia, which opposed it. The impasse was resolved following all-night talks led by Brazil, negotiators said. The European Union's climate commissioner Wopke Hoekstra said on Saturday that the proposed accord was acceptable, even though the bloc would have liked more. \"We should support it because at least it is going in the right direction,\" he said. Read more:Cop out: Is net zero dead?Fire disrupts efforts to strike dealRecord for wind-powered energy in UK COP30 wins But the summit made gains in other areas. Climate-vulnerable countries like Jamaica and India will be celebrating a new pledge to triple the amount of cash to help them cope with the impacts of climate change. Hurricane Melissa, which tore through the Caribbean just before COP30 started, was a reminder that extreme weather is becoming more intense and more expensive. Brazil's plan to host COP on the edge of the Amazon rainforest paid off - it raised almost $10bn (£7.65bn) to protect the world's forests that are fending off climate change - including $6bn for a new investment fund. And it also recognised and earmarked money for indigenous peoples and other communities that help keep them standing. Indigenous people defined the image and the tone of the first week of the talks - storming the venue entrance, staging sit-ins and winning new legal rights to some of their land. Toya Manchineri, of the Manchineri Peoples and Coordination of Indigenous Organizations of the Brazilian Amazon, said: \"Indigenous Peoples will remain vigilant, mobilized, and present beyond COP30 to ensure that our voices are respected and that global decisions reflect the urgency we experience in our territories. \"For some, COP ends today, for us territorial defence in the heart of the Amazon is every day.\" Campaigners also won a new commitment that the switch to clean energy should be fair to workers and that communities do not lose out."
    },
    {
        "title": "Girl, 13, arrested on suspicion of murdering woman in Swindon",
        "description": "A 13-year-old girl has been arrested on suspicion of murdering a woman in Swindon.",
        "url": "https://news.sky.com/story/girl-13-arrested-on-suspicion-of-murdering-woman-in-swindon-13473489",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-moredon-baydon-close_7088898.jpg?20251122181210",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-22 00:01:00",
        "Headline": "Police have asked people not to \"speculate\" about an incident after a 13-year-old girl was arrested on suspicion of murder.",
        "Content": "A 13-year-old girl has been arrested on suspicion of murdering a woman in Swindon. Police said the teenager was detained following an incident in Baydon Close, Moredon, in the Wiltshire town on Friday evening. Officers responded to reports of disorder inside a house. When they arrived, a woman in her 50s living at the address was found to be not breathing. She was declared dead at the scene. There were no other reported injuries. Detective Inspector Darren Ambrose, from Wiltshire Police's major crime investigation team, said: \"This is a serious incident in which a woman has sadly died. \"We have set up a cordon at the address while an investigation is carried out. \"I can confirm that we have arrested a teenage girl in connection with this incident and we are not looking for anyone else.\" Police have asked people not to speculate about the incident online as this could prejudice the case. A police statement read: \"Residents can expect to see an increased police presence in the area while we continue carrying out our enquiries into the woman's death. \"The suspect remains in custody at this time.\" Read more from Sky News:Energy supplier Ovo to axe hundreds of jobsBoris Johnson hits out at COVID inquiry report Police said anyone with concerns should speak with their local neighbourhood policing team, either by emailing or approaching officers in person."
    },
    {
        "title": "Struggling energy supplier Ovo to axe hundreds of jobs",
        "description": "Ovo Energy, one of Britain's biggest domestic gas and electricity suppliers, is preparing to take an axe to its workforce next week as part of efforts to convince regulators that it has a viable turnaround plan.",
        "url": "https://news.sky.com/story/struggling-energy-supplier-ovo-to-axe-hundreds-of-jobs-13473990",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ovo-energy-power_7032894.jpg?20250927100440",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-22 15:36:00",
        "Headline": "The household energy supplier is expected to confirm plans to axe \"several hundred\" jobs as soon as the middle of next week as it continues talks with regulators and investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ovo Energy, one of Britain's biggest domestic gas and electricity suppliers, is preparing to take an axe to its workforce next week as part of efforts to convince regulators that it has a viable turnaround plan. Sky News has learnt that Ovo, which serves about four million customers across the UK, is drawing up proposals to cut hundreds of jobs as early as Wednesday in a bid to save millions of pounds in costs. The redundancies - the precise scale of which could not be ascertained this weekend - are said to form part of a revised business plan submitted to Ofgem, the energy watchdog, which is focused on boosting the company's profitability. That plan is likely to include restrictions on taking on new customers while Ovo's finances are placed on a sustainable footing, according to industry sources. One insider suggested that \"several hundred\" jobs would be lost next week, although a spokeswoman for the company declined to quantify either the scale of the cuts or the size of Ovo's existing workforce. The redundancies will come less than a month after Ovo's chief executive, David Buttress, stepped down in the middle of a search for investors willing to pump hundreds of millions of pounds into the company. Mr Buttress, the former Just Eat chief who served a brief period as Boris Johnson's cost-of-living tsar, has been replaced by Chris Houghton, a former Ovo boss who worked alongside its founder, Stephen Fitzpatrick. Former Virgin Money chief Dame Jayne-Anne Gadhia was recently named chair of Ovo's retail energy arm. Ovo's customer base places it behind Octopus Energy and Centrica-owned British Gas in the household energy supply market, but it remains one of the most important companies in the sector. Its quest to raise roughly £300m of new equity has been ongoing for months, with bankers at Rothschild engaging in talks with numerous financial investors. Last month, Sky News revealed that a Norwegian investment group had abandoned talks about an investment amid concern that the industry's regulatory regime is obstructing efforts to attract new capital. Verdane, which is based in Oslo, had been in detailed talks as recently as this month about injecting a substantial sum into Ovo in return for a large stake in the business, while Iberdrola, the owner of Scottish Power, has also held tentative discussions about a possible tie-up. Investor uncertainty has been heightened by the energy regulator Ofgem's capital adequacy rules, with Ovo acknowledging recently that it - alongside larger rival Octopus Energy - had yet to fully comply with the regime, saying: \"We have taken proactive measures to align with Ofgem's new capital rules, working constructively to meet the requirements.\" Sky News reported this month that Ovo was not technically in breach of the capital adequacy regime because it had agreed a route with Ofgem to fulfilling its obligations. Ovo, which is backed by investors including Japan's Mitsubishi and the London-based investor Mayfair Equity Partners, disclosed in accounts published recently that there was \"material uncertainty\" over its future. The company has separately engaged advisers at Arma Partners to explore the sale of a stake in Kaluza, its software arm, echoing a similar move by Octopus Energy's Kraken division. Alongside Mr Fitzpatrick, the entrepreneur who now owns London's Kensington Roof Gardens, Ovo's other shareholders include Morgan Stanley Investment Management. Launched in 2009, the company positioned itself as a challenger brand offering superior service to the industry's established players. Ovo's transformational moment came in 2020, when it bought the retail supply arm of SSE, transforming it overnight into one of Britain's leading energy companies. Its growth has not been without difficulties, however, particularly in relation to its challenged relationship with Ofgem and a torrent of customer complaints about overcharging."
    },
    {
        "title": "What did COP30 achieve after failing to reach deal on fossil fuels?",
        "description": "Well, it could have been worse.",
        "url": "https://news.sky.com/story/what-did-cop30-achieve-after-failing-to-reach-deal-on-fossil-fuels-13474235",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brazil-cop_7089022.jpg?20251122192853",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-22 19:05:00",
        "Headline": "This was the first COP to happen after being hollowed out by the absence of a climate-denying United States.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Well, it could have been worse. This was the first COP to happen after being hollowed out by the absence of a climate-denying United States. Also, in the shadow of cost-of-living, trade and conflict crises, few governments brought their A-game.  There were fears, too, that the tropical heat and crumbling infrastructure of the Amazon's seaport, Belem, would result in chaos.  But despite deafening Amazonian downpours drumming on the canvas of the temporary venue and even a fire, the summit concluded its business. The failure to agree, or even to agree to disagree, on a \"roadmap\", a discussion paper, about how best to phase out the use of fossil fuels was a major failure - though absolutely no surprise. \n                  Countries agree compromise climate deal at COP30 - but omit mention of fossil fuels\n                 \n                  'COP is a nightmare but best process we've got', says Ed Miliband as climate talks run into overtime\n                 \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                  COPs continue to operate around consensus. Many compromises are made, but just one country can veto a proposal. In the case of fossil fuels, it was a group of oil producers led by Saudi Arabia that saw to it that even talking about how to move on from oil and gas never made it. A staggering thought, given this was the first COP to take place in a world that had just experienced a year that was warmer than at any time in modern human history. But perhaps because of new global realities, this COP did achieve something others have rarely done. It broke new ground and started important conversations about key issues that had received little attention before. Like how trade must be aligned with the already rapid transition away from fossil fuels that is under way in many countries. Also, how critical minerals and access to them must be given similar attention as fossil fuels, given their essential role in building alternative energy sources. And while a plan to phase out fossil fuels didn't get \"gavelled through\", the conversation has started and it's not going to stop. There was progress too on forests - you'd have hoped there would be from a COP surrounded by rainforest - and Brazil's centrepiece Tropical Forests Forever Facility managed to win $5.5bn worth of support despite most nations' coffers being bare.  Brazil also brought a quiet but necessary shift in paradigm to the talks. For a decade, COPs have been dominated by countries like the UK, EU states and, until last year, the US, pressing for change because of the economic and societal opportunities that a green transition will bring. The host country, rich in forests and indigenous groups who understand better than nearly anyone our economies' total dependence on nature, argued that action was, instead, a moral imperative. Read more:Countries agree compromise climate dealRecord for wind-powered energy in UK \"We already possess virtually all the technical solutions for climate change, biodiversity loss, and even pressing social issues,\" minister Marina Silva told delegates. \"What is needed is the ethical commitment to apply our technical capabilities and accelerate our political decisions, ensuring we fulfil what we've already committed to.\""
    },
    {
        "title": "£1.5bn package announced to help Britain switch to electric vehicles",
        "description": "The government is set to extend the Electric Car Grant scheme by a year as it announced another &#163;1.5bn towards supporting the UK's transition to electric vehicles.",
        "url": "https://news.sky.com/story/16315bn-package-announced-to-help-britain-switch-to-electric-vehicles-13474203",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-electric-car-vehicle_7003281.jpg?20250828005936",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-22 18:12:00",
        "Headline": "During the budget next week, the Labour Party is expected to announce a further £1.3bn for the Electric Car Grant, along with £200m to speed up the rollout of thousands of charging points across the UK, bringing the total investment to £1.5bn.",
        "Content": "The government is set to extend the Electric Car Grant scheme by a year as it announced another £1.5bn towards supporting the UK's transition to electric vehicles. More than 35,000 drivers have been helped in switching to an electric vehicle (EV) since the scheme was launched in July, as their upfront costs were cut by up to £3,750. During the budget next week, the Labour Party is expected to announce a further £1.3bn for the Electric Car Grant, along with £200m to speed up the rollout of thousands of charge points across the UK, bringing the total investment to £1.5bn.   Figures for the month after the scheme was launch showed more than a quarter (26.5%) of cars sold in August were EVs, according to data from motor lobby group the Society for Motor Manufacturers and Traders (SMMT). Data from the same organisation shows EVs took a 22.4% share of the new car market in the first 10 months of the year.  Under the UK government's zero emission vehicle (ZEV) mandate, at least 28% of new cars sold by each manufacturer in the UK this year are required to be zero emission, which generally means pure electric. The ZEV mandate requirement will increase each year, rising to as much as 80% in 2030. Sales of new cars powered solely by petrol or diesel will be banned from 2030. Read more:'Best month ever' for battery electric vehicle salesOctopus COPs £500m financing boost for electric vehicles arm As it announced its latest plans, the government said the proposed funding would also help local authorities ramp up charging infrastructure on local streets so it is easier for everyone to get access to reliable charging. The cost of public charging will be reviewed, the government added, as it noted how the price to charge an EV publicly has risen in recent years. \"The government is fully committed to the transition to electric vehicles, which is key to meeting our net zero goals and will drive growth and productivity across the UK,\" it said."
    },
    {
        "title": "Rail fares to be frozen for first time in 30 years",
        "description": "Rail fares are to be frozen for the first time in 30 years, the government has announced.",
        "url": "https://news.sky.com/story/rail-fares-to-be-frozen-for-first-time-in-30-years-13473946",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-train-rail-york-station_7088535.jpg?20251122154000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-22 14:23:00",
        "Headline": "Ministers promised millions of rail travellers will save hundreds of pounds on regulated fares, including season tickets and peak and off-peak returns between major cities.",
        "Content": "Rail fares are to be frozen for the first time in 30 years, the government has announced. Ministers promised that millions of rail travellers will save hundreds of pounds on regulated fares, including season tickets and peak and off-peak returns between major cities. The fare freeze applies to England and services run by English train operators.   People commuting to work three days a week using flexi-season tickets will save £315 a year travelling from Milton Keynes to London, £173 travelling from Woking to London and £57 from Bradford to Leeds, the government said. The changes are part of Labour's plans to rebuild a publicly owned Great British Railways. Other planned changes include tap in-tap out and digital ticketing, as well as investing in superfast Wi-Fi. Chancellor Rachel Reeves said the government was introducing a freeze on rail fares for the first time in 30 years, which \"will ease the pressure on household finances and make travelling to work, school or to visit friends and family that bit easier\". \"We all want to see cheaper rail travel, so we're freezing fares to help millions of passengers save money,\" Transport Secretary Heidi Alexander said. \"Commuters on more expensive routes will save more than £300 per year, meaning they keep more of their hard-earned cash.\" Rail unions and passenger groups welcomed the move, praising how it will make travel more affordable for passengers and promote more sustainable travel alternatives. Read more:Christmas travel chaos expectedDozens injured in passenger train collision Eddie Dempsey, general secretary of the Rail, Maritime and Transport union, said: \"More affordable fares will encourage greater use of public transport, supporting jobs, giving a shot in the arm to local economies and helping to improve the environment.\" TUC general secretary Paul Nowak said the rail fare freeze \"will be a huge relief to working people\". \"This is the right decision, at the right time, to help passengers be able to afford to make that journey they need to take, and to help grow our railway in this country, because the railway is Britain's green alternative - taking cars and lorries off our congested roads and moving people and goods safely around our country in an environmentally-friendly way,\" Mick Whelan, general secretary of the train drivers union Aslef, said. The Tories welcomed the move but said the government was \"late to the platform\". Shadow transport secretary Richard Holden said: \"In government, the Conservatives kept fares on the right track with below-inflation rises and consistently called for no further hikes to protect hard-working commuters.\""
    },
    {
        "title": "Haunted by Trump deja vu, Ukraine and its allies are in a perilous moment",
        "description": "There is a profound sense of deja vu surrounding the Ukraine crisis right now.",
        "url": "https://news.sky.com/story/haunted-by-trump-deja-vu-ukraine-and-its-allies-are-in-a-perilous-moment-13474319",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-russia_7089196.jpg?20251122235352",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-11-22 23:44:00",
        "Headline": "A US-Russia peace plan that demands huge concessions of Ukraine has left Kyiv and its allies scrambling, organising last-minute crisis talks in Geneva where they hope to win Washington back around. ",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n There is a profound sense of deja vu surrounding the Ukraine crisis right now. It was only a few months ago that European leaders rushed to Washington after Donald Trump appeared to align with Vladimir Putin at their Alaska Summit. The Europeans gathered in Washington in August and appeared convinced that they had pulled Trump back around to their mindset: that unity and strength, not capitulation, is the answer for Ukraine.  Well, this week it is possible (some sources say probable) that European leaders will again head to Washington for another attempt to pull Trump back. Ukraine live: Trump suggests peace plan 'not final offer' Ukraine and its allies head to Geneva The meeting in Geneva on Sunday is absolutely pivotal. It was billed initially as a meeting between the Americans and the Ukrainians. But it has since morphed into a wider meeting with a number of European countries sending senior officials. The core meeting is still expected to be between US envoy Steve Witkoff and the Ukrainians, but sideline talks will now take place with a much wider group of nations. Many European leaders have spoken to President Trump on Friday and Saturday and plan to do so again. I am told Keir Starmer's conversation with him was \"good, short but productive.\"  Britain's national security adviser, Jonathan Powell, will be in Geneva. Over the last nine months, he has emerged as an important British influence on the Trump administration. He is close to Witkoff - who co-wrote or at least signed off on the 28-point plan. However, the Powell-Witkoff relationship is clearly not close enough to have afforded the UK a heads-up on this latest peace plan. 'Sudden injection' One source told me that the \"sudden injection\" by the Americans had \"been surprising.\" The American decision to put a rocket under the quest for peace in Ukraine appeared to have vice president JD Vance's fingerprints on it. The territorial elements of the peace plan are almost identical to a proposal put forward by Vance in the summer of 2024 before Trump won the election. Read more:Trump's 28-point Ukraine peace plan in fullStarmer reveals Trump peace plan 'concern' at G20Europe scrambles for counter-proposal to US-Russian plan Vance's stance on Ukraine has always leant towards questioning the point of it all. He led the attacks of Volodymyr Zelenskyy at the Oval Office in February. The US secretary of the army, Dan Driscoll, who has taken a lead in the conversions with Ukrainian officials, is a friend and ally of Vance - the two were at Yale together. Vance has also been leading calls for his own administration to spend more time on \"the home front\". This sudden momentum on Ukraine could be an attempt to draw a line under it quickly in order to focus attention domestically.  The week ahead So - things to look out for now: first, the Geneva meeting on Sunday - this is pivotal and will set the tone and the agenda for the days ahead. It is day-by-day at the moment. Out of the Geneva meeting, a meeting of the European \"coalition of the willing\" countries will convene. And following that, a contingent of European leaders heading to Washington seems likely - perhaps on Tuesday. By Wednesday, America begins to wind down for the biggest holiday of the year - Thanksgiving. Trump's deadline for an agreement by Thanksgiving still feels improbable, but it's not impossible that some sort of memorandum of understanding could be signed by then. 👉 Listen to Sky News Daily on your podcast app 👈 This would ensure momentum remains in the process and Trump is kept encouraged on progress. He has suggested that the deadline is movable, and that the deal proposed in the 28-point plan is not the final one. Notwithstanding all this, there is no question that this moment, for Ukraine and for Europe, is perilous and ominous."
    },
    {
        "title": "Flights at Eindhoven Airport resume after drone sightings",
        "description": "Air traffic at Eindhoven Airport in the Netherlands was suspended following the sighting of multiple drones - but has since resumed.",
        "url": "https://news.sky.com/story/eindhoven-airport-closed-after-drone-sightings-13474270",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eindhoven-airport_7089100.jpg?20251122210327",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-22 20:34:00",
        "Headline": "The country's police and military were called to the site, the defence minister said in a post on X, and an investigation is ongoing.",
        "Content": " Air traffic at Eindhoven Airport in the Netherlands was suspended following the sighting of multiple drones - but has since resumed. Dutch minister of defence Ruben Brekelmans said defence counter-drone measures were \"ready to intervene\". The country's police and military were also on site, the minister said in a post on X, adding that an investigation is ongoing.   The airport in the south of the Netherlands is used for both military and civilian purposes. All types of air traffic were halted, Mr Brekelmans said. Flights resumed later, the defence minister announced just after 10pm UK time. It is still not known where the drones came from. The Dutch military on Friday evening had used weapons against drones sighted above the air force base in Volkel, some 25 miles (40km) northeast of Eindhoven, the defence ministry had said earlier on Saturday. Various airports in Europe were forced to temporarily close in September over drone sightings, including in Denmark, Norway and Copenhagen. Earlier in September, Russian drones were intercepted flying over Poland and Romania, while three Russian jets entered Estonian airspace without permission. Read more:Airport drone sightings: What we knowRussia is mastering a new type of drone that cannot be jammed The three incursions into NATO airspace fuelled concerns about the potential expansion of Russia's three-year war in Ukraine and have been seen as an attempt by Moscow to test the military alliance's response. Do airports have to completely close? No, airports do not have to implement a complete shutdown when a drone is detected, but it is typical to halt air traffic in and out of the space to avoid collisions. This has knock-on effects for travelling passengers, causing delays and flights being redirected elsewhere. It is the owner or operator of an individual airport that decides whether to close the facility, and for how long planes are halted."
    },
    {
        "title": "Starmer urges anyone with information on Epstein case to come forward - after Andrew misses Congress deadline",
        "description": "Sir Keir Starmer has urged anyone with information on the Jeffrey Epstein case to come forward after Andrew Mountbatten Windsor missed the deadline to appear in front of US Congress.",
        "url": "https://news.sky.com/story/starmer-urges-anyone-with-information-on-epstein-case-to-come-forward-after-andrew-misses-congress-deadline-13473921",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-prince-windsor_7067570.jpg?20251119150452",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-22 13:28:00",
        "Headline": "US legislators have criticised Andrew for what they describe as \"silence\" over the Epstein probe after he failed to respond to their interview request.",
        "Content": "Sir Keir Starmer has urged anyone with information on the Jeffrey Epstein case to come forward after Andrew Mountbatten Windsor missed the deadline to appear in front of US Congress. US legislators have criticised Andrew for what they describe as \"silence\" amid their probe into Epstein after he failed to respond to their request for an interview. When asked about Andrew missing the deadline and whether the former prince should help the case in any way he can, Sir Keir said on his way to the G20 summit in South Africa: \"I don't comment on this particular case.\"   He added that \"a general principle I've held for a very long time is that anybody who has got relevant information in relation to these kind of cases should give that evidence to those that need it\". Andrew is not legally obliged to talk to Congress and has always vigorously denied any wrongdoing. \n                  'Silence speaks volumes': Andrew criticised by US politicians after missing interview deadline \n                 \n                  Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk\n                 \n                  Epstein said Andrew did have photo taken with Virginia Giuffre, emails show\n                 It comes as Marjorie Taylor Greene, a loyal supporter-turned-critic of US President Donald Trump, said on Friday she is resigning from Congress in January. Ms Greene's resignation followed a public falling-out with Mr Trump in recent months, as the congresswoman criticised him for his stance on files related to Epstein, as well as on foreign policy and healthcare. Members of the House Oversight Committee had requested a \"transcribed interview\" with Andrew in connection with his \"long-standing friendship\" with Epstein, the paedophile financier who took his own life in a New York prison in 2019 while awaiting trial on sex trafficking and conspiracy charges.  But after saying they had not heard back, Democrats Robert Garcia and Suhas Subramanyam accused Andrew of hiding. Their statement read: \"Andrew Mountbatten Windsor's silence in the face of the Oversight Democrat's demand for testimony speaks volumes. \"The documents we've reviewed, along with public records and Virginia Roberts Giuffre's testimony, raise serious questions he must answer, yet he continues to hide. \"Our work will move forward with or without him, and we will hold anyone who was involved in these crimes accountable, no matter their wealth, status, or political party. We will get justice for the survivors.\"  It follows Andrew being stripped of his prince and Duke of York titles earlier this month. He had previously agreed to stop using his titles, but had expected to remain a prince and retain his dukedom, ahead of the publication of the memoirs of the late Ms Giuffre, who had accused him of sexually assaulting her when she was a teenager - an accusation he denies."
    },
    {
        "title": "Girl, 13, arrested on suspicion of murdering woman in Swindon",
        "description": "A 13-year-old girl has been arrested on suspicion of murdering a woman in Swindon.",
        "url": "https://news.sky.com/story/girl-13-arrested-on-suspicion-of-murdering-woman-in-swindon-13473489",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-moredon-baydon-close_7088898.jpg?20251122181210",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-22 00:01:00",
        "Headline": "Police have asked people not to \"speculate\" about an incident after a 13-year-old girl was arrested on suspicion of murder.",
        "Content": "A 13-year-old girl has been arrested on suspicion of murdering a woman in Swindon. Police said the teenager was detained following an incident in Baydon Close, Moredon, in the Wiltshire town on Friday evening. Officers responded to reports of disorder inside a house. When they arrived, a woman in her 50s living at the address was found to be not breathing. She was declared dead at the scene. There were no other reported injuries. Detective Inspector Darren Ambrose, from Wiltshire Police's major crime investigation team, said: \"This is a serious incident in which a woman has sadly died. \"We have set up a cordon at the address while an investigation is carried out. \"I can confirm that we have arrested a teenage girl in connection with this incident and we are not looking for anyone else.\" Police have asked people not to speculate about the incident online as this could prejudice the case. A police statement read: \"Residents can expect to see an increased police presence in the area while we continue carrying out our enquiries into the woman's death. \"The suspect remains in custody at this time.\" Read more from Sky News:Energy supplier Ovo to axe hundreds of jobsBoris Johnson hits out at COVID inquiry report Police said anyone with concerns should speak with their local neighbourhood policing team, either by emailing or approaching officers in person."
    },
    {
        "title": "Rail fares to be frozen for first time in 30 years",
        "description": "Rail fares are to be frozen for the first time in 30 years, the government has announced.",
        "url": "https://news.sky.com/story/rail-fares-to-be-frozen-for-first-time-in-30-years-13473946",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-train-rail-york-station_7088535.jpg?20251122154000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-22 14:23:00",
        "Headline": "Ministers promised millions of rail travellers will save hundreds of pounds on regulated fares, including season tickets and peak and off-peak returns between major cities.",
        "Content": "Rail fares are to be frozen for the first time in 30 years, the government has announced. Ministers promised that millions of rail travellers will save hundreds of pounds on regulated fares, including season tickets and peak and off-peak returns between major cities. The fare freeze applies to England and services run by English train operators.   People commuting to work three days a week using flexi-season tickets will save £315 a year travelling from Milton Keynes to London, £173 travelling from Woking to London and £57 from Bradford to Leeds, the government said. The changes are part of Labour's plans to rebuild a publicly owned Great British Railways. Other planned changes include tap in-tap out and digital ticketing, as well as investing in superfast Wi-Fi. Chancellor Rachel Reeves said the government was introducing a freeze on rail fares for the first time in 30 years, which \"will ease the pressure on household finances and make travelling to work, school or to visit friends and family that bit easier\". \"We all want to see cheaper rail travel, so we're freezing fares to help millions of passengers save money,\" Transport Secretary Heidi Alexander said. \"Commuters on more expensive routes will save more than £300 per year, meaning they keep more of their hard-earned cash.\" Rail unions and passenger groups welcomed the move, praising how it will make travel more affordable for passengers and promote more sustainable travel alternatives. Read more:Christmas travel chaos expectedDozens injured in passenger train collision Eddie Dempsey, general secretary of the Rail, Maritime and Transport union, said: \"More affordable fares will encourage greater use of public transport, supporting jobs, giving a shot in the arm to local economies and helping to improve the environment.\" TUC general secretary Paul Nowak said the rail fare freeze \"will be a huge relief to working people\". \"This is the right decision, at the right time, to help passengers be able to afford to make that journey they need to take, and to help grow our railway in this country, because the railway is Britain's green alternative - taking cars and lorries off our congested roads and moving people and goods safely around our country in an environmentally-friendly way,\" Mick Whelan, general secretary of the train drivers union Aslef, said. The Tories welcomed the move but said the government was \"late to the platform\". Shadow transport secretary Richard Holden said: \"In government, the Conservatives kept fares on the right track with below-inflation rises and consistently called for no further hikes to protect hard-working commuters.\""
    },
    {
        "title": "Struggling energy supplier Ovo to axe hundreds of jobs",
        "description": "Ovo Energy, one of Britain's biggest domestic gas and electricity suppliers, is preparing to take an axe to its workforce next week as part of efforts to convince regulators that it has a viable turnaround plan.",
        "url": "https://news.sky.com/story/struggling-energy-supplier-ovo-to-axe-hundreds-of-jobs-13473990",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ovo-energy-power_7032894.jpg?20250927100440",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-22 15:36:00",
        "Headline": "The household energy supplier is expected to confirm plans to axe \"several hundred\" jobs as soon as the middle of next week as it continues talks with regulators and investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ovo Energy, one of Britain's biggest domestic gas and electricity suppliers, is preparing to take an axe to its workforce next week as part of efforts to convince regulators that it has a viable turnaround plan. Sky News has learnt that Ovo, which serves about four million customers across the UK, is drawing up proposals to cut hundreds of jobs as early as Wednesday in a bid to save millions of pounds in costs. The redundancies - the precise scale of which could not be ascertained this weekend - are said to form part of a revised business plan submitted to Ofgem, the energy watchdog, which is focused on boosting the company's profitability. That plan is likely to include restrictions on taking on new customers while Ovo's finances are placed on a sustainable footing, according to industry sources. One insider suggested that \"several hundred\" jobs would be lost next week, although a spokeswoman for the company declined to quantify either the scale of the cuts or the size of Ovo's existing workforce. The redundancies will come less than a month after Ovo's chief executive, David Buttress, stepped down in the middle of a search for investors willing to pump hundreds of millions of pounds into the company. Mr Buttress, the former Just Eat chief who served a brief period as Boris Johnson's cost-of-living tsar, has been replaced by Chris Houghton, a former Ovo boss who worked alongside its founder, Stephen Fitzpatrick. Former Virgin Money chief Dame Jayne-Anne Gadhia was recently named chair of Ovo's retail energy arm. Ovo's customer base places it behind Octopus Energy and Centrica-owned British Gas in the household energy supply market, but it remains one of the most important companies in the sector. Its quest to raise roughly £300m of new equity has been ongoing for months, with bankers at Rothschild engaging in talks with numerous financial investors. Last month, Sky News revealed that a Norwegian investment group had abandoned talks about an investment amid concern that the industry's regulatory regime is obstructing efforts to attract new capital. Verdane, which is based in Oslo, had been in detailed talks as recently as this month about injecting a substantial sum into Ovo in return for a large stake in the business, while Iberdrola, the owner of Scottish Power, has also held tentative discussions about a possible tie-up. Investor uncertainty has been heightened by the energy regulator Ofgem's capital adequacy rules, with Ovo acknowledging recently that it - alongside larger rival Octopus Energy - had yet to fully comply with the regime, saying: \"We have taken proactive measures to align with Ofgem's new capital rules, working constructively to meet the requirements.\" Sky News reported this month that Ovo was not technically in breach of the capital adequacy regime because it had agreed a route with Ofgem to fulfilling its obligations. Ovo, which is backed by investors including Japan's Mitsubishi and the London-based investor Mayfair Equity Partners, disclosed in accounts published recently that there was \"material uncertainty\" over its future. The company has separately engaged advisers at Arma Partners to explore the sale of a stake in Kaluza, its software arm, echoing a similar move by Octopus Energy's Kraken division. Alongside Mr Fitzpatrick, the entrepreneur who now owns London's Kensington Roof Gardens, Ovo's other shareholders include Morgan Stanley Investment Management. Launched in 2009, the company positioned itself as a challenger brand offering superior service to the industry's established players. Ovo's transformational moment came in 2020, when it bought the retail supply arm of SSE, transforming it overnight into one of Britain's leading energy companies. Its growth has not been without difficulties, however, particularly in relation to its challenged relationship with Ofgem and a torrent of customer complaints about overcharging."
    },
    {
        "title": "Arthur was abused as a child by his babysitter - but his claim for compensation was rejected. And he's not alone",
        "description": "Victims of grooming gangs and modern slavery are being denied compensation by a government scheme because of their criminal records, Sky News has learned.",
        "url": "https://news.sky.com/story/grooming-gang-victims-being-denied-compensation-because-of-criminal-records-13472860",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-arthur-sherry_7086133.jpg?20251119173316",
        "type": "UK",
        "Author": "Alice Porter",
        "Date Published": "2025-11-22 00:01:00",
        "Headline": "A child sex abuse victim tells Sky News he tried to claim compensation through the Criminal Injuries Compensation Authority, but was rejected because of his criminal record.",
        "Content": "\n          News correspondent\n              @AlicePorterTV\n  Victims of grooming gangs and modern slavery are being denied compensation by a government scheme because of their criminal records, Sky News has learned. Analysis of official figures by Sky News' Data & Forensics team shows more than 11,000 victims of crime over the past decade have been denied payouts because of their unspent convictions, including children. The Criminal Injuries Compensation Authority can award money to victims of violent crime, including sexual abuse. It is the only government compensation scheme for victims - for those unable to work due to injuries, the money can be vital. But, if an applicant has a criminal record, they are automatically refused compensation with limited exceptions. Those with unspent convictions - ones which will show on a criminal record until a certain amount of time has passed - sometimes receive reduced sums. Sky News has found that at least 130 children with criminal records have received reduced awards over the last 10 years, including 50 victims of sex abuse, four victims of brain damage, and one child who lost sight in an eye. This rule on unspent convictions is based on the idea that public funds should only compensate blameless victims of crime and not, for example, a gang member who was injured in a fight. But many argue the policy punishes those who have been forced to offend by exploiters, as well as victims of child sexual abuse. 'I was frustrated that I wasn't being believed' Arthur Sherry, 43, from Perranporth in Cornwall was regularly abused by his babysitter from the age of five, including suffering rape. In 2008, he reported it to Devon and Cornwall Police, alongside two other victims. He alleges the police did not believe him, and charges were not brought against his abuser. Arthur became angry and descended into addiction as a \"coping mechanism\", becoming suicidal, and was repeatedly arrested for minor offences, such as making false calls to the emergency services. \"I wasn't getting support from any agencies, and no one asked me, 'Why is this man ringing the emergency services all the time?'\" \"It was a cry for help. I was frustrated that I wasn't being believed.\" Eventually, Arthur's abuser, Shaun Burton, was convicted of multiple offences against children, including 11 counts of indecency with a child in relation to Mr Sherry. But when Arthur, who suffers from complex PTSD, subsequently tried to make a claim through the Criminal Injuries Compensation Authority in 2013, it was rejected because of his criminal record and because he submitted his application beyond CICA's time limit. He was not allowed to appeal the decision. Many survivors of grooming gangs have criminal records due to being exploited and coerced. While the government recently announced plans to disregard child prostitution convictions for these victims, many are urging authorities to go further and pardon all related offences. Former victims' commissioner Dame Vera Baird said: \"They were not exercising their own free will and voluntarily committing crime, so there should be a discretion to look at that and say, 'No, that wasn't their fault'. \"They should get compensation for all the evil that was done to them by that gang.\" In 2022, the Independent Inquiry into Child Sexual Abuse recommended that the government amend the Criminal Injuries Compensation Scheme so that \"applicants with unspent convictions are not automatically excluded where offences are likely to be linked to the circumstances of their sexual abuse as a child\". The government has refused to act on this recommendation. However, Labour MP Sarah Champion has tabled an amendment to the upcoming Victims and Courts Bill, hoping to implement it, as well as widen eligibility to the scheme. \"Victims are seen as running a cannabis farm and get a conviction, before it actually turns out that they were a victim of modern slavery. \"These people, who are very clearly recognised as victims and survivors, aren't getting the money that's owed to them. The system is broken and the ministers need to get rid of it.\" Read more from Sky News:Wintry blast 'could be a dry run for a cold December'What does Trump's Gaza peace plan look like? A government spokesperson said: \"Last year, more than £164m was paid out under the Criminal Injuries Compensation Scheme to victims, and we are going further by removing the time limit for civil personal injury claims and doubling Home Office funding for services supporting adult victims and survivors of child sexual abuse. \"Changes to the way we compensate victims have been considered by successive governments, and our priority must always be to treat all victims of violence equally.\" Devon and Cornwall Police said: \"Tackling sexual offending is a key priority for Devon & Cornwall Police and we are working hard to bring offenders to justice. \"We take reports of all sexual offences seriously and will carry out thorough investigations into reports, looking at all viable lines of enquiry.\""
    },
    {
        "title": "£1.5bn package announced to help Britain switch to electric vehicles",
        "description": "The government is set to extend the Electric Car Grant scheme by a year as it announced another &#163;1.5bn towards supporting the UK's transition to electric vehicles.",
        "url": "https://news.sky.com/story/16315bn-package-announced-to-help-britain-switch-to-electric-vehicles-13474203",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-electric-car-vehicle_7003281.jpg?20250828005936",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-22 18:12:00",
        "Headline": "During the budget next week, the Labour Party is expected to announce a further £1.3bn for the Electric Car Grant, along with £200m to speed up the rollout of thousands of charging points across the UK, bringing the total investment to £1.5bn.",
        "Content": "The government is set to extend the Electric Car Grant scheme by a year as it announced another £1.5bn towards supporting the UK's transition to electric vehicles. More than 35,000 drivers have been helped in switching to an electric vehicle (EV) since the scheme was launched in July, as their upfront costs were cut by up to £3,750. During the budget next week, the Labour Party is expected to announce a further £1.3bn for the Electric Car Grant, along with £200m to speed up the rollout of thousands of charge points across the UK, bringing the total investment to £1.5bn.   Figures for the month after the scheme was launch showed more than a quarter (26.5%) of cars sold in August were EVs, according to data from motor lobby group the Society for Motor Manufacturers and Traders (SMMT). Data from the same organisation shows EVs took a 22.4% share of the new car market in the first 10 months of the year.  Under the UK government's zero emission vehicle (ZEV) mandate, at least 28% of new cars sold by each manufacturer in the UK this year are required to be zero emission, which generally means pure electric. The ZEV mandate requirement will increase each year, rising to as much as 80% in 2030. Sales of new cars powered solely by petrol or diesel will be banned from 2030. Read more:'Best month ever' for battery electric vehicle salesOctopus COPs £500m financing boost for electric vehicles arm As it announced its latest plans, the government said the proposed funding would also help local authorities ramp up charging infrastructure on local streets so it is easier for everyone to get access to reliable charging. The cost of public charging will be reviewed, the government added, as it noted how the price to charge an EV publicly has risen in recent years. \"The government is fully committed to the transition to electric vehicles, which is key to meeting our net zero goals and will drive growth and productivity across the UK,\" it said."
    },
    {
        "title": "Daily Mail owner in talks to buy Telegraph titles for £500m",
        "description": "The owner of the Daily Mail is in talks to buy the Daily Telegraph and its Sunday sister title for &#163;500m, a deal that would finally end the more-than two-year hiatus over their future.",
        "url": "https://news.sky.com/story/daily-mail-owner-in-talks-to-buy-telegraph-titles-for-163500m-13473868",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-telegraph-daily-telegraph_7088252.jpg?20251122090200",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-22 08:59:00",
        "Headline": "DMGT has confirmed a Sky News report that it has entered exclusive negotiations to buy the Daily and Sunday Telegraph newspapers and end the protracted hiatus over their ownership.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  The owner of the Daily Mail is in talks to buy the Daily Telegraph and its Sunday sister title for £500m, a deal that would finally end the more-than two-year hiatus over their future. DMGT confirmed on Saturday morning Sky News's revelation on the social media platform X that it had entered exclusive negotiations to buy the broadsheet titles, less than two weeks after their sale to a consortium led by RedBird Capital Partners collapsed. In a statement, DMGT said the exclusivity period to combine the two national newspaper groups would be used to \"finalise the terms of the transaction and to prepare the necessary regulatory submissions\". A deal to combine the Mail and Telegraph titles will require scrutiny from the competition regulator, with the culture secretary, Lisa Nandy, also expected to be involved in the process. The collapse of the RedBird-led deal came after opposition from within the Telegraph's newsroom over reported links of its chairman, John Thornton, to influential Chinese state actors. Lord Rothermere, DMGT's controlling shareholder, had intended to acquire a minority stake of just under 10% in the Telegraph titles as part of the RedBird-led consortium. An earlier deal proposed by a consortium including RedBird and the Abu Dhabi state-owned investment firm IMI collapsed after the government changed the law regarding foreign state ownership of national newspapers. IMI was to have owned a 15% stake - the maximum permitted - under the more recent deal. \"I have long admired the Daily Telegraph,\" Lord Rothermere said. \"My family and I have an enduring love of newspapers and for the journalists who make them. \"The Daily Telegraph is Britain's largest and best quality broadsheet newspaper, and I have grown up respecting it. \"It has a remarkable history and has played a vital role in shaping Britain's national debate over many decades. \"Chris Evans is an excellent editor, and we intend to give him the resources to invest in the newsroom. \"Under our ownership, the Daily Telegraph will become a global brand, just as the Daily Mail has.\" A spokesman for RedBird IMI said: \"DMGT and RedBird IMI have worked swiftly to reach the agreement announced today, which will shortly be submitted to the Secretary of State.\" If the deal is completed, it would bring the Telegraph newspapers under the same stable of ownership as titles including Metro, The i Paper and New Scientist. DMGT said it planned \"to invest substantially in TMG [Telegraph Media Group] with the aim of accelerating its international expansion. \"It will focus particularly on the USA, where the Daily Mail is already successful, with established editorial and commercial operations.\""
    },
    {
        "title": "Ukraine peace plan 'not final offer' Trump says, ahead of crisis talks in Geneva",
        "description": "Donald Trump has said that the US-Russia peace plan is \"by far\" not the \"final offer\", ahead of crisis talks in Geneva.",
        "url": "https://news.sky.com/story/sir-keir-starmer-addresses-g20-summit-in-south-africa-but-donald-trump-boycotts-talks-13473884",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-macron-g20_7088319.jpg?20251122115240",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-22 10:32:00",
        "Headline": "Donald Trump has said that the US-Russia peace plan for Ukraine is not the final offer, after unease from European allies over the concessions it demanded of Kyiv.",
        "Content": " Donald Trump has said that the US-Russia peace plan is \"by far\" not the \"final offer\", ahead of crisis talks in Geneva. The G20 summit in South Africa was overshadowed by news of a peace plan for Ukraine, which demanded significant concessions from Kyiv and was drawn up by Kremlin adviser Dmitriev Kirill and Trump official Steve Witkoff. The agenda of the meeting was to make progress on solving some of the problems afflicting the world's poorest nations, but following the release of a draft copy of a US-backed 28-point peace plan European and Western nations scrambled to respond. Follow the latest on the Ukraine peace plan It led to a meeting being hastily convened in Geneva, Switzerland, on Sunday, where representatives from the US and Ukraine will meet, along with Britain, France, Germany, the EU and more. The plan closely resembles the list of demands repeatedly stated by the Kremlin since it launched its full-scale invasion of Ukraine nearly four years ago and if adopted, would see Ukraine cede territory to Russia - and cut the size of its military. Mixed US signals There were mixed signals coming out of Washington on Saturday night. Mr Trump told reporters outside the White House that the 28-point plan was not the \"final offer\" when asked. He said: \"We'd like to get the peace, it should've happened a long time ago. The Ukraine war with Russia should've never happened. If I was president, it would have never happened. We're trying to get it ended. One way or another, we have to get it ended.\"  However, despite Mr Trump accepting the plan - he previously said Volodymyr Zelenskyy would \"have to approve it\" - US secretary of state Marco Rubio told senators who criticised the plan it was a \"Russian wish list\". From South Africa to Geneva In light of the draft plan being published and the European and Western response, crisis talks are being held in Geneva on Sunday. Ahead of the meeting, foreign ministers from Britain and Ukraine spoke to \"coordinate\" positions, and Sir Keir Starmer and Mr Zelenskyy spoke. Sir Keir also spoke to Mr Trump, relaying discussions held at G20 to the US leader, according to a Downing Street spokesperson, who added that the two leaders would speak again on Sunday and their teams would work together on the 28-point peace plan. Trump plan 'requires additional work' Ukraine's European and Western allies pushed out a united message from the G20, repeatedly welcoming the plan as a good start, but warning, in the words of French President Emmanuel Macron, that it needed to be \"strengthened\". Sir Keir told reporters in Johannesburg: \"We are concerned about [caps on military], because it's fundamental that Ukraine has to be able to defend itself if there's a ceasefire.\" He added the proposal, which will be discussed by US, Ukrainian and European national security advisers (NSAs) in Switzerland on Sunday, \"requires additional work\". \"And that's why there's been the agreement that in Geneva tomorrow [Sunday], you'll have senior US personnel, you'll have European NSAs [national security advisers], including the UK NSA, and obviously Ukrainians there to work further on the draft.\"  President Trump has said he wants a response to the peace plan from Ukraine by Thursday. What is the role of the G20? The role of the G20 is critical at this moment,\" said Sir Keir, who has defended his decision to fly to the G20 days before a difficult budget. \"The G20 has worked together before to fix fundamental problems in the global economy. We need to find ways to play a constructive role again today in the face of the world challenges. \"I'd like to see us come together around a five-point plan for growth that leaves no one behind.\" The US, however, is boycotting the talks. The Trump administration made its opposition to South Africa's G20 agenda clear earlier this year when the country started holding meetings ahead of the summit. South Africa gets to set the agenda as the country holding the rotating G20 presidency. G20 leaders broke with tradition and adopted a declaration at the start of their summit - despite opposition from the US. Vincent Magwenya, spokesman for South African president Cyril Ramaphosa, said a leaders' declaration was adopted unanimously in Johannesburg. The White House later accused South Africa of refusing to facilitate a smooth transition of the G20 presidency. Read more:Analysis: Europe scrambles at G20 over Ukraine peace planeG20 lands in South Africa: But who feels forgotten? The G20 bloc was formed in 1999 as a bridge between rich and poor nations to confront global financial crises. While it often operates in the shadow of the powerful Group of Seven nations, G20 members represent around 85% of the world's economy, 75% of international trade and more than half the global population."
    },
    {
        "title": "Starmer 'playing whack-a-mole' to keep US on side - but will it be enough?",
        "description": "Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal.",
        "url": "https://news.sky.com/story/starmer-playing-whack-a-mole-to-keep-us-on-side-but-will-it-be-enough-13474045",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-g20_7088645.jpg?20251122164142",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-22 16:57:00",
        "Headline": "The prime minister said there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva.",
        "Content": "\n          Political editor\n              @BethRigby\n  Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal. As he prepared to depart for London, the prime minister confirmed he was dispatching national security adviser Jonathan Powell to Geneva for talks with US officials, other European security advisers and Ukrainian representatives - as Europe and Ukraine scramble to reinsert themselves into a plan drawn up between Washington and Moscow. The prime minister said on Saturday there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva. Follow the latest: European leaders raise concerns over plan for Ukraine   After speaking on the phone to Donald Trump, Downing Street said the pair agreed their teams would work together on the US leader's proposal in the Swiss city on Sunday. Starmer also reiterated Britain's \"steadfast support for Ukraine\" in a call with President Zelenskyy - as allies try to swing this deal more in Ukraine's favour, with the UK and other international leaders clear on their concerns to limit the size of the Ukrainian army and give up territory to Russia. But in his remarks on camera, the prime minister was at pains to neither criticise the current deal nor President Trump. One figure told me that the PM wants to act as a bridge between the Europeans and the US and has been playing a \"game of whack-a-mole\" over the past couple of days in an effort to keep others from publicly saying the deal is unacceptable for fear it would only serve to irritate President Trump and hurt Ukraine. Earlier, the prime minister said he would talk to his US counterpart in the coming days. \"I'm absolutely clear in my mind that President Trump wants a just and lasting peace, not just from the actions he's taken towards that end, but also from the private discussions that I've had with him,\" Mr Starmer said. \"So I know what he's trying to achieve. We all want to achieve that.\" But there will be a question about what the alternative options are if allies cannot improve this deal by President Trump's Thursday deadline. The first option is to try to improve it and also slow down the process and buy more time, but if that fails, are allies looking at scenarios where they try to shore up Ukraine's war efforts without the US support? The prime minister responded by talking about point five in the 28-point plan, in which Ukraine is offered security guarantees from the US. Read more:Trump's 28-point Ukraine peace plan in fullAnalysis: We could all pay if Europe doesn't step upStarmer addresses G20 summit - but Trump boycotts talks \"That fortifies in me the belief that what we're all trying to achieve here is a just and lasting peace will only be just as lasting if there are security guarantees,\" Mr Starmer said. \"And if we bear in mind that matters for Ukraine are always to be determined by Ukraine.\" The next 24 hours will be critical as the Europeans, Ukraine and other allies try to improve this deal."
    },
    {
        "title": "Boris Johnson rejects 'muddled' COVID inquiry report and accuses chair of 'breathtaking inconsistency'",
        "description": "Boris Johnson has rejected claims he presided over a toxic and chaotic culture at the heart of the UK government during the pandemic, and accused the COVID-19 Inquiry of being \"totally muddled\".",
        "url": "https://news.sky.com/story/boris-johnson-rejects-muddled-covid-inquiry-report-and-accuses-chair-of-breathtaking-inconsistency-13473888",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-boris-johnson-covid-inquiry_7057125.jpg?20251021172842",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-22 11:08:00",
        "Headline": "The former prime minister, who set up the inquiry, has accused its chair Baroness Heather Hallett of being \"hopelessly incoherent\" and relying on \"hysterical predictions\" about COVID deaths.",
        "Content": " Boris Johnson has rejected claims he presided over a toxic and chaotic culture at the heart of the UK government during the pandemic, and accused the COVID-19 Inquiry of being \"totally muddled\". The failure to take COVID-19 seriously cost 23,000 lives in the pandemic's first wave in 2020, according to Baroness Heather Hallett's report into the government response to the crisis. But in a newspaper article, Boris Johnson said the inquiry - which he set up - had failed to answer the \"big questions\", specifically: where the virus came from, and whether lockdowns were worthwhile. Writing in the Daily Mail, the former prime minister said the report should be filed \"vertically\", and insisted those involved in the pandemic response were \"doing our level best\".  He wrote: \"Some judge has just spent the thick end of £200m on an inquiry, and what is the upshot? \"She seems, if anything, to want more lockdowns. She seems to have laid into the previous Tory government for not locking down hard enough or fast enough - just when the rest of the world has been thinking that lockdowns were probably wildly overdone.\" The inquiry found that the first and second lockdowns of the pandemic were not inevitable, but the government was left with no choice after failing to implement measures such as social distancing and household quarantine earlier. \n                  COVID-19 report goes a long way to answering inquiry's critics\n                 \n                  So far, only one political leader is prepared to mount an outspoken defence of the BBC\n                 \n                  Boris Johnson becomes third former Tory PM to criticise Kemi Badenoch's policies \n                 Tens of thousands of lives could have been saved during the first wave of COVID-19 had a mandatory lockdown been introduced a week earlier, the inquiry also found. Baroness Hallett criticised all four UK governments for failing to appreciate the scale of the threat and described the response to the pandemic as \"too little, too late\". But Mr Johnson accused her of \"breathtaking inconsistency\", being \"hopelessly incoherent\" and relying on \"hysterical predictions\" about COVID deaths. \"I am afraid, the inquiry seems to be totally muddled,\" he wrote. He also argued that, a week before the first lockdown, he told people to self-isolate if they had symptoms, work from home and avoid inessential contact.  Read more from Sky News:Watch: Inquiry's five key takeawaysInquiry's damning statisticHow the UK's response unfoldedExplainer: COVID-19 Inquiry He added: \"I am of course grateful to Lady Hallett for her labours, which have clearly been extensive, and I repeat that I remain full of regret for the things the government I led got wrong and full of sympathy for all those who suffered - whether from the disease or from the steps we took to protect the population. \"All I can say is that everyone involved was doing our level best, under pretty difficult circumstances, to get it right and to save lives.\""
    },
    {
        "title": "Countries agree compromise climate deal at COP30 - but omit mention of fossil fuels",
        "description": "Countries attending COP30, the biggest climate meeting of the year, have agreed to a compromise deal setting out steps to help speed up climate action.",
        "url": "https://news.sky.com/story/cop30-countries-reach-draft-deal-to-help-speed-up-climate-action-13473945",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lago-president-cop30_7088753.jpg?20251122172212",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-22 14:21:00",
        "Headline": "The deal would boost finance for poor nations coping with global warming but it omits any mention of the fossil fuels driving it.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Countries attending COP30, the biggest climate meeting of the year, have agreed to a compromise deal setting out steps to help speed up climate action. The deal would boost finance for poor nations coping with global warming, but it fails to namecheck the fossil fuels driving it. As the United Nations summit wrapped up in Brazil, applause masked disappointment in the many weak parts of the agreement.   But what many were celebrating was that they had agreed on anything at all - with countries around the world distracted by conflict and the cost of living, and the United States missing from the talks altogether. The outlook for COP30 was bleak after two other similar forums this year - on green shipping and plastics pollution - fell apart entirely. The UK's Energy Secretary Ed Miliband told Sky News in the Amazon city Belem: \"Donald Trump and the United States withdrew from the Paris climate agreement. \"Some people said that means lots of countries are going to [pull out] as well, a domino effect. That hasn't happened.\" Rather than spelling out the fossil fuel problem, the agreement promises to \"accelerate implementation\" of existing commitments, nodding to an old promise from COP28 in Dubai. The UN secretary-general Antonio Guterres said: \"I cannot pretend that COP30 has delivered everything that is needed. The gap between where we are and what science demands remains dangerously wide.\" Panama negotiator Juan Carlos Monterrey Gomez said: \"A climate decision that cannot even say 'fossil fuels' is not neutrality, it is complicity. And what is happening here transcends incompetence.\" He added: \"Science has been deleted from COP30 because it offends the polluters.\" Despite no transition plan being included in the deal, the summit's president Andre Correa do Lago said voluntary plans on fossil fuels and forests would be mapped out instead. Next year, hardline Colombia, which is trying to leave its coal in the ground, will host a summit for those interested in the proposed fossil fuel plan.  Each year, the United Nations climate talks bring together world leaders, scientists, campaigners, and negotiators from across the globe, who agree on collective next steps for tackling climate change. The two-week conference in Belem was a rollercoaster - from indigenous people storming the entrance to demand a greater role, to a brief fire in one of the tents, and sleep-deprived negotiators battling it out over the future of their countries. COP30 was due to end at 6pm local time (9pm UK time) on Friday, but it dragged well into overtime - not uncommon for the annual, heated talks. The standoff was between the EU, which was the last one standing on the transition away from fossil fuels, and the Arab Group of nations, including major oil exporter Saudi Arabia, which opposed it. The impasse was resolved following all-night talks led by Brazil, negotiators said. The European Union's climate commissioner Wopke Hoekstra said on Saturday that the proposed accord was acceptable, even though the bloc would have liked more. \"We should support it because at least it is going in the right direction,\" he said. Read more:Cop out: Is net zero dead?Fire disrupts efforts to strike dealRecord for wind-powered energy in UK COP30 wins But the summit made gains in other areas. Climate-vulnerable countries like Jamaica and India will be celebrating a new pledge to triple the amount of cash to help them cope with the impacts of climate change. Hurricane Melissa, which tore through the Caribbean just before COP30 started, was a reminder that extreme weather is becoming more intense and more expensive. Brazil's plan to host COP on the edge of the Amazon rainforest paid off - it raised almost $10bn (£7.65bn) to protect the world's forests that are fending off climate change - including $6bn for a new investment fund. And it also recognised and earmarked money for indigenous peoples and other communities that help keep them standing. Indigenous people defined the image and the tone of the first week of the talks - storming the venue entrance, staging sit-ins and winning new legal rights to some of their land. Toya Manchineri, of the Manchineri Peoples and Coordination of Indigenous Organizations of the Brazilian Amazon, said: \"Indigenous Peoples will remain vigilant, mobilized, and present beyond COP30 to ensure that our voices are respected and that global decisions reflect the urgency we experience in our territories. \"For some, COP ends today, for us territorial defence in the heart of the Amazon is every day.\" Campaigners also won a new commitment that the switch to clean energy should be fair to workers and that communities do not lose out."
    },
    {
        "title": "Starmer 'playing whack-a-mole' to keep US on side - but will it be enough?",
        "description": "Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal.",
        "url": "https://news.sky.com/story/starmer-playing-whack-a-mole-to-keep-us-on-side-but-will-it-be-enough-13474045",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-g20_7088645.jpg?20251122164142",
        "type": "World",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-22 16:57:00",
        "Headline": "The prime minister said there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva.",
        "Content": "\n          Political editor\n              @BethRigby\n  Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal. As he prepared to depart for London, the prime minister confirmed he was dispatching national security adviser Jonathan Powell to Geneva for talks with US officials, other European security advisers and Ukrainian representatives - as Europe and Ukraine scramble to reinsert themselves into a plan drawn up between Washington and Moscow. The prime minister said on Saturday there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva. Follow the latest: European leaders raise concerns over plan for Ukraine   After speaking on the phone to Donald Trump, Downing Street said the pair agreed their teams would work together on the US leader's proposal in the Swiss city on Sunday. Starmer also reiterated Britain's \"steadfast support for Ukraine\" in a call with President Zelenskyy - as allies try to swing this deal more in Ukraine's favour, with the UK and other international leaders clear on their concerns to limit the size of the Ukrainian army and give up territory to Russia. But in his remarks on camera, the prime minister was at pains to neither criticise the current deal nor President Trump. One figure told me that the PM wants to act as a bridge between the Europeans and the US and has been playing a \"game of whack-a-mole\" over the past couple of days in an effort to keep others from publicly saying the deal is unacceptable for fear it would only serve to irritate President Trump and hurt Ukraine. Earlier, the prime minister said he would talk to his US counterpart in the coming days. \"I'm absolutely clear in my mind that President Trump wants a just and lasting peace, not just from the actions he's taken towards that end, but also from the private discussions that I've had with him,\" Mr Starmer said. \"So I know what he's trying to achieve. We all want to achieve that.\" But there will be a question about what the alternative options are if allies cannot improve this deal by President Trump's Thursday deadline. The first option is to try to improve it and also slow down the process and buy more time, but if that fails, are allies looking at scenarios where they try to shore up Ukraine's war efforts without the US support? The prime minister responded by talking about point five in the 28-point plan, in which Ukraine is offered security guarantees from the US. Read more:Trump's 28-point Ukraine peace plan in fullAnalysis: We could all pay if Europe doesn't step upStarmer addresses G20 summit - but Trump boycotts talks \"That fortifies in me the belief that what we're all trying to achieve here is a just and lasting peace will only be just as lasting if there are security guarantees,\" Mr Starmer said. \"And if we bear in mind that matters for Ukraine are always to be determined by Ukraine.\" The next 24 hours will be critical as the Europeans, Ukraine and other allies try to improve this deal."
    },
    {
        "title": "Haunted by Trump deja vu, Ukraine and its allies are in a perilous moment",
        "description": "There is a profound sense of deja vu surrounding the Ukraine crisis right now.",
        "url": "https://news.sky.com/story/haunted-by-trump-deja-vu-ukraine-and-its-allies-are-in-a-perilous-moment-13474319",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-russia_7089196.jpg?20251122235352",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-11-22 23:44:00",
        "Headline": "A US-Russia peace plan that demands huge concessions of Ukraine has left Kyiv and its allies scrambling, organising last-minute crisis talks in Geneva where they hope to win Washington back around. ",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n There is a profound sense of deja vu surrounding the Ukraine crisis right now. It was only a few months ago that European leaders rushed to Washington after Donald Trump appeared to align with Vladimir Putin at their Alaska Summit. The Europeans gathered in Washington in August and appeared convinced that they had pulled Trump back around to their mindset: that unity and strength, not capitulation, is the answer for Ukraine.  Well, this week it is possible (some sources say probable) that European leaders will again head to Washington for another attempt to pull Trump back. Ukraine live: Trump suggests peace plan 'not final offer' Ukraine and its allies head to Geneva The meeting in Geneva on Sunday is absolutely pivotal. It was billed initially as a meeting between the Americans and the Ukrainians. But it has since morphed into a wider meeting with a number of European countries sending senior officials. The core meeting is still expected to be between US envoy Steve Witkoff and the Ukrainians, but sideline talks will now take place with a much wider group of nations. Many European leaders have spoken to President Trump on Friday and Saturday and plan to do so again. I am told Keir Starmer's conversation with him was \"good, short but productive.\"  Britain's national security adviser, Jonathan Powell, will be in Geneva. Over the last nine months, he has emerged as an important British influence on the Trump administration. He is close to Witkoff - who co-wrote or at least signed off on the 28-point plan. However, the Powell-Witkoff relationship is clearly not close enough to have afforded the UK a heads-up on this latest peace plan. 'Sudden injection' One source told me that the \"sudden injection\" by the Americans had \"been surprising.\" The American decision to put a rocket under the quest for peace in Ukraine appeared to have vice president JD Vance's fingerprints on it. The territorial elements of the peace plan are almost identical to a proposal put forward by Vance in the summer of 2024 before Trump won the election. Read more:Trump's 28-point Ukraine peace plan in fullStarmer reveals Trump peace plan 'concern' at G20Europe scrambles for counter-proposal to US-Russian plan Vance's stance on Ukraine has always leant towards questioning the point of it all. He led the attacks of Volodymyr Zelenskyy at the Oval Office in February. The US secretary of the army, Dan Driscoll, who has taken a lead in the conversions with Ukrainian officials, is a friend and ally of Vance - the two were at Yale together. Vance has also been leading calls for his own administration to spend more time on \"the home front\". This sudden momentum on Ukraine could be an attempt to draw a line under it quickly in order to focus attention domestically.  The week ahead So - things to look out for now: first, the Geneva meeting on Sunday - this is pivotal and will set the tone and the agenda for the days ahead. It is day-by-day at the moment. Out of the Geneva meeting, a meeting of the European \"coalition of the willing\" countries will convene. And following that, a contingent of European leaders heading to Washington seems likely - perhaps on Tuesday. By Wednesday, America begins to wind down for the biggest holiday of the year - Thanksgiving. Trump's deadline for an agreement by Thanksgiving still feels improbable, but it's not impossible that some sort of memorandum of understanding could be signed by then. 👉 Listen to Sky News Daily on your podcast app 👈 This would ensure momentum remains in the process and Trump is kept encouraged on progress. He has suggested that the deadline is movable, and that the deal proposed in the 28-point plan is not the final one. Notwithstanding all this, there is no question that this moment, for Ukraine and for Europe, is perilous and ominous."
    },
    {
        "title": "Ex-Brazil president Jair Bolsonaro 'tried to open ankle monitor' with soldering iron in 'escape attempt', court documents allege",
        "description": "Former Brazilian president Jair Bolsonaro has been arrested after allegedly trying to open his ankle monitor with a soldering iron in a bid to flee and avoid a jail term, according to court documents.",
        "url": "https://news.sky.com/story/ex-brazil-president-jair-bolsonaro-tried-to-open-ankle-monitor-with-soldering-iron-in-escape-attempt-court-documents-allege-13473926",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bolsonaro-brazil_7088442.jpg?20251122141605",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-22 13:26:00",
        "Headline": "Brazil's Supreme Court ordered the arrest of Jair Bolsonaro, convicted over a 2022 coup attempt, after his ankle tag was allegedly tampered with.",
        "Content": "Former Brazilian president Jair Bolsonaro has been arrested after allegedly trying to open his ankle monitor with a soldering iron in a bid to flee and avoid a jail term, according to court documents. Brazil's Supreme Court ordered the detainment of Bolsonaro, who was sentenced to 27 years in prison in September for leading a coup attempt after losing the 2022 election, early on Saturday. The 70-year-old - who had been under house arrest - was taken to the headquarters of the country's federal police in the capital, Brasilia.   Supreme Court Justice Alexandre de Moraes, who oversaw the case, said in his ruling that Bolsonaro's ankle monitor, which he has worn since July after being deemed a flight risk, had been tampered with early on Saturday. According to court documents, the ankle monitor showed \"clear and significant signs of malfunction\", with burn marks around it. \"That information shows the intent of the convict to break the ankle monitoring to assure his escape is successful, which would be made easier by the confusion that would be caused by a demonstration organised by his son,\" he said. Bolsonaro's lawyers denied the ankle monitor claims in a statement. Mr De Moraes added that there was a chance of Bolsonaro fleeing to an embassy in his neighbourhood to request political asylum. The justice also referenced other defendants in the coup case who had left Brazil to avoid prison. The Supreme Court panel hearing Bolsonaro's case will vote on the justice's order in an extraordinary session Monday. Mr De Moraes mentioned in his ruling a video published this week by senator Flavio Bolsonaro, one of the former president's sons, in which he encouraged supporters to take to the streets. \"The video stimulates the disrespect to the constitutional text, to the judicial decision and to [democratic] institutions, showing there's no limits for the criminal organisation in its attempt to create chaos and conflict in this country, in a total disrespect to democracy,\" Mr De Moraes wrote. Some of Bolsonaro's supporters, who claim he is being politically persecuted, are expected to rally outside the federal police headquarters. Bolsonaro was placed under house arrest in early August, weeks before he was convicted in his coup trial. His lawyers were pleading with Brazil's Supreme Court to keep him at home to serve his sentence, citing his poor health. Read more from Sky News:Starmer talks at G20 - but Trump boycottsEurope scrambles for Ukraine counter-proposal Local media reported Bolsonaro, Brazil's president from 2019 to 2022, was expected to begin serving his sentence sometime next week after he exhausted all appeals against his conviction. Bolsonaro and several of his allies were convicted by a panel of Supreme Court justices for attempting to overthrow Brazil's democracy following his election loss to President Luiz Inacio Lula da Silva. Bolsonaro denied wrongdoing."
    },
    {
        "title": "What did COP30 achieve after failing to reach deal on fossil fuels?",
        "description": "Well, it could have been worse.",
        "url": "https://news.sky.com/story/what-did-cop30-achieve-after-failing-to-reach-deal-on-fossil-fuels-13474235",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brazil-cop_7089022.jpg?20251122192853",
        "type": "World",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-22 19:05:00",
        "Headline": "This was the first COP to happen after being hollowed out by the absence of a climate-denying United States.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Well, it could have been worse. This was the first COP to happen after being hollowed out by the absence of a climate-denying United States. Also, in the shadow of cost-of-living, trade and conflict crises, few governments brought their A-game.  There were fears, too, that the tropical heat and crumbling infrastructure of the Amazon's seaport, Belem, would result in chaos.  But despite deafening Amazonian downpours drumming on the canvas of the temporary venue and even a fire, the summit concluded its business. The failure to agree, or even to agree to disagree, on a \"roadmap\", a discussion paper, about how best to phase out the use of fossil fuels was a major failure - though absolutely no surprise. \n                  Countries agree compromise climate deal at COP30 - but omit mention of fossil fuels\n                 \n                  'COP is a nightmare but best process we've got', says Ed Miliband as climate talks run into overtime\n                 \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                  COPs continue to operate around consensus. Many compromises are made, but just one country can veto a proposal. In the case of fossil fuels, it was a group of oil producers led by Saudi Arabia that saw to it that even talking about how to move on from oil and gas never made it. A staggering thought, given this was the first COP to take place in a world that had just experienced a year that was warmer than at any time in modern human history. But perhaps because of new global realities, this COP did achieve something others have rarely done. It broke new ground and started important conversations about key issues that had received little attention before. Like how trade must be aligned with the already rapid transition away from fossil fuels that is under way in many countries. Also, how critical minerals and access to them must be given similar attention as fossil fuels, given their essential role in building alternative energy sources. And while a plan to phase out fossil fuels didn't get \"gavelled through\", the conversation has started and it's not going to stop. There was progress too on forests - you'd have hoped there would be from a COP surrounded by rainforest - and Brazil's centrepiece Tropical Forests Forever Facility managed to win $5.5bn worth of support despite most nations' coffers being bare.  Brazil also brought a quiet but necessary shift in paradigm to the talks. For a decade, COPs have been dominated by countries like the UK, EU states and, until last year, the US, pressing for change because of the economic and societal opportunities that a green transition will bring. The host country, rich in forests and indigenous groups who understand better than nearly anyone our economies' total dependence on nature, argued that action was, instead, a moral imperative. Read more:Countries agree compromise climate dealRecord for wind-powered energy in UK \"We already possess virtually all the technical solutions for climate change, biodiversity loss, and even pressing social issues,\" minister Marina Silva told delegates. \"What is needed is the ethical commitment to apply our technical capabilities and accelerate our political decisions, ensuring we fulfil what we've already committed to.\""
    },
    {
        "title": "Israel launches strikes on Gaza in further test of fragile ceasefire",
        "description": "Israel says it has begun striking Hamas targets in Gaza, reportedly killing at least 24 people, after what it called a \"blatant violation of the ceasefire agreement\".",
        "url": "https://news.sky.com/story/israel-launches-strikes-on-gaza-in-further-test-of-fragile-ceasefire-13473932",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gaza-city-israeli_7088562.jpg?20251122155107",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-22 13:55:00",
        "Headline": "Local authorities say Israeli airstrikes targeted a car in the densely populated Rimal neighbourhood of Gaza City and homes in other parts of the territory, including Deir al Balah and Nuseirat camp.",
        "Content": " Israel says it has begun striking Hamas targets in Gaza, reportedly killing at least 24 people, after what it called a \"blatant violation of the ceasefire agreement\". Local health authorities in Gaza said there had been four separate airstrikes. One hit a car in the densely populated Rimal neighbourhood of Gaza City, killing 11 people and wounding several others, they said.   At least 13 people died in strikes on houses near Al-Awda Hospital in central Gaza, Deir al Balah and Nuseirat camp, according to health officials in Gaza. They said at least 54 people, including children, have been injured in the four Israeli airstrikes. The Israeli military said there had been a \"blatant violation of the ceasefire agreement\" after what it called an \"armed terrorist\" crossed into Israeli-held territory and shot at troops in southern Gaza. It said no soldiers were hurt. In a statement, it said the gunman had exploited \"the humanitarian road in the area through which humanitarian aid enters southern Gaza\". A Hamas official rejected the Israeli military's allegations as baseless, calling them an \"excuse to kill\", adding the Palestinian group was committed to the ceasefire agreement. In a separate statement, Israel's military said its soldiers killed what it called five \"terrorists\" in two other incidents. It said three were shot dead in the Rafah area, while two others were killed when they crossed into Israeli-held areas in northern Gaza and advanced toward soldiers. The Israeli airstrikes are a further test of a fragile ceasefire with Hamas, which has held since 10 October following the two-year Gaza war. Read more from Sky News:COP30: Countries agree compromise climate dealStarmer addresses G20 summit - but Trump boycotts talks Israel pulled back its troops, and the flow of aid into the territory has increased. But violence has not completely halted. Palestinian health authorities say Israeli forces have killed 316 people in strikes on Gaza since the truce. Meanwhile, Israel says three of its soldiers have been killed since the ceasefire began and it has attacked scores of militants."
    },
    {
        "title": "Flights at Eindhoven Airport resume after drone sightings",
        "description": "Air traffic at Eindhoven Airport in the Netherlands was suspended following the sighting of multiple drones - but has since resumed.",
        "url": "https://news.sky.com/story/eindhoven-airport-closed-after-drone-sightings-13474270",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eindhoven-airport_7089100.jpg?20251122210327",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-22 20:34:00",
        "Headline": "The country's police and military were called to the site, the defence minister said in a post on X, and an investigation is ongoing.",
        "Content": " Air traffic at Eindhoven Airport in the Netherlands was suspended following the sighting of multiple drones - but has since resumed. Dutch minister of defence Ruben Brekelmans said defence counter-drone measures were \"ready to intervene\". The country's police and military were also on site, the minister said in a post on X, adding that an investigation is ongoing.   The airport in the south of the Netherlands is used for both military and civilian purposes. All types of air traffic were halted, Mr Brekelmans said. Flights resumed later, the defence minister announced just after 10pm UK time. It is still not known where the drones came from. The Dutch military on Friday evening had used weapons against drones sighted above the air force base in Volkel, some 25 miles (40km) northeast of Eindhoven, the defence ministry had said earlier on Saturday. Various airports in Europe were forced to temporarily close in September over drone sightings, including in Denmark, Norway and Copenhagen. Earlier in September, Russian drones were intercepted flying over Poland and Romania, while three Russian jets entered Estonian airspace without permission. Read more:Airport drone sightings: What we knowRussia is mastering a new type of drone that cannot be jammed The three incursions into NATO airspace fuelled concerns about the potential expansion of Russia's three-year war in Ukraine and have been seen as an attempt by Moscow to test the military alliance's response. Do airports have to completely close? No, airports do not have to implement a complete shutdown when a drone is detected, but it is typical to halt air traffic in and out of the space to avoid collisions. This has knock-on effects for travelling passengers, causing delays and flights being redirected elsewhere. It is the owner or operator of an individual airport that decides whether to close the facility, and for how long planes are halted."
    },
    {
        "title": "Europe scrambles for counter-proposal to US-Russian plan for Ukraine",
        "description": "The fast-moving developments on Trump's Ukraine peace deal are dominating the G20 summit in South Africa, as European leaders scramble to put together a counter-proposal to the US-Russia 28-point plan and reinsert Ukraine into these discussions.",
        "url": "https://news.sky.com/story/european-leaders-are-scrambling-for-counter-proposal-to-us-russian-peace-plan-for-ukraine-13473899",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-g20-prime-minister_7088334.jpg?20251122121410",
        "type": "World",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-22 12:09:00",
        "Headline": "Ukraine is in a tight spot. It cannot reject Washington outright - it relies on US military support to continue this war - but neither can it accept the terms of a deal that is acutely favourable to Russia.",
        "Content": "\n          Political editor\n              @BethRigby\n  The fast-moving developments on Trump's Ukraine peace deal are dominating the G20 summit in South Africa, as European leaders scramble to put together a counter-proposal to the US-Russia 28-point plan and reinsert Ukraine into these discussions. European countries are now working up proposals to put to President Trump ahead of his deadline of Thursday to agree a deal. Ukraine is in a tight spot. It cannot reject Washington outright - it relies on US military support to continue this war - but neither can it accept the terms of a deal that is acutely favourable to Russia, requiring Ukraine to give up territory not even occupied by Moscow and reducing its army. Overnight, the UK government has reiterated its position that any deal must deliver a \"just and lasting peace\". Ukraine war latest: Kyiv to discuss ending war in talks in Switzerland  The prime minister, who spoke with E3 allies President Macron of France, Chancellor Merz of Germany and President Zelenskyy of Ukraine on the phone on Friday, is having more conversations today with key partners as they work out how to handle Trump and improve this deal for Ukraine. One diplomatic source told me allies are being very careful not to criticise Trump or his approach for fear of exacerbating an already delicate situation. Instead, the prime minister is directing his attacks at Russia. Read more:Trump's 28-point Ukraine peace plan in fullAnalysis: We could all pay if Europe doesn't guarantee Ukraine's security \"There is only one country around the G20 table that is not calling for a ceasefire in Ukraine and one country that is deploying a barrage of drones and missiles to destroy livelihoods and murder innocent civilians,\" he said on Friday evening. \"Time and again, Russia pretends to be serious about peace, but its actions never live up to its words.\" On the Trump plan, the prime minister said allies are meetin on Saturday \"to discuss the current proposal on the table, and in support of Trump's push for peace, look at how we can strengthen this plan for the next phase of negotiations\". Strengthening the plan really means that they want to rebalance it towards Ukraine's position and make it tougher on Russia. \"Ukraine has been ready to negotiate for months, while Russia has stalled and continued its murderous rampage. That is why we must all work together with both the US and Ukraine, to secure a just and lasting peace once and for all,\" said the prime minister. \"We will continue to coordinate closely with Washington and Kyiv to achieve that. However, we cannot simply wait for peace. \"We must strain every sinew to secure it. We must cut off Putin's finance flows by ending our reliance on Russian gas. It won't be easy, but it's the right thing to do.\" Europeans hadn't even seen this deal earlier in the week, in a sign that the US is cutting other allies out of negotiations - for now at least. Starmer and other European leaders want to get to a position where Ukraine and Europe are at least at the table. There is some discussion about whether European leaders such as Macron and Meloni might travel to Washington to speak to Trump early next week in order to persuade him of the European and Ukrainian perspective, as leaders did last August following the US-Russian summit in Alaska. But Sky News understands there are no discussions about the PM travelling to Washington next week ahead of the budget."
    },
    {
        "title": "Ukraine peace plan 'not final offer' Trump says, ahead of crisis talks in Geneva",
        "description": "Donald Trump has said that the US-Russia peace plan is \"by far\" not the \"final offer\", ahead of crisis talks in Geneva.",
        "url": "https://news.sky.com/story/sir-keir-starmer-addresses-g20-summit-in-south-africa-but-donald-trump-boycotts-talks-13473884",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-macron-g20_7088319.jpg?20251122115240",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-22 10:32:00",
        "Headline": "Donald Trump has said that the US-Russia peace plan for Ukraine is not the final offer, after unease from European allies over the concessions it demanded of Kyiv.",
        "Content": " Donald Trump has said that the US-Russia peace plan is \"by far\" not the \"final offer\", ahead of crisis talks in Geneva. The G20 summit in South Africa was overshadowed by news of a peace plan for Ukraine, which demanded significant concessions from Kyiv and was drawn up by Kremlin adviser Dmitriev Kirill and Trump official Steve Witkoff. The agenda of the meeting was to make progress on solving some of the problems afflicting the world's poorest nations, but following the release of a draft copy of a US-backed 28-point peace plan European and Western nations scrambled to respond. Follow the latest on the Ukraine peace plan It led to a meeting being hastily convened in Geneva, Switzerland, on Sunday, where representatives from the US and Ukraine will meet, along with Britain, France, Germany, the EU and more. The plan closely resembles the list of demands repeatedly stated by the Kremlin since it launched its full-scale invasion of Ukraine nearly four years ago and if adopted, would see Ukraine cede territory to Russia - and cut the size of its military. Mixed US signals There were mixed signals coming out of Washington on Saturday night. Mr Trump told reporters outside the White House that the 28-point plan was not the \"final offer\" when asked. He said: \"We'd like to get the peace, it should've happened a long time ago. The Ukraine war with Russia should've never happened. If I was president, it would have never happened. We're trying to get it ended. One way or another, we have to get it ended.\"  However, despite Mr Trump accepting the plan - he previously said Volodymyr Zelenskyy would \"have to approve it\" - US secretary of state Marco Rubio told senators who criticised the plan it was a \"Russian wish list\". From South Africa to Geneva In light of the draft plan being published and the European and Western response, crisis talks are being held in Geneva on Sunday. Ahead of the meeting, foreign ministers from Britain and Ukraine spoke to \"coordinate\" positions, and Sir Keir Starmer and Mr Zelenskyy spoke. Sir Keir also spoke to Mr Trump, relaying discussions held at G20 to the US leader, according to a Downing Street spokesperson, who added that the two leaders would speak again on Sunday and their teams would work together on the 28-point peace plan. Trump plan 'requires additional work' Ukraine's European and Western allies pushed out a united message from the G20, repeatedly welcoming the plan as a good start, but warning, in the words of French President Emmanuel Macron, that it needed to be \"strengthened\". Sir Keir told reporters in Johannesburg: \"We are concerned about [caps on military], because it's fundamental that Ukraine has to be able to defend itself if there's a ceasefire.\" He added the proposal, which will be discussed by US, Ukrainian and European national security advisers (NSAs) in Switzerland on Sunday, \"requires additional work\". \"And that's why there's been the agreement that in Geneva tomorrow [Sunday], you'll have senior US personnel, you'll have European NSAs [national security advisers], including the UK NSA, and obviously Ukrainians there to work further on the draft.\"  President Trump has said he wants a response to the peace plan from Ukraine by Thursday. What is the role of the G20? The role of the G20 is critical at this moment,\" said Sir Keir, who has defended his decision to fly to the G20 days before a difficult budget. \"The G20 has worked together before to fix fundamental problems in the global economy. We need to find ways to play a constructive role again today in the face of the world challenges. \"I'd like to see us come together around a five-point plan for growth that leaves no one behind.\" The US, however, is boycotting the talks. The Trump administration made its opposition to South Africa's G20 agenda clear earlier this year when the country started holding meetings ahead of the summit. South Africa gets to set the agenda as the country holding the rotating G20 presidency. G20 leaders broke with tradition and adopted a declaration at the start of their summit - despite opposition from the US. Vincent Magwenya, spokesman for South African president Cyril Ramaphosa, said a leaders' declaration was adopted unanimously in Johannesburg. The White House later accused South Africa of refusing to facilitate a smooth transition of the G20 presidency. Read more:Analysis: Europe scrambles at G20 over Ukraine peace planeG20 lands in South Africa: But who feels forgotten? The G20 bloc was formed in 1999 as a bridge between rich and poor nations to confront global financial crises. While it often operates in the shadow of the powerful Group of Seven nations, G20 members represent around 85% of the world's economy, 75% of international trade and more than half the global population."
    },
    {
        "title": "Marjorie Taylor Greene: Former Trump ally turned critic announces sudden resignation",
        "description": "Marjorie Taylor Greene - a one-time MAGA ally who has turned into a fierce critic of Donald Trump - has unexpectedly announced she is resigning from Congress.",
        "url": "https://news.sky.com/story/marjorie-taylor-greene-former-trump-ally-turned-critic-announces-sudden-resignation-13473807",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-greene-maga_7088062.jpg?20251122020409",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-22 01:11:00",
        "Headline": "A few days ago, Ms Greene had warned the breakdown in relations with the White House had led to her construction company receiving a pipe bomb threat.",
        "Content": " Marjorie Taylor Greene - a one-time MAGA ally who has turned into a fierce critic of Donald Trump - has unexpectedly announced she is resigning from Congress. Her relationship with the president has deteriorated in recent months, and she had vocally campaigned for the justice department to release all of its files concerning the convicted paedophile Jeffrey Epstein. Mr Trump has been fiercely critical about Ms Greene on Truth Social - describing her as a \"lunatic\".  In a statement posted on X, she wrote: \"Standing up for American women who were raped at 14, trafficked and used by rich powerful men, should not result in me being called a traitor and threatened by the President of the United States, whom I fought for.\" Ms Greene went on to confirm her last day in office will be on January 5 - with Mr Trump telling ABC that it is \"great news for the country\". The US president later posted on his Truth Social platform: \"Marjorie 'Traitor' Brown, because of PLUMMETING Poll Numbers, and not wanting to face a Primary Challenger with a strong Trump Endorsement (where she would have no chance of winning!), has decided to call it 'quits.'\" He added: \"For some reason, primarily that I refused to return her never ending barrage of phone calls, Marjorie went BAD. \n                  'Silence speaks volumes': Andrew criticised by US politicians after missing interview deadline \n                 \n                  Epstein files: Bill to release documents gets all-clear from Congress\n                 \n                  Nancy Pelosi, the first woman in Speaker's office, to stand down after 40 years in US Congress\n                 \"Nevertheless, I will always appreciate Marjorie, and thank her for her service to our Country! President DJT.\" The hard-right Republican was one of the most aggressive spokespeople for the Make America Great Again movement - and had become infamous for her combative encounters with journalists, including Sky's Martha Kelner. She was known for her susceptibility to conspiracy theories, and was widely denounced for comparing COVID-19 masks and vaccinations to the persecution of Jews during the Holocaust. On social media, she had made posts advocating violence against Democrat opponents - and casting doubt on the 9/11 terror attacks and the school mass shootings at Parkland and Sandy Hook. US correspondent Usually, the resignation of a House representative wouldn't be bombshell news - but Marjorie Taylor Greene has become one of the most famous politicians in the US. If \"Make America Great Again\" was in the dictionary, it would be her picture next to it - wearing a baseball cap bearing that slogan. She had been an integral part of the MAGA movement since day one, the female version of Donald Trump. That's why her split from the president on several issues - most recently the Epstein files - has been so stunning.\n\n Read Martha's full analysis here. The bond between Ms Greene and Mr Trump started to break down after she lambasted his foreign policy - describing it as \"America Last\". Mr Trump branded her a \"traitor\" and \"wacky\" and said he would endorse a challenger against her when she ran for reelection next year. In a brief phone call on Friday night, the US president told ABC News that Ms Greene's resignation was \"great news for the country.\" He said had no plans to speak with her but wishes her well. Last week, Mr Trump had announced that he was withdrawing his support and endorsement for the 51-year-old, who had been expected to run for re-election in Georgia's 14th congressional district next November. In her resignation statement, Ms Greene said: \"I have too much self-respect and dignity, love my family way too much, and do not want my sweet district to have to endure a hurtful and hateful primary against me by the president we all fought for, only to fight and win my election while Republicans will likely lose the midterms.\" Read more US news:Trump says Ukraine will have to accept peace planPresident orders release of Jeffrey Epstein files A few days ago, Ms Greene had warned the breakdown in relations with the White House had led to her construction company receiving a pipe bomb threat. She had written on X: \"President Trump's unwarranted and vicious attacks against me were a dog whistle to dangerous radicals that could lead to serious attacks on me and my family.\" Ms Greene went on to warn his inflammatory rhetoric \"puts blood in the water and creates a feeding frenzy that could ultimately lead to a harmful or even deadly outcome\"."
    },
    {
        "title": "Haunted by Trump deja vu, Ukraine and its allies are in a perilous moment",
        "description": "There is a profound sense of deja vu surrounding the Ukraine crisis right now.",
        "url": "https://news.sky.com/story/haunted-by-trump-deja-vu-ukraine-and-its-allies-are-in-a-perilous-moment-13474319",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukraine-russia_7089196.jpg?20251122235352",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-11-22 23:44:00",
        "Headline": "A US-Russia peace plan that demands huge concessions of Ukraine has left Kyiv and its allies scrambling, organising last-minute crisis talks in Geneva where they hope to win Washington back around. ",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n There is a profound sense of deja vu surrounding the Ukraine crisis right now. It was only a few months ago that European leaders rushed to Washington after Donald Trump appeared to align with Vladimir Putin at their Alaska Summit. The Europeans gathered in Washington in August and appeared convinced that they had pulled Trump back around to their mindset: that unity and strength, not capitulation, is the answer for Ukraine.  Well, this week it is possible (some sources say probable) that European leaders will again head to Washington for another attempt to pull Trump back. Ukraine live: Trump suggests peace plan 'not final offer' Ukraine and its allies head to Geneva The meeting in Geneva on Sunday is absolutely pivotal. It was billed initially as a meeting between the Americans and the Ukrainians. But it has since morphed into a wider meeting with a number of European countries sending senior officials. The core meeting is still expected to be between US envoy Steve Witkoff and the Ukrainians, but sideline talks will now take place with a much wider group of nations. Many European leaders have spoken to President Trump on Friday and Saturday and plan to do so again. I am told Keir Starmer's conversation with him was \"good, short but productive.\"  Britain's national security adviser, Jonathan Powell, will be in Geneva. Over the last nine months, he has emerged as an important British influence on the Trump administration. He is close to Witkoff - who co-wrote or at least signed off on the 28-point plan. However, the Powell-Witkoff relationship is clearly not close enough to have afforded the UK a heads-up on this latest peace plan. 'Sudden injection' One source told me that the \"sudden injection\" by the Americans had \"been surprising.\" The American decision to put a rocket under the quest for peace in Ukraine appeared to have vice president JD Vance's fingerprints on it. The territorial elements of the peace plan are almost identical to a proposal put forward by Vance in the summer of 2024 before Trump won the election. Read more:Trump's 28-point Ukraine peace plan in fullStarmer reveals Trump peace plan 'concern' at G20Europe scrambles for counter-proposal to US-Russian plan Vance's stance on Ukraine has always leant towards questioning the point of it all. He led the attacks of Volodymyr Zelenskyy at the Oval Office in February. The US secretary of the army, Dan Driscoll, who has taken a lead in the conversions with Ukrainian officials, is a friend and ally of Vance - the two were at Yale together. Vance has also been leading calls for his own administration to spend more time on \"the home front\". This sudden momentum on Ukraine could be an attempt to draw a line under it quickly in order to focus attention domestically.  The week ahead So - things to look out for now: first, the Geneva meeting on Sunday - this is pivotal and will set the tone and the agenda for the days ahead. It is day-by-day at the moment. Out of the Geneva meeting, a meeting of the European \"coalition of the willing\" countries will convene. And following that, a contingent of European leaders heading to Washington seems likely - perhaps on Tuesday. By Wednesday, America begins to wind down for the biggest holiday of the year - Thanksgiving. Trump's deadline for an agreement by Thanksgiving still feels improbable, but it's not impossible that some sort of memorandum of understanding could be signed by then. 👉 Listen to Sky News Daily on your podcast app 👈 This would ensure momentum remains in the process and Trump is kept encouraged on progress. He has suggested that the deadline is movable, and that the deal proposed in the 28-point plan is not the final one. Notwithstanding all this, there is no question that this moment, for Ukraine and for Europe, is perilous and ominous."
    },
    {
        "title": "Marjorie Taylor Greene's sudden resignation shows MAGA is fraying at the seams",
        "description": "Usually, the resignation of a House representative wouldn't be bombshell news - but Marjorie Taylor Greene has become one of the most famous politicians in the US.",
        "url": "https://news.sky.com/story/marjorie-taylor-greene-had-been-a-key-part-of-maga-since-day-one-what-will-she-do-next-13473817",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-marjorie-taylor-greene_7088085.jpg?20251122033252",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-11-22 03:25:00",
        "Headline": "The Trump supporter-turned-critic says she is resigning from office because she doesn't want her congressional district in Georgia to have to endure \"a hurtful and hateful primary\" - but it is also true she would have faced an uphill battle to be re-elected.",
        "Content": "\n          US correspondent\n              @marthakelner\n  Usually, the resignation of a House representative wouldn't be bombshell news - but Marjorie Taylor Greene has become one of the most famous politicians in the US. If \"Make America Great Again\" was in the dictionary, it would be her picture next to it - wearing a baseball cap bearing that slogan. She had been an integral part of the MAGA movement since day one, the female version of Donald Trump. That's why her split from the president on several issues - most recently the Epstein files - has been so stunning. Trump was once a mentor to her, and she a devoted and formidable campaigner for him and his politics. Greene's resignation video - in which she talks of feeling like a \"battered wife\" - shows that MAGA is fraying at the seams. The Georgia representative claimed that if she had been cast aside by \"MAGA Inc\", it is also the case \"many common Americans have been cast aside and replaced as well\". \n                  Haunted by Trump deja vu, Ukraine and its allies are in a perilous moment\n                 \n                  Starmer 'playing whack-a-mole' to keep US on side - but will it be enough?\n                 \n                  Ukraine peace plan 'not final offer' Trump says, ahead of crisis talks in Geneva\n                 Could she be laying the groundwork for a run at higher office in 2028 by depicting herself as a champion of ordinary Americans? Perhaps. Her path forward after prematurely ending her term in January is unclear. She could also be considering a career in the media, being so comfortable in front of the cameras.  We don't know the exact reason behind this very public political divorce, but it has been fascinating to witness. Trump and Greene were once aligned across the board, but their relationship has ruptured in multiple ways. She suggested the president had abandoned his \"America First\" platform by having a turnstile of foreign leaders through the Oval Office - but it is over the Epstein files that their schism exploded. Greene, once reviled by Democrats for her outrage politics, joined colleagues across the aisle to support the bill to release the files. Read more US news:Trump says Ukraine will have to accept peace planGrammy-winning rapper jailed for 14 years  A woman who claimed that wildfires in California were caused by space lasers operated by Jewish people - and called Muslim-American members of Congress \"the jihad squad\" - was now soberly standing alongside Epstein survivors. It prompted Trump to nickname her Marjorie \"Traitor\" Greene - her defiance had clearly got under his skin. She says she is stepping down because she doesn't want her congressional district in Georgia to have to endure \"a hurtful and hateful primary\". But it is also true she would have faced an uphill battle to be re-elected, especially without the president's support."
    },
    {
        "title": "Anyone expecting a showdown when Trump met Mamdani got a pretty big surprise ",
        "description": "Trump versus Mamdani was billed as the big showdown.&#160;",
        "url": "https://news.sky.com/story/anyone-expecting-a-showdown-when-trump-met-mamdani-got-a-pretty-big-surprise-13473803",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-mamdani_7088045.jpg?20251122003354",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-11-22 00:29:00",
        "Headline": "Against a backdrop of hate came an outbreak of harmony in the Oval Office - but there's still a danger of political conflict in the future.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  Trump versus Mamdani was billed as the big showdown.  But for anyone anticipating fireworks, it was the big let down - less \"fight night\" and more \"date night\". Fox News might have had it right when their presenter turned to camera and said: \"I think [Vice President] JD Vance is jealous.\" For this Oval Office spectacle, Donald Trump was choreographer-in-chief. It was no fireside chat for New York City's mayor-elect, but an invitation to stand at the end of the Resolute Desk. This is where the president places guests asking for a selfie - and it has the look of being summoned to the headmaster's office. Maybe that was the plan. The talk had been of a Zelenskyy-esque meltdown in the White House. \n                  Haunted by Trump deja vu, Ukraine and its allies are in a perilous moment\n                 \n                  Starmer 'playing whack-a-mole' to keep US on side - but will it be enough?\n                 \n                  Ukraine peace plan 'not final offer' Trump says, ahead of crisis talks in Geneva\n                 These men appeared to harbour an extreme dislike for the other - each eyeing the other as a foe. It was intense.  Trump had railed against \"communist\" Mamdani (he's actually a Democratic socialist) and threatened to have the Ugandan-born politician arrested and deported. For his part, Mamdani had branded Trump a \"fascist\" and spoke of \"Trump-proofing\" New York. And yet, fast forward to the Oval Office. Against a backdrop of hate came an outbreak of harmony. Seated and standing, it was all smiles and pragmatic talk by two New Yorkers talking about home and how to improve. Two men from Queens had common ground and it bonded them. Suddenly, Trump's threat to withhold $10bn (£7.6bn) from the city if Mamdani won felt so last month. Read more US news:Trump says Ukraine will have to accept peace planGrammy-winning rapper jailed for 14 years'I SIGNED THE BILL': Trump orders release of Epstein files Journalists' questions were spikier than the answers. Mamdani was asked about calling Trump a fascist. \"You could just say yes,\" the president told him. He joked: \"I've been called much worse than a despot.\" Even authoritarianism got a laugh amidst the bonhomie. Trump answered \"no\" when asked if he viewed Mamdani as a \"jihadist\" - a description used by an ally running for New York governor. \"I met with a man who's a very rational person,\" Trump said. \"I met with a man who really wants to see New York be great again.\"  So far, so amiable. In each other's company, we didn't see an outbreak of political conflict, the like of which both men are capable. Many in the Democratic movement see Mamdani as a man who has found the secret ingredients to reversing their decline against Trump's Republican Party. New York City's mayor-elect, a well-known football fan, headed home in a DC ambience - this, clearly, not a day for aggro or for showing his hand. There will be others soon enough."
    },
    {
        "title": "'Silence speaks volumes': Andrew criticised by US politicians after missing interview deadline ",
        "description": "Andrew Mountbatten-Windsor has been criticised by US politicians after he failed to respond to their request for an interview.",
        "url": "https://news.sky.com/story/silence-speaks-volumes-andrew-criticised-by-us-politicians-after-missing-interview-deadline-13473812",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-duke-of-york_7056916.jpg?20251031093012",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-22 02:35:00",
        "Headline": "\"The documents we've reviewed, along with public records and Virginia Roberts Giuffre's testimony, raise serious questions he must answer, yet he continues to hide,\" two congressmen say.",
        "Content": "Andrew Mountbatten-Windsor has been criticised by US politicians after he failed to respond to their request for an interview. The House Committee on Oversight and Government Reform had asked the former prince to cooperate with its investigation into Jeffrey Epstein's sex trafficking operations. Andrew was told in a letter: \"Allegations against you, along with your long-standing friendship with Mr Epstein, indicate that you may possess knowledge of his activities.\" He was asked to reply by 20 November - but two of the committee's members say the 65-year-old has not complied with this deadline.  Ranking member Robert Garcia and Congressman Suhas Subramanyam said Andrew's silence \"speaks volumes\". In a statement, they warned: \"The documents we've reviewed, along with public records and Virginia Roberts Giuffre's testimony, raise serious questions he must answer, yet he continues to hide. \"Our work will move forward with or without him, and we will hold anyone who was involved in these crimes accountable, no matter their wealth, status, or political party. We will get justice for the survivors.\" \n                  Starmer urges anyone with information on Epstein case to come forward - after Andrew misses Congress deadline\n                 \n                  Deadline day for Andrew to respond to Epstein inquiry - but it's hard to imagine why he'd talk\n                 \n                  Epstein said Andrew did have photo taken with Virginia Giuffre, emails show\n                 As our royal correspondent Rhiannon Mills noted earlier this week, Andrew is not legally obliged to talk to Congress. \"The only time he has spoken at length about the allegations against him and his relationship with Epstein was that Newsnight interview in 2019, and we all know how much of a disaster that was,\" she wrote in an analysis piece on Thursday.  Virginia Giuffre died by suicide in April - and last month, her posthumous memoir detailed alleged sexual encounters with Andrew when she was a teenager. She also spoke of her battle to escape the control of Epstein and his ex-girlfriend Ghislaine Maxwell, who is currently serving a 20-year sentence for sex trafficking. \"In my years with them, they lent me out to scores of wealthy, powerful people. I was habitually used and humiliated - and in some instances, choked, beaten, and bloodied,\" Ms Giuffre had written in her book Nobody's Girl. Andrew has always vigorously denied all the accusations against him - and was formally stripped of his titles as prince and Duke of York earlier this month. Read more from Sky News:Former Trump ally turned critic suddenly resignsChristmas travel chaos expected amid strikes  Damaging newspaper allegations have also emerged that he tried to get the Metropolitan Police to dig up dirt for a smear campaign against Ms Giuffre. The force previously said it was looking into the reports after The Mail on Sunday claimed he had passed her date of birth and social security number to his taxpayer-funded bodyguard in 2011 and asked him to investigate. Earlier this week, Congress voted to force the US justice department to release all its files related to Epstein. Donald Trump, who has changed course and now describes these files as a Democratic \"hoax\", has signed a bill that will pave the way for these documents to be made public within 30 days. Emails, photos and other documents released by Congress in recent weeks have included references to Mr Trump, the UK's since sacked US ambassador Lord Mandelson, and Andrew. Like Mr Trump, both Britons have denied any wrongdoing and expressed regret about their relationship with Epstein."
    },
    {
        "title": "Four shot at Christmas tree lighting ceremony in US - three in 'critical' condition",
        "description": "Four people have been shot at a Christmas tree lighting ceremony in North Carolina, according to police.",
        "url": "https://news.sky.com/story/four-shot-at-christmas-tree-lighting-ceremony-three-in-critical-condition-13473874",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bauble-christmas_7088276.jpg?20251122095457",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-22 09:20:00",
        "Headline": "Police in North Carolina, US, have asked anyone with videos or photos of the shootings to share them with police.",
        "Content": "Four people have been shot at a Christmas tree lighting ceremony in North Carolina, according to police. Police in Concord said three of the victims are in a \"critical\" condition following the incident. They have appealed for witnesses, and officers are reviewing footage of the event - which was advertised as \"family friendly\". The shooting happened on Union Street South, close to the intersection with Corban Avenue. A police statement read: \"Concord Police, Concord Fire, and Cabarrus County EMS personnel were already at the event and responded immediately, providing medical aid and evacuating attendees. \"Four gunshot wound victims were transported to the hospital. Three are in critical condition and one is in stable condition. \"Police are reviewing footage from the event and speaking with multiple witnesses.\" Read more US news:Marjorie Taylor Greene announces resignationElvis wig judge leaves building The city's 28th annual tree lighting ceremony was also set to feature a showing of The Grinch on a large screen, as well as live music and fireworks."
    },
    {
        "title": "US issues warning to airlines flying over Venezuela amid 'heightened military activity'",
        "description": "Major airlines have been warned of a \"potentially hazardous situation\" when flying over Venezuela.",
        "url": "https://news.sky.com/story/us-issues-warning-to-airlines-flying-over-venezuela-amid-heightened-military-activity-13473867",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-venezuela-president_7088262.jpg?20251122092243",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-22 08:53:00",
        "Headline": "Aviation authorities cite a \"worsening security situation\" amid a huge US military build-up in the region in recent months.",
        "Content": "Major airlines have been warned of a \"potentially hazardous situation\" when flying over Venezuela. The Federal Aviation Administration (FAA) warning comes just days after the US navy's largest aircraft carrier, USS Gerald R Ford, arrived in the Caribbean Sea, in what has been interpreted as a show of military power and a possible threat to Venezuela's Nicolas Maduro regime. The Trump administration does not see Mr Maduro, who faces narcoterrorism charges in the US, as the legitimate leader of the South American country. The administration has carried out a series of strikes on small boats in the Caribbean Sea and eastern Pacific Ocean that it accuses of ferrying drugs to the US, killing over 80 people since the campaign started in early September.  Mr Trump has indicated that military action would expand beyond strikes by sea, saying the US would \"stop the drugs coming in by land\". The US government has released no evidence to support its assertions that those killed in the boats were \"narcoterrorists\", however. The FAA notice on Friday cited the \"worsening security situation and heightened military activity in or around Venezuela\" and said threats could pose risks for aircraft at all altitudes. Read more: Hurricane Melissa devastation like 'world war', says OlympianJudge who wore Elvis wig in court has left the building There has been a huge American military build-up in the region in recent months, including at least eight other warships and F-35 aircraft. The arrival of the USS Gerald R Ford rounds off the largest increase in US firepower in the region in generations. The Ford's carrier strike group, which includes guided-missile destroyers and squadrons of fighter jets, transited the Anegada Passage near the British Virgin Islands on Sunday morning, the US navy said in a statement. Direct flights by US passenger or cargo carriers to Venezuela have been suspended since 2019, but some US airlines fly over the nation for some South American flights.  The order requires US airlines to provide the FAA with at least 72 hours advance notice of planned flights, but stopped short of preventing flights over the country. The FAA said since September there has been an increase in Global Navigation Satellite System interference in Venezuela, which in some cases caused lingering effects throughout a flight, as well as \"activity associated with increasing Venezuela military readiness\". \"Venezuela has conducted multiple military exercises and directed the mass mobilisation of thousands of military and reserve forces,\" the FAA said, adding that Venezuela had at no point expressed an intent to target civil aviation.  The agency said the Venezuelan military possessed advanced fighter aircraft and multiple weapons systems capable of reaching or exceeding civil aircraft operating altitudes, and there was potential low-altitude risk from air defence systems and anti-aircraft artillery. Mary Schiavo, a former inspector general for the Department of Transportation, said the US may be anticipating military action by Venezuela, or it could be planning further action against drug boats. She said it was difficult to read into this notice. When asked about the new warning, the Pentagon directed questions to the FAA, which simply confirmed the warning was issued and that it would last for 90 days. "
    },
    {
        "title": "Judge who wore Elvis wig in court has left the building ",
        "description": "A judge who wore an Elvis Presley wig in his courtroom - and played the singer's music from his phone - has left the building.",
        "url": "https://news.sky.com/story/judge-who-wore-elvis-wig-in-court-has-left-the-building-13473826",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-missouri-matthew-thornhill_7088101.png?20251122043248",
        "type": "US",
        "Author": "Connor Sephton",
        "Date Published": "2025-11-22 04:36:00",
        "Headline": "Court filings about his case are littered with photographs of Mr Thornhill posing in a plastic Elvis wig and sunglasses - which suggests the legendary singer was always on his mind.",
        "Content": "\n          News reporter\n              @ConnorSephton\n A judge who wore an Elvis Presley wig in his courtroom - and played the singer's music from his phone - has left the building. Judge Matthew Thornhill is facing a six-month suspension because of disciplinary action over his conduct in Missouri. Under the terms of an agreement, he would then serve for 18 months before resigning from the bench for good. Mr Thornhill said he had been trying \"to add levity at times when I thought it would help relax litigants\". But he was all shook up after a complaint was made, and conceded: \"I now recognise that this could affect the integrity and solemnity of the proceedings.\" Court filings about his case are littered with photographs of Mr Thornhill posing in a plastic Elvis wig and sunglasses - which suggests the legendary singer was always on his mind. It is claimed he would sometimes play The King's music as he entered the courtroom, and mention the singer's lyrics or date of birth even though it wasn't relevant. \n                  Woman admits trying to defraud Elvis Presley's family by auctioning off Graceland\n                 \n                  Woman charged over alleged scheme to fraudulently sell Elvis Presley's former home Graceland\n                 \n                  Elvis Presley's blue suede shoes expected to fetch up to £120,000 at auction\n                 Unfortunately for Mr Thornhill, strict rules in Missouri require judges to engage in a little less conversation. Read more from Sky News:Former Trump ally turned critic announces sudden resignationWhy there could be travel chaos on the trains at Christmas The commission says he violated guidelines designed to \"promote confidence in the integrity of the judiciary\". While he can't help falling in love with Elvis, the judge has also been accused of mentioning his political affiliation during cases - as well as preferred election candidates. Missouri Supreme Court is currently considering whether to accept the proposed penalty."
    },
    {
        "title": "Daily Mail owner in talks to buy Telegraph titles for £500m",
        "description": "The owner of the Daily Mail is in talks to buy the Daily Telegraph and its Sunday sister title for &#163;500m, a deal that would finally end the more-than two-year hiatus over their future.",
        "url": "https://news.sky.com/story/daily-mail-owner-in-talks-to-buy-telegraph-titles-for-163500m-13473868",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-telegraph-daily-telegraph_7088252.jpg?20251122090200",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-22 08:59:00",
        "Headline": "DMGT has confirmed a Sky News report that it has entered exclusive negotiations to buy the Daily and Sunday Telegraph newspapers and end the protracted hiatus over their ownership.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n  The owner of the Daily Mail is in talks to buy the Daily Telegraph and its Sunday sister title for £500m, a deal that would finally end the more-than two-year hiatus over their future. DMGT confirmed on Saturday morning Sky News's revelation on the social media platform X that it had entered exclusive negotiations to buy the broadsheet titles, less than two weeks after their sale to a consortium led by RedBird Capital Partners collapsed. In a statement, DMGT said the exclusivity period to combine the two national newspaper groups would be used to \"finalise the terms of the transaction and to prepare the necessary regulatory submissions\". A deal to combine the Mail and Telegraph titles will require scrutiny from the competition regulator, with the culture secretary, Lisa Nandy, also expected to be involved in the process. The collapse of the RedBird-led deal came after opposition from within the Telegraph's newsroom over reported links of its chairman, John Thornton, to influential Chinese state actors. Lord Rothermere, DMGT's controlling shareholder, had intended to acquire a minority stake of just under 10% in the Telegraph titles as part of the RedBird-led consortium. An earlier deal proposed by a consortium including RedBird and the Abu Dhabi state-owned investment firm IMI collapsed after the government changed the law regarding foreign state ownership of national newspapers. IMI was to have owned a 15% stake - the maximum permitted - under the more recent deal. \"I have long admired the Daily Telegraph,\" Lord Rothermere said. \"My family and I have an enduring love of newspapers and for the journalists who make them. \"The Daily Telegraph is Britain's largest and best quality broadsheet newspaper, and I have grown up respecting it. \"It has a remarkable history and has played a vital role in shaping Britain's national debate over many decades. \"Chris Evans is an excellent editor, and we intend to give him the resources to invest in the newsroom. \"Under our ownership, the Daily Telegraph will become a global brand, just as the Daily Mail has.\" A spokesman for RedBird IMI said: \"DMGT and RedBird IMI have worked swiftly to reach the agreement announced today, which will shortly be submitted to the Secretary of State.\" If the deal is completed, it would bring the Telegraph newspapers under the same stable of ownership as titles including Metro, The i Paper and New Scientist. DMGT said it planned \"to invest substantially in TMG [Telegraph Media Group] with the aim of accelerating its international expansion. \"It will focus particularly on the USA, where the Daily Mail is already successful, with established editorial and commercial operations.\""
    },
    {
        "title": "Struggling energy supplier Ovo to axe hundreds of jobs",
        "description": "Ovo Energy, one of Britain's biggest domestic gas and electricity suppliers, is preparing to take an axe to its workforce next week as part of efforts to convince regulators that it has a viable turnaround plan.",
        "url": "https://news.sky.com/story/struggling-energy-supplier-ovo-to-axe-hundreds-of-jobs-13473990",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ovo-energy-power_7032894.jpg?20250927100440",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-22 15:36:00",
        "Headline": "The household energy supplier is expected to confirm plans to axe \"several hundred\" jobs as soon as the middle of next week as it continues talks with regulators and investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ovo Energy, one of Britain's biggest domestic gas and electricity suppliers, is preparing to take an axe to its workforce next week as part of efforts to convince regulators that it has a viable turnaround plan. Sky News has learnt that Ovo, which serves about four million customers across the UK, is drawing up proposals to cut hundreds of jobs as early as Wednesday in a bid to save millions of pounds in costs. The redundancies - the precise scale of which could not be ascertained this weekend - are said to form part of a revised business plan submitted to Ofgem, the energy watchdog, which is focused on boosting the company's profitability. That plan is likely to include restrictions on taking on new customers while Ovo's finances are placed on a sustainable footing, according to industry sources. One insider suggested that \"several hundred\" jobs would be lost next week, although a spokeswoman for the company declined to quantify either the scale of the cuts or the size of Ovo's existing workforce. The redundancies will come less than a month after Ovo's chief executive, David Buttress, stepped down in the middle of a search for investors willing to pump hundreds of millions of pounds into the company. Mr Buttress, the former Just Eat chief who served a brief period as Boris Johnson's cost-of-living tsar, has been replaced by Chris Houghton, a former Ovo boss who worked alongside its founder, Stephen Fitzpatrick. Former Virgin Money chief Dame Jayne-Anne Gadhia was recently named chair of Ovo's retail energy arm. Ovo's customer base places it behind Octopus Energy and Centrica-owned British Gas in the household energy supply market, but it remains one of the most important companies in the sector. Its quest to raise roughly £300m of new equity has been ongoing for months, with bankers at Rothschild engaging in talks with numerous financial investors. Last month, Sky News revealed that a Norwegian investment group had abandoned talks about an investment amid concern that the industry's regulatory regime is obstructing efforts to attract new capital. Verdane, which is based in Oslo, had been in detailed talks as recently as this month about injecting a substantial sum into Ovo in return for a large stake in the business, while Iberdrola, the owner of Scottish Power, has also held tentative discussions about a possible tie-up. Investor uncertainty has been heightened by the energy regulator Ofgem's capital adequacy rules, with Ovo acknowledging recently that it - alongside larger rival Octopus Energy - had yet to fully comply with the regime, saying: \"We have taken proactive measures to align with Ofgem's new capital rules, working constructively to meet the requirements.\" Sky News reported this month that Ovo was not technically in breach of the capital adequacy regime because it had agreed a route with Ofgem to fulfilling its obligations. Ovo, which is backed by investors including Japan's Mitsubishi and the London-based investor Mayfair Equity Partners, disclosed in accounts published recently that there was \"material uncertainty\" over its future. The company has separately engaged advisers at Arma Partners to explore the sale of a stake in Kaluza, its software arm, echoing a similar move by Octopus Energy's Kraken division. Alongside Mr Fitzpatrick, the entrepreneur who now owns London's Kensington Roof Gardens, Ovo's other shareholders include Morgan Stanley Investment Management. Launched in 2009, the company positioned itself as a challenger brand offering superior service to the industry's established players. Ovo's transformational moment came in 2020, when it bought the retail supply arm of SSE, transforming it overnight into one of Britain's leading energy companies. Its growth has not been without difficulties, however, particularly in relation to its challenged relationship with Ofgem and a torrent of customer complaints about overcharging."
    },
    {
        "title": "Starmer 'playing whack-a-mole' to keep US on side - but will it be enough?",
        "description": "Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal.",
        "url": "https://news.sky.com/story/starmer-playing-whack-a-mole-to-keep-us-on-side-but-will-it-be-enough-13474045",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sir-keir-starmer-g20_7088645.jpg?20251122164142",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-22 16:57:00",
        "Headline": "The prime minister said there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva.",
        "Content": "\n          Political editor\n              @BethRigby\n  Keir Starmer flies out of South Africa this evening with two massive issues on his agenda - a potentially manifesto-busting budget and, as it stands, an unacceptable Ukrainian peace deal. As he prepared to depart for London, the prime minister confirmed he was dispatching national security adviser Jonathan Powell to Geneva for talks with US officials, other European security advisers and Ukrainian representatives - as Europe and Ukraine scramble to reinsert themselves into a plan drawn up between Washington and Moscow. The prime minister said on Saturday there was \"more to do on the plan\" in the coming days and the focus now was to try to make progress in Geneva. Follow the latest: European leaders raise concerns over plan for Ukraine   After speaking on the phone to Donald Trump, Downing Street said the pair agreed their teams would work together on the US leader's proposal in the Swiss city on Sunday. Starmer also reiterated Britain's \"steadfast support for Ukraine\" in a call with President Zelenskyy - as allies try to swing this deal more in Ukraine's favour, with the UK and other international leaders clear on their concerns to limit the size of the Ukrainian army and give up territory to Russia. But in his remarks on camera, the prime minister was at pains to neither criticise the current deal nor President Trump. One figure told me that the PM wants to act as a bridge between the Europeans and the US and has been playing a \"game of whack-a-mole\" over the past couple of days in an effort to keep others from publicly saying the deal is unacceptable for fear it would only serve to irritate President Trump and hurt Ukraine. Earlier, the prime minister said he would talk to his US counterpart in the coming days. \"I'm absolutely clear in my mind that President Trump wants a just and lasting peace, not just from the actions he's taken towards that end, but also from the private discussions that I've had with him,\" Mr Starmer said. \"So I know what he's trying to achieve. We all want to achieve that.\" But there will be a question about what the alternative options are if allies cannot improve this deal by President Trump's Thursday deadline. The first option is to try to improve it and also slow down the process and buy more time, but if that fails, are allies looking at scenarios where they try to shore up Ukraine's war efforts without the US support? The prime minister responded by talking about point five in the 28-point plan, in which Ukraine is offered security guarantees from the US. Read more:Trump's 28-point Ukraine peace plan in fullAnalysis: We could all pay if Europe doesn't step upStarmer addresses G20 summit - but Trump boycotts talks \"That fortifies in me the belief that what we're all trying to achieve here is a just and lasting peace will only be just as lasting if there are security guarantees,\" Mr Starmer said. \"And if we bear in mind that matters for Ukraine are always to be determined by Ukraine.\" The next 24 hours will be critical as the Europeans, Ukraine and other allies try to improve this deal."
    },
    {
        "title": "Europe scrambles for counter-proposal to US-Russian plan for Ukraine",
        "description": "The fast-moving developments on Trump's Ukraine peace deal are dominating the G20 summit in South Africa, as European leaders scramble to put together a counter-proposal to the US-Russia 28-point plan and reinsert Ukraine into these discussions.",
        "url": "https://news.sky.com/story/european-leaders-are-scrambling-for-counter-proposal-to-us-russian-peace-plan-for-ukraine-13473899",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-g20-prime-minister_7088334.jpg?20251122121410",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-11-22 12:09:00",
        "Headline": "Ukraine is in a tight spot. It cannot reject Washington outright - it relies on US military support to continue this war - but neither can it accept the terms of a deal that is acutely favourable to Russia.",
        "Content": "\n          Political editor\n              @BethRigby\n  The fast-moving developments on Trump's Ukraine peace deal are dominating the G20 summit in South Africa, as European leaders scramble to put together a counter-proposal to the US-Russia 28-point plan and reinsert Ukraine into these discussions. European countries are now working up proposals to put to President Trump ahead of his deadline of Thursday to agree a deal. Ukraine is in a tight spot. It cannot reject Washington outright - it relies on US military support to continue this war - but neither can it accept the terms of a deal that is acutely favourable to Russia, requiring Ukraine to give up territory not even occupied by Moscow and reducing its army. Overnight, the UK government has reiterated its position that any deal must deliver a \"just and lasting peace\". Ukraine war latest: Kyiv to discuss ending war in talks in Switzerland  The prime minister, who spoke with E3 allies President Macron of France, Chancellor Merz of Germany and President Zelenskyy of Ukraine on the phone on Friday, is having more conversations today with key partners as they work out how to handle Trump and improve this deal for Ukraine. One diplomatic source told me allies are being very careful not to criticise Trump or his approach for fear of exacerbating an already delicate situation. Instead, the prime minister is directing his attacks at Russia. Read more:Trump's 28-point Ukraine peace plan in fullAnalysis: We could all pay if Europe doesn't guarantee Ukraine's security \"There is only one country around the G20 table that is not calling for a ceasefire in Ukraine and one country that is deploying a barrage of drones and missiles to destroy livelihoods and murder innocent civilians,\" he said on Friday evening. \"Time and again, Russia pretends to be serious about peace, but its actions never live up to its words.\" On the Trump plan, the prime minister said allies are meetin on Saturday \"to discuss the current proposal on the table, and in support of Trump's push for peace, look at how we can strengthen this plan for the next phase of negotiations\". Strengthening the plan really means that they want to rebalance it towards Ukraine's position and make it tougher on Russia. \"Ukraine has been ready to negotiate for months, while Russia has stalled and continued its murderous rampage. That is why we must all work together with both the US and Ukraine, to secure a just and lasting peace once and for all,\" said the prime minister. \"We will continue to coordinate closely with Washington and Kyiv to achieve that. However, we cannot simply wait for peace. \"We must strain every sinew to secure it. We must cut off Putin's finance flows by ending our reliance on Russian gas. It won't be easy, but it's the right thing to do.\" Europeans hadn't even seen this deal earlier in the week, in a sign that the US is cutting other allies out of negotiations - for now at least. Starmer and other European leaders want to get to a position where Ukraine and Europe are at least at the table. There is some discussion about whether European leaders such as Macron and Meloni might travel to Washington to speak to Trump early next week in order to persuade him of the European and Ukrainian perspective, as leaders did last August following the US-Russian summit in Alaska. But Sky News understands there are no discussions about the PM travelling to Washington next week ahead of the budget."
    },
    {
        "title": "What did COP30 achieve after failing to reach deal on fossil fuels?",
        "description": "Well, it could have been worse.",
        "url": "https://news.sky.com/story/what-did-cop30-achieve-after-failing-to-reach-deal-on-fossil-fuels-13474235",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brazil-cop_7089022.jpg?20251122192853",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-11-22 19:05:00",
        "Headline": "This was the first COP to happen after being hollowed out by the absence of a climate-denying United States.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n Well, it could have been worse. This was the first COP to happen after being hollowed out by the absence of a climate-denying United States. Also, in the shadow of cost-of-living, trade and conflict crises, few governments brought their A-game.  There were fears, too, that the tropical heat and crumbling infrastructure of the Amazon's seaport, Belem, would result in chaos.  But despite deafening Amazonian downpours drumming on the canvas of the temporary venue and even a fire, the summit concluded its business. The failure to agree, or even to agree to disagree, on a \"roadmap\", a discussion paper, about how best to phase out the use of fossil fuels was a major failure - though absolutely no surprise. \n                  Countries agree compromise climate deal at COP30 - but omit mention of fossil fuels\n                 \n                  'COP is a nightmare but best process we've got', says Ed Miliband as climate talks run into overtime\n                 \n                  Fire disrupts last-minute efforts to strike global deal at COP30\n                  COPs continue to operate around consensus. Many compromises are made, but just one country can veto a proposal. In the case of fossil fuels, it was a group of oil producers led by Saudi Arabia that saw to it that even talking about how to move on from oil and gas never made it. A staggering thought, given this was the first COP to take place in a world that had just experienced a year that was warmer than at any time in modern human history. But perhaps because of new global realities, this COP did achieve something others have rarely done. It broke new ground and started important conversations about key issues that had received little attention before. Like how trade must be aligned with the already rapid transition away from fossil fuels that is under way in many countries. Also, how critical minerals and access to them must be given similar attention as fossil fuels, given their essential role in building alternative energy sources. And while a plan to phase out fossil fuels didn't get \"gavelled through\", the conversation has started and it's not going to stop. There was progress too on forests - you'd have hoped there would be from a COP surrounded by rainforest - and Brazil's centrepiece Tropical Forests Forever Facility managed to win $5.5bn worth of support despite most nations' coffers being bare.  Brazil also brought a quiet but necessary shift in paradigm to the talks. For a decade, COPs have been dominated by countries like the UK, EU states and, until last year, the US, pressing for change because of the economic and societal opportunities that a green transition will bring. The host country, rich in forests and indigenous groups who understand better than nearly anyone our economies' total dependence on nature, argued that action was, instead, a moral imperative. Read more:Countries agree compromise climate dealRecord for wind-powered energy in UK \"We already possess virtually all the technical solutions for climate change, biodiversity loss, and even pressing social issues,\" minister Marina Silva told delegates. \"What is needed is the ethical commitment to apply our technical capabilities and accelerate our political decisions, ensuring we fulfil what we've already committed to.\""
    },
    {
        "title": "Countries agree compromise climate deal at COP30 - but omit mention of fossil fuels",
        "description": "Countries attending COP30, the biggest climate meeting of the year, have agreed to a compromise deal setting out steps to help speed up climate action.",
        "url": "https://news.sky.com/story/cop30-countries-reach-draft-deal-to-help-speed-up-climate-action-13473945",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lago-president-cop30_7088753.jpg?20251122172212",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-22 14:21:00",
        "Headline": "The deal would boost finance for poor nations coping with global warming but it omits any mention of the fossil fuels driving it.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Countries attending COP30, the biggest climate meeting of the year, have agreed to a compromise deal setting out steps to help speed up climate action. The deal would boost finance for poor nations coping with global warming, but it fails to namecheck the fossil fuels driving it. As the United Nations summit wrapped up in Brazil, applause masked disappointment in the many weak parts of the agreement.   But what many were celebrating was that they had agreed on anything at all - with countries around the world distracted by conflict and the cost of living, and the United States missing from the talks altogether. The outlook for COP30 was bleak after two other similar forums this year - on green shipping and plastics pollution - fell apart entirely. The UK's Energy Secretary Ed Miliband told Sky News in the Amazon city Belem: \"Donald Trump and the United States withdrew from the Paris climate agreement. \"Some people said that means lots of countries are going to [pull out] as well, a domino effect. That hasn't happened.\" Rather than spelling out the fossil fuel problem, the agreement promises to \"accelerate implementation\" of existing commitments, nodding to an old promise from COP28 in Dubai. The UN secretary-general Antonio Guterres said: \"I cannot pretend that COP30 has delivered everything that is needed. The gap between where we are and what science demands remains dangerously wide.\" Panama negotiator Juan Carlos Monterrey Gomez said: \"A climate decision that cannot even say 'fossil fuels' is not neutrality, it is complicity. And what is happening here transcends incompetence.\" He added: \"Science has been deleted from COP30 because it offends the polluters.\" Despite no transition plan being included in the deal, the summit's president Andre Correa do Lago said voluntary plans on fossil fuels and forests would be mapped out instead. Next year, hardline Colombia, which is trying to leave its coal in the ground, will host a summit for those interested in the proposed fossil fuel plan.  Each year, the United Nations climate talks bring together world leaders, scientists, campaigners, and negotiators from across the globe, who agree on collective next steps for tackling climate change. The two-week conference in Belem was a rollercoaster - from indigenous people storming the entrance to demand a greater role, to a brief fire in one of the tents, and sleep-deprived negotiators battling it out over the future of their countries. COP30 was due to end at 6pm local time (9pm UK time) on Friday, but it dragged well into overtime - not uncommon for the annual, heated talks. The standoff was between the EU, which was the last one standing on the transition away from fossil fuels, and the Arab Group of nations, including major oil exporter Saudi Arabia, which opposed it. The impasse was resolved following all-night talks led by Brazil, negotiators said. The European Union's climate commissioner Wopke Hoekstra said on Saturday that the proposed accord was acceptable, even though the bloc would have liked more. \"We should support it because at least it is going in the right direction,\" he said. Read more:Cop out: Is net zero dead?Fire disrupts efforts to strike dealRecord for wind-powered energy in UK COP30 wins But the summit made gains in other areas. Climate-vulnerable countries like Jamaica and India will be celebrating a new pledge to triple the amount of cash to help them cope with the impacts of climate change. Hurricane Melissa, which tore through the Caribbean just before COP30 started, was a reminder that extreme weather is becoming more intense and more expensive. Brazil's plan to host COP on the edge of the Amazon rainforest paid off - it raised almost $10bn (£7.65bn) to protect the world's forests that are fending off climate change - including $6bn for a new investment fund. And it also recognised and earmarked money for indigenous peoples and other communities that help keep them standing. Indigenous people defined the image and the tone of the first week of the talks - storming the venue entrance, staging sit-ins and winning new legal rights to some of their land. Toya Manchineri, of the Manchineri Peoples and Coordination of Indigenous Organizations of the Brazilian Amazon, said: \"Indigenous Peoples will remain vigilant, mobilized, and present beyond COP30 to ensure that our voices are respected and that global decisions reflect the urgency we experience in our territories. \"For some, COP ends today, for us territorial defence in the heart of the Amazon is every day.\" Campaigners also won a new commitment that the switch to clean energy should be fair to workers and that communities do not lose out."
    },
    {
        "title": "Woman charged with fraud over 'sale of Oasis tickets'",
        "description": "A woman has been charged with fraud offences over the alleged sale of Oasis tickets.",
        "url": "https://news.sky.com/story/woman-charged-with-fraud-over-sale-of-oasis-tickets-13473881",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-manchester-ticket_6962805.jpg?20250711155918",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-22 10:38:00",
        "Headline": "Rosie Slater has been charged with 11 counts of fraud by false representation, Staffordshire Police said.",
        "Content": "A woman has been charged with fraud offences over the alleged sale of Oasis tickets. Rosie Slater has been charged with 11 counts of fraud by false representation, Staffordshire Police said. The 32-year-old, of Newcastle-under-Lyme, Staffordshire, has been granted unconditional bail and is due to appear in court at North Staffordshire Justice Centre on 11 December. The charges relate to the alleged sale of Oasis tickets in May.Read more from Sky News:Scotland fans caused 'extremely small earthquake' in Denmark winFirst saplings planted from felled Sycamore Gap tree It comes as ministers confirmed plans to make it illegal for tickets to concerts, theatre, comedy, sport and other live events to be resold for more than their original cost. Earlier this month, pop stars including Sam Fender, Dua Lipa, Coldplay and Radiohead urged the prime minister in an open letter to stand by his election promise to restrict online ticket touts. The huge profits made by resellers were put in the spotlight last year when thousands of Oasis fans complained of ticket prices for their reunion tour, with some Wembley Stadium show tickets listed at more than £4,000."
    }
]