[
    {
        "title": "Two people killed in Anthony Joshua car crash named as 'close friends' of boxer",
        "description": "The two \"close friends\" of Anthony Joshua killed in a car crash in Nigeria in which the British boxer was injured have been named by his spokesperson.",
        "url": "https://news.sky.com/story/two-people-killed-in-anthony-joshua-car-crash-named-by-nigerian-president-13488421",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sina-ghami-anthony-joshua_7121784.jpg?20251229225852",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 20:25:00",
        "Headline": "The former two-time world heavyweight champion, 36, was taken to hospital for treatment along with another injured person, while two people were killed.",
        "Content": "The two \"close friends\" of Anthony Joshua killed in a car crash in Nigeria in which the British boxer was injured have been named by his spokesperson. Sina Ghami and Latif Ayodele died in Monday's road traffic accident which happened on a busy highway around lunchtime. They were both described as being \"integral members\" of the boxer's team. Joshua, a former two-time world heavyweight champion, suffered minor injuries as he travelled in the back of a black Lexus that hit a truck in Makun, ⁠Ogun State, about 30 miles from the country's biggest city, Lagos. Ghami and Ayodele were also passengers in the Lexus. Authorities said Joshua, 36, was taken to hospital for treatment along with another injured person. Joshua and the other survivor are described by officials as being in a \"stable\" condition. \n                  Joshua delivers taste of reality to YouTuber Jake Paul\n                 \n                  Jake Paul vs Anthony Joshua: All you need to know\n                 \n                  Anthony Joshua could return to ring to fight ex-YouTuber Jake Paul\n                 Police are investigating the cause of the accident. 'Shocking and devastating news' Naming the two men who died, Joshua's spokesperson said in a statement: \"It is with the deepest and most profound sadness that we confirm, following a road traffic accident in Lagos Nigeria earlier today, the death of Sina Ghami and Kevin 'Lateef' Ayodele. \"Both were close friends and integral members of Anthony's team. We respectfully ask that space and privacy be given to the families at this time while they process this truly shocking and devastating news.\" The Nigerian President Bola Ahmed Tinubu said on X: \"I have spoken with AJ to personally convey my condolences over the passing of his two close associates, Kevin Latif Ayodele and Sina Ghami in the recent accident. \"I wished him a full and speedy recovery, and prayed with him. AJ assured me he is receiving the best possible care.\" A statement on X by Joshua's promoter Eddie Hearn, from Matchroom Boxing, also confirmed the victims' names, saying: \"With profound sadness it has been confirmed that two close friends and team members Sina Ghami and Latif Ayodele have tragically passed away.\" The crash happened on the Lagos-Ibadan Expressway near Sagamu, at about midday local time (11am UK time), according to the Nigerian federal road safety corps (FRSC). Joshua is on holiday in Africa following his win over US YouTuber-turned-boxer Jake Paul in Miami just over a week ago. How did the crash happen? The FRSC said preliminary findings indicated the Lexus was \"suspected to be travelling beyond the legally prescribed limit\" and \"lost control\" while overtaking before crashing into the truck, which was parked by the side of the road. \"The primary causes of the crash being excessive speed and wrongful overtaking constitute serious traffic violations and remain among the leading causes of fatal road crashes on Nigerian highways,\" the corps said on X. The boxer has Nigerian heritage Joshua, who is the son of British-Nigerian parents, attended a boarding school in Ikenne, around 50 miles from where the crash happened, before returning to ‌Britain at the age of 12. Pictures released by the FRSC show the badly damaged Lexus that Joshua was travelling in and the red Sinotruck that it collided with. Footage posted on social media shows the British ex-world heavyweight champion apparently wincing in pain as he is helped out of the wreckage by a crowd. Other clips show him in an emergency vehicle, wearing only a pair of shorts, as he is driven away from the scene. The crash happened just days after Joshua knocked out Jake Paul in the sixth round of their fight in Miami. The fight marked the end of a 15-month hiatus for Joshua, who is expected to fight long-time rival Tyson Fury in 2026."
    },
    {
        "title": "Alleged strikes on Vladimir Putin residence 'not good', Donald Trump says",
        "description": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia.",
        "url": "https://news.sky.com/story/alleged-strikes-on-vladimir-putin-residence-not-good-donald-trump-says-13488414",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-donald-trump_7121670.jpg?20251229215047",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 19:57:00",
        "Headline": "Moscow has claimed it shot down 91 Ukrainian drones fired at Putin's state residence in Russia, which Kyiv denies.",
        "Content": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia. Sergei Lavrov, Moscow's long-serving foreign minister, said Kyiv launched the attack on Putin's home in the Novgorod region overnight on Sunday, but that all 91 drones used were shot down by Russian air defences. Ukrainian President Volodymyr Zeleskyy hit back against the claims, calling them \"lies\". Asked about the reports while welcoming Israeli Prime Minister Benjamin Netanyahu to his Mar-a-Lago estate in Florida on Monday, Mr Trump said it was \"not good\". \"I learned about it from ‌President Putin today. I was very angry about ‌it,\" he said, describing his second phone call with the Russian leader in as many days as \"very good\". \"It's a delicate period of time,\" he added. \"This is not ​the right time. It's one thing to be offensive, because they're offensive. ‍It's another thing to attack his house. It's not the right time to do any of that.\" US 'hit' Venezuela docks \n                  Trump offered Ukraine 15-year security guarantee as part of peace plan, Zelenskyy says\n                 \n                  Trump latest: US will 'knock the hell' out of Iran if it tries to rearm, US president says\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 Taking questions from the media alongside Mr Netanyahu, Mr Trump also confirmed the US \"hit\" a ⁠dock area in Venezuela where he ​alleged drugs ​were loaded onto boats. This would mark the ​first known time the US has carried out operations on land in Venezuela since a pressure campaign began against the government ⁠of President Nicolas Maduro several months ago. \"There ​was a major explosion in the dock ‍area where they load the boats up with drugs. They load ‌the boats ⁠up with drugs. We ‌hit all the ‍boats, and now we hit the area,\" Mr Trump said, without providing any ​further details. It was not immediately clear what target was hit, nor which part of the US government acted. Asked if the CIA had carried ‍out the attack, Mr Trump said: \"I don't want to say that. I know exactly who it was, but I don't want to say who it was.\" Warning sent to Iran With Mr Netanyahu arriving in Mar-a-Lago for talks concerning the Middle East, Mr Trump was quizzed on reports Iran is stepping up the rebuilding of its ballistic missile programme, despite the reintroduction of UN sanctions last month banning such activity. \"I hear that Iran is trying to build up again, and if they are, we're going to have to knock them down, we'll knock them down, we'll knock the hell out of them,\" Mr Trump said. \"But hopefully that's not happening. I heard Iran wants to make a deal. If they want to make a deal, that's much smarter. \"You know, they could have made a deal the last time, before we did a big attack on them.\" He adds: \"I think, again, they should make a deal. They want to make a deal. But sometimes that doesn't happen.\" Hamas 'must disarm' Mr Netanyahu is also seeking further US support in Gaza, where there has been little movement on the complex second phase of the Israel-Hamas truce, raising concerns that both sides are failing to take action to carry out the next phase of the deal. More than 400 people have been killed in Gaza since that agreement, local officials say, while Israel has accused Hamas of ceasefire violations, including the delayed return of hostage remains - with one body still to be handed over. Asked how quickly the ceasefire agreement can move to its second phase, Mr Trump said: \"As quickly as we can, but there has to be a disarmament. \"We have to disarm with Hamas. It's one of the things we'll talk about, certainly, but there has to be a disarming of Hamas.\""
    },
    {
        "title": "New Year Honours: Idris Elba, Torvill and Dean, and Lionesses among those recognised",
        "description": "Idris Elba, ice dancers Jayne Torvill and Christopher Dean, as well as England's victorious women's football and rugby teams, are among 1,157 people recognised in the New Year Honours list.",
        "url": "https://news.sky.com/story/new-year-honours-idris-elba-torvill-and-dean-and-lionesses-among-those-recognised-in-latest-list-13488303",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sarina-weigman-idris-elba_7121483.jpg?20251229155242",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 14:16:00",
        "Headline": "A huge number of people earned gongs this year - here are some of the stand-out names of the 1,157 people recognised.",
        "Content": "Idris Elba, ice dancers Jayne Torvill and Christopher Dean, as well as England's victorious women's football and rugby teams, are among 1,157 people recognised in the New Year Honours list. Sir Idris, 53, who is known for his roles in The Wire and Luther, is knighted for services to young people, having founded the Elba Hope Foundation. He said: \"I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation. \"I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence.\" Torvill and Dean say honour is 'wonderful and humbling' Dame Jayne and Sir Christopher, who took home the Olympic gold at the 1984 Winter Games and saw success at the World, European and British Champions, are made a Dame and Sir for services to ice skating and to voluntary service. They said the honour is \"wonderful and humbling at the same time\". They are joined by Paul Elliott, one half of the Chuckle Brothers, who is made a Member of the Order of the British Empire (MBE), and Matt Lucas, half of the Little Britain comedy duo with David Walliams, who becomes an Officer of the Order of the British Empire (OBE). Lionesses and Red Roses The Lionesses feature heavily on the list after their Euros win in the summer. Captain Leah Williamson is made a Commander of the Order of the British Empire (CBE), while Alex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone become MBEs. The team's Dutch manager, Sarina Wiegman, who has won the Euros twice with England and once with the Netherlands, is awarded an honorary damehood, the Cabinet Office said. Wiegman said: \"I would like to express my sincere gratitude for this honour. When I first arrived in England, I could never have imagined the respect and warmth I've experienced from the English people. I deeply thank the fans for their support.\" Members of England Women's Rugby World Cup winning squad are also featured, with Marlie Packer and Zoe Aldcroft becoming OBEs, along with coach John Mitchell. Their teammates Ellie Kildunne, Sadia Kabeya and Megan Jones are made MBEs after the Red Roses defeated Canada in the final in September. Three-time London Marathon winner Paula Radcliffe, who held the women's marathon record for 16 years, is made an OBE. 'Best thing that's ever happened to me - and I've been in Star Wars' Also made OBEs are presenter and author Richard Osman, actor Warwick Davis and broadcaster Gabby Logan. The Kumars At No 42 actress Meera Syal, 64, becomes a Dame. Osman, 55, author of The Thursday Murder Club book series, said he was \"absolutely thrilled\" with the honour, while Davis, also 55, said: \"This is the best thing that's ever happened to me and I've been in Star Wars.\" Wicked star Cynthia Erivo is made an MBE for services to music and drama, while football commentator Clive Tyldesley becomes an OBE for services to sports broadcasting and to charity. Writer Roy Clarke, who created the sitcoms Last Of The Summer Wine, Open All Hours and Keeping Up Appearances, becomes a knight. Oldest Horizon IT scandal victim and D-Day veteran honoured A woman thought to be the oldest victim of the Horizon IT scandal, 92-year-old Betty Brown, has said it was a \"shocker\" to have been made an OBE for seeking justice for subpostmasters. D-Day veteran Mervyn Kersh, 101, said it was a \"wonderful thing\" to be awarded a British Empire Medal (BEM) for services to Holocaust remembrance and education. The oldest person on the list is 102-year-old John Hearn, one of four centenarians included, who receives a BEM for services to Judo and to the community in northeast England. The youngest recipient is 20-year-old Olympic gold medal-winning sports climber Toby Roberts, from Elstead in Surrey, who becomes an MBE. 'The very best of Britain' Prime Minister Sir Keir Starmer said: \"This year's Honours list celebrates the very best of Britain - people who put the common good ahead of themselves to strengthen communities and change lives. \"Their quiet dedication speaks to the decent, compassionate country we are proud to be. On behalf of the whole nation, thank you - and congratulations to everyone recognised today.\""
    },
    {
        "title": "Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah",
        "description": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist.",
        "url": "https://news.sky.com/story/foreign-secretary-orders-review-of-serious-failures-in-case-of-british-egyptian-activist-alaa-abd-el-fattah-13488426",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7121151.jpg?20251229054137",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 21:00:00",
        "Headline": "\"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt.",
        "Content": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist. \"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt. Ms Cooper, the foreign secretary, said successive prime ministers were not briefed on the historic tweets, which date back as far as 2010, and civil servants in charge of the case were also \"unaware\" of them. The activist has since apologised \"unequivocally\" for his \"shocking and hurtful\" social media posts, in which he appears to call for violence against \"Zionists\" - but said some had been \"completely twisted\". Both the Conservatives and Reform UK have suggested he should have his British citizenship stripped for the posts - though it is understood there are no current plans for this, and the law does not appear to provide grounds to deport him. In a letter to the chair of the Foreign Affairs Committee, Dame Emily Thornberry, Ms Cooper said long-standing procedures and due diligence arrangements had been \"completely inadequate\" in the case. \"In the context of rising antisemitism, and recent horrific attacks against Jewish people in this country and around the world, I am deeply concerned that the unexpected emergence of these historical tweets - coming alongside the social media posts that I and other senior politicians sent on Boxing Day welcoming the conclusion of this long-running case and Mr El Fattah's reunion with his family - have added to the distress felt by Jewish communities in the UK, and I very much regret that,\" she wrote. \"I have asked the permanent under secretary as a matter of urgency to review the serious information failures in this case and more broadly the systems that are in place within the department for conducting due diligence on the individual high-profile consular and human-rights cases for which the FCDO is responsible, to ensure that those systems are functioning properly for the future, and that all necessary lessons are learned.\" Read more:Two people killed in Anthony Joshua car crash namedTrump offered Ukraine 15-year security guarantee, Zelenskyy says Mr Abd El-Fattah was a leading voice during Egypt's 2011 Arab Spring uprising and went on hunger strikes in prison. He was most recently detained in September 2019 and sentenced to five years in prison in December 2021 on charges of spreading false news. Egyptian President Abdel Fattah el-Sisi pardoned the activist earlier this year and he flew to the UK to reunite with his young son, who lives in Brighton, last week. He had been granted UK citizenship in December 2021 under Boris Johnson, reportedly through his UK-born mother. No 10 has defended the government's handling of the case, with the prime minister's official spokesperson saying: \"We welcome the return of a British citizen unfairly detained abroad, as we would in all cases and as we have done in the past. \"That is central to Britain's commitment to religious and political freedom. That said, it doesn't change the fact that we have condemned the nature of these historic tweets and we consider them to be abhorrent, and we've been very clear about that.\" In a statement, Mr Abd El-Fattah said: \"I unequivocally apologise. \"(The posts) were mostly expressions of a young man's anger and frustrations in a time of regional crises (the wars on Iraq, on Lebanon and Gaza), and the rise of police brutality against Egyptian youth. \"I particularly regret some that were written as part of online insult battles with the total disregard for how they read to other people. I should have known better.\""
    },
    {
        "title": "Mother and two children aged four and seven confirmed dead in Boxing Day fire",
        "description": "A mother and two children have died after a Boxing Day fire in Stroud, Gloucestershire. ",
        "url": "https://news.sky.com/story/mother-and-two-children-dead-in-tragic-boxing-day-fire-13488177",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-stroud-house-fire_7119978.jpg?20251229115557",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 06:41:00",
        "Headline": "The father, a serving member of Gloucestershire Police, survived and was taken to Gloucestershire Royal Hospital for treatment.",
        "Content": "A mother and two children have died after a Boxing Day fire in Stroud, Gloucestershire.  The father, a serving member of Gloucestershire Police, survived and was taken to Gloucestershire Royal Hospital for treatment. The mother and two children, a seven-year-old girl and a four-year-old boy, were initially unaccounted for, but police have since confirmed their deaths. Authorities said the fire is not suspicious and is a \"tragic accident\". Emergency teams were called to a property on Brimscombe Hill, near Stroud, at around 3am on 26 December, a Gloucestershire Police spokesperson said. Officers attended the scene alongside crews from Gloucestershire Fire and Rescue Service and the ambulance service. The mother and father awoke around 3am and tried to get to their children, but were unable to due to the ferocity of the fire, DSI Ian Fletcher said in a briefing on Monday. \"The father has smashed his way out of the house through a bathroom window in order to try to access the children's bedroom via the outside.\" However he was unable to get back into the property. Mr Fletcher added: \"We have multiple witnesses who describe the anguish that he was going through, his inability to get in and save his children and save his wife. Read more from Sky News:Man shot dead by police after car crashCold temperatures forecast for new year Deputy Chief Fire Officer Nathaniel Hooton said firefighters worked extremely hard to get in as the fire raged in the house. There is significant damage to the property internally, and work continues to try to find out what started the fire, he said. Speaking near the scene, Reverend Peter Francis, the vicar of Holy Trinity Church, Brimscombe, told Sky News West of England and Wales correspondent Dan Whitehead: \"It's an absolutely terrible tragedy. It's really shocking. It's impacted people so deeply. \"There are no words to express what has happened. Our thoughts and prayers are with the family and with all who are grieving at this time.\""
    },
    {
        "title": "Trump offered Ukraine 15-year security guarantee as part of peace plan, Zelenskyy says",
        "description": "Donald Trump has offered Ukraine security guarantees for 15 years as part of a proposed plan to end Russia's invasion, Volodymyr Zelenskyy has said.",
        "url": "https://news.sky.com/story/trump-offered-ukraine-15-year-security-guarantee-as-part-of-peace-plan-zelenskyy-says-13488380",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_7121179.jpg?20251229075316",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 17:40:00",
        "Headline": "The Ukrainian president said he would prefer a commitment of up to 50 years to deter Moscow from further attempts to seize Ukrainian land.",
        "Content": "Donald Trump has offered Ukraine security guarantees for 15 years as part of a proposed plan to end Russia's invasion, Volodymyr Zelenskyy has said. The Ukrainian president said he would prefer a commitment of up to 50 years to deter Moscow from further attempts to seize Ukrainian land. Mr Trump hosted Mr Zelenskyy at his Florida resort on Sunday and made the claim that Ukraine and Russia were \"closer than ever before\" to a peace settlement. Mr Zelenskyy said the security guarantees include how a peace deal would be monitored as well as the \"presence\" of partners, adding: \"Without security guarantees, realistically, this war will not end.\" Ukraine war latest: Zelenskyy says he knows what Kremlin is doing Negotiators were still looking for a breakthrough on key issues, including whose forces withdraw from which area and the fate of the Russian-occupied Zaporizhzhia nuclear power plant. On Monday, Mr Trump had \"a positive call\" with Mr Putin about the war, White House press secretary Karoline Leavitt said in a post on X. The two leaders also spoke ahead of Mr Trump's talks with Mr Zelenskyy on Sunday. During the call, Mr Putin claimed Ukraine had attempted to attack his residence in northwestern Russia with long-range drones almost immediately after the talks with Mr Zelenskyy. However, Mr Zelenskyy said the Russian claim was false and said it was an attempt to undermine the peace negotiations, describing it as \"another lie\" because Moscow is unnerved about progress in the talks. Speaking at a meeting alongside Israeli Prime Minister Benjamin Netanyahu later in the day, Mr Trump said Mr Putin had told him about the purported attack. \"I don't like it. It's not good,\" Mr Trump said, when asked if he was worried the allegation could affect his efforts to broker peace. \"I learned about it from ‌President Putin today. I was very angry about ‌it.\" He added: \"It's a delicate period of time. This is not ​the right time. It's one thing to be offensive, because they're offensive. ‍It's another thing to attack his house. It's not the right time to do any of that.\" Asked if there was any evidence for the attack, Mr Trump replied: \"We'll find out.\" Trump would consider extending guarantees, Zelenskyy claims Meanwhile, Mr Putin claimed Russian troops are advancing in the eastern Donetsk region of Ukraine and also continuing their offensive in the southern Zaporizhzhia region. French President Emmanuel Macron said Kyiv's allies will meet in Paris in early January to \"finalise each country's concrete contributions\" to security guarantees. According to Mr Zelenskyy, Mr Trump said he would consider extending US security guarantees beyond 15 years. Peace plan to be put to Ukrainians in national referendum Mr Zelenskyy said any guarantees would be approved by the US Congress as well as parliamentarians in other countries involved in overseeing any settlement, with the 20-point peace plan under discussion to be approved by Ukrainians in a national referendum. He said holding a ballot would require a ceasefire of at least 60 days."
    },
    {
        "title": "Man 'carrying handgun' shot and killed by police after crash in Norfolk",
        "description": "A man believed to have been carrying a handgun has been shot and killed by police after a car crash in the Norfolk town of Thetford. ",
        "url": "https://news.sky.com/story/man-carrying-handgun-shot-and-killed-by-police-after-crash-in-norfolk-13488175",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-thetford-shooting-police_7121296.jpg?20251229112228",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 06:33:00",
        "Headline": "Police say the man, who was pronounced dead at the scene, was believed to be the driver of one of two vehicles involved in the collision. ",
        "Content": "A man believed to have been carrying a handgun has been shot and killed by police after a car crash in the Norfolk town of Thetford.  The man is thought to have been the driver of one of two vehicles involved in the collision on London Road at around 8.25pm on Sunday. Norfolk Police said he left the scene holding what was described as a handgun and was shot by armed officers nearby. The man, believed to be aged in his 60s, was pronounced dead at the scene. The force has notified the police watchdog, the Independent Office for Police Conduct (IOPC), which has launched an investigation. Assistant Chief Constable David Buckley said: \"We understand this incident will cause concern in the community.\" He added: \"We are of course cooperating fully with the IOPC investigation and will be handing over all body-worn footage and 999 calls to ensure transparency. \n                  Unsafe meat warning after 70 butchered geese are dumped by the  roadside \n                 \n                  Mystery foam on river in Thetford sparks Environment Agency investigation\n                 \n                  Friday night's anti-migrant protests in Norwich were peaceful - but anger is bubbling\n                 \"We are not looking for anyone else in connection with the incident.\" Police said the A11 remains closed in both directions from the Thetford Ranges roundabout to the Brandon Road roundabout. The IOPC said it has begun an independent investigation. The watchdog said in a statement: \"At this early stage, we have established via police call logs that Norfolk Constabulary officers responded to a report of a collision involving two vehicles on London Road shortly before 8.30pm. \"Armed officers responded after it was reported that a man was seen leaving the collision scene holding what was described to be a handgun. \"Officers found a man by the A11 a short time later. We can confirm that two shots were fired by police shortly before 9pm. \"First aid was provided at the scene, however the man was sadly declared deceased shortly before 10.15pm.\""
    },
    {
        "title": "It's easy to get lost in multi-point plans and spin - but Zelenskyy's reaction to Trump said it all",
        "description": "Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important.",
        "url": "https://news.sky.com/story/its-easy-to-get-lost-in-multi-point-plans-and-spin-but-zelenskyys-reaction-to-trump-said-it-all-13488169",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-volodymyr-zelenskyy_7121145.jpg?20251229030904",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-12-29 02:17:00",
        "Headline": "The Mar-a-Lago meeting between Donald Trump and Volodymyr Zelenskyy did not materially move things forward, but there were some notable takeaways - and no bust-up like the infamous Oval Office encounter in February.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important. The Mar-a-Lago meeting did not materially move things forward but nor was there a bust-up like that Oval Office moment in February. There were however some notable takeaways. First, Zelenskyy's facial expressions. At times he looked exasperated - like when Trump made light of a profoundly important negotiation by talking about the Mar-a-Lago food and the physique of the Ukrainian leader's generals. Playground stuff. There was a memorable moment when Zelenskyy's poker face fell away. He shrugged, then laughed as Trump said: \"Russia wants Ukraine to succeed.\" What a profoundly stupid thing for the American president to say. Look at Vladimir Putin's actions. Listen to his words. It's hard to know sometimes whether Trump is just ignorant, tuned out of the detail, or actually in Putin's pocket. Zelenskyy probably has a view but managed, just, to hold his decorum. Beyond the spectacle of Zelenskyy's face, there were some other important moments - if only because they will act as markers when Trump shifts his position, as he has so many times. On US security guarantees, Zelenskyy seemed reassured that Trump's America would provide some sort of military backdrop - to counter renewed Russian aggression in the future. But neither leader spelled out what that would look like. Ukrainian sources have told me that Trump's commitment to back his support for Ukraine with security guarantees is a key point (never mind the fact that Trump did this months ago and then backtracked). The same sources have also said that Trump's apparent willingness to go to Ukraine and address parliament there, which he articulated today for the first time, is a positive commitment. Let's see if he sticks to it, or shifts again, and on the security guarantees. The most articulate moment from the meandering and confused news conference came from Zelenskyy when he charted progress with percentages. He said: So, that confirms Zelenskyy has accepted US commitments on security guarantees but shows that more work is required to pin down some elements in US-Europe security co-operation. That's key because it involves the prospect of European troops on the ground in Ukraine. It's a Russian redline - and Trump knows that. It's easy to get lost in all this: the progress, the positions, the multi-point plans and the spin. But remember a few fundamentals. First, Trump may want this war to end, but he doesn't care how it happens. Second, Putin has shown no genuine signals that he wants the war to end. Third, Ukraine doesn't want to be forced into a subjugating surrender. A few weeks ago the Americans produced a 28-point plan. It amounted to a Russian wish-list. Since then, the Ukrainians, with the Europeans and co-ordinating with the Americans, have refined it. It's 20 points now, and within it are plenty of Ukrainian concessions. Europe and Ukraine now expect Trump to focus the pressure back on Moscow and to engage Vladimir Putin in a way that moves him. Don't hold your breath."
    },
    {
        "title": "Three police officers and six militants killed in shooting in Turkey ",
        "description": "Six militants and three police officers have been killed during a shoot-out after extremists clashed with authorities in Turkey. &#160;",
        "url": "https://news.sky.com/story/three-police-officers-and-six-militants-killed-in-shooting-in-turkey-13488280",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-turkey-islamic-state-militants_7121215.jpg?20251229144515",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-29 13:15:00",
        "Headline": "At least eight police officers and a night guard were also wounded in the confrontation in the country's northwest on Monday, Turkey's interior minister said.",
        "Content": "Six militants and three police officers have been killed during a shoot-out after extremists clashed with authorities in Turkey.   At least eight police officers and a night guard were also wounded in the confrontation in the country's northwest on Monday, Turkey's interior minister said. Shots were fired after police stormed a house where the alleged militants were hiding in the Elmali district in Yalova province, south of Istanbul. Turkey's interior minister Ali Yerlikaya said the operation was one of more than 100 simultaneous raids carried out in 15 provinces across the country against suspected IS militants. The violence comes amid a crackdown on extremist groups across with country, with Turkish police carrying out another wave of raids last week. Some 115 militants were arrested for allegedly planning attacks targeting Christmas and new year celebrations during this operation. Mr Yerlikaya said the operation in Yalova was carried out with \"great care\" because women and children were inside the house where the alleged militants were located. \n                  Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News\n                 \n                  US launches 'large-scale' strikes to 'eliminate' Islamic State fighters in Syria after US citizens killed in desert\n                 \n                  Counterterrorism review calls for Shamima Begum and other British-linked people in Syria to be repatriated\n                 All the militants arrested were Turkish nationals, the minister said. Turkish President Recep Tayyip Erdogan expressed his condolences for the police officers who were killed and vowed to push ahead with the fight against extremist groups. \"We will continue our fight against the blood‑stained killers who threaten our nation's peace and our state's security both within our borders and beyond, with determination, comprehensively and without compromise,\" he said in a statement posted on X. Read more from Sky News:Anthony Joshua injured in car crash in NigeriaActivist Alaa Abd El-Fattah apologises for historic tweets The Yalova Chief Public Prosecutor's Office launched an investigation into Monday's shooting. Turkish justice minister Yilmaz Tunc said on X that five prosecutors had been appointed to lead the probe. 👉 Tap here to follow The World With Richard Engel And Yalda Hakim wherever you get your podcasts 👈 IS has carried out a series of deadly attacks in Turkey in recent years, including a shooting at an Istanbul nightclub during new year celebrations in 2017, which killed 39 people."
    },
    {
        "title": "New Year Honours: Idris Elba, Torvill and Dean, and Lionesses among those recognised",
        "description": "Idris Elba, ice dancers Jayne Torvill and Christopher Dean, as well as England's victorious women's football and rugby teams, are among 1,157 people recognised in the New Year Honours list.",
        "url": "https://news.sky.com/story/new-year-honours-idris-elba-torvill-and-dean-and-lionesses-among-those-recognised-in-latest-list-13488303",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sarina-weigman-idris-elba_7121483.jpg?20251229155242",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-29 14:16:00",
        "Headline": "A huge number of people earned gongs this year - here are some of the stand-out names of the 1,157 people recognised.",
        "Content": "Idris Elba, ice dancers Jayne Torvill and Christopher Dean, as well as England's victorious women's football and rugby teams, are among 1,157 people recognised in the New Year Honours list. Sir Idris, 53, who is known for his roles in The Wire and Luther, is knighted for services to young people, having founded the Elba Hope Foundation. He said: \"I receive this honour on behalf of the many young people whose talent, ambition and resilience has driven the work of the Elba Hope Foundation. \"I hope we can do more to draw attention to the importance of sustained, practical support for young people and to the responsibility we all share to help them find an alternative to violence.\" Torvill and Dean say honour is 'wonderful and humbling' Dame Jayne and Sir Christopher, who took home the Olympic gold at the 1984 Winter Games and saw success at the World, European and British Champions, are made a Dame and Sir for services to ice skating and to voluntary service. They said the honour is \"wonderful and humbling at the same time\". They are joined by Paul Elliott, one half of the Chuckle Brothers, who is made a Member of the Order of the British Empire (MBE), and Matt Lucas, half of the Little Britain comedy duo with David Walliams, who becomes an Officer of the Order of the British Empire (OBE). Lionesses and Red Roses The Lionesses feature heavily on the list after their Euros win in the summer. Captain Leah Williamson is made a Commander of the Order of the British Empire (CBE), while Alex Greenwood, Keira Walsh, Georgia Stanway and Ella Toone become MBEs. The team's Dutch manager, Sarina Wiegman, who has won the Euros twice with England and once with the Netherlands, is awarded an honorary damehood, the Cabinet Office said. Wiegman said: \"I would like to express my sincere gratitude for this honour. When I first arrived in England, I could never have imagined the respect and warmth I've experienced from the English people. I deeply thank the fans for their support.\" Members of England Women's Rugby World Cup winning squad are also featured, with Marlie Packer and Zoe Aldcroft becoming OBEs, along with coach John Mitchell. Their teammates Ellie Kildunne, Sadia Kabeya and Megan Jones are made MBEs after the Red Roses defeated Canada in the final in September. Three-time London Marathon winner Paula Radcliffe, who held the women's marathon record for 16 years, is made an OBE. 'Best thing that's ever happened to me - and I've been in Star Wars' Also made OBEs are presenter and author Richard Osman, actor Warwick Davis and broadcaster Gabby Logan. The Kumars At No 42 actress Meera Syal, 64, becomes a Dame. Osman, 55, author of The Thursday Murder Club book series, said he was \"absolutely thrilled\" with the honour, while Davis, also 55, said: \"This is the best thing that's ever happened to me and I've been in Star Wars.\" Wicked star Cynthia Erivo is made an MBE for services to music and drama, while football commentator Clive Tyldesley becomes an OBE for services to sports broadcasting and to charity. Writer Roy Clarke, who created the sitcoms Last Of The Summer Wine, Open All Hours and Keeping Up Appearances, becomes a knight. Oldest Horizon IT scandal victim and D-Day veteran honoured A woman thought to be the oldest victim of the Horizon IT scandal, 92-year-old Betty Brown, has said it was a \"shocker\" to have been made an OBE for seeking justice for subpostmasters. D-Day veteran Mervyn Kersh, 101, said it was a \"wonderful thing\" to be awarded a British Empire Medal (BEM) for services to Holocaust remembrance and education. The oldest person on the list is 102-year-old John Hearn, one of four centenarians included, who receives a BEM for services to Judo and to the community in northeast England. The youngest recipient is 20-year-old Olympic gold medal-winning sports climber Toby Roberts, from Elstead in Surrey, who becomes an MBE. 'The very best of Britain' Prime Minister Sir Keir Starmer said: \"This year's Honours list celebrates the very best of Britain - people who put the common good ahead of themselves to strengthen communities and change lives. \"Their quiet dedication speaks to the decent, compassionate country we are proud to be. On behalf of the whole nation, thank you - and congratulations to everyone recognised today.\""
    },
    {
        "title": "Mother and two children aged four and seven confirmed dead in Boxing Day fire",
        "description": "A mother and two children have died after a Boxing Day fire in Stroud, Gloucestershire. ",
        "url": "https://news.sky.com/story/mother-and-two-children-dead-in-tragic-boxing-day-fire-13488177",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-stroud-house-fire_7119978.jpg?20251229115557",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-29 06:41:00",
        "Headline": "The father, a serving member of Gloucestershire Police, survived and was taken to Gloucestershire Royal Hospital for treatment.",
        "Content": "A mother and two children have died after a Boxing Day fire in Stroud, Gloucestershire.  The father, a serving member of Gloucestershire Police, survived and was taken to Gloucestershire Royal Hospital for treatment. The mother and two children, a seven-year-old girl and a four-year-old boy, were initially unaccounted for, but police have since confirmed their deaths. Authorities said the fire is not suspicious and is a \"tragic accident\". Emergency teams were called to a property on Brimscombe Hill, near Stroud, at around 3am on 26 December, a Gloucestershire Police spokesperson said. Officers attended the scene alongside crews from Gloucestershire Fire and Rescue Service and the ambulance service. The mother and father awoke around 3am and tried to get to their children, but were unable to due to the ferocity of the fire, DSI Ian Fletcher said in a briefing on Monday. \"The father has smashed his way out of the house through a bathroom window in order to try to access the children's bedroom via the outside.\" However he was unable to get back into the property. Mr Fletcher added: \"We have multiple witnesses who describe the anguish that he was going through, his inability to get in and save his children and save his wife. Read more from Sky News:Man shot dead by police after car crashCold temperatures forecast for new year Deputy Chief Fire Officer Nathaniel Hooton said firefighters worked extremely hard to get in as the fire raged in the house. There is significant damage to the property internally, and work continues to try to find out what started the fire, he said. Speaking near the scene, Reverend Peter Francis, the vicar of Holy Trinity Church, Brimscombe, told Sky News West of England and Wales correspondent Dan Whitehead: \"It's an absolutely terrible tragedy. It's really shocking. It's impacted people so deeply. \"There are no words to express what has happened. Our thoughts and prayers are with the family and with all who are grieving at this time.\""
    },
    {
        "title": "Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah",
        "description": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist.",
        "url": "https://news.sky.com/story/foreign-secretary-orders-review-of-serious-failures-in-case-of-british-egyptian-activist-alaa-abd-el-fattah-13488426",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7121151.jpg?20251229054137",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-29 21:00:00",
        "Headline": "\"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt.",
        "Content": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist. \"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt. Ms Cooper, the foreign secretary, said successive prime ministers were not briefed on the historic tweets, which date back as far as 2010, and civil servants in charge of the case were also \"unaware\" of them. The activist has since apologised \"unequivocally\" for his \"shocking and hurtful\" social media posts, in which he appears to call for violence against \"Zionists\" - but said some had been \"completely twisted\". Both the Conservatives and Reform UK have suggested he should have his British citizenship stripped for the posts - though it is understood there are no current plans for this, and the law does not appear to provide grounds to deport him. In a letter to the chair of the Foreign Affairs Committee, Dame Emily Thornberry, Ms Cooper said long-standing procedures and due diligence arrangements had been \"completely inadequate\" in the case. \"In the context of rising antisemitism, and recent horrific attacks against Jewish people in this country and around the world, I am deeply concerned that the unexpected emergence of these historical tweets - coming alongside the social media posts that I and other senior politicians sent on Boxing Day welcoming the conclusion of this long-running case and Mr El Fattah's reunion with his family - have added to the distress felt by Jewish communities in the UK, and I very much regret that,\" she wrote. \"I have asked the permanent under secretary as a matter of urgency to review the serious information failures in this case and more broadly the systems that are in place within the department for conducting due diligence on the individual high-profile consular and human-rights cases for which the FCDO is responsible, to ensure that those systems are functioning properly for the future, and that all necessary lessons are learned.\" Read more:Two people killed in Anthony Joshua car crash namedTrump offered Ukraine 15-year security guarantee, Zelenskyy says Mr Abd El-Fattah was a leading voice during Egypt's 2011 Arab Spring uprising and went on hunger strikes in prison. He was most recently detained in September 2019 and sentenced to five years in prison in December 2021 on charges of spreading false news. Egyptian President Abdel Fattah el-Sisi pardoned the activist earlier this year and he flew to the UK to reunite with his young son, who lives in Brighton, last week. He had been granted UK citizenship in December 2021 under Boris Johnson, reportedly through his UK-born mother. No 10 has defended the government's handling of the case, with the prime minister's official spokesperson saying: \"We welcome the return of a British citizen unfairly detained abroad, as we would in all cases and as we have done in the past. \"That is central to Britain's commitment to religious and political freedom. That said, it doesn't change the fact that we have condemned the nature of these historic tweets and we consider them to be abhorrent, and we've been very clear about that.\" In a statement, Mr Abd El-Fattah said: \"I unequivocally apologise. \"(The posts) were mostly expressions of a young man's anger and frustrations in a time of regional crises (the wars on Iraq, on Lebanon and Gaza), and the rise of police brutality against Egyptian youth. \"I particularly regret some that were written as part of online insult battles with the total disregard for how they read to other people. I should have known better.\""
    },
    {
        "title": "Man 'carrying handgun' shot and killed by police after crash in Norfolk",
        "description": "A man believed to have been carrying a handgun has been shot and killed by police after a car crash in the Norfolk town of Thetford. ",
        "url": "https://news.sky.com/story/man-carrying-handgun-shot-and-killed-by-police-after-crash-in-norfolk-13488175",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-thetford-shooting-police_7121296.jpg?20251229112228",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-29 06:33:00",
        "Headline": "Police say the man, who was pronounced dead at the scene, was believed to be the driver of one of two vehicles involved in the collision. ",
        "Content": "A man believed to have been carrying a handgun has been shot and killed by police after a car crash in the Norfolk town of Thetford.  The man is thought to have been the driver of one of two vehicles involved in the collision on London Road at around 8.25pm on Sunday. Norfolk Police said he left the scene holding what was described as a handgun and was shot by armed officers nearby. The man, believed to be aged in his 60s, was pronounced dead at the scene. The force has notified the police watchdog, the Independent Office for Police Conduct (IOPC), which has launched an investigation. Assistant Chief Constable David Buckley said: \"We understand this incident will cause concern in the community.\" He added: \"We are of course cooperating fully with the IOPC investigation and will be handing over all body-worn footage and 999 calls to ensure transparency. \n                  Unsafe meat warning after 70 butchered geese are dumped by the  roadside \n                 \n                  Mystery foam on river in Thetford sparks Environment Agency investigation\n                 \n                  Friday night's anti-migrant protests in Norwich were peaceful - but anger is bubbling\n                 \"We are not looking for anyone else in connection with the incident.\" Police said the A11 remains closed in both directions from the Thetford Ranges roundabout to the Brandon Road roundabout. The IOPC said it has begun an independent investigation. The watchdog said in a statement: \"At this early stage, we have established via police call logs that Norfolk Constabulary officers responded to a report of a collision involving two vehicles on London Road shortly before 8.30pm. \"Armed officers responded after it was reported that a man was seen leaving the collision scene holding what was described to be a handgun. \"Officers found a man by the A11 a short time later. We can confirm that two shots were fired by police shortly before 9pm. \"First aid was provided at the scene, however the man was sadly declared deceased shortly before 10.15pm.\""
    },
    {
        "title": "Octopus Energy lines up sale of stake in $10bn software arm Kraken",
        "description": "Octopus Energy Group is on the brink of selling a big stake in its software arm, Kraken Technologies, at a valuation that will cement its status as one of Britain's biggest private companies.",
        "url": "https://news.sky.com/story/octopus-energy-lines-up-sale-of-stake-in-10bn-software-arm-kraken-13488385",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-octopus-energy-istock_6957559.jpg?20250705073237",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-29 18:19:00",
        "Headline": "D1 Capital Partners and Fidelity are among the investors expected to buy between 10% and 20% of Kraken Technologies as part of its parent company's demerger of the fast-growing software business, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Octopus Energy Group is on the brink of selling a big stake in its software arm, Kraken Technologies, at a valuation that will cement its status as one of Britain's biggest private companies. Sky News has learnt that Octopus Energy has lined up a syndicate of investors to buy between 10% and 20% of Kraken. Sources said an investment was likely to value Kraken at between $9bn (£6.67bn) and $10bn (£7.4bn). D1 Capital Partners, a leading investor in technology businesses, the fund management giant Fidelity and an arm of Canada's Ontario Teachers Pension Plan are said to be among those participating in the deal. Octopus Energy - now Britain's biggest household gas and electricity supplier - engaged Goldman Sachs to handle the demerger of Kraken and the sale of a stake to external investors. Sources said the deal was expected to be announced imminently. The demerger plan - revealed by Sky News in July - will augment Octopus Energy chief executive Greg Jackson's paper fortune, and underline his success at building a globally significant British-based company over the last decade. \n                  UK pension funds eye stake in £4.5bn holiday giant Center Parcs\n                 \n                  High street banking giants vie for £2.5bn wealth manager Evelyn \n                 \n                  The UK's worst Christmas gifts: Rotten fruit, used pyjamas and a Spurs book for a Chelsea fan \n                 Octopus Energy now has more than 7.5 million retail customers in Britain, following its 2022 rescue of the collapsed energy supplier Bulb, and the subsequent acquisition of Shell's home energy business. In January, it announced that it had become the country's biggest supplier - surpassing Centrica-owned British Gas - with a 24% market share. It also has a further 2.5 million customers outside the UK. Sources said a $10bn valuation of Kraken would imply that the whole group, including the retail supply business, was worth in the region of £15bn. That would be double its valuation of little more than a year ago, when the company announced that it had secured new backing from funds Galvanize Climate Solutions and Lightrock. Shortly before that, the former US vice president Al Gore's firm, Generation Investment Management, and the Canada Pension Plan Investment Board increased their stakes in Octopus Energy in a transaction valuing the company at $9bn (£7.2bn). Kraken is an operating system which is licensed to other energy providers, water companies and telecoms suppliers. It connects all parts of the energy system, including customer billing and the flexible management of renewable generation and energy devices such as heat pumps and electric vehicle batteries. The business also unlocks smart grids which enable people to use more renewable energy when there is an abundant supply of it. In the UK, its platform is licensed to Octopus Energy's rivals EON and EDF Energy, as well as the water company Severn Trent and broadband provider Cuckoo. Overseas, Kraken serves Origin Energy in Australia, Japan's Tokyo Gas and Plentitude in countries including France and Greece. Kraken, which is chaired by Gavin Patterson, the former BT Group chief executive, is now contracted to more than 70 million customer accounts globally - putting it easily on track to hit a target of 100 million by 2027. Earlier this year, Mr Jackson said that target now risked being seen as \"embarrassingly unambitious\". In July last year, Kraken recruited Amir Orad, a former boss of NICE Actimize, a US-listed provider of enterprise software to global banks and Fortune 500 companies, as its first chief executive. One key advantage of demerging Kraken from the rest of Octopus Energy Group would be to remove the perception of a conflict of interest among potential customers of the technology platform. A source said the unified corporate ownership of both businesses had acted as a deterrent to some energy suppliers. Kraken has also diversified beyond the energy sector, and earlier this year joined a consortium which was exploring a takeover bid for stricken Thames Water. Octopus Energy has been contacted for comment."
    },
    {
        "title": "Man charged with murder of grandfather who died days after being punched outside village pub",
        "description": "A 36-year-old man has been charged with murder after a grandfather died six days after he was punched outside a village pub. ",
        "url": "https://news.sky.com/story/man-charged-with-murder-of-grandfather-who-died-days-after-being-punched-outside-village-pub-13488196",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-crown-inn-leicestershire_7120771.jpg?20251228143238",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-29 08:52:00",
        "Headline": "Nathan Gothard, 36, is due to appear in court over the death of David Darke, 66, after the incident near the Crown Inn in Appleby Magna, North West Leicestershire. ",
        "Content": "A 36-year-old man has been charged with murder after a grandfather died six days after he was punched outside a village pub.  David Darke, 66, died in hospital on Saturday after suffering a serious head injury near the Crown Inn in Appleby Magna, North West Leicestershire, on 21 December. Police said Nathan Gothard, 36, who is from the village, was due to appear at Leicester Magistrates' Court on Monday charged with his murder. In a statement released on Sunday, Mr Darke's family paid tribute to a \"devoted family man\". \"Dave was a deeply loved father to three daughters and a proud grandfather to three boys,\" they said. \"He was a much-loved brother and a dear friend. Dave will live on forever in our hearts, minds and souls. \"He was a strong, active, intelligent and kind person who was a friend to all. He was a devoted family man with a deep passion for life, the outdoors, nature and walking. \n                  New Year Honours: Idris Elba, Torvill and Dean, and Lionesses among those recognised\n                 \n                  Mother and two children aged four and seven confirmed dead in Boxing Day fire\n                 \n                  Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah\n                 \"His life was tragically cut short and he's now reunited with his loving, caring parents. He will be sorely missed by all who knew and loved him.\" Leicestershire Police previously said officers were called to the pub at around 9.45pm on Sunday 21 December. The force said the victim was outside when he was punched and sustained a serious head injury, while the suspect was arrested at the scene."
    },
    {
        "title": "Two people killed in Anthony Joshua car crash named as 'close friends' of boxer",
        "description": "The two \"close friends\" of Anthony Joshua killed in a car crash in Nigeria in which the British boxer was injured have been named by his spokesperson.",
        "url": "https://news.sky.com/story/two-people-killed-in-anthony-joshua-car-crash-named-by-nigerian-president-13488421",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-sina-ghami-anthony-joshua_7121784.jpg?20251229225852",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 20:25:00",
        "Headline": "The former two-time world heavyweight champion, 36, was taken to hospital for treatment along with another injured person, while two people were killed.",
        "Content": "The two \"close friends\" of Anthony Joshua killed in a car crash in Nigeria in which the British boxer was injured have been named by his spokesperson. Sina Ghami and Latif Ayodele died in Monday's road traffic accident which happened on a busy highway around lunchtime. They were both described as being \"integral members\" of the boxer's team. Joshua, a former two-time world heavyweight champion, suffered minor injuries as he travelled in the back of a black Lexus that hit a truck in Makun, ⁠Ogun State, about 30 miles from the country's biggest city, Lagos. Ghami and Ayodele were also passengers in the Lexus. Authorities said Joshua, 36, was taken to hospital for treatment along with another injured person. Joshua and the other survivor are described by officials as being in a \"stable\" condition. \n                  Joshua delivers taste of reality to YouTuber Jake Paul\n                 \n                  Jake Paul vs Anthony Joshua: All you need to know\n                 \n                  Anthony Joshua could return to ring to fight ex-YouTuber Jake Paul\n                 Police are investigating the cause of the accident. 'Shocking and devastating news' Naming the two men who died, Joshua's spokesperson said in a statement: \"It is with the deepest and most profound sadness that we confirm, following a road traffic accident in Lagos Nigeria earlier today, the death of Sina Ghami and Kevin 'Lateef' Ayodele. \"Both were close friends and integral members of Anthony's team. We respectfully ask that space and privacy be given to the families at this time while they process this truly shocking and devastating news.\" The Nigerian President Bola Ahmed Tinubu said on X: \"I have spoken with AJ to personally convey my condolences over the passing of his two close associates, Kevin Latif Ayodele and Sina Ghami in the recent accident. \"I wished him a full and speedy recovery, and prayed with him. AJ assured me he is receiving the best possible care.\" A statement on X by Joshua's promoter Eddie Hearn, from Matchroom Boxing, also confirmed the victims' names, saying: \"With profound sadness it has been confirmed that two close friends and team members Sina Ghami and Latif Ayodele have tragically passed away.\" The crash happened on the Lagos-Ibadan Expressway near Sagamu, at about midday local time (11am UK time), according to the Nigerian federal road safety corps (FRSC). Joshua is on holiday in Africa following his win over US YouTuber-turned-boxer Jake Paul in Miami just over a week ago. How did the crash happen? The FRSC said preliminary findings indicated the Lexus was \"suspected to be travelling beyond the legally prescribed limit\" and \"lost control\" while overtaking before crashing into the truck, which was parked by the side of the road. \"The primary causes of the crash being excessive speed and wrongful overtaking constitute serious traffic violations and remain among the leading causes of fatal road crashes on Nigerian highways,\" the corps said on X. The boxer has Nigerian heritage Joshua, who is the son of British-Nigerian parents, attended a boarding school in Ikenne, around 50 miles from where the crash happened, before returning to ‌Britain at the age of 12. Pictures released by the FRSC show the badly damaged Lexus that Joshua was travelling in and the red Sinotruck that it collided with. Footage posted on social media shows the British ex-world heavyweight champion apparently wincing in pain as he is helped out of the wreckage by a crowd. Other clips show him in an emergency vehicle, wearing only a pair of shorts, as he is driven away from the scene. The crash happened just days after Joshua knocked out Jake Paul in the sixth round of their fight in Miami. The fight marked the end of a 15-month hiatus for Joshua, who is expected to fight long-time rival Tyson Fury in 2026."
    },
    {
        "title": "Alleged strikes on Vladimir Putin residence 'not good', Donald Trump says",
        "description": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia.",
        "url": "https://news.sky.com/story/alleged-strikes-on-vladimir-putin-residence-not-good-donald-trump-says-13488414",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-donald-trump_7121670.jpg?20251229215047",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 19:57:00",
        "Headline": "Moscow has claimed it shot down 91 Ukrainian drones fired at Putin's state residence in Russia, which Kyiv denies.",
        "Content": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia. Sergei Lavrov, Moscow's long-serving foreign minister, said Kyiv launched the attack on Putin's home in the Novgorod region overnight on Sunday, but that all 91 drones used were shot down by Russian air defences. Ukrainian President Volodymyr Zeleskyy hit back against the claims, calling them \"lies\". Asked about the reports while welcoming Israeli Prime Minister Benjamin Netanyahu to his Mar-a-Lago estate in Florida on Monday, Mr Trump said it was \"not good\". \"I learned about it from ‌President Putin today. I was very angry about ‌it,\" he said, describing his second phone call with the Russian leader in as many days as \"very good\". \"It's a delicate period of time,\" he added. \"This is not ​the right time. It's one thing to be offensive, because they're offensive. ‍It's another thing to attack his house. It's not the right time to do any of that.\" US 'hit' Venezuela docks \n                  Trump offered Ukraine 15-year security guarantee as part of peace plan, Zelenskyy says\n                 \n                  Trump latest: US will 'knock the hell' out of Iran if it tries to rearm, US president says\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 Taking questions from the media alongside Mr Netanyahu, Mr Trump also confirmed the US \"hit\" a ⁠dock area in Venezuela where he ​alleged drugs ​were loaded onto boats. This would mark the ​first known time the US has carried out operations on land in Venezuela since a pressure campaign began against the government ⁠of President Nicolas Maduro several months ago. \"There ​was a major explosion in the dock ‍area where they load the boats up with drugs. They load ‌the boats ⁠up with drugs. We ‌hit all the ‍boats, and now we hit the area,\" Mr Trump said, without providing any ​further details. It was not immediately clear what target was hit, nor which part of the US government acted. Asked if the CIA had carried ‍out the attack, Mr Trump said: \"I don't want to say that. I know exactly who it was, but I don't want to say who it was.\" Warning sent to Iran With Mr Netanyahu arriving in Mar-a-Lago for talks concerning the Middle East, Mr Trump was quizzed on reports Iran is stepping up the rebuilding of its ballistic missile programme, despite the reintroduction of UN sanctions last month banning such activity. \"I hear that Iran is trying to build up again, and if they are, we're going to have to knock them down, we'll knock them down, we'll knock the hell out of them,\" Mr Trump said. \"But hopefully that's not happening. I heard Iran wants to make a deal. If they want to make a deal, that's much smarter. \"You know, they could have made a deal the last time, before we did a big attack on them.\" He adds: \"I think, again, they should make a deal. They want to make a deal. But sometimes that doesn't happen.\" Hamas 'must disarm' Mr Netanyahu is also seeking further US support in Gaza, where there has been little movement on the complex second phase of the Israel-Hamas truce, raising concerns that both sides are failing to take action to carry out the next phase of the deal. More than 400 people have been killed in Gaza since that agreement, local officials say, while Israel has accused Hamas of ceasefire violations, including the delayed return of hostage remains - with one body still to be handed over. Asked how quickly the ceasefire agreement can move to its second phase, Mr Trump said: \"As quickly as we can, but there has to be a disarmament. \"We have to disarm with Hamas. It's one of the things we'll talk about, certainly, but there has to be a disarming of Hamas.\""
    },
    {
        "title": "Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah",
        "description": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist.",
        "url": "https://news.sky.com/story/foreign-secretary-orders-review-of-serious-failures-in-case-of-british-egyptian-activist-alaa-abd-el-fattah-13488426",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7121151.jpg?20251229054137",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 21:00:00",
        "Headline": "\"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt.",
        "Content": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist. \"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt. Ms Cooper, the foreign secretary, said successive prime ministers were not briefed on the historic tweets, which date back as far as 2010, and civil servants in charge of the case were also \"unaware\" of them. The activist has since apologised \"unequivocally\" for his \"shocking and hurtful\" social media posts, in which he appears to call for violence against \"Zionists\" - but said some had been \"completely twisted\". Both the Conservatives and Reform UK have suggested he should have his British citizenship stripped for the posts - though it is understood there are no current plans for this, and the law does not appear to provide grounds to deport him. In a letter to the chair of the Foreign Affairs Committee, Dame Emily Thornberry, Ms Cooper said long-standing procedures and due diligence arrangements had been \"completely inadequate\" in the case. \"In the context of rising antisemitism, and recent horrific attacks against Jewish people in this country and around the world, I am deeply concerned that the unexpected emergence of these historical tweets - coming alongside the social media posts that I and other senior politicians sent on Boxing Day welcoming the conclusion of this long-running case and Mr El Fattah's reunion with his family - have added to the distress felt by Jewish communities in the UK, and I very much regret that,\" she wrote. \"I have asked the permanent under secretary as a matter of urgency to review the serious information failures in this case and more broadly the systems that are in place within the department for conducting due diligence on the individual high-profile consular and human-rights cases for which the FCDO is responsible, to ensure that those systems are functioning properly for the future, and that all necessary lessons are learned.\" Read more:Two people killed in Anthony Joshua car crash namedTrump offered Ukraine 15-year security guarantee, Zelenskyy says Mr Abd El-Fattah was a leading voice during Egypt's 2011 Arab Spring uprising and went on hunger strikes in prison. He was most recently detained in September 2019 and sentenced to five years in prison in December 2021 on charges of spreading false news. Egyptian President Abdel Fattah el-Sisi pardoned the activist earlier this year and he flew to the UK to reunite with his young son, who lives in Brighton, last week. He had been granted UK citizenship in December 2021 under Boris Johnson, reportedly through his UK-born mother. No 10 has defended the government's handling of the case, with the prime minister's official spokesperson saying: \"We welcome the return of a British citizen unfairly detained abroad, as we would in all cases and as we have done in the past. \"That is central to Britain's commitment to religious and political freedom. That said, it doesn't change the fact that we have condemned the nature of these historic tweets and we consider them to be abhorrent, and we've been very clear about that.\" In a statement, Mr Abd El-Fattah said: \"I unequivocally apologise. \"(The posts) were mostly expressions of a young man's anger and frustrations in a time of regional crises (the wars on Iraq, on Lebanon and Gaza), and the rise of police brutality against Egyptian youth. \"I particularly regret some that were written as part of online insult battles with the total disregard for how they read to other people. I should have known better.\""
    },
    {
        "title": "Three police officers and six militants killed in shooting in Turkey ",
        "description": "Six militants and three police officers have been killed during a shoot-out after extremists clashed with authorities in Turkey. &#160;",
        "url": "https://news.sky.com/story/three-police-officers-and-six-militants-killed-in-shooting-in-turkey-13488280",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-turkey-islamic-state-militants_7121215.jpg?20251229144515",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 13:15:00",
        "Headline": "At least eight police officers and a night guard were also wounded in the confrontation in the country's northwest on Monday, Turkey's interior minister said.",
        "Content": "Six militants and three police officers have been killed during a shoot-out after extremists clashed with authorities in Turkey.   At least eight police officers and a night guard were also wounded in the confrontation in the country's northwest on Monday, Turkey's interior minister said. Shots were fired after police stormed a house where the alleged militants were hiding in the Elmali district in Yalova province, south of Istanbul. Turkey's interior minister Ali Yerlikaya said the operation was one of more than 100 simultaneous raids carried out in 15 provinces across the country against suspected IS militants. The violence comes amid a crackdown on extremist groups across with country, with Turkish police carrying out another wave of raids last week. Some 115 militants were arrested for allegedly planning attacks targeting Christmas and new year celebrations during this operation. Mr Yerlikaya said the operation in Yalova was carried out with \"great care\" because women and children were inside the house where the alleged militants were located. \n                  Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News\n                 \n                  US launches 'large-scale' strikes to 'eliminate' Islamic State fighters in Syria after US citizens killed in desert\n                 \n                  Counterterrorism review calls for Shamima Begum and other British-linked people in Syria to be repatriated\n                 All the militants arrested were Turkish nationals, the minister said. Turkish President Recep Tayyip Erdogan expressed his condolences for the police officers who were killed and vowed to push ahead with the fight against extremist groups. \"We will continue our fight against the blood‑stained killers who threaten our nation's peace and our state's security both within our borders and beyond, with determination, comprehensively and without compromise,\" he said in a statement posted on X. Read more from Sky News:Anthony Joshua injured in car crash in NigeriaActivist Alaa Abd El-Fattah apologises for historic tweets The Yalova Chief Public Prosecutor's Office launched an investigation into Monday's shooting. Turkish justice minister Yilmaz Tunc said on X that five prosecutors had been appointed to lead the probe. 👉 Tap here to follow The World With Richard Engel And Yalda Hakim wherever you get your podcasts 👈 IS has carried out a series of deadly attacks in Turkey in recent years, including a shooting at an Istanbul nightclub during new year celebrations in 2017, which killed 39 people."
    },
    {
        "title": "Trump offered Ukraine 15-year security guarantee as part of peace plan, Zelenskyy says",
        "description": "Donald Trump has offered Ukraine security guarantees for 15 years as part of a proposed plan to end Russia's invasion, Volodymyr Zelenskyy has said.",
        "url": "https://news.sky.com/story/trump-offered-ukraine-15-year-security-guarantee-as-part-of-peace-plan-zelenskyy-says-13488380",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_7121179.jpg?20251229075316",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 17:40:00",
        "Headline": "The Ukrainian president said he would prefer a commitment of up to 50 years to deter Moscow from further attempts to seize Ukrainian land.",
        "Content": "Donald Trump has offered Ukraine security guarantees for 15 years as part of a proposed plan to end Russia's invasion, Volodymyr Zelenskyy has said. The Ukrainian president said he would prefer a commitment of up to 50 years to deter Moscow from further attempts to seize Ukrainian land. Mr Trump hosted Mr Zelenskyy at his Florida resort on Sunday and made the claim that Ukraine and Russia were \"closer than ever before\" to a peace settlement. Mr Zelenskyy said the security guarantees include how a peace deal would be monitored as well as the \"presence\" of partners, adding: \"Without security guarantees, realistically, this war will not end.\" Ukraine war latest: Zelenskyy says he knows what Kremlin is doing Negotiators were still looking for a breakthrough on key issues, including whose forces withdraw from which area and the fate of the Russian-occupied Zaporizhzhia nuclear power plant. On Monday, Mr Trump had \"a positive call\" with Mr Putin about the war, White House press secretary Karoline Leavitt said in a post on X. The two leaders also spoke ahead of Mr Trump's talks with Mr Zelenskyy on Sunday. During the call, Mr Putin claimed Ukraine had attempted to attack his residence in northwestern Russia with long-range drones almost immediately after the talks with Mr Zelenskyy. However, Mr Zelenskyy said the Russian claim was false and said it was an attempt to undermine the peace negotiations, describing it as \"another lie\" because Moscow is unnerved about progress in the talks. Speaking at a meeting alongside Israeli Prime Minister Benjamin Netanyahu later in the day, Mr Trump said Mr Putin had told him about the purported attack. \"I don't like it. It's not good,\" Mr Trump said, when asked if he was worried the allegation could affect his efforts to broker peace. \"I learned about it from ‌President Putin today. I was very angry about ‌it.\" He added: \"It's a delicate period of time. This is not ​the right time. It's one thing to be offensive, because they're offensive. ‍It's another thing to attack his house. It's not the right time to do any of that.\" Asked if there was any evidence for the attack, Mr Trump replied: \"We'll find out.\" Trump would consider extending guarantees, Zelenskyy claims Meanwhile, Mr Putin claimed Russian troops are advancing in the eastern Donetsk region of Ukraine and also continuing their offensive in the southern Zaporizhzhia region. French President Emmanuel Macron said Kyiv's allies will meet in Paris in early January to \"finalise each country's concrete contributions\" to security guarantees. According to Mr Zelenskyy, Mr Trump said he would consider extending US security guarantees beyond 15 years. Peace plan to be put to Ukrainians in national referendum Mr Zelenskyy said any guarantees would be approved by the US Congress as well as parliamentarians in other countries involved in overseeing any settlement, with the 20-point peace plan under discussion to be approved by Ukrainians in a national referendum. He said holding a ballot would require a ceasefire of at least 60 days."
    },
    {
        "title": "It's easy to get lost in multi-point plans and spin - but Zelenskyy's reaction to Trump said it all",
        "description": "Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important.",
        "url": "https://news.sky.com/story/its-easy-to-get-lost-in-multi-point-plans-and-spin-but-zelenskyys-reaction-to-trump-said-it-all-13488169",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-volodymyr-zelenskyy_7121145.jpg?20251229030904",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-12-29 02:17:00",
        "Headline": "The Mar-a-Lago meeting between Donald Trump and Volodymyr Zelenskyy did not materially move things forward, but there were some notable takeaways - and no bust-up like the infamous Oval Office encounter in February.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important. The Mar-a-Lago meeting did not materially move things forward but nor was there a bust-up like that Oval Office moment in February. There were however some notable takeaways. First, Zelenskyy's facial expressions. At times he looked exasperated - like when Trump made light of a profoundly important negotiation by talking about the Mar-a-Lago food and the physique of the Ukrainian leader's generals. Playground stuff. There was a memorable moment when Zelenskyy's poker face fell away. He shrugged, then laughed as Trump said: \"Russia wants Ukraine to succeed.\" What a profoundly stupid thing for the American president to say. Look at Vladimir Putin's actions. Listen to his words. It's hard to know sometimes whether Trump is just ignorant, tuned out of the detail, or actually in Putin's pocket. Zelenskyy probably has a view but managed, just, to hold his decorum. Beyond the spectacle of Zelenskyy's face, there were some other important moments - if only because they will act as markers when Trump shifts his position, as he has so many times. On US security guarantees, Zelenskyy seemed reassured that Trump's America would provide some sort of military backdrop - to counter renewed Russian aggression in the future. But neither leader spelled out what that would look like. Ukrainian sources have told me that Trump's commitment to back his support for Ukraine with security guarantees is a key point (never mind the fact that Trump did this months ago and then backtracked). The same sources have also said that Trump's apparent willingness to go to Ukraine and address parliament there, which he articulated today for the first time, is a positive commitment. Let's see if he sticks to it, or shifts again, and on the security guarantees. The most articulate moment from the meandering and confused news conference came from Zelenskyy when he charted progress with percentages. He said: So, that confirms Zelenskyy has accepted US commitments on security guarantees but shows that more work is required to pin down some elements in US-Europe security co-operation. That's key because it involves the prospect of European troops on the ground in Ukraine. It's a Russian redline - and Trump knows that. It's easy to get lost in all this: the progress, the positions, the multi-point plans and the spin. But remember a few fundamentals. First, Trump may want this war to end, but he doesn't care how it happens. Second, Putin has shown no genuine signals that he wants the war to end. Third, Ukraine doesn't want to be forced into a subjugating surrender. A few weeks ago the Americans produced a 28-point plan. It amounted to a Russian wish-list. Since then, the Ukrainians, with the Europeans and co-ordinating with the Americans, have refined it. It's 20 points now, and within it are plenty of Ukrainian concessions. Europe and Ukraine now expect Trump to focus the pressure back on Moscow and to engage Vladimir Putin in a way that moves him. Don't hold your breath."
    },
    {
        "title": "Chinese aircraft and navy conduct drills around Taiwan in warning against 'external interference'",
        "description": "China has conducted more military drills around Taiwan in a warning against \"external interference\".",
        "url": "https://news.sky.com/story/chinese-aircraft-and-navy-conduct-drills-around-taiwan-in-warning-against-external-interference-13488185",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-taiwan-china_7121187.jpg?20251229081918",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 07:33:00",
        "Headline": "It comes after Beijing expressed anger at Japan's prime minister, who said her military could get involved if China took action against Taiwan.",
        "Content": "China has conducted more military drills around Taiwan in a warning against \"external interference\". Taiwan said it was placing its forces on alert and called the Chinese government \"the biggest destroyer of peace\". Air, sea and rocket troops were dispatched to take part in the joint exercises around the island, which Beijing continues to insist must come under its rule. Taiwan's defence ministry said 89 Chinese military aircraft and drones were detected, with 67 entering Taiwan's response area. The country's transport ministry said it will divert international flights from what it says are dangerous areas or issue alternative flight routes to ensure safety. Chinese aircraft frequently fly near Taiwanese airspace as tensions persist in the Taiwan Strait. The drills came after Beijing expressed anger at US weapons sales to Taiwan and a statement from Japan's Prime Minister Sanae Takaichi, who said her military could get involved if China were to take action against Taiwan. \n                  China imposes 13% tax on condoms as birth rate declines \n                 \n                  Trump says he has asked Xi Jinping to free Briton Jimmy Lai\n                 \n                  Briton Jimmy Lai found guilty of national security offences in Hong Kong\n                 Senior Colonel Shi Yi, a Chinese military spokesperson, said the drills would be conducted in the Taiwan Strait and areas to the north, southwest, southeast and east of the island. Col Shi said the activities would focus on sea-air combat readiness patrol, \"joint seizure of comprehensive superiority\" and blockades on key ports. It was also the first large-scale military drill where the command publicly mentioned one of the goals was \"all-dimensional deterrence outside the island chain\". \"It is a stern warning against 'Taiwan independence' separatist forces and external interference forces, and it is a legitimate and necessary action to safeguard China's sovereignty and national unity,\" Col Shi said. Read more:Taiwan's president sets date to prepare for combat with ChinaGovernment delays Chinese 'super embassy' decision Taiwan's Defence Ministry said rapid response exercises were underway, with forces on high alert to defend the island. \"The Chinese Communist Party's targeted military exercises further confirm its nature as an aggressor and the biggest destroyer of peace,\" the ministry said. The ministry also claimed that the drill areas include Taiwan's territorial waters. Taiwan has been ruled separately from China since 1949 following the civil war that brought the Communist Party to power in the mainland. The island has operated since then with its own government, though Beijing still claims it as sovereign territory."
    },
    {
        "title": "At least 13 people dead and dozens injured after train derails in Mexico, authorities say",
        "description": "At least 13 people have died and dozens more are being treated for their injuries after a train derailed in Mexico, authorities have said.",
        "url": "https://news.sky.com/story/at-least-13-people-dead-and-dozens-injured-after-train-derails-in-mexico-authorities-say-13488164",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-mexico-train-derailment_7121142.jpg?20251229020909",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-29 00:18:00",
        "Headline": "Some 250 people, including 241 passengers and nine crew members, were on board the train, according to details released by the Mexican Navy.",
        "Content": "At least 13 people have died and dozens more are being treated for their injuries after a train derailed in Mexico, authorities have said. The ⁠accident happened between the towns of Chivela and Nizanda in the ​southern state ​of Oaxaca, on a line connecting the Pacific Ocean with the Gulf of Mexico, on Sunday. Some 250 people, including 241 passengers and nine crew members, were on board, according to details released by the Mexican Navy, which controls the route. At least 13 people were killed, the navy said, with 98 injured - including 36 who needed hospital medical assistance. President Claudia Sheinbaum said on X that five of the injured are in a critical condition. During extensive search and rescue operations, the navy said it deployed a total of 360 personnel, 20 vehicles, four ground ambulances, three air ambulances, and one tactical drone. Footage from the scene shows emergency workers helping passengers disembark, and some of the injured being carried on stretchers. \"We didn't even know what happened,\" said passenger Rosa Isela Ramírez. An investigation into the incident has been opened, Attorney General ​Ernestina Godoy Ramos said in a post on social media. The interoceanic train launched in 2023 under the country's former president Andres Manuel Lopez Obrador. It forms part of the broader Interoceanic Corridor project, designed to modernise the ‌rail link across the Isthmus of Tehuantepec - ⁠connecting the Pacific port of Salina Cruz with ‌Coatzacoalcos on the Gulf Coast, covering a distance of approximately 180 miles (290km). The Mexican government has been working to develop the strip of land into a strategic trade corridor, expanding ports, railways and industrial infrastructure with the goal of creating a route that could compete with the Panama Canal. Read more from Sky News:What happened at Ukraine peace deal talks?Child dies after house fire in Kent In a statement, the Mexican Navy expressed condolences to the families of those \"who lost their lives in this tragic accident\". The governor of Oaxaca, Salomon Jara Cruz, also sent condolences to the families of those killed and said state authorities were coordinating with federal agencies to assist those affected."
    },
    {
        "title": "Alleged strikes on Vladimir Putin residence 'not good', Donald Trump says",
        "description": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia.",
        "url": "https://news.sky.com/story/alleged-strikes-on-vladimir-putin-residence-not-good-donald-trump-says-13488414",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-donald-trump_7121670.jpg?20251229215047",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-29 19:57:00",
        "Headline": "Moscow has claimed it shot down 91 Ukrainian drones fired at Putin's state residence in Russia, which Kyiv denies.",
        "Content": "Donald Trump said he was \"very angry\" to hear reports of an alleged Ukrainian drone strike on one of Vladimir Putin's state residences in Russia. Sergei Lavrov, Moscow's long-serving foreign minister, said Kyiv launched the attack on Putin's home in the Novgorod region overnight on Sunday, but that all 91 drones used were shot down by Russian air defences. Ukrainian President Volodymyr Zeleskyy hit back against the claims, calling them \"lies\". Asked about the reports while welcoming Israeli Prime Minister Benjamin Netanyahu to his Mar-a-Lago estate in Florida on Monday, Mr Trump said it was \"not good\". \"I learned about it from ‌President Putin today. I was very angry about ‌it,\" he said, describing his second phone call with the Russian leader in as many days as \"very good\". \"It's a delicate period of time,\" he added. \"This is not ​the right time. It's one thing to be offensive, because they're offensive. ‍It's another thing to attack his house. It's not the right time to do any of that.\" US 'hit' Venezuela docks \n                  Trump offered Ukraine 15-year security guarantee as part of peace plan, Zelenskyy says\n                 \n                  Trump latest: US will 'knock the hell' out of Iran if it tries to rearm, US president says\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 Taking questions from the media alongside Mr Netanyahu, Mr Trump also confirmed the US \"hit\" a ⁠dock area in Venezuela where he ​alleged drugs ​were loaded onto boats. This would mark the ​first known time the US has carried out operations on land in Venezuela since a pressure campaign began against the government ⁠of President Nicolas Maduro several months ago. \"There ​was a major explosion in the dock ‍area where they load the boats up with drugs. They load ‌the boats ⁠up with drugs. We ‌hit all the ‍boats, and now we hit the area,\" Mr Trump said, without providing any ​further details. It was not immediately clear what target was hit, nor which part of the US government acted. Asked if the CIA had carried ‍out the attack, Mr Trump said: \"I don't want to say that. I know exactly who it was, but I don't want to say who it was.\" Warning sent to Iran With Mr Netanyahu arriving in Mar-a-Lago for talks concerning the Middle East, Mr Trump was quizzed on reports Iran is stepping up the rebuilding of its ballistic missile programme, despite the reintroduction of UN sanctions last month banning such activity. \"I hear that Iran is trying to build up again, and if they are, we're going to have to knock them down, we'll knock them down, we'll knock the hell out of them,\" Mr Trump said. \"But hopefully that's not happening. I heard Iran wants to make a deal. If they want to make a deal, that's much smarter. \"You know, they could have made a deal the last time, before we did a big attack on them.\" He adds: \"I think, again, they should make a deal. They want to make a deal. But sometimes that doesn't happen.\" Hamas 'must disarm' Mr Netanyahu is also seeking further US support in Gaza, where there has been little movement on the complex second phase of the Israel-Hamas truce, raising concerns that both sides are failing to take action to carry out the next phase of the deal. More than 400 people have been killed in Gaza since that agreement, local officials say, while Israel has accused Hamas of ceasefire violations, including the delayed return of hostage remains - with one body still to be handed over. Asked how quickly the ceasefire agreement can move to its second phase, Mr Trump said: \"As quickly as we can, but there has to be a disarmament. \"We have to disarm with Hamas. It's one of the things we'll talk about, certainly, but there has to be a disarming of Hamas.\""
    },
    {
        "title": "It's easy to get lost in multi-point plans and spin - but Zelenskyy's reaction to Trump said it all",
        "description": "Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important.",
        "url": "https://news.sky.com/story/its-easy-to-get-lost-in-multi-point-plans-and-spin-but-zelenskyys-reaction-to-trump-said-it-all-13488169",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ukraine-volodymyr-zelenskyy_7121145.jpg?20251229030904",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-12-29 02:17:00",
        "Headline": "The Mar-a-Lago meeting between Donald Trump and Volodymyr Zelenskyy did not materially move things forward, but there were some notable takeaways - and no bust-up like the infamous Oval Office encounter in February.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n Not going backwards is a win. Given Donald Trump's fraught relationship with Volodymyr Zelenskyy, that's important. The Mar-a-Lago meeting did not materially move things forward but nor was there a bust-up like that Oval Office moment in February. There were however some notable takeaways. First, Zelenskyy's facial expressions. At times he looked exasperated - like when Trump made light of a profoundly important negotiation by talking about the Mar-a-Lago food and the physique of the Ukrainian leader's generals. Playground stuff. There was a memorable moment when Zelenskyy's poker face fell away. He shrugged, then laughed as Trump said: \"Russia wants Ukraine to succeed.\" What a profoundly stupid thing for the American president to say. Look at Vladimir Putin's actions. Listen to his words. It's hard to know sometimes whether Trump is just ignorant, tuned out of the detail, or actually in Putin's pocket. Zelenskyy probably has a view but managed, just, to hold his decorum. Beyond the spectacle of Zelenskyy's face, there were some other important moments - if only because they will act as markers when Trump shifts his position, as he has so many times. On US security guarantees, Zelenskyy seemed reassured that Trump's America would provide some sort of military backdrop - to counter renewed Russian aggression in the future. But neither leader spelled out what that would look like. Ukrainian sources have told me that Trump's commitment to back his support for Ukraine with security guarantees is a key point (never mind the fact that Trump did this months ago and then backtracked). The same sources have also said that Trump's apparent willingness to go to Ukraine and address parliament there, which he articulated today for the first time, is a positive commitment. Let's see if he sticks to it, or shifts again, and on the security guarantees. The most articulate moment from the meandering and confused news conference came from Zelenskyy when he charted progress with percentages. He said: So, that confirms Zelenskyy has accepted US commitments on security guarantees but shows that more work is required to pin down some elements in US-Europe security co-operation. That's key because it involves the prospect of European troops on the ground in Ukraine. It's a Russian redline - and Trump knows that. It's easy to get lost in all this: the progress, the positions, the multi-point plans and the spin. But remember a few fundamentals. First, Trump may want this war to end, but he doesn't care how it happens. Second, Putin has shown no genuine signals that he wants the war to end. Third, Ukraine doesn't want to be forced into a subjugating surrender. A few weeks ago the Americans produced a 28-point plan. It amounted to a Russian wish-list. Since then, the Ukrainians, with the Europeans and co-ordinating with the Americans, have refined it. It's 20 points now, and within it are plenty of Ukrainian concessions. Europe and Ukraine now expect Trump to focus the pressure back on Moscow and to engage Vladimir Putin in a way that moves him. Don't hold your breath."
    },
    {
        "title": "Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump",
        "description": "Israeli Prime Minister Benjamin Netanyahu is on his way to meet US President Donald Trump in Florida. ",
        "url": "https://news.sky.com/story/three-war-fronts-on-the-agenda-as-benjamin-netanyahu-set-for-talks-with-donald-trump-13488041",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-benjamin-netanyahu_7120828.jpg?20251228152309",
        "type": "US",
        "Author": "Yousra Elbagir, Sky correspondent",
        "Date Published": "2025-12-29 05:25:00",
        "Headline": "The future of the Middle East currently hinges on how Donald Trump reacts to Benjamin Netanyahu's desire to continue Israel's war effort in the region, writes Sky's Yousra Elbagir.",
        "Content": "By Yousra Elbagir, Sky correspondent  Israeli Prime Minister Benjamin Netanyahu is on his way to meet US President Donald Trump in Florida.  Three of Israel's war fronts are on the agenda: Gaza, Iran and Lebanon. The White House is expected to want to iron out the next phase of Trump's peace plan in Gaza, which involves a Palestinian technocratic government and the demilitarisation of the territory through an international stabilisation force composed of foreign troops. Israel has said three countries, including Indonesia, are ready to deploy in Gaza, but Netanyahu is still expected to stall on demilitarisation and reject any plans to disarm Hamas that does not include the Israel Defence Forces (IDF). In the lead-up to the meeting, his defence minister Israel Katz said about Gaza's future: \"We are deep inside Gaza and we will never leave Gaza, there will be no such thing. We're there to defend, to prevent what happened in the past.\" Israeli strikes have continued through the ceasefire period. The Gaza health ministry said more than 400 people have been killed and at least 1,000 others injured since the ceasefire started on 10 October. \n                  Trump latest: US will 'knock the hell' out of Iran if it tries to rearm, US president says\n                 \n                  Truly unprecedented situation - how can you pardon a prime minister who hasn't been convicted?\n                 \n                  Trump asks Israeli president to 'fully pardon' Netanyahu in corruption trial\n                 In the meeting, Netanyahu is also expected to push for more strikes on Iran and argue that its nuclear programme still needs to be addressed. This could be in opposition to Trump's foreign policy priorities, especially after his strong stance on ending Israel's 12-day war with Iran in June. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Read more from Sky News:Harsh reality of life in Gaza under US-backed ceasefireMyanmar holds election - but critics call it a 'sham' vote Lebanon is also on the table for discussion. Israel has not upheld its end of the ceasefire agreement and has continued to bomb southern Lebanon and even strike the capital, Beirut. Israel's Channel 13 has reported that Netanyahu will present Trump with intelligence to expand growing operations against Lebanese militant group Hezbollah. The future of the Middle East currently hinges on how Trump reacts to Netanyahu's desire to continue Israel's war effort in the region."
    },
    {
        "title": "Octopus Energy lines up sale of stake in $10bn software arm Kraken",
        "description": "Octopus Energy Group is on the brink of selling a big stake in its software arm, Kraken Technologies, at a valuation that will cement its status as one of Britain's biggest private companies.",
        "url": "https://news.sky.com/story/octopus-energy-lines-up-sale-of-stake-in-10bn-software-arm-kraken-13488385",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-octopus-energy-istock_6957559.jpg?20250705073237",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-29 18:19:00",
        "Headline": "D1 Capital Partners and Fidelity are among the investors expected to buy between 10% and 20% of Kraken Technologies as part of its parent company's demerger of the fast-growing software business, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Octopus Energy Group is on the brink of selling a big stake in its software arm, Kraken Technologies, at a valuation that will cement its status as one of Britain's biggest private companies. Sky News has learnt that Octopus Energy has lined up a syndicate of investors to buy between 10% and 20% of Kraken. Sources said an investment was likely to value Kraken at between $9bn (£6.67bn) and $10bn (£7.4bn). D1 Capital Partners, a leading investor in technology businesses, the fund management giant Fidelity and an arm of Canada's Ontario Teachers Pension Plan are said to be among those participating in the deal. Octopus Energy - now Britain's biggest household gas and electricity supplier - engaged Goldman Sachs to handle the demerger of Kraken and the sale of a stake to external investors. Sources said the deal was expected to be announced imminently. The demerger plan - revealed by Sky News in July - will augment Octopus Energy chief executive Greg Jackson's paper fortune, and underline his success at building a globally significant British-based company over the last decade. \n                  UK pension funds eye stake in £4.5bn holiday giant Center Parcs\n                 \n                  High street banking giants vie for £2.5bn wealth manager Evelyn \n                 \n                  The UK's worst Christmas gifts: Rotten fruit, used pyjamas and a Spurs book for a Chelsea fan \n                 Octopus Energy now has more than 7.5 million retail customers in Britain, following its 2022 rescue of the collapsed energy supplier Bulb, and the subsequent acquisition of Shell's home energy business. In January, it announced that it had become the country's biggest supplier - surpassing Centrica-owned British Gas - with a 24% market share. It also has a further 2.5 million customers outside the UK. Sources said a $10bn valuation of Kraken would imply that the whole group, including the retail supply business, was worth in the region of £15bn. That would be double its valuation of little more than a year ago, when the company announced that it had secured new backing from funds Galvanize Climate Solutions and Lightrock. Shortly before that, the former US vice president Al Gore's firm, Generation Investment Management, and the Canada Pension Plan Investment Board increased their stakes in Octopus Energy in a transaction valuing the company at $9bn (£7.2bn). Kraken is an operating system which is licensed to other energy providers, water companies and telecoms suppliers. It connects all parts of the energy system, including customer billing and the flexible management of renewable generation and energy devices such as heat pumps and electric vehicle batteries. The business also unlocks smart grids which enable people to use more renewable energy when there is an abundant supply of it. In the UK, its platform is licensed to Octopus Energy's rivals EON and EDF Energy, as well as the water company Severn Trent and broadband provider Cuckoo. Overseas, Kraken serves Origin Energy in Australia, Japan's Tokyo Gas and Plentitude in countries including France and Greece. Kraken, which is chaired by Gavin Patterson, the former BT Group chief executive, is now contracted to more than 70 million customer accounts globally - putting it easily on track to hit a target of 100 million by 2027. Earlier this year, Mr Jackson said that target now risked being seen as \"embarrassingly unambitious\". In July last year, Kraken recruited Amir Orad, a former boss of NICE Actimize, a US-listed provider of enterprise software to global banks and Fortune 500 companies, as its first chief executive. One key advantage of demerging Kraken from the rest of Octopus Energy Group would be to remove the perception of a conflict of interest among potential customers of the technology platform. A source said the unified corporate ownership of both businesses had acted as a deterrent to some energy suppliers. Kraken has also diversified beyond the energy sector, and earlier this year joined a consortium which was exploring a takeover bid for stricken Thames Water. Octopus Energy has been contacted for comment."
    },
    {
        "title": "Foreign secretary orders review of 'serious failures' in case of British-Egyptian activist Alaa Abd El-Fattah",
        "description": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist.",
        "url": "https://news.sky.com/story/foreign-secretary-orders-review-of-serious-failures-in-case-of-british-egyptian-activist-alaa-abd-el-fattah-13488426",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-alaa-abd-el-fattah_7121151.jpg?20251229054137",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-29 21:00:00",
        "Headline": "\"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt.",
        "Content": "Yvette Cooper has ordered an urgent Foreign Office review of \"serious information failures\" in the case of a freed British-Egyptian activist. \"Abhorrent\" social media posts by Alaa Abd El-Fattah emerged after he returned to the UK on Boxing Day following several years of imprisonment in Egypt. Ms Cooper, the foreign secretary, said successive prime ministers were not briefed on the historic tweets, which date back as far as 2010, and civil servants in charge of the case were also \"unaware\" of them. The activist has since apologised \"unequivocally\" for his \"shocking and hurtful\" social media posts, in which he appears to call for violence against \"Zionists\" - but said some had been \"completely twisted\". Both the Conservatives and Reform UK have suggested he should have his British citizenship stripped for the posts - though it is understood there are no current plans for this, and the law does not appear to provide grounds to deport him. In a letter to the chair of the Foreign Affairs Committee, Dame Emily Thornberry, Ms Cooper said long-standing procedures and due diligence arrangements had been \"completely inadequate\" in the case. \"In the context of rising antisemitism, and recent horrific attacks against Jewish people in this country and around the world, I am deeply concerned that the unexpected emergence of these historical tweets - coming alongside the social media posts that I and other senior politicians sent on Boxing Day welcoming the conclusion of this long-running case and Mr El Fattah's reunion with his family - have added to the distress felt by Jewish communities in the UK, and I very much regret that,\" she wrote. \"I have asked the permanent under secretary as a matter of urgency to review the serious information failures in this case and more broadly the systems that are in place within the department for conducting due diligence on the individual high-profile consular and human-rights cases for which the FCDO is responsible, to ensure that those systems are functioning properly for the future, and that all necessary lessons are learned.\" Read more:Two people killed in Anthony Joshua car crash namedTrump offered Ukraine 15-year security guarantee, Zelenskyy says Mr Abd El-Fattah was a leading voice during Egypt's 2011 Arab Spring uprising and went on hunger strikes in prison. He was most recently detained in September 2019 and sentenced to five years in prison in December 2021 on charges of spreading false news. Egyptian President Abdel Fattah el-Sisi pardoned the activist earlier this year and he flew to the UK to reunite with his young son, who lives in Brighton, last week. He had been granted UK citizenship in December 2021 under Boris Johnson, reportedly through his UK-born mother. No 10 has defended the government's handling of the case, with the prime minister's official spokesperson saying: \"We welcome the return of a British citizen unfairly detained abroad, as we would in all cases and as we have done in the past. \"That is central to Britain's commitment to religious and political freedom. That said, it doesn't change the fact that we have condemned the nature of these historic tweets and we consider them to be abhorrent, and we've been very clear about that.\" In a statement, Mr Abd El-Fattah said: \"I unequivocally apologise. \"(The posts) were mostly expressions of a young man's anger and frustrations in a time of regional crises (the wars on Iraq, on Lebanon and Gaza), and the rise of police brutality against Egyptian youth. \"I particularly regret some that were written as part of online insult battles with the total disregard for how they read to other people. I should have known better.\""
    }
]