[
    {
        "title": "Anthony Joshua pays respects to friends killed in road crash",
        "description": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends.",
        "url": "https://news.sky.com/story/anthony-joshua-discharged-from-hospital-after-fatal-road-crash-13489140",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anthony-joshua-boxer_7080597.jpg?20251112230721",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 23:15:00",
        "Headline": "The British-Nigerian boxing star is now recovering at his home in the country, according to a statement from the regional governments of Lagos and Ogun states.",
        "Content": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends. The British-Nigerian boxing star is now recovering at his home in the country, according to a statement from the regional governments of Lagos and Ogun states. Joshua was travelling in the back of a black SUV when it hit a stationary truck on a major road near Lagos on Monday, killing his friends Latif Ayodele and Sina Ghami. The 36-year-old two-time world champion and his mother paid their respects to them at a funeral home on Wednesday afternoon ahead of their repatriation to the UK, the statement added. \"Anthony Joshua was discharged from hospital late this afternoon though heavy hearted and full of emotions over the loss of his two close friends he was deemed fit (enough) to recuperate from home,\" the statement, posted on X, read. The post also expressed gratitude for the team of doctors and medical staff at the Lagoon Hospital Ikoyi \"that attended to Anthony and those that sustained injuries. \"The quality of care and professionalism is truly commendable.\" Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria following his win over Jake Paul in Miami on 19 December. He survived with minor injuries, police have said. Joshua's spokesperson said in a statement Mr Ghami and Mr Ayodele \"were close friends and integral members of Anthony's team\". How did the crash happen? The crash happened on the Lagos-Ibadan Expressway near Sagamu, at about midday local time (11am UK time), according to the Nigerian federal road safety corps (FRSC). The FRSC said preliminary findings indicated the Lexus was \"suspected to be travelling beyond the legally prescribed limit\" and \"lost control\" while overtaking before crashing into the truck, which was parked by the side of the road. \"The primary causes of the crash being excessive speed and wrongful overtaking constitute serious traffic violations and remain among the leading causes of fatal road crashes on Nigerian highways,\" the corps said on X. 'Traumatised situation' On Wednesday, a close friend of Joshua told Sky News the boxer would be in a \"traumatised situation\" from seeing another friend die in a car crash, who was more like a \"twin brother\" to him. Kolawole Omoboriowo, who has known Joshua for eight years, was the one to break the news to the athlete's family about the accident. Mr Omoboriowo, who coordinates Joshua's logistics in Nigeria, said the boxer's family were \"like my other family in the UK\". The time since has been a \"crazy nightmare for everyone\", he said. He also said Mr Ayodele, one of the two people killed in the accident, was \"more than a friend\" to Joshua and more like a \"twin brother\"."
    },
    {
        "title": "Why there's no escape from Delhi's biggest killer",
        "description": "\"The air is absolutely poison, in the last two years we've not had even one single good a day in spite of the monsoon rain,\" says Bhavreen Kandhari, an activist spearheading a public movement on clean air.",
        "url": "https://news.sky.com/story/why-theres-no-escape-from-delhis-biggest-killer-13489079",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-air-pollution_7123133.jpg?20251231180004",
        "type": "Home",
        "Author": "Neville Lazarus",
        "Date Published": "2025-12-31 16:10:00",
        "Headline": "It's killed more people in India than terror attacks, riots, epidemics and natural disasters combined. But there's no escaping the air itself - and demands for more stringent intervention from the government are falling on deaf ears.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n \"The air is absolutely poison, in the last two years we've not had even one single good a day in spite of the monsoon rain,\" says Bhavreen Kandhari, an activist spearheading a public movement on clean air. Hundreds have converged to raise their voice against air pollution at Jantar Matar, a stone's throw away from the Indian parliament where the winter session is taking place. \"As a citizen and a mother we've done every possible thing to highlight our concerns,\" says Ms Kandhari. \"We really believed that this time the parliament session will begin with something on air pollution, but unfortunately that didn't happen.\" A silent killer Delhi is the world's most polluted capital, with vehicle emissions, farm fires, pollution from industry, power plants, waste, construction and household energy the main causes for this poisonous air. A lethal cocktail of carbon monoxide, nitrogen dioxide and other harmful gases - combined with tiny inhalable particles known as particulate matter - blankets the capital and its surroundings. PM2.5 refers to particles less than 2.5 micrometers in diameter - 30 times smaller than human hair, meaning they can penetrate deep into the lungs and enter the blood stream. Doctors warn of severe respiratory, heart and reproductive problems, cognitive decline and a reduction in life expectancy. Since the cold set in here in India's capital, almost every day the air quality index has been rated very poor, severe, or hazardous, which is many times over the World Health Organization recommended safe levels. The Global Environment Outlook-7 report released by the UN Environment Programme (UNEP) this month warned that 99% of the world's population is exposed to some form of air pollution - and more than 90% of pollution-related deaths occur in low and middle-income countries. According to a 2022 report by medical journal The Lancet, air pollution caused by fossil fuels has claimed 1.72 million lives in India. That's more than the combined deaths of terror attacks, riots, epidemics and natural disasters. Air pollution is no longer just Delhi's problem as it is affecting the whole of the Indo-Gangetic plain, with hundreds of millions of people breathing toxic air. According to the Centre for Research on Energy and Clean Air, 150 cities of the 256 cities monitored in 2025 exceeded nationally recommended PM2.5 levels. For years governments have ignored this issue in India's capital, their measures temporary and miserably inadequate, banning polluting vehicles and stopping construction when the air quality index reaches certain levels. Trucks with water sprinklers are seen moving around Delhi's 18,000-mile road network trying to suppress matter in the air. The government has also been accused of inconsistent record collection and manipulating data, and spraying water at monitoring stations to influence the readings. Farm fires - a centuries-old practice by farmers of burning crop stubble to clear land for the next sowing cycle - have been one of the primary reasons for air pollution. The Supreme Court of India banned this practice, even imposing fines and ordering the arrest of violators. Lighting the stubble on his field, Ram Singh, a farmer from Haryana, says: \"It's up to the government to arrest us, they can put us in jail.\" \"We will eat in jail,\" he adds. Our families barely survive on these crops. Nothing is left from it, we do not cause air pollution, it's all the rich industries that do it, and we get the blame.\" As most of India is associated with agriculture, the government dares not upset the farming community. 'Not possible' to escape dangerous air But that's no help to Alok Ranjan, a GP at the MMG District Hospital in Ghaziabad. On average, he sees over 300 patients during winter. He says most come with breathing problems and the numbers increase by 50% due to pollution and the cold. \"Air pollutants have many elements that are carcinogenic, like lead, mercury, cadmium, that can cause cancer - these are toxic and harmful for our bodies and metabolism,\" he says, a queue of patients snaking into the hospital corridor. \"Air pollution has an effect on all organs of our body. Our life expectancy has reduced while morbidity increased. All I can say is stay away from bad air, but that's not possible.\" Doctors, health workers and activists have called it slow poison, a silent genocide that is killing millions. Their urgent pleas for action from government and a parliament that sits just about a mile away are, for now, falling on deaf ears."
    },
    {
        "title": "Sir Keir Starmer promises that 'change' will finally arrive in 2026 in New Year's message",
        "description": "Sir Keir Starmer is promising that the change he pledged to deliver in the 2024 election will finally arrive in 2026.",
        "url": "https://news.sky.com/story/sir-keir-starmer-promises-that-change-will-finally-arrive-in-2026-in-new-years-message-13489041",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-manifesto-keir-starmer_6580510.jpg?20251231132102",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 12:48:00",
        "Headline": "The prime minister promised change in his 2024 manifesto, but conceded it has not been an \"overnight job\". Sir Keir Starmer has fought off rumours of leadership challenges and falling popularity ratings.",
        "Content": "Sir Keir Starmer is promising that the change he pledged to deliver in the 2024 election will finally arrive in 2026. In his New Year's address, the prime minister accepted that his government had not yet delivered on the promise plastered on the front of their manifesto. Sir Keir admitted that \"for many, life is still harder than it should be\" and they had been left without the money for a \"meal out\" or \"a holiday\" or a \"chance to make a special family moment extra special\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 The prime minister, whose popularity has plummeted and faces rumours of leadership challenges, said 2026 will be the year things change. \"In 2026, the choices we've made will mean more people will begin to feel positive change in your bills, your communities and your health service,\" he said. \"But even more people will feel once again a sense of hope, a belief that things can and will get better, feel that the promise of renewal can become a reality, and my government will make it that reality. \"More police on the streets by March. \"Energy bills down and the number of new health hubs up in April. \"More funding for local communities. \"And with that change, decline will be reversed.\" The prime minister positioned his government as being one to \"reverse a decade of decline\" under the Conservatives. But he confirmed a renewal was \"not an overnight job\" and the \"challenges we face were decades in the making\". Read more:Half of voters think Starmer will be replaced in 2026Which PM history had the worst Christmas Day in history? As well as political jeopardy, Sir Keir also had to face the sluggish economic growth in the UK and worldwide, alongside an unstable international picture on several fronts. He, however, vowed to get Britain \"back on track\". Elsewhere, Conservative leader Kemi Badenoch attempted humour in her New Year's message. She said: \"There is a lot to look forward to this year. No, not Labour's tax rises! \"But a Winter Olympics, a World Cup, and for political geeks, local elections!\" Ms Badenoch then lamented factors like low economic growth, higher taxes and unemployment figures in 2025, adding it was \"difficult for many people\". She added her party was working on a \"Get Britain Working again\" plan centred on supporting businesses. Liberal Democrat leader Sir Ed Davey, meanwhile, celebrated his party's performance in the local elections back in May, and looked forward to a successful performance in this year's round of council and assembly votes. \"We can win again in 2026 - in Scotland, Wales and across England,\" he said. \"To stop Trump's America becoming Farage's Britain. And change our country for the better.\""
    },
    {
        "title": "Snowfall expected across large parts of UK as new weather warnings issued",
        "description": "Snow is expected to fall across much of the UK in a chilly start to 2026, forecasters have said.",
        "url": "https://news.sky.com/story/snowfall-expected-across-much-of-uk-as-new-warnings-issued-13489006",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-weather-new-years-eve_7122922.jpg?20251231110129",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 10:45:00",
        "Headline": "The cold snap is expected to have an impact on transport, with those heading out urged to prepare for longer journey times by road, bus and train.",
        "Content": "Snow is expected to fall across much of the UK in a chilly start to 2026, forecasters have said. The Met Office has issued a yellow weather warning for snow and ice across large parts of England and Wales between midnight and noon on 2 January. It could see some areas blanketed in snow up to 5cm deep, especially on higher ground in parts of North Wales and northwest England. Separate yellow warnings are also in place for Northern Ireland between midnight and 10am on Friday, and in northern Scotland between 6am on New Year's Day and the end of Friday. The Met Office said those north of the border could see 10cm-20cm of snowfall, with 30cm possible on the highest routes and hills. Given the strength of the wind, some significant drifting of snow is said to be \"likely\" and lightning \"may well be an additional hazard\". The cold snap is expected to have an impact on transport, with those heading out urged to prepare for longer journey times by road, bus and train. The Met Office has additionally warned of injuries due to slips and falls on icy surfaces, which will develop quickly as sleet and snow clears. The national meteorological service said: \"If you need to make a journey on foot, try to use pavements along main roads which are likely to be less slippery. \"Similarly, if cycling, try and stick to main roads which are more likely to have been treated.\" The new snow and ice warning is in place for a large part of England and Wales, including Chester and Greater Manchester down to London and Kent. It affects the East Midlands, east of England, London and southeast England, northwest England, southwest England, Wales, and the West Midlands. Read more from Sky News:2025 on track to be 'UK's warmest year on record' The UK Health Security Agency (UKHSA) has also issued more severe warnings for the start of 2026. It had previously issued amber cold health alerts in the northeast and northwest of England. However, yellow alerts have been upgraded to amber across the East Midlands, West Midlands, southeast, southwest, east of England, Yorkshire and the Humber, and London. These warnings will be in place until 10am on 6 January. The UKHSA said it means the weather is \"likely\" to cause significant impacts across health and social care services, including a \"rise in deaths\" among those with health conditions or aged 65 or over. Dr Paul Coleman, consultant in health protection at UKHSA, said the weather is forecast to be \"very cold\" over the coming few days. He added: \"Low temperatures like these can have serious impacts on the health of some people, particularly older people and those with serious health conditions. \"Exposure to cold can lead to increased risk of heart attacks, strokes, and chest infections. \"It is therefore really important, as the colder weather sets in, to check in on friends, family, and neighbours that are most vulnerable.\""
    },
    {
        "title": "Queen was 'so angry' and 'fought back' after being assaulted on train as teenager",
        "description": "The Queen has spoken publicly for the first time about being assaulted on a train as a teenager, in an incident that left her \"so angry\".  ",
        "url": "https://news.sky.com/story/queen-was-so-angry-and-fought-back-after-being-assaulted-on-train-as-teenager-13488993",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-queen-camilla-queen_7122888.jpg?20251231091815",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 09:11:00",
        "Headline": "The Queen spoke about the assault after the topic of domestic abuse arose following the murders of Louise, Hannah and Carol Hunt by Louise's ex-partner in 2024.",
        "Content": "The Queen has spoken publicly for the first time about being assaulted on a train as a teenager, in an incident that left her \"so angry\".   In an interview with BBC Radio 4's Today programme, she described how she \"fought back\" and that the experience had \"lurked for many years\". She said: \"Somebody I didn't know - I was reading my book and this boy, man, attacked me, and I did fight back. \"And I remember getting off the train and my mother looking at me and saying, 'why is your hair standing on end?' and 'why is a button missing from your coat?' \"But I remember anger, and I was so furious about it, and it's sort of lurked for many years. \"And I think, you know, when all the subject about domestic abuse came up, and suddenly you hear a story like John and Amy's, it's something that I feel very strongly about.\" The Queen also used the interview to praise BBC racing commentator John Hunt and his daughter Amy, whose family were murdered at their home last year - and said they would be \"so proud of you both\". \n                  Sculptor Martin Jennings chosen to create statue for national memorial to Queen Elizabeth II\n                 \n                  Donald Trump historic state visit - first day in pictures\n                 \n                  Who is Tyler Robinson, Charlie Kirk’s suspected assassin?\n                 Louise Hunt, 25, her sister Hannah, 28, and their mother Carol, 61, were killed by Louise's ex-partner Kyle Clifford, 27, in a quiet cul-de-sac in Bushey, Hertfordshire, on 9 July 2024. Clifford, Louise's ex-partner, was handed three whole life orders earlier this year. After hearing the Queen share her story, Amy said: \"Thank you for sharing that story first, Your Majesty, because that takes a lot to share these things because every woman has a story.\" A fundraising gala was held this month to launch The Hunt Family Fund. Mr Hunt and Amy set it up in memory of their loved ones to raise money for charities and causes that help and inspire young women. In the recording, the Queen said: \"I'd just like to say, wherever your family is now, they'd be so proud of you both. \"And they must be from above smiling down on you and thinking, my goodness me, what a wonderful, wonderful father, husband, sister. \"They'd just be so proud of you both.\" The discussion, which was recorded in the Garden Room at Clarence House last month, also included former prime minister Baroness Theresa May and was chaired by BBC broadcaster Emma Barnett. Mr Hunt said a year on after his family was killed it \"remains really difficult on a minute-by-minute basis\", adding \"but you have to try and find the strength in our position to arm yourself with as many tools as possible that are going to help you get through that next hour, get through that next day\". He added: \"At the risk of embarrassing Amy, she's been my best counsel from the word go. \"We talk all the time. I used to say 'I couldn't do it without you', but now I say 'I can do it with you'.\" Amy said: \"I think there's a huge part of us that's still in disbelief, in shock. Perhaps we'll be in that state for the rest of our lives, given the magnitude of our loss. \"We miss them every single minute of the day.\" Read more from Sky News:Specialist teams to tackle violence against women and girls'Soaring rise' in strangulation and suffocation charges The Queen's incident was first recounted in the book Power And The Palace: The Inside Story Of The Monarchy And 10 Downing Street by Valentine Low, a former royal reporter for The Times newspaper. In the book, the Queen was said to have told then mayor of London Boris Johnson in 2008 about the historical attack and reportedly stated: \"I did what my mother taught me to. I took off my shoe and whacked him in the nuts with the heel.\" The man was said to have been arrested after she sought help at Paddington station. Queen 'wants to remove stigma and shame' The conversation between the Queen and Mr Johnson was revealed to author Mr Low by the ex-mayor's former communications director, Guto Harri. Speaking to Sky News on Wednesday, Mr Low said he believes the Queen is telling her story in a bid to \"remove some of the stigma that might attach to people who have been the victims of similar assaults\". He said: \"It means that they can tell their story, not publicly obviously in the way that the Queen has done, but to someone who might help, someone in authority.\" Mr Low added: \"I think she wants to remove the stigma and the shame, so that people can talk about it and people can do something about it.\" The Queen has visited rape centres in the UK and abroad, hosted receptions for sexual assault and domestic abuse survivors, and has regularly spoken out on the issue. Mr Low said the Queen has been campaigning \"for at least a decade\", but while her own experience has \"informed her approach\", it's instead the stories from other survivors that have \"fuelled her anger\". The author agreed that the Queen's story \"speaks to the modern monarchy\" that we are now seeing played out. He said: \"Very much so. I mean, one can't imagine the late Queen, who broke all sorts of barriers herself, but she would never have spoken in these terms.\" Mr Low said the modern monarchy is \"much more personal\", with the royals prepared to talk about what goes on in their own lives. He added: \"You just have to see the way the King was prepared to reveal the details of his cancer diagnosis and the fact that he's undergoing treatment and how he's felt about all that. \"That's really significant. His mother would never have done anything like that.\""
    },
    {
        "title": "Iranian protesters attempt to break in to government building",
        "description": "Iranian protesters attempted to storm a local government building on Wednesday, state media reported, as demonstrations over the cost of living reached their fourth day. ",
        "url": "https://news.sky.com/story/iranian-protesters-attempt-to-break-in-to-government-building-13489061",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tehran-iran_7123070.jpg?20251231152032",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 14:38:00",
        "Headline": "The protests over a plummeting currency and spiralling inflation are Iran's biggest since 2022, reaching their fourth day on 31 December.",
        "Content": "Iranian protesters attempted to storm a local government building on Wednesday, state media reported, as demonstrations over the cost of living reached their fourth day.  In an unusual response to unrest, the Iranian government on Tuesday offered to set up a dialogue with protest leaders. The first major protests since before June - when US airstrikes prompted an outpouring of patriotism - began on Sunday. Shopkeepers and traders in the capital, Tehran, angry about spiralling inflation and the Iranian currency plunging to a record low against the dollar, took to the streets on Sunday, and have since been joined by students. On Wednesday they attempted to break in to the local governor's office in the southern Fars province, state media confirmed. \"A few hours ​ago an organised group tried to get into the governorate building in the city of Fasa, their attack failed with the intervention ‍of security forces,\" state media said. \"The leader of these rioters, a 28-year-old woman, was arrested\". \n                  Iranian university students join protests over soaring cost of living\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 \n                  Major city may have to evacuate as water supplies run low\n                 Iran's Tasnim news agency cited a local official as saying four \"attackers\" had been detained and three members of the security forces ‌had been wounded during the clash. The governor of Fasa told state media that \"the protests were caused by inflation and economic conditions. Individualsinfluenced by hostile channels and media participated in them... the situation is back to normal\". Whereas Iranian authorities have responded to previous protests with fierce security measures and arrests, in this instance it offered to set up a \"dialogue mechanism\" - though the details have not been confirmed. Monday's protests were the biggest since 2022, which were prompted by the death of 22-year-old Mahsa Jina Amini in police custody. She was arrested by the country's morality police for allegedly wearing her hijab improperly. The recent protests come after the rial lost nearly half its value ‍against the dollar in 2025, with inflation reaching 42.5% in December. On Monday, the governor of Iran's Central Bank, Mohammad Reza Farzin, resigned, replaced by former economics minister Abdolnasser Hemmati. Iran's embattled economy has been navigating US sanctions since 2018, designed to deter its nuclear programme, which it says is peaceful. These sanctions have hampered the economy and strained household budgets, the impact now exacerbated by the plummeting currency value and inflationary pressure which have pushed up the prices of food and other daily essentials."
    },
    {
        "title": "Finland police seize vessel suspected of damaging Baltic Sea cable",
        "description": "Finnish police have seized a cargo vessel suspected of damaging an undersea cable.",
        "url": "https://news.sky.com/story/finland-police-seize-vessel-suspected-of-damaging-baltic-sea-cable-13489056",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-finland-ilkka-koskimaki_7123043.jpg?20251231144658",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 14:13:00",
        "Headline": "Fourteen crew members of the Fitburg - said to be Russian, Georgian, Kazakh and Azerbaijani - are being held by authorities.",
        "Content": "Finnish police have seized a cargo vessel suspected of damaging an undersea cable. The Fitburg had departed from Russia and was en route to Israel when Finnish authorities detained the ship. It is suspected of causing damage to a telecoms cable running from Helsinki to Estonia's capital Tallinn belonging to Finnish telecoms group Elisa. \"Finnish authorities have taken control of the vessel as part of a joint operation,\" police said. Fourteen crew members - said to be Russian, Georgian, Kazakh and Azerbaijani - are being held by authorities. Eight NATO states border the Baltic Sea, which also borders Russia. They have been on high alert after a spate of power cable outages, telecoms links and gas pipelines that run along the relatively shallow seabed since Russia invaded Ukraine in 2022. \n                  Finnish PM apologises over 'slanted eyes' controversy after 'racist' post by Miss Finland\n                 \n                  Tampere: Four people stabbed near shopping centre in Finland\n                 \n                  Five killed after two helicopters collide in Finland\n                 NATO has boosted its presence in the Baltic with frigates, aircraft and naval drones in recent years. A spokesperson for the military alliance declined to comment on Wednesday's incident. The Fitburg sailed under the flag of St Vincent and the Grenadines, a police spokesperson said. The vessel was dragging its anchor in the sea, and was directed to Finnish territorial waters, the police and Finland's Border Guard stated. \"At this stage, the police are investigating the incident as aggravated criminal damage, attempted aggravated criminal damage, and aggravated interference with telecommunications,\" the police said. Read more from Sky News:Search for missing plane resumes 11 years after it disappearedWhy UK's undersea cables are vulnerable Estonia's justice ministry said a second telecoms cable connecting the country to Finland had also suffered an outage on Wednesday. It was not immediately clear if the cable, belonging to Sweden's Arelion, was running parallel to Elisa's. Finland's President Alexander Stubb said the situation was being monitored. Posting on X, he added: \"Finland is prepared for various security challenges and responds to them in the manner the situation requires.\" In December last year, Finland boarded the Russian-linked oil tanker Eagle S which investigators said had damaged a power cable and several telecoms links in the Baltic Sea by dragging its anchor. A Finnish court in October dismissed a criminal case against the Eagle S captain and other crew members, ruling prosecutors failed to prove intent and that any alleged negligence must be pursued by the ship's flag state or the crew's home countries."
    },
    {
        "title": "Trump issues warning as National Guard troops withdrawn from US cities",
        "description": "The US government is removing the National &#8288;Guard from Chicago, Los Angeles and &#8203;Portland, Donald Trump has announced.",
        "url": "https://news.sky.com/story/trump-issues-warning-as-national-guard-troops-withdrawn-from-us-cities-13489125",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-national-guard-california_7123223.jpg?20251231221242",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 21:03:00",
        "Headline": "The deployment of the National Guard has been a controversial calling card of the Trump administration throughout 2025 - and the president has indicated 2026 could see further such orders.",
        "Content": "The US government is removing the National ⁠Guard from Chicago, Los Angeles and ​Portland, Donald Trump has announced. But, in a New Year's Eve message on social media, the president also warned that federal forces would \"come back\" if crime rates increased. The National Guard is a reserve of US military troops, typically used for domestic emergencies such as major protests and natural disasters. But in 2025 it was deployed to many Democrat-controlled cities, which Mr Trump said was to crack down on crime and disorder. Democrats accuse his administration of overstepping its authority and exaggerating isolated episodes of violence. In his social media post on Wednesday, Mr Trump said: \"We are removing ‌the National Guard from Chicago, ​Los Angeles, and Portland in Oregon, despite the fact that ‍CRIME has been greatly reduced by having these great Patriots in those ‌cities, and ONLY by ⁠that fact.\" However, troops sent to Chicago and Portland were never out on the streets, their deployment held up by legal challenges. Efforts in Oregon were blocked by a federal judge and in Chicago by the Supreme Court. The latter was not a final ruling, but was a significant and unusual setback from the US's top court. Read more from Sky News:Starmer's 2026 New Year's messageQueen reveals anger over assault as teen Troops were utilised in Los Angeles earlier this year as part of a broader crackdown on crime and immigration, but had already been pulled back after a court ruling earlier this month. Legal roadblocks sprang up elsewhere in the country too, including in Washington DC, where District of Columbia Attorney General Brian Schwalb brought a court case to halt the deployments of more than 2,000 guardsmen. Trump: We'll be back Mr Trump added in his post: \"We will come ‍back, perhaps in a much different and stronger form, when crime begins to soar ​again - Only a question of time! \"It is hard to believe that these Democrat Mayors and Governors, all of whom are greatly incompetent, would want us to leave, especially considering the great progress that has been made???\""
    },
    {
        "title": "Murder charge after man, 34, killed when car hit pedestrians",
        "description": "A man has been charged with murder after a 34-year-old was killed when a car hit pedestrians in north west London on 3 December. ",
        "url": "https://news.sky.com/story/murder-charge-after-man-34-killed-when-car-hit-group-of-pedestrians-13489085",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ruben-nunes-metropolitan-police_7123114.jpg?20251231171733",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 16:50:00",
        "Headline": "Shakaine Dwyer was originally charged with causing death by dangerous driving but this has been updated to murder. ",
        "Content": "A man has been charged with murder after a 34-year-old was killed when a car hit pedestrians in north west London on 3 December.  Shakaine Dwyer, 29, has been charged with killing Ruben Nunes, from Peterborough, the Metropolitan Police said on New Year's Eve. Mr Dwyer, of Willesden, north west London, was originally charged with causing death by dangerous driving on 7 December and this was updated to murder on Monday, the force said. He will appear at Highbury Corner Magistrate's Court on 19 January. A second man has also been charged in connection with the investigation. Gregory Ejiofor, 31, of Milton Keynes, appeared in custody on 9 December, charged with possession of a firearm with intent to cause fear of violence. Earlier this month, the Met said a 32-year-old man was arrested on suspicion of assisting an offender and was released on bail. Police had been called to reports of a collision between a car and pedestrians on 3 December at Chapel Close, Willesden. Officers attended with the London Ambulance Service but Mr Nunes died at the scene. In a tribute, his family said: \"Ruben was a family man - a son, a brother, an uncle, a father and a partner. \"He was true to his friends and cherished the people around him. He loved football and was a big Liverpool fan. \"Ruben had a light within him - he brightened the lives of everyone he touched. He was deeply loved by all who knew him and he will always be remembered as a truly blessed soul.\""
    },
    {
        "title": "Search for Malaysia Airlines flight MH370 resumes 11 years after it went missing",
        "description": "The deep-sea search for missing Malaysia Airlines flight MH370 has begun - more than a decade after the jet vanished with 239 people on board. ",
        "url": "https://news.sky.com/story/search-for-malaysia-airlines-flight-mh370-resumes-11-years-after-it-went-missing-13489040",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-malaysia_7099394.jpg?20251203095223",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-31 09:42:00",
        "Headline": "The Malaysian government says a search vessel arrived at an undisclosed area in the Indian Ocean with two autonomous underwater vehicles.",
        "Content": "The deep-sea search for missing Malaysia Airlines flight MH370 has begun - more than a decade after the jet vanished with 239 people on board.  The Boeing 777 disappeared from radar shortly after departing Kuala Lumpur International Airport en route to Beijing on 8 March 2014. Satellite data showed the aircraft deviated from its flight path and headed south into the far-southern Indian Ocean, where investigators believe it crashed, with 227 passengers and 12 crew on board. A multinational search, spearheaded by Australia, failed to locate the jet, although possible debris was found along the coastline of East African and Indian Ocean islands. Malaysia's transport ministry announced earlier this month American marine robotics firm Ocean Infinity would embark on an intermittent 55-day search at the end of December. On Wednesday, the country's government said a search vessel, the Armada 86 05, arrived at a designated search area with two autonomous underwater vehicles. It said the vessel had prepared for the search at Fremantle Port in Western Australia, although the location of the search area has not been disclosed. \n                  Search for Malaysia Airlines flight MH370 to resume 11 years after it went missing\n                 \n                  Hunt for missing Malaysia Airlines Flight MH370 to resume 10 years after plane vanished\n                 \n                  Search for Malaysia Airlines flight MH370 to resume a decade after it vanished\n                 Read more from Sky News:Snowfall expected as weather warnings issuedQueen 'fought back' after being assaulted as a teenager The Malaysian government previously said it had approved a \"no-find, no-fee\" contract with Ocean Infinity, with the company to be paid $70m (£53m) only if wreckage is discovered. Ocean Infinity conducted an unsuccessful private search in 2018. Its chief executive, Oliver Plunkett, said last year the firm was working with multiple experts and had narrowed the search zone to what it believes is the most probable crash site. Earlier this year, Ocean Infinity briefly restarted seabed search operations in a new 5,800-square-mile area of the southern Indian Ocean, but the effort was suspended in April because of poor weather. The firm has confirmed it was resuming the search for MH370 but refused to comment further, citing the \"important and sensitive nature\" of the operation."
    },
    {
        "title": "Anthony Joshua pays respects to friends killed in road crash",
        "description": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends.",
        "url": "https://news.sky.com/story/anthony-joshua-discharged-from-hospital-after-fatal-road-crash-13489140",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anthony-joshua-boxer_7080597.jpg?20251112230721",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 23:15:00",
        "Headline": "The British-Nigerian boxing star is now recovering at his home in the country, according to a statement from the regional governments of Lagos and Ogun states.",
        "Content": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends. The British-Nigerian boxing star is now recovering at his home in the country, according to a statement from the regional governments of Lagos and Ogun states. Joshua was travelling in the back of a black SUV when it hit a stationary truck on a major road near Lagos on Monday, killing his friends Latif Ayodele and Sina Ghami. The 36-year-old two-time world champion and his mother paid their respects to them at a funeral home on Wednesday afternoon ahead of their repatriation to the UK, the statement added. \"Anthony Joshua was discharged from hospital late this afternoon though heavy hearted and full of emotions over the loss of his two close friends he was deemed fit (enough) to recuperate from home,\" the statement, posted on X, read. The post also expressed gratitude for the team of doctors and medical staff at the Lagoon Hospital Ikoyi \"that attended to Anthony and those that sustained injuries. \"The quality of care and professionalism is truly commendable.\" Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria following his win over Jake Paul in Miami on 19 December. He survived with minor injuries, police have said. Joshua's spokesperson said in a statement Mr Ghami and Mr Ayodele \"were close friends and integral members of Anthony's team\". How did the crash happen? The crash happened on the Lagos-Ibadan Expressway near Sagamu, at about midday local time (11am UK time), according to the Nigerian federal road safety corps (FRSC). The FRSC said preliminary findings indicated the Lexus was \"suspected to be travelling beyond the legally prescribed limit\" and \"lost control\" while overtaking before crashing into the truck, which was parked by the side of the road. \"The primary causes of the crash being excessive speed and wrongful overtaking constitute serious traffic violations and remain among the leading causes of fatal road crashes on Nigerian highways,\" the corps said on X. 'Traumatised situation' On Wednesday, a close friend of Joshua told Sky News the boxer would be in a \"traumatised situation\" from seeing another friend die in a car crash, who was more like a \"twin brother\" to him. Kolawole Omoboriowo, who has known Joshua for eight years, was the one to break the news to the athlete's family about the accident. Mr Omoboriowo, who coordinates Joshua's logistics in Nigeria, said the boxer's family were \"like my other family in the UK\". The time since has been a \"crazy nightmare for everyone\", he said. He also said Mr Ayodele, one of the two people killed in the accident, was \"more than a friend\" to Joshua and more like a \"twin brother\"."
    },
    {
        "title": "Snowfall expected across large parts of UK as new weather warnings issued",
        "description": "Snow is expected to fall across much of the UK in a chilly start to 2026, forecasters have said.",
        "url": "https://news.sky.com/story/snowfall-expected-across-much-of-uk-as-new-warnings-issued-13489006",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-weather-new-years-eve_7122922.jpg?20251231110129",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 10:45:00",
        "Headline": "The cold snap is expected to have an impact on transport, with those heading out urged to prepare for longer journey times by road, bus and train.",
        "Content": "Snow is expected to fall across much of the UK in a chilly start to 2026, forecasters have said. The Met Office has issued a yellow weather warning for snow and ice across large parts of England and Wales between midnight and noon on 2 January. It could see some areas blanketed in snow up to 5cm deep, especially on higher ground in parts of North Wales and northwest England. Separate yellow warnings are also in place for Northern Ireland between midnight and 10am on Friday, and in northern Scotland between 6am on New Year's Day and the end of Friday. The Met Office said those north of the border could see 10cm-20cm of snowfall, with 30cm possible on the highest routes and hills. Given the strength of the wind, some significant drifting of snow is said to be \"likely\" and lightning \"may well be an additional hazard\". The cold snap is expected to have an impact on transport, with those heading out urged to prepare for longer journey times by road, bus and train. The Met Office has additionally warned of injuries due to slips and falls on icy surfaces, which will develop quickly as sleet and snow clears. The national meteorological service said: \"If you need to make a journey on foot, try to use pavements along main roads which are likely to be less slippery. \"Similarly, if cycling, try and stick to main roads which are more likely to have been treated.\" The new snow and ice warning is in place for a large part of England and Wales, including Chester and Greater Manchester down to London and Kent. It affects the East Midlands, east of England, London and southeast England, northwest England, southwest England, Wales, and the West Midlands. Read more from Sky News:2025 on track to be 'UK's warmest year on record' The UK Health Security Agency (UKHSA) has also issued more severe warnings for the start of 2026. It had previously issued amber cold health alerts in the northeast and northwest of England. However, yellow alerts have been upgraded to amber across the East Midlands, West Midlands, southeast, southwest, east of England, Yorkshire and the Humber, and London. These warnings will be in place until 10am on 6 January. The UKHSA said it means the weather is \"likely\" to cause significant impacts across health and social care services, including a \"rise in deaths\" among those with health conditions or aged 65 or over. Dr Paul Coleman, consultant in health protection at UKHSA, said the weather is forecast to be \"very cold\" over the coming few days. He added: \"Low temperatures like these can have serious impacts on the health of some people, particularly older people and those with serious health conditions. \"Exposure to cold can lead to increased risk of heart attacks, strokes, and chest infections. \"It is therefore really important, as the colder weather sets in, to check in on friends, family, and neighbours that are most vulnerable.\""
    },
    {
        "title": "Murder charge after man, 34, killed when car hit pedestrians",
        "description": "A man has been charged with murder after a 34-year-old was killed when a car hit pedestrians in north west London on 3 December. ",
        "url": "https://news.sky.com/story/murder-charge-after-man-34-killed-when-car-hit-group-of-pedestrians-13489085",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ruben-nunes-metropolitan-police_7123114.jpg?20251231171733",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 16:50:00",
        "Headline": "Shakaine Dwyer was originally charged with causing death by dangerous driving but this has been updated to murder. ",
        "Content": "A man has been charged with murder after a 34-year-old was killed when a car hit pedestrians in north west London on 3 December.  Shakaine Dwyer, 29, has been charged with killing Ruben Nunes, from Peterborough, the Metropolitan Police said on New Year's Eve. Mr Dwyer, of Willesden, north west London, was originally charged with causing death by dangerous driving on 7 December and this was updated to murder on Monday, the force said. He will appear at Highbury Corner Magistrate's Court on 19 January. A second man has also been charged in connection with the investigation. Gregory Ejiofor, 31, of Milton Keynes, appeared in custody on 9 December, charged with possession of a firearm with intent to cause fear of violence. Earlier this month, the Met said a 32-year-old man was arrested on suspicion of assisting an offender and was released on bail. Police had been called to reports of a collision between a car and pedestrians on 3 December at Chapel Close, Willesden. Officers attended with the London Ambulance Service but Mr Nunes died at the scene. In a tribute, his family said: \"Ruben was a family man - a son, a brother, an uncle, a father and a partner. \"He was true to his friends and cherished the people around him. He loved football and was a big Liverpool fan. \"Ruben had a light within him - he brightened the lives of everyone he touched. He was deeply loved by all who knew him and he will always be remembered as a truly blessed soul.\""
    },
    {
        "title": "European court questions UK decision to revoke Shamima Begum's citizenship",
        "description": "A top European court has questioned the UK's revocation of the citizenship of Shamima Begum, after she left the country to join the so-called Islamic State (IS) as a teenage girl.",
        "url": "https://news.sky.com/story/european-court-questions-uk-decision-to-revoke-shamima-begums-citizenship-13489086",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-shamima-begum-citizenship_7123119.jpg?20251231172726",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 16:52:00",
        "Headline": "The European Court of Human Rights is pressing Britain over the responsibility the state has towards victims of trafficking",
        "Content": "A top European court has questioned the UK's revocation of the citizenship of Shamima Begum, after she left the country to join the so-called Islamic State (IS) as a teenage girl. The European Court of Human Rights is pressing Britain over the responsibility of the state towards victims of trafficking, before it revoked her British citizenship. The then 15-year-old schoolgirl from Bethnal Green, east London, travelled to territory held by IS 10 years ago. Shamima Begum was then \"married off\" to an IS fighter and eventually stripped of her British citizenship in 2019, as the government said she posed a threat to national security. Ms Begum remains in a Syrian camp, where her baby son died in 2019 before the citizenship decision. A document published by the European court earlier this month states Ms Begum is challenging the decision under Article 4 of the European Convention on Human Rights, which prohibits slavery and forced labour. The case was lodged in December last year, after she had been denied the chance to challenge the removal of her British citizenship at the UK's Supreme Court. \n                  Counterterrorism review calls for Shamima Begum and other British-linked people in Syria to be repatriated\n                 \n                  Shamima Begum loses final bid to appeal citizenship decision at Supreme Court\n                 \n                  'We're humans not animals': Dozens of ex-IS brides and their children desperate to go home\n                 'Child lured for sexual exploitation' Among four questions posed by judges in Strasbourg to the Home Office, the court asked: \"Did the Secretary of State have a positive obligation, by virtue of Article 4 of the Convention, to consider whether the applicant had been a victim of trafficking, and whether any duties or obligations to her flowed from that fact, before deciding to deprive her of her citizenship?\" Birnberg Peirce Solicitors, which is representing Ms Begum, said the court's communication presents an \"unprecedented opportunity\" for the UK and Ms Begum to \"grapple with the significant considerations raised in her case and ignored, sidestepped or violated up to now by previous UK administrations\". Lawyer Gareth Peirce said it is \"impossible to dispute that a 15-year-old British child\" was \"lured, encouraged and deceived for the purposes of sexual exploitation to leave home and travel to IS-controlled territory for the known purpose of being given, as a child, to an IS fighter to propagate children for the Islamic State\". She added: \"It is equally impossible not to acknowledge the catalogue of failures to protect a child known for weeks beforehand to be at high risk when a close friend had disappeared to Syria in an identical way and via an identical route. \"It has already been long conceded that the then home secretary, Sajid Javid, who took the precipitous decision in 2019 very publicly to deprive Ms Begum of citizenship, had failed entirely to consider the issues of grooming and trafficking of a school child in London and of the state's consequent duties.\" Ms Peirce, who also represented the Guildford Four and the Birmingham Six and the family of Jean Charles de Menezes, added that the government has recently made the protection of victims of grooming and trafficking a national priority. Review called UK an 'outlier' In November, a counterterrorism review called for Shamima Begum and other British-linked people in Syria to be repatriated, calling the UK an \"outlier\" in its policy towards such citizens. But the Home Office, responding to the correspondence from the European court, said any decision made to protect national security would be robustly defended. \"The Government will always protect the UK and its citizens,\" a spokesperson said. \"That is why Shamima Begum - who posed a national security threat - had her British citizenship revoked and is unable to return to the UK. \"We will robustly defend any decision made to protect our national security.\" The Conservatives said Ms Begum should not be allowed back into the UK \"under any circumstances\". Shadow home secretary Chris Philp said: \"Begum chose to go and support the violent Islamist extremists of Daesh, who murdered opponents, raped thousands of women and girls and threw people off buildings for being gay.\""
    },
    {
        "title": "Man stabbed to death in southeast London on New Year's Eve",
        "description": "A 23-year-old man has been stabbed to death in southeast London on New Year's Eve.",
        "url": "https://news.sky.com/story/man-stabbed-to-death-in-southeast-london-on-new-years-eve-13489120",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-grove-st-lewisham-london_7123224.jpg?20251231221552",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 19:46:00",
        "Headline": "Scotland Yard said that there have been no arrests after the fatal stabbing in the Lewisham area",
        "Content": "A 23-year-old man has been stabbed to death in southeast London on New Year's Eve. The Metropolitan Police has launched a murder inquiry after officers were called to the scene in Grove Street, near Rotherhithe, in Lewisham borough, at roughly 12.35pm on Wednesday, and found the man had been stabbed in the chest. The London Ambulance Service and London's Air Ambulance also attended but the man was pronounced dead at the scene. No arrests have been made but inquiries are ongoing. The victim's family has been informed and is being supported by specialist officers. Detective chief inspector Sam Townsend, who is leading the investigation, said: \"Our thoughts and deepest sympathies are with the victim's family and friends during this incredibly difficult time. \"Our investigation is progressing swiftly as we work to establish the full circumstances surrounding this tragic incident. \"We understand that this will understandably cause concern within the local community. Please be assured that we have increased patrols in the area, and this investigation remains our highest priority.\" A crime scene remains in place."
    },
    {
        "title": "Nutrition key in new alcohol abuse rehabilitation scheme to fight addiction",
        "description": "Researchers at the University of Bournemouth have partnered with a drug charity to launch an alcohol abuse rehabilitation scheme that emphasises the importance of healthy food in recovery.",
        "url": "https://news.sky.com/story/nutrition-key-in-new-alcohol-abuse-rehabilitation-scheme-to-fight-addiction-13484477",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-whitehead-rehab-foodclub_7112308.jpg?20251216172214",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2025-12-31 03:45:00",
        "Headline": "Addicts found eating nutritious food helped them beat their addiction, with one person in the programme saying: \"I've lost a lot of weight, my skin feels better, my hair feels better\".",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n Researchers at the University of Bournemouth have partnered with a drug charity to launch an alcohol abuse rehabilitation scheme that emphasises the importance of healthy food in recovery. The project - Nourish the New You - looks at the science behind how better nutrition can prevent relapses during withdrawal and is the brainchild of Dr Chloe Casey. \"I became really interested in the role of nutrition in recovery when I lost my mother-in-law to alcohol,\" she said. \"As a nutritionist, I started watching the way her appetite fluctuated when she was drinking and not drinking, and became really interested in how alcohol can affect nutritional status. \"It has some really negative impacts on nutrient absorption and appetite, especially.\" The university is working with drug and alcohol charity We Are With You and the Friendly Food Club to deliver the cooking courses. Mum Katherine Johnson has been sober for more than 18 months, in part thanks to her involvement in learning to cook healthy food. \"I started using alcohol as a coping mechanism to ease my anxiety and my depression,\" she said. \"It went from drinking a couple of times a week to drinking every day, then before I knew it, my body became dependent on it. \"If I didn't drink, I would have shakes, I would feel sick, and have heart palpitations. Then, unfortunately, my health deteriorated quite badly, and I ended up in hospital. My family found out, and then I started getting help.\" She told Sky News the club has made a notable difference: \"First of all, I'm actually eating properly, and it means my family is eating properly as well. Healthy food is so much more enjoyable. \"I've lost a lot of weight, my skin feels better, my hair feels better, and my daughter is really getting into the cooking as well, which is nice.\" 'Eating is not on the agenda' The hope is to secure permanent funding to integrate the course fully alongside more conventional rehabilitation methods. \"Once we can get this going and piloted in some areas, then we can try to collect that data and evidence the impact,\" said Dr Casey. The project echoes numerous studies that show a healthy diet can improve recovery from alcohol abuse. Paula Loader, from the drugs charity We Are With You, said healthy food is not a priority for those facing addiction issues. \"Most of the time, when people are in the midst of substance misuse, eating is not on the agenda. It's something you don't think about… because your drink is more important,\" she said. \"By bringing in this initiative of eating healthily has been great as it's bringing people around the table.\" Dave Palfrey - who was addicted to alcohol and heroin for years - said the food club has had a huge impact. He said: \"I've been sober for 17 months, and it's all down to coming here… it's saving my life. It means I eat healthy for a start. \"When I was drinking, a microwave beef burger would be that day's food. \"I've never had friends before. I've had work colleagues, drinking buddies and drug dealers - this is the first time that I've had what I can call friends.\""
    },
    {
        "title": "Woman charged with murder after Christmas Day death",
        "description": "A woman has been charged with murder after the death of another woman on Christmas Day.",
        "url": "https://news.sky.com/story/woman-charged-with-murder-after-christmas-day-death-13488974",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-devizes-wiltshire-murder_7119216.jpg?20251225192848",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 07:59:00",
        "Headline": "Stefania Glowka, 63, is remanded in custody over the death of Tamara Glowka, who was in her 80s, at a flat in Devizes, Wiltshire. ",
        "Content": "A woman has been charged with murder after the death of another woman on Christmas Day. Stefania Glowka, 63, appeared at Swindon Magistrates' Court on Tuesday accused of killing Tamara Glowka, who was in her 80s inside a flat in Devizes, Wiltshire. The Polish national was remanded in custody ahead of a hearing at Bristol Crown Court, where she did not appear. She will be held in custody until she is next due to appear in court in March 2026. Police said officers were called to reports of an assault on Christmas morning at a flat in Keepers Road. Police said the victim, who is yet to be formally identified, was known to Stefania Glowka. She was declared dead at the scene. A statement said: \"A preliminary post-mortem has been carried out, but further information is needed to establish the cause of death.\""
    },
    {
        "title": "More than £250k raised for police officer who lost family in Stroud Boxing Day fire",
        "description": "More than &#163;250,000 has been raised for a police officer who lost his wife and two children in a Boxing Day house fire.",
        "url": "https://news.sky.com/story/more-than-163250k-raised-for-police-officer-who-lost-family-in-stroud-boxing-day-fire-13488964",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-shearman-fionnghuala_7122323.png?20251230172951",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 06:41:00",
        "Headline": "Tom Shearman tried to save his wife and two children but was beaten back by the severity of the blaze. ",
        "Content": "More than £250,000 has been raised for a police officer who lost his wife and two children in a Boxing Day house fire. An online fundraising appeal was launched after Fionnghuala Shearman, known as Nu, died alongside her daughter Eve, seven, and four-year-old son Ohner in the blaze at their home in Brimscombe, near Stroud, Gloucestershire. Police said Gloucestershire Constabulary officer Tom Shearman tried to save his family by smashing his way out through the bathroom window but was unable to get back inside because of the severity of the fire. He was taken to hospital, but has since been discharged. More than 12,400 people had made donations to the GoFundMe appeal, raising more than £257,000 by Wednesday morning, with a fresh target of £350,000 after passing its original goal of £110,000. Emergency services were called to the family's mid-terrace Cotswold stone cottage on Brimscombe Hill at about 3am on Boxing Day. Mr and Mrs Shearman, who ran a bespoke handbag manufacturer, had been awoken by the fire and tried to reach their children in the rear bedroom. \n                  Bodies recovered in Boxing Day fire as online fundraising appeal is launched for father\n                 \n                  Ex-England footballer Stuart Pearce's son Harley dies in tractor crash\n                 \n                  Farming community responds to rumours of an inheritance tax U-turn\n                 Police believe the fire started on the ground floor and investigations are ongoing to establish the cause, but it is not being treated as suspicious. The fire destroyed the roof, the ceilings and stairs, as well as causing other significant internal damage. Temporary chief constable Maggie Blyth said the bodies of the two children, and the family dog had now been recovered from the property, while Mrs Shearman's body had been recovered earlier."
    },
    {
        "title": "Anthony Joshua's friend describes 'crazy nightmare' after Nigeria car crash",
        "description": "A close friend of Anthony Joshua has said the boxer would be in a \"traumatised situation\" from seeing another friend die in a car crash, who was more like a \"twin brother\" to him. ",
        "url": "https://news.sky.com/story/anthony-joshuas-friend-describes-crazy-nightmare-after-nigeria-car-crash-13489099",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-kolawole-omoboriowo_7123180.jpg?20251231192456",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-31 17:53:00",
        "Headline": "Kolawole Omoboriowo said \"everybody is worried\" about how former heavyweight champion Anthony Joshua will recover from seeing two friends die in the crash on Monday.",
        "Content": "A close friend of Anthony Joshua has said the boxer would be in a \"traumatised situation\" from seeing another friend die in a car crash, who was more like a \"twin brother\" to him.  Kolawole Omoboriowo, who has known the two-time world heavyweight champion for eight years, was the one to break the news to Joshua's family about the accident. Joshua, the 36-year-old British-Nigerian boxer, was travelling in the back of a black SUV when it hit a stationary truck on major road near Lagos in Nigeria, killing two of his friends. Mr Omoboriowo, who coordinates Joshua's logistics in Nigeria, said the boxer's family were \"like my other family in the UK\". The time since has been a \"crazy nightmare for everyone\", he told Sky News on Wednesday. When he got the news, Mr Omoboriowo instantly called Joshua's mother, who is \"like a mum to me\", he said. But she did not pick up, so he then got through to a cousin, who herself called someone at the scene of the crash who confirmed what had happened. \"Everyone started panicking… and we started looking around, [wondering] 'Who can we call? How do we know where they are?'\". Friend was 'like a twin brother' He said Latif Ayodele, one of the two people killed in the accident, was \"more than a friend\" to Joshua and more like a \"twin brother\". \"That is somebody you see him with every single time, that is his best friend, that is who he loves, he talks to, he takes advice from.\" A second close friend, Sina Ghami, was also killed in the collision. \"What is actually in my head now is: 'How do we get AJ out of that traumatised situation?'. And that is just the only thing that everybody is worried about right now.\" Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria following his win over Jake Paul in Miami on 19 December. He survived with minor injuries, police have said, and is currently recovering in hospital. Joshua is a 'wonderful person around everyone' Speaking to Sky News, Mr Omoboriowo said: \"Right now, everybody might think AJ is okay\". But, as the boxer has lost a close friend, \"we don't know how he's gonna take it.\" \"But right now we just want everybody to actually like give him a moment to actually relax, rest, and we pick it up from there.\" He added: \"We just need to keep praying for AJ, for God to give him the strength to be able to carry on with these losses.\" He described his friend Joshua as \"a very wonderful person around everyone\" who is \"not that kind of person that really cares about the income, money or anything\". Another friend of Joshua's and his barber, Gbadia Figbeghawei, said he wished to God \"don't let this be true\" when he first heard the news."
    },
    {
        "title": "How an anti-knife crime project 'saved' a young man's life",
        "description": "Corrie was just 13 when someone first pulled out a knife on him.",
        "url": "https://news.sky.com/story/how-an-anti-knife-crime-project-saved-a-young-mans-life-13488927",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-corey-knife-crime_7122755.png?20251230233348",
        "type": "UK",
        "Author": "Rachael Venables",
        "Date Published": "2025-12-31 02:30:00",
        "Headline": "Redthread is a charity funded by London's 'Violence Reduction Unit' (VRU) to embed youth workers in London's A&Es and Major Trauma Centres.",
        "Content": "\n          News correspondent\n              @rachaelvenables\n Corrie was just 13 when someone first pulled out a knife on him. Now, he says, \"even the sound of cutlery gets me\". \"So if we're in a kitchen and there's cutlery shaking, my eyes are alert and I'm not cooling down. That's the PTSD I still hold today,\" he adds. After a difficult childhood, alcohol dependency, and two years of being homeless, he says his life was saved when he met youth worker Bradley Stephenson at King's College Hospital. Bradley works for Redthread, a charity funded by London's 'Violence Reduction Unit' (VRU), to embed youth workers in London's A&Es and Major Trauma Centres. It is a project designed to support young people who have been the victims of violence or knife crime. Corrie had actually been admitted for mental health issues, and the call came in right at the end of Bradley's shift. But that night, he agreed to meet the young man anyway. \n                  Aria Thorpe: Images released of girl, 9, stabbed to death - as boy appears in court charged with murder\n                 \n                  Man detained indefinitely after 'furiously and repeatedly' stabbing 11-year-old girl\n                 \n                  'It does save people's lives': Bleed kits rolled out across Sheffield schools after push from knife safety campaigners\n                 Bradley explains their programme is all about diverting from the path of crime and violence: \"Corrie didn't have money to find accommodation, so the only way he could make money would then be to commit crime. \"So my main support aim at first was finding him accommodation.\" Today, Corrie is a changed man who has turned his life around and is committed to helping others. \"There were times where I might not have been the victim of the knife crime,\" he explains, \"but I could have made someone else a victim of it - if they made me feel like I was in danger.\" This is why, Bradley explains, the Violence Reduction Unit's future funding of projects like his is so important in the fight against knife crime. The VRU was set up by the London mayor's office in 2019 to bring a 'public health' attitude to tackling violence. \"Homicides are down by a third since we were set up,\" the unit's director, Lib Peck, says, adding: \"There are 14,000 less incidents of violence with injury and we know there's been a 43% percent reduction in young people admitted to hospital as a result of knife assault.\" It sounds impressive, but as always, the true data is a little more complicated. Homicides in London are indeed at their lowest level than at any point since 2003, and the total number of knife crimes recorded has also been (recently) falling - but only after a huge surge. Knife crime offences are still more common now than they were two years ago. There has been a slight reduction in the number of under-25s being injured by knives, but the numbers still show up to 25 young people being stabbed or wounded every single week. And, while there's also been a reduction in the number of people hospitalised with knife wounds in London since 2018 - a year before the VRU formed - that actually fits the patterns of the national trend. To better understand the work the VRU has been doing, we visited a custody suite in Brixton. It's early in the day, but already a teenager has been arrested and is sitting in one of their cells waiting to be interviewed. But also waiting to talk to them is a youth worker, funded (as in hospitals) by the VRU. \"The whole aim is to kind of divert the pathway that they may be heading down,\" explains Ian Patnelli, a youth engagement coordinator at Lambeth Council. \"We would seek to meet with them while they're in custody, use that as a reachable, teachable moment, and support them with areas that they may share with us on the day or that we might assess from information that we have once they're released.\" So far, youth workers like Ian have reached 10,000 young people in these cells - offering help getting back into education, starting training or employment. And a recent study found that 80% of the under 18s the VRU had helped didn't go on to reoffend within the next year. But for Mark Rodney, who runs Project Lifeline in Croydon, the VRU fails to reach the most at-risk children. Their work is good, he tells me, but it doesn't deal with the real issues affecting the most dangerous, or endangered young people. \"These are children killing children,\" he stresses. His project moves young people who are the most engaged in violence out of their communities to somewhere safer. One recent example came after a local child was killed. \"In the middle of the vigil a young child spoke to me and said that he's 'gonna be next',\" Mark says. Knowing the child wouldn't want to engage with the authorities, Mark himself \"went to that child's house, spoke to his mother, packed him up, packed up his stuff, put it in my car, took him, and then relocated him with help from social services\". And if he hadn't done this, what could have happened? \"Why wouldn't he pick up a knife and protect himself?\" asks Mark. \"Why wouldn't he? It's a chain reaction and these children are stuck in a vicious circle with no exits.\" Read more from Sky News:Eurostar passengers brace for further disruptionAnthony Joshua 'couldn't talk' after crash, witness says Whatever the data shows, Lib Peck insists the VRU isn't complacent about the reality on the streets. \"We know that the number of people feeling safe doesn't correlate to the number of incidents reduced and we also know that for many people who've been affected by violence or indeed horrifically by murder, these are going to be of small comfort to them,\" she says. \"So there is a huge agenda for us to keep progressing. But it's you know, prevention is an important part of that package and I think the evidence that we've got today shows that.\""
    },
    {
        "title": "Why there's no escape from Delhi's biggest killer",
        "description": "\"The air is absolutely poison, in the last two years we've not had even one single good a day in spite of the monsoon rain,\" says Bhavreen Kandhari, an activist spearheading a public movement on clean air.",
        "url": "https://news.sky.com/story/why-theres-no-escape-from-delhis-biggest-killer-13489079",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-air-pollution_7123133.jpg?20251231180004",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-12-31 16:10:00",
        "Headline": "It's killed more people in India than terror attacks, riots, epidemics and natural disasters combined. But there's no escaping the air itself - and demands for more stringent intervention from the government are falling on deaf ears.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n \"The air is absolutely poison, in the last two years we've not had even one single good a day in spite of the monsoon rain,\" says Bhavreen Kandhari, an activist spearheading a public movement on clean air. Hundreds have converged to raise their voice against air pollution at Jantar Matar, a stone's throw away from the Indian parliament where the winter session is taking place. \"As a citizen and a mother we've done every possible thing to highlight our concerns,\" says Ms Kandhari. \"We really believed that this time the parliament session will begin with something on air pollution, but unfortunately that didn't happen.\" A silent killer Delhi is the world's most polluted capital, with vehicle emissions, farm fires, pollution from industry, power plants, waste, construction and household energy the main causes for this poisonous air. A lethal cocktail of carbon monoxide, nitrogen dioxide and other harmful gases - combined with tiny inhalable particles known as particulate matter - blankets the capital and its surroundings. PM2.5 refers to particles less than 2.5 micrometers in diameter - 30 times smaller than human hair, meaning they can penetrate deep into the lungs and enter the blood stream. Doctors warn of severe respiratory, heart and reproductive problems, cognitive decline and a reduction in life expectancy. Since the cold set in here in India's capital, almost every day the air quality index has been rated very poor, severe, or hazardous, which is many times over the World Health Organization recommended safe levels. The Global Environment Outlook-7 report released by the UN Environment Programme (UNEP) this month warned that 99% of the world's population is exposed to some form of air pollution - and more than 90% of pollution-related deaths occur in low and middle-income countries. According to a 2022 report by medical journal The Lancet, air pollution caused by fossil fuels has claimed 1.72 million lives in India. That's more than the combined deaths of terror attacks, riots, epidemics and natural disasters. Air pollution is no longer just Delhi's problem as it is affecting the whole of the Indo-Gangetic plain, with hundreds of millions of people breathing toxic air. According to the Centre for Research on Energy and Clean Air, 150 cities of the 256 cities monitored in 2025 exceeded nationally recommended PM2.5 levels. For years governments have ignored this issue in India's capital, their measures temporary and miserably inadequate, banning polluting vehicles and stopping construction when the air quality index reaches certain levels. Trucks with water sprinklers are seen moving around Delhi's 18,000-mile road network trying to suppress matter in the air. The government has also been accused of inconsistent record collection and manipulating data, and spraying water at monitoring stations to influence the readings. Farm fires - a centuries-old practice by farmers of burning crop stubble to clear land for the next sowing cycle - have been one of the primary reasons for air pollution. The Supreme Court of India banned this practice, even imposing fines and ordering the arrest of violators. Lighting the stubble on his field, Ram Singh, a farmer from Haryana, says: \"It's up to the government to arrest us, they can put us in jail.\" \"We will eat in jail,\" he adds. Our families barely survive on these crops. Nothing is left from it, we do not cause air pollution, it's all the rich industries that do it, and we get the blame.\" As most of India is associated with agriculture, the government dares not upset the farming community. 'Not possible' to escape dangerous air But that's no help to Alok Ranjan, a GP at the MMG District Hospital in Ghaziabad. On average, he sees over 300 patients during winter. He says most come with breathing problems and the numbers increase by 50% due to pollution and the cold. \"Air pollutants have many elements that are carcinogenic, like lead, mercury, cadmium, that can cause cancer - these are toxic and harmful for our bodies and metabolism,\" he says, a queue of patients snaking into the hospital corridor. \"Air pollution has an effect on all organs of our body. Our life expectancy has reduced while morbidity increased. All I can say is stay away from bad air, but that's not possible.\" Doctors, health workers and activists have called it slow poison, a silent genocide that is killing millions. Their urgent pleas for action from government and a parliament that sits just about a mile away are, for now, falling on deaf ears."
    },
    {
        "title": "Anthony Joshua pays respects to friends killed in road crash",
        "description": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends.",
        "url": "https://news.sky.com/story/anthony-joshua-discharged-from-hospital-after-fatal-road-crash-13489140",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anthony-joshua-boxer_7080597.jpg?20251112230721",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-31 23:15:00",
        "Headline": "The British-Nigerian boxing star is now recovering at his home in the country, according to a statement from the regional governments of Lagos and Ogun states.",
        "Content": "Anthony Joshua has been discharged from hospital days after a car crash in Nigeria that killed two of his close friends. The British-Nigerian boxing star is now recovering at his home in the country, according to a statement from the regional governments of Lagos and Ogun states. Joshua was travelling in the back of a black SUV when it hit a stationary truck on a major road near Lagos on Monday, killing his friends Latif Ayodele and Sina Ghami. The 36-year-old two-time world champion and his mother paid their respects to them at a funeral home on Wednesday afternoon ahead of their repatriation to the UK, the statement added. \"Anthony Joshua was discharged from hospital late this afternoon though heavy hearted and full of emotions over the loss of his two close friends he was deemed fit (enough) to recuperate from home,\" the statement, posted on X, read. The post also expressed gratitude for the team of doctors and medical staff at the Lagoon Hospital Ikoyi \"that attended to Anthony and those that sustained injuries. \"The quality of care and professionalism is truly commendable.\" Joshua, who was born in Watford to Nigerian parents, was on holiday in Nigeria following his win over Jake Paul in Miami on 19 December. He survived with minor injuries, police have said. Joshua's spokesperson said in a statement Mr Ghami and Mr Ayodele \"were close friends and integral members of Anthony's team\". How did the crash happen? The crash happened on the Lagos-Ibadan Expressway near Sagamu, at about midday local time (11am UK time), according to the Nigerian federal road safety corps (FRSC). The FRSC said preliminary findings indicated the Lexus was \"suspected to be travelling beyond the legally prescribed limit\" and \"lost control\" while overtaking before crashing into the truck, which was parked by the side of the road. \"The primary causes of the crash being excessive speed and wrongful overtaking constitute serious traffic violations and remain among the leading causes of fatal road crashes on Nigerian highways,\" the corps said on X. 'Traumatised situation' On Wednesday, a close friend of Joshua told Sky News the boxer would be in a \"traumatised situation\" from seeing another friend die in a car crash, who was more like a \"twin brother\" to him. Kolawole Omoboriowo, who has known Joshua for eight years, was the one to break the news to the athlete's family about the accident. Mr Omoboriowo, who coordinates Joshua's logistics in Nigeria, said the boxer's family were \"like my other family in the UK\". The time since has been a \"crazy nightmare for everyone\", he said. He also said Mr Ayodele, one of the two people killed in the accident, was \"more than a friend\" to Joshua and more like a \"twin brother\"."
    },
    {
        "title": "Finland police seize vessel suspected of damaging Baltic Sea cable",
        "description": "Finnish police have seized a cargo vessel suspected of damaging an undersea cable.",
        "url": "https://news.sky.com/story/finland-police-seize-vessel-suspected-of-damaging-baltic-sea-cable-13489056",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-finland-ilkka-koskimaki_7123043.jpg?20251231144658",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-31 14:13:00",
        "Headline": "Fourteen crew members of the Fitburg - said to be Russian, Georgian, Kazakh and Azerbaijani - are being held by authorities.",
        "Content": "Finnish police have seized a cargo vessel suspected of damaging an undersea cable. The Fitburg had departed from Russia and was en route to Israel when Finnish authorities detained the ship. It is suspected of causing damage to a telecoms cable running from Helsinki to Estonia's capital Tallinn belonging to Finnish telecoms group Elisa. \"Finnish authorities have taken control of the vessel as part of a joint operation,\" police said. Fourteen crew members - said to be Russian, Georgian, Kazakh and Azerbaijani - are being held by authorities. Eight NATO states border the Baltic Sea, which also borders Russia. They have been on high alert after a spate of power cable outages, telecoms links and gas pipelines that run along the relatively shallow seabed since Russia invaded Ukraine in 2022. \n                  Finnish PM apologises over 'slanted eyes' controversy after 'racist' post by Miss Finland\n                 \n                  Tampere: Four people stabbed near shopping centre in Finland\n                 \n                  Five killed after two helicopters collide in Finland\n                 NATO has boosted its presence in the Baltic with frigates, aircraft and naval drones in recent years. A spokesperson for the military alliance declined to comment on Wednesday's incident. The Fitburg sailed under the flag of St Vincent and the Grenadines, a police spokesperson said. The vessel was dragging its anchor in the sea, and was directed to Finnish territorial waters, the police and Finland's Border Guard stated. \"At this stage, the police are investigating the incident as aggravated criminal damage, attempted aggravated criminal damage, and aggravated interference with telecommunications,\" the police said. Read more from Sky News:Search for missing plane resumes 11 years after it disappearedWhy UK's undersea cables are vulnerable Estonia's justice ministry said a second telecoms cable connecting the country to Finland had also suffered an outage on Wednesday. It was not immediately clear if the cable, belonging to Sweden's Arelion, was running parallel to Elisa's. Finland's President Alexander Stubb said the situation was being monitored. Posting on X, he added: \"Finland is prepared for various security challenges and responds to them in the manner the situation requires.\" In December last year, Finland boarded the Russian-linked oil tanker Eagle S which investigators said had damaged a power cable and several telecoms links in the Baltic Sea by dragging its anchor. A Finnish court in October dismissed a criminal case against the Eagle S captain and other crew members, ruling prosecutors failed to prove intent and that any alleged negligence must be pursued by the ship's flag state or the crew's home countries."
    },
    {
        "title": "Iranian protesters attempt to break in to government building",
        "description": "Iranian protesters attempted to storm a local government building on Wednesday, state media reported, as demonstrations over the cost of living reached their fourth day. ",
        "url": "https://news.sky.com/story/iranian-protesters-attempt-to-break-in-to-government-building-13489061",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-tehran-iran_7123070.jpg?20251231152032",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-31 14:38:00",
        "Headline": "The protests over a plummeting currency and spiralling inflation are Iran's biggest since 2022, reaching their fourth day on 31 December.",
        "Content": "Iranian protesters attempted to storm a local government building on Wednesday, state media reported, as demonstrations over the cost of living reached their fourth day.  In an unusual response to unrest, the Iranian government on Tuesday offered to set up a dialogue with protest leaders. The first major protests since before June - when US airstrikes prompted an outpouring of patriotism - began on Sunday. Shopkeepers and traders in the capital, Tehran, angry about spiralling inflation and the Iranian currency plunging to a record low against the dollar, took to the streets on Sunday, and have since been joined by students. On Wednesday they attempted to break in to the local governor's office in the southern Fars province, state media confirmed. \"A few hours ​ago an organised group tried to get into the governorate building in the city of Fasa, their attack failed with the intervention ‍of security forces,\" state media said. \"The leader of these rioters, a 28-year-old woman, was arrested\". \n                  Iranian university students join protests over soaring cost of living\n                 \n                  Three war fronts on the agenda as Benjamin Netanyahu set for talks with Donald Trump\n                 \n                  Major city may have to evacuate as water supplies run low\n                 Iran's Tasnim news agency cited a local official as saying four \"attackers\" had been detained and three members of the security forces ‌had been wounded during the clash. The governor of Fasa told state media that \"the protests were caused by inflation and economic conditions. Individualsinfluenced by hostile channels and media participated in them... the situation is back to normal\". Whereas Iranian authorities have responded to previous protests with fierce security measures and arrests, in this instance it offered to set up a \"dialogue mechanism\" - though the details have not been confirmed. Monday's protests were the biggest since 2022, which were prompted by the death of 22-year-old Mahsa Jina Amini in police custody. She was arrested by the country's morality police for allegedly wearing her hijab improperly. The recent protests come after the rial lost nearly half its value ‍against the dollar in 2025, with inflation reaching 42.5% in December. On Monday, the governor of Iran's Central Bank, Mohammad Reza Farzin, resigned, replaced by former economics minister Abdolnasser Hemmati. Iran's embattled economy has been navigating US sanctions since 2018, designed to deter its nuclear programme, which it says is peaceful. These sanctions have hampered the economy and strained household budgets, the impact now exacerbated by the plummeting currency value and inflationary pressure which have pushed up the prices of food and other daily essentials."
    },
    {
        "title": "Australia PM Anthony Albanese commends 'courage and compassion' after Bondi Beach attack in New Year's message",
        "description": "Anthony Albanese has commended the \"courage and compassion\" shown in Australia after the Bondi Beach attack in his New Year's message.",
        "url": "https://news.sky.com/story/australian-pm-anthony-albanese-commends-courage-and-compassion-after-bondi-beach-attack-in-new-years-message-13488963",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-bondi-beach-anthony-albanese_7122815.jpg?20251231051650",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-31 04:46:00",
        "Headline": "Fifteen people died and dozens more were injured when gunmen opened fire on more than 1,000 people celebrating the Jewish festival Hanukkah on Sydney's Bondi Beach on 14 December.",
        "Content": "Anthony Albanese has commended the \"courage and compassion\" shown in Australia after the Bondi Beach attack in his New Year's message. The Australian prime minister started his address on a sombre note, saying: \"Right now, the joy that we usually feel at the start of a new year is tempered by the sadness of the old. \"Following the terror inflicted on Jewish Australians at Bondi Beach, our hearts ache for every life lost and every life changed forever.\" Fifteen people were killed and dozens more were injured when gunmen opened fire towards an event attended by more than 1,000 people celebrating the Jewish festival Hanukkah on Sydney's Bondi Beach on 14 December. Police believe the attack was inspired by the terror group Islamic State. But Mr Albanese said the response to the attack showed \"the best of the Australian spirit in all its courage and compassion\". \"That is why I'm optimistic and determined that in the new year we will rise to meet the challenges ahead of us,\" he said. Crowds have started to gather at the Sydney Opera House, where a major fireworks display is set to illuminate the sky to welcome in the new year. The fireworks display is set to feature a tribute to the victims of the Bondi Beach terror attack. Heightened security Security in the city has been heightened, with security checks set up at popular viewpoints. Chris Minns, the premier of New South Wales (NSW), where Bondi Beach is located, said police will be deployed \"in massive numbers\". He added that some will be carrying weapons that residents have not seen before, in what is being reported as an unprecedented display of firepower by officers, according to Sky News Australia. Mr Minns also urged locals to show \"defiance\" by attending 31 December fireworks and other events with friends and family. \"Because of the weird ideology of some of these terrorists, what they want is for us to crawl up into a ball and not have fun with our family and friends,\" he said, according to Sky News Australia. \"I'm calling on the people of Sydney to step out, to do what you would ordinarily do, to thumb your nose at the terrorists.\""
    },
    {
        "title": "Motorcycles worth $40m seized in hunt for ex-Olympic snowboarder on FBI's Ten Most Wanted list",
        "description": "Mexican officials have seized dozens of motorcycles worth around $40m in the hunt for a former Olympic snowboarder who is on the FBI's Ten Most Wanted list. ",
        "url": "https://news.sky.com/story/motorcycles-worth-40m-seized-in-hunt-for-ex-olympic-snowboarder-on-fbis-ten-most-wanted-list-13488972",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ryan-wedding-fbi_7122857.jpg?20251231080912",
        "type": "World",
        "Author": "Jenness Mitchell, news reporter",
        "Date Published": "2025-12-31 07:57:00",
        "Headline": "US authorities believe Ryan Wedding is living in Mexico under the protection of the Sinaloa Cartel, with up to $15m being offered for information leading to his arrest.",
        "Content": "By Jenness Mitchell, news reporter  Mexican officials have seized dozens of motorcycles worth around $40m in the hunt for a former Olympic snowboarder who is on the FBI's Ten Most Wanted list.  Canadian Ryan Wedding, 44, has been accused of running a multi-national drug trafficking network and is additionally facing charges in connection with the killing of a federal witness. US authorities believe he is living in Mexico under the protection of the Sinaloa Cartel, with up to $15m (£11m) being offered for information leading to his arrest. This month, Mexican authorities executed multiple search warrants and seized a large number of motorcycles believed to be owned by Wedding. In a statement this week, the FBI said the bikes had an estimated value of approximately $40m (£30m). Other items confiscated included artworks and medals. The FBI said the seizures came with assistance from Mexican authorities, the Royal Canadian Mounted Police and the Los Angeles Police Department. \n                  How Trump has supercharged the new world dis-order\n                 \n                  Two critically injured after bear attacks schoolchildren and teachers in Canada\n                 \n                  Former Olympic snowboarder wanted by US charged with masterminding murder of witness\n                 Wedding competed for Canada at the 2002 Winter Olympics in Salt Lake City, where he finished 24th in the men's parallel giant slalom event. Officials in the US and Canada have compared the former sportsman to other famous drug kingpins, including Joaquin \"El Chapo\" Guzman and Pablo Escobar. Last month, Wedding was accused of orchestrating the killing of a witness in Colombia to help him avoid extradition to the US in January. Ten other defendants were arrested on the charges in the federal indictment, which was unsealed in California. Read more from Sky News:Four killed in US strike on alleged drug boatA decade of county lines leaves its scars on children Authorities have accused Wedding of working closely with the Sinaloa Cartel to funnel massive quantities of drugs into the US and Canada. Wedding, whose aliases include El Jefe, Public Enemy and James Conrad King, was charged in 2024 with running a drug ring that moves some 60 tons of cocaine a year using long-haul lorries to bring the drugs between Colombia, Mexico, Southern California and Canada. Authorities say he and his co-conspirators used a Canadian website called The Dirty News to post a photograph of the witness so he could be identified and killed. The witness was then followed to a restaurant in Medellin and shot in the head in January. US Attorney General Pam Bondi said last month: \"Whether you are a street-level drug dealer ... or an international drug kingpin, we are coming for you.\""
    },
    {
        "title": "Ex-Australia batter Damien Martyn in induced coma after contracting meningitis",
        "description": "Ex-Australia batter Damien Martyn has been placed in an induced coma after contracting meningitis.",
        "url": "https://news.sky.com/story/ex-australia-batter-damien-martyn-in-induced-coma-after-contracting-meningitis-13488986",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-damien-martyn-cricket_7122883.jpg?20251231090309",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-31 08:39:00",
        "Headline": "Cricket Australia confirmed the 54-year-old sportsman became unwell on Boxing Day and is being treated in a Brisbane hospital.",
        "Content": "Ex-Australia batter Damien Martyn has been placed in an induced coma after contracting meningitis. Cricket Australia confirmed that the 54-year-old sportsman, who played 67 Test matches between 1992 and 2006 and won two World Cups, became unwell on Boxing Day and is being treated in a Brisbane hospital. \"I'm saddened to hear of Damien's illness. The best wishes of everyone at Cricket Australia and in the wider cricket community are with him at this time,\" Cricket Australia chief executive Todd Greenberg said in a statement. His friend and former teammate Adam Gilchrist added: \"He is getting the best of treatment and (Martyn's partner) Amanda and his family know that a lot of people are sending their prayers and best wishes.\" Former Australian Football League (AFL) star Brad Hardie, speaking on his radio show with Perth's 6PR station, told listeners that Martyn was receiving treatment at a Queensland hospital. He said: \"I'd like everybody to have their best wishes and positive thoughts for Marto. Let's hope he can pull through, because it's really serious.\" Darren Lehmann, the Northamptonshire head coach and former teammate of Martyn, sent \"lots of love and prayers\" via X. He added: \"Keep strong and fighting legend. Love to the family xxx.\" Read more from Sky News:Anthony Joshua was 'shocked' and 'couldn't talk' after crash Martyn, who represented Yorkshire as an overseas player in 2003, posted on X on Christmas Eve looking ahead to the fourth Ashes Test in Melbourne. He wrote: \"If the old brigade could play again then this would be it. Boxing Day Test match. What a cauldron.\""
    },
    {
        "title": "Search for Malaysia Airlines flight MH370 resumes 11 years after it went missing",
        "description": "The deep-sea search for missing Malaysia Airlines flight MH370 has begun - more than a decade after the jet vanished with 239 people on board. ",
        "url": "https://news.sky.com/story/search-for-malaysia-airlines-flight-mh370-resumes-11-years-after-it-went-missing-13489040",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-world-malaysia_7099394.jpg?20251203095223",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-31 09:42:00",
        "Headline": "The Malaysian government says a search vessel arrived at an undisclosed area in the Indian Ocean with two autonomous underwater vehicles.",
        "Content": "The deep-sea search for missing Malaysia Airlines flight MH370 has begun - more than a decade after the jet vanished with 239 people on board.  The Boeing 777 disappeared from radar shortly after departing Kuala Lumpur International Airport en route to Beijing on 8 March 2014. Satellite data showed the aircraft deviated from its flight path and headed south into the far-southern Indian Ocean, where investigators believe it crashed, with 227 passengers and 12 crew on board. A multinational search, spearheaded by Australia, failed to locate the jet, although possible debris was found along the coastline of East African and Indian Ocean islands. Malaysia's transport ministry announced earlier this month American marine robotics firm Ocean Infinity would embark on an intermittent 55-day search at the end of December. On Wednesday, the country's government said a search vessel, the Armada 86 05, arrived at a designated search area with two autonomous underwater vehicles. It said the vessel had prepared for the search at Fremantle Port in Western Australia, although the location of the search area has not been disclosed. \n                  Search for Malaysia Airlines flight MH370 to resume 11 years after it went missing\n                 \n                  Hunt for missing Malaysia Airlines Flight MH370 to resume 10 years after plane vanished\n                 \n                  Search for Malaysia Airlines flight MH370 to resume a decade after it vanished\n                 Read more from Sky News:Snowfall expected as weather warnings issuedQueen 'fought back' after being assaulted as a teenager The Malaysian government previously said it had approved a \"no-find, no-fee\" contract with Ocean Infinity, with the company to be paid $70m (£53m) only if wreckage is discovered. Ocean Infinity conducted an unsuccessful private search in 2018. Its chief executive, Oliver Plunkett, said last year the firm was working with multiple experts and had narrowed the search zone to what it believes is the most probable crash site. Earlier this year, Ocean Infinity briefly restarted seabed search operations in a new 5,800-square-mile area of the southern Indian Ocean, but the effort was suspended in April because of poor weather. The firm has confirmed it was resuming the search for MH370 but refused to comment further, citing the \"important and sensitive nature\" of the operation."
    },
    {
        "title": "Trump issues warning as National Guard troops withdrawn from US cities",
        "description": "The US government is removing the National &#8288;Guard from Chicago, Los Angeles and &#8203;Portland, Donald Trump has announced.",
        "url": "https://news.sky.com/story/trump-issues-warning-as-national-guard-troops-withdrawn-from-us-cities-13489125",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-national-guard-california_7123223.jpg?20251231221242",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-31 21:03:00",
        "Headline": "The deployment of the National Guard has been a controversial calling card of the Trump administration throughout 2025 - and the president has indicated 2026 could see further such orders.",
        "Content": "The US government is removing the National ⁠Guard from Chicago, Los Angeles and ​Portland, Donald Trump has announced. But, in a New Year's Eve message on social media, the president also warned that federal forces would \"come back\" if crime rates increased. The National Guard is a reserve of US military troops, typically used for domestic emergencies such as major protests and natural disasters. But in 2025 it was deployed to many Democrat-controlled cities, which Mr Trump said was to crack down on crime and disorder. Democrats accuse his administration of overstepping its authority and exaggerating isolated episodes of violence. In his social media post on Wednesday, Mr Trump said: \"We are removing ‌the National Guard from Chicago, ​Los Angeles, and Portland in Oregon, despite the fact that ‍CRIME has been greatly reduced by having these great Patriots in those ‌cities, and ONLY by ⁠that fact.\" However, troops sent to Chicago and Portland were never out on the streets, their deployment held up by legal challenges. Efforts in Oregon were blocked by a federal judge and in Chicago by the Supreme Court. The latter was not a final ruling, but was a significant and unusual setback from the US's top court. Read more from Sky News:Starmer's 2026 New Year's messageQueen reveals anger over assault as teen Troops were utilised in Los Angeles earlier this year as part of a broader crackdown on crime and immigration, but had already been pulled back after a court ruling earlier this month. Legal roadblocks sprang up elsewhere in the country too, including in Washington DC, where District of Columbia Attorney General Brian Schwalb brought a court case to halt the deployments of more than 2,000 guardsmen. Trump: We'll be back Mr Trump added in his post: \"We will come ‍back, perhaps in a much different and stronger form, when crime begins to soar ​again - Only a question of time! \"It is hard to believe that these Democrat Mayors and Governors, all of whom are greatly incompetent, would want us to leave, especially considering the great progress that has been made???\""
    },
    {
        "title": "Motorcycles worth $40m seized in hunt for ex-Olympic snowboarder on FBI's Ten Most Wanted list",
        "description": "Mexican officials have seized dozens of motorcycles worth around $40m in the hunt for a former Olympic snowboarder who is on the FBI's Ten Most Wanted list. ",
        "url": "https://news.sky.com/story/motorcycles-worth-40m-seized-in-hunt-for-ex-olympic-snowboarder-on-fbis-ten-most-wanted-list-13488972",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ryan-wedding-fbi_7122857.jpg?20251231080912",
        "type": "US",
        "Author": "Jenness Mitchell, news reporter",
        "Date Published": "2025-12-31 07:57:00",
        "Headline": "US authorities believe Ryan Wedding is living in Mexico under the protection of the Sinaloa Cartel, with up to $15m being offered for information leading to his arrest.",
        "Content": "By Jenness Mitchell, news reporter  Mexican officials have seized dozens of motorcycles worth around $40m in the hunt for a former Olympic snowboarder who is on the FBI's Ten Most Wanted list.  Canadian Ryan Wedding, 44, has been accused of running a multi-national drug trafficking network and is additionally facing charges in connection with the killing of a federal witness. US authorities believe he is living in Mexico under the protection of the Sinaloa Cartel, with up to $15m (£11m) being offered for information leading to his arrest. This month, Mexican authorities executed multiple search warrants and seized a large number of motorcycles believed to be owned by Wedding. In a statement this week, the FBI said the bikes had an estimated value of approximately $40m (£30m). Other items confiscated included artworks and medals. The FBI said the seizures came with assistance from Mexican authorities, the Royal Canadian Mounted Police and the Los Angeles Police Department. \n                  How Trump has supercharged the new world dis-order\n                 \n                  Two critically injured after bear attacks schoolchildren and teachers in Canada\n                 \n                  Former Olympic snowboarder wanted by US charged with masterminding murder of witness\n                 Wedding competed for Canada at the 2002 Winter Olympics in Salt Lake City, where he finished 24th in the men's parallel giant slalom event. Officials in the US and Canada have compared the former sportsman to other famous drug kingpins, including Joaquin \"El Chapo\" Guzman and Pablo Escobar. Last month, Wedding was accused of orchestrating the killing of a witness in Colombia to help him avoid extradition to the US in January. Ten other defendants were arrested on the charges in the federal indictment, which was unsealed in California. Read more from Sky News:Four killed in US strike on alleged drug boatA decade of county lines leaves its scars on children Authorities have accused Wedding of working closely with the Sinaloa Cartel to funnel massive quantities of drugs into the US and Canada. Wedding, whose aliases include El Jefe, Public Enemy and James Conrad King, was charged in 2024 with running a drug ring that moves some 60 tons of cocaine a year using long-haul lorries to bring the drugs between Colombia, Mexico, Southern California and Canada. Authorities say he and his co-conspirators used a Canadian website called The Dirty News to post a photograph of the witness so he could be identified and killed. The witness was then followed to a restaurant in Medellin and shot in the head in January. US Attorney General Pam Bondi said last month: \"Whether you are a street-level drug dealer ... or an international drug kingpin, we are coming for you.\""
    },
    {
        "title": "Isiah Whitlock Jr., actor who starred in The Wire, dies aged 71",
        "description": "Isiah Whitlock Jr., who was best known for his role on The Wire, has died aged 71.",
        "url": "https://news.sky.com/story/isiah-whitlock-jr-actor-who-starred-in-the-wire-dies-aged-71-13488960",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-isiah-whitlock-whitlock_7122809.jpg?20251231022248",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-31 02:01:00",
        "Headline": "Whitlock Jr. portrayed openly corrupt city councilman Clay Davis on the show, who was known for his trademark expression \"sheee-it\".",
        "Content": "Isiah Whitlock Jr., who was best known for his role on The Wire, has died aged 71. \"It is with tremendous sadness that I share the passing of my dear friend and client Isiah Whitlock Jr.,\" his manager said in a statement. \"If you knew him - you loved him\". Whitlock Jr. portrayed openly corrupt city councilman Clay Davis on 25 episodes over five seasons of The Wire from 2002 to 2008. The fan-favourite character was known for his trademark expression - \"sheee-it\" -, which was first delivered on the show in 2002. The profanity inspired the National Bobblehead Hall of Fame and Museum to release a 20th Anniversary Edition Isiah Whitlock Jr. Talking Bobblehead in 2022. The creator of The Wire, David Simon, shared a caption-less picture of Whitlock Jr. on Bluesky in tribute on Tuesday. Whitlock Jr. starred in the political satire Veep alongside Julia Louis-Dreyfus, playing secretary of defence George Maddox for three seasons from 2013 to 2015. \n                  New Year Honours: Idris Elba, Torvill and Dean, and Lionesses among those recognised\n                 \n                  Brigitte Bardot: The bombshell and style icon who walked away from fame and glamour\n                 \n                  Bayeux Tapestry: Priceless artefact to be insured for £800m\n                 He also appeared in several Spike Lee films, including 25th Hour, Da 5 Bloods, BlacKkKlansman, Red Hook Summer, Chi-Raq and She Hate Me. Read more from Sky News:JFK's granddaughter dies aged 35The most striking pictures of 2025 Lee paid tribute to Whitlock Jr. on Instagram, writing: \"Today I Learned Of The Passing Of My Dear Beloved Brother ISIAH WHITLOCK. GOD BLESS.\" Whitlock Jr. had several guest roles on TV shows like Cagney and Lacy as well as Law & Order and appeared in small roles in the 1990 films Goodfellas and Gremlins 2: The New Batch."
    },
    {
        "title": "Revolution Bars owner plots swift sale as cash crisis deepens",
        "description": "The London-listed company behind the Revolution bars chain has set a deadline for bids next week after warning shareholders that they face being wiped out as part of a deal.",
        "url": "https://news.sky.com/story/revolution-bars-owner-plots-swift-sale-as-cash-crisis-deepens-13489098",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-revolution-bars-nottingham_7123168.jpg?20251231183155",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-12-31 17:47:00",
        "Headline": "Neos Hospitality is among the parties which are said to have expressed interest in buying some of The Revel Collective’s assets as shareholders face being left empty-handed, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The London-listed company behind the Revolution bars chain has set a deadline for bids next week after warning shareholders that they face being wiped out as part of a deal. Sky News understands that The Revel Collective, which also owns 22 Peach Pubs and bars trading under the Revolucion de Cuba name, has told bidders to submit offers by January 9 as it races to conclude a deal. City sources said that Neos Hospitality, one of Britain's leading operators of late-night drinking venues, was among the parties which had expressed interest in buying some of The Revel Collective's sites. In total, the company trades from 62 locations but is facing the prospect of collapse if it does not finalise transactions to sell its assets. It warned in a stock exchange announcement earlier this month that investors were unlikely to see any return from the transactions under consideration. The company also announced the suspension of trading in its shares. \"The option of an equity fundraising has been considered but the Board has concluded it does not have the necessary support for such a transaction,\" it added. \n                  FTSE 100 has best year since 2009 - outperforming US and European rivals\n                 \n                  Annual energy bill to fall by more than £100 in April as government removes policy costs\n                 \n                  Octopus Energy lines up sale of stake in $10bn software arm Kraken\n                 Industry insiders said that two parties were in talks to buy the Peach Pubs business, which The Revel Collective - then known as Revolution Bars - acquired in 2022. Neos Hospitality is said to be interested in a portfolio of the group's late-night venues, although the extent and seriousness of its overtures was unclear on Wednesday. FTI Consulting is advising on the formal sale process. A spokesperson for The Revel Collective declined to comment."
    },
    {
        "title": "FTSE 100 has best year since 2009 - outperforming US and European rivals",
        "description": "The UK's flagship stock index has had its best year since 2009 after a series of record-breaking days.",
        "url": "https://news.sky.com/story/ftse-100-has-best-year-since-2009-outperforming-us-and-european-rivals-13489059",
        "image_url": "https://e3.365dm.com/24/01/1920x1080/skynews-london-stock-exchange_6433018.jpg?20240125141202",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-31 14:25:00",
        "Headline": "Record high metal prices, interest rate cuts and trade wars have all boosted the FTSE 100's appeal. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK's flagship stock index has had its best year since 2009 after a series of record-breaking days. The Financial Times Stock Exchange (FTSE) 100 ended the year up 21.5% compared to the start. It means the share price of the publicly traded companies making up the FTSE 100 had the greatest annual increase in 16 years. The FTSE 100 comprises the hundred most valuable companies listed on the London Stock Exchange. Notable constituents include lenders such as Barclays, Natwest, HSBC and Lloyds and supermarket chains Tesco, Marks & Spencer and Sainsbury's. Read more:Snowfall expected across much of UK as new warnings issuedHow a healthy diet is helping patients recover from alcohol abuse The index is also largely made up of mining and international oil and gas companies. \n                  Schwimmer urges Reeves to unleash £100bn UK stock market boom\n                 \n                  How markets reacted to uncertainty over Rachel Reeves's future\n                 \n                  Stricken currency firm Argentex in talks about emergency sale\n                 There was a series of record-breaking moments for the UK's benchmark index across the 12 months, the most recent of which was on 30 December. There were 41 all-time high closes for the FTSE 100 in 2025, according to data from the London Stock Exchange Group (LSEG). Why? It has been boosted by a weak pound at points over the year, which made it good value to buy shares priced in sterling, as FTSE 100 companies tend to be. Many of the mining giants have done well as minerals like gold, silver and copper reached new highs. Investors moved money into the metals as they were perceived as safe investments while markets were volatile. The promise of interest rate cuts by the Bank of England also helped lift the FTSE 100. It had also benefited from investors looking to companies outside of the US after President Trump's trade war against China, and much of the world, began in earnest on 2 April on his so-called Liberation Day. Many trade deals have since been agreed. How does it compare? The UK's top-flight index also outperformed European and US rivals. France's CAC 40 index gained more than 10% in 2025, while the pan-European Stoxx 600 increased nearly 16%. Germany's DAX also rose 21.5%. After a year that saw tech company valuations soar, as investors sought to benefit from an anticipated artificial intelligence (AI) boom, Wall Street's S&P 500 rose 17%. The S&P 500 is the US index containing companies relied on to be stable and profitable, and contains the Magnificent 7 highest-performing tech companies. Among the Magnificent 7 is the most valuable company in the world, AI-chipmaker Nvidia, as well as Tesla, Amazon, Apple, Meta, Microsoft, and Google's parent company, Alphabet. Despite hovering near the symbolic 10,000 mark, the FTSE 100 failed to meet the milestone and closed the year at 9,931."
    },
    {
        "title": "Annual energy bill to fall by more than £100 in April as government removes policy costs",
        "description": "Annual energy bills are set to fall by &#163;138 in April due to government changes, trusted forecasters have said. ",
        "url": "https://news.sky.com/story/annual-energy-bill-to-fall-by-more-than-163100-in-april-as-government-removes-policy-costs-13488992",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-energy-bills-electricity_7057830.jpg?20251021222054",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-12-31 09:10:00",
        "Headline": "The key reason bills are rising from New Year's Day is due to policy costs added to bills, some of which are now being removed.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Annual energy bills are set to fall by £138 in April due to government changes, trusted forecasters have said.  Initially, costs had been expected to rise when the next energy price cap is announced for the three months from April. But due to measures announced in the budget, research firm Cornwall Insight said an annual bill will drop 8% to £1,620 for a typical dual‑fuel household. If the forecast proves correct, yearly bills will be at their lowest since July 2024 and households will experience the biggest price fall in two years. Policy costs are the key reason bills are rising from 1 January to 31 March in 2026. Despite a drop in wholesale oil and gas costs, from New Year's Day energy will be slightly more expensive for bill payers than it had been. Nowadays, policy measures are the main determinants of bill falls or increases. Between January and March, the typical annual dual fuel bill will be £1,758 - up from the current £1,755 cap. The biggest contributor to bills is the cost of energy, followed by infrastructure charges. What's changing? Following the budget, some charges that had been added to bills are being removed and instead funded through general taxation. Chancellor Rachel Reeves had said the government would reduce bills by £150 through cutting levies. The Energy Company Obligation (ECO) scheme, designed to tackle fuel poverty and help reduce carbon emissions, has been scrapped. The vast majority (75%) of renewables obligation costs are being removed from consumer energy bills and coming from the general tax pot. Read more on Sky News:Snowfall expected across much of UK as new warnings issuedHow a healthy diet is helping patients recover from alcohol abuse The anticipated rise in national grid costs is also slightly lower than initially thought. A further decline in bill prices in July is seen as likely by Cornwall Insights. How does the price cap work? The energy price cap is a limit on the amount energy providers can charge per unit of power. It's set by the regulator Ofgem every three months and is based on wholesale energy prices and policy measures. The official energy price cap announcement for April will be made on 25 February."
    },
    {
        "title": "Sir Keir Starmer promises that 'change' will finally arrive in 2026 in New Year's message",
        "description": "Sir Keir Starmer is promising that the change he pledged to deliver in the 2024 election will finally arrive in 2026.",
        "url": "https://news.sky.com/story/sir-keir-starmer-promises-that-change-will-finally-arrive-in-2026-in-new-years-message-13489041",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-manifesto-keir-starmer_6580510.jpg?20251231132102",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-31 12:48:00",
        "Headline": "The prime minister promised change in his 2024 manifesto, but conceded it has not been an \"overnight job\". Sir Keir Starmer has fought off rumours of leadership challenges and falling popularity ratings.",
        "Content": "Sir Keir Starmer is promising that the change he pledged to deliver in the 2024 election will finally arrive in 2026. In his New Year's address, the prime minister accepted that his government had not yet delivered on the promise plastered on the front of their manifesto. Sir Keir admitted that \"for many, life is still harder than it should be\" and they had been left without the money for a \"meal out\" or \"a holiday\" or a \"chance to make a special family moment extra special\". 👉Listen to Politics at Sam and Anne's on your podcast app👈 The prime minister, whose popularity has plummeted and faces rumours of leadership challenges, said 2026 will be the year things change. \"In 2026, the choices we've made will mean more people will begin to feel positive change in your bills, your communities and your health service,\" he said. \"But even more people will feel once again a sense of hope, a belief that things can and will get better, feel that the promise of renewal can become a reality, and my government will make it that reality. \"More police on the streets by March. \"Energy bills down and the number of new health hubs up in April. \"More funding for local communities. \"And with that change, decline will be reversed.\" The prime minister positioned his government as being one to \"reverse a decade of decline\" under the Conservatives. But he confirmed a renewal was \"not an overnight job\" and the \"challenges we face were decades in the making\". Read more:Half of voters think Starmer will be replaced in 2026Which PM history had the worst Christmas Day in history? As well as political jeopardy, Sir Keir also had to face the sluggish economic growth in the UK and worldwide, alongside an unstable international picture on several fronts. He, however, vowed to get Britain \"back on track\". Elsewhere, Conservative leader Kemi Badenoch attempted humour in her New Year's message. She said: \"There is a lot to look forward to this year. No, not Labour's tax rises! \"But a Winter Olympics, a World Cup, and for political geeks, local elections!\" Ms Badenoch then lamented factors like low economic growth, higher taxes and unemployment figures in 2025, adding it was \"difficult for many people\". She added her party was working on a \"Get Britain Working again\" plan centred on supporting businesses. Liberal Democrat leader Sir Ed Davey, meanwhile, celebrated his party's performance in the local elections back in May, and looked forward to a successful performance in this year's round of council and assembly votes. \"We can win again in 2026 - in Scotland, Wales and across England,\" he said. \"To stop Trump's America becoming Farage's Britain. And change our country for the better.\""
    },
    {
        "title": "Isiah Whitlock Jr., actor who starred in The Wire, dies aged 71",
        "description": "Isiah Whitlock Jr., who was best known for his role on The Wire, has died aged 71.",
        "url": "https://news.sky.com/story/isiah-whitlock-jr-actor-who-starred-in-the-wire-dies-aged-71-13488960",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-isiah-whitlock-whitlock_7122809.jpg?20251231022248",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-12-31 02:01:00",
        "Headline": "Whitlock Jr. portrayed openly corrupt city councilman Clay Davis on the show, who was known for his trademark expression \"sheee-it\".",
        "Content": "Isiah Whitlock Jr., who was best known for his role on The Wire, has died aged 71. \"It is with tremendous sadness that I share the passing of my dear friend and client Isiah Whitlock Jr.,\" his manager said in a statement. \"If you knew him - you loved him\". Whitlock Jr. portrayed openly corrupt city councilman Clay Davis on 25 episodes over five seasons of The Wire from 2002 to 2008. The fan-favourite character was known for his trademark expression - \"sheee-it\" -, which was first delivered on the show in 2002. The profanity inspired the National Bobblehead Hall of Fame and Museum to release a 20th Anniversary Edition Isiah Whitlock Jr. Talking Bobblehead in 2022. The creator of The Wire, David Simon, shared a caption-less picture of Whitlock Jr. on Bluesky in tribute on Tuesday. Whitlock Jr. starred in the political satire Veep alongside Julia Louis-Dreyfus, playing secretary of defence George Maddox for three seasons from 2013 to 2015. \n                  New Year Honours: Idris Elba, Torvill and Dean, and Lionesses among those recognised\n                 \n                  Brigitte Bardot: The bombshell and style icon who walked away from fame and glamour\n                 \n                  Bayeux Tapestry: Priceless artefact to be insured for £800m\n                 He also appeared in several Spike Lee films, including 25th Hour, Da 5 Bloods, BlacKkKlansman, Red Hook Summer, Chi-Raq and She Hate Me. Read more from Sky News:JFK's granddaughter dies aged 35The most striking pictures of 2025 Lee paid tribute to Whitlock Jr. on Instagram, writing: \"Today I Learned Of The Passing Of My Dear Beloved Brother ISIAH WHITLOCK. GOD BLESS.\" Whitlock Jr. had several guest roles on TV shows like Cagney and Lacy as well as Law & Order and appeared in small roles in the 1990 films Goodfellas and Gremlins 2: The New Batch."
    }
]