[
    {
        "title": "US government shutdown to begin within hours",
        "description": "The US government is hours away from shutting down for the first time in almost seven years after last-ditch Senate votes on funding plans fell short.",
        "url": "https://news.sky.com/story/us-government-on-brink-of-shutdown-13441990",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-us-shutdown_7037800.jpg?20251001010711",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-30 22:26:00",
        "Headline": "Donald Trump had threatened to lay off \"a lot of people\" as a result of the shutdown, which comes after Republicans and Democrats failed to agree on a funding package.",
        "Content": "The US government is hours away from shutting down for the first time in almost seven years after last-ditch Senate votes on funding plans fell short. Hundreds of thousands of federal workers deemed not essential for protecting people or property - such as law enforcement personnel - could be furloughed or laid off when the shutdown begins at midnight (5am UK time). Critical services, including social security payments and the postal service, will keep operating but may suffer from worker shortages, while national parks and museums could be among the sectors that close completely. It comes after rival Democrat and Republicans refused to budge in their stand-off over healthcare spending. A Democrat-led proposal to keep the government funded went down by 53 votes to 47 in the Senate, before the Republicans' one notched up 55 in favour - five short of the threshold needed to avert a shutdown. Unlike legislation, a simple majority isn't enough to pass a government funding bill. Following the votes in Washington DC on Tuesday night, the White House's budget office confirmed the shutdown would happen and said affected agencies \"should now execute their plans\". It blamed the Democrats, describing their position as \"untenable\". The opposition party wants to reverse cuts to the government's health insurance programme, Medicaid, which were passed earlier this summer. Senate majority leader John Thune, a Republican, accused the Democrats of taking federal workers \"hostage\". His Democrat counterpart, Senate minority leader Chuck Schumer, said the Republicans' funding package \"does absolutely nothing to solve the biggest health care crisis in America\". Trump threatens layoffs President Donald Trump was defiant ahead of the votes, and warned he could make \"irreversible\" cuts \"that are bad\" for the Democrats if the shutdown went ahead. He threatened to cut \"vast numbers of people out\" and \"programmes that they (the Democrats) like\". \"We'll be laying off a lot of people,\" he told reporters in the Oval Office on Tuesday. Tens of thousands of government employees have already been laid off this year, driven by the \"DOGE\" initiative that was spearheaded by Elon Musk upon Mr Trump's return to the White House. The last shutdown was in Mr Trump's first term, from December 2018 to January 2019, when he demanded money for his US-Mexico border wall. At 35 days, it was the longest on record. Mr Thune has expressed hope the latest shutdown will come to a much quicker conclusion, telling reporters: \"We can reopen tomorrow - all it takes is a handful of Democrats to join Republicans to pass the clean, nonpartisan funding bill that's in front of us.\" Before this week, the government had shut down 15 times since 1981. Most only last a few days. The Senate will hold further votes on the Republican and Democrat stopgap funding bills on Wednesday. What happens now? Immigration enforcement, air-traffic control, military operations, social security and law enforcement are among the services that will not be brought to a halt. However, should employees miss out on payslips as a result of a prolonged shutdown, they could be impacted by staffing shortages. For example, delays at airports. Cultural institutions deemed non-essential, like national parks and museums, will be more directly impacted from the very beginning, with large cuts to the workforce. The popular Smithsonian, for example, has said it only has enough funding to stay open for a week. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Sir Keir Starmer says he will take 'no more lectures' from Nigel Farage - and warns of 'fight for the soul of our country'",
        "description": "Sir Keir Starmer has said he will take \"no more lectures\" from Nigel Farage, as he warned that the next four years will be \"a fight for the soul of our country\" against Reform UK.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-he-will-take-no-more-lectures-from-nigel-farage-and-warns-of-fight-for-the-soul-of-our-country-13441674",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-labour_7037259.jpg?20250930215920",
        "type": "Home",
        "Author": "Ben Bloch",
        "Date Published": "2025-09-30 15:31:00",
        "Headline": "The prime minister launched a lengthy attack on Reform UK in his Labour Party conference speech, as he set out his vision for \"national renewal\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n  Sir Keir Starmer has said he will take \"no more lectures\" from Nigel Farage, as he warned that the next four years will be \"a fight for the soul of our country\" against Reform UK. In a speech setting out his vision of \"national renewal\" for Britain, the prime minister hit out at \"snake oil merchants on the right, on the left\", and questioned whether Mr Farage and his party \"genuinely love our country\". Sir Keir also asked for \"patience\" as he implements the \"change\" he has promised, which comes after a challenging first 14 months in power, with Reform UK continuing to top the opinion polls, and dissent within his own party in the form of a series of interviews by Greater Manchester mayor Andy Burnham criticising the direction of the government. In an hour-long speech at the Labour Party conference, the prime minister declared that the UK is at \"a fork in the road\", saying: \"We can choose decency, or we can choose division; renewal or decline; a country proud of its values, in control of its future, or one that succumbs against the grain of our history to the politics of grievance. It is a test, a fight for the soul of our country.\" Sir Keir argued the \"path of renewal\" he wants to set the country on is \"long\", and \"requires decisions that are not cost-free or easy, decisions that will not always be comfortable for our party\". But the reward, he said, is \"a new country, a fairer country, a land of dignity and respect\". Analysis: Speech a success for PM - but biggest issue in UK politics ignored  He hit out at politicians who \"tell you there's a quick fix, a miracle cure, tax cuts that magically pay for themselves, a wealth tax that somehow solves every problem\". \"We can all see these snake oil merchants on the right, on the left, but be in no doubt, none of them have any interest in national renewal because decline is good for their business,\" the prime minister said.  Starmer calls on party to 'fight Reform' In a lengthy attack directly on Reform UK, Sir Keir said: \"Think about it, when was the last time that you heard Nigel Farage say anything positive about Britain's future? He can't. He doesn't like Britain, doesn't believe in Britain, wants you to doubt it just as much as he does. So he resorts to grievance.\" He continued: \"The question I ask seriously of Nigel Farage and Reform is, do they love our country? Do they want to serve our country? All of it - our beautiful, tolerant, diverse country, every region, nation and city? Or do they just want to stir the pot of division?\"  He issued a rallying cry to the Labour Party to \"fight Reform with everything that this movement has\". He went on: \"If you are a patriot, whether you vote Labour or not, if you want to stand against grievance and renew Britain, then this is your fight too. Because even in a world this dangerous, I do think the politics of grievance is the biggest threat we face because it attacks who we are.\" The prime minister added that he will \"fight with every breath I have, fight for working people, fight for the tolerant, decent, respectful Britain that I know\".  Starmer is 'unfit to be PM' In response, Mr Farage said in a video message online: \"I used to think the prime minister was a decent man, somebody that I could talk to and chat to. We might disagree on worldview, but I thought he was a profoundly decent human being. \"I am completely shocked at his behaviour. I hope when he wakes up tomorrow morning, he feels ashamed of what he has done. \"This is a desperate last throw of the dice for the prime minister, who's in deep trouble. A prime minister who can't even command the support of half of his own party. But I'm sorry to say, I now believe he is unfit to be the prime minister of our country.\"  The Conservative Party barely got a mention in the hour-long speech, underscoring where Sir Keir believes the battle lines will be drawn at the next general election, expected in 2029. But speaking to broadcasters afterwards, party leader Kemi Badenoch said: \"I just thought it was really extraordinary that Keir Starmer could not explain how he was going to improve the economy.\" She described the fight between Sir Keir and Mr Farage as \"two boys squabbling in the playground\", and said she wants to focus on how \"the people in government can make life better\". Read more:Farage on course to be next PM, mega poll projectsAlmost two in three Labour members back Burnham over StarmerStreeting says Labour 'need Angela Rayner back' PM sets out the 'purpose' of his government As he declared Reform UK \"the enemy of national renewal\", Sir Keir set out his vision of the future of the country, saying: \"At the end of this hard road, there will be a new country, a fairer country, a land of dignity and respect. Everyone seen. Everyone valued. \"Wealth creation in every single community. Working people in control of their public services. The mindless bureaucracy that chokes enterprise removed, so we can build and keep building. Clean British energy powering our homes. Technology harnessed to drive us forward. Our flags flying proudly as we celebrate difference and oppose racism.\" He acknowledged that the public is \"losing faith\", and people are feeling \"ground down\", saying: \"Politics has made them question Britain. And could you blame them? They've been nothing but patient.\"  The prime minister said Britain is not \"broken\" - something he has previously argued himself - but said that his solution to the problems Britain faces is an economy working \"from the grassroots\", secure borders and controlled migration, and public and private investment in everything from education to infrastructure. \"Every decision\" the government has made in the past 14 months has been about \"changing the way we create wealth, reforming public services, giving people more control over our future\", he argued. 👉Listen to Politics At Sam And Anne's on your podcast app👈 The prime minister announced \"NHS Online\", which will allow patients to access prescriptions, book scans and tests, receive clinical advice, and manage appointments through the NHS app. And he also announced he is scrapping the Blair-era target of 50% of all young people going to university, in favour of two-thirds going to either universities or \"gold-standard apprenticeships\". Concluding his speech, the prime minister said: \"People say that a nation like ours can't be a community - that it is too diverse, too divided. I reject that. That goes against everything I stand for, everything I've served, everything I understand about this great country that I love. \"So no matter how many times people tell me it can't be done, I believe Britain can come together, that we can pursue a shared destination, that we can unite around the common good. That is my ambition. \"The purpose of this government - end decline, reform our public services, grow our economy from the grassroots and with resolve, with respect, with a flag in our hands, we will renew this country until we can say with total conviction that Britain is built for all.\""
    },
    {
        "title": "Princess Anne makes surprise Ukraine visit - and leaves a personal tribute",
        "description": "Princess Anne has placed a toy bear as a poignant tribute at a children's memorial in Ukraine, during an unexpected visit to the war-ravaged country where she also met Volodymyr Zelenskyy.",
        "url": "https://news.sky.com/story/princess-anne-make-surprise-ukraine-visit-and-leaves-a-personal-tribute-13441963",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-princess-anne-volodymyr-zelenskyy_7037752.jpg?20250930223358",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-30 20:58:00",
        "Headline": "The Princess Royal met Volodymyr Zelenskyy to discuss the UK's support for Ukraine and the country's ongoing resistance against Russia.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Princess Anne has placed a toy bear as a poignant tribute at a children's memorial in Ukraine, during an unexpected visit to the war-ravaged country where she also met Volodymyr Zelenskyy. The King's sister travelled to the capital Kyiv on Tuesday, at the request of the Foreign Office, in a show of solidarity with children and families facing the horrors of the Russian invasion. The Princess Royal met Mr Zelenskyy to discuss the UK's support for Ukraine and its ongoing resistance. Anne's secret visit, which was not publicised beforehand for security reasons, came just two days after a Russian aerial bombardment killed at least four people in Kyiv, including a 12-year-old girl, and injured at least 70 others. The attack, which lasted more than 12 hours, was one of the heaviest in recent months. The purpose of her trip was to highlight the traumatic experiences of children living on the frontline, Buckingham Palace said. Joining First Lady Olena Zelenska at the children's memorial, Anne left the teddy in tribute to youngsters killed in the conflict, saying her daughter Zara Tindall had the same bear. As the 75-year-old princess stepped back after placing the traditional-looking teddy at the base of the memorial alongside scores of other cuddly toys, she told Mrs Zelenska: \"That was one that my daughter had.\" Mrs Zelenska also left a bear in tribute. The site commemorates more than 650 children who have died since the start of the conflict in 2022. In Kyiv, she also met female police and armed forces representatives and heard about their key role protecting women and children. Visiting the Child Rights Protection Centre, she spoke to families and children who have been returned and reintegrated, and met some of those working to return more Ukrainian children. Read more:Putin issues defiant message over UkraineMoldova's pro-EU party wins elections against Russia-leaning rivals More than 19,500 Ukrainian children have been forcibly transferred or deported by the Russian authorities to Russia and the occupied territories of Ukraine. Princess Anne is the second working royal to visit Ukraine. In April last year, the Duchess of Edinburgh was the first to go and bring a letter of support from the King. Anne's trip also follows that of her nephew Prince Harry, who made a surprise visit to the Ukrainian capital just over two weeks ago with a team from his Invictus Games Foundation. Anne also visited a rehabilitation centre, where she met Ukrainian veterans returning from the frontline. The King has met Mr Zelenskyy a number of times and marked the country's independence day in August by sending a message of solidarity. During Donald Trump's recent state visit to the UK, Charles also took the opportunity to stress the importance of supporting Ukraine. He told the US president in his banquet speech: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine, to deter aggression and secure peace.\""
    },
    {
        "title": "Trump gives Hamas peace deal deadline - as key allies including Qatar urge it to accept",
        "description": "Donald Trump has said Hamas has \"three or four days\" to respond to his Gaza peace plan - with Qatar, Egypt and Turkey reportedly urging the group to accept.",
        "url": "https://news.sky.com/story/trump-gives-hamas-peace-deal-deadline-as-key-allies-including-qatar-urge-it-to-accept-13441912",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestinians-gaza-smoke_7037039.jpg?20250930120330",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-30 20:56:00",
        "Headline": "Mr Trump says they are \"just waiting for Hamas\" and it would be a \"very sad end\" if the deal was rejected.",
        "Content": " Donald Trump has said Hamas has \"three or four days\" to respond to his Gaza peace plan - with Qatar, Egypt and Turkey reportedly urging the group to accept. The US president and Israeli Prime Minister Benjamin Netanyahu unveiled the 20-point proposal at the White House on Monday. Hamas has said it needs time to look at the details and consult with other Palestinian factions. Israel has agreed to the terms, which include an immediate ceasefire; the release of all hostages; Hamas disarming; a guarantee no one will be forced to leave Gaza; and a governing \"peace panel\" including Sir Tony Blair. Key mediators such as Qatar and Egypt have urged Hamas - who murdered more than 1,200 Israelis two years ago - to accept the deal, reported Axios. Other influential Muslim nations such as Jordan, the UAE, Indonesia, Pakistan and Saudi Arabia have also publicly backed it.  Speaking outside the White House on Tuesday, Mr Trump said they were \"just waiting for Hamas\" and it would be a \"very sad end\" if the deal was rejected. \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  Dozens of pro-Palestinian demonstrators arrested outside Labour conference, Merseyside Police says\n                 \n                  Watch moment diplomats walk out as Israeli PM Netanyahu speaks at UN\n                 One Hamas leader, Mahmoud Mardawi, was quoted in Middle Eastern outlets as saying the group will not agree a deal that does not include \"self-determination for the Palestinian people\". Mr Netanyahu has warned he will \"finish the job\" if Hamas refuses, while Mr Trump said he would \"let Israel go and do what they have to do\". Role for Blair 'like putting the arsonist in charge' However, the plan is seen as heavily favouring Israel and makes no commitment towards a two-state solution - something the Israeli leader has vowed will never happen. Other details, such as the inclusion of former UK prime minister Sir Tony, have also been criticised due to his pivotal role in the invasion of Iraq. Human rights activist Ashish Prashar - who said he worked with Sir Tony when he was a Middle East envoy - told Sky News' The World programme it was \"like putting the arsonist in charge of rebuilding the house he put on fire\" and \"there is no way Palestinians trust him\". However, Mr Trump called Sir Tony a \"good man\" - and Home Secretary Yvette Cooper told Sky's Sophy Ridge that Sir Tony had a \"record on a lot of international things\". Other members of the planned governing board are set to be announced in the coming days. More than 66,000 people in Gaza have now been killed in the war, according to the Hamas-run health ministry. The total does not differentiate between the number of fighters and civilians but the ministry has said about half are women and children.  At least another 31 Palestinians were killed in Israeli strikes on Tuesday, local hospitals said. Seventeen of them died in Netzarim, an Israeli-controlled corridor, while trying to get humanitarian aid. Another 33 were reportedly wounded in the incident, said al Awda hospital. Israeli strikes which hit tents in the region of Muwasi, previously deemed a safe zone, are said to have killed 10 people.  Al Aqsa hospital said seven of the victims died near Deir al Balah after earlier this month fleeing Gaza City, where Israel has launched a renewed offensive. The three others killed were from the same family; a man, his pregnant wife and their child. They were killed when an airstrike hit their tent west of Khan Younis, according to Nasser Hospital. Read more:Praise and fury for deal - but Hamas's first reaction is tellingWhat we know about Gaza peace plan The Israeli military did not immediately comment on the reports, but said it had struck more than 160 targets of Hamas infrastructure in the past 24 hours. It has repeatedly stressed it goes to great lengths to avoid civilian casualties but that Hamas deliberately embeds itself among the civilian population. Hamas is still believed to be holding 48 of the 251 hostages kidnapped during the 7 October attack, 20 of whom are believed to be alive."
    },
    {
        "title": "Why emergency Eurovision vote on Israel might not stop a broadcast boycott",
        "description": "Eurovision is supposed to be a celebration of the unifying power of music. But for the past two years, it has attracted protests and fan boycotts over its inclusion of Israel amid the country's continued military action in Gaza.",
        "url": "https://news.sky.com/story/why-emergency-eurovision-vote-on-israel-might-not-stop-a-broadcast-boycott-13441717",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eurovision-israel-gaza_7017931.jpg?20250930212636",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-30 16:18:00",
        "Headline": "A number of countries have vowed not to take part in Eurovision if Israel participates.",
        "Content": "\n          Arts and entertainment correspondent\n        Eurovision is supposed to be a celebration of the unifying power of music. But for the past two years, it has attracted protests and fan boycotts over its inclusion of Israel amid the country's continued military action in Gaza. Ahead of 2026's contest, while nobody has even sung a note yet, a number of countries have been getting vocal. \"If Israel is there, we won't be there,\" says Natalija Gorscak, the president of broadcaster RTV Slovenia. As the world waits to see what happens with the negotiations over Donald Trump's Gaza peace plan, within the cultural world, there's no let up in the increasing isolation of Israel. Slovenia and broadcasters from Spain, the Netherlands, Ireland, and Iceland have all issued statements saying if Israel's allowed to enter, they'll consider boycotting the contest next year. Jolted into action by the controversy, officials from the European Broadcasting Union (EBU) - which runs the contest - have announced plans for an emergency vote. In a letter to members, EBU president Delphine Ernotte-Cunci said \"given that the union has never faced a divisive situation like this before\", the board agreed it \"merited a broader democratic basis for a decision\". Described by the EBU as \"an extraordinary meeting of [its] general assembly to be held online\", early next month member countries will be asked to vote on whether Israel should or shouldn't participate. Eurovision expert Dr Paul Jordan said: \"Ultimately this has been a really challenging issue for the EBU. This is a really complex picture that is building up… and they've not been consistent. \"The situation is made even more complicated by the fact the organisers themselves haven't sometimes followed their own rules about political entries and about political messaging, and they've allowed certain countries to, in a sense, get away with breaking the rules or deeming them to have not broken the rules sufficiently to allow participation. \"As far as I'm aware, the Israeli broadcaster has not broken any rules. However, you could argue their inclusion could indeed bring the contest into disrepute, which would be against the organisers' rules.\" 'We should focus on music' In 2023, Israel was represented by Noa Kirel, her country's equivalent to Britney Spears. She came third with her song Unicorn. \"It was one of the highlights in my career, it was an incredible experience for me,\" she said. While she acknowledges \"it's very different from two years ago when I represented Israel\", she hopes her country won't be excluded next month. \"It's not about politics, it's never been like that, and we should keep it that way, to focus on music.\" She believes it would be unfair to punish the Israeli people for the actions of their government: \"Voters understand that politics has no connection to this competition. \"Hopefully people will understand and respect that, see the good side… and not the bad side.\" 'European policy needs more balls' Regardless of the outcome of next month's vote, Ireland, Iceland, and Slovenia have all confirmed to Sky News that their plans to boycott will stand as long as Israel's still at war. Ms Gorscak said: \"We can lie to ourselves and say 'no, it's not political' but, you know, you can't avoid politics.\" She believes it's fundamentally wrong for bigger countries to be sitting on the fence. \"We are all somehow prisoner of German guilt towards Israel,\" she claimed. \"European policy, it needs more balls. In certain moments somebody needs to decide, somebody needs to say 'this is enough'.\" A spokesperson for German broadcaster SWR has said it \"supports the consultation process that has been initiated\" and that the goal is \"to reach a well-founded and sustainable agreement that aligns with the values of the EBU\". Read more:Spain votes to boycott Eurovision if Israel competesVienna chosen to host Eurovision Song Contest 2026 Whether Spain abides by the outcome of next month's vote might have the biggest impact. If it makes good on its threat to boycott - as one of the big five backers of Eurovision - financially it'll hurt. Ms Gorscak explained: \"Slovenia is a small country, and while our participation fee is peanuts, if there are more countries who are not participating it is seen in the budget.\" Israel's public broadcaster, KAN, has said its \"potential disqualification… could have wide-ranging implications for the competition and the values for which the EBU stands\". Dr Jordan said up until now we've mostly seen \"virtue signalling\" when it comes to Eurovision artists speaking out who've ultimately opted to perform regardless of their objections to Israel's inclusion on the night. However, should entire nations boycott in 2026, he said the impact will be felt way beyond the contest's final. \"There are two semi-finals, because of the number of participating countries, and if there isn't a need for two semi-finals that will impact upon the logistics of the event and even the funding,\" he explained. Pop bangers and power ballads aside, the criticism of the EBU has become deafeningly loud. The world waiting and watching for political decisions - and cultural ones too."
    },
    {
        "title": "The show might not go on: Broadway stars ready to strike",
        "description": "Broadway actors are preparing to exit the stage in a strike that would shutter more than 30 productions ahead of its peak season.",
        "url": "https://news.sky.com/story/the-show-might-not-go-on-broadway-stars-ready-to-strike-13441996",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lion-king-broadway_7037799.jpg?20251001003727",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-30 22:53:00",
        "Headline": "Following in the footsteps of Hollywood and the video game industry, New York's world-famous theatre district could soon fall victim to strike action.",
        "Content": "Broadway actors are preparing to exit the stage in a strike that would shutter more than 30 productions ahead of its peak season. Actors' Equity, a union representing 900 performers and stage managers in New York's iconic theatre scene, said a walkout was on the cards due to a dispute over healthcare. It's negotiating with the Broadway League, a trade body representing theatre owners, producers, and operators. A previous three-year contract expired earlier this week. The union wants the league to increase its contribution to its healthcare fund, which is expected to fall into a deficit before next May. The rate of contributions has remained unchanged for more than a decade. Actors' Equity president Brooke Shields said: \"Asking our employers to care for our bodies, and to pay their fair share toward our health insurance is not only reasonable and necessary, it's an investment they should want to make toward the long-term success of their businesses.\" She added: \"There are no Broadway shows without healthy Broadway actors and stage managers. And there are nohealthy actors and stage managers without safe workplaces and stable health insurance.\" The Broadway League said it was \"continuing good-faith negotiations\" to \"reach a fair agreement\" that works for \"shows, casts, crews, and the millions of people from around the world who come to experience Broadway.\" Read more from Sky News:Boyzone announce reunionJK Rowling hits out at Emma Watson Should Broadway fall victim to strike action, it would follow in the footsteps of Hollywood - where writers walked out in 2023, curtailing a number of major productions - and the US video game industry in 2025, with concerns around the use of AI a key driver. Actors' Equity has not carried out a major strike since 1968, when a three-day dispute shut down 19 shows. An intervention from the New York City mayor helped both sides come to a deal."
    },
    {
        "title": "Starmer's speech was one of his most successful moments - but biggest issue in UK politics was ignored",
        "description": "On its own terms, this was one of Sir Keir Starmer's most successful moments since becoming Labour leader in 2020.&#160;",
        "url": "https://news.sky.com/story/starmers-speech-was-one-of-his-most-successful-moments-but-biggest-issue-in-uk-politics-was-ignored-13441790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-victoria-starmer_7037596.jpg?20250930204628",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-09-30 19:00:00",
        "Headline": "Sir Keir Starmer gave his keynote speech to the Labour conference, where he attacked Reform and spoke about his working-class father.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  On its own terms, this was one of Sir Keir Starmer's most successful moments since becoming Labour leader in 2020.  Just in the nick of time, the prime minister delivered a speech that will steady his position in the party and arm Labour activists with new, clearer dividing lines with Reform UK. There's nothing like finding and cauterising an enemy to get the crowd back on side. He attacked \"snake oil merchants\" on the left and right - allowing some to question whether that is a category which includes Andy Burnham. Politics latest: PM says Farage 'doesn't like Britain' as he targets Reform And he worked out his principle policy attack on Reform UK: the plan to rip up the settled status of people who have lived in Britain for decades. In a move that one senior Labour figure described as a \"One Nation Labour\" credo, he gave a more credible account of his credentials as a champion of working people than he has managed in the past by invoking his family. 👉Listen to Politics At Sam And Anne's on your podcast app👈 Rather than pretend that the Oxford-educated barrister could play the role of a working-class hero, he pointed to the struggles of his father, brother and sister to emphasise he understands the lives of those outside the north London seat he represents.  The politics are striking. Sir Keir's team tell me that the speech was aimed at those in Middle England who are tempted by Reform UK. But in an apparent change, it was also a speech that went down well with the soft left, who have been disappointed by Sir Keir for much of the year. Rather than moving into Reform UK territory, he spelt out why they were wrong in a set piece that might succeed in its aim of stopping the drift away of voters from Labour to the Lib Dems, Greens and others on the left. Yet for all of its success, the biggest issue in British politics was ignored. There continues to be a £20-30 billion black hole, which will define this year in British politics, yet this was not mentioned at all. There was a brief sort of acknowledgement of the need for fiscal rules - a lack of financial responsibility would hit working people, he argued. Read more:Was this one of the great Labour conference speeches?Renew Britain - but did it renew Starmer?  He also noted that businesses paid a lot in tax, though it was not clear that this amounted to a promise not to tax them further. But there was none of the pitch rolling for what continues to look like a massive moment at the budget on 26 November. Cabinet ministers say that there was a more urgent task of shoring him up and setting a direction to be done, that trumped the need to dwell on this impending problem. The issue is whether it marks a wider change in his premiership. The challenge for Sir Keir has always been whether he can execute policy that will change people's lives. His approach - the high-level chairman rather than interventionist chief executive - does not always yield the real change of his rhetoric. This will need to change for this government to truly be a success."
    },
    {
        "title": "Man charged with murder of his parents and brother after their bodies found at family home",
        "description": "A man has been charged with the murder of his parents and brother in Ireland.",
        "url": "https://news.sky.com/story/man-charged-with-murder-of-his-parents-and-brother-after-their-bodies-found-at-family-home-13441821",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-evan-oconnor-mark-oconnor_7037597.jpg?20250930204718",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-30 19:36:00",
        "Headline": "Their bodies were discovered at the property in Drumgowna, outside Tallanstown village in Co Louth, on Monday morning.",
        "Content": "A man has been charged with the murder of his parents and brother in Ireland. Robert O'Connor, 31, appeared in court over the deaths of his father Mark O'Connor, 54, mother Louise, 56, and 27-year-old brother Evan, who has additional needs. Their bodies were found at the family's home in Drumgowna, outside Tallanstown village in Co Louth, on Monday morning. At a special sitting on Tuesday evening, Drogheda District Court heard O'Connor made no reply when police put the three counts of murder to him. Dressed in a grey coloured sweatshirt and black tracksuit bottoms, he was expressionless as he appeared in the dock. O'Connor has been with mental health services since he was 22, the court heard. Defence solicitor Paul Moore applied for a psychiatric assessment for his client, and also for legal aid. \n                  Trump gives Hamas peace deal deadline - as key allies including Qatar urge it to accept\n                 \n                  Ukraine war latest: Russia is losing, US envoy says - after Putin issues defiant message\n                 \n                  Princess Anne makes surprise Ukraine visit - and leaves a personal tribute\n                 There was no application for bail. O'Connor was remanded into custody by Judge Stephanie Coggans. The defendant is due to appear in the same court via videolink on 6 October."
    },
    {
        "title": "Sir Keir Starmer says he will take 'no more lectures' from Nigel Farage - and warns of 'fight for the soul of our country'",
        "description": "Sir Keir Starmer has said he will take \"no more lectures\" from Nigel Farage, as he warned that the next four years will be \"a fight for the soul of our country\" against Reform UK.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-he-will-take-no-more-lectures-from-nigel-farage-and-warns-of-fight-for-the-soul-of-our-country-13441674",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-labour_7037259.jpg?20250930215920",
        "type": "UK",
        "Author": "Ben Bloch",
        "Date Published": "2025-09-30 15:31:00",
        "Headline": "The prime minister launched a lengthy attack on Reform UK in his Labour Party conference speech, as he set out his vision for \"national renewal\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n  Sir Keir Starmer has said he will take \"no more lectures\" from Nigel Farage, as he warned that the next four years will be \"a fight for the soul of our country\" against Reform UK. In a speech setting out his vision of \"national renewal\" for Britain, the prime minister hit out at \"snake oil merchants on the right, on the left\", and questioned whether Mr Farage and his party \"genuinely love our country\". Sir Keir also asked for \"patience\" as he implements the \"change\" he has promised, which comes after a challenging first 14 months in power, with Reform UK continuing to top the opinion polls, and dissent within his own party in the form of a series of interviews by Greater Manchester mayor Andy Burnham criticising the direction of the government. In an hour-long speech at the Labour Party conference, the prime minister declared that the UK is at \"a fork in the road\", saying: \"We can choose decency, or we can choose division; renewal or decline; a country proud of its values, in control of its future, or one that succumbs against the grain of our history to the politics of grievance. It is a test, a fight for the soul of our country.\" Sir Keir argued the \"path of renewal\" he wants to set the country on is \"long\", and \"requires decisions that are not cost-free or easy, decisions that will not always be comfortable for our party\". But the reward, he said, is \"a new country, a fairer country, a land of dignity and respect\". Analysis: Speech a success for PM - but biggest issue in UK politics ignored  He hit out at politicians who \"tell you there's a quick fix, a miracle cure, tax cuts that magically pay for themselves, a wealth tax that somehow solves every problem\". \"We can all see these snake oil merchants on the right, on the left, but be in no doubt, none of them have any interest in national renewal because decline is good for their business,\" the prime minister said.  Starmer calls on party to 'fight Reform' In a lengthy attack directly on Reform UK, Sir Keir said: \"Think about it, when was the last time that you heard Nigel Farage say anything positive about Britain's future? He can't. He doesn't like Britain, doesn't believe in Britain, wants you to doubt it just as much as he does. So he resorts to grievance.\" He continued: \"The question I ask seriously of Nigel Farage and Reform is, do they love our country? Do they want to serve our country? All of it - our beautiful, tolerant, diverse country, every region, nation and city? Or do they just want to stir the pot of division?\"  He issued a rallying cry to the Labour Party to \"fight Reform with everything that this movement has\". He went on: \"If you are a patriot, whether you vote Labour or not, if you want to stand against grievance and renew Britain, then this is your fight too. Because even in a world this dangerous, I do think the politics of grievance is the biggest threat we face because it attacks who we are.\" The prime minister added that he will \"fight with every breath I have, fight for working people, fight for the tolerant, decent, respectful Britain that I know\".  Starmer is 'unfit to be PM' In response, Mr Farage said in a video message online: \"I used to think the prime minister was a decent man, somebody that I could talk to and chat to. We might disagree on worldview, but I thought he was a profoundly decent human being. \"I am completely shocked at his behaviour. I hope when he wakes up tomorrow morning, he feels ashamed of what he has done. \"This is a desperate last throw of the dice for the prime minister, who's in deep trouble. A prime minister who can't even command the support of half of his own party. But I'm sorry to say, I now believe he is unfit to be the prime minister of our country.\"  The Conservative Party barely got a mention in the hour-long speech, underscoring where Sir Keir believes the battle lines will be drawn at the next general election, expected in 2029. But speaking to broadcasters afterwards, party leader Kemi Badenoch said: \"I just thought it was really extraordinary that Keir Starmer could not explain how he was going to improve the economy.\" She described the fight between Sir Keir and Mr Farage as \"two boys squabbling in the playground\", and said she wants to focus on how \"the people in government can make life better\". Read more:Farage on course to be next PM, mega poll projectsAlmost two in three Labour members back Burnham over StarmerStreeting says Labour 'need Angela Rayner back' PM sets out the 'purpose' of his government As he declared Reform UK \"the enemy of national renewal\", Sir Keir set out his vision of the future of the country, saying: \"At the end of this hard road, there will be a new country, a fairer country, a land of dignity and respect. Everyone seen. Everyone valued. \"Wealth creation in every single community. Working people in control of their public services. The mindless bureaucracy that chokes enterprise removed, so we can build and keep building. Clean British energy powering our homes. Technology harnessed to drive us forward. Our flags flying proudly as we celebrate difference and oppose racism.\" He acknowledged that the public is \"losing faith\", and people are feeling \"ground down\", saying: \"Politics has made them question Britain. And could you blame them? They've been nothing but patient.\"  The prime minister said Britain is not \"broken\" - something he has previously argued himself - but said that his solution to the problems Britain faces is an economy working \"from the grassroots\", secure borders and controlled migration, and public and private investment in everything from education to infrastructure. \"Every decision\" the government has made in the past 14 months has been about \"changing the way we create wealth, reforming public services, giving people more control over our future\", he argued. 👉Listen to Politics At Sam And Anne's on your podcast app👈 The prime minister announced \"NHS Online\", which will allow patients to access prescriptions, book scans and tests, receive clinical advice, and manage appointments through the NHS app. And he also announced he is scrapping the Blair-era target of 50% of all young people going to university, in favour of two-thirds going to either universities or \"gold-standard apprenticeships\". Concluding his speech, the prime minister said: \"People say that a nation like ours can't be a community - that it is too diverse, too divided. I reject that. That goes against everything I stand for, everything I've served, everything I understand about this great country that I love. \"So no matter how many times people tell me it can't be done, I believe Britain can come together, that we can pursue a shared destination, that we can unite around the common good. That is my ambition. \"The purpose of this government - end decline, reform our public services, grow our economy from the grassroots and with resolve, with respect, with a flag in our hands, we will renew this country until we can say with total conviction that Britain is built for all.\""
    },
    {
        "title": "Starmer's speech was one of his most successful moments - but biggest issue in UK politics was ignored",
        "description": "On its own terms, this was one of Sir Keir Starmer's most successful moments since becoming Labour leader in 2020.&#160;",
        "url": "https://news.sky.com/story/starmers-speech-was-one-of-his-most-successful-moments-but-biggest-issue-in-uk-politics-was-ignored-13441790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-victoria-starmer_7037596.jpg?20250930204628",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-09-30 19:00:00",
        "Headline": "Sir Keir Starmer gave his keynote speech to the Labour conference, where he attacked Reform and spoke about his working-class father.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  On its own terms, this was one of Sir Keir Starmer's most successful moments since becoming Labour leader in 2020.  Just in the nick of time, the prime minister delivered a speech that will steady his position in the party and arm Labour activists with new, clearer dividing lines with Reform UK. There's nothing like finding and cauterising an enemy to get the crowd back on side. He attacked \"snake oil merchants\" on the left and right - allowing some to question whether that is a category which includes Andy Burnham. Politics latest: PM says Farage 'doesn't like Britain' as he targets Reform And he worked out his principle policy attack on Reform UK: the plan to rip up the settled status of people who have lived in Britain for decades. In a move that one senior Labour figure described as a \"One Nation Labour\" credo, he gave a more credible account of his credentials as a champion of working people than he has managed in the past by invoking his family. 👉Listen to Politics At Sam And Anne's on your podcast app👈 Rather than pretend that the Oxford-educated barrister could play the role of a working-class hero, he pointed to the struggles of his father, brother and sister to emphasise he understands the lives of those outside the north London seat he represents.  The politics are striking. Sir Keir's team tell me that the speech was aimed at those in Middle England who are tempted by Reform UK. But in an apparent change, it was also a speech that went down well with the soft left, who have been disappointed by Sir Keir for much of the year. Rather than moving into Reform UK territory, he spelt out why they were wrong in a set piece that might succeed in its aim of stopping the drift away of voters from Labour to the Lib Dems, Greens and others on the left. Yet for all of its success, the biggest issue in British politics was ignored. There continues to be a £20-30 billion black hole, which will define this year in British politics, yet this was not mentioned at all. There was a brief sort of acknowledgement of the need for fiscal rules - a lack of financial responsibility would hit working people, he argued. Read more:Was this one of the great Labour conference speeches?Renew Britain - but did it renew Starmer?  He also noted that businesses paid a lot in tax, though it was not clear that this amounted to a promise not to tax them further. But there was none of the pitch rolling for what continues to look like a massive moment at the budget on 26 November. Cabinet ministers say that there was a more urgent task of shoring him up and setting a direction to be done, that trumped the need to dwell on this impending problem. The issue is whether it marks a wider change in his premiership. The challenge for Sir Keir has always been whether he can execute policy that will change people's lives. His approach - the high-level chairman rather than interventionist chief executive - does not always yield the real change of his rhetoric. This will need to change for this government to truly be a success."
    },
    {
        "title": "Princess Anne makes surprise Ukraine visit - and leaves a personal tribute",
        "description": "Princess Anne has placed a toy bear as a poignant tribute at a children's memorial in Ukraine, during an unexpected visit to the war-ravaged country where she also met Volodymyr Zelenskyy.",
        "url": "https://news.sky.com/story/princess-anne-make-surprise-ukraine-visit-and-leaves-a-personal-tribute-13441963",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-princess-anne-volodymyr-zelenskyy_7037752.jpg?20250930223358",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-30 20:58:00",
        "Headline": "The Princess Royal met Volodymyr Zelenskyy to discuss the UK's support for Ukraine and the country's ongoing resistance against Russia.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Princess Anne has placed a toy bear as a poignant tribute at a children's memorial in Ukraine, during an unexpected visit to the war-ravaged country where she also met Volodymyr Zelenskyy. The King's sister travelled to the capital Kyiv on Tuesday, at the request of the Foreign Office, in a show of solidarity with children and families facing the horrors of the Russian invasion. The Princess Royal met Mr Zelenskyy to discuss the UK's support for Ukraine and its ongoing resistance. Anne's secret visit, which was not publicised beforehand for security reasons, came just two days after a Russian aerial bombardment killed at least four people in Kyiv, including a 12-year-old girl, and injured at least 70 others. The attack, which lasted more than 12 hours, was one of the heaviest in recent months. The purpose of her trip was to highlight the traumatic experiences of children living on the frontline, Buckingham Palace said. Joining First Lady Olena Zelenska at the children's memorial, Anne left the teddy in tribute to youngsters killed in the conflict, saying her daughter Zara Tindall had the same bear. As the 75-year-old princess stepped back after placing the traditional-looking teddy at the base of the memorial alongside scores of other cuddly toys, she told Mrs Zelenska: \"That was one that my daughter had.\" Mrs Zelenska also left a bear in tribute. The site commemorates more than 650 children who have died since the start of the conflict in 2022. In Kyiv, she also met female police and armed forces representatives and heard about their key role protecting women and children. Visiting the Child Rights Protection Centre, she spoke to families and children who have been returned and reintegrated, and met some of those working to return more Ukrainian children. Read more:Putin issues defiant message over UkraineMoldova's pro-EU party wins elections against Russia-leaning rivals More than 19,500 Ukrainian children have been forcibly transferred or deported by the Russian authorities to Russia and the occupied territories of Ukraine. Princess Anne is the second working royal to visit Ukraine. In April last year, the Duchess of Edinburgh was the first to go and bring a letter of support from the King. Anne's trip also follows that of her nephew Prince Harry, who made a surprise visit to the Ukrainian capital just over two weeks ago with a team from his Invictus Games Foundation. Anne also visited a rehabilitation centre, where she met Ukrainian veterans returning from the frontline. The King has met Mr Zelenskyy a number of times and marked the country's independence day in August by sending a message of solidarity. During Donald Trump's recent state visit to the UK, Charles also took the opportunity to stress the importance of supporting Ukraine. He told the US president in his banquet speech: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine, to deter aggression and secure peace.\""
    },
    {
        "title": "Britain's asylum seeker capital - where the mood appears to be shifting",
        "description": "\"I am proud to be Scottish. I don't want them here.\"",
        "url": "https://news.sky.com/story/they-are-not-stealing-your-jobs-britains-asylum-seeker-capital-divided-as-tensions-rise-13436248",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gillies-glasgow_7029830.jpg?20250923212933",
        "type": "UK",
        "Author": "Connor Gillies",
        "Date Published": "2025-09-30 01:20:00",
        "Headline": "Glasgow takes in more asylum seekers than any other city - but its leaders want to halt its participation in the Home Office \"dispersal\" system as it struggles with demand and cost.",
        "Content": "\n          Scotland correspondent\n              @ConnorGillies\n  \"I am proud to be Scottish. I don't want them here.\" Standing on the balcony of his flat in Glasgow, George drapes the saltire Scottish flag as he explains his anti-immigration stance. \"We can't afford to keep all these people coming in,\" he says. \"There's too many people coming in.\" George, who lives on the Wyndford estate in Glasgow's Maryhill, is not alone. Warning: This report contains material some may find offensive. Streets across the city are filling with white and blue flags hanging from lampposts. Immigration has not been centre stage in Scottish politics for many years - but the mood appears to be shifting. Glasgow is the frontline of the UK's immigration system, with more arrivals than anywhere else. With community tensions spiking and accommodation costs rising to £4.5m a month, the city's leaders are demanding a pause on relocations. Glasgow's financial burden spirals In 1999, the city signed up to the UK's \"dispersal\" system, which saw asylum seekers relocated by the Home Office in exchange for cash. It was a bygone era, when Glasgow's high-rise housing was in abundance and modern pressures were less acute. The landscape has changed drastically, with many tower blocks flattened amid regeneration. Once an asylum seeker is given the right to stay in the UK, they become a refugee and switch from being the responsibility of the Home Office to the local authority. While immigration is controlled by Westminster, housing and healthcare are among the issues dealt with by the Scottish government. Scotland's homelessness legislation means councils must house anyone without a home. It is a more generous policy than in England, where usually only those with \"priority need\" are given a roof over their head. It is suggested the Scottish policy is drawing people to Glasgow at the same time the Home Office is \"mass processing\" a backlog of asylum cases and granting some the right to stay in the UK. Latest figures show Glasgow was the local authority with the highest proportion of housed asylum seekers at 59 per 10,000 inhabitants (a total of 3,716). City officials argue the issues are coming together to create a crisis, with the financial burden spiralling. Councillors are pleading for more financial assistance from Westminster, but so far that has not been forthcoming. 'We will be the underdogs' Scotland has traditionally been seen as a left-leaning nation where inward migration is welcomed. The tourism industry relies heavily on people coming to work, and it is no secret that Brexit caused issues for hospitality staffing. The issue has not dominated the public conversation in Scotland, but polls suggest, for the first time in a long while, it is a rising concern. It is still not a priority for most Scots - but it is beginning to seep into the narrative. Up the road from where George lives in Maryhill, we come across an 84-year-old woman who asks us not to show her face on camera. Immigration is \"getting out of control\", she says. \"It looks like they are going to overspill us,\" she says. \"We will be the underdogs.\" When challenged on her evidence for her claims, she responds: \"I don't have any evidence\". Asked what she means by \"they\", she says: \"All the ones that are coming in, especially Muslims.\" She said she was not racist but was instead saying \"just truth\" and \"my opinion\". We meet Audrey Cameron, a mother whose children have additional learning needs. She told me: \"I've got an older son who lives with me who can't get a house, but yet you come in to this country, and you get a house no bother. I know people say they don't, but they do. \"There is more black and every other colour than there is white.\" When challenged that others may think a multicultural society is something that should be welcomed, Ms Cameron says: \"We don't have the infrastructure for it. \"We don't have the housing. Even trying to get a doctor's appointment is a nightmare. There has to be a limit. \"There are too many immigrants in this area. They are not spread out. They are all congregated.\" 'They are not stealing your jobs' Andy Sirel, a leading immigration lawyer and co-founder of Just Right Scotland, tells Sky News that misinformation is fuelling the public discourse and politicians need to act. He says: \"When a person is in the United Kingdom, they are not allowed to work, they are not allowed to claim benefits, they are not stealing your jobs. \"If they are in a hotel, which they don't want to be in, they are on £9 a week. It is simply not true the narrative that is being put out. \"The issue is being used as a scapegoat by various political actors. \"It is predicated on immigration, or higher levels of immigration, being why the standard of living has dropped and the reason public services are suffering, which is simply not the case.\" The town with deep divides over immigration Falkirk is a mid-size town with a population of approximately 150,000, around 30 miles from Glasgow city centre.It has become a flashpoint for protest between pro and anti-immigration groups. A dilapidated and crumbling old hotel, the Cladhan, is home to dozens of mostly men in their 20s, 30s and 40s awaiting their asylum cases being heard. The Home Office pays for accommodation, meals and financial allowances for asylum seekers, given the rules banning them seeking employment. A brick was thrown through a window recently in an attack Scotland's First Minister John Swinney branded \"despicable\". During a rally outside the hotel, Sky News filmed one man performing a Nazi salute, while a banner was held up saying \"Kill 'Em All, Let God Sort 'Em Out\". Others, from the community group Falkirk For All, chanted \"refugees are welcome here\". \"We are standing up against the scapegoating of refugees. [We are] standing up against racism,\" Georgia Henderson from the group said. \"We have been shocked by what we saw. We are highly motivated to turn up and protect the people of the hotel.\" Dr Teresa Piacentini, an expert in migration from Glasgow University, said many people are misinformed when discussing this issue. She said: \"Claiming asylum is a right. To claim asylum is not to do something illegal. You have a legal entitlement to claim asylum. \"People that are being held in the asylum hotels have claimed asylum so are exercising a right to be here. And while their asylum claim is being processed, they are here legally. \"Illegal has become a convenient catch-all phrase that doesn't actually reveal the complexity and nuance behind it.\" Tensions in Falkirk have been heightened since a former resident of the asylum hotel raped a 15-year-old girl in the town. Asylum seeker Sadeq Nikzad, 29, was jailed for nine years in June. We spoke to two men who are currently living in the hotel after being bussed up to Falkirk from London. Nechirvan, 31, arrived in March 2024 after crossing the English Channel. He says he fled Iraq and had been living in Europe, mostly Germany, for 10 years before making the journey to the UK. He claims he \"couldn't stay\" on the continent any more because \"they are deporting people\". Asked whether he understands the anger from some that it is mostly young men entering on small boats, he says: \"We are not safe in our country. \"It is not easy. Not easy for family to cross the water. That's why they not bring the family.\" Nechirvan describes sleepless nights as protests ramp up outside the asylum hotel. Another asylum seeker living in Falkirk, who did not want to be identified, says he came to the UK from West Africa. In response to rising tensions, he says: \"I don't blame anybody. People have some valid reasons to feel angry but what is important is that we are all human beings.\" \"You cannot put everyone in one category, classing everyone as racist,\" he adds. \"What I know is people have valid reasons, but not everyone in the hotel is bad. Some of the people if you listen to what they went through, you'd sympathise with them. \"You may have your own reasons for doing what you are doing but let's just live peacefully.\" The Home Office told Sky News it is attempting to reduce the number of people in hotels. A spokesman said: \"This government inherited a broken asylum and immigration system. We are taking practical steps to turn that chaos around - including doubling asylum decision-making to clear the backlog left by the previous government and reducing the number of people in hotels by 6,000 in the first half of 2025. \"We continue to work with local councils, NGOs and other stakeholders to ensure any necessary assistance is provided for those individuals who are granted refugee status.\""
    },
    {
        "title": "Nine officers at UK's busiest police station suspended amid gross misconduct investigation",
        "description": "Nine officers at the UK's busiest police station could be sacked in an investigation into allegations of excessive force on prisoners, misogyny and inappropriate behaviour.",
        "url": "https://news.sky.com/story/nine-officers-at-uks-busiest-police-station-suspended-amid-gross-misconduct-investigation-13441731",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-charing-cross-police-station_7037480.jpg?20250930181118",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-09-30 16:58:00",
        "Headline": "The accusations against officers at Charing Cross police station include excessive use of force on prisoners and making discriminatory and misogynistic comments. The incidents are alleged to have happened on and off duty between August 2024 and January 2025.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n Nine officers at the UK's busiest police station could be sacked in an investigation into allegations of excessive force on prisoners, misogyny and inappropriate behaviour. One officer, a police constable, is also being investigated for the potential criminal offence of perverting the course of justice. The officers, from Charing Cross police station near Trafalgar Square in central London, have been suspended by Scotland Yard. They are the subject of a gross misconduct investigation by the watchdog the Independent Office for Police Conduct (IOPC).  Two others, a former Met officer and a civilian staff worker, are also facing the same disciplinary charge which could lead to dismissal. Another serving officer has been told they are no longer being investigated because it was thought their behaviour did not breach professional standards. The Metropolitan force, the UK's biggest, was told of the allegations three weeks ago, which include excessive use of force, making discriminatory and misogynistic comments, and failing to report or challenge inappropriate behaviour. The incidents are alleged to have happened on and off duty between August 2024 and January 2025. Read more from Sky News:Hurricanes to bring heavy rain and strong winds to UKMachete sold to Southport killer was 'just another product' - retailer Matter 'taken extremely seriously' IOPC director Amanda Rowe said: \"Having advised the individuals they are under investigation we will now be securing initial accounts from them. We are treating this matter extremely seriously and have a team of investigators carrying out enquiries. \"Given the volume of CCTV footage and the number of individuals involved, it will take time to obtain and review all of the evidence, however we want to reassure the public that we are working hard to progress enquiries as quickly as possible. \"We have identified and are contacting members of the public involved to inform them of our investigation and explain our role and we will be speaking to them in due course.\" Watchdog appeals for information The IOPC said it had appealed to Met police officers and staff for any information about bad conduct at the Charing Cross custody suite. When the allegations emerged three weeks ago, Met Police Assistant Commissioner Matt Twist described them as \"disgraceful\". He said the Met was taking \"immediate steps to dismantle the current custody team at this station, significantly changing the leadership in our custody command and the Westminster leadership team\". Three years ago, the IOPC issued wide-ranging recommendations to the Met to change policing practices after a series of investigations found evidence of bullying, discrimination, and offensive social media messages, predominately among officers at Charing Cross."
    },
    {
        "title": "Wes Streeting says Labour 'need Angela Rayner back'",
        "description": "Wes Streeting has paid tribute to Angela Rayner and said Labour \"wants her back and needs her back\". ",
        "url": "https://news.sky.com/story/wes-streeting-says-labour-need-angela-rayner-back-13441507",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rayner-streeting-labour-party-conference_7037117.jpg?20250930132209",
        "type": "UK",
        "Author": "Faye Brown, political reporter",
        "Date Published": "2025-09-30 11:09:00",
        "Headline": "The health secretary heaped praise on his former colleague in a speech otherwise dominated by scathing attacks on \"snake oil salesman\" Nigel Farage.",
        "Content": "By Faye Brown, political reporter    Wes Streeting has paid tribute to Angela Rayner and said Labour \"wants her back and needs her back\".  The health secretary heaped praise on his former cabinet colleague during a wide-ranging speech at the annual party conference, which was packed with attacks on Reform UK leader Nigel Farage. Ms Rayner resigned as deputy party leader and housing secretary after a row about her tax affairs earlier this month. Politics Live: Day three of annual Labour conference  Addressing members gathered in Liverpool, Mr Streeting said Labour's new fair pay agreement for care workers could not have been achieved without her. He said: \"There's someone else who's made a real difference, who understands the struggle care workers face because she was one. \"She brought that experience to the cabinet table as the care worker who became our country's deputy prime minister. Angela Rayner, this achievement is yours. Thank you.\" There was a big round of applause as Mr Streeting added: \"And we want her back as well. We'll definitely make sure she sees that. We need her back.\" The message could be seen as trying to get grassroots members onside amid grim polling predictions for Labour and questions over whether Sir Keir Starmer can survive. Ms Rayner is popular with the Labour membership - they elected her as deputy leader in 2020, but she gave up this position as well as her cabinet roles when it emerged she had underpaid stamp duty on a flat in Hove. Read More:Labour 2-0 down and budget 'pivotal', says Sadiq KhanAlmost two in three Labour members back Burnham - poll In his speech, Mr Streeting also praised the Unison and GMB unions for standing up for care workers. However, that was as far as his good will stretched - as he launched several stinging attacks on his opponents. Farage 'snake oil salesman' The cabinet minister, seen as one of the government's best communicators, accused Mr Farage of being the \"snake oil salesman\" of British politics and vowed to send him \"packing\" at the next election. He argued that while Labour wants to modernise the NHS - with plans for an \"online\" hospital - the Reform leader wants an insurance system that \"checks your pockets before your pulse\". \"It might be right for Mr Moneybags. We know he can afford it. But what about those who can't?\" Mr Streeting asked. \"Be in no doubt. It's not reform he's offering. It's a retreat. If that's the fight Farage wants, I say bring it.\" Mr Farage has previously spoken about being open to an insurance based model for the NHS, drawing a big dividing line with the Labour Party, which founded the National Health Service after the Second World War. Mr Streeting said the party must win another fight too, \"against the poison of post-truth politics\". He pointed to Reform's recent conference, where a \"discredited doctor claimed that the COVID vaccine gave our Royal Family cancer\". \"This man wasn't just some fringe figure, he's Reform's health adviser. These anti-vax lies have consequences, they've led to the return of diseases we thought we had defeated,\" said Mr Streeting. \"Nigel Farage is a snake oil salesman of British politics and it's time to stop buying what he's selling.\" A Reform spokesperson previously said the doctor was a \"guest speaker with his own opinions who has an advisory role in the US government\". \"Reform UK does not endorse what he said but does believe in free speech,\" they added. Trouble ahead Mr Streeting's speech reflects government efforts to ramp up its rhetoric against Reform UK, after two major polls predicted the insurgent party will win the next general election as fed-up voters abandon mainstream politics. While that is many years away, some MPs see the devolved and local elections next May as a crunch test that could determine Sir Keir's political survival. Mr Streeting acknowledged this threat, saying it is not just Mr Farage Labour would \"send packing\". He said: \"Whether it's English nationalism with Reform, Scottish nationalism with the SNP or Welsh nationalism with Plaid we'll take them all on.\" Mr Farage said attacks on him were a \"desperate last throw of the dice\" for a party in \"deep trouble\", adding: \"Never before have I seen one name that's dominated a conference so much - yes it's me, Nigel Farage.\""
    },
    {
        "title": "Scottish schools must have separate toilets for boys and girls",
        "description": "Scottish schools must provide separate toilets for boys and girls on the basis of biological sex, the government has said.",
        "url": "https://news.sky.com/story/scottish-schools-must-have-separate-toilets-for-boys-and-girls-13441405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-bathroom-toilets-school_7036886.jpg?20250930094753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-30 08:30:00",
        "Headline": "The updated guidance follows two landmark court rulings relating to single-sex spaces.",
        "Content": "Scottish schools must provide separate toilets for boys and girls on the basis of biological sex, the government has said. However, new guidance issued by Holyrood ministers says schools can also provide gender neutral toilets for transgender students. Schools had previously been told that pupils could use whichever toilet they felt most comfortable in. The updated guidance follows two landmark court rulings relating to single-sex spaces. In April, a judge ruled that schools in Scotland must provide single-sex toilets to pupils after some provided only gender neutral facilities. That came a week after the UK's Supreme Court unanimously ruled that the definition of a \"woman\" and \"sex\" in the Equality Act 2010 refers to \"a biological woman and biological sex\". Monday's new guidance for schools says that \"separate toilet facilities for boys and girls must be provided in schools\". \n                  Student took his own life on graduation day after being mistakenly told he'd failed course\n                 \n                  Manhunt after woman raped in Luss car park on banks of Loch Lomond\n                 \n                  Surfer dies after being found unresponsive in sea off Cornish coast\n                 It adds: \"As the law stands, the facilities require to be made available on the basis of biological sex.\" It says schools should \"consider\" facilities for transgender pupils which \"may include the use of gender neutral provision\". The guidance additionally warns against the risk of \"outing\" a young person as transgender and urges schools to support those who \"want to live as a boy although their biological sex was female, or they now want to live as a girl, although their biological sex was male\". It says that denying this would have a \"detrimental impact on the young person's wellbeing, relationships and behaviour\". It adds: \"This may mean that it is necessary that practical arrangements such as enabling young people to use facilities outwith usual breaktimes, or for particular facilities to be available aligned to the young person's activities within school, to reduce visibility of them moving across and within the school building to access toilet or changing room facilities. \"Depending on the particular circumstances of individual pupils, schools may require to take legal advice on any approach or proposed approach.\" Read more:Fresh legal case launched after gender ruling For school uniforms, the Scottish government also says that \"forcing transgender young people to wear clothes which do not match their gender identity can be distressing for them and may constitute discrimination under the Equality Act 2010\". The Scottish Tories said the new guidance showed the Scottish government was \"dragging their heels\" on new rules for single-sex spaces. Roz McCall, the party's spokeswoman for children and young people, said: \"The Supreme Court ruling was clear, the legal definition of a woman is based on biological sex, and they are entitled to single-sex spaces. \"But instead of enforcing the law, the SNP have confused matters further by producing this contradictory and potentially harmful guidance that will make things more difficult for schools.\" Education secretary Jenny Gilruth said the rights of all children and young people \"must be respected in our schools\". She said: \"The Scottish government has made clear it accepts the Supreme Court ruling and since April has been taking forward the detailed work that is necessary as a consequence of the ruling. That work is ongoing. \"We have brought forward updates to guidance to provide clarity and confidence to teachers and staff as they work to support the mental, physical and emotional health of transgender young people in our schools following recent significant legal and policy developments.\" The guidance is not mandatory but advisory as the local authorities run the schools, not the Scottish government directly. It has been updated in response to the legal requirements. Ms Gilruth added: \"The Scottish government respects the rights of everybody. I want every pupil to be able to reach their potential and every pupil deserves our support to do that. Our guidance means that all of their individual needs will be respected. \"All schools are required to provide separate toilets for girls and boys. \"In addition, the guidance makes clear that councils should give careful consideration to the individual needs of transgender pupils in light of the school context and school community.\""
    },
    {
        "title": "Two hurricanes expected to bring heavy rain and strong winds to UK",
        "description": "The remnants of two hurricanes could bring heavy rains and strong winds to the UK this week as they cross the Atlantic.",
        "url": "https://news.sky.com/story/hurricanes-humberto-and-imelda-to-bring-heavy-rain-and-strong-winds-to-uk-13441437",
        "image_url": "https://e3.365dm.com/24/09/1920x1080/skynews-uk-weather-rain-waves_6697941.jpg?20240927105717",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-30 09:12:00",
        "Headline": "At the weekend there could be an interaction between Hurricane Humberto, currently near Bermuda, and Hurricane Imelda, at present east of Florida.",
        "Content": "The remnants of two hurricanes could bring heavy rains and strong winds to the UK this week as they cross the Atlantic. Rain will become heavier and more persistent, especially over western Scotland, where a Met Office yellow warning is in place from 5pm on Wednesday until 6am on Friday. Check the weather forecast where you are Sky News forecaster Chris England said there could be 75mm of rain in that area, with 100-150mm over west facing slopes, and up to 250mm in the wettest parts. Those conditions are likely to cause disruption. He said the weekend \"looks even more unsettled\", with the aftermath of Hurricane Humberto, currently near Bermuda, tracking nearby. On Saturday and Sunday there is a risk of heavy rain for most, severe gales around many coasts, and inland gales in parts of the north. It is not quite clear how things will play out, however, not least because of possible interactions with another hurricane - Imelda - which is currently east of Florida. Read more from Sky News:'They are not stealing your jobs': Asylum seeker capital dividedScottish schools must have separate toilets for boys and girls Chris Bulmer, deputy chief meteorologist at the Met Office, said the possible influence of Humberto and Imelda increased the \"risk of a deep low developing near the UK\". He said: \"If this materialises, we could see some very strong winds as well as further heavy rainfall Friday into Saturday, but at this time the development and track of this system remains uncertain. \"We're monitoring this closely.\" It is possible that further weather warnings could be issued later in the week."
    },
    {
        "title": "Trump gives Hamas peace deal deadline - as key allies including Qatar urge it to accept",
        "description": "Donald Trump has said Hamas has \"three or four days\" to respond to his Gaza peace plan - with Qatar, Egypt and Turkey reportedly urging the group to accept.",
        "url": "https://news.sky.com/story/trump-gives-hamas-peace-deal-deadline-as-key-allies-including-qatar-urge-it-to-accept-13441912",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-palestinians-gaza-smoke_7037039.jpg?20250930120330",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-30 20:56:00",
        "Headline": "Mr Trump says they are \"just waiting for Hamas\" and it would be a \"very sad end\" if the deal was rejected.",
        "Content": " Donald Trump has said Hamas has \"three or four days\" to respond to his Gaza peace plan - with Qatar, Egypt and Turkey reportedly urging the group to accept. The US president and Israeli Prime Minister Benjamin Netanyahu unveiled the 20-point proposal at the White House on Monday. Hamas has said it needs time to look at the details and consult with other Palestinian factions. Israel has agreed to the terms, which include an immediate ceasefire; the release of all hostages; Hamas disarming; a guarantee no one will be forced to leave Gaza; and a governing \"peace panel\" including Sir Tony Blair. Key mediators such as Qatar and Egypt have urged Hamas - who murdered more than 1,200 Israelis two years ago - to accept the deal, reported Axios. Other influential Muslim nations such as Jordan, the UAE, Indonesia, Pakistan and Saudi Arabia have also publicly backed it.  Speaking outside the White House on Tuesday, Mr Trump said they were \"just waiting for Hamas\" and it would be a \"very sad end\" if the deal was rejected. \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  Dozens of pro-Palestinian demonstrators arrested outside Labour conference, Merseyside Police says\n                 \n                  Watch moment diplomats walk out as Israeli PM Netanyahu speaks at UN\n                 One Hamas leader, Mahmoud Mardawi, was quoted in Middle Eastern outlets as saying the group will not agree a deal that does not include \"self-determination for the Palestinian people\". Mr Netanyahu has warned he will \"finish the job\" if Hamas refuses, while Mr Trump said he would \"let Israel go and do what they have to do\". Role for Blair 'like putting the arsonist in charge' However, the plan is seen as heavily favouring Israel and makes no commitment towards a two-state solution - something the Israeli leader has vowed will never happen. Other details, such as the inclusion of former UK prime minister Sir Tony, have also been criticised due to his pivotal role in the invasion of Iraq. Human rights activist Ashish Prashar - who said he worked with Sir Tony when he was a Middle East envoy - told Sky News' The World programme it was \"like putting the arsonist in charge of rebuilding the house he put on fire\" and \"there is no way Palestinians trust him\". However, Mr Trump called Sir Tony a \"good man\" - and Home Secretary Yvette Cooper told Sky's Sophy Ridge that Sir Tony had a \"record on a lot of international things\". Other members of the planned governing board are set to be announced in the coming days. More than 66,000 people in Gaza have now been killed in the war, according to the Hamas-run health ministry. The total does not differentiate between the number of fighters and civilians but the ministry has said about half are women and children.  At least another 31 Palestinians were killed in Israeli strikes on Tuesday, local hospitals said. Seventeen of them died in Netzarim, an Israeli-controlled corridor, while trying to get humanitarian aid. Another 33 were reportedly wounded in the incident, said al Awda hospital. Israeli strikes which hit tents in the region of Muwasi, previously deemed a safe zone, are said to have killed 10 people.  Al Aqsa hospital said seven of the victims died near Deir al Balah after earlier this month fleeing Gaza City, where Israel has launched a renewed offensive. The three others killed were from the same family; a man, his pregnant wife and their child. They were killed when an airstrike hit their tent west of Khan Younis, according to Nasser Hospital. Read more:Praise and fury for deal - but Hamas's first reaction is tellingWhat we know about Gaza peace plan The Israeli military did not immediately comment on the reports, but said it had struck more than 160 targets of Hamas infrastructure in the past 24 hours. It has repeatedly stressed it goes to great lengths to avoid civilian casualties but that Hamas deliberately embeds itself among the civilian population. Hamas is still believed to be holding 48 of the 251 hostages kidnapped during the 7 October attack, 20 of whom are believed to be alive."
    },
    {
        "title": "Princess Anne makes surprise Ukraine visit - and leaves a personal tribute",
        "description": "Princess Anne has placed a toy bear as a poignant tribute at a children's memorial in Ukraine, during an unexpected visit to the war-ravaged country where she also met Volodymyr Zelenskyy.",
        "url": "https://news.sky.com/story/princess-anne-make-surprise-ukraine-visit-and-leaves-a-personal-tribute-13441963",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-princess-anne-volodymyr-zelenskyy_7037752.jpg?20250930223358",
        "type": "World",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-09-30 20:58:00",
        "Headline": "The Princess Royal met Volodymyr Zelenskyy to discuss the UK's support for Ukraine and the country's ongoing resistance against Russia.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Princess Anne has placed a toy bear as a poignant tribute at a children's memorial in Ukraine, during an unexpected visit to the war-ravaged country where she also met Volodymyr Zelenskyy. The King's sister travelled to the capital Kyiv on Tuesday, at the request of the Foreign Office, in a show of solidarity with children and families facing the horrors of the Russian invasion. The Princess Royal met Mr Zelenskyy to discuss the UK's support for Ukraine and its ongoing resistance. Anne's secret visit, which was not publicised beforehand for security reasons, came just two days after a Russian aerial bombardment killed at least four people in Kyiv, including a 12-year-old girl, and injured at least 70 others. The attack, which lasted more than 12 hours, was one of the heaviest in recent months. The purpose of her trip was to highlight the traumatic experiences of children living on the frontline, Buckingham Palace said. Joining First Lady Olena Zelenska at the children's memorial, Anne left the teddy in tribute to youngsters killed in the conflict, saying her daughter Zara Tindall had the same bear. As the 75-year-old princess stepped back after placing the traditional-looking teddy at the base of the memorial alongside scores of other cuddly toys, she told Mrs Zelenska: \"That was one that my daughter had.\" Mrs Zelenska also left a bear in tribute. The site commemorates more than 650 children who have died since the start of the conflict in 2022. In Kyiv, she also met female police and armed forces representatives and heard about their key role protecting women and children. Visiting the Child Rights Protection Centre, she spoke to families and children who have been returned and reintegrated, and met some of those working to return more Ukrainian children. Read more:Putin issues defiant message over UkraineMoldova's pro-EU party wins elections against Russia-leaning rivals More than 19,500 Ukrainian children have been forcibly transferred or deported by the Russian authorities to Russia and the occupied territories of Ukraine. Princess Anne is the second working royal to visit Ukraine. In April last year, the Duchess of Edinburgh was the first to go and bring a letter of support from the King. Anne's trip also follows that of her nephew Prince Harry, who made a surprise visit to the Ukrainian capital just over two weeks ago with a team from his Invictus Games Foundation. Anne also visited a rehabilitation centre, where she met Ukrainian veterans returning from the frontline. The King has met Mr Zelenskyy a number of times and marked the country's independence day in August by sending a message of solidarity. During Donald Trump's recent state visit to the UK, Charles also took the opportunity to stress the importance of supporting Ukraine. He told the US president in his banquet speech: \"Today, as tyranny once again threatens Europe, we and our allies stand together in support of Ukraine, to deter aggression and secure peace.\""
    },
    {
        "title": "Why emergency Eurovision vote on Israel might not stop a broadcast boycott",
        "description": "Eurovision is supposed to be a celebration of the unifying power of music. But for the past two years, it has attracted protests and fan boycotts over its inclusion of Israel amid the country's continued military action in Gaza.",
        "url": "https://news.sky.com/story/why-emergency-eurovision-vote-on-israel-might-not-stop-a-broadcast-boycott-13441717",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eurovision-israel-gaza_7017931.jpg?20250930212636",
        "type": "World",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-30 16:18:00",
        "Headline": "A number of countries have vowed not to take part in Eurovision if Israel participates.",
        "Content": "\n          Arts and entertainment correspondent\n        Eurovision is supposed to be a celebration of the unifying power of music. But for the past two years, it has attracted protests and fan boycotts over its inclusion of Israel amid the country's continued military action in Gaza. Ahead of 2026's contest, while nobody has even sung a note yet, a number of countries have been getting vocal. \"If Israel is there, we won't be there,\" says Natalija Gorscak, the president of broadcaster RTV Slovenia. As the world waits to see what happens with the negotiations over Donald Trump's Gaza peace plan, within the cultural world, there's no let up in the increasing isolation of Israel. Slovenia and broadcasters from Spain, the Netherlands, Ireland, and Iceland have all issued statements saying if Israel's allowed to enter, they'll consider boycotting the contest next year. Jolted into action by the controversy, officials from the European Broadcasting Union (EBU) - which runs the contest - have announced plans for an emergency vote. In a letter to members, EBU president Delphine Ernotte-Cunci said \"given that the union has never faced a divisive situation like this before\", the board agreed it \"merited a broader democratic basis for a decision\". Described by the EBU as \"an extraordinary meeting of [its] general assembly to be held online\", early next month member countries will be asked to vote on whether Israel should or shouldn't participate. Eurovision expert Dr Paul Jordan said: \"Ultimately this has been a really challenging issue for the EBU. This is a really complex picture that is building up… and they've not been consistent. \"The situation is made even more complicated by the fact the organisers themselves haven't sometimes followed their own rules about political entries and about political messaging, and they've allowed certain countries to, in a sense, get away with breaking the rules or deeming them to have not broken the rules sufficiently to allow participation. \"As far as I'm aware, the Israeli broadcaster has not broken any rules. However, you could argue their inclusion could indeed bring the contest into disrepute, which would be against the organisers' rules.\" 'We should focus on music' In 2023, Israel was represented by Noa Kirel, her country's equivalent to Britney Spears. She came third with her song Unicorn. \"It was one of the highlights in my career, it was an incredible experience for me,\" she said. While she acknowledges \"it's very different from two years ago when I represented Israel\", she hopes her country won't be excluded next month. \"It's not about politics, it's never been like that, and we should keep it that way, to focus on music.\" She believes it would be unfair to punish the Israeli people for the actions of their government: \"Voters understand that politics has no connection to this competition. \"Hopefully people will understand and respect that, see the good side… and not the bad side.\" 'European policy needs more balls' Regardless of the outcome of next month's vote, Ireland, Iceland, and Slovenia have all confirmed to Sky News that their plans to boycott will stand as long as Israel's still at war. Ms Gorscak said: \"We can lie to ourselves and say 'no, it's not political' but, you know, you can't avoid politics.\" She believes it's fundamentally wrong for bigger countries to be sitting on the fence. \"We are all somehow prisoner of German guilt towards Israel,\" she claimed. \"European policy, it needs more balls. In certain moments somebody needs to decide, somebody needs to say 'this is enough'.\" A spokesperson for German broadcaster SWR has said it \"supports the consultation process that has been initiated\" and that the goal is \"to reach a well-founded and sustainable agreement that aligns with the values of the EBU\". Read more:Spain votes to boycott Eurovision if Israel competesVienna chosen to host Eurovision Song Contest 2026 Whether Spain abides by the outcome of next month's vote might have the biggest impact. If it makes good on its threat to boycott - as one of the big five backers of Eurovision - financially it'll hurt. Ms Gorscak explained: \"Slovenia is a small country, and while our participation fee is peanuts, if there are more countries who are not participating it is seen in the budget.\" Israel's public broadcaster, KAN, has said its \"potential disqualification… could have wide-ranging implications for the competition and the values for which the EBU stands\". Dr Jordan said up until now we've mostly seen \"virtue signalling\" when it comes to Eurovision artists speaking out who've ultimately opted to perform regardless of their objections to Israel's inclusion on the night. However, should entire nations boycott in 2026, he said the impact will be felt way beyond the contest's final. \"There are two semi-finals, because of the number of participating countries, and if there isn't a need for two semi-finals that will impact upon the logistics of the event and even the funding,\" he explained. Pop bangers and power ballads aside, the criticism of the EBU has become deafeningly loud. The world waiting and watching for political decisions - and cultural ones too."
    },
    {
        "title": "South African ambassador found dead outside Paris high-rise hotel",
        "description": "South Africa's ambassador to France has been found dead outside a high-rise hotel in Paris.",
        "url": "https://news.sky.com/story/south-african-ambassador-found-dead-at-foot-of-paris-high-rise-hotel-french-media-reports-13441560",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-south-africa-ambassador_7037185.jpg?20250930140521",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-30 12:46:00",
        "Headline": "The body of Nkosinathi Emmanuel \"Nathi\" Mthethwa was discovered at the foot of the Hyatt Regency hotel in the west of the French capital.",
        "Content": "South Africa's ambassador to France has been found dead outside a high-rise hotel in Paris. Nkosinathi Emmanuel \"Nathi\" Mthethwa, 58, had been reported missing by his wife on Monday after she got a text message from him that concerned her, the prosecutor's office in the French capital said. It added that the ambassador's body was discovered at the foot of the Hyatt Regency hotel in the west of the city. Mr Mthethwa had booked a room on the 22nd floor, the prosecutor's office said, adding that a secured window was forced open. The ambassador was believed to have killed himself, French media including newspaper Le Parisien reported, without citing a source. His death was called a \"national loss\" by South Africa's ministry of international relations, which said the circumstances were under investigation by French authorities. In his diplomatic role, to which he was appointed in December 2023, the ambassador was \"tasked with strengthening the vital partnership and bilateral ties between South Africa and France\", said the ministry. \"I have no doubt that his passing is not only a national loss but is also felt within the international diplomatic community,\" said minister of international relations, Ronald Lamola. 'Distinguished servant of the nation' The ministry also said in a statement: \"Ambassador Mthethwa was a distinguished servant of the nation, whose career was marked by dedicated service in critical ministerial portfolios.\" He was South Africa's minister of arts and culture from 2014 to 2019, adding sports to his portfolio from 2019 to 2023. Mr Mthethwa had been minister of safety and security from 2008 to 2009 and minister of police from 2009 to 2014. Read more from Sky News:Second ICE detainee dies after attack on Dallas facilityVenezuelan president expands his powers in case US attacks Mr Mthethwa also served on the board of directors for the 2010 FIFA World Cup local organising committee. He was a member of parliament from 2002 to 2023. The ministry of international relations said: \"His lifelong commitment to public duty was further exemplified by his longstanding contribution to the African National Congress through its highest decision-making structures.\" \"The government of South Africa extends its deepest and most sincere condolences to the family of Ambassador Mthethwa, and to his friends and colleagues during this period of immense grief. \"He is survived by his wife and children.\""
    },
    {
        "title": "Spain: Ibiza and Formentera hit by widespread flooding as red alert issued amid 'extraordinary danger'",
        "description": "The Spanish holiday islands of Ibiza and Formentera have been hit by widespread flooding.",
        "url": "https://news.sky.com/story/weather-ibiza-and-formentera-hit-by-widespread-flooding-as-red-alert-issued-amid-extraordinary-danger-13441688",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ibiza-flood-spain_7037347.jpg?20250930155247",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-30 15:52:00",
        "Headline": "Ibiza Town had 254mm of rain over the last 24 hours, with Ibiza airport recording 174mm and 109mm on Formentera, as of 8.30pm local time on Tuesday (7.30pm UK time).",
        "Content": " The Spanish holiday islands of Ibiza and Formentera have been hit by widespread flooding. The popular Mediterranean destinations were placed under \"red alert\" on Tuesday, as the country's national weather service AEMET warned of \"torrential rains\" and floods. As of 8.30pm local time on Tuesday (7.30pm UK time), Ibiza's capital Ibiza Town had seen 254mm of rain over the past 24 hours, with Ibiza airport recording 174mm. There was 109mm of rainfall recorded on Formentera in the same period.   The airport daily rainfall figure was the highest since 1952, while Ibiza Town and Formentera had the most rain in a day since 2015. Ibiza Town's 254mm was more than half what normally falls in the area in a whole year. AEMET had said on Tuesday that more than 180mm could fall in 12 hours, as the region was hit by the remnants of former Hurricane Gabrielle. The service warned of \"extraordinary danger\" as it issued the alert, which was in place until 4pm local time (3pm UK time). The Spanish military emergency unit (UME) has been deployed to the islands, with reinforcements expected from Majorca and Valencia, as afternoon school classes were suspended and medical appointments cancelled, according to the Majorca Daily Bulletin. It said residents on Ibiza and Formentera got a mass civil protection alert on their phones, warning of \"flooding risk due to torrential rain\" and urging people to avoid travel, stay indoors, and move to higher levels if water got into their homes. Ibiza airport has been hit by heavy rain, with significant leaks throughout the terminal, but operations have mostly continued as normal, according to the Majorca Daily Bulletin. It said some flights had to be diverted during the heaviest downpours. By midday local time (11am UK time), emergency services in Ibiza had responded to 132 incidents, including 78 in Ibiza Town. Most reports involved flooded streets and basements, fallen trees, and road closures. Ibiza firefighters have reportedly rescued about 15 people trapped in lifts, vehicles, and ground-floor properties due to severe flooding. Read more from Sky News:South African ambassador found dead outside Paris hotelHurricanes to bring heavy rain and strong winds to UK Jose Antonio Lopez, from the Ibiza council fire service, told IB3 Television that crews have dealt with about 50 flood-related incidents across the island so far. All bus services to and from Ibiza Town were suspended because of severe flooding that affected roads such as the E10 and various streets within the town. Sky's weather presenter Jo Robinson said: \"It's still raining across the south of the island, but there should be some improvement later this evening. \"Significant rainfall totals have been seen across eastern parts of Spain over the last few days due to torrential rain and thunderstorms from the remnants of Hurricane Gabrielle.\" She added: \"The weather will improve over Spain, with the rest of the week looking mainly fine and dry.\" Meanwhile, AEMET downgraded its rain alert for the eastern region of Valencia on the Spanish mainland. It was cut by two levels from red - its highest - to yellow, a day after torrential downpours forced schools across the region to close. Monday's red alert in Valencia brought back memories of October 2024, when flooding killed more than 230 people. Over half a million pupils in Valencia missed lessons on Monday as 243 local councils shut schools as a precaution, said the AFP news agency."
    },
    {
        "title": "Move to hold UEFA vote on Israel ban delayed while Donald Trump seeks Gaza deal",
        "description": "Moves for a UEFA vote on suspending Israel from European football are on hold while Donald Trump attempts to end the war in Gaza, Sky News understands.",
        "url": "https://news.sky.com/story/move-to-hold-uefa-vote-on-israel-ban-delayed-while-donald-trump-seeks-gaza-deal-13441625",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-israel-football_7037335.jpg?20250930153231",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-09-30 14:06:00",
        "Headline": "Pressure has been mounting on UEFA to ban Israeli teams from European football over the war in Gaza.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Moves for a UEFA vote on suspending Israel from European football are on hold while Donald Trump attempts to end the war in Gaza, Sky News understands. UEFA had been hearing last week of a growing clamour among UEFA executive committee members and within European FAs to kick out Israeli teams, sources said. But since then President Trump has unveiled a 20-point plan for peace to end two years of war, with talks underway to secure an agreement between Israel and Hamas for a deal. There is a belief among leaders in European football now that imposing sporting sanctions on Israel would not be the right move in the middle of peace talks. While some hoped for a UEFA executive committee vote on Israel, an emergency meeting is not understood to have been called. Sky News revealed last week that the Trump administration would step in to prevent Israel being banned and stopped from continuing in qualifying for the 2026 men's World Cup. Holding off on suspending Israel would allow the national team to play matches next month against Norway and Italy. \n                  Why emergency Eurovision vote on Israel might not stop a broadcast boycott\n                 \n                  Praise and fury for Trump's Gaza peace deal - but Hamas's first reaction is telling\n                 \n                  What we know about the Gaza peace plan – and what Sky News correspondents make of it\n                 Norway has been among the most vocal European nations about Israel remaining in sports competitions amid the destruction and devastation in Gaza. Profits from the match in Oslo will be given to help humanitarian workers provide aid in Gaza. But, announcing his squad today, manager Ståle Solbakken declined to discuss the conflict, saying he would only give his views on Israel after the match. Before then, in club football, Maccabi Tel Aviv's men are due to play Dinamo Zagreb in the Europa League on neutral territory in Serbia on Thursday.  A push to ban Israel intensified after a United Nations commission of inquiry said Israel has been committing genocide in Gaza. Israel has denied that, insisting it is fighting to eradicate Hamas and return hostages following the 7 October 2023 attacks. The Turkish Football Federation called for Israel to be banned by FIFA and UEFA. Norway's FA opposes a unilateral boycott, insisting that would only benefit Israel's qualification hopes. Israel was admitted as a full member of UEFA in 1994. The country began competing in the Asian Football Confederation in 1954 and qualified for the 1970 World Cup. But the team was then excluded from AFC tournaments from 1974 after countries had refused to play them. There has been no comment from UEFA on talks about banning Israel. The Israeli FA (IFA) hasn't commented this week on attempts to ban teams. But the IFA told Sky News that Reebok backed down from moves to end a deal to supply national team kits. The IFA said in a statement: \"After a conversation between IFA President, Moshe Zuares, Reebok and the local franchisee, the company reversed its decision to end its contract with Israel national teams, and the teams uniforms in international matches will feature the company's logo as it has been up to now.\" The claim was disputed by Reebok, with a spokesperson saying: \"Reebok is proud of our record as a unifier of all cultures on and off the pitch. Reports in local Israeli news outlets claiming that Reebok has directed the IFA to remove its logos from its national team kits are simply not true. \"We will continue to honour our brand's and our local licensee's commitment to the IFA. We don't do politics; we do sport.\" Russian teams have been banned by UEFA since the all-out war on Ukraine was launched in 2022 - with oppositions refusing to play them and security challenges."
    },
    {
        "title": "Man charged with murder of his parents and brother after their bodies found at family home",
        "description": "A man has been charged with the murder of his parents and brother in Ireland.",
        "url": "https://news.sky.com/story/man-charged-with-murder-of-his-parents-and-brother-after-their-bodies-found-at-family-home-13441821",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-evan-oconnor-mark-oconnor_7037597.jpg?20250930204718",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-30 19:36:00",
        "Headline": "Their bodies were discovered at the property in Drumgowna, outside Tallanstown village in Co Louth, on Monday morning.",
        "Content": "A man has been charged with the murder of his parents and brother in Ireland. Robert O'Connor, 31, appeared in court over the deaths of his father Mark O'Connor, 54, mother Louise, 56, and 27-year-old brother Evan, who has additional needs. Their bodies were found at the family's home in Drumgowna, outside Tallanstown village in Co Louth, on Monday morning. At a special sitting on Tuesday evening, Drogheda District Court heard O'Connor made no reply when police put the three counts of murder to him. Dressed in a grey coloured sweatshirt and black tracksuit bottoms, he was expressionless as he appeared in the dock. O'Connor has been with mental health services since he was 22, the court heard. Defence solicitor Paul Moore applied for a psychiatric assessment for his client, and also for legal aid. \n                  Trump gives Hamas peace deal deadline - as key allies including Qatar urge it to accept\n                 \n                  Ukraine war latest: Russia is losing, US envoy says - after Putin issues defiant message\n                 \n                  Princess Anne makes surprise Ukraine visit - and leaves a personal tribute\n                 There was no application for bail. O'Connor was remanded into custody by Judge Stephanie Coggans. The defendant is due to appear in the same court via videolink on 6 October."
    },
    {
        "title": "US government shutdown to begin within hours",
        "description": "The US government is hours away from shutting down for the first time in almost seven years after last-ditch Senate votes on funding plans fell short.",
        "url": "https://news.sky.com/story/us-government-on-brink-of-shutdown-13441990",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-us-shutdown_7037800.jpg?20251001010711",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 22:26:00",
        "Headline": "Donald Trump had threatened to lay off \"a lot of people\" as a result of the shutdown, which comes after Republicans and Democrats failed to agree on a funding package.",
        "Content": "The US government is hours away from shutting down for the first time in almost seven years after last-ditch Senate votes on funding plans fell short. Hundreds of thousands of federal workers deemed not essential for protecting people or property - such as law enforcement personnel - could be furloughed or laid off when the shutdown begins at midnight (5am UK time). Critical services, including social security payments and the postal service, will keep operating but may suffer from worker shortages, while national parks and museums could be among the sectors that close completely. It comes after rival Democrat and Republicans refused to budge in their stand-off over healthcare spending. A Democrat-led proposal to keep the government funded went down by 53 votes to 47 in the Senate, before the Republicans' one notched up 55 in favour - five short of the threshold needed to avert a shutdown. Unlike legislation, a simple majority isn't enough to pass a government funding bill. Following the votes in Washington DC on Tuesday night, the White House's budget office confirmed the shutdown would happen and said affected agencies \"should now execute their plans\". It blamed the Democrats, describing their position as \"untenable\". The opposition party wants to reverse cuts to the government's health insurance programme, Medicaid, which were passed earlier this summer. Senate majority leader John Thune, a Republican, accused the Democrats of taking federal workers \"hostage\". His Democrat counterpart, Senate minority leader Chuck Schumer, said the Republicans' funding package \"does absolutely nothing to solve the biggest health care crisis in America\". Trump threatens layoffs President Donald Trump was defiant ahead of the votes, and warned he could make \"irreversible\" cuts \"that are bad\" for the Democrats if the shutdown went ahead. He threatened to cut \"vast numbers of people out\" and \"programmes that they (the Democrats) like\". \"We'll be laying off a lot of people,\" he told reporters in the Oval Office on Tuesday. Tens of thousands of government employees have already been laid off this year, driven by the \"DOGE\" initiative that was spearheaded by Elon Musk upon Mr Trump's return to the White House. The last shutdown was in Mr Trump's first term, from December 2018 to January 2019, when he demanded money for his US-Mexico border wall. At 35 days, it was the longest on record. Mr Thune has expressed hope the latest shutdown will come to a much quicker conclusion, telling reporters: \"We can reopen tomorrow - all it takes is a handful of Democrats to join Republicans to pass the clean, nonpartisan funding bill that's in front of us.\" Before this week, the government had shut down 15 times since 1981. Most only last a few days. The Senate will hold further votes on the Republican and Democrat stopgap funding bills on Wednesday. What happens now? Immigration enforcement, air-traffic control, military operations, social security and law enforcement are among the services that will not be brought to a halt. However, should employees miss out on payslips as a result of a prolonged shutdown, they could be impacted by staffing shortages. For example, delays at airports. Cultural institutions deemed non-essential, like national parks and museums, will be more directly impacted from the very beginning, with large cuts to the workforce. The popular Smithsonian, for example, has said it only has enough funding to stay open for a week. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Hegseth and Trump declare end to 'woke' military - as defence secretary scolds 'fat troops'",
        "description": "The US defence secretary has said he is ending \"woke\" culture and political correctness, telling top brass: \"We are done with that s***.\"",
        "url": "https://news.sky.com/story/hegseth-and-trump-declare-end-to-woke-military-as-defence-secretary-scolds-fat-troops-13441681",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-pete-hegseth-donald-trump_7037278.jpg?20250930145333",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 15:47:00",
        "Headline": "Hundreds of US military officials had been summoned abruptly to the Marine Corps base without knowing why until Tuesday morning.",
        "Content": " The US defence secretary has said he is ending \"woke\" culture and political correctness, telling top brass: \"We are done with that s***.\" Pete Hegseth said diversity and inclusion policies would be rowed back, with changes including \"gender-neutral\" or \"male-level\" fitness standards for everyone. He also hit out at \"fat troops\" and said height and weight requirements would be brought in - as well as twice-yearly fitness tests. President Donald Trump was at the event and told reporters beforehand he was prepared to fire any generals or admirals he disliked \"on the spot\".   Speaking in Quantico, Virginia, he said the new approach was \"bringing back a focus on fitness, ability, character and strength [because] the purposes of American military is not to protect anyone's feelings\". Mr Hegseth drove home that message as he said the days of \"the woke department\" were over. \"The era of politically correct, overly sensitive don't-hurt-anyone's-feelings leadership ends right now at every level,\" he said. \"No more identity months, DEI offices, dudes in dresses, no more climate change worship, no more division, distraction or gender delusions,\" added the newly rebranded secretary of war. Mr Hegseth said the changes were not intended to stop women serving, but \"physical standards must be high and gender neutral\" for combat roles. \"If that means no women qualify for some combat jobs, so be it. That is not the intent, but it could be the result... It will also mean that we mean that weak men won't qualify because we're not playing games. This is combat. This is life or death.\" Hundreds of US military officials from around the world had been summoned abruptly to the Marine Corps base without knowing why until Tuesday morning. The gathering included admirals and generals called in from conflict zones in the Middle East. Mr Hegseth told them grooming standards would also be raised, with beards, long hair and \"individual expression\" now prohibited - \"the era of unprofessional appearance is over. No more beardos\", he said. \"We don't have a military full of Nordic pagans, but unfortunately, we have had leaders who either refuse to call BS and enforce standards or leaders who felt like they were not allowed to enforce standards,\" the defence secretary added. A review of how bullying and hazing are defined will also take place to \"empower leaders to enforce standards without fear of retribution or second guessing\". Toxic leadership has been suspected and confirmed in many military suicides in recent years, including the high-profile case of sailor Brandon Caserta who killed himself in 2018. The changes unveiled on Tuesday follow the recent rebranding of the US Department of Defense as the Department of War. Read more from Sky News:Second ICE detainee dies after attack on Dallas facilityUS president responds to Europe's Ryder Cup taunt President Trump said last month the name sent a \"message of strength\" - and his speech on Tuesday also lauded America's nuclear weapons capability. However, he said people shouldn't \"throw around\" the word. \"I call it the N-word. There are two N-words, and you can't use either of them,\" he told commanders. \"You don't have to be that good with nuclear,\" the president added. \"You could have one-twentieth what you have now and still do the damage that would be, you know, that'd be so horrendous.\" He cited his repositioning of nuclear submarines in August in response to comments by former Russian president Dmitry Medvedev. \"We were a little bit threatened by Russia recently, and I sent a submarine, nuclear submarine, the most lethal weapon ever made,\" Mr Trump said on Tuesday. \"Number one, you can't detect it. There's no way. We're 25 years ahead of Russia and China in submarines.\" \"Frankly, if it does get to use, we have more than anybody else,\" the president said of America's nuclear arsenal. \"We have better, we have newer, but it's something we don't ever want to even have to think about.\" US correspondent \"No more beardos,\" said Pete Hegseth. Of all the slogans that laced this presentation by America's defence secretary, the war on facial hair was the catchiest - even if it wasn't the most consequential. True, he wants US troops of the future to be clean shaven and trim (\"It's tiring to… see fat troops\"), but he also has broader ideas for the prototype, and it's not necessarily female. Combat troops would have to meet the \"highest male standard only\" of physical fitness. \"If that means no women qualify for combat roles, then so be it.\" It was one strand of a military reform that he laid out as a war on 'woke'. In a morning's presentation to US top brass, summoned from their posts around the world, he rolled back decades of military evolution – a consequence, he said, of \"ideological garbage\". Too many had been promoted for reasons of \"race, gender quotas and historic firsts\". This was a re-orientation of armed forces back towards an older school philosophy, that includes loosening the rules around discipline. Before an unprecedented gathering at Quantico Marine base of the country's top generals, the headline message will have resonated. Talk of \"common sense, maximum lethality and authority for war fighters\" is a scenario they signed up for. However, so did the 17% of active-duty personnel that's female, qualified by their brains, brawn and the fitness standards they have achieved in common with male comrades. Hegseth left the stage to silence - this was an audience of military generals, not paying punters. The reception for their commander-in-chief was similarly muted.  If Hegseth had given a career brief to raise eyebrows, so did the president. Donald Trump spoke of an \"invasion from within\" and of using \"dangerous cities\" as training grounds for the military National Guard. \"We're going to straighten them out one by one,\" he said, adding it would involve \"some people in this room\". It was a message delivered from the top to the highest level of the military, as the responsibilities of the US military are re-orientated under the Trump administration. In cities like Chicago, Portland and Los Angeles where they accuse Trump of re-purposing the country's military for domestic political purposes, they will have heard that as further evidence."
    },
    {
        "title": "The show might not go on: Broadway stars ready to strike",
        "description": "Broadway actors are preparing to exit the stage in a strike that would shutter more than 30 productions ahead of its peak season.",
        "url": "https://news.sky.com/story/the-show-might-not-go-on-broadway-stars-ready-to-strike-13441996",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lion-king-broadway_7037799.jpg?20251001003727",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 22:53:00",
        "Headline": "Following in the footsteps of Hollywood and the video game industry, New York's world-famous theatre district could soon fall victim to strike action.",
        "Content": "Broadway actors are preparing to exit the stage in a strike that would shutter more than 30 productions ahead of its peak season. Actors' Equity, a union representing 900 performers and stage managers in New York's iconic theatre scene, said a walkout was on the cards due to a dispute over healthcare. It's negotiating with the Broadway League, a trade body representing theatre owners, producers, and operators. A previous three-year contract expired earlier this week. The union wants the league to increase its contribution to its healthcare fund, which is expected to fall into a deficit before next May. The rate of contributions has remained unchanged for more than a decade. Actors' Equity president Brooke Shields said: \"Asking our employers to care for our bodies, and to pay their fair share toward our health insurance is not only reasonable and necessary, it's an investment they should want to make toward the long-term success of their businesses.\" She added: \"There are no Broadway shows without healthy Broadway actors and stage managers. And there are nohealthy actors and stage managers without safe workplaces and stable health insurance.\" The Broadway League said it was \"continuing good-faith negotiations\" to \"reach a fair agreement\" that works for \"shows, casts, crews, and the millions of people from around the world who come to experience Broadway.\" Read more from Sky News:Boyzone announce reunionJK Rowling hits out at Emma Watson Should Broadway fall victim to strike action, it would follow in the footsteps of Hollywood - where writers walked out in 2023, curtailing a number of major productions - and the US video game industry in 2025, with concerns around the use of AI a key driver. Actors' Equity has not carried out a major strike since 1968, when a three-day dispute shut down 19 shows. An intervention from the New York City mayor helped both sides come to a deal."
    },
    {
        "title": "Second ICE detainee dies after attack on Dallas facility, family says",
        "description": "The family of a Mexican man shot last week at an immigration and customs facility in Dallas say he's died, becoming the second detainee to be killed in the attack. ",
        "url": "https://news.sky.com/story/second-ice-detainee-dies-after-attack-on-facility-in-dallas-family-say-13441553",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ice-dallas-texas_7030616.jpg?20250924170820",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 12:29:00",
        "Headline": "Miguel Angel Garcia-Hernandez, 32, died from his injuries after being removed from life support, his family confirmed. ",
        "Content": "The family of a Mexican man shot last week at an immigration and customs facility in Dallas say he's died, becoming the second detainee to be killed in the attack.  Police previously said one person was killed and two critically injured after a gunman opened fire at an ICE field office in the Texas city last Wednesday. A bullet engraved with the phrase \"ANTI-ICE\" was found at the scene, the FBI said, with the attack being investigated as an act of \"targeted violence\". Miguel Angel Garcia-Hernandez, 32, died from his injuries after being removed from life support, his family confirmed in a statement shared by the League of United Latin American Citizens. He is understood to have been one of the two detainees left in a critical condition following the attack on 24 September. Officials previously said the first man killed was Norlan Guzman-Fuentes. A handwritten note was also recovered after the shooting detailing the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI said. \n                  'ANTI-ICE' engraved bullet found at scene of Dallas immigration centre shooting, FBI chief says\n                 \n                  What are the main conspiracy theories about JFK's assassination?\n                 \n                  Dallas shopping centre fire kills more than 500 animals in pet shop\n                 Joshua Jahn, 29, from Fairview in Texas, was found dead at the scene from a self-inflicted gunshot wound, said acting US attorney Nancy Larson. \"He very likely acted alone,\" she added. Read more:Driverless Waymo car makes illegal U-turn in CaliforniaVenezuelan President Nicolas Maduro expands his powers FBI director Kash Patel said the agency had seized devices and had processed \"writings\" obtained at the scene and in the suspect's home since the attack. A handwritten recovered note read: \"Hopefully this will give ICE agents real terror, to think: 'Is there a sniper with AP rounds on that roof?'\" Mr Patel said on X: \"While the investigation is ongoing, an initial review of the evidence shows an ideological motive behind this attack.\""
    },
    {
        "title": "YouTube to settle lawsuit with Trump over account suspension",
        "description": "YouTube has agreed to pay $24.5m (&#163;18.1m) to settle a lawsuit brought by Donald Trump after it banned his account following the January 6 Capitol riot.",
        "url": "https://news.sky.com/story/youtube-to-settle-lawsuit-with-trump-for-banning-his-account-13441323",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-youtube_7036722.jpg?20250930020950",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 00:28:00",
        "Headline": "YouTube was not the only platform to take action against Donald Trump over the deadly riot in Washington DC in 2021 - he was also suspended by Meta and Twitter, now X, before being reinstated several years later.",
        "Content": "YouTube has agreed to pay $24.5m (£18.1m) to settle a lawsuit brought by Donald Trump after it banned his account following the January 6 Capitol riot. The US president was suspended from the Google-owned platform over his role in the insurrection, which saw his supporters attempt to stop Joe Biden's 2020 election win from being ratified. More than four years on from the violent scenes that left a police officer dead, court documents filed on Monday revealed that $22m (£16.3m) from the settlement will go towards a trust for Washington DC's National Mall and the construction of a White House ballroom. The remainder will be paid to other parties involved in the case, including the American Conservative Union.  Google declined to comment on the reasons for the settlement, which does not constitute an admission of liability. Mr Trump's YouTube account has been back online since 2023. Read more from Sky News:Trump wants to govern Gaza with Blair Google's parent company Alphabet is the third tech firm to settle with Mr Trump over what he perceived as an illegitimate muzzling of him online following the riot. He was also suspended from Meta's platforms and Twitter, moves which saw him gravitate towards his own social media platform - Truth Social. The president and his supporters have falsely maintained that the 2020 election was stolen.  Meta - which owns Facebook and Instagram - agreed to pay $25m (£18.6m) to settle Mr Trump's lawsuit, and X (what Twitter became after being bought by Elon Musk in 2022) settled for $10m (£7.4m). Alphabet boss Sundar Pichai, Meta's Mark Zuckerberg, and Mr Musk all attended Mr Trump's inauguration this year, with the latter having been a key contributor to his 2024 election campaign. He led the Trump administration's cost-cutting DOGE unit during the early months of 2025."
    },
    {
        "title": "Prosecutors call for 11-year jail sentence for Sean 'Diddy' Combs",
        "description": "Federal prosecutors in New York are urging a judge to sentence  Sean \"Diddy\" Combs to more than 11 years in prison.",
        "url": "https://news.sky.com/story/prosecutors-call-for-11-year-jail-sentence-for-sean-diddy-combs-13441349",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2010_6983152.jpg?20250805092129",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 05:42:00",
        "Headline": "While the former rapper's defence lawyers have suggested a sentence of 14 months, prosecutors are calling for much longer - and a fine of $500,000.",
        "Content": "Federal prosecutors in New York are urging a judge to sentence  Sean \"Diddy\" Combs to more than 11 years in prison. Following the hip-hop mogul's conviction on prostitution-related charges, they also want him to be fined $500,000 (£372,000), according to court filings. Last week, defence lawyers urged a 14-month sentence. Due to time served, that would enable him to walk free almost immediately - following his arrest in September last year. But he could, in theory, face up to 20 years in jail after being found guilty of two counts of transportation for engagement in prostitution. Each charge carries a maximum sentence of 10 years. Judge Arun Subramanian, a US district judge, is due to sentence Combs in Manhattan on Friday.  During his trial, prosecutors said Combs coerced two of his former girlfriends to take part in what were described as \"freak offs\". He was found guilty of transporting male prostitutes across state lines to take part in those events. Both women testified that Combs physically attacked them and threatened to cut off financial support if they refused to take part. However, while jurors believed Combs broke the law over using sex workers, they did not find the sexual encounters involving the women were non-consensual, which is what prosecutors had argued. Combs was cleared of the more serious charges of sex-trafficking and racketeering conspiracy. Read more from Sky News:JK Rowling hits out at Emma Watson over transgender issuesPenny Lancaster says she felt 'belittled' by Gregg Wallace In a written legal submission, his defence team has detailed \"inhumane\" conditions at the Metropolitan Detention Center in Brooklyn, New York. They said the food sometimes contains maggots, that the rapper is routinely subjected to violence, and that he has \"not breathed fresh air in nearly 13 months\". They also said his \"career and reputation have been destroyed\". His legal team said Combs had been \"adequately punished\" already, was sober \"for the first time in 25 years\", and had helped other inmates by creating an educational programme on business management and entrepreneurship."
    },
    {
        "title": "Driverless Waymo car makes illegal U-turn in California - and can't be given a ticket",
        "description": "Police in California stopped a car after seeing it do an illegal U-turn - only to discover it was driverless.",
        "url": "https://news.sky.com/story/driverless-waymo-car-makes-illegal-u-turn-in-california-and-cant-be-given-a-ticket-13441379",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-waymo-san-bruno-police-dept_7036824.png?20250930085150",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-30 07:17:00",
        "Headline": "Police say legislation enabling officers to issue notices directly to companies is being prepared - but, for now, they can't sanction a \"robot\".",
        "Content": "Police in California stopped a car after seeing it do an illegal U-turn - only to discover it was driverless. The Waymo was spotted making the manoeuvre \"right in front\" of officers at a light, San Bruno Police Department said. \"Since there was no human driver, a ticket couldn't be issued,\" it said, adding officers cannot book a \"robot\". There was \"no driver, no hands, no clue\", the police department quipped, describing the experience as coming with a \"plot twist\". The vehicle pulled over as soon as officers flashed their lights and sounded a siren. They were then able to talk to someone from Waymo using equipment inside the car. The police department said it was hopeful \"reprogramming\" would stop the vehicle from making any more illegal moves. Legislation is being prepared to enable officers to issue notices directly to companies. Read more from Sky News:Netanyahu backs Trump's peace plan for GazaPutin issues defiant message over Ukraine Waymo told Sky News' US partner network NBC it is \"looking into the situation\" and committed to improving safety through \"ongoing learnings and experience\". The company has been operating autonomous cars in San Bruno since June. Earlier in the year, another of its cars started driving around in circles. Last year, Waymo was forced to fix a fleet of its cars after residents complained about their constant honking."
    },
    {
        "title": "Energy price cap warning as latest rise takes effect",
        "description": "The energy price cap is on course to remain steady through this winter but may jump in six months' time,  according to a respected industry forecast.",
        "url": "https://news.sky.com/story/energy-price-cap-warning-as-latest-rise-takes-effect-13441601",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-energy-bills-price-cap_7030057.jpg?20250924081415",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-30 17:57:00",
        "Headline": "The energy price cap remains vulnerable to gas price shocks and rising costs including green energy investment but households are being told they can still shield themselves from fluctuations ahead.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The energy price cap is on course to remain steady through this winter but may jump in six months' time,  according to a respected industry forecast. Ahead of the 2% rise in the default tariff, which is imposed from Wednesday until the end of December, Cornwall Insight said it was currently predicting that the latest increase would be eradicated for the January-March quarter. It saw a £30 drop to average annual bills at the start of 2026, despite the specialist saying the expected addition of a £10 per year levy to support the next generation of new nuclear power stations. Money latest: House thinner than a bus on sale for £1.1m Cornwall Insight warned that further government-imposed policy costs could add £100 more a year to bills from April, building on higher charges in place to pay for the green energy future and help for households through the expanded warm home discount. Its prediction, which is subject to wholesale market movements and regulatory consultations on how to apply such charges to bills, would see the cap hit £1,855 from the October-December average of £1,755. Policy costs to assist the battle against climate change are playing an increasing role in determining the level of the price cap. \n                  Energy group Ovo plots sale of stake in software arm Kaluza\n                 \n                  Energy bill payers to back 'super-battery' projects\n                 \n                  Octopus Energy hires Goldman to sell minority stake in Kraken\n                  There are 34 million households, including those on pre-payment meters and other standard variable arrangements, on the energy price cap. There are a further 20 million unaffected by the price cap shift as they are on fixed-rate deals. They are only exposed to changes in raw energy prices and new policy costs when their term ends. Wholesale prices - volatile since Russia's invasion of Ukraine back in February 2022 - have been the main driver of rising bills since the end of the COVID pandemic. But they are making little contribution to October's increase as gas prices have remained stable recently due to weaker demand in the global economy and higher flows. Much, however, depends on a lack of global shocks. The government wants to remove that volatility from bills through a focus away from gas towards wind and new nuclear, including through modular reactors.  The problem for household bills in the interim is that it means even higher charges to help pay for the new infrastructure to support that shift in electricity provision. Minister for energy consumers, Martin McCluskey, said: \"Wholesale gas costs remain 75% above their levels before Russia invaded Ukraine. The more renewables on the system, the cheaper the wholesale price of electricity, which is why the only answer for Britain is this government's mission to get us off the rollercoaster of fossil fuel prices and onto clean, homegrown power we control.\" He said of efforts to support struggling households: \"We are taking urgent action to support vulnerable families this winter, expanding the £150 Warm Home Discount to more than six million families, which helps one in five households with their energy bills. \"In the coming weeks, we will be announcing details of the biggest home upgrade programme in British history to improve up to five million homes, making them cheaper and cleaner to run.\" Recent figures by Ofgem showed a record sum for household energy debt. The regulator revealed a £4.4bn total during the second quarter of the year - up by £750m on the same period in 2024. The government has said it is working with Ofgem to find solutions. Ideas include the possibility of a debt relief scheme. Will Owen, energy expert at Uswitch.com, said of the Cornwall Insight predictions: \"The predicted rise is driven by the increasing costs of making our energy grid fit for the future, and these charges are being passed on to bill-payers. \"If you're on a standard variable tariff, you can beat these expected rises and save on bills by switching to a well-priced fixed deal now. \"There are currently 26 fixed deals priced below the October price cap, with savings of around £234 for the average household.\""
    },
    {
        "title": "Thames Water creditors to pledge no sale before 2030",
        "description": "The group of lenders which want to take control of Britain&#8217;s biggest water utility and keep it out of government ownership are to pledge to the industry regulator that they will not offload the company before the end of the decade.",
        "url": "https://news.sky.com/story/thames-water-creditors-to-pledge-no-sale-before-2030-13441644",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-thameswater_6929423.jpg?20250528094500",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-30 14:44:00",
        "Headline": "The group of lenders which is now in pole position to own Britain’s biggest water company will tell Ofwat they will not sell it until its turnaround plan is complete, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The group of lenders which want to take control of Britain’s biggest water utility and keep it out of government ownership are to pledge to the industry regulator that they will not offload the company before the end of the decade. Sky News has learnt that Thames Water's largest creditor group, which account for the bulk of the company's £20bn debt pile, will promise to retain ownership until it is in a sufficiently healthy position to attain a stock market listing. The commitment to retain ownership until around 2030 is noteworthy because that is the date when the next regulatory price-setting cycle - known as an Asset Management Plan - is due to come into effect. The creditors' pledge will form part of a package to be submitted to Ofwat by the Class A creditors as soon as this week. Money latest: House thinner than a bus on sale for £1.1m It is designed to dispel any suggestion that the group of lenders might seek to offload Thames Water midway through a turnaround plan aimed at putting the company back on a sustainable long-term footing. The creditors will also commit to not paying a dividend to shareholders for the length of the transformation plan or its return to the stock market, according to an executive at one of the participating funds. \n                  Thames Water rescue plan promises £20.5bn investment\n                 \n                  Thames Water creditors offer £1bn 'sweetener' in rescue deal\n                 \n                  Thames Water agrees £122m fine payment plan - as future hangs in balance\n                 Earlier this month, the London & Valley Water consortium - which includes Elliott Management and Apollo Global Management - set out proposals for a £20.5bn investment and turnaround plan. Its focus on reducing pollution incidents and leaks - which have triggered hundreds of millions of pounds in fines for Thames Water and destroyed the company's reputation - is aimed at persuading Ofwat and the government that the investors have a viable plan to run one of the country's most important businesses. Thames Water has more than 16 million customers, accounting for more than a quarter of Britain's population.  In a statement issued four weeks ago, the chair designate, Mike McTighe, said its investment pledge made it \"one of the biggest infrastructure projects in the country\". \"Our core focus will be on improving performance for customers, maintaining the highest standards of drinking water, reducing pollution and overcoming the many other challenges Thames Water faces,\" he said. \"This turnaround has the opportunity to transform essential services for 16 million customers, clean up our waterways and rebuild public trust.\" The creditors are trying to agree a private sector-led solution to the crisis at Thames Water weeks after Sky News revealed that the government had put insolvency practitioners on standby to oversee its collapse into a Special Administration Regime (SAR). Steve Reed, the environment secretary prior to last month's cabinet reshuffle, signed off the appointment of FTI Consulting to advise on contingency plans for the company to be placed into a SAR - meaning it would be temporarily nationalised. Rachel Reeves, the chancellor, has since said privately that the Treasury's preference is for a private sector rescue of Thames Water. Under the consortium's plans, Thames Water's largest group of creditors would in aggregate inject and write off as much as £18bn across its capital structure. Thames Water's existing shareholders, which include the Universities Superannuation Scheme and an Abu Dhabi sovereign wealth fund, wrote off the value of their investments in the company months ago. The company faces a deadline in the coming weeks to appeal to the Competition and Markets Authority against Ofwat's final determination on its next five-year spending plan. Ofwat ruled earlier this year that Thames Water can spend £20.5bn during the period from 2026, with the company arguing that it requires a further sum of approximately £4bn. Thames Water was fined a record £123m several months ago over sewage leaks and the payment of dividends, with Ofwat lambasting the company over its performance and governance. It has also been engulfed in a row over the legitimacy of bonuses paid to chief executive Chris Weston and other bosses, even as it attempts to secure its survival. Under new laws, Thames Water is among half a dozen water companies which have been barred from paying bonuses this year because of their poor environmental records. The creditor group was effectively left as the sole bidder for Thames Water after the private equity firm KKR withdrew from the process, citing political and reputational risks. The Hong Kong-based investor CK Infrastructure Holdings (CKI), which already owns Northumbrian Water, has sought to re-engage in talks about a rescue deal but has gained little traction in doing so. Thames Water's fate is also being hammered out against the backdrop of leadership change at Ofwat, with Sky News revealing during the summer that David Black, its chief executive, was to step down following the publication of a government-commissioned review which recommended the regulator's abolition. He has been replaced by Chris Walters, another Ofwat executive, on an interim basis. A spokesperson for the creditor group declined to comment on Tuesday."
    },
    {
        "title": "'Dashcam snitches' send driver fines skyrocketing",
        "description": "Dashcam footage sent to police by vigilante drivers has led to the number of fines skyrocketing by almost 80%, new research reveals.",
        "url": "https://news.sky.com/story/dashcam-snitches-send-driver-fines-skyrocketing-13441645",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dashcam-cars_7037346.jpg?20250930154925",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-30 14:35:00",
        "Headline": "Other motorists are behind a spike in driver fines, research shared with Sky News reveals.",
        "Content": "Dashcam footage sent to police by vigilante drivers has led to the number of fines skyrocketing by almost 80%, new research reveals. More and more people are sending officers videos capturing dangerous driving offences, with an increase of 55% between 2022 and 2024, totalling 210,000 clips. Almost one in five (18%) reports ended with a fixed penalty notice, according to data obtained by Confused.com and shared exclusively with Sky News. Another 29% of submissions prompted official warnings, while 14% required drivers to attend retraining courses and 5% even led to court prosecutions. While the internet has dubbed these people \"dashcam snitches\", in most cases they are helping police clamp out dangerous behaviour on the UK's roads. The most common offence recorded was careless or inattentive driving, making up three in five of all submitted incidents. Red light offences account for around one in five and mobile phone use for one in six. \n                  Energy price cap warning as latest rise takes effect\n                 \n                  Thames Water creditors to pledge no sale before 2030\n                 \n                  Money latest: House thinner than a bus goes on sale for £1.1m - take a look inside\n                 Approximately 34% of drivers have a dashcam installed. \"Dashcams are no longer just handy gadgets, they have become effective safety tools and crucial sources of evidence when incidents occur on the roads,\" says Confused.com car insurance expert Rhydian Jones. Footage can be submitted to the force's Operation Snap, a response to the sheer amount of video and photographic evidence that people were submitting. Confused.com has created a tool for uploading your videos."
    },
    {
        "title": "125 jobs to go at Lindsey oil refinery as ministers accused of being 'tin eared'",
        "description": "A total of 125 workers are to be made redundant after administrators were appointed at one of Britain's few remaining oil refineries.",
        "url": "https://news.sky.com/story/125-jobs-to-go-at-lindsey-oil-refinery-13441395",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-prax-lindsey_6953513.jpg?20250630080643",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-30 08:09:00",
        "Headline": "Unite, the union, has said the announcement \"makes a mockery of government promises to protect workers\".",
        "Content": "A total of 125 workers are to be made redundant after administrators were appointed at one of Britain's few remaining oil refineries. The losses come despite attempts to find a buyer for the business following the collapse of its owner, energy conglomerate Prax Group, which triggered the receivership process at the Lincolnshire site. A further 255 employees will remain at the site out of 420 directly employed staff and 500 contract workers. Money latest: Common insurance that's probably a waste of money At least two bids to buy and operate the location with a full workforce were received, union Unite said. \"We understand that this is a very difficult time for all those affected by this decision, and the Insolvency Service will fully support employees subject to redundancy via the redundancy payments service,\" the government-run Insolvency Service said. \"The site remains safe, and the official receiver continues to prioritise health and safety at the site alongside the ongoing process to secure the sale of the refinery. \n                  Drill, Kemi, drill! Are Tory oil and gas plans a load of hot air?\n                 \n                  The good, the bad and the ugly in Donald Trump's coal plans\n                 \n                  Shell in court over claims of oil pollution in Nigeria\n                 Government support for the refinery could be provided, which could keep it running, Unite said. As a result, the government is \"responsible for the redundancies\", it said. Politics latest: Starmer to warn country faces choice between 'decency or division' Unite general secretary Sharon Graham said: \"The government has been tin eared to the plight of workers at the second oil refinery facing closure in less than a year. \"This makes a mockery of government promises to protect workers and its plan for net zero.\" The refinery's biggest creditors are His Majesty's Revenue and Customs (HMRC) and oil company Glencore, which Unite said \"can wait for the more complicated but far less damaging process of maintaining the site as an oil refinery\". With the possible closure of Lindsey, the UK could lose another 20% of its refining capacity, meaning further reliance on imports and global supply chains. In the 1970s, the UK had 18 operational oil refineries. Now, it only has six.   Political response Politicians had called for an examination of the activity and finances of Prax's owner, State Oil, in the run-up to its collapse. The conduct of the company and its directors is currently the subject of an ongoing Insolvency Service investigation. Responding to the redundancy news, energy minister Michael Shanks said: \"Our thoughts are with the workers, their families and the community who have been badly let down by Prax Lindsey Oil Refinery's owners. \"The official receiver has made this independent decision now in order to provide employees with as much notice as possible, while concluding the sales process in the coming weeks.\" \"The Official Receiver is independently assessing potential bids for the future of the refinery and its assets and has made clear he will continue to work with all bidders with credible and deliverable proposals,\" Mr Shanks added. \"We have taken immediate action to fund a training guarantee for refinery workers to support them to find new, secure, long-term jobs, including in the growing clean energy workforce.\""
    },
    {
        "title": "Tory peer Michelle Mone accuses government of 'scapegoating' over PPE scandal in online tirade",
        "description": "Michelle Mone has accused the government of making her and her husband a \"poster couple for the PPE scandal\", in a lengthy online tirade.",
        "url": "https://news.sky.com/story/tory-peer-michelle-mone-accuses-government-of-scapegoating-over-ppe-scandal-in-online-tirade-13441570",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-baroness-michelle-mone_6579867.jpg?20240612170121",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-30 13:10:00",
        "Headline": "The Tory peer had initially denied involvement with the company accused of breaching a contract for 25 million surgical gowns. A judge will hand down a ruling tomorrow in the £121m-case - although the firm filed a \"notice of appointment to appoint an administrator\" on Tuesday.",
        "Content": "Michelle Mone has accused the government of making her and her husband a \"poster couple for the PPE scandal\", in a lengthy online tirade. The Tory peer claimed the government had turned down multimillion-pound offers to settle a High Court legal battle with a company she is linked with. PPE Medpro, a consortium led by Baroness Mone's husband, businessman Doug Barrowman, is being sued by the Department of Health and Social Care (DHSC) over claims it breached a contract for 25 million surgical gowns during the COVID pandemic. She had initially denied involvement in the company or the process through which it was handed the government contract. However, it was later revealed that Baroness Mone was the \"source of referral\" for the firm getting a place on the so-called \"VIP lane\" for offers of personal protective equipment for the NHS. Lawyers for the government previously told a trial that it was entitled to recover the £121m cost of the contract, which the company opposes. Mrs Justice Cockerill is due to hand down her ruling tomorrow - while court records showed PPE Medpro filed a \"notice of appointment to appoint an administrator\" on Tuesday. \n                  COVID inquiry hears children spent up to 19 hours a day playing online games during lockdown\n                 \n                  Claims at Reform conference that vaccines gave royals cancer 'extremism', says Streeting\n                 \n                  Doctor and husband who sold PPE stolen from NHS on eBay during pandemic jailed\n                 And in a post on X on Tuesday, Baroness Mone claimed PPE Medpro offered to replace the gowns before offering a cash sum to settle the case during the trial, which was rejected. \"Instead, the DHSC chose to spend a staggering £5m of taxpayers' money pursuing litigation against a company they knew had no funds,\" she said. She said she and Mr Barrowman had \"worked tirelessly with the DHSC to resolve this dispute\", and that PPE Medpro had \"fulfilled its contracts\". \"This case was never about gowns or money,\" she said. \"It has always been about politics and blame-shifting, a way to cover up the government's disastrous £10bn PPE write-off. \"Doug and I have been deliberately scapegoated and vilified in an orchestrated campaign designed to distract from catastrophic mismanagement of PPE procurement. \"The government decided to make us the poster couple for the PPE scandal, a convenient distraction to take the blame off them.\" She added that \"many other suppliers who ran off with deposits or provided defective goods face no action\". \"Singling out one company in this way is not justice; it is scapegoating,\" she said. A government spokesperson said they \"could not comment on active legal proceedings\"."
    },
    {
        "title": "YouTube to settle lawsuit with Trump over account suspension",
        "description": "YouTube has agreed to pay $24.5m (&#163;18.1m) to settle a lawsuit brought by Donald Trump after it banned his account following the January 6 Capitol riot.",
        "url": "https://news.sky.com/story/youtube-to-settle-lawsuit-with-trump-for-banning-his-account-13441323",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-youtube_7036722.jpg?20250930020950",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-30 00:28:00",
        "Headline": "YouTube was not the only platform to take action against Donald Trump over the deadly riot in Washington DC in 2021 - he was also suspended by Meta and Twitter, now X, before being reinstated several years later.",
        "Content": "YouTube has agreed to pay $24.5m (£18.1m) to settle a lawsuit brought by Donald Trump after it banned his account following the January 6 Capitol riot. The US president was suspended from the Google-owned platform over his role in the insurrection, which saw his supporters attempt to stop Joe Biden's 2020 election win from being ratified. More than four years on from the violent scenes that left a police officer dead, court documents filed on Monday revealed that $22m (£16.3m) from the settlement will go towards a trust for Washington DC's National Mall and the construction of a White House ballroom. The remainder will be paid to other parties involved in the case, including the American Conservative Union.  Google declined to comment on the reasons for the settlement, which does not constitute an admission of liability. Mr Trump's YouTube account has been back online since 2023. Read more from Sky News:Trump wants to govern Gaza with Blair Google's parent company Alphabet is the third tech firm to settle with Mr Trump over what he perceived as an illegitimate muzzling of him online following the riot. He was also suspended from Meta's platforms and Twitter, moves which saw him gravitate towards his own social media platform - Truth Social. The president and his supporters have falsely maintained that the 2020 election was stolen.  Meta - which owns Facebook and Instagram - agreed to pay $25m (£18.6m) to settle Mr Trump's lawsuit, and X (what Twitter became after being bought by Elon Musk in 2022) settled for $10m (£7.4m). Alphabet boss Sundar Pichai, Meta's Mark Zuckerberg, and Mr Musk all attended Mr Trump's inauguration this year, with the latter having been a key contributor to his 2024 election campaign. He led the Trump administration's cost-cutting DOGE unit during the early months of 2025."
    },
    {
        "title": "Buyout giant CVC paves way for sale of warranty provider D&G",
        "description": "CVC Capital Partners is paving the way for a fresh attempt to sell Domestic & General Group (D&G), one of Britain's biggest warranty providers.",
        "url": "https://news.sky.com/story/buyout-giant-cvc-paves-way-for-sale-of-warranty-provider-dg-13441477",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-electrical-goods-iron_7037003.jpg?20250930122334",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-30 10:19:00",
        "Headline": "The Amsterdam-listed private equity firm is to explore options for the sale of its long-held stake in Domestic & General, one of the UK's biggest providers of electrical goods insurance, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n CVC Capital Partners is paving the way for a fresh attempt to sell Domestic & General Group (D&G), one of Britain's biggest warranty providers. Sky News has learnt the Amsterdam-listed private equity firm is beginning to consider options for offloading its majority stake in the company. D&G provides cover for electrical products purchased from more than 100 brands, including Hoover, John Lewis, Samsung and Argos. Money latest: Common insurance that's probably a waste of money CVC paid about £750m to buy D&G from fellow buyout firm Advent International 12 years ago - making it an unusually long-term investment by the standards of the private equity industry. It had been a publicly listed company before being taken private in 2007. The current owner sold a 30% stake in D&G to the Abu Dhabi Investment Authority in 2019 after running a full auction process and considering returning the appliances insurer to the London stock market. Earlier this year, D&G underwent an £800m refinancing, with the proceeds used to pay off existing debts. Read more from Sky News:125 jobs to go at Lindsey oil refineryMost ransomware victims pay up - with mixed results Options for CVC could be to sell D&G to another vehicle controlled by the existing owner - known as a continuation vehicle - or to find a merger partner for the company. Sources say CVC's preference, however, would be to dispose of its interest to third parties. It was unclear on Tuesday how imminent a transaction might be. CVC declined to comment."
    },
    {
        "title": "Sir Keir Starmer says he will take 'no more lectures' from Nigel Farage - and warns of 'fight for the soul of our country'",
        "description": "Sir Keir Starmer has said he will take \"no more lectures\" from Nigel Farage, as he warned that the next four years will be \"a fight for the soul of our country\" against Reform UK.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-he-will-take-no-more-lectures-from-nigel-farage-and-warns-of-fight-for-the-soul-of-our-country-13441674",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-labour_7037259.jpg?20250930215920",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-09-30 15:31:00",
        "Headline": "The prime minister launched a lengthy attack on Reform UK in his Labour Party conference speech, as he set out his vision for \"national renewal\".",
        "Content": "\n          Political reporter\n              @realBenBloch\n  Sir Keir Starmer has said he will take \"no more lectures\" from Nigel Farage, as he warned that the next four years will be \"a fight for the soul of our country\" against Reform UK. In a speech setting out his vision of \"national renewal\" for Britain, the prime minister hit out at \"snake oil merchants on the right, on the left\", and questioned whether Mr Farage and his party \"genuinely love our country\". Sir Keir also asked for \"patience\" as he implements the \"change\" he has promised, which comes after a challenging first 14 months in power, with Reform UK continuing to top the opinion polls, and dissent within his own party in the form of a series of interviews by Greater Manchester mayor Andy Burnham criticising the direction of the government. In an hour-long speech at the Labour Party conference, the prime minister declared that the UK is at \"a fork in the road\", saying: \"We can choose decency, or we can choose division; renewal or decline; a country proud of its values, in control of its future, or one that succumbs against the grain of our history to the politics of grievance. It is a test, a fight for the soul of our country.\" Sir Keir argued the \"path of renewal\" he wants to set the country on is \"long\", and \"requires decisions that are not cost-free or easy, decisions that will not always be comfortable for our party\". But the reward, he said, is \"a new country, a fairer country, a land of dignity and respect\". Analysis: Speech a success for PM - but biggest issue in UK politics ignored  He hit out at politicians who \"tell you there's a quick fix, a miracle cure, tax cuts that magically pay for themselves, a wealth tax that somehow solves every problem\". \"We can all see these snake oil merchants on the right, on the left, but be in no doubt, none of them have any interest in national renewal because decline is good for their business,\" the prime minister said.  Starmer calls on party to 'fight Reform' In a lengthy attack directly on Reform UK, Sir Keir said: \"Think about it, when was the last time that you heard Nigel Farage say anything positive about Britain's future? He can't. He doesn't like Britain, doesn't believe in Britain, wants you to doubt it just as much as he does. So he resorts to grievance.\" He continued: \"The question I ask seriously of Nigel Farage and Reform is, do they love our country? Do they want to serve our country? All of it - our beautiful, tolerant, diverse country, every region, nation and city? Or do they just want to stir the pot of division?\"  He issued a rallying cry to the Labour Party to \"fight Reform with everything that this movement has\". He went on: \"If you are a patriot, whether you vote Labour or not, if you want to stand against grievance and renew Britain, then this is your fight too. Because even in a world this dangerous, I do think the politics of grievance is the biggest threat we face because it attacks who we are.\" The prime minister added that he will \"fight with every breath I have, fight for working people, fight for the tolerant, decent, respectful Britain that I know\".  Starmer is 'unfit to be PM' In response, Mr Farage said in a video message online: \"I used to think the prime minister was a decent man, somebody that I could talk to and chat to. We might disagree on worldview, but I thought he was a profoundly decent human being. \"I am completely shocked at his behaviour. I hope when he wakes up tomorrow morning, he feels ashamed of what he has done. \"This is a desperate last throw of the dice for the prime minister, who's in deep trouble. A prime minister who can't even command the support of half of his own party. But I'm sorry to say, I now believe he is unfit to be the prime minister of our country.\"  The Conservative Party barely got a mention in the hour-long speech, underscoring where Sir Keir believes the battle lines will be drawn at the next general election, expected in 2029. But speaking to broadcasters afterwards, party leader Kemi Badenoch said: \"I just thought it was really extraordinary that Keir Starmer could not explain how he was going to improve the economy.\" She described the fight between Sir Keir and Mr Farage as \"two boys squabbling in the playground\", and said she wants to focus on how \"the people in government can make life better\". Read more:Farage on course to be next PM, mega poll projectsAlmost two in three Labour members back Burnham over StarmerStreeting says Labour 'need Angela Rayner back' PM sets out the 'purpose' of his government As he declared Reform UK \"the enemy of national renewal\", Sir Keir set out his vision of the future of the country, saying: \"At the end of this hard road, there will be a new country, a fairer country, a land of dignity and respect. Everyone seen. Everyone valued. \"Wealth creation in every single community. Working people in control of their public services. The mindless bureaucracy that chokes enterprise removed, so we can build and keep building. Clean British energy powering our homes. Technology harnessed to drive us forward. Our flags flying proudly as we celebrate difference and oppose racism.\" He acknowledged that the public is \"losing faith\", and people are feeling \"ground down\", saying: \"Politics has made them question Britain. And could you blame them? They've been nothing but patient.\"  The prime minister said Britain is not \"broken\" - something he has previously argued himself - but said that his solution to the problems Britain faces is an economy working \"from the grassroots\", secure borders and controlled migration, and public and private investment in everything from education to infrastructure. \"Every decision\" the government has made in the past 14 months has been about \"changing the way we create wealth, reforming public services, giving people more control over our future\", he argued. 👉Listen to Politics At Sam And Anne's on your podcast app👈 The prime minister announced \"NHS Online\", which will allow patients to access prescriptions, book scans and tests, receive clinical advice, and manage appointments through the NHS app. And he also announced he is scrapping the Blair-era target of 50% of all young people going to university, in favour of two-thirds going to either universities or \"gold-standard apprenticeships\". Concluding his speech, the prime minister said: \"People say that a nation like ours can't be a community - that it is too diverse, too divided. I reject that. That goes against everything I stand for, everything I've served, everything I understand about this great country that I love. \"So no matter how many times people tell me it can't be done, I believe Britain can come together, that we can pursue a shared destination, that we can unite around the common good. That is my ambition. \"The purpose of this government - end decline, reform our public services, grow our economy from the grassroots and with resolve, with respect, with a flag in our hands, we will renew this country until we can say with total conviction that Britain is built for all.\""
    },
    {
        "title": "Starmer's speech was one of his most successful moments - but biggest issue in UK politics was ignored",
        "description": "On its own terms, this was one of Sir Keir Starmer's most successful moments since becoming Labour leader in 2020.&#160;",
        "url": "https://news.sky.com/story/starmers-speech-was-one-of-his-most-successful-moments-but-biggest-issue-in-uk-politics-was-ignored-13441790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-victoria-starmer_7037596.jpg?20250930204628",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-30 19:00:00",
        "Headline": "Sir Keir Starmer gave his keynote speech to the Labour conference, where he attacked Reform and spoke about his working-class father.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  On its own terms, this was one of Sir Keir Starmer's most successful moments since becoming Labour leader in 2020.  Just in the nick of time, the prime minister delivered a speech that will steady his position in the party and arm Labour activists with new, clearer dividing lines with Reform UK. There's nothing like finding and cauterising an enemy to get the crowd back on side. He attacked \"snake oil merchants\" on the left and right - allowing some to question whether that is a category which includes Andy Burnham. Politics latest: PM says Farage 'doesn't like Britain' as he targets Reform And he worked out his principle policy attack on Reform UK: the plan to rip up the settled status of people who have lived in Britain for decades. In a move that one senior Labour figure described as a \"One Nation Labour\" credo, he gave a more credible account of his credentials as a champion of working people than he has managed in the past by invoking his family. 👉Listen to Politics At Sam And Anne's on your podcast app👈 Rather than pretend that the Oxford-educated barrister could play the role of a working-class hero, he pointed to the struggles of his father, brother and sister to emphasise he understands the lives of those outside the north London seat he represents.  The politics are striking. Sir Keir's team tell me that the speech was aimed at those in Middle England who are tempted by Reform UK. But in an apparent change, it was also a speech that went down well with the soft left, who have been disappointed by Sir Keir for much of the year. Rather than moving into Reform UK territory, he spelt out why they were wrong in a set piece that might succeed in its aim of stopping the drift away of voters from Labour to the Lib Dems, Greens and others on the left. Yet for all of its success, the biggest issue in British politics was ignored. There continues to be a £20-30 billion black hole, which will define this year in British politics, yet this was not mentioned at all. There was a brief sort of acknowledgement of the need for fiscal rules - a lack of financial responsibility would hit working people, he argued. Read more:Was this one of the great Labour conference speeches?Renew Britain - but did it renew Starmer?  He also noted that businesses paid a lot in tax, though it was not clear that this amounted to a promise not to tax them further. But there was none of the pitch rolling for what continues to look like a massive moment at the budget on 26 November. Cabinet ministers say that there was a more urgent task of shoring him up and setting a direction to be done, that trumped the need to dwell on this impending problem. The issue is whether it marks a wider change in his premiership. The challenge for Sir Keir has always been whether he can execute policy that will change people's lives. His approach - the high-level chairman rather than interventionist chief executive - does not always yield the real change of his rhetoric. This will need to change for this government to truly be a success."
    },
    {
        "title": "'Renew Britain' - but did it renew Keir Starmer?",
        "description": "<a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics At Sam And Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/8216renew-britain8217-but-did-it-renew-keir-starmer-13441421",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-podcast_7012130.jpg?20250905165749",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-30 08:55:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics At Sam And Anne's on your podcast app👈 This is what Sam and Anne made of Keir Starmer’s speech to the Labour conference in Liverpool. It was an hour that was often pitched at Middle England voters tempted by Reform – but also seemed to go down well with Labour’s soft left. The PM doubled down on his stance that some of Nigel Farage’s policies are racist. How will all that go down outside the conference bubble? In the Politico pub, Sam and Anne also debrief on what the PM was saying about working people – which, they reckon, is sounding a bit Bridget Phillipson. Sam and Anne will debrief Kemi Badenoch’s Conservative speech next Wednesday afternoon."
    },
    {
        "title": "Was this one of the great Labour conference speeches?",
        "description": "So where does Sir Keir Starmer's ferocious attack on Nigel Farage rank among the great party conference speeches by Labour leaders?",
        "url": "https://news.sky.com/story/was-this-one-of-the-great-labour-conference-speeches-13441686",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-labour-keir-starmer_7037309.jpg?20250930151431",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-09-30 17:00:00",
        "Headline": "Sir Keir spoke in Liverpool this year about a \"fork in the road\". Will this speech help him turn the corner?",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  So where does Sir Keir Starmer's ferocious attack on Nigel Farage rank among the great party conference speeches by Labour leaders? One former minister told Sky News Sir Keir's claim that Mr Farage \"hates Britain\" was right up there with Neil Kinnock's blistering assault on the Militant Tendency almost exactly 40 years ago. In Bournemouth, on 1 October 1985, denouncing Derek Hatton's Liverpool Militants, Mr Kinnock famously declared: \"I'll tell you what happens with impossible promises. \"You start with far-fetched resolutions. They are then pickled into a rigid dogma, a code, and you go through the years sticking to that, outdated, misplaced, irrelevant to the real needs. \"And you end up in the grotesque chaos of a Labour council - a Labour council - hiring taxis to scuttle round a city handing out redundancy notices to its own workers.\" Sir Keir is not the first Labour leader to face the possible threat of a leadership challenge, of course. Gordon Brown's admirers point to his 2008 speech ridiculing would-be challenger David Miliband. \"I'm all in favour of apprenticeships,\" he quipped. \"But this is no time for a novice.\" Brown's allies claimed he was referring to the youthful Tory leader David Cameron. But no one was convinced. Another good party conference quip came from Tony Blair in a dig at his rival Brown in his 2006 conference swansong, in a joke about his wife Cherie. \"At least I don't have to worry about her running off with the bloke next door,\" said the soon-to-depart three-times election winner.  He wasn't the leader, but John Prescott's finest hour came in a 1993 conference speech when he rescued leader John Smith from defeat in a crucial vote on bringing in one member, one vote. \"This man, our leader, put his head on the block,\" he said of Smith. \"He has put his head there, now it is time to vote. Give us a little trust.\" Read more:Streeting says Labour 'need Rayner back'PM says he will take 'no more lectures' from Farage It was vintage Prescott: garbled sentences, mangled syntax and terrible grammar. But it won the day and propelled him to the deputy leadership of the party. Back in 1960, Hugh Gaitskell famously declared: \"There are some of us who will fight, and fight, and fight again, to save the party we love.\"  What many of these memorable speeches - including Sir Keir's - have in common is that they were made when the party leader was in trouble and under threat from party rivals. For many, their fighting speech proved to be a turning point. Sir Keir spoke in Liverpool this year about a \"fork in the road\". Will this speech help him turn the corner?"
    },
    {
        "title": "Wes Streeting says Labour 'need Angela Rayner back'",
        "description": "Wes Streeting has paid tribute to Angela Rayner and said Labour \"wants her back and needs her back\". ",
        "url": "https://news.sky.com/story/wes-streeting-says-labour-need-angela-rayner-back-13441507",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rayner-streeting-labour-party-conference_7037117.jpg?20250930132209",
        "type": "Politics",
        "Author": "Faye Brown, political reporter",
        "Date Published": "2025-09-30 11:09:00",
        "Headline": "The health secretary heaped praise on his former colleague in a speech otherwise dominated by scathing attacks on \"snake oil salesman\" Nigel Farage.",
        "Content": "By Faye Brown, political reporter    Wes Streeting has paid tribute to Angela Rayner and said Labour \"wants her back and needs her back\".  The health secretary heaped praise on his former cabinet colleague during a wide-ranging speech at the annual party conference, which was packed with attacks on Reform UK leader Nigel Farage. Ms Rayner resigned as deputy party leader and housing secretary after a row about her tax affairs earlier this month. Politics Live: Day three of annual Labour conference  Addressing members gathered in Liverpool, Mr Streeting said Labour's new fair pay agreement for care workers could not have been achieved without her. He said: \"There's someone else who's made a real difference, who understands the struggle care workers face because she was one. \"She brought that experience to the cabinet table as the care worker who became our country's deputy prime minister. Angela Rayner, this achievement is yours. Thank you.\" There was a big round of applause as Mr Streeting added: \"And we want her back as well. We'll definitely make sure she sees that. We need her back.\" The message could be seen as trying to get grassroots members onside amid grim polling predictions for Labour and questions over whether Sir Keir Starmer can survive. Ms Rayner is popular with the Labour membership - they elected her as deputy leader in 2020, but she gave up this position as well as her cabinet roles when it emerged she had underpaid stamp duty on a flat in Hove. Read More:Labour 2-0 down and budget 'pivotal', says Sadiq KhanAlmost two in three Labour members back Burnham - poll In his speech, Mr Streeting also praised the Unison and GMB unions for standing up for care workers. However, that was as far as his good will stretched - as he launched several stinging attacks on his opponents. Farage 'snake oil salesman' The cabinet minister, seen as one of the government's best communicators, accused Mr Farage of being the \"snake oil salesman\" of British politics and vowed to send him \"packing\" at the next election. He argued that while Labour wants to modernise the NHS - with plans for an \"online\" hospital - the Reform leader wants an insurance system that \"checks your pockets before your pulse\". \"It might be right for Mr Moneybags. We know he can afford it. But what about those who can't?\" Mr Streeting asked. \"Be in no doubt. It's not reform he's offering. It's a retreat. If that's the fight Farage wants, I say bring it.\" Mr Farage has previously spoken about being open to an insurance based model for the NHS, drawing a big dividing line with the Labour Party, which founded the National Health Service after the Second World War. Mr Streeting said the party must win another fight too, \"against the poison of post-truth politics\". He pointed to Reform's recent conference, where a \"discredited doctor claimed that the COVID vaccine gave our Royal Family cancer\". \"This man wasn't just some fringe figure, he's Reform's health adviser. These anti-vax lies have consequences, they've led to the return of diseases we thought we had defeated,\" said Mr Streeting. \"Nigel Farage is a snake oil salesman of British politics and it's time to stop buying what he's selling.\" A Reform spokesperson previously said the doctor was a \"guest speaker with his own opinions who has an advisory role in the US government\". \"Reform UK does not endorse what he said but does believe in free speech,\" they added. Trouble ahead Mr Streeting's speech reflects government efforts to ramp up its rhetoric against Reform UK, after two major polls predicted the insurgent party will win the next general election as fed-up voters abandon mainstream politics. While that is many years away, some MPs see the devolved and local elections next May as a crunch test that could determine Sir Keir's political survival. Mr Streeting acknowledged this threat, saying it is not just Mr Farage Labour would \"send packing\". He said: \"Whether it's English nationalism with Reform, Scottish nationalism with the SNP or Welsh nationalism with Plaid we'll take them all on.\" Mr Farage said attacks on him were a \"desperate last throw of the dice\" for a party in \"deep trouble\", adding: \"Never before have I seen one name that's dominated a conference so much - yes it's me, Nigel Farage.\""
    },
    {
        "title": "Tory peer Michelle Mone accuses government of 'scapegoating' over PPE scandal in online tirade",
        "description": "Michelle Mone has accused the government of making her and her husband a \"poster couple for the PPE scandal\", in a lengthy online tirade.",
        "url": "https://news.sky.com/story/tory-peer-michelle-mone-accuses-government-of-scapegoating-over-ppe-scandal-in-online-tirade-13441570",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-baroness-michelle-mone_6579867.jpg?20240612170121",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-30 13:10:00",
        "Headline": "The Tory peer had initially denied involvement with the company accused of breaching a contract for 25 million surgical gowns. A judge will hand down a ruling tomorrow in the £121m-case - although the firm filed a \"notice of appointment to appoint an administrator\" on Tuesday.",
        "Content": "Michelle Mone has accused the government of making her and her husband a \"poster couple for the PPE scandal\", in a lengthy online tirade. The Tory peer claimed the government had turned down multimillion-pound offers to settle a High Court legal battle with a company she is linked with. PPE Medpro, a consortium led by Baroness Mone's husband, businessman Doug Barrowman, is being sued by the Department of Health and Social Care (DHSC) over claims it breached a contract for 25 million surgical gowns during the COVID pandemic. She had initially denied involvement in the company or the process through which it was handed the government contract. However, it was later revealed that Baroness Mone was the \"source of referral\" for the firm getting a place on the so-called \"VIP lane\" for offers of personal protective equipment for the NHS. Lawyers for the government previously told a trial that it was entitled to recover the £121m cost of the contract, which the company opposes. Mrs Justice Cockerill is due to hand down her ruling tomorrow - while court records showed PPE Medpro filed a \"notice of appointment to appoint an administrator\" on Tuesday. \n                  COVID inquiry hears children spent up to 19 hours a day playing online games during lockdown\n                 \n                  Claims at Reform conference that vaccines gave royals cancer 'extremism', says Streeting\n                 \n                  Doctor and husband who sold PPE stolen from NHS on eBay during pandemic jailed\n                 And in a post on X on Tuesday, Baroness Mone claimed PPE Medpro offered to replace the gowns before offering a cash sum to settle the case during the trial, which was rejected. \"Instead, the DHSC chose to spend a staggering £5m of taxpayers' money pursuing litigation against a company they knew had no funds,\" she said. She said she and Mr Barrowman had \"worked tirelessly with the DHSC to resolve this dispute\", and that PPE Medpro had \"fulfilled its contracts\". \"This case was never about gowns or money,\" she said. \"It has always been about politics and blame-shifting, a way to cover up the government's disastrous £10bn PPE write-off. \"Doug and I have been deliberately scapegoated and vilified in an orchestrated campaign designed to distract from catastrophic mismanagement of PPE procurement. \"The government decided to make us the poster couple for the PPE scandal, a convenient distraction to take the blame off them.\" She added that \"many other suppliers who ran off with deposits or provided defective goods face no action\". \"Singling out one company in this way is not justice; it is scapegoating,\" she said. A government spokesperson said they \"could not comment on active legal proceedings\"."
    },
    {
        "title": "Eggs fertilised with material from human skin cells for first time",
        "description": "Scientists have found a way to fertilise eggs made from the genetic material of human skin cells.",
        "url": "https://news.sky.com/story/eggs-fertilised-with-material-from-human-skin-cells-for-first-time-13441768",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-embryo-fertility-lab_7037541.jpg?20250930200456",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-30 18:34:00",
        "Headline": "Experts in the UK say it's an exciting development that could one day \"open the door to creating egg or sperm-like cells for those who have no other options\".",
        "Content": "Scientists have found a way to fertilise eggs made from the genetic material of human skin cells. It could one day lead to the creation of egg or sperm-like cells for people who are struggling to conceive. The emerging process is called in vitro gametogenesis (IVG) and involves reprogramming skin cells to make them a type of stem cell. Researchers say it has \"immense therapeutic potential\" for people who don't have viable sperm or eggs. It works by taking the nucleus - the part of the cell that stores the genetic material - from a person's skin cells. These are then implanted in an egg with its nucleus removed - called somatic cell nuclear transfer. However, cells made this way would mean a fertilised egg has too many chromosomes. A method to remove the extra set had been studied in mice, but not with human cells. In the new research, US scientists conducted a process they have called mitomeiosis that mimics natural cell division and causes one set of chromosomes to be discarded. This leaves a healthy cell that can be fertilised. Eighty-two developing eggs - known as oocytes - were fertilised with sperm in a lab using this method - and one in 10 went on to the stage where cells rapidly divide about six days later (the blastocyst stage). This is when they would usually be transferred to the uterus in IVF treatment. Read more from Sky News:'80%' of ransomware victims pay up, insurer saysDriverless car makes illegal U-turn and can't be given a ticket Experts in the UK said it was exciting work but stressed more research was needed. Ying Cheong, a professor of reproductive medicine and consultant at the University of Southampton, called it an \"exciting proof of concept\". \"For the first time, scientists have shown that DNA from ordinary body cells can be placed into an egg, activated, and made to halve its chromosomes, mimicking the special steps that normally create eggs and sperm.\" The professor said it could one day transform the understanding of infertility and miscarriage and \"open the door to creating egg or sperm-like cells for those who have no other options\". Richard Anderson, professor of clinical reproductive science at the University of Edinburgh, said it showed \"genetic material from skin cells can be used to generate an egg-like cell with the right number of chromosomes to be fertilised and develop into an early embryo.\""
    },
    {
        "title": "Driverless Waymo car makes illegal U-turn in California - and can't be given a ticket",
        "description": "Police in California stopped a car after seeing it do an illegal U-turn - only to discover it was driverless.",
        "url": "https://news.sky.com/story/driverless-waymo-car-makes-illegal-u-turn-in-california-and-cant-be-given-a-ticket-13441379",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-waymo-san-bruno-police-dept_7036824.png?20250930085150",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-30 07:17:00",
        "Headline": "Police say legislation enabling officers to issue notices directly to companies is being prepared - but, for now, they can't sanction a \"robot\".",
        "Content": "Police in California stopped a car after seeing it do an illegal U-turn - only to discover it was driverless. The Waymo was spotted making the manoeuvre \"right in front\" of officers at a light, San Bruno Police Department said. \"Since there was no human driver, a ticket couldn't be issued,\" it said, adding officers cannot book a \"robot\". There was \"no driver, no hands, no clue\", the police department quipped, describing the experience as coming with a \"plot twist\". The vehicle pulled over as soon as officers flashed their lights and sounded a siren. They were then able to talk to someone from Waymo using equipment inside the car. The police department said it was hopeful \"reprogramming\" would stop the vehicle from making any more illegal moves. Legislation is being prepared to enable officers to issue notices directly to companies. Read more from Sky News:Netanyahu backs Trump's peace plan for GazaPutin issues defiant message over Ukraine Waymo told Sky News' US partner network NBC it is \"looking into the situation\" and committed to improving safety through \"ongoing learnings and experience\". The company has been operating autonomous cars in San Bruno since June. Earlier in the year, another of its cars started driving around in circles. Last year, Waymo was forced to fix a fleet of its cars after residents complained about their constant honking."
    },
    {
        "title": "YouTube to settle lawsuit with Trump over account suspension",
        "description": "YouTube has agreed to pay $24.5m (&#163;18.1m) to settle a lawsuit brought by Donald Trump after it banned his account following the January 6 Capitol riot.",
        "url": "https://news.sky.com/story/youtube-to-settle-lawsuit-with-trump-for-banning-his-account-13441323",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-trump-youtube_7036722.jpg?20250930020950",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-30 00:28:00",
        "Headline": "YouTube was not the only platform to take action against Donald Trump over the deadly riot in Washington DC in 2021 - he was also suspended by Meta and Twitter, now X, before being reinstated several years later.",
        "Content": "YouTube has agreed to pay $24.5m (£18.1m) to settle a lawsuit brought by Donald Trump after it banned his account following the January 6 Capitol riot. The US president was suspended from the Google-owned platform over his role in the insurrection, which saw his supporters attempt to stop Joe Biden's 2020 election win from being ratified. More than four years on from the violent scenes that left a police officer dead, court documents filed on Monday revealed that $22m (£16.3m) from the settlement will go towards a trust for Washington DC's National Mall and the construction of a White House ballroom. The remainder will be paid to other parties involved in the case, including the American Conservative Union.  Google declined to comment on the reasons for the settlement, which does not constitute an admission of liability. Mr Trump's YouTube account has been back online since 2023. Read more from Sky News:Trump wants to govern Gaza with Blair Google's parent company Alphabet is the third tech firm to settle with Mr Trump over what he perceived as an illegitimate muzzling of him online following the riot. He was also suspended from Meta's platforms and Twitter, moves which saw him gravitate towards his own social media platform - Truth Social. The president and his supporters have falsely maintained that the 2020 election was stolen.  Meta - which owns Facebook and Instagram - agreed to pay $25m (£18.6m) to settle Mr Trump's lawsuit, and X (what Twitter became after being bought by Elon Musk in 2022) settled for $10m (£7.4m). Alphabet boss Sundar Pichai, Meta's Mark Zuckerberg, and Mr Musk all attended Mr Trump's inauguration this year, with the latter having been a key contributor to his 2024 election campaign. He led the Trump administration's cost-cutting DOGE unit during the early months of 2025."
    },
    {
        "title": "The show might not go on: Broadway stars ready to strike",
        "description": "Broadway actors are preparing to exit the stage in a strike that would shutter more than 30 productions ahead of its peak season.",
        "url": "https://news.sky.com/story/the-show-might-not-go-on-broadway-stars-ready-to-strike-13441996",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-lion-king-broadway_7037799.jpg?20251001003727",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-30 22:53:00",
        "Headline": "Following in the footsteps of Hollywood and the video game industry, New York's world-famous theatre district could soon fall victim to strike action.",
        "Content": "Broadway actors are preparing to exit the stage in a strike that would shutter more than 30 productions ahead of its peak season. Actors' Equity, a union representing 900 performers and stage managers in New York's iconic theatre scene, said a walkout was on the cards due to a dispute over healthcare. It's negotiating with the Broadway League, a trade body representing theatre owners, producers, and operators. A previous three-year contract expired earlier this week. The union wants the league to increase its contribution to its healthcare fund, which is expected to fall into a deficit before next May. The rate of contributions has remained unchanged for more than a decade. Actors' Equity president Brooke Shields said: \"Asking our employers to care for our bodies, and to pay their fair share toward our health insurance is not only reasonable and necessary, it's an investment they should want to make toward the long-term success of their businesses.\" She added: \"There are no Broadway shows without healthy Broadway actors and stage managers. And there are nohealthy actors and stage managers without safe workplaces and stable health insurance.\" The Broadway League said it was \"continuing good-faith negotiations\" to \"reach a fair agreement\" that works for \"shows, casts, crews, and the millions of people from around the world who come to experience Broadway.\" Read more from Sky News:Boyzone announce reunionJK Rowling hits out at Emma Watson Should Broadway fall victim to strike action, it would follow in the footsteps of Hollywood - where writers walked out in 2023, curtailing a number of major productions - and the US video game industry in 2025, with concerns around the use of AI a key driver. Actors' Equity has not carried out a major strike since 1968, when a three-day dispute shut down 19 shows. An intervention from the New York City mayor helped both sides come to a deal."
    },
    {
        "title": "Why emergency Eurovision vote on Israel might not stop a broadcast boycott",
        "description": "Eurovision is supposed to be a celebration of the unifying power of music. But for the past two years, it has attracted protests and fan boycotts over its inclusion of Israel amid the country's continued military action in Gaza.",
        "url": "https://news.sky.com/story/why-emergency-eurovision-vote-on-israel-might-not-stop-a-broadcast-boycott-13441717",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eurovision-israel-gaza_7017931.jpg?20250930212636",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-09-30 16:18:00",
        "Headline": "A number of countries have vowed not to take part in Eurovision if Israel participates.",
        "Content": "\n          Arts and entertainment correspondent\n        Eurovision is supposed to be a celebration of the unifying power of music. But for the past two years, it has attracted protests and fan boycotts over its inclusion of Israel amid the country's continued military action in Gaza. Ahead of 2026's contest, while nobody has even sung a note yet, a number of countries have been getting vocal. \"If Israel is there, we won't be there,\" says Natalija Gorscak, the president of broadcaster RTV Slovenia. As the world waits to see what happens with the negotiations over Donald Trump's Gaza peace plan, within the cultural world, there's no let up in the increasing isolation of Israel. Slovenia and broadcasters from Spain, the Netherlands, Ireland, and Iceland have all issued statements saying if Israel's allowed to enter, they'll consider boycotting the contest next year. Jolted into action by the controversy, officials from the European Broadcasting Union (EBU) - which runs the contest - have announced plans for an emergency vote. In a letter to members, EBU president Delphine Ernotte-Cunci said \"given that the union has never faced a divisive situation like this before\", the board agreed it \"merited a broader democratic basis for a decision\". Described by the EBU as \"an extraordinary meeting of [its] general assembly to be held online\", early next month member countries will be asked to vote on whether Israel should or shouldn't participate. Eurovision expert Dr Paul Jordan said: \"Ultimately this has been a really challenging issue for the EBU. This is a really complex picture that is building up… and they've not been consistent. \"The situation is made even more complicated by the fact the organisers themselves haven't sometimes followed their own rules about political entries and about political messaging, and they've allowed certain countries to, in a sense, get away with breaking the rules or deeming them to have not broken the rules sufficiently to allow participation. \"As far as I'm aware, the Israeli broadcaster has not broken any rules. However, you could argue their inclusion could indeed bring the contest into disrepute, which would be against the organisers' rules.\" 'We should focus on music' In 2023, Israel was represented by Noa Kirel, her country's equivalent to Britney Spears. She came third with her song Unicorn. \"It was one of the highlights in my career, it was an incredible experience for me,\" she said. While she acknowledges \"it's very different from two years ago when I represented Israel\", she hopes her country won't be excluded next month. \"It's not about politics, it's never been like that, and we should keep it that way, to focus on music.\" She believes it would be unfair to punish the Israeli people for the actions of their government: \"Voters understand that politics has no connection to this competition. \"Hopefully people will understand and respect that, see the good side… and not the bad side.\" 'European policy needs more balls' Regardless of the outcome of next month's vote, Ireland, Iceland, and Slovenia have all confirmed to Sky News that their plans to boycott will stand as long as Israel's still at war. Ms Gorscak said: \"We can lie to ourselves and say 'no, it's not political' but, you know, you can't avoid politics.\" She believes it's fundamentally wrong for bigger countries to be sitting on the fence. \"We are all somehow prisoner of German guilt towards Israel,\" she claimed. \"European policy, it needs more balls. In certain moments somebody needs to decide, somebody needs to say 'this is enough'.\" A spokesperson for German broadcaster SWR has said it \"supports the consultation process that has been initiated\" and that the goal is \"to reach a well-founded and sustainable agreement that aligns with the values of the EBU\". Read more:Spain votes to boycott Eurovision if Israel competesVienna chosen to host Eurovision Song Contest 2026 Whether Spain abides by the outcome of next month's vote might have the biggest impact. If it makes good on its threat to boycott - as one of the big five backers of Eurovision - financially it'll hurt. Ms Gorscak explained: \"Slovenia is a small country, and while our participation fee is peanuts, if there are more countries who are not participating it is seen in the budget.\" Israel's public broadcaster, KAN, has said its \"potential disqualification… could have wide-ranging implications for the competition and the values for which the EBU stands\". Dr Jordan said up until now we've mostly seen \"virtue signalling\" when it comes to Eurovision artists speaking out who've ultimately opted to perform regardless of their objections to Israel's inclusion on the night. However, should entire nations boycott in 2026, he said the impact will be felt way beyond the contest's final. \"There are two semi-finals, because of the number of participating countries, and if there isn't a need for two semi-finals that will impact upon the logistics of the event and even the funding,\" he explained. Pop bangers and power ballads aside, the criticism of the EBU has become deafeningly loud. The world waiting and watching for political decisions - and cultural ones too."
    },
    {
        "title": "Boyzone explain why Mikey Graham missed reunion announcement - and Louis Walsh won't be involved in show",
        "description": "Boyzone say Louis Walsh has no involvement in their forthcoming reunion show and will not be taking a cut of the profits.",
        "url": "https://news.sky.com/story/boyzone-explain-why-mikey-graham-missed-reunion-announcement-and-louis-walsh-wont-be-involved-in-show-13441695",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-shane-lynch-ronan-keating_7037099.jpg?20250930125141",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-09-30 16:14:00",
        "Headline": "Ronan Keating, Keith Duffy and Shane Lynch tell Sky News that meeting Mikey Graham for the first time in nearly seven years is a \"big moment\", but there is still no love lost between the band and Louis Walsh.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Boyzone say Louis Walsh has no involvement in their forthcoming reunion show and will not be taking a cut of the profits. One of the biggest boybands of the 90s, the Irish group announced they will be reuniting for their \"biggest show yet\" next summer, performing at the Emirates Stadium in London on 6 June. But while all four remaining members of the band had been due to attend a press announcement at the London Irish Centre in Camden on Tuesday, Mikey Graham was not in attendance. When asked if they had been expecting him, Ronan Keating tells Sky News: \"Mikey apologises for not being here today in person for personal reasons. We'll see him soon, and he will be there on the night.\" He goes on: \"We'll see Mikey in 20 minutes, and he will be there on 6 June\". It will be the first time the four band members have been back in the same room in nearly seven years, following a five-night run at the London Palladium in 2019. Keith Duffy admits: \"It's a big moment.\" \n                  Ronan Keating, Keith Duffy, Shane Lynch and Mikey Graham will perform a headline show – and promise to remember Stephen Gately too\n                 \n                  Ronan Keating criticises 'broken' justice system as brother's killer avoids prison\n                 \n                  Ronan Keating on boyband fame in the 90s: 'Our duty of care meant nothing'\n                 Shane Lynch, who has been open about previous disagreements with his fellow bandmates, says: \"I can't wait to see Mick. And I'm super excited for him.\" 'We stopped talking to Louis Walsh' Mention of their former manager is met with less warmth. When asked if Louis Walsh is involved with the one-off show, Keating says: \"No. Louis hasn't been involved in Boyzone for a very long time, before the documentary, even well before the documentary. We stopped talking to him. \"He's very much working with Westlife and those things.\" As for whether Walsh will be taking a cut of the profits, all three band members laugh like drains at the suggestion. Lynch is the first to stop, gathering himself and saying: \"Louis, he was the beginning of the band at least, you know, certainly it's not the end of the band at this point. I love and respect the man by all means. But we have moved on.\" 'Going out on a high' Indeed, the four Dublin lads are in a very different place 33 years after they were thrust into the limelight as teenagers, with just Graham just a little older than the rest at 21. Keating clarifies this time, they are the ones calling the shots: \"We're the ones in the driving seat… We're doing on our terms.\" This time, Keating says it's a journey he intends to make the most of: \"We didn't get to celebrate the 90s at all. We didn't get to enjoy our success. Everybody else did, we didn't. You know, boo hoo, we're not crying. We had a hell of a time. We're okay with that… We're going to go out on a high\". He's also adamant this is a one-off: \"It's not gonna go further than the show. This is it.\" Read more: Ronan Keating on boyband fame in the 90s Of course, Stephen Gately's untimely death in 2009, as a result of an undiagnosed heart condition, means the full band will never again take to the stage, but Keating, Duffy and Lynch say the show will be a time to remember Gately. Giving away no details as to how, Keating says: \"There will be a moment in the show for Stephen… Getting that right is important.\" With around eight months to prepare, the pressure is now on the band to deliver. Duffy says: \"It's a big effort to get this kind of show together. It's been seven years. We didn't expect it. It's not like every five to seven years, we always had an idea, we'll end up seeing each other and sharing the stage together. It was a definite no.\" Boyzone: No Matter What All three admit the three-part Sky documentary Boyzone: No Matter What, which aired at the start of the year, has played a big role in their change of heart. And now, with a new chapter ahead of them, could there be a fourth part in the works? Keating is hopeful. \"Wouldn't it be lovely to have that, closure and that fourth episode? Never say never. \"We haven't agreed anything, it hasn't been planned. Yeah, there are cameras around and it's a decision we've made with Curious [the production company who made the documentary] to document this, because it's a monumental time for us.\" Monumental indeed, and following the recent trend for 90s reunions, the band's members - no longer boys but in some cases grandfathers - will be hoping fans turn out to show their love, no matter what. Boyzone will perform at the Emirates Stadium in London on 6 June, with yet to be announced special guests. Boyzone: No Matter What is available on Sky and streaming service Now"
    },
    {
        "title": "Ronan Keating, Keith Duffy, Shane Lynch and Mikey Graham will perform a headline show – and promise to remember Stephen Gately too",
        "description": "Boyzone are reuniting for their biggest ever headline show next summer, inspired by the success of their recent documentary Boyzone: No Matter What.",
        "url": "https://news.sky.com/story/ronan-keating-keith-duffy-shane-lynch-and-mikey-graham-will-perform-a-headline-show-8211-and-promise-to-remember-stephen-gately-too-13441179",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-boyzon-shane-lynch_7036439.jpg?20250930171700",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-30 07:00:00",
        "Headline": "Best known for hits like Words and All That I Need, Boyzone will perform at the Emirates Stadium in London on 6 June.",
        "Content": "Boyzone are reuniting for their biggest ever headline show next summer, inspired by the success of their recent documentary Boyzone: No Matter What. Ronan Keating, Keith Duffy, Shane Lynch and Mikey Graham will perform live at Emirates Stadium, London, on Saturday 6 June 2026. It will be the first time they've performed together since a five-night run at the London Palladium in 2019, and will be the largest show of their entire career anywhere in the world. In January, a three-part documentary celebrated their success, as well as revealing the dark side of being in a boyband in the 1990s. One of the biggest pop groups of the era, the five-working class lads from Dublin formed in 1993, put together by talent manager Louis Walsh. They broke into the UK charts the following year. Six number one hits and five number one albums followed, with 25 million records sold across the world. Stephen Gately's untimely death back in 2009, as a result of an undiagnosed heart condition, means the full band will never again take to the stage, but the remaining band members say the show will be a time to remember Gately. \n                  Boyzone explain why Mikey Graham missed reunion announcement - and Louis Walsh won't be involved in show\n                 \n                  Ronan Keating criticises 'broken' justice system as brother's killer avoids prison\n                 \n                  Ronan Keating on boyband fame in the 90s: 'Our duty of care meant nothing'\n                 Read more: Ronan Keating on boyband fame in the 90s Boyzone said: \"We've been truly blown away and humbled by the response to the documentary this year. The love we've felt from fans all over the world has inspired us to create the ultimate experience together, headlining our own stadium show. \"The four of us can't wait to stand together again and enjoy One For The Road.\" Ticket pre-sale kicks off on Tuesday 7 October at 9am, with remaining tickets going on general sale 9am on Friday 10 October. With hits including Words, No Matter What and Love Me For A Reason, the band have four BRITs and an Ivor Novello award, and after reuniting in 2007, they performed four sell-out UK arena tours between 2008-2019. Boyzone: No Matter What is available on Sky and streaming service Now"
    },
    {
        "title": "Prosecutors call for 11-year jail sentence for Sean 'Diddy' Combs",
        "description": "Federal prosecutors in New York are urging a judge to sentence  Sean \"Diddy\" Combs to more than 11 years in prison.",
        "url": "https://news.sky.com/story/prosecutors-call-for-11-year-jail-sentence-for-sean-diddy-combs-13441349",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2010_6983152.jpg?20250805092129",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-30 05:42:00",
        "Headline": "While the former rapper's defence lawyers have suggested a sentence of 14 months, prosecutors are calling for much longer - and a fine of $500,000.",
        "Content": "Federal prosecutors in New York are urging a judge to sentence  Sean \"Diddy\" Combs to more than 11 years in prison. Following the hip-hop mogul's conviction on prostitution-related charges, they also want him to be fined $500,000 (£372,000), according to court filings. Last week, defence lawyers urged a 14-month sentence. Due to time served, that would enable him to walk free almost immediately - following his arrest in September last year. But he could, in theory, face up to 20 years in jail after being found guilty of two counts of transportation for engagement in prostitution. Each charge carries a maximum sentence of 10 years. Judge Arun Subramanian, a US district judge, is due to sentence Combs in Manhattan on Friday.  During his trial, prosecutors said Combs coerced two of his former girlfriends to take part in what were described as \"freak offs\". He was found guilty of transporting male prostitutes across state lines to take part in those events. Both women testified that Combs physically attacked them and threatened to cut off financial support if they refused to take part. However, while jurors believed Combs broke the law over using sex workers, they did not find the sexual encounters involving the women were non-consensual, which is what prosecutors had argued. Combs was cleared of the more serious charges of sex-trafficking and racketeering conspiracy. Read more from Sky News:JK Rowling hits out at Emma Watson over transgender issuesPenny Lancaster says she felt 'belittled' by Gregg Wallace In a written legal submission, his defence team has detailed \"inhumane\" conditions at the Metropolitan Detention Center in Brooklyn, New York. They said the food sometimes contains maggots, that the rapper is routinely subjected to violence, and that he has \"not breathed fresh air in nearly 13 months\". They also said his \"career and reputation have been destroyed\". His legal team said Combs had been \"adequately punished\" already, was sober \"for the first time in 25 years\", and had helped other inmates by creating an educational programme on business management and entrepreneurship."
    }
]