[
    {
        "title": "Gaza ceasefire 'resumes' after killings and suspension of aid test fragile truce",
        "description": "The Israeli military has said that a ceasefire in Gaza would hold after it was seriously tested by an attack that killed two Israeli soldiers and a wave of airstrikes that killed 36 Palestinians.",
        "url": "https://news.sky.com/story/gaza-ceasefire-resumes-after-killings-and-suspension-of-aid-test-fragile-truce-13453671",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wounded-palestinian-boy_7056099.jpg?20251020005005",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-19 20:45:00",
        "Headline": "Israeli airstrikes killed at least 36 in Gaza on Sunday, which Israel said it launched in retaliation to deadly attacks by Hamas militants in Rafah.",
        "Content": " The Israeli military has said that a ceasefire in Gaza would hold after it was seriously tested by an attack that killed two Israeli soldiers and a wave of airstrikes that killed 36 Palestinians. Aid supplies into the enclave are due to resume on Monday following US pressure, an Israeli security source said, shortly after Israel announced a halt in supplies in response to what it called a \"blatant\" violation by Hamas of the truce. A little over a week has passed since the start of the US-proposed ceasefire aimed at ending two years of war. Israel's military said militants fired at troops in areas of Rafah city that are Israeli-controlled, according to agreed-upon ceasefire lines. The military said Israel responded with airstrikes and artillery, hitting dozens of Hamas targets. It also said its forces struck \"terrorists\" approaching troops in Beit Lahiya in the north. Health officials said at least 36 Palestinians were killed across Gaza, including children. One airstrike hit a former school sheltering displaced families in the area of Nuseirat, killing four people, according to Al Awda Hospital, which received the casualties. \n                  Israel identifies body of dead hostage returned by Hamas\n                 \n                  'I know him, but he doesn't know me': The Israelis who see it as duty to mourn their collective dead\n                 \n                  Trump threatens Hamas after group suggests no more hostage bodies can be returned\n                 Another hit a tent in the Muwasi area of Khan Younis in the south, killing at least four people, including a woman and two children, according to Nasser Hospital. Read more:Israel identifies body of dead hostageWatch: Evidence of Israeli support for Gaza militiaViolence that plagues Gaza Israeli Prime Minister Benjamin Netanyahu directed the military to take \"strong action\" against any ceasefire violations but did not threaten to return to war. The armed wing of Hamas continued to accuse Israel of multiple ceasefire violations, but said it remained committed to the ceasefire agreement. It said communication with its remaining units in Rafah had been cut off for months, adding \"we are not responsible for any incidents occurring in those areas\". In a statement on social media on Sunday evening, the IDF said it had \"begun the renewed enforcement of the ceasefire, in line with the terms of the agreement\". \"The IDF will continue to uphold the ceasefire agreement and will respond firmly to any violation of it,\" it added. An Israeli source told Sky News: \"The bottom line is that we're done responding. We are now back to where we were this morning before their attack.\" Fearing the truce may collapse, some Palestinians, many of whom have lacked sufficient food for months, rushed to buy goods from the main market in Nuseirat. Further south in Khan Younis, other families fled their homes and shelters after airstrikes hit nearby.  Major hurdles still stand in the way of a long-lasting peace in Gaza. An earlier ceasefire collapsed in March when Israel launched a barrage of airstrikes. The new ceasefire began on 10 October, but for days the Israeli government and Hamas have been trading accusations of ceasefire violations. A senior Egyptian official involved in the ceasefire negotiations said \"round-the-clock\" contacts were under way to de-escalate the situation. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Israel on Saturday pressed Hamas to returning the remains of all 28 dead hostages as promised under the ceasefire, saying the Rafah border crossing between Gaza and Egypt would stay closed \"until further notice\". Hamas says it has no reason to keep the bodies of the remaining hostages, but that it needs special equipmentrecover corpses buried under rubble. A Hamas delegation led by chief negotiator Khalil al Hayya has arrived in Cairo to follow up the implementation of the ceasefire deal with mediators and other Palestinian groups. The next stages are expected to focus on disarming Hamas, Israeli withdrawal from additional areas it controls in Gaza, and future governance of the devastated territory. The US plan proposes the establishment of an internationally-backed authority."
    },
    {
        "title": "Lingering dread over what else about Prince Andrew could still emerge",
        "description": "Just a cursory glance at the headlines, and it's clear the disgrace and downfall of Prince Andrew is not over.",
        "url": "https://news.sky.com/story/lingering-dread-over-what-else-about-prince-andrew-could-still-emerge-13453340",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-prince-william_7055559.jpg?20251019163938",
        "type": "Home",
        "Author": "Laura Bundock",
        "Date Published": "2025-10-19 14:44:00",
        "Headline": "Fresh claims about Prince Andrew say he asked his taxpayer-funded protection officer to investigate his accuser - whose allegations he has always denied. The latest scandal shows the monarchy is far from free of the ongoing saga.",
        "Content": "\n          Royal correspondent\n              @laurabundock\n  Just a cursory glance at the headlines, and it's clear the disgrace and downfall of Prince Andrew is not over. So what next for the man and the monarchy? The King might have hoped his involvement showed direct action had been taken. He certainly does not want any distraction from his upcoming state visit to the Vatican. But that might be wishful thinking. Now the Met Police has been dragged in too. Forced to look into reports in the Mail on Sunday that Andrew asked his protection officer to smear his accuser, Virginia Giuffre.  The prince allegedly wanted his officer to dig up dirt, and told an aide at the palace what he had done. Let's be clear: back then, Andrew's security was funded by the taxpayer. So are we reaching the endgame, and what does that look like? Andrew might have given up the use of his title, Duke of York, and other honours too. But what about his style 'prince'? Some want that ditched too. It's a complicated but not impossible process. Andrew could, of course, just stop using it voluntarily. Some want him to give up his home, too. For a non-working royal, the stately Royal Lodge, with its plum position on the Windsor Estate, is an uncomfortable optic. Andrew's wider family is worried. The Sunday Times has reported that the Prince of Wales wants him cut off completely. With the reputation of the monarchy at risk, William does not want to appear weak. He's putting loyalty to \"the firm\" firmly above his familial relationships. Prince Andrew has always strongly denied the allegations, and restated on Friday: \"I vigorously deny the accusations against me\". Sky News has approached him for comment on the fresh allegations set out in the Mail on Sunday. But with Virginia Giuffre's tragic death and posthumous memoir due out on Tuesday, Buckingham Palace will be braced for more scandal. When Andrew gave up his titles, there was certainly a sense of relief. There is now a sense of dread over what else could emerge."
    },
    {
        "title": "Tel Aviv football derby cancelled after 'violent riots', as club describes 'brutal police violence'",
        "description": "A football derby in Tel Aviv between Hapoel and Maccabi has been cancelled after \"violent riots\", according to Israeli police, although one club has criticised officers who appeared to be \"preparing for war rather than a sporting event\".",
        "url": "https://news.sky.com/story/tel-aviv-football-derby-cancelled-as-violent-riots-see-nine-arrested-13453239",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bloomfield-stadium_7056102.jpg?20251020010957",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-19 20:16:00",
        "Headline": "Police said dozens of smoke grenades and pyrotechnic devices were thrown, injuring 13 civilians and three police officers. But Hapoel Tel Aviv football club has claimed there was \"brutal police violence\" and \"officers indiscriminately beating fans\".",
        "Content": " A football derby in Tel Aviv between Hapoel and Maccabi has been cancelled after \"violent riots\", according to Israeli police, although one club has criticised officers who appeared to be \"preparing for war rather than a sporting event\". Nine people were arrested on Sunday night at Bloomfield Stadium, a venue shared by both clubs and which Hapoel was the designated home team for the game. A statement from Israeli police said the game was called off \"following disturbances and violent riots\" in which 13 civilians and three officers were injured by pyrotechnic devices. \"These are very serious incidents that posed a real danger to the lives of police officers and civilians,\" the statement added. But Hapoel Tel Aviv Football Club released a statement with a very different perspective of policing at the match. \"From the preliminary discussions prior to the match, it appears that the police were preparing for war rather than a sporting event. \"Most of the injuries from the event were caused by brutal police violence at the end of the game, as a direct result of the scandalous decision to cancel the event. \"Everyone saw the disturbing videos of children being trampled by horses and police officers indiscriminately beating fans.\" Israeli police have not yet responded to the allegations from Hapoel. A Maccabi statement read: \"Following the police's decision, it was determined that the Tel Aviv derby will not take place tonight.\" Footage shared by the police shows projectiles and flares being thrown on to the pitch, as well as unrest outside the stadium and arrests being made. Maccabi ban criticised On Thursday, Maccabi supporters were told they are not allowed to attend November's Europa League game against Aston Villa in Birmingham next month after a decision by Birmingham's Safety Advisory Group (SAG). The group - made up of local stakeholders, including representatives from the council, police and event organisers - said the decision was due to a high risk of violence based on \"current intelligence and previous incidents\". Ed Miliband told Sky's Sunday Morning With Trevor Phillips that ministers are \"working with the relevant authorities\" to secure additional resources and ensure fans of both teams can attend next month's European clash. He insisted Aston in Birmingham cannot become a \"no-go area\" for Jews.  The energy secretary also said that he \"profoundly\" disagrees with the \"approach\" taken by a local MP who started a petition calling for fans of Maccabi Tel Aviv to be banned from the Aston Villa game. The petition states: \"Their arrival in Aston - a diverse and predominantly Muslim community - poses a real risk of tensions within the community and disorder.\" Mr Miliband pushed back on that point. He said the \"vast majority of Muslim people in this country would disassociate themselves\" from suggestions that Maccabi Tel Aviv fans could not come to Aston Villa because it was a predominantly Muslim area. His Tory counterpart, Claire Coutinho, was also highly critical of the petition, telling Phillips: \"I think politicians need to have the courage to name some of the problems that this country is facing. And one of those problems is political Islam.\" Read more from Sky News:Maccabi ban could be reversedWhy are Maccabi Tel Aviv fans banned?Analysis: Ban raises serious questions Petition reaction 'false and inflammatory' The independent MP for Birmingham Perry Barr, Ayoub Khan, criticised those comments. \"I utterly reject the false and inflammatory characterisations... regarding my recent petition,\" he said in a statement. \"The petition I launched reflected genuine and widespread concern from my constituents about public safety and community cohesion. It did not call for anyone to be 'banned because they are Jewish' nor did it single out any faith or ethnicity. \"To distort this into an issue of religion or antisemitism is deeply irresponsible and frankly dangerous. I have consistently condemned all forms of hatred - including antisemitism and Islamophobia - and I will continue to do so.\" The government is expecting West Midlands Police to set out early next week what they would need to police the game safely with both sets of fans present."
    },
    {
        "title": "Eight 'priceless' objects stolen in Louvre museum heist named - as authorities reveal details of daring raid",
        "description": "Eight \"priceless\" objects stolen in a daring heist at the Louvre museum in Paris have been named by the French culture ministry. ",
        "url": "https://news.sky.com/story/louvre-museum-in-paris-closed-after-robbery-13453106",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-the-louvre-heist_7055729.jpg?20251019182852",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-19 09:19:00",
        "Headline": "Intruders entered via a basket lift using a platform mounted on a lorry, breaking a window and making off with jewels that \"have genuine heritage value and are, in fact, priceless,\" France's interior minister said.",
        "Content": " Eight \"priceless\" objects stolen in a daring heist at the Louvre museum in Paris have been named by the French culture ministry.  The world-famous museum was forced to close on Sunday after thieves accessed a gallery containing the French Crown Jewels at around 9.30am local time. A ninth item was stolen but recovered at the scene, the Paris prosecutor said - as an art detective told Sky News that police face \"a race against time\" to find the other items before they are dismantled and melted down. The French culture ministry said the items stolen were: • Tiara from the set of Queen Marie-Amelie and Queen Hortense • Necklace from the sapphire set of Queen Marie-Amelie and Queen Hortense • Earring, from the pair belonging to the sapphire set of Queen Marie-Amelie and Queen Hortense • Emerald necklace from the Empress Marie Louise set • Pair of emerald earrings from the Empress Marie Louise set • Brooch known as the \"reliquary brooch\" • Tiara of Empress Eugenie • Large corsage bow brooch of Empress Eugenie. French publication Le Parisien previously reported that the object recovered at the museum was the crown of Napoleon III's wife, Empress Eugenie, and it was broken.  Authorities revealed details of the raid after the museum, which is the world's most popular and draws up to 30,000 visitors a day, said on X that it was closing for \"exceptional reasons\". Culture minister Rachida Dati said footage of the operation showed the thieves \"don't target people, they enter calmly in four minutes, smash display cases, take their loot, and leave\". \"No violence, very professional,\" she told TF1. How the robbery unfolded French interior minister Laurent Nunez said the \"major robbery\" involved intruders entering the museum via a basket lift using a platform mounted on a lorry. It is not clear if they brought any or all of the equipment they used with them, as construction work is taking place along the River Seine side of the sprawling building, where the break-in occurred. Mr Nunez said: \"They broke a window and went towards several display cases where they stole jewellery. These are jewels that have genuine heritage value and are, in fact, priceless.\" The interior ministry said the criminals fled on two motorbikes. No injuries have been reported. The number of robbers has not been confirmed but Mr Nunez told France Inter that three or four thieves got into the museum. The gang was well prepared and had scouted the venue, Mr Nunez said, adding they cut window panes \"with a disc cutter\" before escaping \"on a TMAX\", a type of Yamaha maxi-scooter. Forensic work is now underway and a detailed list of the stolen items is being compiled following the break-in, which took place between 9.30 and 9.40am (8.30-8.40am UK time). Once in, they made for the Galerie d'Apollon (Apollo Gallery), home to a selection of the French Crown Jewels, the interior ministry said. French daily newspaper Le Parisien, citing police, said the suspects wore hoods and were carrying \"small chainsaws\". The robbers reportedly escaped with nine pieces of jewellery, including a necklace, a brooch and a tiara from the Napoleon and French Sovereigns display cases, the newspaper reported. Two suspects were inside while a third stayed outside, Le Parisien said. Police face 'a race against time'  Art detective Arthur Brand told Sky News the heist is \"the theft of the decade\" - adding in order to recover the \"priceless\" items, police will need to find the culprits in just one week. \"These crown jewels are so famous, you just cannot sell them,\" Mr Brand said. \"The only thing they can do is melt the silver and gold down, dismantle the diamonds, try to cut them. That's the way they will probably disappear forever.\" He continued: \"They [the police] have a week. If they catch the thieves, the stuff might still be there. If it takes longer, the loot is probably gone and dismantled. It's a race against time.\" French President Emmanuel Macron said in a post on X: \"We will recover the works and the perpetrators will be brought to justice. \"Everything is being done, everywhere, to achieve this,\" he added. What is in the Galerie d'Appollon? The Galerie d'Appollon is an enormous room on the upper floor of the Petite Galerie, which houses the French Crown Jewels as well as the royal collection of hardstone vessels, paintings, tapestries and medallions, the museum's website said. Rebuilt by Louis XIV after a fire, it is home to three historical diamonds - the Regent, one of the most famous diamonds in the world, the Sancy and the Hortensia. At 140 carats, the Regent is exceptional in terms of size, weight and purity and when it was found in India in 1698, it was the largest known diamond at the time. Social media users posted pictures and videos from in and outside the building, with one showing people leaving in \"total panic\". One person on X who said they were there reported a confused-sounding scene of police \"running\" near the museum's famous pyramid \"and trying to enter... from glass side doors but they were locked and they could not enter\". \"Everyone inside was running and banging on glass doors to get out, but could not open. Police and military police arrived,\" they added. History of Louvre break-ins This is not the first time thieves have targeted the museum. In 1911, the Mona Lisa, now protected by bulletproof glass, vanished from its frame, stolen by a former worker who hid inside the museum and walked out with the painting under his coat. Read more on Sky News:Investigation into latest Andrew claimsRock bassist dies at 48Socialite Goldsmith dies It was recovered two years later in Florence - an episode that helped make Leonardo da Vinci's portrait the world's best-known artwork. In 1983, two Renaissance-era pieces of armour were stolen - and were only recovered in 2021, nearly four decades later. The museum's collection also bears the legacy of Napoleonic-era looting, containing 33,000 works of art, including antiquities, sculptures and paintings. In addition to the Mona Lisa, its star attractions feature the Venus de Milo and the Winged Victory of Samothrace."
    },
    {
        "title": "Families whose loved ones took their lives after buying poison online write to PM",
        "description": "Bereaved families whose loved ones took their own lives after buying the same poison online have written to the prime minister demanding urgent action.",
        "url": "https://news.sky.com/story/families-whose-loved-ones-took-their-lives-after-buying-poison-online-write-to-pm-13453641",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hannah-aitken_7053997.png?20251018135826",
        "type": "Home",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2025-10-19 23:01:00",
        "Headline": "Analysis shows at least 133 people have died because of a poison advertised on online forums - and lawyers representing the families say they want a public inquiry into their loved ones' deaths.",
        "Content": "By Laura Bundock, health correspondent  Bereaved families whose loved ones took their own lives after buying the same poison online have written to the prime minister demanding urgent action. Warning: This article contains references to suicide The group claims there have been \"multiple missed opportunities\" to shut down online forums that promote suicide and dangerous substances. They warn that over 100 people have died after purchasing a particular poison in the last 10 years. Among those who have written to Downing Street is Pete Aitken, whose daughter Hannah was 22 when she took her own life after buying the poison from a website. Hannah was autistic and had ADHD. She was treated in six different mental health hospitals over a four-year period. Mr Aitken recently spoke to Sky News around the second anniversary of Hannah's death. \n                  Hannah, 22, died after buying poison online - why her death raises serious questions for NHS\n                 \n                  Simple joy of jumping in puddles or climbing trees is out of reach for millions of children\n                 \n                  Prince William visibly moved during reunion with bereaved mother\n                 He said: \"Autistic people seem to be most vulnerable to this kind of sort of poison and, you know, wanting to take their lives.\"  Sky News is not naming the poison, but Hannah was able to buy a kilogram of it online. Just one gram is potentially fatal. \"There's this disparity between the concentration required for its legitimate use and that required for ending your life. And it seems quite clear you could make a distinction,\" Mr Aitken said. Analysis from the Molly Rose Foundation and the group Families and Survivors to Prevent Online Suicide Harms says at least 133 people have died because of the poison. It also says coroners have written warnings about the substance on 65 separate occasions. The report accuses the Home Office of failing to strengthen the regulation of the poison and says not enough is being done to close dangerous suicide forums online. Lawyers representing the group want a public inquiry into the deaths. In a joint letter to the prime minister, the families said: \"We write as families whose loved ones were let down by a state that was too slow to respond to the threat. \"This series of failings requires a statutory response, not just to understand why our loved ones died but also to prevent more lives being lost in a similar way.\" Read more from Sky News:Blood test for more than 50 cancers 'could transform outcomes'Warning of six million new cancer cases - with these areas worst hitHospital accused of 'covering up' concerns about suspended surgeon The group's lawyer, Merry Varney, from Leigh Day, said: \"The government is rightly committed to preventing deaths through suicide, yet despite repeated warnings of the risks posed by an easily accessible substance, fatal in small quantities and essentially advertised on online forums, no meaningful steps have been taken.\" A government spokesperson said: \"Suicide devastates families and we are unequivocal about the responsibilities online services have to keep people safe on their platforms. \"Under the Online Safety Act, services must take action to prevent users from accessing illegal suicide and self-harm content and ensure children are protected from harmful content that promotes it. \"If they fail to do so, they can expect to face robust enforcement, including substantial fines.\" They added that the position is \"closely monitored and reportable under the Poisons Act, meaning retailers must alert authorities if they suspect it is being bought to cause harm\". \"We will continue to keep dangerous substances under review to ensure the right safeguards are in place,\" they said. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Government announces plans for new V Levels qualification after PM pledged to get two-thirds of young people into higher-level learning",
        "description": "The government is announcing the creation of new V Levels qualifications for students age 16-19 in what is being billed as a major overhaul of the education system.",
        "url": "https://news.sky.com/story/government-announces-plans-for-new-v-levels-qualification-after-pm-pledged-to-get-two-thirds-of-young-people-into-higher-level-learning-13453343",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-bridget-phillipson_7055502.jpg?20251019161240",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-19 14:44:00",
        "Headline": "The government is also announcing plans to support pupils to get the \"vital pass\" they need in English and maths GCSE.",
        "Content": "The government is announcing the creation of new V Levels qualifications for students age 16-19 in what is being billed as a major overhaul of the education system. The Department for Education says the aim is to give young people \"new vocational qualifications tied to rigorous and real-world job standards\". Vocational education has been \"an afterthought for too long\", according to education secretary Bridget Phillipson. The announcement comes after Sir Keir Starmer's pledge to ensure that two-thirds of young people go to university or study a technical qualification after leaving school. Details will be unveiled in a new white paper on post-16 education and skills, set to be published on Monday. The Conservatives accused Labour of \"failing young people\" with its schools bill. V Levels will replace the 900 vocational qualifications for 16 to 19-year-olds, and are \"designed to strengthen skills across industry, including in the government's priority industries\". \n                  Part of Birmingham 'can't be no-go area for Jews', cabinet minister tells Sky News\n                 \n                  Labour deputy leadership candidate accuses opponent's team of 'throwing mud' and briefing against her\n                 \n                  Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce\n                 They will sit alongside A Levels and T Levels, and students will be able to combine study of new V Levels courses with existing A Levels. They will be designed to be broader than existing qualifications, allowing young people \"more choice and flexibility\" in their future study or career paths. For example, the government says a student thinking about a career in the creative arts or media industry could choose to take a traditional A Level alongside two V Levels (one in Craft and Design; and one in Media, Broadcast and Production). Or a student considering health or fitness as a career, but who is also thinking about digital, could do three V Levels - in Sport and Exercise Science; Digital; and Health and Care services. These reforms will be backed by an additional £800m of funding for 16-19 education in 2026/27, and 14 new Technical Excellence Colleges in sectors key to the government's Industrial Strategy. Ms Phillipson said in a statement: \"Technical and vocational education is the backbone of this country's economy and central to breaking the link between background and success, helping hundreds of thousands of young people get the skills they need to get good jobs. \"But for too long it has been an afterthought. Young people have been left to navigate an overcomplicated landscape and repeatedly labelled as 'failures' by a system that has held them back from all-important English and maths grades. \"Through our Plan for Change we are turning the tide. Our reforms are building a post-16 education system that truly matches young people's aspirations and abilities, delivering the opportunity and growth our economy needs.\" 'An important opportunity to deliver greater fairness' The plans have also been endorsed by the general secretary of the National Education Union (NEU), Daniel Kebede, who described this announcement as \"a significant step forward for vocational education\". He said: \"For too long, the post-16 qualifications framework has lacked coherence and clarity. While students following academic routes have benefited from a clear and structured pathway, those pursuing vocational options have too often faced a confusing and under-resourced system. These reforms present an important opportunity to deliver greater fairness, consistency and quality for all learners.\" But he also called for the government to address \"the chronic issue of low pay among post-16 teachers and lecturers\", and said that this must be solved for these reforms to succeed. Alongside this new qualification, the government is announcing a new qualification aimed at students who do not achieve a pass in GCSE English and Maths as a \"stepping stone\" to resitting the exam. Read more:Part of Birmingham 'can't be no-go area for Jews'Government looks utterly weak on Maccabi Tel Aviv fan ban The government says this will be of particular benefit to white British pupils who are eligible for free school meals - 64% of whom do not achieve a passing grade in those two subjects at GCSE level, compared to 28% of those who are not eligible for free school meals. Pepe Di'Iasio, general secretary of the Association of School and College Leaders, said they are \"pleased with the recognition that a new approach is needed to support post-16 students in English and maths\", adding: \"This must move us away from the current morale-sapping system of mandatory GCSE resits. \"We need an approach which builds confidence in these subjects and gives young people the best possible opportunity to achieve qualifications of which they can be proud.\" The Conservatives' shadow education secretary Laura Trott said: \"Labour is failing young people.\" She accused her counterpart of being \"more focused on appeasing union bosses to further her own leadership ambitions than doing what's right for children\", and of pushing a schools bill that would \"tear up\" important reforms. Ms Trott pledged the Conservatives would \"scrap debt trap degrees, double apprenticeship funding, and make sure every young person is set up with skills they need to [sic] the future\"."
    },
    {
        "title": "Company boss challenged to 'swap places' with penguins 'trapped in basement' of aquarium",
        "description": "Protesters calling for the release of penguins \"trapped in a basement\" demonstrated outside a London attraction on Sunday, with musician turned eco-campaigner Feargal Sharkey throwing down the gauntlet to the company boss.",
        "url": "https://news.sky.com/story/company-boss-challenged-to-swap-places-with-penguins-trapped-in-basement-of-aquarium-13453428",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gentoo-penguin-sea-life-london_7055647.jpg?20251019173559",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-19 16:03:00",
        "Headline": "Gentoo penguins are the world's fastest swimming birds. Campaigners want them freed from a 2m deep pool in a 'basement' at Sea Life London Aquarium.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Protesters calling for the release of penguins \"trapped in a basement\" demonstrated outside a London attraction on Sunday, with musician turned eco-campaigner Feargal Sharkey throwing down the gauntlet to the company boss. Between 250-300 animal welfare campaigners said the 15 penguins are kept \"in a windowless basement enclosure\" at the Sea Life London Aquarium, with no daylight or outdoor access. The aquarium, owned by Merlin Entertainments, opened its first penguin exhibit in May 2011. The 10 gentoo penguins introduced from Edinburgh Zoo have \"now endured 14 years in a basement\", with a pool of only about seven feet deep (2.1m) in which to swim, according to the campaigners that organised the protest. Born Free says at least two of the birds have never seen the sky. A spokesperson for the Sea Life London Aquarium said on Sunday the penguins' habitat was \"designed with help and advice from specialist vets\". The statement added: \"It provides an excellent balance of water and land for the penguins, which enables them to express their normal behaviours, and there is space for them to ensure they have sufficient privacy.\" Feargal Sharkey, former singer of The Undertones, now known for his campaigning against the water industry, dared Merlin Entertainments' new chief executive Fiona Eastwood to \"swap places with the penguins\". \"In fact, if she's prepared to actually spend a month down there with those penguins, I will donate £1,000 of my money to a charity of her choosing,\" Mr Sharkey said. \"As we now know, some of them have been there for 14 years, in the basement of a former council building. \"It's a shocking indictment.\" He added: \"There is no reason that they should be benefiting at all from imprisoning 15 birds in the basement of an old council building. \"It's idiotic. It's a nonsense, and it's got to stop.\" Merlin Entertainments is co-run by Blackstone Group, Canada Pension Plan Investment Board (CPPIB), and Kirkbi, the investment arm of the Lego family. The British theme park company owns a range of theme parks and other attractions across the UK, including Alton Towers, Legoland Windsor, Madame Tussauds, Thorpe Park, and Chessington World of Adventures. Gentoo penguins are supreme swimmers, the fastest swimming bird in the world, according to the charity Penguins International. In the wild, they can reach speeds of 22mph (35 kph). Naturalist and TV presenter Chris Packham said he was there to protest the \"injustice that's been wrought upon 15 beautiful little gentoo penguins currently housed in the dingy basement of the building behind me.\" He told Sky News: \"This building was always unsuitable for these bids, and they've got to be shifted out.\" Megan McCubbin, fellow TV presenter and Chris Packham's stepdaughter, said gentoo penguins were \"one of the most amazing species that we have on our planet\". She added: \"And when you walk through [the basement] - and I've only been once and I will never go again - you can't help but feel heartbroken about them.\" Sea Life London Aquarium also said in its statement it was \"committed to supporting conservation causes globally\" through its Breed, Rescue, Protect programme, which supports endangered species."
    },
    {
        "title": "Legendary cricket umpire Dickie Bird remembered by sporting greats at hometown funeral",
        "description": "He was the world's most famous cricket umpire but also a true son of Yorkshire.",
        "url": "https://news.sky.com/story/legendary-cricket-umpire-dickie-bird-remembered-by-sporting-greats-at-hometown-funeral-13453301",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dickie-bird-statue_7055458.jpg?20251019152945",
        "type": "Home",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-10-19 14:08:00",
        "Headline": "Famous around the world, beloved by Barnsley, his hometown, Dickie Bird was remembered for his humour and warmth at his funeral.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  He was the world's most famous cricket umpire but also a true son of Yorkshire. Dickie Bird's funeral in Barnsley drew cricketing greats, but also members of the public who wanted to remember the man - the miner's son - whose name is synonymous with this town. He died last month at the age of 92, after a career in sport of many decades. In 2000, Harold \"Dickie\" Bird was granted the Freedom of the Borough which, he once quipped, meant he could \"drive sheep through the town\" but still didn't give him \"free parking\". As you would expect, the service was full of stories of Dickie - a man who was so beloved by fans and respected by players for his \"integrity, humour and unmistakable style\", as one speaker described it. The eulogy was delivered by cricketing legend Sir Geoffrey Boycott, who played with Dickie, along with broadcaster Sir Michael Parkinson, in their early years at Barnsley Cricket Club. Read more: Dickie Bird breaks down as he recalls final words with Sir Michael Parkinson \n                  At least 11 dead after stampede among Royal Challengers Bengaluru fans celebrating Indian Premier League win\n                 \n                  Cricket bosses ban transgender women from female competitions\n                 \n                  Vaibhav Suryavanshi, 14, makes history as youngest ever player in cricket's Indian Premier League- hits first ball six\n                 Boycott described how Dickie's \"nervous energy\" held him back as a player, but helped him make \"great decisions\" as an umpire. \"Eccentric yes, but genuine. Comic and loveable.\" \"And,\" he added, \"people all over the world adored him.\" But it was an anecdote, shared with me by former England captain Michael Vaughan, that really summed up Dickie Bird's spirit. He told me how, as a young player, he was in the middle, playing awfully. \"And there was Dickie, saying to me: 'don't worry, you're doing really well'.\" \"He was just such a kind man\"."
    },
    {
        "title": "Met Police looks into reports Prince Andrew asked officer to investigate accuser - as William plans 'ruthless approach' towards royal",
        "description": "The Metropolitan Police is looking into reports that Prince Andrew asked an officer to help with an attempted smear campaign against the woman who accused him of sexual assault.",
        "url": "https://news.sky.com/story/prince-william-plans-ruthless-approach-towards-prince-andrew-as-lawyer-for-jeffrey-epsteins-victims-predicts-further-leaks-13453017",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew-andrew_7055201.jpg?20251019120606",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-19 02:02:00",
        "Headline": "There are reports that Andrew - who has relinquished his Duke of York title - tried to get the Metropolitan Police to dig up dirt for a smear campaign against his sexual assault accuser Virginia Giuffre back in 2011.",
        "Content": " The Metropolitan Police is looking into reports that Prince Andrew asked an officer to help with an attempted smear campaign against the woman who accused him of sexual assault. Andrew reportedly tried to get his personal protection officer to dig up dirt for a smear campaign against Virginia Giuffre back in 2011, according to the Mail on Sunday. The Met Police said it was \"actively looking into the claims made\". The prince - who gave up his Duke of York title on Friday - has been approached for comment. Meanwhile, it has been reported Prince William is planning to take a \"ruthless approach\" towards Andrew when he is king. The Sunday Times suggests William will ban his uncle from \"all aspects of royal life\" because of the ongoing risk to the Royal Family's reputation after a series of damaging revelations. A US lawyer has predicted the scandal engulfing the royal \"is not going away\" and more stories will \"leak out\". Gloria Allred, who represents many of the victims of the late Jeffrey Epstein, believes Andrew will not be \"let off the hook\" over his links to the convicted paedophile. \"This is not going away. Even though he's no longer a duke, and Sarah Ferguson is no longer a duchess, it's not going away,\" she told Sky News.  Andrew relinquished his Duke of York title and remaining honours on Friday evening, after a series of fresh stories linked to the late Ms Giuffre, who was trafficked by Epstein. She died in April, aged 41, with her family saying she \"lost her life to suicide\". Andrew will retain the dukedom, which can only be removed by an Act of Parliament, but will not use it. Asked whether the government had plans to legislate to remove Andrew's titles, Energy Security Ed Miliband told Sky's Sunday Morning with Trevor Phillips programme that they would be \"guided by the palace\" and the Royal Family. \"I think it's really important as a government minister that we allow the Royal Family to make its decisions on these questions,\" he added. \"Prince Andrew has given up these titles by agreement with His Majesty the King and I think that's, you know, that's obviously the position.\"  'It's not over' Ms Giuffre alleged she was forced to have sex with Andrew when she was 17 - allegations he has always denied. Her posthumous memoirs, which are released on Tuesday, claim Andrew insisted she sign a one-year gag order - to prevent details of her allegations tarnishing the late Queen's platinum jubilee. Read more: Why Andrew hasn't given up being a princeLingering dread over what else could still emerge And earlier this week, emails emerged showing that Andrew remained in contact with Epstein, several months after he said he had stopped contact. The former duke paid to settle a civil sexual assault case with Ms Giuffre in 2022, despite insisting he had never met her. Ms Allred said: \"The fact that Virginia is now deceased - may she rest in peace - doesn't mean it's over for Prince Andrew. It's not over. More will come to leak out.\"  Reports of attempted smear campaign It has now been reported that Andrew passed Ms Giuffre's date of birth and social security number to his taxpayer-funded bodyguard in 2011, asking him to investigate. He is said to have emailed the late Queen's then-deputy press secretary and told him of his request to his protection officer, and also suggested Ms Giuffre had a criminal record, the Mail on Sunday reported. A Met Police spokesperson told Sky News: \"We are aware of media reporting and are looking into the claims made.\" The prince's alleged attempt, on which the Met officer is not said to have acted, came in 2011, hours before the publication of the famous photograph of Andrew with his arm around Ms Giuffre in London, which he has claimed was doctored. The Mail on Sunday said it obtained the email from disclosures held by the US congress. \"It would also seem she has a criminal record in the states,\" Andrew said to the former press secretary, according to one email published by the newspaper. \"I have given her DoB and social security number for investigation with XXX the on duty PPO.\" Ms Giuffre's family responded, the newspaper said, saying she did not have a criminal record. Read more from Sky News:How Prince Andrew allegations unfoldedEverything we know about titles decisionWilliam and Camilla's influential roles In her book, titled Nobody's Girl: A Memoir Of Surviving Abuse And Fighting For Justice, she wrote, according to The Telegraph: \"As devastating as this interview was for Prince Andrew, for my legal team it was like an injection of jet fuel. \"Its contents would not only help us build an ironclad case against the prince but also open the door to potentially subpoenaing his ex-wife, Sarah Ferguson, and their daughters, Princesses Beatrice and Eugenie.\" Andrew, who remains a prince and continues to live in the Crown Estate property Royal Lodge, said on Friday that the \"continued accusations about me distract from the work of His Majesty and the Royal Family\". He insisted he was putting his \"family and country first\" and would stop using \"my title or the honours which have been conferred upon me\". Ms Allred told Sky News she felt Andrew's statement on Friday, describing the scandal as a \"distraction\", was an \"insult\" to Epstein's victims. \"What it's saying [the statement] is it's continued bad PR for the monarchy,\" she said. \"All right, I'm happy about this small consequence that he has to pay... no longer a duke, but look, he's living a privileged life while many victims are still suffering from the harm that was done by many people involved with Jeffrey Epstein.\" Ms Giuffre's family has urged the King to go further and take away Andrew's prince title."
    },
    {
        "title": "Legendary cricket umpire Dickie Bird remembered by sporting greats at hometown funeral",
        "description": "He was the world's most famous cricket umpire but also a true son of Yorkshire.",
        "url": "https://news.sky.com/story/legendary-cricket-umpire-dickie-bird-remembered-by-sporting-greats-at-hometown-funeral-13453301",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dickie-bird-statue_7055458.jpg?20251019152945",
        "type": "UK",
        "Author": "Katerina Vittozzi",
        "Date Published": "2025-10-19 14:08:00",
        "Headline": "Famous around the world, beloved by Barnsley, his hometown, Dickie Bird was remembered for his humour and warmth at his funeral.",
        "Content": "\n          North of England correspondent\n              @kvittozzi\n  He was the world's most famous cricket umpire but also a true son of Yorkshire. Dickie Bird's funeral in Barnsley drew cricketing greats, but also members of the public who wanted to remember the man - the miner's son - whose name is synonymous with this town. He died last month at the age of 92, after a career in sport of many decades. In 2000, Harold \"Dickie\" Bird was granted the Freedom of the Borough which, he once quipped, meant he could \"drive sheep through the town\" but still didn't give him \"free parking\". As you would expect, the service was full of stories of Dickie - a man who was so beloved by fans and respected by players for his \"integrity, humour and unmistakable style\", as one speaker described it. The eulogy was delivered by cricketing legend Sir Geoffrey Boycott, who played with Dickie, along with broadcaster Sir Michael Parkinson, in their early years at Barnsley Cricket Club. Read more: Dickie Bird breaks down as he recalls final words with Sir Michael Parkinson \n                  At least 11 dead after stampede among Royal Challengers Bengaluru fans celebrating Indian Premier League win\n                 \n                  Cricket bosses ban transgender women from female competitions\n                 \n                  Vaibhav Suryavanshi, 14, makes history as youngest ever player in cricket's Indian Premier League- hits first ball six\n                 Boycott described how Dickie's \"nervous energy\" held him back as a player, but helped him make \"great decisions\" as an umpire. \"Eccentric yes, but genuine. Comic and loveable.\" \"And,\" he added, \"people all over the world adored him.\" But it was an anecdote, shared with me by former England captain Michael Vaughan, that really summed up Dickie Bird's spirit. He told me how, as a young player, he was in the middle, playing awfully. \"And there was Dickie, saying to me: 'don't worry, you're doing really well'.\" \"He was just such a kind man\"."
    },
    {
        "title": "Families whose loved ones took their lives after buying poison online write to PM",
        "description": "Bereaved families whose loved ones took their own lives after buying the same poison online have written to the prime minister demanding urgent action.",
        "url": "https://news.sky.com/story/families-whose-loved-ones-took-their-lives-after-buying-poison-online-write-to-pm-13453641",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hannah-aitken_7053997.png?20251018135826",
        "type": "UK",
        "Author": "Laura Bundock, health correspondent",
        "Date Published": "2025-10-19 23:01:00",
        "Headline": "Analysis shows at least 133 people have died because of a poison advertised on online forums - and lawyers representing the families say they want a public inquiry into their loved ones' deaths.",
        "Content": "By Laura Bundock, health correspondent  Bereaved families whose loved ones took their own lives after buying the same poison online have written to the prime minister demanding urgent action. Warning: This article contains references to suicide The group claims there have been \"multiple missed opportunities\" to shut down online forums that promote suicide and dangerous substances. They warn that over 100 people have died after purchasing a particular poison in the last 10 years. Among those who have written to Downing Street is Pete Aitken, whose daughter Hannah was 22 when she took her own life after buying the poison from a website. Hannah was autistic and had ADHD. She was treated in six different mental health hospitals over a four-year period. Mr Aitken recently spoke to Sky News around the second anniversary of Hannah's death. \n                  Hannah, 22, died after buying poison online - why her death raises serious questions for NHS\n                 \n                  Simple joy of jumping in puddles or climbing trees is out of reach for millions of children\n                 \n                  Prince William visibly moved during reunion with bereaved mother\n                 He said: \"Autistic people seem to be most vulnerable to this kind of sort of poison and, you know, wanting to take their lives.\"  Sky News is not naming the poison, but Hannah was able to buy a kilogram of it online. Just one gram is potentially fatal. \"There's this disparity between the concentration required for its legitimate use and that required for ending your life. And it seems quite clear you could make a distinction,\" Mr Aitken said. Analysis from the Molly Rose Foundation and the group Families and Survivors to Prevent Online Suicide Harms says at least 133 people have died because of the poison. It also says coroners have written warnings about the substance on 65 separate occasions. The report accuses the Home Office of failing to strengthen the regulation of the poison and says not enough is being done to close dangerous suicide forums online. Lawyers representing the group want a public inquiry into the deaths. In a joint letter to the prime minister, the families said: \"We write as families whose loved ones were let down by a state that was too slow to respond to the threat. \"This series of failings requires a statutory response, not just to understand why our loved ones died but also to prevent more lives being lost in a similar way.\" Read more from Sky News:Blood test for more than 50 cancers 'could transform outcomes'Warning of six million new cancer cases - with these areas worst hitHospital accused of 'covering up' concerns about suspended surgeon The group's lawyer, Merry Varney, from Leigh Day, said: \"The government is rightly committed to preventing deaths through suicide, yet despite repeated warnings of the risks posed by an easily accessible substance, fatal in small quantities and essentially advertised on online forums, no meaningful steps have been taken.\" A government spokesperson said: \"Suicide devastates families and we are unequivocal about the responsibilities online services have to keep people safe on their platforms. \"Under the Online Safety Act, services must take action to prevent users from accessing illegal suicide and self-harm content and ensure children are protected from harmful content that promotes it. \"If they fail to do so, they can expect to face robust enforcement, including substantial fines.\" They added that the position is \"closely monitored and reportable under the Poisons Act, meaning retailers must alert authorities if they suspect it is being bought to cause harm\". \"We will continue to keep dangerous substances under review to ensure the right safeguards are in place,\" they said. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Government announces plans for new V Levels qualification after PM pledged to get two-thirds of young people into higher-level learning",
        "description": "The government is announcing the creation of new V Levels qualifications for students age 16-19 in what is being billed as a major overhaul of the education system.",
        "url": "https://news.sky.com/story/government-announces-plans-for-new-v-levels-qualification-after-pm-pledged-to-get-two-thirds-of-young-people-into-higher-level-learning-13453343",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-bridget-phillipson_7055502.jpg?20251019161240",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-19 14:44:00",
        "Headline": "The government is also announcing plans to support pupils to get the \"vital pass\" they need in English and maths GCSE.",
        "Content": "The government is announcing the creation of new V Levels qualifications for students age 16-19 in what is being billed as a major overhaul of the education system. The Department for Education says the aim is to give young people \"new vocational qualifications tied to rigorous and real-world job standards\". Vocational education has been \"an afterthought for too long\", according to education secretary Bridget Phillipson. The announcement comes after Sir Keir Starmer's pledge to ensure that two-thirds of young people go to university or study a technical qualification after leaving school. Details will be unveiled in a new white paper on post-16 education and skills, set to be published on Monday. The Conservatives accused Labour of \"failing young people\" with its schools bill. V Levels will replace the 900 vocational qualifications for 16 to 19-year-olds, and are \"designed to strengthen skills across industry, including in the government's priority industries\". \n                  Part of Birmingham 'can't be no-go area for Jews', cabinet minister tells Sky News\n                 \n                  Labour deputy leadership candidate accuses opponent's team of 'throwing mud' and briefing against her\n                 \n                  Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce\n                 They will sit alongside A Levels and T Levels, and students will be able to combine study of new V Levels courses with existing A Levels. They will be designed to be broader than existing qualifications, allowing young people \"more choice and flexibility\" in their future study or career paths. For example, the government says a student thinking about a career in the creative arts or media industry could choose to take a traditional A Level alongside two V Levels (one in Craft and Design; and one in Media, Broadcast and Production). Or a student considering health or fitness as a career, but who is also thinking about digital, could do three V Levels - in Sport and Exercise Science; Digital; and Health and Care services. These reforms will be backed by an additional £800m of funding for 16-19 education in 2026/27, and 14 new Technical Excellence Colleges in sectors key to the government's Industrial Strategy. Ms Phillipson said in a statement: \"Technical and vocational education is the backbone of this country's economy and central to breaking the link between background and success, helping hundreds of thousands of young people get the skills they need to get good jobs. \"But for too long it has been an afterthought. Young people have been left to navigate an overcomplicated landscape and repeatedly labelled as 'failures' by a system that has held them back from all-important English and maths grades. \"Through our Plan for Change we are turning the tide. Our reforms are building a post-16 education system that truly matches young people's aspirations and abilities, delivering the opportunity and growth our economy needs.\" 'An important opportunity to deliver greater fairness' The plans have also been endorsed by the general secretary of the National Education Union (NEU), Daniel Kebede, who described this announcement as \"a significant step forward for vocational education\". He said: \"For too long, the post-16 qualifications framework has lacked coherence and clarity. While students following academic routes have benefited from a clear and structured pathway, those pursuing vocational options have too often faced a confusing and under-resourced system. These reforms present an important opportunity to deliver greater fairness, consistency and quality for all learners.\" But he also called for the government to address \"the chronic issue of low pay among post-16 teachers and lecturers\", and said that this must be solved for these reforms to succeed. Alongside this new qualification, the government is announcing a new qualification aimed at students who do not achieve a pass in GCSE English and Maths as a \"stepping stone\" to resitting the exam. Read more:Part of Birmingham 'can't be no-go area for Jews'Government looks utterly weak on Maccabi Tel Aviv fan ban The government says this will be of particular benefit to white British pupils who are eligible for free school meals - 64% of whom do not achieve a passing grade in those two subjects at GCSE level, compared to 28% of those who are not eligible for free school meals. Pepe Di'Iasio, general secretary of the Association of School and College Leaders, said they are \"pleased with the recognition that a new approach is needed to support post-16 students in English and maths\", adding: \"This must move us away from the current morale-sapping system of mandatory GCSE resits. \"We need an approach which builds confidence in these subjects and gives young people the best possible opportunity to achieve qualifications of which they can be proud.\" The Conservatives' shadow education secretary Laura Trott said: \"Labour is failing young people.\" She accused her counterpart of being \"more focused on appeasing union bosses to further her own leadership ambitions than doing what's right for children\", and of pushing a schools bill that would \"tear up\" important reforms. Ms Trott pledged the Conservatives would \"scrap debt trap degrees, double apprenticeship funding, and make sure every young person is set up with skills they need to [sic] the future\"."
    },
    {
        "title": "Company boss challenged to 'swap places' with penguins 'trapped in basement' of aquarium",
        "description": "Protesters calling for the release of penguins \"trapped in a basement\" demonstrated outside a London attraction on Sunday, with musician turned eco-campaigner Feargal Sharkey throwing down the gauntlet to the company boss.",
        "url": "https://news.sky.com/story/company-boss-challenged-to-swap-places-with-penguins-trapped-in-basement-of-aquarium-13453428",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gentoo-penguin-sea-life-london_7055647.jpg?20251019173559",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-19 16:03:00",
        "Headline": "Gentoo penguins are the world's fastest swimming birds. Campaigners want them freed from a 2m deep pool in a 'basement' at Sea Life London Aquarium.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Protesters calling for the release of penguins \"trapped in a basement\" demonstrated outside a London attraction on Sunday, with musician turned eco-campaigner Feargal Sharkey throwing down the gauntlet to the company boss. Between 250-300 animal welfare campaigners said the 15 penguins are kept \"in a windowless basement enclosure\" at the Sea Life London Aquarium, with no daylight or outdoor access. The aquarium, owned by Merlin Entertainments, opened its first penguin exhibit in May 2011. The 10 gentoo penguins introduced from Edinburgh Zoo have \"now endured 14 years in a basement\", with a pool of only about seven feet deep (2.1m) in which to swim, according to the campaigners that organised the protest. Born Free says at least two of the birds have never seen the sky. A spokesperson for the Sea Life London Aquarium said on Sunday the penguins' habitat was \"designed with help and advice from specialist vets\". The statement added: \"It provides an excellent balance of water and land for the penguins, which enables them to express their normal behaviours, and there is space for them to ensure they have sufficient privacy.\" Feargal Sharkey, former singer of The Undertones, now known for his campaigning against the water industry, dared Merlin Entertainments' new chief executive Fiona Eastwood to \"swap places with the penguins\". \"In fact, if she's prepared to actually spend a month down there with those penguins, I will donate £1,000 of my money to a charity of her choosing,\" Mr Sharkey said. \"As we now know, some of them have been there for 14 years, in the basement of a former council building. \"It's a shocking indictment.\" He added: \"There is no reason that they should be benefiting at all from imprisoning 15 birds in the basement of an old council building. \"It's idiotic. It's a nonsense, and it's got to stop.\" Merlin Entertainments is co-run by Blackstone Group, Canada Pension Plan Investment Board (CPPIB), and Kirkbi, the investment arm of the Lego family. The British theme park company owns a range of theme parks and other attractions across the UK, including Alton Towers, Legoland Windsor, Madame Tussauds, Thorpe Park, and Chessington World of Adventures. Gentoo penguins are supreme swimmers, the fastest swimming bird in the world, according to the charity Penguins International. In the wild, they can reach speeds of 22mph (35 kph). Naturalist and TV presenter Chris Packham said he was there to protest the \"injustice that's been wrought upon 15 beautiful little gentoo penguins currently housed in the dingy basement of the building behind me.\" He told Sky News: \"This building was always unsuitable for these bids, and they've got to be shifted out.\" Megan McCubbin, fellow TV presenter and Chris Packham's stepdaughter, said gentoo penguins were \"one of the most amazing species that we have on our planet\". She added: \"And when you walk through [the basement] - and I've only been once and I will never go again - you can't help but feel heartbroken about them.\" Sea Life London Aquarium also said in its statement it was \"committed to supporting conservation causes globally\" through its Breed, Rescue, Protect programme, which supports endangered species."
    },
    {
        "title": "Why Andrew hasn't given up being a prince - amid call for him to 'live in exile'",
        "description": "Sky News' royal commentator has explained why Prince Andrew has not given up being called a prince &#8211; while another expert has said \"the decent thing\" for him to do would be \"go into exile\" overseas.",
        "url": "https://news.sky.com/story/why-andrew-hasnt-given-up-being-a-prince-8211-amid-call-for-him-to-live-in-exile-13453313",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-prince-andrew_7053513.jpg?20251017200712",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-19 15:40:00",
        "Headline": "Since Andrew's announcement on Friday, there has been speculation over whether any further measures will be taken - and there are now calls for him to go a step further.",
        "Content": "Sky News' royal commentator has explained why Prince Andrew has not given up being called a prince – while another expert has said \"the decent thing\" for him to do would be \"go into exile\" overseas. Andrew announced on Friday that he would stop using his Duke of York title and relinquish all other honours, including his role as a Royal Knight Companion of the Most Noble Order of the Garter. However, he will continue to be known as a prince. Royal commentator Alastair Bruce said that while Andrew's other honours and titles were conferred to him later in life, he became a prince when he was born to Elizabeth II while she was queen. He told presenter Kamali Melbourne: \"I think […] that style was quite special to the late Queen,\" he said. \"And perhaps the King, for the moment, thinks that can be left alone. \"It's a matter really for the King, for the royal household, perhaps with the guidance and advice of government, which I'm sure they are taking.\"  Since Andrew's announcement, there has been speculation over whether any further measures will be taken - and one author has now called for him to \"go into exile\". \n                  Lingering dread over what else about Prince Andrew could still emerge\n                 \n                  Met Police looks into reports Prince Andrew asked officer to investigate accuser - as William plans 'ruthless approach' towards royal\n                 \n                  How Prince Andrew allegations unfolded and his titles were lost\n                 Andrew Lownie, author of The Rise And Fall Of The House Of York, said: \"The only way the story will go away is if he leaves Royal Lodge, goes into exile abroad with his ex-wife, and is basically stripped of all his honours, including Prince Andrew.\" Royal Lodge is the Windsor mansion Andrew lives in with his ex-wife, Sarah Ferguson, who has also lost her Duchess of York title. Mr Lownie continued: \"He makes out he's an honourable man and he's putting country and family first. Well, if he is, then the optics look terrible for the monarchy. A non-working royal in a 30-room Crown Estate property with a peppercorn rent. \"He should do the decent thing and go. And frankly, he should go into exile.\" Mr Lownie added if the Royal Family \"genuinely want to cut links, they have to put pressure on him to voluntarily get out\". Read more from Sky News:How Prince Andrew allegations unfoldedWilliam and Camilla's influential roles  Andrew's decision to stop using his titles was announced amid renewed scrutiny of his relationship with paedophile Jeffrey Epstein, and fresh stories linked to the late Virginia Giuffre. Ms Giuffre, who was trafficked by Epstein, alleged she was sexually assaulted by Andrew on three occasions - which he has always vigorously denied. The former duke paid to settle a civil sexual assault case with Ms Giuffre in 2022, despite insisting he had never met her."
    },
    {
        "title": "Mystery foam on river in Thetford sparks Environment Agency investigation",
        "description": "A large volume of foam that mysteriously appeared on a river is being investigated by the Environment Agency.",
        "url": "https://news.sky.com/story/mystery-foam-on-river-in-thetford-sparks-environment-agency-investigation-13453113",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-river-thet-thetford_7055168.jpg?20251019105151",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-19 09:48:00",
        "Headline": "The source of the foam on the River Thet has been detected and stopped, but experts are still trying to work out what caused it.",
        "Content": "A large volume of foam that mysteriously appeared on a river is being investigated by the Environment Agency. Images shared by the agency on Saturday morning showed the foam covering an area of the River Thet, in Thetford. A spokesperson said the source of the foam, which remains visible, had been detected and further discharge stopped. The cause is not yet known, with an investigation under way, but Anglian Water confirmed there was a \"third party\" involved. The Environment Agency said a second foam plume could be possible today. \"Environment Agency officers are continuing to investigate the cause of a large volume of foam found in the River Thet in the centre of Thetford, yesterday,\" a spokesperson said. \"Our specialist teams have collected samples, detected the possible source, and prevented any further discharge. There will be an ongoing investigation to try and ensure that this does not happen again. \"It is possible that we might see a second foam plume today and the foam will continue to travel down the river. It is still visible but will have little environmental impact as it dissipates.\" On Saturday, the agency urged members of the public to report any fish in distress. An Anglian Water spokeswoman said: \"One of our managers is on site helping the Environment Agency with their checks which will then go back to the third party responsible.\""
    },
    {
        "title": "Former Premier League star Royston Drenthe suffers stroke",
        "description": "Former Everton and Real Madrid footballer Royston Drenthe has been taken to hospital after having a stroke, according to a Dutch and Belgian football group. ",
        "url": "https://news.sky.com/story/former-premier-league-star-royston-drenthe-suffers-stroke-13453579",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-royston-drenthe-everton_7055886.jpg?20251019201033",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-19 17:59:00",
        "Headline": "The former Everton and Real Madrid player Royston Drenthe was taken to hospital on Friday after having a stroke.",
        "Content": "Former Everton and Real Madrid footballer Royston Drenthe has been taken to hospital after having a stroke, according to a Dutch and Belgian football group.  FC De Rebellen, a group including 38-year-old Drenthe, wrote on Instagram that the winger had suffered a stroke on Friday. \"He is receiving good care and is in good hands,\" the post said. Former England rugby captain reveals motor neurone disease diagnosis The Reuters news agency has contacted his representatives with a request to comment. \"The team and everyone involved hope for a speedy recovery. Royston's family asks for peace and privacy during this period so they can offer him the necessary support and space for his recovery,\" the post added. The Dutch player made his breakthrough at Feyenoord, a first division club in the Netherlands. \n                  Part of Birmingham 'can't be no-go area for Jews', cabinet minister tells Sky News\n                 \n                  Why are Maccabi Tel Aviv fans banned from Aston Villa match - and has this happened before?\n                 \n                  Premier League players to take knee for first time this season as they discuss whether gesture is still effective\n                 Drenthe, who retired in 2023, played for a number of English football clubs. In 2011, he was loaned from Real Madrid to Everton, but dropped in 2012 for a \"disciplinary matter\", the club said at the time. He went on to play for both Reading and Sheffield Wednesday."
    },
    {
        "title": "Boy arrested after woman, 75, dies in Cwmbran house fire",
        "description": "A 17-year-old boy has been arrested after a woman died in a house fire in Cwmbran, Wales.",
        "url": "https://news.sky.com/story/boy-arrested-after-woman-75-dies-in-cwmbran-house-fire-13453175",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cwmbran-fire-wales_7055289.jpg?20251019132734",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-19 13:52:00",
        "Headline": "Firefighters rushed to the blaze in Henllys Way, St Dials, where the woman was found dead.",
        "Content": "A 17-year-old boy has been arrested after a woman died in a house fire in Cwmbran, Wales. Firefighters rushed to the blaze in Henllys Way, St Dials, at around 8.40pm on Saturday. A woman, 75, died at the scene of the fire. The boy, who remains in police custody, was arrested on suspicion of arson with intent to endanger life. Superintendent Laura Bartley said: \"We can confirm that a 75-year-old woman has died at the scene of the fire. Her family has been informed and will be supported by specially trained officers. \"We understand that reports of this nature can be concerning, however we are not looking for anyone else in connection with this incident. \"Residents may see an increased number of officers in the area while enquires are being carried out. \"If anyone has any information, please speak to our officers or contact us in the usual way.\" Anyone with information has been urged to contact police by calling 101 or visiting their website. Members of the public can also contact Crimestoppers anonymously on 0800 555111."
    },
    {
        "title": "Gaza ceasefire 'resumes' after killings and suspension of aid test fragile truce",
        "description": "The Israeli military has said that a ceasefire in Gaza would hold after it was seriously tested by an attack that killed two Israeli soldiers and a wave of airstrikes that killed 36 Palestinians.",
        "url": "https://news.sky.com/story/gaza-ceasefire-resumes-after-killings-and-suspension-of-aid-test-fragile-truce-13453671",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-wounded-palestinian-boy_7056099.jpg?20251020005005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-19 20:45:00",
        "Headline": "Israeli airstrikes killed at least 36 in Gaza on Sunday, which Israel said it launched in retaliation to deadly attacks by Hamas militants in Rafah.",
        "Content": " The Israeli military has said that a ceasefire in Gaza would hold after it was seriously tested by an attack that killed two Israeli soldiers and a wave of airstrikes that killed 36 Palestinians. Aid supplies into the enclave are due to resume on Monday following US pressure, an Israeli security source said, shortly after Israel announced a halt in supplies in response to what it called a \"blatant\" violation by Hamas of the truce. A little over a week has passed since the start of the US-proposed ceasefire aimed at ending two years of war. Israel's military said militants fired at troops in areas of Rafah city that are Israeli-controlled, according to agreed-upon ceasefire lines. The military said Israel responded with airstrikes and artillery, hitting dozens of Hamas targets. It also said its forces struck \"terrorists\" approaching troops in Beit Lahiya in the north. Health officials said at least 36 Palestinians were killed across Gaza, including children. One airstrike hit a former school sheltering displaced families in the area of Nuseirat, killing four people, according to Al Awda Hospital, which received the casualties. \n                  Israel identifies body of dead hostage returned by Hamas\n                 \n                  'I know him, but he doesn't know me': The Israelis who see it as duty to mourn their collective dead\n                 \n                  Trump threatens Hamas after group suggests no more hostage bodies can be returned\n                 Another hit a tent in the Muwasi area of Khan Younis in the south, killing at least four people, including a woman and two children, according to Nasser Hospital. Read more:Israel identifies body of dead hostageWatch: Evidence of Israeli support for Gaza militiaViolence that plagues Gaza Israeli Prime Minister Benjamin Netanyahu directed the military to take \"strong action\" against any ceasefire violations but did not threaten to return to war. The armed wing of Hamas continued to accuse Israel of multiple ceasefire violations, but said it remained committed to the ceasefire agreement. It said communication with its remaining units in Rafah had been cut off for months, adding \"we are not responsible for any incidents occurring in those areas\". In a statement on social media on Sunday evening, the IDF said it had \"begun the renewed enforcement of the ceasefire, in line with the terms of the agreement\". \"The IDF will continue to uphold the ceasefire agreement and will respond firmly to any violation of it,\" it added. An Israeli source told Sky News: \"The bottom line is that we're done responding. We are now back to where we were this morning before their attack.\" Fearing the truce may collapse, some Palestinians, many of whom have lacked sufficient food for months, rushed to buy goods from the main market in Nuseirat. Further south in Khan Younis, other families fled their homes and shelters after airstrikes hit nearby.  Major hurdles still stand in the way of a long-lasting peace in Gaza. An earlier ceasefire collapsed in March when Israel launched a barrage of airstrikes. The new ceasefire began on 10 October, but for days the Israeli government and Hamas have been trading accusations of ceasefire violations. A senior Egyptian official involved in the ceasefire negotiations said \"round-the-clock\" contacts were under way to de-escalate the situation. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 Israel on Saturday pressed Hamas to returning the remains of all 28 dead hostages as promised under the ceasefire, saying the Rafah border crossing between Gaza and Egypt would stay closed \"until further notice\". Hamas says it has no reason to keep the bodies of the remaining hostages, but that it needs special equipmentrecover corpses buried under rubble. A Hamas delegation led by chief negotiator Khalil al Hayya has arrived in Cairo to follow up the implementation of the ceasefire deal with mediators and other Palestinian groups. The next stages are expected to focus on disarming Hamas, Israeli withdrawal from additional areas it controls in Gaza, and future governance of the devastated territory. The US plan proposes the establishment of an internationally-backed authority."
    },
    {
        "title": "Eight 'priceless' objects stolen in Louvre museum heist named - as authorities reveal details of daring raid",
        "description": "Eight \"priceless\" objects stolen in a daring heist at the Louvre museum in Paris have been named by the French culture ministry. ",
        "url": "https://news.sky.com/story/louvre-museum-in-paris-closed-after-robbery-13453106",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-the-louvre-heist_7055729.jpg?20251019182852",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-19 09:19:00",
        "Headline": "Intruders entered via a basket lift using a platform mounted on a lorry, breaking a window and making off with jewels that \"have genuine heritage value and are, in fact, priceless,\" France's interior minister said.",
        "Content": " Eight \"priceless\" objects stolen in a daring heist at the Louvre museum in Paris have been named by the French culture ministry.  The world-famous museum was forced to close on Sunday after thieves accessed a gallery containing the French Crown Jewels at around 9.30am local time. A ninth item was stolen but recovered at the scene, the Paris prosecutor said - as an art detective told Sky News that police face \"a race against time\" to find the other items before they are dismantled and melted down. The French culture ministry said the items stolen were: • Tiara from the set of Queen Marie-Amelie and Queen Hortense • Necklace from the sapphire set of Queen Marie-Amelie and Queen Hortense • Earring, from the pair belonging to the sapphire set of Queen Marie-Amelie and Queen Hortense • Emerald necklace from the Empress Marie Louise set • Pair of emerald earrings from the Empress Marie Louise set • Brooch known as the \"reliquary brooch\" • Tiara of Empress Eugenie • Large corsage bow brooch of Empress Eugenie. French publication Le Parisien previously reported that the object recovered at the museum was the crown of Napoleon III's wife, Empress Eugenie, and it was broken.  Authorities revealed details of the raid after the museum, which is the world's most popular and draws up to 30,000 visitors a day, said on X that it was closing for \"exceptional reasons\". Culture minister Rachida Dati said footage of the operation showed the thieves \"don't target people, they enter calmly in four minutes, smash display cases, take their loot, and leave\". \"No violence, very professional,\" she told TF1. How the robbery unfolded French interior minister Laurent Nunez said the \"major robbery\" involved intruders entering the museum via a basket lift using a platform mounted on a lorry. It is not clear if they brought any or all of the equipment they used with them, as construction work is taking place along the River Seine side of the sprawling building, where the break-in occurred. Mr Nunez said: \"They broke a window and went towards several display cases where they stole jewellery. These are jewels that have genuine heritage value and are, in fact, priceless.\" The interior ministry said the criminals fled on two motorbikes. No injuries have been reported. The number of robbers has not been confirmed but Mr Nunez told France Inter that three or four thieves got into the museum. The gang was well prepared and had scouted the venue, Mr Nunez said, adding they cut window panes \"with a disc cutter\" before escaping \"on a TMAX\", a type of Yamaha maxi-scooter. Forensic work is now underway and a detailed list of the stolen items is being compiled following the break-in, which took place between 9.30 and 9.40am (8.30-8.40am UK time). Once in, they made for the Galerie d'Apollon (Apollo Gallery), home to a selection of the French Crown Jewels, the interior ministry said. French daily newspaper Le Parisien, citing police, said the suspects wore hoods and were carrying \"small chainsaws\". The robbers reportedly escaped with nine pieces of jewellery, including a necklace, a brooch and a tiara from the Napoleon and French Sovereigns display cases, the newspaper reported. Two suspects were inside while a third stayed outside, Le Parisien said. Police face 'a race against time'  Art detective Arthur Brand told Sky News the heist is \"the theft of the decade\" - adding in order to recover the \"priceless\" items, police will need to find the culprits in just one week. \"These crown jewels are so famous, you just cannot sell them,\" Mr Brand said. \"The only thing they can do is melt the silver and gold down, dismantle the diamonds, try to cut them. That's the way they will probably disappear forever.\" He continued: \"They [the police] have a week. If they catch the thieves, the stuff might still be there. If it takes longer, the loot is probably gone and dismantled. It's a race against time.\" French President Emmanuel Macron said in a post on X: \"We will recover the works and the perpetrators will be brought to justice. \"Everything is being done, everywhere, to achieve this,\" he added. What is in the Galerie d'Appollon? The Galerie d'Appollon is an enormous room on the upper floor of the Petite Galerie, which houses the French Crown Jewels as well as the royal collection of hardstone vessels, paintings, tapestries and medallions, the museum's website said. Rebuilt by Louis XIV after a fire, it is home to three historical diamonds - the Regent, one of the most famous diamonds in the world, the Sancy and the Hortensia. At 140 carats, the Regent is exceptional in terms of size, weight and purity and when it was found in India in 1698, it was the largest known diamond at the time. Social media users posted pictures and videos from in and outside the building, with one showing people leaving in \"total panic\". One person on X who said they were there reported a confused-sounding scene of police \"running\" near the museum's famous pyramid \"and trying to enter... from glass side doors but they were locked and they could not enter\". \"Everyone inside was running and banging on glass doors to get out, but could not open. Police and military police arrived,\" they added. History of Louvre break-ins This is not the first time thieves have targeted the museum. In 1911, the Mona Lisa, now protected by bulletproof glass, vanished from its frame, stolen by a former worker who hid inside the museum and walked out with the painting under his coat. Read more on Sky News:Investigation into latest Andrew claimsRock bassist dies at 48Socialite Goldsmith dies It was recovered two years later in Florence - an episode that helped make Leonardo da Vinci's portrait the world's best-known artwork. In 1983, two Renaissance-era pieces of armour were stolen - and were only recovered in 2021, nearly four decades later. The museum's collection also bears the legacy of Napoleonic-era looting, containing 33,000 works of art, including antiquities, sculptures and paintings. In addition to the Mona Lisa, its star attractions feature the Venus de Milo and the Winged Victory of Samothrace."
    },
    {
        "title": "Tel Aviv football derby cancelled after 'violent riots', as club describes 'brutal police violence'",
        "description": "A football derby in Tel Aviv between Hapoel and Maccabi has been cancelled after \"violent riots\", according to Israeli police, although one club has criticised officers who appeared to be \"preparing for war rather than a sporting event\".",
        "url": "https://news.sky.com/story/tel-aviv-football-derby-cancelled-as-violent-riots-see-nine-arrested-13453239",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-bloomfield-stadium_7056102.jpg?20251020010957",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-19 20:16:00",
        "Headline": "Police said dozens of smoke grenades and pyrotechnic devices were thrown, injuring 13 civilians and three police officers. But Hapoel Tel Aviv football club has claimed there was \"brutal police violence\" and \"officers indiscriminately beating fans\".",
        "Content": " A football derby in Tel Aviv between Hapoel and Maccabi has been cancelled after \"violent riots\", according to Israeli police, although one club has criticised officers who appeared to be \"preparing for war rather than a sporting event\". Nine people were arrested on Sunday night at Bloomfield Stadium, a venue shared by both clubs and which Hapoel was the designated home team for the game. A statement from Israeli police said the game was called off \"following disturbances and violent riots\" in which 13 civilians and three officers were injured by pyrotechnic devices. \"These are very serious incidents that posed a real danger to the lives of police officers and civilians,\" the statement added. But Hapoel Tel Aviv Football Club released a statement with a very different perspective of policing at the match. \"From the preliminary discussions prior to the match, it appears that the police were preparing for war rather than a sporting event. \"Most of the injuries from the event were caused by brutal police violence at the end of the game, as a direct result of the scandalous decision to cancel the event. \"Everyone saw the disturbing videos of children being trampled by horses and police officers indiscriminately beating fans.\" Israeli police have not yet responded to the allegations from Hapoel. A Maccabi statement read: \"Following the police's decision, it was determined that the Tel Aviv derby will not take place tonight.\" Footage shared by the police shows projectiles and flares being thrown on to the pitch, as well as unrest outside the stadium and arrests being made. Maccabi ban criticised On Thursday, Maccabi supporters were told they are not allowed to attend November's Europa League game against Aston Villa in Birmingham next month after a decision by Birmingham's Safety Advisory Group (SAG). The group - made up of local stakeholders, including representatives from the council, police and event organisers - said the decision was due to a high risk of violence based on \"current intelligence and previous incidents\". Ed Miliband told Sky's Sunday Morning With Trevor Phillips that ministers are \"working with the relevant authorities\" to secure additional resources and ensure fans of both teams can attend next month's European clash. He insisted Aston in Birmingham cannot become a \"no-go area\" for Jews.  The energy secretary also said that he \"profoundly\" disagrees with the \"approach\" taken by a local MP who started a petition calling for fans of Maccabi Tel Aviv to be banned from the Aston Villa game. The petition states: \"Their arrival in Aston - a diverse and predominantly Muslim community - poses a real risk of tensions within the community and disorder.\" Mr Miliband pushed back on that point. He said the \"vast majority of Muslim people in this country would disassociate themselves\" from suggestions that Maccabi Tel Aviv fans could not come to Aston Villa because it was a predominantly Muslim area. His Tory counterpart, Claire Coutinho, was also highly critical of the petition, telling Phillips: \"I think politicians need to have the courage to name some of the problems that this country is facing. And one of those problems is political Islam.\" Read more from Sky News:Maccabi ban could be reversedWhy are Maccabi Tel Aviv fans banned?Analysis: Ban raises serious questions Petition reaction 'false and inflammatory' The independent MP for Birmingham Perry Barr, Ayoub Khan, criticised those comments. \"I utterly reject the false and inflammatory characterisations... regarding my recent petition,\" he said in a statement. \"The petition I launched reflected genuine and widespread concern from my constituents about public safety and community cohesion. It did not call for anyone to be 'banned because they are Jewish' nor did it single out any faith or ethnicity. \"To distort this into an issue of religion or antisemitism is deeply irresponsible and frankly dangerous. I have consistently condemned all forms of hatred - including antisemitism and Islamophobia - and I will continue to do so.\" The government is expecting West Midlands Police to set out early next week what they would need to police the game safely with both sets of fans present."
    },
    {
        "title": "Former Premier League star Royston Drenthe suffers stroke",
        "description": "Former Everton and Real Madrid footballer Royston Drenthe has been taken to hospital after having a stroke, according to a Dutch and Belgian football group. ",
        "url": "https://news.sky.com/story/former-premier-league-star-royston-drenthe-suffers-stroke-13453579",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-royston-drenthe-everton_7055886.jpg?20251019201033",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-19 17:59:00",
        "Headline": "The former Everton and Real Madrid player Royston Drenthe was taken to hospital on Friday after having a stroke.",
        "Content": "Former Everton and Real Madrid footballer Royston Drenthe has been taken to hospital after having a stroke, according to a Dutch and Belgian football group.  FC De Rebellen, a group including 38-year-old Drenthe, wrote on Instagram that the winger had suffered a stroke on Friday. \"He is receiving good care and is in good hands,\" the post said. Former England rugby captain reveals motor neurone disease diagnosis The Reuters news agency has contacted his representatives with a request to comment. \"The team and everyone involved hope for a speedy recovery. Royston's family asks for peace and privacy during this period so they can offer him the necessary support and space for his recovery,\" the post added. The Dutch player made his breakthrough at Feyenoord, a first division club in the Netherlands. \n                  Part of Birmingham 'can't be no-go area for Jews', cabinet minister tells Sky News\n                 \n                  Why are Maccabi Tel Aviv fans banned from Aston Villa match - and has this happened before?\n                 \n                  Premier League players to take knee for first time this season as they discuss whether gesture is still effective\n                 Drenthe, who retired in 2023, played for a number of English football clubs. In 2011, he was loaned from Real Madrid to Everton, but dropped in 2012 for a \"disciplinary matter\", the club said at the time. He went on to play for both Reading and Sheffield Wednesday."
    },
    {
        "title": "Limp Bizkit bassist Sam Rivers dies aged 48, band says",
        "description": "Sam Rivers, the bassist with US nu-metal group Limp Bizkit, has died aged 48, his bandmates have said.",
        "url": "https://news.sky.com/story/limp-bizkit-bassist-sam-rivers-dies-aged-48-band-says-13453055",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sam-rivers-limp-bizkit_7055090.jpg?20251019080620",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-19 06:52:00",
        "Headline": "Fred Durst and his Limp Bizkit bandmates have paid tribute to their \"brother\", a musician who brought \"a light and a rhythm that could never be replaced\".",
        "Content": "Sam Rivers, the bassist with US nu-metal group Limp Bizkit, has died aged 48, his bandmates have said. In a post on Instagram, the group paid tribute to their \"brother\" and a \"once-in-a-lifetime kind of human\", describing his presence as \"pure magic\". Bandmates Fred Durst, Wes Borland, John Otto and DJ Lethal all shared the tribute, which said: \"Sam Rivers wasn't just our bass player - he was pure magic. The pulse beneath every song, the calm in the chaos, the soul in the sound. \"From the first note we ever played together, Sam brought a light and a rhythm that could never be replaced.\" Their statement ended by saying: \"Rest easy, brother. Your music never ends.\" In a separate message, DJ Lethal said they were in shock, and added: \"Rest in power my brother! You will live on through your music and the lives you helped save with your music, charity work and friendships.\" He urged his followers to \"enjoy every millisecond of life\", adding: \"It's not guaranteed.\" The band did not say how the musician died. Formed in Jacksonville, Florida in 1994, Limp Bizkit released their debut album in 1997. Playing a fusion of rock and hip-hop dubbed nu-metal, their first big hit was 2000's Take A Look Around - the theme from Mission Impossible 2 - followed by Rollin', the song that took them to the top of the charts in the UK. Read more on Sky News:The Boss on biopicSocialite Goldsmith dies The band sold an estimated 45 million albums, according to a royalties lawsuit filed in 2024. They received three Grammy nominations in 2000 and 2001, and won three MTV Europe Music Awards."
    },
    {
        "title": "Part of Birmingham 'can't be no-go area for Jews', cabinet minister tells Sky News",
        "description": "Aston in Birmingham can't become a \"no-go area\" for Jews, a senior cabinet minister has told Sky News, amid controversy over fans of an Israeli football club being barred from attending a match next month.",
        "url": "https://news.sky.com/story/part-of-birmingham-cant-be-no-go-area-for-jews-cabinet-minister-tells-sky-news-13453162",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-villa-park-aston-villa_7052595.jpg?20251016174315",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-19 11:38:00",
        "Headline": "Ed Miliband has told Sky News that ministers are \"working with the relevant authorities\" to ensure fans of both teams can attend next month's European clash.",
        "Content": " Aston in Birmingham can't become a \"no-go area\" for Jews, a senior cabinet minister has told Sky News, amid controversy over fans of an Israeli football club being barred from attending a match next month. Energy Secretary Ed Miliband said he \"profoundly\" disagrees with the \"approach\" taken by a local MP who started a petition calling for fans of Maccabi Tel Aviv to be banned from the Aston Villa game, saying it \"cannot be the basis on which our country operates\". But while he said the government is \"working with the relevant authorities\" to overturn the move, he can not guarantee it will happen. Politics latest: Miliband 'welcomes' Jeremy Clarkson challenge Alongside politicians of all parties, Sir Keir Starmer has strongly criticised the decision, calling it \"wrong\", and the government has said it will work with local authorities to ensure both sets of fans can attend. Speaking to Sky's Sunday Morning With Trevor Phillips, Mr Miliband said work is still ongoing. \"We are working with the relevant authorities on this issue, he said. \"I think the principle here is we do not want a situation where people of a particular faith or from a particular country can't come to a football match because of their faith, because of where they're coming from.\" Asked if Maccabi Tel Aviv fans will definitely be able to attend the game, the minister replied: \"I'm not going to say come what may, but I'm giving you a very, very clear indication of what we are working towards, which is that, you know, the fans from both teams can attend the match.\"  Phillips put to Mr Miliband that a petition to ban their fans, launched by local independent MP Ayoub Khan, has been signed by around 4,000 people. It states the upcoming game is \"not a normal match\" because the Israeli fans would be arriving in \"Aston, a diverse and predominantly Muslim community\". Asked if Aston is now a no-go area for Jews, Mr Miliband replied: \"No and it can't be. And I'm very, very clear about that. \"I believe we as a country, we pride ourselves on our diversity, but also our tolerance and our hatred of prejudice, frankly. And so we cannot have a situation where any area is a no-go area for people of a particular religion or from a particular country.\" Asked if the local MP was justified in what he wrote, Mr Miliband replied: \"No. I profoundly disagree with that approach, with what is being said in that petition, because that cannot be the basis on which our country operates.\" This isn't how the vast majority of people in the UK operate, he added. \"So let's not take this petition and say it paints a picture of our country.\"  Top Tory criticises 'sectarian politics' His Tory counterpart, Claire Coutinho, was highly critical of the petition, telling Phillips: \"I think politicians need to have the courage to name some of the problems that this country is facing. And one of those problems is political Islam. \"Now, that's not to say the moderate Muslim community are a problem in Britain, but we have seen in the past extremist Islamism [...] and now we are seeing a movement of people - last election, five MPs elected - simply on sectarian politics. That may be higher at the next election. \"So we have to grip this, and part of that is dealing with rising antisemitism. But part of that is dealing with integration.\"  The senior Tory MP described the ban overall as a \"disgrace\", saying: \"I think the message that is being sent to Jewish people in this country is that they're not welcome here. \"This has always been a safe haven for Jewish people, and I think to say that we could not possibly police Israeli Jewish fans to watch a football match safely is reinforcing that message that Jews are not welcome here. And I think that is wrong.\" Match classified as 'high risk' In a statement on Thursday, Aston Villa said Birmingham's Safety Advisory Group (SAG) - which issues safety certificates for every match at the ground - had \"formally written to the club and UEFA to advise no away fans will be permitted to attend\" the fixture at Villa Park on 6 November, as it had been classified as \"high risk\". The club said police had advised of \"public safety concerns outside the stadium bowl and the ability to deal with any potential protests on the night\" - a statement that triggered outrage across the political spectrum.  Read more:Why are Maccabi Tel Aviv fans banned?Analysis: Ban raises serious questions The move has been condemned by political and Jewish leaders, including Israeli foreign minister Gideon Sa'ar, who called it a \"shameful decision\". The Jewish Leadership Council said it was \"perverse\" to ban away fans because police can't guarantee their safety, adding: \"Aston Villa should face the consequences of this decision and the match should be played behind closed doors.\" Petition reaction 'false and inflammatory' The independent MP for Birmingham Perry Barr, Ayoub Khan, has criticised comments from Mr Miliband and his Tory counterpart, Claire Coutinho, on Sunday regarding the petition. \"I utterly reject the false and inflammatory characterisations... regarding my recent petition,\" he said in a statement. \"The petition I launched reflected genuine and widespread concern from my constituents about public safety and community cohesion. It did not call for anyone to be 'banned because they are Jewish' nor did it single out any faith or ethnicity. \"To distort this into an issue of religion or antisemitism is deeply irresponsible and frankly dangerous. I have consistently condemned all forms of hatred - including antisemitism and Islamophobia - and I will continue to do so.\" Former Labour leader and now independent MP Jeremy Corbyn defended his fellow member of the Independent Alliance group in parliament yesterday, writing on X: \"Ayoub Khan has been subject to disgusting smears by MPs and journalists, who have wilfully misrepresented his views in order to stoke anger and division.\" He added that he and his colleagues \"diligently represent people of all faiths and none in their communities\"."
    },
    {
        "title": "Government announces plans for new V Levels qualification after PM pledged to get two-thirds of young people into higher-level learning",
        "description": "The government is announcing the creation of new V Levels qualifications for students age 16-19 in what is being billed as a major overhaul of the education system.",
        "url": "https://news.sky.com/story/government-announces-plans-for-new-v-levels-qualification-after-pm-pledged-to-get-two-thirds-of-young-people-into-higher-level-learning-13453343",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-keir-starmer-bridget-phillipson_7055502.jpg?20251019161240",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-19 14:44:00",
        "Headline": "The government is also announcing plans to support pupils to get the \"vital pass\" they need in English and maths GCSE.",
        "Content": "The government is announcing the creation of new V Levels qualifications for students age 16-19 in what is being billed as a major overhaul of the education system. The Department for Education says the aim is to give young people \"new vocational qualifications tied to rigorous and real-world job standards\". Vocational education has been \"an afterthought for too long\", according to education secretary Bridget Phillipson. The announcement comes after Sir Keir Starmer's pledge to ensure that two-thirds of young people go to university or study a technical qualification after leaving school. Details will be unveiled in a new white paper on post-16 education and skills, set to be published on Monday. The Conservatives accused Labour of \"failing young people\" with its schools bill. V Levels will replace the 900 vocational qualifications for 16 to 19-year-olds, and are \"designed to strengthen skills across industry, including in the government's priority industries\". \n                  Part of Birmingham 'can't be no-go area for Jews', cabinet minister tells Sky News\n                 \n                  Labour deputy leadership candidate accuses opponent's team of 'throwing mud' and briefing against her\n                 \n                  Oil and gas workers offered cash to retrain, in major plan for future clean energy workforce\n                 They will sit alongside A Levels and T Levels, and students will be able to combine study of new V Levels courses with existing A Levels. They will be designed to be broader than existing qualifications, allowing young people \"more choice and flexibility\" in their future study or career paths. For example, the government says a student thinking about a career in the creative arts or media industry could choose to take a traditional A Level alongside two V Levels (one in Craft and Design; and one in Media, Broadcast and Production). Or a student considering health or fitness as a career, but who is also thinking about digital, could do three V Levels - in Sport and Exercise Science; Digital; and Health and Care services. These reforms will be backed by an additional £800m of funding for 16-19 education in 2026/27, and 14 new Technical Excellence Colleges in sectors key to the government's Industrial Strategy. Ms Phillipson said in a statement: \"Technical and vocational education is the backbone of this country's economy and central to breaking the link between background and success, helping hundreds of thousands of young people get the skills they need to get good jobs. \"But for too long it has been an afterthought. Young people have been left to navigate an overcomplicated landscape and repeatedly labelled as 'failures' by a system that has held them back from all-important English and maths grades. \"Through our Plan for Change we are turning the tide. Our reforms are building a post-16 education system that truly matches young people's aspirations and abilities, delivering the opportunity and growth our economy needs.\" 'An important opportunity to deliver greater fairness' The plans have also been endorsed by the general secretary of the National Education Union (NEU), Daniel Kebede, who described this announcement as \"a significant step forward for vocational education\". He said: \"For too long, the post-16 qualifications framework has lacked coherence and clarity. While students following academic routes have benefited from a clear and structured pathway, those pursuing vocational options have too often faced a confusing and under-resourced system. These reforms present an important opportunity to deliver greater fairness, consistency and quality for all learners.\" But he also called for the government to address \"the chronic issue of low pay among post-16 teachers and lecturers\", and said that this must be solved for these reforms to succeed. Alongside this new qualification, the government is announcing a new qualification aimed at students who do not achieve a pass in GCSE English and Maths as a \"stepping stone\" to resitting the exam. Read more:Part of Birmingham 'can't be no-go area for Jews'Government looks utterly weak on Maccabi Tel Aviv fan ban The government says this will be of particular benefit to white British pupils who are eligible for free school meals - 64% of whom do not achieve a passing grade in those two subjects at GCSE level, compared to 28% of those who are not eligible for free school meals. Pepe Di'Iasio, general secretary of the Association of School and College Leaders, said they are \"pleased with the recognition that a new approach is needed to support post-16 students in English and maths\", adding: \"This must move us away from the current morale-sapping system of mandatory GCSE resits. \"We need an approach which builds confidence in these subjects and gives young people the best possible opportunity to achieve qualifications of which they can be proud.\" The Conservatives' shadow education secretary Laura Trott said: \"Labour is failing young people.\" She accused her counterpart of being \"more focused on appeasing union bosses to further her own leadership ambitions than doing what's right for children\", and of pushing a schools bill that would \"tear up\" important reforms. Ms Trott pledged the Conservatives would \"scrap debt trap degrees, double apprenticeship funding, and make sure every young person is set up with skills they need to [sic] the future\"."
    },
    {
        "title": "Government looks utterly weak on Maccabi Tel Aviv fan ban - and Tories have smelt blood",
        "description": "Government ministers have been outspoken and unequivocal in their outrage at the decision to ban Maccabi Tel Aviv fans from Aston Villa.",
        "url": "https://news.sky.com/story/government-looks-utterly-weak-on-maccabi-tel-aviv-fan-ban-and-tories-have-smelt-blood-13453251",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-maccabi-tel-aviv-fans_7055538.jpg?20251019163238",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-10-19 14:48:00",
        "Headline": "Ministers say they want Maccabi Tel Aviv fans to attend the match in Birmingham next month - but their progress on resolving the issue has been slow, and the Tories have pounced.",
        "Content": "\n          Political correspondent\n              @amandaakass\n Government ministers have been outspoken and unequivocal in their outrage at the decision to ban Maccabi Tel Aviv fans from Aston Villa. The prime minister immediately described it as \"wrong\", his spokesperson later describing Sir Keir Starmer as \"angered\". Home Secretary Shabana Mahmood, Culture Secretary Lisa Nandy and Communities Secretary Steve Reed were all involved in urgent conversations on Friday. They pledged to do \"everything in our power to ensure all fans can safely attend the game\", next month with clear promises of additional resources and support if needed. Speaking on Sunday Morning with Trevor Phillips, the energy security secretary Ed Miliband hit out at the idea that Aston had become a \"no-go\" area for Jews as a result. \"We cannot have a situation where any area is a no-go area for people of a particular religion or from a particular country,\" he said. \"We've got to stamp out all forms of prejudice, antisemitism, Islamophobia, wherever we find them.\" But astonishingly, three days after the announcement and despite the evident frustration from ministers, there's still no movement. On Sunday, Ed Miliband was still unable to guarantee the game would go ahead, telling Sir Trevor: \"I'm not going to say come what may, but I'm giving you a very, very clear indication of what we are working towards, which is that the fans from both teams can attend the match.\" Conservatives smell weakness It makes the government look utterly weak. And the Tories have smelt blood. Accusing the prime minister of weakness is a regular line of attack from Kemi Badenoch - amplified over the past six months by first the welfare reform debacle, then the PM's ill-advised defence of Peter Mandelson, and most recently the collapse of the China spy trial. Now the Tories are piling in to highlight his apparent impotence in the face of yet another controversy. \"What the actual hell,\" shadow education secretary Laura Trott wrote on social media. \"The PM & home secretary need to get a grip. This is not a one-off event, it is a pattern of behaviour towards Jewish people we see with the Met.\"  Shadow energy secretary Claire Countinho told Sir Trevor the situation is a \"disgrace\", highlighting the successful policing of large-scale pro-Palestine marches and the Notting Hill carnival. She questioned why the Home Office had not stepped in when it became aware that banning away fans was an option under consideration earlier last week (the Home Office insists the home secretary was only informed the decision had been taken on Thursday night, along with everyone else). The fact of the matter is that the police are operationally independent of government - and at the moment the West Midlands force is sticking to its assessment that allowing the match to go ahead as originally planned would be \"high risk\". It's unclear why that risk could not be reduced by an influx of additional resources, and perhaps it will be. We understand the issue is set to be discussed by the safety committee of council officials and the emergency services behind the original decision next week. Miliband careful not to invoke antisemitism Nearly two years ago, Suella Braverman was sacked as home secretary following anger at her outspoken criticism of the Metropolitan Police. She accused them of applying \"double standards\" and \"playing favourites\", treating far-right marchers and football hooligans more harshly than pro-Palestinian and BLM protesters. That intervention caused such anger amongst the police and in Number 10, which had advised her to tone down her article, that she lost her job. So far, politicians have avoided overtly criticising West Midlands Police, but rather the banning decision based on its risk assessment. It's a nuanced distinction. Ed Miliband was careful not to accuse the police or council of antisemitism earlier, telling Sir Trevor: \"The police's concern will be around public order and public safety. I'm sure that's what the local authority concern is.\" But he immediately went on to criticise its current plan of action. \"What we can't do - and this is why it's important to do everything we can to make sure the match can go ahead with fans of all teams - is make any, any set of people from any race, from any religion, from any ethnic background, feel unwelcome in Britain,\" Mr Miliband said. The UK Football Policing Unit has pushed back at the wave of political criticism, saying it's \"important that we respect and support the structures in place for making these decisions\". But with each day that passes, the negative headlines continue, the Tory attacks gain momentum, and the Jewish community the PM also promised to protect with \"everything in his power\" feel more betrayed."
    },
    {
        "title": "Company boss challenged to 'swap places' with penguins 'trapped in basement' of aquarium",
        "description": "Protesters calling for the release of penguins \"trapped in a basement\" demonstrated outside a London attraction on Sunday, with musician turned eco-campaigner Feargal Sharkey throwing down the gauntlet to the company boss.",
        "url": "https://news.sky.com/story/company-boss-challenged-to-swap-places-with-penguins-trapped-in-basement-of-aquarium-13453428",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gentoo-penguin-sea-life-london_7055647.jpg?20251019173559",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-19 16:03:00",
        "Headline": "Gentoo penguins are the world's fastest swimming birds. Campaigners want them freed from a 2m deep pool in a 'basement' at Sea Life London Aquarium.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Protesters calling for the release of penguins \"trapped in a basement\" demonstrated outside a London attraction on Sunday, with musician turned eco-campaigner Feargal Sharkey throwing down the gauntlet to the company boss. Between 250-300 animal welfare campaigners said the 15 penguins are kept \"in a windowless basement enclosure\" at the Sea Life London Aquarium, with no daylight or outdoor access. The aquarium, owned by Merlin Entertainments, opened its first penguin exhibit in May 2011. The 10 gentoo penguins introduced from Edinburgh Zoo have \"now endured 14 years in a basement\", with a pool of only about seven feet deep (2.1m) in which to swim, according to the campaigners that organised the protest. Born Free says at least two of the birds have never seen the sky. A spokesperson for the Sea Life London Aquarium said on Sunday the penguins' habitat was \"designed with help and advice from specialist vets\". The statement added: \"It provides an excellent balance of water and land for the penguins, which enables them to express their normal behaviours, and there is space for them to ensure they have sufficient privacy.\" Feargal Sharkey, former singer of The Undertones, now known for his campaigning against the water industry, dared Merlin Entertainments' new chief executive Fiona Eastwood to \"swap places with the penguins\". \"In fact, if she's prepared to actually spend a month down there with those penguins, I will donate £1,000 of my money to a charity of her choosing,\" Mr Sharkey said. \"As we now know, some of them have been there for 14 years, in the basement of a former council building. \"It's a shocking indictment.\" He added: \"There is no reason that they should be benefiting at all from imprisoning 15 birds in the basement of an old council building. \"It's idiotic. It's a nonsense, and it's got to stop.\" Merlin Entertainments is co-run by Blackstone Group, Canada Pension Plan Investment Board (CPPIB), and Kirkbi, the investment arm of the Lego family. The British theme park company owns a range of theme parks and other attractions across the UK, including Alton Towers, Legoland Windsor, Madame Tussauds, Thorpe Park, and Chessington World of Adventures. Gentoo penguins are supreme swimmers, the fastest swimming bird in the world, according to the charity Penguins International. In the wild, they can reach speeds of 22mph (35 kph). Naturalist and TV presenter Chris Packham said he was there to protest the \"injustice that's been wrought upon 15 beautiful little gentoo penguins currently housed in the dingy basement of the building behind me.\" He told Sky News: \"This building was always unsuitable for these bids, and they've got to be shifted out.\" Megan McCubbin, fellow TV presenter and Chris Packham's stepdaughter, said gentoo penguins were \"one of the most amazing species that we have on our planet\". She added: \"And when you walk through [the basement] - and I've only been once and I will never go again - you can't help but feel heartbroken about them.\" Sea Life London Aquarium also said in its statement it was \"committed to supporting conservation causes globally\" through its Breed, Rescue, Protect programme, which supports endangered species."
    },
    {
        "title": "Limp Bizkit bassist Sam Rivers dies aged 48, band says",
        "description": "Sam Rivers, the bassist with US nu-metal group Limp Bizkit, has died aged 48, his bandmates have said.",
        "url": "https://news.sky.com/story/limp-bizkit-bassist-sam-rivers-dies-aged-48-band-says-13453055",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sam-rivers-limp-bizkit_7055090.jpg?20251019080620",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-19 06:52:00",
        "Headline": "Fred Durst and his Limp Bizkit bandmates have paid tribute to their \"brother\", a musician who brought \"a light and a rhythm that could never be replaced\".",
        "Content": "Sam Rivers, the bassist with US nu-metal group Limp Bizkit, has died aged 48, his bandmates have said. In a post on Instagram, the group paid tribute to their \"brother\" and a \"once-in-a-lifetime kind of human\", describing his presence as \"pure magic\". Bandmates Fred Durst, Wes Borland, John Otto and DJ Lethal all shared the tribute, which said: \"Sam Rivers wasn't just our bass player - he was pure magic. The pulse beneath every song, the calm in the chaos, the soul in the sound. \"From the first note we ever played together, Sam brought a light and a rhythm that could never be replaced.\" Their statement ended by saying: \"Rest easy, brother. Your music never ends.\" In a separate message, DJ Lethal said they were in shock, and added: \"Rest in power my brother! You will live on through your music and the lives you helped save with your music, charity work and friendships.\" He urged his followers to \"enjoy every millisecond of life\", adding: \"It's not guaranteed.\" The band did not say how the musician died. Formed in Jacksonville, Florida in 1994, Limp Bizkit released their debut album in 1997. Playing a fusion of rock and hip-hop dubbed nu-metal, their first big hit was 2000's Take A Look Around - the theme from Mission Impossible 2 - followed by Rollin', the song that took them to the top of the charts in the UK. Read more on Sky News:The Boss on biopicSocialite Goldsmith dies The band sold an estimated 45 million albums, according to a royalties lawsuit filed in 2024. They received three Grammy nominations in 2000 and 2001, and won three MTV Europe Music Awards."
    }
]