[
    {
        "title": "'Once in a generation moment': Starmer vows to 'keep US and Europe together' amid Russia threat",
        "description": "The prime minister has spoken of a \"once in a generation moment\" for the UK, US and Europe to work together and warned against NATO \"divisions\" - as two senior American officials head to Saudi Arabia for peace talks between Russia and Ukraine.",
        "url": "https://news.sky.com/story/us-officials-heading-to-saudi-arabia-for-russia-ukraine-peace-talks-13310358",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-vladimir-putin-donald-trump_6827194.jpg?20250212231855",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-15 19:13:00",
        "Headline": "The prime minister warns against allowing \"divisions\" in the alliance between Europe and the US to distract from \"external enemies\" and the threat from Russia. His comments come among tensions at a security conference in Munich.",
        "Content": "The prime minister has spoken of a \"once in a generation moment\" for the UK, US and Europe to work together and warned against NATO \"divisions\" - as two senior American officials head to Saudi Arabia for peace talks between Russia and Ukraine. Sir Keir Starmer said the UK will \"work to ensure we keep the US and Europe together\" amid the threat faced from Russia. His comments came after the Ukrainian president cautioned: \"The old days are over when America supported Europe just because it always had.\" Earlier on Saturday, US officials confirmed Europe would not be involved in the upcoming peace talks between Russia and Ukraine. Analysis: Peace talks risk short-term win that rewards Putin Washington also sent a questionnaire to European capitals to ask what they could contribute to security guarantees for Kyiv. \"It's clear Europe must take on a greater role in NATO,\" said Sir Keir on Saturday night. \n                  US taxpayers spend $24,000 on Irish college's DEI film project\n                 \n                  Day 27: What does Trump want from Germany's far right?\n                 \n                  White House criticised for 'disgusting' Instagram Valentine's Day post\n                 \"We cannot allow any divisions in the alliance to distract from the external enemies we face.\"  The French president is thought to be convening crisis talks between European leaders and NATO, which the prime minister will attend. Sir Keir will then take messages from that meeting to Washington DC when he meets US President Donald Trump the week after, according to Downing Street sources. During a talk at a security conference in Munich, Poland's foreign minister Radosław Sikorski said he was \"very glad that President Macron has called our leaders to Paris\" to discuss \"in a very serious fashion\" the challenges posed by Mr Trump. Meanwhile, US national security adviser Mike Waltz and special envoy Steve Witkoff are thought to be going to Saudi Arabia for peace talks between Ukraine and Russia, according to two sources familiar with the matter who spoke to Sky News' US partner network NBC News. On Wednesday, Mr Trump said there had been an agreement to begin negotiations about ending the war in Ukraine, after holding phone calls with Russia's Vladimir Putin and Ukraine's Volodymyr Zelenskyy. The Ukrainian president alluded to the conversations at the Munich Security Conference on Saturday, suggesting Europe should be playing a role in the negotiations as well.  \"Ukraine will never accept deals made behind our backs without our involvement, and the same rule should apply to all of Europe,\" Mr Zelenskyy said. \"The old days are over when America supported Europe just because it always had.\" He told world leaders it is time for the creation of an \"armed forces of Europe\", adding his army was \"not enough\". Following his call with President Putin, Mr Trump posted on Truth Social saying: \"We both agreed, we want to stop the millions of deaths taking place in the War with Russia/Ukraine.\"  Mr Trump had told White House reporters he did not see any way \"that a country in Russia's position\" could allow Ukraine to join NATO and that it was unlikely Ukraine would get all of its occupied land back. It comes after Sir Keir told Mr Zelenskyy in recent days that Ukraine was still on an \"irreversible path\" to joining NATO. However, on Saturday, the US special envoy for Ukraine Keith Kellogg said peace talks could focus on territorial concessions from Russia and targeting Mr Putin's oil revenues. \"Russia is really a petrostate,\" he said as he suggested Western powers needed to do more to enforce sanctions on Russia. Mr Zelenskyy said the main issue in peace talks was to \"not allow everything to go according to Putin's plan\". Business and Trade Secretary Jonathan Reynolds and shadow foreign secretary Priti Patel will be discussing all the latest political stories in the UK and around the world on the Trevor Phillips On Sunday show from 8.30am."
    },
    {
        "title": "Craig and Lindsay Foreman: British couple detained in Iran are named - as family 'significantly concerned'",
        "description": "A British couple who have been detained in Iran have been named by their family as Craig and Lindsay Foreman.",
        "url": "https://news.sky.com/story/craig-and-lindsay-foreman-british-couple-detained-in-iran-are-named-as-family-significantly-concerned-13309761",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-lindsay-foreman-iran_6829326.jpg?20250215124800",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-15 12:44:00",
        "Headline": "Craig and Lindsay Foreman's family say they are \"deeply focused\" on ensuring the British nationals' safety after they were detained in Kerman, Iran. They described their detention as an \"unexpected turn of events\".",
        "Content": " A British couple who have been detained in Iran have been named by their family as Craig and Lindsay Foreman. The family said they are \"significantly concerned\" by the \"distressing situation\". According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission. On 30 December, she posted about how they were about to face \"one of the most challenging\" parts of their trip, Iran and Pakistan. The post reads: \"Despite the advice of friends, family, and the FCDO (which strongly advises against travel to Iran for British nationals), we've chosen to keep moving forward. \"Why? Because we believe that, no matter where you are in the world, most people are good, kind humans striving for a meaningful life. \"Yes, we're aware of the risks. But we also know the rewards of meeting incredible people, hearing their stories, and seeing the breathtaking landscapes of these regions could far outweigh the fear.\" In a statement, the couple's family expressed their concern and said they were engaging with the UK government. \"We would like to take this opportunity to address the distressing situation concerning Craig and Lindsay Foreman who are currently being detained in Kerman, Iran,\" they said. \"This unexpected turn of events has caused significant concern for our entire family, and we are deeply focused on ensuring their safety and well-being during this trying time. \"We are actively engaging with the British government and relevant authorities, working diligently to navigate the complexities of this matter. The family are united in our determination to secure their safe return. \"We truly appreciate the outpouring of support from friends, family, and the community, which has provided us with strength and encouragement as we face this ordeal.\" They added: \"Thank you for your understanding, compassion, and continued support.\" Read more from Sky News:Trump says he and Starmer will meet 'very soon'World number one gets three-month tennis ban for doping A Foreign Office spokesperson earlier said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\" Iranian state media said on Wednesday that a man and woman were in custody in Iran's southeastern city of Kerman on security-related charges. The Foreign Office warns that people are at risk of \"arrest, detention and a death sentence\" if they travel to Iran. Iran has previously arrested and held British citizens for extended periods of time. Nazanin Zaghari-Ratcliffe and Anoosheh Ashoori, who are dual British-Iranian citizens, were released in March 2022 after years held captive in Iran."
    },
    {
        "title": "Boy, 14, stabbed to death as five attacked in Austria",
        "description": "A man has stabbed five people in southern Austria, including a 14-year-old boy who has died from his injuries.",
        "url": "https://news.sky.com/story/boy-14-dies-after-five-stabbed-in-austria-13310330",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-villach-austria_6830137.jpg?20250215193210",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-15 18:50:00",
        "Headline": "Police say they had not yet determined a motive but were investigating the suspect's background.",
        "Content": "A man has stabbed five people in southern Austria, including a 14-year-old boy who has died from his injuries. The 23-year-old man attacked five passersby in Villach on Saturday afternoon, according to police. A nearby driver spotted the man and drove into him to halt the attack, police said. Officers said the suspect is a Syrian national with legal residence in Austria and has been detained. Police spokesperson Rainer Dionisio said the attacker was \"observed by a witness - a food delivery driver saw it and rammed him with his vehicle, and at the moment it looks like he was thus able to prevent him from causing further damage\". The victims were all male and aged between 14 and 32, and it is unclear if they were known to the attacker. Two were seriously injured and two sustained minor injuries, and the teenager died. Mr Dionisio said they had not yet determined a motive but were investigating the suspect's background. \n                  Austrian Chancellor Karl Nehammer to resign after talks on forming new government fail\n                 \n                  Far-right party wins Austrian general election - but may struggle to form government\n                 \n                  Austria's far-right Freedom Party eyes first-time election win with narrow lead in polls\n                 \"We have to wait until we get secure information,\" he said. The weekend attack shocked people in the city of Villach, a southern town in the province of Carinthia, which borders Italy and Slovenia. Such attacks are very rare in Austria. A jihadist killed four people in Vienna in a shooting rampage in 2020 that was the country's deadliest assault in decades. Carinthia governor Peter Kaiser expressed his sympathy for the family of the teenage boy who was killed. \"This outrageous atrocity must be met with harsh consequences,\" he said. \"I have always said with clarity and unambiguously - those who live in Carinthia, in Austria, have to respect the law and adjust to our rules and values.\" Police said it was unclear whether the suspect had been acting on his own or with other people, and are continuing to look for potential further suspects. Meanwhile in Germany on Saturday, police confirmed a two-year-old girl and her mother had died after a car had been driven into a crowd in Munich on Thursday."
    },
    {
        "title": "Suspect in Kent shooting 'may have entered water' at Dartford Crossing, police say",
        "description": "The suspect in the fatal shooting of a woman at a pub in Kent \"may have entered the water\" at the Dartford Crossing, Kent Police have said.",
        "url": "https://news.sky.com/story/suspect-in-kent-shooting-may-have-entered-water-at-dartford-crossing-police-say-13310307",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-the-three-horseshoes_6829363.jpg?20250215133222",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-15 18:25:00",
        "Headline": "Police are hunting for a suspect after the fatal shooting of a woman outside a pub in Kent on Valentine's Day evening.",
        "Content": " The suspect in the fatal shooting of a woman at a pub in Kent \"may have entered the water\" at the Dartford Crossing, Kent Police have said. The suspect, who is believed to be known to the victim, a woman in her 40s, left the area after the incident outside a Kent pub on Friday evening. Read more: Woman killed in Valentine's Day shooting at village pub A murder investigation has been launched over the shooting at the Three Horseshoes pub in Main Road, Knockholt. Officers discovered a vehicle linked to the incident and a firearm at the Dartford Crossing in Kent. \"Call handlers received reports of a man on the wrong side of the barrier and we are not ruling out the possibility that he may have entered the water,\" said senior investigating officer Detective Chief Inspector David Higham. \"We are currently only looking for one suspect and do not believe there to be an ongoing risk to the public.\" Neither the suspect or victim are thought to have been from Kent, although they are believed to have local connections. Pictures from the scene of the shooting on Friday night showed forensic teams in white overalls examining the car park next to the pub. Read more from Sky News:British couple detained in Iran are namedCare home residents 'go wild' for stripperWorld number one gets three-month tennis ban for doping A tarpaulin was put up next to a blue Seat parked at the entrance to the car park. The passenger side window of the vehicle was smashed and shattered glass could be seen around the car. What appears to be bullet casings were also reportedly spotted on the ground, where numbered yellow evidence markers were also visible. John Webb, a local resident, said he was having a meal inside when \"about seven o'clock something happened outside... and then we heard someone had been shot\". \"We stayed in the pub until they escorted us out,\" he told Sky News correspondent Mollie Malone. Vicky Hesketh, another local resident, said she saw \"someone on the floor being given CPR by paramedics\". \"It's like a really typical, normal village. Everyone knows everyone. It's not something you expect to happen,\" she said. "
    },
    {
        "title": "Laura Whitmore shares final message from Caroline Flack on anniversary of her death",
        "description": "Laura Whitmore has shared the last text messages between her and Caroline Flack on the five-year anniversary of her death.",
        "url": "https://news.sky.com/story/laura-whitmore-shares-final-message-from-caroline-flack-on-anniversary-of-her-death-13309979",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-flack-caroline_6518081.jpg?20240411161106",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-15 15:35:00",
        "Headline": "Caroline Flack took her own life on 15 February 2020, aged 40, after learning prosecutors were going to press ahead with an assault charge over an incident involving her boyfriend, Lewis Burton.",
        "Content": "Laura Whitmore has shared the last text messages between her and Caroline Flack on the five-year anniversary of her death. Flack, who was best known for presenting ITV's Love Island, took her own life on 15 February 2020, aged 40. The Irish TV presenter shared a photo of the pair together, along with a series of screenshots of their WhatsApp conversation, in which she told Flack she had been offered the Love Island presenting role.   In the messages, Flack said it was \"perfect\" that Whitmore would be doing the show alongside her husband Iain Stirling, who narrates the series, and followed up the message with a series of love hearts. Flack hosted the reality dating show between 2015 and 2019. Whitmore took over in 2020. Maya Jama stepped into the role in 2023. In her Instagram post, Whitmore, 39, said: \"I got a new phone this month and as I was trying to download WhatsApp messages from my cloud loads of old messages came up. \"Ones I thought I lost a few years ago and no longer had. It really hit me hard. \"Looking at messages I've never publicly shared as they were private messages. Media outlets wrote a lot far from the actual truth. \"I think they show a side to Caroline which is nice to remember. Hence I'm sharing now.\" Read more:Harvey Weinstein sues his brother BobWhere to watch all the award season movies Whitmore said she had met Flack when she took over hosting duties for I'm A Celebrity... Get Me Out Of Here! NOW!. \"She was as supportive of me doing that role back then as she was when she supported me doing Love Island in 2020,\" she said. \"Both were great shows with hundreds of people working on them and relying on the show going ahead. \"I will always be so thankful of the last messages between me and Caroline.\" She continued: \"Every time I've been asked to speak about the situation or be part of a documentary I decline. \"I've already said all I can say on the tragedy and don't want words to be misconstrued and need to look after my own mental health. \"This was the last correspondence I ever had with her.\" \"The last message from her to me were love hearts,\" she said. \"I'd like to think wherever she is now, she's at peace and somewhere lovely like I hoped. \"I'm sad when I see the press and social media be so divisive and that we still haven't learned from Caroline's treatment before her death when it comes to women in the spotlight. \"Today I choose to remember these messages and thank the cloud for giving them back to me.\" Flack's family previously released an unpublished Instagram post she had written describing the stress of her arrest for common assault, while her former boyfriend Danny Cipriani also shared their final messages. A friend also shared her \"final photo\" taken just hours before her death. After Flack's death a coroner ruled she took her own life after learning prosecutors were going to press ahead with an assault charge over an incident involving her boyfriend, Lewis Burton. Born in Enfield, Flack got her first TV break playing Bubbles on comedy sketch show Bo Selecta alongside Leigh Francis, before fronting the International Pepsi Chart Show and moving on to Channel 4's E4 Music. She later hosted Big Brother's Little Brother, I'm A Celebrity... Get Me Out Of Here and X Factor, going on to win Strictly Come Dancing in 2014. An upcoming Disney+ documentary follows Flack's mother as she tries to understand events in the final months of her daughter's life, while also celebrating her career. Christine Flack unveiled a suicide prevention bench in north London last September in honour of her daughter. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Idris Elba on the power of football - and how it can help tackle knife crime",
        "description": "Idris Elba hopes providing more access to football in communities will deter youngsters from knife crime and he urged other industries to follow the Premier League's lead.",
        "url": "https://news.sky.com/story/idris-elba-on-the-power-of-football-and-how-it-can-help-tackle-knife-crime-13310513",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-idris-elba-speaking-on-knife-crime_6830326.jpg?20250216022301",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-02-15 23:46:00",
        "Headline": "The Premier League has invested more than £90m in the Kicks programme across two decades with a particular focus on reducing violent behaviour.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Idris Elba hopes providing more access to football in communities will deter youngsters from knife crime and he urged other industries to follow the Premier League's lead. The actor dropped in on a session run by the West Ham Foundation - part of the league's Kicks programme supporting youngsters at risk of anti-social behaviour and youth violence by providing free weekly football. While it could offer pathways in the sport - including coaching the next generation - Elba sees how it provides the toolset for personal development in life more broadly. \"Football has an amazing aggregated power,\" Elba told Sky News. \"I think that is a really good sort of example for other industries to think about mentorship programmes. \"Apprenticeship programmes that can just give young people (opportunities) because not every kid wants to play football. \"But at least we're seeing the Premier League do something. The big tech companies, motor industry companies should say, 'Hey, what can we do with the young people? What are their interests?'\" Read more:What are the UK's knife crime laws?Plans for two types of ID to buy knives online \n                  Idris Elba joins Prime Minister Sir Keir Starmer for launch of new anti-knife crime coalition\n                 \n                  The King and Idris Elba discuss youth violence at King's Trust event\n                 \n                   Idris Elba says zombie knife ban start date is 'far too long away' and calls for more community support\n                 The Premier League has invested more than £90m in the Kicks programme across two decades with a particular focus on reducing violent behaviour. The need for such a scheme was reinforced by the fatal stabbings of 10 teenagers in London last year being followed by a 14-year-old's killing in the first week of 2025. It is a year since Elba launched his own campaign, Don't Stop Your Future, to call for greater urgency in addressing the knife crime crisis. \"Where there are young people aggregating around football, around teams, should we be messaging that knife crime is no good? Absolutely. Yes,\" Elba said. \"We should be messaging that wherever you can. \"Just listen to a young person once. If you've never asked them what their feelings are about knife crime, about what they want to do with their lives, do it. That's one thing… The answer is up to you, but ultimately, you're beginning the conversation.\"  It was a conversation Elba had earlier this week in Dagenham with young players and coaches alongside a roundtable with community leaders impacted by knife crime. \"I absolutely feel that the more we talk, we can do about this, the better,\" Elba said. \"Are there mechanisms where football can play a part in a larger scale? Absolutely. Let's hope that we can all put our thinking caps on.\" That is working - as the Premier League does - with police to confront the knife crime epidemic. \"It feels probably to many that not enough is being done,\" Met Police Commander Stephen Clayman, the national policing lead for knife crime, told Sky News pitchside at the Kicks programme. \"But actually, you see things like this. You only need to change the direction of a number of people. You've already made a huge difference. \"What you need is more of this, more investment in youth services, in these types of things, and then you start making the difference.\" But can football really make communities safer by providing access to football? Or is it for authorities to search for more impactful interventions - by increasing the number of officers on the beat? Read more:One in five teachers 'have seen students with knives' \"Having more cops can make a difference in some areas for enforcement, but it's not just about enforcement,\" Commander Clayman said. \"You're only going to really tackle this if you get to the root cause of why someone feels they have to pick up a knife in the first place. \"That's not going to be the police solving that. That's going to be people with some of the sort of coaches and mentors here that will do that and all the other services around. That's what will make the real difference over time. It's never going to be a quick fix.\"  But football is trying to help in any way it can to prevent the tragedies that trouble West Ham captain Jarrod Bowen. \"Things like this really help people get off the streets and really do something with their life and make a real powerful change - I think it's such a really important thing,\" he said in an interview. \"It teaches them good habits and it teaches them a lot of different things as well. They spoke about the mental side of football and the technical side also. \"I think it also teaches about social skills. You have to play as a team, people making friendships here as well. So, I think it's a really powerful positive thing.\""
    },
    {
        "title": "Keely Hodgkinson 'heartbroken' after world record hopes shattered by injury",
        "description": "Keely Hodgkinson is \"heartbroken\" that her plans to try and smash the world indoor 800m record this weekend are in tatters.",
        "url": "https://news.sky.com/story/keely-hodgkinson-heartbroken-after-world-record-hopes-shattered-by-injury-13310295",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keely-hodgkinson-olympics_6829986.jpg?20250215182022",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-15 18:14:00",
        "Headline": "Despite a hamstring injury shattering her world record hopes for this weekend, Olympic champion Keely Hodgkinson has still got her eye on \"rewriting the history books\" and beating a 42-year record in the 800m.",
        "Content": " Keely Hodgkinson is \"heartbroken\" that her plans to try and smash the world indoor 800m record this weekend are in tatters. The 22-year-old Olympic champion suffered a hamstring tear in her last training session ahead of the Keely Klassic in Birmingham. \"Things really came together well and just at the last second, it's sadly been taken away,\" she told Sky News' sports presenter Jacquie Beltrao.   She would have backed herself to break the record and feels faster every year. \"That's probably why this happened. Too much speed and the muscles can't quite take it yet. Each year I'm getting stronger and stronger,\" she said. The longest-standing world record in track athletics is the women's 800m, set in 1983 by Czech runner Jarmila Kratochvilova when she was 32. At a time when there was systemic steroid use in Iron Bloc countries, she always denied taking anything other than vitamin B12. But no one has come close to breaking that record. \"If you'd asked me a year ago if [that] was possible, I may have said 'no',\" said Hodgkinson. \"But seeing what I did in training last year and how well my body has come on and the technology we have in track and field now, I 100% think it's possible.\" Read more from Sky News:British couple detained in Iran are namedCare home residents 'go wild' for stripperWorld number one gets three-month tennis ban for doping She's got her eye on \"rewriting the history books\" and beating that 42-year-long record. \"I look forward to having that as a really big target and seeing how fast I can go,\" she said. Hodgkinson became the sixth fastest woman in history last year, just before she stormed the Paris Olympics and took home a gold in the 800m. Thinking of the moment she crossed that finish line still gives Hodgkinson \"goosebumps\" and cheers her up on bad days, although setting goals also kept her motivated after Paris. \"When we announced the Keely Klassic and going for the world record, [it] really helped give me something else to go for,\" she said. \"So it made it even more heartbreaking when I couldn't do it,\" she said."
    },
    {
        "title": "Suspect in Kent shooting 'may have entered water' at Dartford Crossing, police say",
        "description": "The suspect in the fatal shooting of a woman at a pub in Kent \"may have entered the water\" at the Dartford Crossing, Kent Police have said.",
        "url": "https://news.sky.com/story/suspect-in-kent-shooting-may-have-entered-water-at-dartford-crossing-police-say-13310307",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-the-three-horseshoes_6829363.jpg?20250215133222",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-15 18:25:00",
        "Headline": "Police are hunting for a suspect after the fatal shooting of a woman outside a pub in Kent on Valentine's Day evening.",
        "Content": " The suspect in the fatal shooting of a woman at a pub in Kent \"may have entered the water\" at the Dartford Crossing, Kent Police have said. The suspect, who is believed to be known to the victim, a woman in her 40s, left the area after the incident outside a Kent pub on Friday evening. Read more: Woman killed in Valentine's Day shooting at village pub A murder investigation has been launched over the shooting at the Three Horseshoes pub in Main Road, Knockholt. Officers discovered a vehicle linked to the incident and a firearm at the Dartford Crossing in Kent. \"Call handlers received reports of a man on the wrong side of the barrier and we are not ruling out the possibility that he may have entered the water,\" said senior investigating officer Detective Chief Inspector David Higham. \"We are currently only looking for one suspect and do not believe there to be an ongoing risk to the public.\" Neither the suspect or victim are thought to have been from Kent, although they are believed to have local connections. Pictures from the scene of the shooting on Friday night showed forensic teams in white overalls examining the car park next to the pub. Read more from Sky News:British couple detained in Iran are namedCare home residents 'go wild' for stripperWorld number one gets three-month tennis ban for doping A tarpaulin was put up next to a blue Seat parked at the entrance to the car park. The passenger side window of the vehicle was smashed and shattered glass could be seen around the car. What appears to be bullet casings were also reportedly spotted on the ground, where numbered yellow evidence markers were also visible. John Webb, a local resident, said he was having a meal inside when \"about seven o'clock something happened outside... and then we heard someone had been shot\". \"We stayed in the pub until they escorted us out,\" he told Sky News correspondent Mollie Malone. Vicky Hesketh, another local resident, said she saw \"someone on the floor being given CPR by paramedics\". \"It's like a really typical, normal village. Everyone knows everyone. It's not something you expect to happen,\" she said. "
    },
    {
        "title": "Laura Whitmore shares final message from Caroline Flack on anniversary of her death",
        "description": "Laura Whitmore has shared the last text messages between her and Caroline Flack on the five-year anniversary of her death.",
        "url": "https://news.sky.com/story/laura-whitmore-shares-final-message-from-caroline-flack-on-anniversary-of-her-death-13309979",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-flack-caroline_6518081.jpg?20240411161106",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-15 15:35:00",
        "Headline": "Caroline Flack took her own life on 15 February 2020, aged 40, after learning prosecutors were going to press ahead with an assault charge over an incident involving her boyfriend, Lewis Burton.",
        "Content": "Laura Whitmore has shared the last text messages between her and Caroline Flack on the five-year anniversary of her death. Flack, who was best known for presenting ITV's Love Island, took her own life on 15 February 2020, aged 40. The Irish TV presenter shared a photo of the pair together, along with a series of screenshots of their WhatsApp conversation, in which she told Flack she had been offered the Love Island presenting role.   In the messages, Flack said it was \"perfect\" that Whitmore would be doing the show alongside her husband Iain Stirling, who narrates the series, and followed up the message with a series of love hearts. Flack hosted the reality dating show between 2015 and 2019. Whitmore took over in 2020. Maya Jama stepped into the role in 2023. In her Instagram post, Whitmore, 39, said: \"I got a new phone this month and as I was trying to download WhatsApp messages from my cloud loads of old messages came up. \"Ones I thought I lost a few years ago and no longer had. It really hit me hard. \"Looking at messages I've never publicly shared as they were private messages. Media outlets wrote a lot far from the actual truth. \"I think they show a side to Caroline which is nice to remember. Hence I'm sharing now.\" Read more:Harvey Weinstein sues his brother BobWhere to watch all the award season movies Whitmore said she had met Flack when she took over hosting duties for I'm A Celebrity... Get Me Out Of Here! NOW!. \"She was as supportive of me doing that role back then as she was when she supported me doing Love Island in 2020,\" she said. \"Both were great shows with hundreds of people working on them and relying on the show going ahead. \"I will always be so thankful of the last messages between me and Caroline.\" She continued: \"Every time I've been asked to speak about the situation or be part of a documentary I decline. \"I've already said all I can say on the tragedy and don't want words to be misconstrued and need to look after my own mental health. \"This was the last correspondence I ever had with her.\" \"The last message from her to me were love hearts,\" she said. \"I'd like to think wherever she is now, she's at peace and somewhere lovely like I hoped. \"I'm sad when I see the press and social media be so divisive and that we still haven't learned from Caroline's treatment before her death when it comes to women in the spotlight. \"Today I choose to remember these messages and thank the cloud for giving them back to me.\" Flack's family previously released an unpublished Instagram post she had written describing the stress of her arrest for common assault, while her former boyfriend Danny Cipriani also shared their final messages. A friend also shared her \"final photo\" taken just hours before her death. After Flack's death a coroner ruled she took her own life after learning prosecutors were going to press ahead with an assault charge over an incident involving her boyfriend, Lewis Burton. Born in Enfield, Flack got her first TV break playing Bubbles on comedy sketch show Bo Selecta alongside Leigh Francis, before fronting the International Pepsi Chart Show and moving on to Channel 4's E4 Music. She later hosted Big Brother's Little Brother, I'm A Celebrity... Get Me Out Of Here and X Factor, going on to win Strictly Come Dancing in 2014. An upcoming Disney+ documentary follows Flack's mother as she tries to understand events in the final months of her daughter's life, while also celebrating her career. Christine Flack unveiled a suicide prevention bench in north London last September in honour of her daughter. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "Idris Elba on the power of football - and how it can help tackle knife crime",
        "description": "Idris Elba hopes providing more access to football in communities will deter youngsters from knife crime and he urged other industries to follow the Premier League's lead.",
        "url": "https://news.sky.com/story/idris-elba-on-the-power-of-football-and-how-it-can-help-tackle-knife-crime-13310513",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-idris-elba-speaking-on-knife-crime_6830326.jpg?20250216022301",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-02-15 23:46:00",
        "Headline": "The Premier League has invested more than £90m in the Kicks programme across two decades with a particular focus on reducing violent behaviour.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Idris Elba hopes providing more access to football in communities will deter youngsters from knife crime and he urged other industries to follow the Premier League's lead. The actor dropped in on a session run by the West Ham Foundation - part of the league's Kicks programme supporting youngsters at risk of anti-social behaviour and youth violence by providing free weekly football. While it could offer pathways in the sport - including coaching the next generation - Elba sees how it provides the toolset for personal development in life more broadly. \"Football has an amazing aggregated power,\" Elba told Sky News. \"I think that is a really good sort of example for other industries to think about mentorship programmes. \"Apprenticeship programmes that can just give young people (opportunities) because not every kid wants to play football. \"But at least we're seeing the Premier League do something. The big tech companies, motor industry companies should say, 'Hey, what can we do with the young people? What are their interests?'\" Read more:What are the UK's knife crime laws?Plans for two types of ID to buy knives online \n                  Idris Elba joins Prime Minister Sir Keir Starmer for launch of new anti-knife crime coalition\n                 \n                  The King and Idris Elba discuss youth violence at King's Trust event\n                 \n                   Idris Elba says zombie knife ban start date is 'far too long away' and calls for more community support\n                 The Premier League has invested more than £90m in the Kicks programme across two decades with a particular focus on reducing violent behaviour. The need for such a scheme was reinforced by the fatal stabbings of 10 teenagers in London last year being followed by a 14-year-old's killing in the first week of 2025. It is a year since Elba launched his own campaign, Don't Stop Your Future, to call for greater urgency in addressing the knife crime crisis. \"Where there are young people aggregating around football, around teams, should we be messaging that knife crime is no good? Absolutely. Yes,\" Elba said. \"We should be messaging that wherever you can. \"Just listen to a young person once. If you've never asked them what their feelings are about knife crime, about what they want to do with their lives, do it. That's one thing… The answer is up to you, but ultimately, you're beginning the conversation.\"  It was a conversation Elba had earlier this week in Dagenham with young players and coaches alongside a roundtable with community leaders impacted by knife crime. \"I absolutely feel that the more we talk, we can do about this, the better,\" Elba said. \"Are there mechanisms where football can play a part in a larger scale? Absolutely. Let's hope that we can all put our thinking caps on.\" That is working - as the Premier League does - with police to confront the knife crime epidemic. \"It feels probably to many that not enough is being done,\" Met Police Commander Stephen Clayman, the national policing lead for knife crime, told Sky News pitchside at the Kicks programme. \"But actually, you see things like this. You only need to change the direction of a number of people. You've already made a huge difference. \"What you need is more of this, more investment in youth services, in these types of things, and then you start making the difference.\" But can football really make communities safer by providing access to football? Or is it for authorities to search for more impactful interventions - by increasing the number of officers on the beat? Read more:One in five teachers 'have seen students with knives' \"Having more cops can make a difference in some areas for enforcement, but it's not just about enforcement,\" Commander Clayman said. \"You're only going to really tackle this if you get to the root cause of why someone feels they have to pick up a knife in the first place. \"That's not going to be the police solving that. That's going to be people with some of the sort of coaches and mentors here that will do that and all the other services around. That's what will make the real difference over time. It's never going to be a quick fix.\"  But football is trying to help in any way it can to prevent the tragedies that trouble West Ham captain Jarrod Bowen. \"Things like this really help people get off the streets and really do something with their life and make a real powerful change - I think it's such a really important thing,\" he said in an interview. \"It teaches them good habits and it teaches them a lot of different things as well. They spoke about the mental side of football and the technical side also. \"I think it also teaches about social skills. You have to play as a team, people making friendships here as well. So, I think it's a really powerful positive thing.\""
    },
    {
        "title": "Woman named in 'no body' murder investigation in Cambridgeshire",
        "description": "Police have named a missing woman at the centre of a \"no-body\" murder investigation as 54-year-old Julie Buckley.",
        "url": "https://news.sky.com/story/woman-named-in-no-body-murder-investigation-in-cambridgeshire-13310453",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-julie-buckley-cambridgeshire_6830247.jpg?20250215210931",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-15 21:01:00",
        "Headline": "A 54-year-old woman has been named in a murder investigation after she went missing from a Cambridgeshire village in January.",
        "Content": "Police have named a missing woman at the centre of a \"no-body\" murder investigation as 54-year-old Julie Buckley. Ms Buckley, from the Fenlands village of Christchurch, Cambridgeshire, hasn't been seen since late January. A 47-year-old man has been arrested on suspicion of her murder. Police have been continuing to search for Ms Buckley, as they try to find out why she is missing. Read more from Sky News:British couple detained in Iran are namedCare home residents 'go wild' for stripperWorld number one gets three-month tennis ban for doping \"We are trying to piece together Julie's movements before she disappeared so I would appeal for anyone who has seen her in the past few weeks to get in touch,\" said Detective Inspector Richard Stott from the Bedfordshire, Cambridgeshire and Hertfordshire Major Crime Unit. \"We know she has links to places in the surrounding area including March, Manea, and Chatteris so I would urge people who live in those areas to consider if they have information that could be of use to our inquiry. \n                  Una Crown: Man found guilty of 86-year-old's murder after DNA found on nail clippings\n                 \n                  Drunk driver found in bed as police arrest him after fleeing scene of crash\n                 \n                  Parrots missing from London Zoo found behind Cambridgeshire family's garden\n                 \"We are in touch with family of Julie and specially trained officers are keeping them up to date on the police inquiry at this very difficult time. \"Although we have always wanted to find Julie alive, the circumstances suggest she is likely to have come to serious harm, so we continue to treat her disappearance as murder.\" Anyone with information can contact the police online or call 101 and quote Operation Dragonfish."
    },
    {
        "title": "Craig and Lindsay Foreman: British couple detained in Iran are named - as family 'significantly concerned'",
        "description": "A British couple who have been detained in Iran have been named by their family as Craig and Lindsay Foreman.",
        "url": "https://news.sky.com/story/craig-and-lindsay-foreman-british-couple-detained-in-iran-are-named-as-family-significantly-concerned-13309761",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-lindsay-foreman-iran_6829326.jpg?20250215124800",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-15 12:44:00",
        "Headline": "Craig and Lindsay Foreman's family say they are \"deeply focused\" on ensuring the British nationals' safety after they were detained in Kerman, Iran. They described their detention as an \"unexpected turn of events\".",
        "Content": " A British couple who have been detained in Iran have been named by their family as Craig and Lindsay Foreman. The family said they are \"significantly concerned\" by the \"distressing situation\". According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission. On 30 December, she posted about how they were about to face \"one of the most challenging\" parts of their trip, Iran and Pakistan. The post reads: \"Despite the advice of friends, family, and the FCDO (which strongly advises against travel to Iran for British nationals), we've chosen to keep moving forward. \"Why? Because we believe that, no matter where you are in the world, most people are good, kind humans striving for a meaningful life. \"Yes, we're aware of the risks. But we also know the rewards of meeting incredible people, hearing their stories, and seeing the breathtaking landscapes of these regions could far outweigh the fear.\" In a statement, the couple's family expressed their concern and said they were engaging with the UK government. \"We would like to take this opportunity to address the distressing situation concerning Craig and Lindsay Foreman who are currently being detained in Kerman, Iran,\" they said. \"This unexpected turn of events has caused significant concern for our entire family, and we are deeply focused on ensuring their safety and well-being during this trying time. \"We are actively engaging with the British government and relevant authorities, working diligently to navigate the complexities of this matter. The family are united in our determination to secure their safe return. \"We truly appreciate the outpouring of support from friends, family, and the community, which has provided us with strength and encouragement as we face this ordeal.\" They added: \"Thank you for your understanding, compassion, and continued support.\" Read more from Sky News:Trump says he and Starmer will meet 'very soon'World number one gets three-month tennis ban for doping A Foreign Office spokesperson earlier said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\" Iranian state media said on Wednesday that a man and woman were in custody in Iran's southeastern city of Kerman on security-related charges. The Foreign Office warns that people are at risk of \"arrest, detention and a death sentence\" if they travel to Iran. Iran has previously arrested and held British citizens for extended periods of time. Nazanin Zaghari-Ratcliffe and Anoosheh Ashoori, who are dual British-Iranian citizens, were released in March 2022 after years held captive in Iran."
    },
    {
        "title": "Keely Hodgkinson 'heartbroken' after world record hopes shattered by injury",
        "description": "Keely Hodgkinson is \"heartbroken\" that her plans to try and smash the world indoor 800m record this weekend are in tatters.",
        "url": "https://news.sky.com/story/keely-hodgkinson-heartbroken-after-world-record-hopes-shattered-by-injury-13310295",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-keely-hodgkinson-olympics_6829986.jpg?20250215182022",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-15 18:14:00",
        "Headline": "Despite a hamstring injury shattering her world record hopes for this weekend, Olympic champion Keely Hodgkinson has still got her eye on \"rewriting the history books\" and beating a 42-year record in the 800m.",
        "Content": " Keely Hodgkinson is \"heartbroken\" that her plans to try and smash the world indoor 800m record this weekend are in tatters. The 22-year-old Olympic champion suffered a hamstring tear in her last training session ahead of the Keely Klassic in Birmingham. \"Things really came together well and just at the last second, it's sadly been taken away,\" she told Sky News' sports presenter Jacquie Beltrao.   She would have backed herself to break the record and feels faster every year. \"That's probably why this happened. Too much speed and the muscles can't quite take it yet. Each year I'm getting stronger and stronger,\" she said. The longest-standing world record in track athletics is the women's 800m, set in 1983 by Czech runner Jarmila Kratochvilova when she was 32. At a time when there was systemic steroid use in Iron Bloc countries, she always denied taking anything other than vitamin B12. But no one has come close to breaking that record. \"If you'd asked me a year ago if [that] was possible, I may have said 'no',\" said Hodgkinson. \"But seeing what I did in training last year and how well my body has come on and the technology we have in track and field now, I 100% think it's possible.\" Read more from Sky News:British couple detained in Iran are namedCare home residents 'go wild' for stripperWorld number one gets three-month tennis ban for doping She's got her eye on \"rewriting the history books\" and beating that 42-year-long record. \"I look forward to having that as a really big target and seeing how fast I can go,\" she said. Hodgkinson became the sixth fastest woman in history last year, just before she stormed the Paris Olympics and took home a gold in the 800m. Thinking of the moment she crossed that finish line still gives Hodgkinson \"goosebumps\" and cheers her up on bad days, although setting goals also kept her motivated after Paris. \"When we announced the Keely Klassic and going for the world record, [it] really helped give me something else to go for,\" she said. \"So it made it even more heartbreaking when I couldn't do it,\" she said."
    },
    {
        "title": "Middlesbrough care home residents 'go wild' for Dreamboys stripper",
        "description": "A male stripper caused a stir at a Middlesbrough care home this week, when he replaced the residents' usual \"knit and natter\" session with a striptease.",
        "url": "https://news.sky.com/story/middlesbrough-care-home-residents-go-wild-for-dreamboys-stripper-13309968",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-care-home-stripper_6829563.jpg?20250215153253",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-15 15:27:00",
        "Headline": "The residents twirled pants and props as Max Hunter performed a striptease that replaced the usual \"knit and natter\" session.",
        "Content": " A male stripper caused a stir at a Middlesbrough care home this week, when he replaced the residents' usual \"knit and natter\" session with a striptease. Max Hunter was a care home manager before he became a stripper and decided to offer the elderly residents a show. \"I spoke to the gang here and the ladies said a resounding 'yes please',\" said Astune Rise care home's manager Caroline Bowstead. \"I've never seen a reaction like it at any event we've done.\"  A video of the event shows Mr Hunter gyrating with the home's residents and stripping off his uniform down to his underwear. The residents twirled pants and props as Mr Hunter danced in the living room of the care home, which was decked out in red shimmer curtains. \"He has a nice body, nice and athletic and everything he did was lovely,\" said 87-year-old Anne Hodgson. \"Everybody was smiling and that's beautiful.\" \"I loved his backside,\" added resident Betty Hughes. Read more from Sky News:British couple detained in Iran are namedTrump says he and Starmer will meet 'very soon'World number one gets three-month tennis ban for doping The residents are already keen to bring Mr Hunter back, and have asked Ms Bowstead if he can join next week's \"knit and natter\" session. \"I used to run entertainment at retirement villages so it's an absolute privilege to be back in a care home again putting a smile on residents' faces,\" said Mr Hunter. \"The reaction was absolutely wild, we had a bit of underwear thrown and a lot of laughs,\" said Alice Woods who manages the Dreamboys strip show Mr Hunter performs in."
    },
    {
        "title": "'Once in a generation moment': Starmer vows to 'keep US and Europe together' amid Russia threat",
        "description": "The prime minister has spoken of a \"once in a generation moment\" for the UK, US and Europe to work together and warned against NATO \"divisions\" - as two senior American officials head to Saudi Arabia for peace talks between Russia and Ukraine.",
        "url": "https://news.sky.com/story/us-officials-heading-to-saudi-arabia-for-russia-ukraine-peace-talks-13310358",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-vladimir-putin-donald-trump_6827194.jpg?20250212231855",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 19:13:00",
        "Headline": "The prime minister warns against allowing \"divisions\" in the alliance between Europe and the US to distract from \"external enemies\" and the threat from Russia. His comments come among tensions at a security conference in Munich.",
        "Content": "The prime minister has spoken of a \"once in a generation moment\" for the UK, US and Europe to work together and warned against NATO \"divisions\" - as two senior American officials head to Saudi Arabia for peace talks between Russia and Ukraine. Sir Keir Starmer said the UK will \"work to ensure we keep the US and Europe together\" amid the threat faced from Russia. His comments came after the Ukrainian president cautioned: \"The old days are over when America supported Europe just because it always had.\" Earlier on Saturday, US officials confirmed Europe would not be involved in the upcoming peace talks between Russia and Ukraine. Analysis: Peace talks risk short-term win that rewards Putin Washington also sent a questionnaire to European capitals to ask what they could contribute to security guarantees for Kyiv. \"It's clear Europe must take on a greater role in NATO,\" said Sir Keir on Saturday night. \n                  US taxpayers spend $24,000 on Irish college's DEI film project\n                 \n                  Day 27: What does Trump want from Germany's far right?\n                 \n                  White House criticised for 'disgusting' Instagram Valentine's Day post\n                 \"We cannot allow any divisions in the alliance to distract from the external enemies we face.\"  The French president is thought to be convening crisis talks between European leaders and NATO, which the prime minister will attend. Sir Keir will then take messages from that meeting to Washington DC when he meets US President Donald Trump the week after, according to Downing Street sources. During a talk at a security conference in Munich, Poland's foreign minister Radosław Sikorski said he was \"very glad that President Macron has called our leaders to Paris\" to discuss \"in a very serious fashion\" the challenges posed by Mr Trump. Meanwhile, US national security adviser Mike Waltz and special envoy Steve Witkoff are thought to be going to Saudi Arabia for peace talks between Ukraine and Russia, according to two sources familiar with the matter who spoke to Sky News' US partner network NBC News. On Wednesday, Mr Trump said there had been an agreement to begin negotiations about ending the war in Ukraine, after holding phone calls with Russia's Vladimir Putin and Ukraine's Volodymyr Zelenskyy. The Ukrainian president alluded to the conversations at the Munich Security Conference on Saturday, suggesting Europe should be playing a role in the negotiations as well.  \"Ukraine will never accept deals made behind our backs without our involvement, and the same rule should apply to all of Europe,\" Mr Zelenskyy said. \"The old days are over when America supported Europe just because it always had.\" He told world leaders it is time for the creation of an \"armed forces of Europe\", adding his army was \"not enough\". Following his call with President Putin, Mr Trump posted on Truth Social saying: \"We both agreed, we want to stop the millions of deaths taking place in the War with Russia/Ukraine.\"  Mr Trump had told White House reporters he did not see any way \"that a country in Russia's position\" could allow Ukraine to join NATO and that it was unlikely Ukraine would get all of its occupied land back. It comes after Sir Keir told Mr Zelenskyy in recent days that Ukraine was still on an \"irreversible path\" to joining NATO. However, on Saturday, the US special envoy for Ukraine Keith Kellogg said peace talks could focus on territorial concessions from Russia and targeting Mr Putin's oil revenues. \"Russia is really a petrostate,\" he said as he suggested Western powers needed to do more to enforce sanctions on Russia. Mr Zelenskyy said the main issue in peace talks was to \"not allow everything to go according to Putin's plan\". Business and Trade Secretary Jonathan Reynolds and shadow foreign secretary Priti Patel will be discussing all the latest political stories in the UK and around the world on the Trevor Phillips On Sunday show from 8.30am."
    },
    {
        "title": "Boy, 14, stabbed to death as five attacked in Austria",
        "description": "A man has stabbed five people in southern Austria, including a 14-year-old boy who has died from his injuries.",
        "url": "https://news.sky.com/story/boy-14-dies-after-five-stabbed-in-austria-13310330",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-villach-austria_6830137.jpg?20250215193210",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 18:50:00",
        "Headline": "Police say they had not yet determined a motive but were investigating the suspect's background.",
        "Content": "A man has stabbed five people in southern Austria, including a 14-year-old boy who has died from his injuries. The 23-year-old man attacked five passersby in Villach on Saturday afternoon, according to police. A nearby driver spotted the man and drove into him to halt the attack, police said. Officers said the suspect is a Syrian national with legal residence in Austria and has been detained. Police spokesperson Rainer Dionisio said the attacker was \"observed by a witness - a food delivery driver saw it and rammed him with his vehicle, and at the moment it looks like he was thus able to prevent him from causing further damage\". The victims were all male and aged between 14 and 32, and it is unclear if they were known to the attacker. Two were seriously injured and two sustained minor injuries, and the teenager died. Mr Dionisio said they had not yet determined a motive but were investigating the suspect's background. \n                  Austrian Chancellor Karl Nehammer to resign after talks on forming new government fail\n                 \n                  Far-right party wins Austrian general election - but may struggle to form government\n                 \n                  Austria's far-right Freedom Party eyes first-time election win with narrow lead in polls\n                 \"We have to wait until we get secure information,\" he said. The weekend attack shocked people in the city of Villach, a southern town in the province of Carinthia, which borders Italy and Slovenia. Such attacks are very rare in Austria. A jihadist killed four people in Vienna in a shooting rampage in 2020 that was the country's deadliest assault in decades. Carinthia governor Peter Kaiser expressed his sympathy for the family of the teenage boy who was killed. \"This outrageous atrocity must be met with harsh consequences,\" he said. \"I have always said with clarity and unambiguously - those who live in Carinthia, in Austria, have to respect the law and adjust to our rules and values.\" Police said it was unclear whether the suspect had been acting on his own or with other people, and are continuing to look for potential further suspects. Meanwhile in Germany on Saturday, police confirmed a two-year-old girl and her mother had died after a car had been driven into a crowd in Munich on Thursday."
    },
    {
        "title": "Mother and two-year-old daughter die after car ramming attack in Germany",
        "description": "A two-year-old girl and her mother have died after a car was rammed into a group of people in Munich on Thursday.",
        "url": "https://news.sky.com/story/mother-and-two-year-old-daughter-die-after-car-ramming-attack-in-germany-13310195",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-munich-car-attack-germany_6827533.jpg?20250213121104",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 17:27:00",
        "Headline": "Police give details of the first people to have died after a car was driven into a crowd in Munich on Thursday.",
        "Content": "A two-year-old girl and her mother have died after a car was rammed into a group of people in Munich on Thursday. The 37-year-old mother from the city and her daughter are the first deaths from the incident, German police said on Saturday. Police said at least 36 people were injured on Thursday morning when a car ploughed into a crowd taking part in a trade union demonstration. Read more:What we know about Munich car attackWill the far right be the second-largest party in Germany?  German Chancellor Olaf Scholz urged Germans to \"stand together\" as he laid flowers at the scene on Saturday. He said: \"We all have to stand together now, make sure that our country sticks together and that the very values that united those who peacefully organised a rally here and held a march are united with those who helped here, namely that we are together as human beings.\" A 24-year-old Afghan national known as Farhad N was detained at the scene. The suspect has lived in Munich since he arrived as an unaccompanied minor in 2016. Although his asylum application had been rejected, he lived in Germany legally with a residence permit and had no previous convictions. He is being investigated for 36 counts of attempted murder, as well as bodily harm and dangerous interference with road traffic. Prosecutors said he appeared to have had an Islamic extremist motive, though there was no evidence he was connected to any radical network. The attack fuelled yet more debate in Germany about migration, a top concern among voters as they head to the polls next week to elect a new government.  It sent shockwaves through the southern German city just hours before international leaders touched down for the annual Munich Security Conference. A judge on Friday ordered that the suspect remain in custody pending a possible charge. Chancellor Scholz said: \"It must always be very clear - anyone who does something like that must expect the harshest penalties.\" He added: \"And of course, if he has no right of stay, he will also have to leave the country at the end of his sentence.\""
    },
    {
        "title": "At least 15 people die in New Delhi train station stampede - as thousands head to India's Maha Kumbh festival",
        "description": "At least 15 people have died and a further 15 are injured after a stampede at the main train station in New Delhi on Saturday evening, the chief minister of the capital has said.",
        "url": "https://news.sky.com/story/at-least-15-people-die-in-new-delhi-train-station-stampede-as-thousands-head-to-indias-maha-kumbh-festival-13310477",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-new-delhi-train-station_6830284.jpg?20250215220516",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 21:41:00",
        "Headline": "Pilgrims had been vying to board a train to a Hindu festival in northern India, where another stampede last month left at least 30 people dead.",
        "Content": "At least 15 people have died and a further 15 are injured after a stampede at the main train station in New Delhi on Saturday evening, the chief minister of the capital has said. The deadly surge happened at about 8pm local time as thousands of passengers waited to board a train to the Maha Kumbh Hindu festival in Prayagraj in northern India. Eyewitness Dharmender Singh said there was \"a huge stampede... a huge crowd. I have never seen such a crowd before\". Those killed included 10 women and three children, according to local media reports.  Delhi's chief minister, known mononymously as Atishi, said on X that many of the victims were pilgrims en route to attend the Maha Kumbh festival. Their bodies were taken to the capital's Lok Nayak Jai Prakash Narain Hospital, Atishi said. \n                  Deadly stampede kills 30, injures dozens, at Maha Kumbh Hindu festival in northern India\n                 \n                  Police volunteer found guilty of rape and murder of junior doctor at hospital in India\n                 \n                  'Like a lion': Doctor reveals how Bollywood star Saif Ali Khan arrived at hospital after stabbing\n                 Indian Prime Minister Narendra Modi and some other federal ministers confirmed the incident in posts on X, although they did not disclose the number of people who died. \"Distressed by the stampede at New Delhi Railway Station. My thoughts are with all those who have lost their loved ones,\" Mr Modi said on X.  Railway minister Ashwini Vaishnaw said an investigation has been ordered to find out what caused the deadly stampede. Last month at least 30 people died in another stampede at the six-week festival itself, after tens of millions of Hindus gathered to take a dip in sacred river waters."
    },
    {
        "title": "Pope Francis to remain in hospital and miss Sunday prayer, Vatican says",
        "description": "Pope Francis, who was admitted to hospital on Friday, will miss his usual public appearance and weekly prayer with pilgrims on Sunday, the Vatican has said.",
        "url": "https://news.sky.com/story/pope-francis-to-remain-in-hospital-and-miss-sunday-prayer-vatican-says-13310435",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-pope-francis-vatican_6828507.jpg?20250214163314",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 20:34:00",
        "Headline": "The 88-year-old Pope Francis was taken to hospital on Friday with respiratory problems.",
        "Content": "Pope Francis, who was admitted to hospital on Friday, will miss his usual public appearance and weekly prayer with pilgrims on Sunday, the Vatican has said. Doctors have prescribed \"absolute rest\" for the 88-year-old, who is being treated for a respiratory tract infection. He was admitted to Rome's Gemelli hospital after battling a bout of bronchitis for more than a week.   Rome's largest hospital has a designed suite for popes, where it treated the late Pope John Paul II during his long papacy. \"To facilitate his recovery, the medical staff prescribed complete rest,\" said a statement. \n                  Pope Francis 'stable' in hospital after being admitted with 'slight fever'\n                 \n                  Pope Francis honoured by Joe Biden with Presidential Medal of Freedom with Distinction\n                 \n                  Gay men can become priests, as long as they remain celibate, new Italian guidelines say\n                 \"Pope Francis has been updated on the many messages of closeness and affection received and expresses his gratitude, while asking that we continue to pray for him\", the Vatican added.  The pope's tests showed some signs of improvement on Saturday and a slight fever had passed, it said, adding he had received communion and been praying, reading and resting. Earlier, the Vatican said the pope would remain in hospital as long as necessary for his treatment. \"We will see how he reacts to treatment,\" said Matteo Bruni, director of the Vatican's press office. He said he did not have a \"precise date\" for his discharge. In June 2023 Francis spent nine days at the Gemelli hospital when he had surgery for an abdominal hernia. On Saturday, well-wishers gathered under a famous statue of John Paul II outside the hospital to pray for Francis. \"We found out yesterday morning, with sadness,\" said Giovanni Di Muro, an Italian who was visiting his son inhospital. \"We hope it's nothing serious, and that everything will be fine.\" As a young adult, Francis developed a case of pleurisy and had part of one of his lungs removed. He became prone to lung infections in later life, and has been suffering with respiratory issues since mid-December."
    },
    {
        "title": "Volodymyr Zelenskyy: Ukraine's president calls for creation of 'armed forces of Europe' amid fears of reduction in US support",
        "description": "Volodymyr Zelenskyy says he believes it is time for the creation of an \"armed forces of Europe\", adding his army was \"not enough\".",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-calls-for-creation-of-armed-forces-of-europe-13309703",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-zelenskyy-ukraine_6829285.jpg?20250215104109",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 10:06:00",
        "Headline": "The Ukrainian leader's comments follow US President Donald Trump saying he didn't see any way \"that a country in Russia's position\" could allow Ukraine to join NATO.",
        "Content": " Volodymyr Zelenskyy says he believes it is time for the creation of an \"armed forces of Europe\", adding his army was \"not enough\". Speaking at the Munich Security Conference, the Ukrainian president said Europe cannot rule out the possibility that \"America might say no to Europe on issues that threaten it\". Ukraine has been defending itself from Russia's full-scale invasion for nearly three years. Mr Zelenskyy noted that many leaders have long spoken about how Europe needs its own military. \"I really believe that time has come,\" he told the gathering in Germany. \"The armed forces of Europe must be created.\" Read more:Analysis - Harsh truth that London, Paris and Berlin needed to hear \n                  'Once in a generation moment': Starmer vows to 'keep US and Europe together' amid Russia threat\n                 \n                  Boy, 14, stabbed to death as five attacked in Austria\n                 \n                  Mother and two-year-old daughter die after car ramming attack in Germany\n                 His comments come after US President Donald Trump held separate calls with Russian President Vladimir Putin and Mr Zelenskyy earlier this week, to try and kickstart a negotiating process to end the war in Ukraine. Mr Trump then told reporters at the White House that he didn't see any way \"that a country in Russia's position\" could allow Ukraine to join NATO. Mr Zelenskyy reacted to Mr Trump's call with the Russian leader by saying the main issue was to \"not allow everything to go according to Putin's plan\" - after the US president also said it was unlikely Ukraine would get all of its occupied land back.  In doing so, Mr Trump appeared to have conceded two of Mr Putin's war aims before talks had even begun. \"A few days ago, President Trump told me about his conversation with Putin,\" Mr Zelenskyy said at the conference on Saturday. \"Not once did he mention that America needs Europe at the table. That says a lot,\" he added. \"The old days are over when America supported Europe just because it always had.\" Read more from Sky News:Do Russians believe Trump can stop war in Ukraine?Trump wants Russia back in G7 👉 Listen to Sky News Daily on your podcast app 👈 Following his call with Mr Putin, the US president said the two leaders would likely meet soon to negotiate a peace deal over Ukraine. Mr Trump later assured Mr Zelenskyy that he too would have a seat at the negotiating table. \"Ukraine will never accept deals made behind our backs without our involvement, and the same rule should apply to all of Europe,\" Mr Zelenskyy said in Munich. He went on to say he believed it would be \"dangerous\" if Mr Trump met Mr Putin before he and the newly-elected US president met.  To Europe's leaders, he issued warnings, asking rhetorically whether their armies would be ready if Moscow launched an open or \"false-flag\" attack. The latter is designed to look like it was perpetrated by someone other than the group responsible for it. \"If this [Ukraine-Russia] war ends the wrong way, he [Mr Putin] will have a surplus of battle-tested soldiers who know nothing but killing and looting,\" he said, citing intelligence reports saying Russia will dispatch its troops to Belarus this summer. \"And now, as we fight this war and lay the groundwork for peace and security, we must build the armed forces ofEurope.\""
    },
    {
        "title": "Zelenskyy's Europe armed forces call is harsh truth that London, Paris and Berlin needed to hear",
        "description": "It is time for an armed forces of Europe.",
        "url": "https://news.sky.com/story/zelenskyys-europe-armed-forces-call-is-harsh-truth-that-london-paris-and-berlin-needed-to-hear-13309765",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6829455.jpg?20250215143448",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-02-15 12:55:00",
        "Headline": "Volodymyr Zelenskyy said Russia was building a new force of up to 150,000 soldiers. He asked the audience at the Munich Security Conference: \"If Russia came for you, could your army fight the same way [as Ukraine]?\"",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  It is time for an armed forces of Europe. This was the key message from Ukraine's president at a major security conference in Munich that has brutally exposed European irrelevance when the US is not onside. Volodymyr Zelenskyy said such a force would not replace the transatlantic NATO alliance, but it would instead ensure that Europe is as strong as Washington - and taken seriously by friends and foes once again. \"We must build the armed forces of Europe so that Europe's future depends only on Europeans and decisions about Europe are made in Europe,\" he said, speaking on the main stage at the Munich Security Conference on Saturday. It is a harsh truth that London, Paris and Berlin needed to hear as it becomes increasingly obvious that Washington under President Donald Trump is far more interested in going it alone rather than being the big - but benevolent - beast within an alliance of partners. The problem though is that the armies, navies and air forces of the most powerful nations in Europe have been hollowed out since the end of the Cold War as government spending priorities shifted to peacetime niceties such as the economy, healthcare and social welfare. In parallel, Europe lost its wartime mindset, honed on the battlefields of two world wars and the Cold War but then allowed to grow flabby as the continent reaped the benefits of peace, without appreciating the need to retain a fighting edge to protect its values. \n                  'Once in a generation moment': Starmer vows to 'keep US and Europe together' amid Russia threat\n                 \n                  Russian ships filmed carrying military hardware through the English Channel\n                 \n                  Horror, unease and questions for US allies as Trump's big shift puts European security in doubt\n                 Naive complacency The alarm bells to end this naive complacency have been ringing for the past decade but they finally reached a crescendo in Munich. It is a moment of fundamental choice: Either Europe heeds the warnings or it prepares to be buffeted by the whims of Washington, Beijing or Moscow.  Strong words aren't enough True to form, multiple European leaders, including the UK Foreign Secretary David Lammy, issued rallying cries to bolster defence spending and military capabilities. But strong words alone will no longer cut it. There needs to be a realignment of priorities, with individual citizens made to wake up to the responsibility every person holds to defend their values and their respective countries. Drawing on Ukraine's devastating war of survival against Vladimir Putin's full-scale invasion, Mr Zelenskyy urged the UK and other European allies not just to increase investment in defence but to ensure their populations have the will to fight. \"Money is needed, of course,\" Mr Zelenskyy said, speaking in English. \"But money alone will not stop an enemy assault… It's not just about budgets. It's about people realising they need to defend their own home.\" 👉 Listen to Sky News Daily on your podcast app 👈 'Ukraine will never accept deals made behind our backs' The UK in particular has baulked in the past when other European leaders - most notably Emmanuel Macron of France - have lobbied for a European Union army, worrying that it would erode the collective deterrence provided by NATO. But Mr Zelenskyy addressed this concern, saying: \"This isn't about replacing the alliance. This is about making Europe's contribution to our partnership equal to America's.\" Read more:Do Russians believe Trump can stop war in Ukraine?Trump wants Russia back in G7 As for Russia's war in Ukraine, President Zelenskyy set out his red lines, which at times contrasted with Donald Trump's vision for peace talks that have dominated the airwaves. \"Ukraine will never accept deals made behind our backs without our involvement,\" he said. \"If we are left out of negotiations about our own future, then we all lose,\" adding that NATO membership for Ukraine was not off the table as far as he was concerned. 'What if Russia came for you?' He also warned again of a potential widening of the conflict. Citing Ukrainian intelligence, he said Russia was building a new force of up to 150,000 soldiers - roughly the same size as the entirety of the British army, navy and air force - that it would start deploying to Belarus, a close ally, under the pretence of training and exercises. \"Are these Russian forces in Belarus meant to attack Ukraine? Maybe. Or maybe not. Or maybe it's meant for you,\" he said, alluding to NATO allies Poland and the Baltic states.  Deeply uncomfortable times Mr Zelenskyy said he was intensely proud of how the Ukrainian people came together to stop Moscow from toppling Kyiv within the first few days of its war, before fighting to hold the line in battles that have been raging relentlessly ever since. He then asked the audience of European politicians, diplomats and military chiefs in Munich: \"If Russia came for you, could your army fight the same way?\" An uncomfortable question for deeply uncomfortable times."
    },
    {
        "title": "Craig and Lindsay Foreman: British couple detained in Iran are named - as family 'significantly concerned'",
        "description": "A British couple who have been detained in Iran have been named by their family as Craig and Lindsay Foreman.",
        "url": "https://news.sky.com/story/craig-and-lindsay-foreman-british-couple-detained-in-iran-are-named-as-family-significantly-concerned-13309761",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-lindsay-foreman-iran_6829326.jpg?20250215124800",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-15 12:44:00",
        "Headline": "Craig and Lindsay Foreman's family say they are \"deeply focused\" on ensuring the British nationals' safety after they were detained in Kerman, Iran. They described their detention as an \"unexpected turn of events\".",
        "Content": " A British couple who have been detained in Iran have been named by their family as Craig and Lindsay Foreman. The family said they are \"significantly concerned\" by the \"distressing situation\". According to Ms Foreman's social media, the couple were on a motorbiking trip across the globe to Australia as part of a positive psychology mission. On 30 December, she posted about how they were about to face \"one of the most challenging\" parts of their trip, Iran and Pakistan. The post reads: \"Despite the advice of friends, family, and the FCDO (which strongly advises against travel to Iran for British nationals), we've chosen to keep moving forward. \"Why? Because we believe that, no matter where you are in the world, most people are good, kind humans striving for a meaningful life. \"Yes, we're aware of the risks. But we also know the rewards of meeting incredible people, hearing their stories, and seeing the breathtaking landscapes of these regions could far outweigh the fear.\" In a statement, the couple's family expressed their concern and said they were engaging with the UK government. \"We would like to take this opportunity to address the distressing situation concerning Craig and Lindsay Foreman who are currently being detained in Kerman, Iran,\" they said. \"This unexpected turn of events has caused significant concern for our entire family, and we are deeply focused on ensuring their safety and well-being during this trying time. \"We are actively engaging with the British government and relevant authorities, working diligently to navigate the complexities of this matter. The family are united in our determination to secure their safe return. \"We truly appreciate the outpouring of support from friends, family, and the community, which has provided us with strength and encouragement as we face this ordeal.\" They added: \"Thank you for your understanding, compassion, and continued support.\" Read more from Sky News:Trump says he and Starmer will meet 'very soon'World number one gets three-month tennis ban for doping A Foreign Office spokesperson earlier said: \"We are providing consular assistance to two British nationals detained in Iran and are in contact with the local authorities.\" Iranian state media said on Wednesday that a man and woman were in custody in Iran's southeastern city of Kerman on security-related charges. The Foreign Office warns that people are at risk of \"arrest, detention and a death sentence\" if they travel to Iran. Iran has previously arrested and held British citizens for extended periods of time. Nazanin Zaghari-Ratcliffe and Anoosheh Ashoori, who are dual British-Iranian citizens, were released in March 2022 after years held captive in Iran."
    },
    {
        "title": "Day 27: What does Trump want from Germany's far right?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a> ",
        "url": "https://news.sky.com/story/day-27-what-does-trump-want-from-germanys-far-right-13309636",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250214053856",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-15 00:00:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈    As Donald Trump's vice president JD Vance launches a blistering attack on the European allies in a speech at the Munich Security Conference, US correspondents Mark Stone, Martha Kelner and James Matthews discuss why was he talking with the leader of Germany's far-right AfD party? And, what links President Trump, the mayor of New York City, and pop star Sabrina Carpenter? You can email James, Martha and Mark on trump100@sky.uk"
    },
    {
        "title": "Philadelphia Eagles parade: Two women shot during Super Bowl victory celebrations, police say",
        "description": "Two women have been shot during victory celebrations in Philadelphia for the city's Super Bowl champions.",
        "url": "https://news.sky.com/story/philadelphia-eagles-parade-two-women-shot-during-super-bowl-victory-celebrations-police-say-13309663",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-philadelphia-eagles_6829229.jpg?20250215075504",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-15 07:33:00",
        "Headline": "The victims, aged in their 20s, were injured near the parade route for the Super Bowl winners, who captured their second NFL title in eight seasons by beating Kansas City Chiefs.",
        "Content": "Two women have been shot during victory celebrations in Philadelphia for the city's Super Bowl champions. The incident happened just after 2.30pm on Friday as thousands of Philadelphia Eagles fans gathered to watch official speeches. It happened near the parade route for the Super Bowl winners, who captured their second NFL title in eight seasons last Sunday, dominating the two-time-defending champions Kansas City Chiefs 40-22 at the Superdome in New Orleans. Police said a 27-year-old woman was shot in her left leg and a 20-year-old woman was shot in her upper left thigh along Benjamin Franklin Parkway. Both were taken to a nearby hospital where their conditions were described as stable. Fans had gathered hours before the parade to grab the best vantage point in freezing conditions. Police deputy commissioner Frank Vanore said the two women were shot by a suspect wearing an Eagles shirt after an argument, according to local media. \n                  Trump says he and Starmer will meet 'very soon'\n                 \n                  Day 27: What does Trump want from Germany's far right?\n                 \n                  What does Musk have on Trump? Are we seeing repeat of 1930s appeasement? | Your questions answered\n                 The shooting occurred as team officials were carrying out speeches on the steps of the Philadelphia Museum of Art. The location was along the parade route, although the buses had passed by about an hour before the shooting. Police described the scene as \"outside the parade footprint\". Read more from Sky News:Jay-Z and Sean Combs rape lawsuit droppedKent manhunt after Valentine's Day incidentFears of wider European war persist Along the parade route, supporters could be seen hanging out of windows, on top of light poles and trees and standing on top of vehicles to see the players travelling on open-top buses. The win on Sunday avenged a title game loss to Kansas City two years ago. The investigation into the shooting is ongoing as officials reported that no crime scene was found and no weapon was recovered."
    },
    {
        "title": "Jay-Z and Sean Combs rape lawsuit dropped by accuser",
        "description": "A woman who accused Jay-Z and Sean \"Diddy\" Combs of raping her in 2000 when she was 13 has dismissed her civil lawsuit against the hip-hop moguls.",
        "url": "https://news.sky.com/story/jay-z-and-sean-combs-rape-lawsuit-dropped-by-accuser-13309632",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jay-z-sean-diddy-coombs_6829178.jpg?20250215010110",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-15 00:57:00",
        "Headline": "Jay-Z describes the allegations as \"frivolous, fictitious and appalling\", and describes the case being dropped as a \"victory\".",
        "Content": "A woman who accused Jay-Z and Sean \"Diddy\" Combs of raping her in 2000 when she was 13 has dismissed her civil lawsuit against the hip-hop moguls. A filing in federal court in Manhattan said the plaintiff, referred to as Jane Doe, voluntarily dismissed the case with prejudice, meaning she cannot bring it again. Tony Buzbee, a lawyer for the woman, declined to comment. Combs is currently in prison awaiting a scheduled 5 May criminal trial on racketeering and sex trafficking charges. Read more from Sky News:Grimes criticises MuskOne of UK's most wanted men jailed'City killer' asteroid could hit Earth He still faces dozens of other civil lawsuits by women and men, including many represented by Buzbee's firm, who accused him of sexual assault and other misconduct. Combs has pleaded not guilty in the criminal case and has maintained his innocence in all the cases. \n                  Jay-Z's lawyer warned by judge over 'inappropriate' actions as Sean Combs faces fresh lawsuit\n                 \n                  Jay-Z calls for rape case against him to be dismissed after accuser acknowledges inconsistencies\n                 \n                  Jay-Z calls for rape accuser's identity to be revealed or case dismissed\n                 The Doe lawsuit was the only one to name Jay-Z, whose real name is Shawn Carter, as a defendant, and he had denied the woman's claims. \"Today is a victory,\" Carter said in a statement posted online by his entertainment company Roc Nation. \"The frivolous, fictitious and appalling allegations have been dismissed. This civil suit was without merit and never going anywhere.\" Carter said the case also caused trauma for his wife Beyonce, and their children. In a joint statement, Combs' lawyers maintained that their client has never sexually assaulted or trafficked anyone. \"We will continue to fight these baseless claims and hold those responsible,\" the lawyers said. Doe accused Carter and Combs of raping her at an afterparty following the 2000 MTV Music Video Awards."
    },
    {
        "title": "Harvey Weinstein sues his brother Bob",
        "description": "Harvey Weinstein is suing his brother and other executives at their former film company, The Weinstein Company.",
        "url": "https://news.sky.com/story/harvey-weinstein-sues-his-brother-bob-13309721",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bob-weinstein-harvey-weinstein_6829298.jpg?20250215111939",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-15 11:12:00",
        "Headline": "Previously one of the most powerful men in Hollywood, Harvey Weinstein's fall from grace following the #MeToo movement left his personal and professional life in tatters. Now he's suing his younger brother Bob.",
        "Content": "Harvey Weinstein is suing his brother and other executives at their former film company, The Weinstein Company. The disgraced producer filed a lawsuit on Thursday, alleging his sibling Bob Weinstein, and others from the business duped him into guaranteeing a $45m loan in 2016, but diverted funds for their own personal use. The 72-year-old, who was once one of the most powerful men in Hollywood, is currently in jail at New York City's Rikers Island jail complex, while awaiting a retrial on sex crimes charges in the city. Weinstein's claims come as part of a long-running civil case involving a lender accusing him of defaulting on the loan. His lawyer, Imran Ansari, said in a statement: \"Harvey Weinstein was deceived by those closest to him and secured a $45m (£35.8m) dollar loan under the pretence of saving The Weinstein Company\". He went on: \"While Harvey personally guaranteed the loan, others within The Weinstein Company enriched themselves and strategically undermined him, leaving him 'holding the bag' of debt while 'lining their pockets' when the company was in crisis.\" Ansari alleges Bob Weinstein, 70, and others at The Weinstein Company were in on a plot to position Harvey Weinstein for a downfall in an attempt to seize control of the company, which went bankrupt in 2018 as the sexual misconduct scandal surrounding Harvey Weinstein exploded. \n                  Harvey Weinstein begs judge for earlier retrial: 'I want this to be over with'\n                 \n                  Harvey Weinstein rushed to hospital after 'alarming blood test'\n                 \n                  Harvey Weinstein has rare bone marrow cancer and is treated in prison\n                 In 2017, Weinstein became the most high-profile villain of the #MeToo Movement, after numerous women came forward accusing him of sexual assault. He has always maintained any sexual activity he was involved in was consensual. A lawyer for Bob Weinstein, Brian Kohn, said on Friday that \"Harvey's allegations are entirely without merit\". Former Weinstein Company chief operating officer David Glasser, now chief executive of 101 Studios, known for its production of hit Paramount series Yellowstone, is also named in Harvey Weinstein's lawsuit. He is yet to respond to requests for comment. AI International Holdings loaned the money to two affiliates of The Weinstein Company and Harvey Weinstein, and later sued when it said they defaulted. Weinstein alleges that his brother, Glasser and others duped him into guaranteeing the loan by saying the money would help the financially struggling company. Instead, his lawsuit says, they diverted millions of dollars from the company for improper purposes, leaving it short on cash and him liable for repaying the loan. \"As a direct result of these actions, the companies were drained of, at the very least, $12m (£9.5m) in cash that should have been allocated to repay the loan owed to AI International,\" the lawsuit says. \"This mismanagement left the companies unable to satisfy their financial obligations, resulting in insolvency and placing Weinstein at substantial personal financial risk as the guarantor of the loan.\" The lawsuit, filed in the state Supreme Court in Manhattan, says Weinstein was made to suffer \"severe and outrageous financial and reputational harm\". It also makes several allegations of financial misconduct against Bob Weinstein, Glasser and others. AI International Holdings sued Harvey Weinstein and the two affiliates of The Weinstein Company in late 2017. The lawsuit said they defaulted on the loan after AI International had ordered the entire balance to be paid immediately because Harvey Weinstein had been dismissed as co-chairman amid the sexual misconduct allegations. According to Harvey Weinstein, Bob Weinstein and Glasser settled their liability for the loan with AI International for about $15m (£12m) due to \"bad faith negotiations,\" leaving Harvey Weinstein responsible for the remaining $30m (£24m) plus interest. Harvey Weinstein's lawsuit is seeking to shield him from any financial liability for the loan, as well as punitive damages for alleged fraud and financial misconduct and his legal fees. Bob Weinstein recently asked the judge to reject subpoenas for documents and a deposition issued by Harvey Weinstein's lawyer. Harvey Weinstein was also co-founder of film and television production company Miramax, which produced films including the Oscar-winning Shakespeare In Love, Pulp Fiction, and The Crying Game. His successful career came to a swift end after charges were brought against him following multiple allegations in 2017. He is currently being retried on charges that he forcibly performed a sex act on a movie and TV production assistant in 2006 and raped an aspiring actor in 2013. Another charge filed in September alleges he carried out a sex act on a different woman at a Manhattan hotel in 2006. Weinstein - who has chronic myeloid leukaemia, diabetes and heart problems - has urged the judge to hear his retrial as soon as possible, insisting: \"I don't know how much longer I can hold on.\" Harvey Weinstein's 2020 conviction and 23-year prison sentence were overturned last year, when an appeals court found the trial judge unfairly allowed testimony against him based on allegations that weren't part of the case."
    },
    {
        "title": "US taxpayers spend $24,000 on Irish college's DEI film project",
        "description": "The US State Department spent $24,000 (&#163;19,000) to fund an Irish college's film project promoting diversity, equity and inclusion (DEI).",
        "url": "https://news.sky.com/story/us-taxpayers-spend-24000-on-irish-colleges-dei-film-project-13309628",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-state-department-washington_6829175.jpg?20250215000023",
        "type": "US",
        "Author": "Stephen Murphy",
        "Date Published": "2025-02-15 00:01:00",
        "Headline": "The Institute of Art, Design and Technology in Dun Laoghaire has confirmed to Sky News it received the money.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n The US State Department spent $24,000 (£19,000) to fund an Irish college's film project promoting diversity, equity and inclusion (DEI). Earlier this month the Trump administration described a separate grant of $70,000 (£56,000) for a \"DEI musical\" in Ireland as \"crap\" that US taxpayer money was \"wasted on\", as it continues to dismantle the United States Agency for International Development (USAID) agency. Now an examination of spending records shows that in October 2021 $24,000 (£19,000) of US taxpayer's money was given to the Institute of Art, Design and Technology (IADT) in Dun Laoghaire, Co Dublin, to \"nurture and encourage equality, inclusion and diversity in storytelling, by facilitating self-generated narratives from diverse community groups through the medium of film\". The college confirmed to Sky News that it had received the money, which along with Screen Skills Ireland funding, was used to create four short documentaries \"by four separate marginalised communities\". Read more:JD Vance takes aim at UK and EuropeBig questions as Trump puts security in doubt Those short films were then premiered at a film festival in Galway in July 2023. Project lead lecturer and filmmaker Vanessa Gildea said at the time: \"I believe passionately that the future of film and television must be based on diversity, inclusion and gender parity. \n                  'Once in a generation moment': Starmer vows to 'keep US and Europe together' amid Russia threat\n                 \n                  Day 27: What does Trump want from Germany's far right?\n                 \n                  White House criticised for 'disgusting' Instagram Valentine's Day post\n                 \"This belief is the reason we created this film project. \"We are all incredibly proud of these beautiful and moving films, and of each and every filmmaker.\" 👉 Follow Trump 100 on your podcast app 👈 One of the films, Falling, was described as \"a poetic film about a brave young Afghani woman who left her home in search of a better life\". Cultural Medium, directed by Britney Madondo, was \"a vibrant, lyrical snapshot into the Black and Irish experience through the lens of artist Yomi Attention\". What is Freedom? by director Mohadesa Shojaee was described as taking viewers on a journey of \"experiences in a new land where freedom is more than just a word\", while Sticks & Stones aimed to share \"experiences of discrimination and the power of language\".  The funding of $24,000 for the project was secured by IADT via the US Embassy in Dublin. Two weeks ago, White House press secretary Karoline Leavitt listed a series of \"insane priorities\" that USAID had funded, including $1.5m (£1.2m) for improving diversity, equity and inclusion (DEI) in Serbian workplaces, $47,000 (£37,000) for a \"transgender opera\" in Colombia and a $70,000 (£56,000) grant for the production of a \"DEI musical in Ireland\". \"I don't know about you, but as an American taxpayer I don't want my dollars going towards this crap and the American people don't either. \"And that's exactly what Elon Musk has been tasked by President Trump to do.\" The revelations sparked fury from conservative commentators in the US, although it appears the 2022 $70,000 (£56,000) grant, like the IADT funding, had been awarded by the Department of State rather than USAID. That money is understood to have funded an event in Dublin, but not a musical. Repeated attempts to contact the event organiser have not been successful. The White House has been approached for comment by Sky News."
    },
    {
        "title": "Motor Fuel Group-owner plots sale of stake in £7bn petrol retail empire",
        "description": "The private equity backer of Motor Fuel Group (MFG), one of Britain's biggest petrol forecourt empires, is exploring the sale of a stake in a deal that could value it at about &#163;7bn.",
        "url": "https://news.sky.com/story/motor-fuel-group-owner-plots-sale-of-stake-in-1637bn-petrol-retail-empire-13309818",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-petrol-fuel-pump_6829309.jpg?20250215121030",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-15 13:52:00",
        "Headline": "The UK's largest independent fuel retail network is preparing to welcome a new minority investor as CD&R plots a partial sell-off, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backer of Motor Fuel Group (MFG), one of Britain's biggest petrol forecourt empires, is exploring the sale of a stake in a deal that could value it at about £7bn. Sky News has learnt that Clayton Dubilier & Rice (CDR), which has built MFG from a mid-sized industry player over the course of more than a decade, is working with advisers to examine options for selling a large minority shareholding. City sources said this weekend that CD&R was expected to run a process during the coming months, with a deal anticipated later this year. A stake of roughly 25-30% is expected to change hands, although the final shape of any deal has yet to be determined. A so-called continuation vehicle common in private equity transactions is understood to have been ruled out by CD&R. MFG is now the largest independent forecourt operator in the UK, having grown from 360 sites at the point of CD&R's acquisition of the company. It trades under a number of brands, including Esso and Shell. \n                  Baby formula prices and branding leading to 'poor outcomes' for parents, watchdog says \n                 \n                  Money blog: Veganism in trouble - and the man who sold half a million steaks with a 12,000-year-old idea to fix it\n                 \n                  Thames Water launches appeal over bill limits\n                 Lazard, the investment bank, has been working with CD&R on the preparatory work for a minority sale. CD&R, which also owns Morrisons, united MFG's petrol forecourt businesses with that of the supermarket chain in a £2.5bn transaction which completed last year. MFG now comprises roughly 1,200 sites across Britain, with pro forma earnings before interest, tax, depreciation and amortisation (EBITDA) of about £700m expected in this financial year. A previous attempt by CD&R to sell the company in 2022 was derailed in part by Vladimir Putin's invasion of Ukraine and a deteriorating macroeconomic environment. It is now focused on its role in the energy transition, with hundreds of electric vehicle charging points installed across its network, and growing its high-margin foodservice offering. MFG has outlined plans to invest £400m in EV charging, and is now the second-largest Ultra Rapid player in the UK - which delivers 100 miles of range in 10 minutes - with close to 1,000 chargers. It aims to grow that figure to 3,000 by 2030. Insiders said that CD&R would retain a controlling stake in MFG after any stake sale, while Morrisons also holds a 20% interest in the company. Bankers believe that a minority sale this year would be followed a couple of years later with an initial public offering on the London stock market. CD&R invested in MFG in 2015, making its investment a long-term one by the standards of most private equity holding periods. The sale of a 25% stake at a £7bn enterprise valuation would deliver a meaningful amount of liquidity to the US-based buyout firm. CD&R and its investors have already been paid hundreds of millions of pounds in dividends from MFG, having seen its earnings grow 14-fold since the original purchase. Morrisons' rival, Asda, has undertaken a similar transaction, with EG Group acquiring the Leeds-based grocer's forecourt network. EG Group, which along with Asda is controlled by private equity firm TDR Capital, is now being prepared for a listing in the US. CD&R declined to comment on Saturday."
    },
    {
        "title": "'Once in a generation moment': Starmer vows to 'keep US and Europe together' amid Russia threat",
        "description": "The prime minister has spoken of a \"once in a generation moment\" for the UK, US and Europe to work together and warned against NATO \"divisions\" - as two senior American officials head to Saudi Arabia for peace talks between Russia and Ukraine.",
        "url": "https://news.sky.com/story/us-officials-heading-to-saudi-arabia-for-russia-ukraine-peace-talks-13310358",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-vladimir-putin-donald-trump_6827194.jpg?20250212231855",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-15 19:13:00",
        "Headline": "The prime minister warns against allowing \"divisions\" in the alliance between Europe and the US to distract from \"external enemies\" and the threat from Russia. His comments come among tensions at a security conference in Munich.",
        "Content": "The prime minister has spoken of a \"once in a generation moment\" for the UK, US and Europe to work together and warned against NATO \"divisions\" - as two senior American officials head to Saudi Arabia for peace talks between Russia and Ukraine. Sir Keir Starmer said the UK will \"work to ensure we keep the US and Europe together\" amid the threat faced from Russia. His comments came after the Ukrainian president cautioned: \"The old days are over when America supported Europe just because it always had.\" Earlier on Saturday, US officials confirmed Europe would not be involved in the upcoming peace talks between Russia and Ukraine. Analysis: Peace talks risk short-term win that rewards Putin Washington also sent a questionnaire to European capitals to ask what they could contribute to security guarantees for Kyiv. \"It's clear Europe must take on a greater role in NATO,\" said Sir Keir on Saturday night. \n                  US taxpayers spend $24,000 on Irish college's DEI film project\n                 \n                  Day 27: What does Trump want from Germany's far right?\n                 \n                  White House criticised for 'disgusting' Instagram Valentine's Day post\n                 \"We cannot allow any divisions in the alliance to distract from the external enemies we face.\"  The French president is thought to be convening crisis talks between European leaders and NATO, which the prime minister will attend. Sir Keir will then take messages from that meeting to Washington DC when he meets US President Donald Trump the week after, according to Downing Street sources. During a talk at a security conference in Munich, Poland's foreign minister Radosław Sikorski said he was \"very glad that President Macron has called our leaders to Paris\" to discuss \"in a very serious fashion\" the challenges posed by Mr Trump. Meanwhile, US national security adviser Mike Waltz and special envoy Steve Witkoff are thought to be going to Saudi Arabia for peace talks between Ukraine and Russia, according to two sources familiar with the matter who spoke to Sky News' US partner network NBC News. On Wednesday, Mr Trump said there had been an agreement to begin negotiations about ending the war in Ukraine, after holding phone calls with Russia's Vladimir Putin and Ukraine's Volodymyr Zelenskyy. The Ukrainian president alluded to the conversations at the Munich Security Conference on Saturday, suggesting Europe should be playing a role in the negotiations as well.  \"Ukraine will never accept deals made behind our backs without our involvement, and the same rule should apply to all of Europe,\" Mr Zelenskyy said. \"The old days are over when America supported Europe just because it always had.\" He told world leaders it is time for the creation of an \"armed forces of Europe\", adding his army was \"not enough\". Following his call with President Putin, Mr Trump posted on Truth Social saying: \"We both agreed, we want to stop the millions of deaths taking place in the War with Russia/Ukraine.\"  Mr Trump had told White House reporters he did not see any way \"that a country in Russia's position\" could allow Ukraine to join NATO and that it was unlikely Ukraine would get all of its occupied land back. It comes after Sir Keir told Mr Zelenskyy in recent days that Ukraine was still on an \"irreversible path\" to joining NATO. However, on Saturday, the US special envoy for Ukraine Keith Kellogg said peace talks could focus on territorial concessions from Russia and targeting Mr Putin's oil revenues. \"Russia is really a petrostate,\" he said as he suggested Western powers needed to do more to enforce sanctions on Russia. Mr Zelenskyy said the main issue in peace talks was to \"not allow everything to go according to Putin's plan\". Business and Trade Secretary Jonathan Reynolds and shadow foreign secretary Priti Patel will be discussing all the latest political stories in the UK and around the world on the Trevor Phillips On Sunday show from 8.30am."
    },
    {
        "title": "Laura Whitmore shares final message from Caroline Flack on anniversary of her death",
        "description": "Laura Whitmore has shared the last text messages between her and Caroline Flack on the five-year anniversary of her death.",
        "url": "https://news.sky.com/story/laura-whitmore-shares-final-message-from-caroline-flack-on-anniversary-of-her-death-13309979",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-flack-caroline_6518081.jpg?20240411161106",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-15 15:35:00",
        "Headline": "Caroline Flack took her own life on 15 February 2020, aged 40, after learning prosecutors were going to press ahead with an assault charge over an incident involving her boyfriend, Lewis Burton.",
        "Content": "Laura Whitmore has shared the last text messages between her and Caroline Flack on the five-year anniversary of her death. Flack, who was best known for presenting ITV's Love Island, took her own life on 15 February 2020, aged 40. The Irish TV presenter shared a photo of the pair together, along with a series of screenshots of their WhatsApp conversation, in which she told Flack she had been offered the Love Island presenting role.   In the messages, Flack said it was \"perfect\" that Whitmore would be doing the show alongside her husband Iain Stirling, who narrates the series, and followed up the message with a series of love hearts. Flack hosted the reality dating show between 2015 and 2019. Whitmore took over in 2020. Maya Jama stepped into the role in 2023. In her Instagram post, Whitmore, 39, said: \"I got a new phone this month and as I was trying to download WhatsApp messages from my cloud loads of old messages came up. \"Ones I thought I lost a few years ago and no longer had. It really hit me hard. \"Looking at messages I've never publicly shared as they were private messages. Media outlets wrote a lot far from the actual truth. \"I think they show a side to Caroline which is nice to remember. Hence I'm sharing now.\" Read more:Harvey Weinstein sues his brother BobWhere to watch all the award season movies Whitmore said she had met Flack when she took over hosting duties for I'm A Celebrity... Get Me Out Of Here! NOW!. \"She was as supportive of me doing that role back then as she was when she supported me doing Love Island in 2020,\" she said. \"Both were great shows with hundreds of people working on them and relying on the show going ahead. \"I will always be so thankful of the last messages between me and Caroline.\" She continued: \"Every time I've been asked to speak about the situation or be part of a documentary I decline. \"I've already said all I can say on the tragedy and don't want words to be misconstrued and need to look after my own mental health. \"This was the last correspondence I ever had with her.\" \"The last message from her to me were love hearts,\" she said. \"I'd like to think wherever she is now, she's at peace and somewhere lovely like I hoped. \"I'm sad when I see the press and social media be so divisive and that we still haven't learned from Caroline's treatment before her death when it comes to women in the spotlight. \"Today I choose to remember these messages and thank the cloud for giving them back to me.\" Flack's family previously released an unpublished Instagram post she had written describing the stress of her arrest for common assault, while her former boyfriend Danny Cipriani also shared their final messages. A friend also shared her \"final photo\" taken just hours before her death. After Flack's death a coroner ruled she took her own life after learning prosecutors were going to press ahead with an assault charge over an incident involving her boyfriend, Lewis Burton. Born in Enfield, Flack got her first TV break playing Bubbles on comedy sketch show Bo Selecta alongside Leigh Francis, before fronting the International Pepsi Chart Show and moving on to Channel 4's E4 Music. She later hosted Big Brother's Little Brother, I'm A Celebrity... Get Me Out Of Here and X Factor, going on to win Strictly Come Dancing in 2014. An upcoming Disney+ documentary follows Flack's mother as she tries to understand events in the final months of her daughter's life, while also celebrating her career. Christine Flack unveiled a suicide prevention bench in north London last September in honour of her daughter. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK"
    },
    {
        "title": "AI criticised in film industry but cloned voices could become as common as stunt doubles, says technology expert",
        "description": "For Hollywood A-listers, having a cloned voice double could become as common as having a stunt double, an AI expert has told Sky News.",
        "url": "https://news.sky.com/story/ai-criticised-in-film-industry-but-cloned-voices-could-become-as-common-as-stunt-doubles-says-technology-expert-13309356",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-hollywood-sign-los-angeles_6828816.jpg?20250215063317",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-02-15 00:01:00",
        "Headline": "The Brutalist, Emilia Perez, A Complete Unknown and Dune: Part Two have all been drawn into the AI debate after using the technology.",
        "Content": "\n          Arts and entertainment correspondent\n        For Hollywood A-listers, having a cloned voice double could become as common as having a stunt double, an AI expert has told Sky News. While both the BAFTAs and Oscars annually celebrate craftsmanship and creativity, off-screen this award season a battle for votes has played out with some industry voices critical of the seemingly secretive way in which the technology is being deployed. Brady Corbet, the director of 10-time Oscar nominee The Brutalist, has found himself having to clarify to Deadline how actors Adrien Brody and Felicity Jones \"worked for months\" with a dialect coach \"to perfect their accents\" - but that artificial intelligence was also used in post-production to ensure a cleaner edit of some of their Hungarian vowel sounds. Emilia Perez, A Complete Unknown and Dune: Part Two have also been drawn into the debate for using AI in some way. While on the other side of the debate, Hugh Grant's horror Heretic provocatively declared on its end credits: \"No generative AI was used in the making of this film.\" 'Horrendous' dubbing may be a thing of the past Ausrine Skarnulyte, the chief executive of an AI company called Voice-Swap, said the film industry needed to understand \"the genie is out of the bottle\". \"We're seeing increased adoption across the film and TV industry even though at the moment no one's really talking about it, at least not as loudly as they would like to admit.\" \"Voice doubles is essentially where the technology is going,\" she insisted. Not only would allowing their voice to be officially cloned for a project potentially save actors time, but crucially it could save studios money. Skarnulyte said: \"Any sound engineer with access to official AI voice models can then do post-production edits when the actor is not in the studio, without needing them to come back and re-record lines.\" According to Skarnulyte, who is originally from Lithuania, another benefit is how it transforms dubbing a film into a different language. \"I grew up watching Steven Spielberg, Jean-Claude Van Damme and Arnold Schwarzenegger 80s action movies, and the narration itself... the dubbing was horrendous. \"With this technology, we could build Antonio Banderas' voice to speak in any language... it serves so that you could mimic someone's natural voice pretty easily.\" Sky correspondent's AI voice experience How quickly can it be done? In less than a day, using a 45-minute recording of my speech, the team at Voice-Swap were able to create a basic AI version of me. It is an unsettling experience to hear myself suddenly fluent in Lithuanian. The timbre and tone of what they demo sounds just like me and even has, I'm told, a slight British lilt to keep things authentic. Mastering even the basics of a language for an actor, like this, would take months - this has required zero learning on my part. While some may assume it instantly puts out of work those who've made careers out of redubbing stars for different territories, that actually isn't the case. Skarnulyte explained that she used recordings of herself speaking Lithuanian and then voice-to-voice AI conversion, effectively grafting my voice onto hers. Establishing the boundaries, she said, is most important. \"You need to make sure that it's used within the professional setting, that there is clear attribution in place, that there is transparent data set.\"  Opposition to growing AI influence But not everyone is convinced that the pros outweigh the cons. Actor John Magaro, who stars in the Munich Olympics thriller September 5, said the creeping influence of AI is \"a frightening thing\". He told Sky News earlier this year: \"I wouldn't encourage anyone to become an actor nowadays. It's daunting, I don't know where it's heading.\" According to industry publication Variety, declaring what AI is in your film will be mandatory at next year's Oscars. \"There's talk of putting in a requirement that you have to disclose your use of AI, which is not a bad idea,\" deputy awards and features editor Jenelle Riley told Sky News. She added: \"We disclose everything: no animals were harmed on set, we list all of the artists who worked on a movie…as long as everyone is transparent and it's ok with the actors and everyone involved then AI can be a really useful tool.\" Read more from Sky News:Bridget Jones is back - but is she still relevant?  From visual effects to script analysis, AI is already being used within the industry. While that might be scary for some, those who are working with AI argue it needs to be seen as a collaborator, not a competitor, in the creative process. As Skarnulyte explained: \"This is where we need to define the relationship between the tech and the creative industries. \"AI is already here and now it's just a matter of time - we either take it into our hands and we control it, or it will control us.\""
    },
    {
        "title": "Harvey Weinstein sues his brother Bob",
        "description": "Harvey Weinstein is suing his brother and other executives at their former film company, The Weinstein Company.",
        "url": "https://news.sky.com/story/harvey-weinstein-sues-his-brother-bob-13309721",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-bob-weinstein-harvey-weinstein_6829298.jpg?20250215111939",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-15 11:12:00",
        "Headline": "Previously one of the most powerful men in Hollywood, Harvey Weinstein's fall from grace following the #MeToo movement left his personal and professional life in tatters. Now he's suing his younger brother Bob.",
        "Content": "Harvey Weinstein is suing his brother and other executives at their former film company, The Weinstein Company. The disgraced producer filed a lawsuit on Thursday, alleging his sibling Bob Weinstein, and others from the business duped him into guaranteeing a $45m loan in 2016, but diverted funds for their own personal use. The 72-year-old, who was once one of the most powerful men in Hollywood, is currently in jail at New York City's Rikers Island jail complex, while awaiting a retrial on sex crimes charges in the city. Weinstein's claims come as part of a long-running civil case involving a lender accusing him of defaulting on the loan. His lawyer, Imran Ansari, said in a statement: \"Harvey Weinstein was deceived by those closest to him and secured a $45m (£35.8m) dollar loan under the pretence of saving The Weinstein Company\". He went on: \"While Harvey personally guaranteed the loan, others within The Weinstein Company enriched themselves and strategically undermined him, leaving him 'holding the bag' of debt while 'lining their pockets' when the company was in crisis.\" Ansari alleges Bob Weinstein, 70, and others at The Weinstein Company were in on a plot to position Harvey Weinstein for a downfall in an attempt to seize control of the company, which went bankrupt in 2018 as the sexual misconduct scandal surrounding Harvey Weinstein exploded. \n                  Harvey Weinstein begs judge for earlier retrial: 'I want this to be over with'\n                 \n                  Harvey Weinstein rushed to hospital after 'alarming blood test'\n                 \n                  Harvey Weinstein has rare bone marrow cancer and is treated in prison\n                 In 2017, Weinstein became the most high-profile villain of the #MeToo Movement, after numerous women came forward accusing him of sexual assault. He has always maintained any sexual activity he was involved in was consensual. A lawyer for Bob Weinstein, Brian Kohn, said on Friday that \"Harvey's allegations are entirely without merit\". Former Weinstein Company chief operating officer David Glasser, now chief executive of 101 Studios, known for its production of hit Paramount series Yellowstone, is also named in Harvey Weinstein's lawsuit. He is yet to respond to requests for comment. AI International Holdings loaned the money to two affiliates of The Weinstein Company and Harvey Weinstein, and later sued when it said they defaulted. Weinstein alleges that his brother, Glasser and others duped him into guaranteeing the loan by saying the money would help the financially struggling company. Instead, his lawsuit says, they diverted millions of dollars from the company for improper purposes, leaving it short on cash and him liable for repaying the loan. \"As a direct result of these actions, the companies were drained of, at the very least, $12m (£9.5m) in cash that should have been allocated to repay the loan owed to AI International,\" the lawsuit says. \"This mismanagement left the companies unable to satisfy their financial obligations, resulting in insolvency and placing Weinstein at substantial personal financial risk as the guarantor of the loan.\" The lawsuit, filed in the state Supreme Court in Manhattan, says Weinstein was made to suffer \"severe and outrageous financial and reputational harm\". It also makes several allegations of financial misconduct against Bob Weinstein, Glasser and others. AI International Holdings sued Harvey Weinstein and the two affiliates of The Weinstein Company in late 2017. The lawsuit said they defaulted on the loan after AI International had ordered the entire balance to be paid immediately because Harvey Weinstein had been dismissed as co-chairman amid the sexual misconduct allegations. According to Harvey Weinstein, Bob Weinstein and Glasser settled their liability for the loan with AI International for about $15m (£12m) due to \"bad faith negotiations,\" leaving Harvey Weinstein responsible for the remaining $30m (£24m) plus interest. Harvey Weinstein's lawsuit is seeking to shield him from any financial liability for the loan, as well as punitive damages for alleged fraud and financial misconduct and his legal fees. Bob Weinstein recently asked the judge to reject subpoenas for documents and a deposition issued by Harvey Weinstein's lawyer. Harvey Weinstein was also co-founder of film and television production company Miramax, which produced films including the Oscar-winning Shakespeare In Love, Pulp Fiction, and The Crying Game. His successful career came to a swift end after charges were brought against him following multiple allegations in 2017. He is currently being retried on charges that he forcibly performed a sex act on a movie and TV production assistant in 2006 and raped an aspiring actor in 2013. Another charge filed in September alleges he carried out a sex act on a different woman at a Manhattan hotel in 2006. Weinstein - who has chronic myeloid leukaemia, diabetes and heart problems - has urged the judge to hear his retrial as soon as possible, insisting: \"I don't know how much longer I can hold on.\" Harvey Weinstein's 2020 conviction and 23-year prison sentence were overturned last year, when an appeals court found the trial judge unfairly allowed testimony against him based on allegations that weren't part of the case."
    },
    {
        "title": "Jay-Z and Sean Combs rape lawsuit dropped by accuser",
        "description": "A woman who accused Jay-Z and Sean \"Diddy\" Combs of raping her in 2000 when she was 13 has dismissed her civil lawsuit against the hip-hop moguls.",
        "url": "https://news.sky.com/story/jay-z-and-sean-combs-rape-lawsuit-dropped-by-accuser-13309632",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-jay-z-sean-diddy-coombs_6829178.jpg?20250215010110",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-15 00:57:00",
        "Headline": "Jay-Z describes the allegations as \"frivolous, fictitious and appalling\", and describes the case being dropped as a \"victory\".",
        "Content": "A woman who accused Jay-Z and Sean \"Diddy\" Combs of raping her in 2000 when she was 13 has dismissed her civil lawsuit against the hip-hop moguls. A filing in federal court in Manhattan said the plaintiff, referred to as Jane Doe, voluntarily dismissed the case with prejudice, meaning she cannot bring it again. Tony Buzbee, a lawyer for the woman, declined to comment. Combs is currently in prison awaiting a scheduled 5 May criminal trial on racketeering and sex trafficking charges. Read more from Sky News:Grimes criticises MuskOne of UK's most wanted men jailed'City killer' asteroid could hit Earth He still faces dozens of other civil lawsuits by women and men, including many represented by Buzbee's firm, who accused him of sexual assault and other misconduct. Combs has pleaded not guilty in the criminal case and has maintained his innocence in all the cases. \n                  Jay-Z's lawyer warned by judge over 'inappropriate' actions as Sean Combs faces fresh lawsuit\n                 \n                  Jay-Z calls for rape case against him to be dismissed after accuser acknowledges inconsistencies\n                 \n                  Jay-Z calls for rape accuser's identity to be revealed or case dismissed\n                 The Doe lawsuit was the only one to name Jay-Z, whose real name is Shawn Carter, as a defendant, and he had denied the woman's claims. \"Today is a victory,\" Carter said in a statement posted online by his entertainment company Roc Nation. \"The frivolous, fictitious and appalling allegations have been dismissed. This civil suit was without merit and never going anywhere.\" Carter said the case also caused trauma for his wife Beyonce, and their children. In a joint statement, Combs' lawyers maintained that their client has never sexually assaulted or trafficked anyone. \"We will continue to fight these baseless claims and hold those responsible,\" the lawyers said. Doe accused Carter and Combs of raping her at an afterparty following the 2000 MTV Music Video Awards."
    }
]