[
    {
        "title": "'Large-scale response' deployed and 10 taken to hospital after 'horrifying' train stabbing",
        "description": "Two men have been arrested by armed officers after multiple people were stabbed on a train.",
        "url": "https://news.sky.com/story/armed-police-called-to-huntingdon-station-after-multiple-people-stabbed-on-train-13462246",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-police_7069258.jpg?20251101221111",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 20:39:00",
        "Headline": "Armed police arrested two men after being called to the incident at around 7.40pm on Saturday at Huntingdon station in Cambridgeshire.",
        "Content": " Two men have been arrested by armed officers after multiple people were stabbed on a train. The train was stopped at Huntingdon station, in Cambridgeshire, after police were called at around 7.40pm on Saturday. British Transport Police said 10 people have been taken to hospital, while Cambridgeshire Police said a \"large-scale response\" was deployed by the East of England Ambulance Service. Video shared online which appears to have been filmed from a railway bridge shows a huge police response with armed officers running along the platform towards the train carriages.  Witnesses told Sky News the stabbings started around 10 minutes after the 6.25pm train from Doncaster to London King's Cross left Peterborough and passengers sounded the emergency alarm. One man who was on the train told Sky News he saw someone coming through his carriage saying: \"They've got a knife, I've been stabbed.\" \"They were making their way through the carriage to get away from the suspects. They were extremely bloodied,\" said the man who gave his name as Gavin. He said by the time the train pulled up \"they were basically on the floor\".  \"That person ended up collapsing on the floor. They were taken to an ambulance pretty much straight away,\" he said. Gavin said passengers were ushered out into the station and \"there were multiple people who had been stabbed making their way down\". But he said one of the suspects had also come off the train and was \"running rampant as well\", and was \"waving a large knife\" before he was taken down by armed officers with a taser. London North Eastern Railway, which operates East Coast Mainline services in the UK, said all lines are blocked around Huntingdon station, with major disruption expected until the end of the day. Police said the A1307 has been closed on the approach to the town centre and the incident remains ongoing. Cambridgeshire Police said in a statement: \"We were called at 7.39pm with reports that multiple people had been stabbed on a train. \"Armed officers attended and the train was stopped at Huntingdon, where two men were arrested. \"The incident remains ongoing and the A1307 has been closed as you approach the town centre.\" Huntingdon MP Ben Obese-Jecty said in a post on X he was \"aware of the incident\" and \"trying to establish further information\". \"My thoughts are with the victims and those involved,\" he wrote. Prime Minister Sir Keir Starmer said the \"appalling incident\" was \"deeply concerning\". \"My thoughts are with all those affected, and my thanks go to the emergency services for their response,\" he wrote on X. \"Anyone in the area should follow the advice of the police.\" The Home Secretary said she was \"deeply saddened\" by the incident in Huntingdon and urged the public to \"avoid comment and speculation at this early stage\". In a statement on X, Shabana Mahmood said: \"Two suspects have been immediately arrested and taken into custody. \"I am receiving regular updates on the investigation.\" Speaking to Sky News at the scene, Mr Obese-Jecty said: \"When I first arrived here, I've simply never seen as big a response to an emergency incident as there were in terms of police, fire and ambulance.\" Shadow home secretary Chris Philp said on X: \"Horrific scenes in Huntingdon, in what seems to be a brutal mass attack by two perpetrators. \"My thoughts are with all those injured or affected and the emergency services responding. The police and government should provide an update on what happened and who has been arrested as soon as possible.\" Tory party chairman Kevin Hollinrake also described the scenes as \"horrifying\". \"My thoughts are with the victims and the emergency services responding to this incident,\" he wrote on X. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Andrew urged to 'be a man'  and tell police about his time with Epstein ",
        "description": "Andrew Mountbatten Windsor should \"be a man\" and tell police about the time he spent with Jeffrey Epstein, a lawyer representing some of his victims has said.",
        "url": "https://news.sky.com/story/car-spotted-leaving-royal-lodge-as-andrew-faces-growing-pressure-over-epstein-links-13461664",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-royal-lodge-windsor_7068504.png?20251101120626",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 11:43:00",
        "Headline": "A car was seen leaving Royal Lodge in Windsor as Andrew Mountbatten Windsor's move to Sandringham has been met with mixed views. ",
        "Content": "Andrew Mountbatten Windsor should \"be a man\" and tell police about the time he spent with Jeffrey Epstein, a lawyer representing some of his victims has said. Emails released on Friday in unsealed court documents show Andrew wrote to Epstein it would be \"good to catch up in person\" months after the paedophile financier was released from prison in 2009 for prostituting minors.  The pair were pictured together in New York's Central Park in December 2010, in a meeting Andrew later claimed was to end their friendship. In Congress, the House Oversight Committee is investigating the Epstein affair, and several of its members have invited Andrew to come and give evidence, presenting it as an opportunity to clear his name. American lawyer Spencer Kuvin, who has represented nine alleged victims of Jeffrey Epstein, told Sky News: \"Andrew should step forward, be a man, subject himself to authorities here in the US and questioning by the Congress to talk about his time with Jeffrey Epstein.\" He said he is hopeful more material will be released by the FBI, including videotapes and photographs seized from safes in Epstein's homes, adding Andrew will face questions if he features in any of them. \"He needs to make himself available to the authorities to be able to account for the time he was with Jeffrey Epstein,\" he said. \"We know Andrew was with Epstein at his island. We know Andrew was with Epstein at his home in Manhattan. \"So he should be talking to police about what he saw at the mansion and what he did there.\" Meanwhile, Virginia Giuffre's family have called for Andrew to be \"investigated\" over her claims that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Maxwell. Andrew has always denied the claims. Ms Giuffre sued in 2021 and the case was settled outside of court for a sum believed to have been around £12m. In an interview with Gareth Barlow on Sky News, Ms Giuffre's brother, Sky Roberts, praised the King for stripping his brother of his remaining titles and ousting him from Royal Lodge.  Andrew set for six-figure sum A Land Rover was spotted leaving Andrew's home Royal Lodge, in Windsor, on Saturday morning, after the Guardian reported he could be in line for a six-figure payout and an annual payment as part of his \"relocation settlement\" after being forced out of the mansion. One option includes an initial six-figure sum followed by an annual payment, which would be paid from the King's private funds, and is thought to be several times his £20k-a-year navy pension, sources told the newspaper. 👉 Listen to Sky News Daily on your podcast app 👈 He will move from Windsor to private accommodation in Sandringham, Norfolk. But on Saturday, people in Sandringham had mixed views about the move. One man told Sky News he would be unwelcome: \"This is a lovely, peaceful area. His reputation now is tarnished, and, I don't think it's right. \"This is where the royals come for Christmas... and come throughout the year. And, I don't think people local really want to see him here.\" But another man was more sympathetic: \"He hasn't been found guilty of anything in my view. So and people forget that he was a war hero in the Falklands. That's all gone now, isn't it? Nobody's thinking that he's done any good.\" Public supports Charles, poll shows A poll has revealed the public supports the King's decision to strip Andrew of his titles and remove him from Royal Lodge. Of the 4,739 people surveyed by YouGov, 79% said it was \"the right decision\" to \"strip Andrew Mountbatten Windsor (formerly Prince Andrew) of his prince title\". But when asked about the speed of King's response to the Andrew-Epstein revelations, 58% of respondents said the monarch moved \"too slowly\". Police provide update The Metropolitan Police has given Sky News an update on allegations that Andrew asked a royal close protection officer to \"dig up dirt\" on Virginia Giuffre in 2011. When reports first emerged two weeks ago, the force said it was \"actively looking into the claims\". On Saturday, the Met said: \"Following recent media reporting on the actions of officers in relation to this matter, we are considering whether any further assessment or review is necessary.\" Meanwhile, the police watchdog, the Independent Office for Police Conduct (IOPC), issued a statement regarding allegations that Andrew's royal close protection officers had obstructed lawyers serving a lawsuit from Virginia Giuffre in 2021. The IOPC said: \"We have not received any referrals in relation to this matter at this time.\" Read more from Sky News:Why Andrew is still in line to the throneThe Sandringham homes he could move to Graham Smith, from the anti-monarchy group Republic, told Sky News: \"The problem that the royals have is that there's going to be more information coming out, more scandals, more accusations and more emails. \"The idea that essentially... he's [Andrew] told to live in a very large house, given a half million pound stipend, and told to use his own name, is any kind of punishment, is absurd in most people's eyes.\" In the next few days, the King is expected to submit the royal warrant, affecting the dukedom, and letters patent, which will formally remove Andrew's entitlement to use the title prince and HRH style."
    },
    {
        "title": "Tense days ahead as tens of thousands line streets for anniversary of Novi Sad tragedy",
        "description": "The organisers said they didn&#8217;t want people to bring banners or whistles, and there were no political speeches. Today was about commemoration, not protest.",
        "url": "https://news.sky.com/story/tense-days-ahead-as-tens-of-thousands-line-streets-for-anniversary-of-novi-sad-tragedy-13462068",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-novi-sad-serbia_7068995.jpg?20251101175657",
        "type": "Home",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-11-01 17:51:00",
        "Headline": "Vast crowds gathered in commemoration a year after a canopy collapsed outside a train station and killed 16 people in Serbia. ",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n  The organisers said they didn’t want people to bring banners or whistles, and there were no political speeches. Today was about commemoration, not protest. However, the image of tens of thousands lining the city's avenues was a statement in itself. People had been travelling to Novi Sad for days. The train line from Belgrade was shut because of a reported bomb scare and some roads had been closed, but the crowds slowly making their way to the centre of the city were vast and all ages. It was sombre and quiet. I saw doctors and medical staff in uncontrollable tears as they laid wreaths to the 16 dead. The train station, supposed to be a symbol of Serbian modernity and big infrastructure, has become a symbol of corruption and cost-cutting for many. Today it is empty, the exposed concrete beams a reminder of what happened 12 months ago and motivation for a protest movement that has grown over the year and is demanding change. \n                  Ukrainian troops 'start surrendering' in key city but Kyiv says situation 'dynamic'\n                 \n                  'Shell shock' and an emotional reunion in 'ground zero' for Hurricane Melissa\n                 \n                  Satellite images show US military edging closer to Venezuela - as Trump's intentions questioned\n                  The police and state security, feared by many here, were nowhere to be seen today. As I put my earpiece in, preparing to go live on Sky News, one person mistook me for police. \"You're not welcome here today,\" I was told, before he realised his mistake. Read more from Sky News:Emotional reunion in Hurricane Melissa 'ground zero'Woman, 38, charged over Louvre jewellery heist Instead Serbian war veterans, now a part of the protest group, were the visible presence and a sign of how the movement has spread through generations. They protected the families of the victims as they laid flowers outside the building where their loved ones died. Serbia's President had declared 24 hours of national mourning on Friday evening - it probably helped lower tensions but will have done little to reduce the anger. The day passed without violence, as was hoped, but there is little doubt that tense days lie ahead. The Serbian government is under pressure but so far unmovable. This has become a battle for the future of the country. The protest movement believes it has momentum, and they seem absolutely determined to carry on."
    },
    {
        "title": "What do people in Sandringham think of Andrew Mountbatten Windsor moving there?",
        "description": "Sandringham is synonymous with Christmas.",
        "url": "https://news.sky.com/story/what-do-people-in-sandringham-think-of-andrew-mountbatten-windsor-moving-there-13462250",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-andrew-easter-sunday_6891672.jpg?20251101205905",
        "type": "Home",
        "Author": "Oliver Whitfield-Miocic, Sky correspondent",
        "Date Published": "2025-11-01 20:40:00",
        "Headline": "Some nearby residents, who are normally proud of their area's royal connections, aren't too thrilled about the prospect of Andrew moving there - but not everyone thinks he should be so publicly shunned.",
        "Content": "By Oliver Whitfield-Miocic, Sky correspondent   Sandringham is synonymous with Christmas. It's where the Royal Family put on a united front every year as they walk to St Mary Magdalene Church for the morning prayer service in Norfolk. Yet the huge estate, which is privately owned by the King, could soon also be known as the place where the monarch maroons his younger brother Andrew Mountbatten Windsor in a bid to quell public discontent. But nearby residents, who are normally proud of their area's royal connections, aren't too thrilled. One woman told Sky News: \"He's moving from a nice house to another nice house. I don't really understand why that's happening. I know he's had his titles taken away from him. I don't really think that's much of a punishment.\" Another said: \"He's just a disgrace to the family.\" The grounds of Sandringham are blanketed in a sea of yellow and deep orange at this time of year as the trees are stripped of their leaves. \n                  Andrew urged to 'be a man'  and tell police about his time with Epstein \n                 \n                  Newly released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release\n                 \n                  Public supports King's move to strip Andrew's titles, YouGov poll shows\n                 Not everyone thinks that Andrew, stripped of his royal titles, should be so publicly shunned. A man, who had been walking in a park, said: \"He hasn't been found guilty of anything, in my view. People forget that he was a war hero in the Falklands. That's all gone now, isn't it? Nobody's thinking that he's done any good.\" A runner, who had just finished a Parkrun, added: \"I think it is quite reasonable for him to move to Sandringham. And I think it's time the whole thing was resolved - it seems people are probably going to an unreasonable length about this.\" Read more:Andrew urged to 'be a man' and tell police about his time with EpsteinBrother of Virginia Giuffre praises King over Andrew decision  Andrew is not expected to move to Sandringham until 2026, avoiding potentially awkward headlines for the Royal Family. \"I think he has to go somewhere, but we'd prefer him not to be here, because obviously Sandringham's a lovely place and he's going to bring a bad rep to it,\" said a woman. The Palace will be hoping that's not the case and that Andrew will live a relatively quiet life away from the public when he finally does relocate. The neighbours mostly do too."
    },
    {
        "title": "'Shell shock' and an emotional reunion in 'ground zero' for Hurricane Melissa",
        "description": "In the town of Middle Quarters, close to where Hurricane Melissa made landfall, Vivienne Bennett is sitting propped up against a house without a roof. Her right hand is wrapped in a kitchen towel.",
        "url": "https://news.sky.com/story/we-have-no-food-no-water-it-feels-like-the-wilderness-the-communities-shredded-and-still-stranded-by-hurricane-melissa-13461594",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jamaica-hurricane-melissa_7068375.png?20251101071247",
        "type": "Home",
        "Author": "Martha Kelner",
        "Date Published": "2025-11-01 05:11:00",
        "Headline": "Sky News travels to areas where people have yet to see any government aid and lack even basic painkillers for injuries sustained in the hurricane. ",
        "Content": "\n          US correspondent\n              @marthakelner\n  In the town of Middle Quarters, close to where Hurricane Melissa made landfall, Vivienne Bennett is sitting propped up against a house without a roof. Her right hand is wrapped in a kitchen towel. \"I lost my finger in the hurricane,\" she says, showing me her finger which is exposed to the bone. \"I opened the door of my house to try and escape, and the wind slammed it back and cut my finger off.\" She asks me for painkillers and says she doesn't have any medication to stave off infection. I ask if she has seen any government aid. \"No,\" she replies, \"we haven't seen anybody yet, so we're trying to get some help. I need to get to a hospital but I don't know how because all the roads are blocked.\" Her daughter, Leila, has a baby and other children are playing nearby. \"We have no nappies, we have no food, we have no water,\" Leila says, \"it feels like the wilderness here now.\" The death toll in Jamaica after Hurricane Melissa could rise, with some communities still marooned from the rest of the island, according to the police chief for the worst-affected area. Coleridge Minto, superintendent of police for St Elizabeth Parish, told Sky News his area has recorded six deaths directly related to the hurricane. \"We are hoping there is no more,\" he said. \"The reality is we have not yet communicated with all our station commanders in some of the other areas and so as soon as we have those reports, we could be hearing of other injuries, other situations that we were not privy to at this moment.\" The UK has pledged £7.5m to assist the Caribbean's recovery from the hurricane. Aid flights have been arriving over the past couple of days into Jamaica's two international airports, but it's not getting to where they need it the most. The road to ground zero The road leading to Black River, the town authorities are referring to as \"ground zero\" for this disaster, is difficult to pass, but not impossible. A journey from the capital, Kingston, that would usually take two hours, now takes six. We drive through murky floodwater, a couple of feet deep, and through an avenue of twisted bamboo stalks. On arrival, it's a desperate scene. People here seem almost shell-shocked, still processing what has happened to them, unsure what to do next. One man walks past our cameraman and holds his hands in the air. \"Jamaica needs help,\" he says. \"It's been mashed up.\" I ask what help he needs. \"We need houses, food and water,\" he replies. Black River was once a wealthy town, the first in Jamaica to have electricity. But the storm has laid waste to the main street. The 300-year-old church, the seafront restaurant, the pharmacy, the Chinese supermarket, the whole town has been shredded. A group of people sit at a bus stop on the seafront surrounded by huge rocks washed up by a 16-foot storm surge. \"It's a disaster, a disaster,\" one woman calls out to me. With communications still down across most of the island, people here have been unable to contact friends and family for five days now. Read more:'Send help': The desperate pleas from hurricane survivorsBefore and after images show hurricane's destructionWhat we know from the ground following the devastation A woman called Inkiru Bernard, who is Jamaican but lives in New York, has been in touch with our team and asked us to try to find her 67-year-old mother, who lives in Black River. She's not heard from her since the storm. Daughter's emotional reunion When we arrive at the address she provides, her mother, Inez McRae, is sitting on the porch. She shows me around what remains of the house where she weathered the storm. The roof is entirely gone, everything is sodden and thick with mud. \"But I'm alive,\" she says, \"I've been spared.\" When Inkiru finally sees her mother on a video call, she cries with relief. \"Oh mummy,\" she says, \"I've been so worried.\"  Tanks have been positioned on the main street in Black River and soldiers patrol it after shops and businesses were looted. The police chief for this area, Coleridge Minto, says he understands the desperation but is urging people to be patient. \"We can appreciate that persons are trying to grab things,\" he says, \"persons are devastated, but we want to ensure that we maintain law.\" Army helicopters were flying over the disaster zone and some aid is now arriving into Black River. But with other villages still largely cut off from the rest of the island, this situation is growing more dire by the day."
    },
    {
        "title": "Man who died in helicopter crash near Doncaster named",
        "description": "The&#160;70-year-old man who died after a helicopter crash&#160;near Doncaster has been named as Peter Smith.&#160;",
        "url": "https://news.sky.com/story/man-who-died-in-helicopter-crash-near-doncaster-named-13461819",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-doncaster-helicopter-crash_7068706.jpg?20251101153201",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 15:26:00",
        "Headline": "Peter Smith suffered serious injuries when the helicopter crashed and was pronounced dead despite the best efforts of medical staff.",
        "Content": "The 70-year-old man who died after a helicopter crash near Doncaster has been named as Peter Smith.  His family described him as a \"beloved husband, father and grandfather\" who was \"one of the smartest men\". He suffered serious injuries when the helicopter crashed into a field on Thursday and was pronounced dead at the scene despite the best efforts of medical staff. The pilot, a 41-year-old man, and two other passengers, a 58-year-old woman and a 10-year-old boy, received minor injuries. The helicopter was a private flight which took off from Gamston Airport near Retford shortly before it crashed. In a statement, his family said: \"Peter was a beloved husband, father and grandfather and we are all devastated by this sudden loss. \"Peter was one of the smartest men who liked to spend his time making and fixing things. He had a real passion for aviation, and this was something he shared with his family.\" Read more:Activists who sprayed Stonehenge with orange powder cleared They praised his love for spending time with his grandchildren and said he loved to have meals out with his wife and had a particularly sweet tooth. \"We would like to ask for privacy during this incredibly difficult time to allow us to come to terms with what has occurred and grieve for the loss of Peter.\" Police are appealing for anyone with information to get in touch, including people who were in the area at the time and witnessed what happened. A parallel investigation has been launched between the Air Accidents Investigation Branch (AAIB)."
    },
    {
        "title": "Ukrainian troops 'start surrendering' in key city but Kyiv says situation 'dynamic'",
        "description": "Ukrainian soldiers encircled by Russian forces in the key eastern city of Pokrovsk have started surrendering, the defence ministry in Moscow claims.",
        "url": "https://news.sky.com/story/ukrainian-troops-start-surrendering-in-key-city-but-kyiv-says-situation-dynamic-13461786",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukrainian-troops-ukraine_7068681.jpg?20251101151821",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 14:51:00",
        "Headline": "The Ukrainian military has claimed its positions in some districts of Pokrovsk have improved despite the city being infiltrated by Russian troops.",
        "Content": "Ukrainian soldiers encircled by Russian forces in the key eastern city of Pokrovsk have started surrendering, the defence ministry in Moscow claims. But Ukraine's military has pushed back on the report by the TASS state news agency, saying the situation is \"difficult and dynamic\". Kyiv has also claimed its positions in some districts of Pokrovsk have improved despite its city being infiltrated by Russian troops. Latest: Russian attacks are 'nuclear terrorism', Ukraine warns Ukraine is increasing its number of assault troops in the area, the 7th Rapid Response Corps said on Facebook. And Ukrainian troops are also working to cut Moscow's military logistics routes, it added. The Russian defence ministry also said its forces defeated a team of Ukrainian special forces that headed to Pokrovsk in a bid to prevent Russian forces from advancing further into the city. \n                  Ukraine will work on ceasefire plan within next 10 days, Volodymyr Zelenskyy says\n                 \n                  Vladimir Putin tests new 'invincible' nuclear-powered missile\n                 \n                  Sanctions alone won't force Putin to end Ukraine war\n                 'Footage of Ukrainian troops after surrendering' It later posted videos of two Ukrainian troops who, it claimed, had surrendered. The footage showed the men, one dressed in fatigues and the other in a dark green jacket, sat against a wall in a dark room, as they spoke of fierce fighting and encirclement by Russian forces. The videos' authenticity could not be independently verified, and there was no immediate public comment from Kyiv on the Russian ministry's claims. Ukraine's President Volodymyr Zelenskyy has previously acknowledged that some Russian units had infiltrated the city. But he maintained that Ukraine is tackling them. He said Russia had deployed 170,000 troops in Ukraine's eastern Donetsk province, where Pokrovsk is located, in a major offensive to capture the city and claim a big battlefield victory.  'Operation to destroy enemy forces' Ukraine's army chief Oleksandr Syrskyi said on Saturday the situation in Pokrovsk remained \"hardest\" for Ukrainian forces, who were trying to push Russian troops out. But he insisted there was no encirclement or blockade as Moscow has claimed. \"A comprehensive operation to destroy and push out enemy forces from Pokrovsk is ongoing. The main burden lies on the shoulders of the units of the armed forces of Ukraine, particularly UAV operators and assault units,\" Mr Syrskyi said. Read more:Ukraine will work on ceasefire plan within next 10 days24 hours in the kill zone  Why is Pokrovsk important? One of Moscow's key aims has been to take all of Ukraine's industrial heartland of coal-rich Donbas, which comprises of the Luhansk and Donetsk provinces. Kyiv still controls about 10% of Donbas. Capturing Pokrovsk, which Russian media has dubbed \"the gateway to Donetsk\", and Kostiantynivka to its northeast, would give Moscow a platform to drive north towards the two biggest remaining Ukrainian-controlled cities in Donetsk - Kramatorsk and Sloviansk. 'Key Russian fuel pipeline struck' Meanwhile, Ukraine's military intelligence, known as HUR, has said its forces have hit an important fuel pipeline in the Moscow region that supplies the Russian army.  In a statement on Telegram, HUR said the operation late on Friday was a \"serious blow\" to Russia's military logistics. HUR said its forces struck the Koltsevoy pipeline, which is 250 miles long and supplies the Russian army with gasoline, diesel and jet fuel from refineries in Ryazan, Nizhny Novgorod and Moscow. The operation, which targeted infrastructure near Ramensky district, destroyed all three fuel lines, HUR said. The pipeline was capable of transporting up to three million tonnes of jet fuel, 2.8 million tonnes of diesel and 1.6 million tonnes of gasoline annually, HUR said. Russia 'targets gas production site' Also overnight, Russia launched an attack on a gas production site in Poltava, in central Ukraine. A fire broke out, the local administration said, but no injuries were reported. Kyiv condemns 'nuclear terrorism' Ukraine's foreign ministry has condemned Russian strikes this week on substations powering some of its nuclear plants. It accused Russia of carrying out \"targeted strikes on such substations\" which \"bear the hallmarks of nuclear terrorism\". Elsewhere, a civilian died and 15 more were injured on Saturday morning after Russia struck the Mykolaiv region in southern Ukraine with a ballistic Iskander missile, local official Vitaliy Kim said. A child was among those hurt in the strike, he added."
    },
    {
        "title": "Woman, 38, one of two charged in connection with Louvre jewellery heist",
        "description": "A 38-year-old woman has been charged in connection with the Louvre jewellery heist in Paris, according to local media. ",
        "url": "https://news.sky.com/story/woman-38-charged-in-connection-with-louvre-jewellery-heist-13461622",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-paris_7058733.jpg?20251022192846",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 07:59:00",
        "Headline": "She is among a number of people arrested over the £76m raid at the world-famous museum on 19 October. ",
        "Content": "A 38-year-old woman has been charged in connection with the Louvre jewellery heist in Paris, according to local media.  She is among a number of people who have been arrested over the raid, which was carried out while the world-famous museum was open to visitors on 19 October. The woman, who has not been named but lives in a northern suburb in Paris, has been charged with complicity in organised theft and criminal conspiracy with a view to committing a crime, according to media reports. A 37-year-old man was also charged in connection with the heist. Four thieves stole nine items - one of which was dropped and recovered at the scene - worth an estimated £76m in less than eight minutes. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift.  On Wednesday, a prosecutor said two suspects arrested over the jewellery heist had \"partially\" confessed to their involvement in the heist. They were handed preliminary charges of criminal conspiracy and theft committed by an organised gang, and remanded in custody. Later on the same day, five more people were arrested in coordinated raids in the French capital, but searches did not lead to the stolen jewellery. The woman appeared before a magistrate on Saturday. The heist exposed major gaps in the Louvre's security, with Paris police chief Patrice Faure telling politicians that ageing security systems had left weak spots. Read more:How the Louvre investigation is unfolding'Race against time' as police try to recover 'priceless' jewels'Matter of time' before thieves struck, expert says The thieves made away with a total of eight objects, including a sapphire diadem (a jewelled headband), necklace and single earring from a set linked to 19th-century queens Marie-Amelie and Hortense. They also took an emerald necklace and earrings tied to Empress Marie-Louise, Napoleon Bonaparte's second wife, as well as a reliquary brooch. Empress Eugenie's diamond diadem and her large corsage-bow brooch - an imperial ensemble of rare craftsmanship - were also stolen. One piece - Eugenie's emerald-set imperial crown with more than 1,300 diamonds - was later found damaged outside the museum."
    },
    {
        "title": "Canoeist and OnlyFans creator criticises two-year ban over 'explicit' Instagram video",
        "description": "Canoeist Kurts Adams Rozentals has criticised the decision by his governing body, Paddle UK, to ban him for two years, as the OnlyFans creator insisted an \"edgy\" video he posted on Instagram was not explicit.",
        "url": "https://news.sky.com/story/canoeist-and-onlyfans-creator-criticises-two-year-ban-over-explicit-instagram-video-13461765",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kurts-adams-canoe_6930743.jpg?20251101153811",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 14:30:00",
        "Headline": "Kurts Adams Rozentals started posting revealing content of himself on OnlyFans to raise money for his canoeing career. But a video, posted on Instagram, has caused trouble with Paddle UK, the national governing body.",
        "Content": "Canoeist Kurts Adams Rozentals has criticised the decision by his governing body, Paddle UK, to ban him for two years, as the OnlyFans creator insisted an \"edgy\" video he posted on Instagram was not explicit. He told Sky News: \"I think the outcome is very extreme. I'm only human. I make mistakes, but banning me for two years... I think it's pretty wild.\" Mr Rozentals started posting revealing content of himself on OnlyFans - a subscription-based service that is known for hosting adult content - to raise money for his canoeing career. During a previous Sky News interview in May, Mr Rozentals said he received £16,000 in funding from Paddle UK for his training, but this \"is not anywhere near enough to be able to pursue elite sport\". He added he made more than six figures on OnlyFans. In a statement on Friday, Paddle UK - the national governing body - said \"the athlete had intentionally misinformed the press that his suspension was related to his OnlyFans social media account\". It added that he had \"admitted posting an explicit video on their public Instagram profile which was subsequently removed given its explicit nature\". But Mr Rozentals insisted the video was not explicit, although it was \"edgy\". \"It didn't get removed by Instagram... it wasn't explicit. It wasn't anything that's not suitable for Instagram.\" \n                  Train stabbing: 10 in hospital - 9 with life-threatening injuries - as counter-terrorism police join investigation | Latest\n                 \n                  Moment armed police arrive at train stabbing in Huntingdon\n                 \n                  'Large-scale response' deployed and 10 taken to hospital after 'horrifying' train stabbing\n                 But he accepts his OnlyFans material clashes with the image he thinks Paddle UK wants athletes to portray. \"In regards to the social media content, of course it's not what they want their athletes to be ideally making... it's obviously edgy content. \"I understand that image that they [Paddle UK] want athletes to portray. And it does not align with [the] image that Paddle UK is trying to cultivate of professionalism and whatnot. \"But also that doesn't get views... that also doesn't get that doesn't drive attention... and that's not going to drive sponsorships.\" Paddle UK said the athlete had faced a disciplinary hearing which concluded \"breaches of the Athlete Code of Conduct and Performance Athlete Agreement amounted to gross misconduct\". The breaches were described as \"deliberate actions or omissions that bring Paddle UK's name into serious disrepute\", \"indecent, offensive or immoral behaviour\" and \"offensive use of social media\". Mr Rozentals was asked whether he would now have to choose between a career as a competitive canoeist or OnlyFans creator. \"That's tough because I grew up with no money. And I don't care about money for money's sake. \"However, now I'm blessed to be in a position where I can treat my mum, who sacrificed everything in her life to be able to give me the opportunities to chase this Olympic dream, and just being able to give back... that means more to me than getting a medal\". And he vowed to continue competing in the sport: \"One way or another, I'll make it to the Olympics.\" Paddle UK's statement added: \"Paddle UK is committed to ensuring a safe and open environment for all, and action under the Athlete Disciplinary Policy is taken where necessary and proportionate.\""
    },
    {
        "title": "Temperatures in UK expected to be warmer than usual next week",
        "description": "Temperatures early next week are expected to be above average in the UK for the time of year, forecasters have said.",
        "url": "https://news.sky.com/story/temperatures-in-uk-expected-to-be-warmer-than-usual-next-week-13461963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-greenwich-park-weather_7068929.jpg?20251101173245",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-01 17:13:00",
        "Headline": "The mercury could reach 17C in parts of the south on Monday, which would be almost as warm as Madrid, where 18C is predicted.",
        "Content": "Temperatures early next week are expected to be above average in the UK for the time of year, forecasters have said. Monday could reach 17C (62.6F) in parts of the south, most likely around the Welsh Marches, which would be almost as warm as Madrid, where 18C (64.4F) is predicted. The higher temperatures are expected to be accompanied by cloudy weather and \"fairly strong\" winds and rain coming in from the southwest, said the Met Office. See the weather forecast in your area Conditions are expected to stay mild for a few more days after that, before dropping back on Thursday. And looking further ahead, after a wet and windy first half of the month, weather patterns look like settling, with dry periods set to become more common, near average temperatures and a risk of overnight frost. Met Office meteorologist Gregory Dewhurst said: \"Come Monday, maximum temperatures will be between 14C and 15C, maybe even 17C, so a good few degrees above average.\" \n                  Train stabbing: 10 in hospital - 9 with life-threatening injuries - as counter-terrorism police join investigation | Latest\n                 \n                  Moment armed police arrive at train stabbing in Huntingdon\n                 \n                  'Large-scale response' deployed and 10 taken to hospital after 'horrifying' train stabbing\n                 Before then, the Met Office said it will become drier with clear periods on Saturday evening. However, blustery showers will continue in the far north and west. It said: \"More rain will feed eastwards into England and Wales overnight. Thunder is possible. Wet and windy weather arriving in the northwest later too.\" On Sunday, rain will clear from eastern England, leaving most areas with sunshine and scattered showers. It will be \"still breezy, and windy across northern and western Scotland where showers will be heavier and persistent\". The weather agency added: \"Monday looks generally cloudy and windy with rain at times, the heaviest in the west. \"Brighter weather, though with heavy showers on Tuesday. More rain arriving mid-week. Much milder overall.\" Read more from Sky News:Man who died in helicopter crash is namedTens of thousands line the streets for Novi Sad tragedyWhile some snow is expected on mountain tops this weekend, Mr Dewhurst added there is no risk of snow for the majority of the UK this month. He also said Hurricane Melissa, which came ashore in Jamaica as a category five hurricane last Tuesday and swept through the Caribbean, will have \"minimal\" influence on the UK."
    },
    {
        "title": "'Large-scale response' deployed and 10 taken to hospital after 'horrifying' train stabbing",
        "description": "Two men have been arrested by armed officers after multiple people were stabbed on a train.",
        "url": "https://news.sky.com/story/armed-police-called-to-huntingdon-station-after-multiple-people-stabbed-on-train-13462246",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-huntingdon-police_7069258.jpg?20251101221111",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-01 20:39:00",
        "Headline": "Armed police arrested two men after being called to the incident at around 7.40pm on Saturday at Huntingdon station in Cambridgeshire.",
        "Content": " Two men have been arrested by armed officers after multiple people were stabbed on a train. The train was stopped at Huntingdon station, in Cambridgeshire, after police were called at around 7.40pm on Saturday. British Transport Police said 10 people have been taken to hospital, while Cambridgeshire Police said a \"large-scale response\" was deployed by the East of England Ambulance Service. Video shared online which appears to have been filmed from a railway bridge shows a huge police response with armed officers running along the platform towards the train carriages.  Witnesses told Sky News the stabbings started around 10 minutes after the 6.25pm train from Doncaster to London King's Cross left Peterborough and passengers sounded the emergency alarm. One man who was on the train told Sky News he saw someone coming through his carriage saying: \"They've got a knife, I've been stabbed.\" \"They were making their way through the carriage to get away from the suspects. They were extremely bloodied,\" said the man who gave his name as Gavin. He said by the time the train pulled up \"they were basically on the floor\".  \"That person ended up collapsing on the floor. They were taken to an ambulance pretty much straight away,\" he said. Gavin said passengers were ushered out into the station and \"there were multiple people who had been stabbed making their way down\". But he said one of the suspects had also come off the train and was \"running rampant as well\", and was \"waving a large knife\" before he was taken down by armed officers with a taser. London North Eastern Railway, which operates East Coast Mainline services in the UK, said all lines are blocked around Huntingdon station, with major disruption expected until the end of the day. Police said the A1307 has been closed on the approach to the town centre and the incident remains ongoing. Cambridgeshire Police said in a statement: \"We were called at 7.39pm with reports that multiple people had been stabbed on a train. \"Armed officers attended and the train was stopped at Huntingdon, where two men were arrested. \"The incident remains ongoing and the A1307 has been closed as you approach the town centre.\" Huntingdon MP Ben Obese-Jecty said in a post on X he was \"aware of the incident\" and \"trying to establish further information\". \"My thoughts are with the victims and those involved,\" he wrote. Prime Minister Sir Keir Starmer said the \"appalling incident\" was \"deeply concerning\". \"My thoughts are with all those affected, and my thanks go to the emergency services for their response,\" he wrote on X. \"Anyone in the area should follow the advice of the police.\" The Home Secretary said she was \"deeply saddened\" by the incident in Huntingdon and urged the public to \"avoid comment and speculation at this early stage\". In a statement on X, Shabana Mahmood said: \"Two suspects have been immediately arrested and taken into custody. \"I am receiving regular updates on the investigation.\" Speaking to Sky News at the scene, Mr Obese-Jecty said: \"When I first arrived here, I've simply never seen as big a response to an emergency incident as there were in terms of police, fire and ambulance.\" Shadow home secretary Chris Philp said on X: \"Horrific scenes in Huntingdon, in what seems to be a brutal mass attack by two perpetrators. \"My thoughts are with all those injured or affected and the emergency services responding. The police and government should provide an update on what happened and who has been arrested as soon as possible.\" Tory party chairman Kevin Hollinrake also described the scenes as \"horrifying\". \"My thoughts are with the victims and the emergency services responding to this incident,\" he wrote on X. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the latest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Andrew urged to 'be a man'  and tell police about his time with Epstein ",
        "description": "Andrew Mountbatten Windsor should \"be a man\" and tell police about the time he spent with Jeffrey Epstein, a lawyer representing some of his victims has said.",
        "url": "https://news.sky.com/story/car-spotted-leaving-royal-lodge-as-andrew-faces-growing-pressure-over-epstein-links-13461664",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-royal-lodge-windsor_7068504.png?20251101120626",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-01 11:43:00",
        "Headline": "A car was seen leaving Royal Lodge in Windsor as Andrew Mountbatten Windsor's move to Sandringham has been met with mixed views. ",
        "Content": "Andrew Mountbatten Windsor should \"be a man\" and tell police about the time he spent with Jeffrey Epstein, a lawyer representing some of his victims has said. Emails released on Friday in unsealed court documents show Andrew wrote to Epstein it would be \"good to catch up in person\" months after the paedophile financier was released from prison in 2009 for prostituting minors.  The pair were pictured together in New York's Central Park in December 2010, in a meeting Andrew later claimed was to end their friendship. In Congress, the House Oversight Committee is investigating the Epstein affair, and several of its members have invited Andrew to come and give evidence, presenting it as an opportunity to clear his name. American lawyer Spencer Kuvin, who has represented nine alleged victims of Jeffrey Epstein, told Sky News: \"Andrew should step forward, be a man, subject himself to authorities here in the US and questioning by the Congress to talk about his time with Jeffrey Epstein.\" He said he is hopeful more material will be released by the FBI, including videotapes and photographs seized from safes in Epstein's homes, adding Andrew will face questions if he features in any of them. \"He needs to make himself available to the authorities to be able to account for the time he was with Jeffrey Epstein,\" he said. \"We know Andrew was with Epstein at his island. We know Andrew was with Epstein at his home in Manhattan. \"So he should be talking to police about what he saw at the mansion and what he did there.\" Meanwhile, Virginia Giuffre's family have called for Andrew to be \"investigated\" over her claims that - as a teenager - she had sex with Andrew on three occasions after being trafficked by Epstein and Maxwell. Andrew has always denied the claims. Ms Giuffre sued in 2021 and the case was settled outside of court for a sum believed to have been around £12m. In an interview with Gareth Barlow on Sky News, Ms Giuffre's brother, Sky Roberts, praised the King for stripping his brother of his remaining titles and ousting him from Royal Lodge.  Andrew set for six-figure sum A Land Rover was spotted leaving Andrew's home Royal Lodge, in Windsor, on Saturday morning, after the Guardian reported he could be in line for a six-figure payout and an annual payment as part of his \"relocation settlement\" after being forced out of the mansion. One option includes an initial six-figure sum followed by an annual payment, which would be paid from the King's private funds, and is thought to be several times his £20k-a-year navy pension, sources told the newspaper. 👉 Listen to Sky News Daily on your podcast app 👈 He will move from Windsor to private accommodation in Sandringham, Norfolk. But on Saturday, people in Sandringham had mixed views about the move. One man told Sky News he would be unwelcome: \"This is a lovely, peaceful area. His reputation now is tarnished, and, I don't think it's right. \"This is where the royals come for Christmas... and come throughout the year. And, I don't think people local really want to see him here.\" But another man was more sympathetic: \"He hasn't been found guilty of anything in my view. So and people forget that he was a war hero in the Falklands. That's all gone now, isn't it? Nobody's thinking that he's done any good.\" Public supports Charles, poll shows A poll has revealed the public supports the King's decision to strip Andrew of his titles and remove him from Royal Lodge. Of the 4,739 people surveyed by YouGov, 79% said it was \"the right decision\" to \"strip Andrew Mountbatten Windsor (formerly Prince Andrew) of his prince title\". But when asked about the speed of King's response to the Andrew-Epstein revelations, 58% of respondents said the monarch moved \"too slowly\". Police provide update The Metropolitan Police has given Sky News an update on allegations that Andrew asked a royal close protection officer to \"dig up dirt\" on Virginia Giuffre in 2011. When reports first emerged two weeks ago, the force said it was \"actively looking into the claims\". On Saturday, the Met said: \"Following recent media reporting on the actions of officers in relation to this matter, we are considering whether any further assessment or review is necessary.\" Meanwhile, the police watchdog, the Independent Office for Police Conduct (IOPC), issued a statement regarding allegations that Andrew's royal close protection officers had obstructed lawyers serving a lawsuit from Virginia Giuffre in 2021. The IOPC said: \"We have not received any referrals in relation to this matter at this time.\" Read more from Sky News:Why Andrew is still in line to the throneThe Sandringham homes he could move to Graham Smith, from the anti-monarchy group Republic, told Sky News: \"The problem that the royals have is that there's going to be more information coming out, more scandals, more accusations and more emails. \"The idea that essentially... he's [Andrew] told to live in a very large house, given a half million pound stipend, and told to use his own name, is any kind of punishment, is absurd in most people's eyes.\" In the next few days, the King is expected to submit the royal warrant, affecting the dukedom, and letters patent, which will formally remove Andrew's entitlement to use the title prince and HRH style."
    },
    {
        "title": "Man who died in helicopter crash near Doncaster named",
        "description": "The&#160;70-year-old man who died after a helicopter crash&#160;near Doncaster has been named as Peter Smith.&#160;",
        "url": "https://news.sky.com/story/man-who-died-in-helicopter-crash-near-doncaster-named-13461819",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-doncaster-helicopter-crash_7068706.jpg?20251101153201",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-01 15:26:00",
        "Headline": "Peter Smith suffered serious injuries when the helicopter crashed and was pronounced dead despite the best efforts of medical staff.",
        "Content": "The 70-year-old man who died after a helicopter crash near Doncaster has been named as Peter Smith.  His family described him as a \"beloved husband, father and grandfather\" who was \"one of the smartest men\". He suffered serious injuries when the helicopter crashed into a field on Thursday and was pronounced dead at the scene despite the best efforts of medical staff. The pilot, a 41-year-old man, and two other passengers, a 58-year-old woman and a 10-year-old boy, received minor injuries. The helicopter was a private flight which took off from Gamston Airport near Retford shortly before it crashed. In a statement, his family said: \"Peter was a beloved husband, father and grandfather and we are all devastated by this sudden loss. \"Peter was one of the smartest men who liked to spend his time making and fixing things. He had a real passion for aviation, and this was something he shared with his family.\" Read more:Activists who sprayed Stonehenge with orange powder cleared They praised his love for spending time with his grandchildren and said he loved to have meals out with his wife and had a particularly sweet tooth. \"We would like to ask for privacy during this incredibly difficult time to allow us to come to terms with what has occurred and grieve for the loss of Peter.\" Police are appealing for anyone with information to get in touch, including people who were in the area at the time and witnessed what happened. A parallel investigation has been launched between the Air Accidents Investigation Branch (AAIB)."
    },
    {
        "title": "Temperatures in UK expected to be warmer than usual next week",
        "description": "Temperatures early next week are expected to be above average in the UK for the time of year, forecasters have said.",
        "url": "https://news.sky.com/story/temperatures-in-uk-expected-to-be-warmer-than-usual-next-week-13461963",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-greenwich-park-weather_7068929.jpg?20251101173245",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-01 17:13:00",
        "Headline": "The mercury could reach 17C in parts of the south on Monday, which would be almost as warm as Madrid, where 18C is predicted.",
        "Content": "Temperatures early next week are expected to be above average in the UK for the time of year, forecasters have said. Monday could reach 17C (62.6F) in parts of the south, most likely around the Welsh Marches, which would be almost as warm as Madrid, where 18C (64.4F) is predicted. The higher temperatures are expected to be accompanied by cloudy weather and \"fairly strong\" winds and rain coming in from the southwest, said the Met Office. See the weather forecast in your area Conditions are expected to stay mild for a few more days after that, before dropping back on Thursday. And looking further ahead, after a wet and windy first half of the month, weather patterns look like settling, with dry periods set to become more common, near average temperatures and a risk of overnight frost. Met Office meteorologist Gregory Dewhurst said: \"Come Monday, maximum temperatures will be between 14C and 15C, maybe even 17C, so a good few degrees above average.\" \n                  Train stabbing: 10 in hospital - 9 with life-threatening injuries - as counter-terrorism police join investigation | Latest\n                 \n                  Moment armed police arrive at train stabbing in Huntingdon\n                 \n                  'Large-scale response' deployed and 10 taken to hospital after 'horrifying' train stabbing\n                 Before then, the Met Office said it will become drier with clear periods on Saturday evening. However, blustery showers will continue in the far north and west. It said: \"More rain will feed eastwards into England and Wales overnight. Thunder is possible. Wet and windy weather arriving in the northwest later too.\" On Sunday, rain will clear from eastern England, leaving most areas with sunshine and scattered showers. It will be \"still breezy, and windy across northern and western Scotland where showers will be heavier and persistent\". The weather agency added: \"Monday looks generally cloudy and windy with rain at times, the heaviest in the west. \"Brighter weather, though with heavy showers on Tuesday. More rain arriving mid-week. Much milder overall.\" Read more from Sky News:Man who died in helicopter crash is namedTens of thousands line the streets for Novi Sad tragedyWhile some snow is expected on mountain tops this weekend, Mr Dewhurst added there is no risk of snow for the majority of the UK this month. He also said Hurricane Melissa, which came ashore in Jamaica as a category five hurricane last Tuesday and swept through the Caribbean, will have \"minimal\" influence on the UK."
    },
    {
        "title": "What do people in Sandringham think of Andrew Mountbatten Windsor moving there?",
        "description": "Sandringham is synonymous with Christmas.",
        "url": "https://news.sky.com/story/what-do-people-in-sandringham-think-of-andrew-mountbatten-windsor-moving-there-13462250",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-andrew-easter-sunday_6891672.jpg?20251101205905",
        "type": "UK",
        "Author": "Oliver Whitfield-Miocic, Sky correspondent",
        "Date Published": "2025-11-01 20:40:00",
        "Headline": "Some nearby residents, who are normally proud of their area's royal connections, aren't too thrilled about the prospect of Andrew moving there - but not everyone thinks he should be so publicly shunned.",
        "Content": "By Oliver Whitfield-Miocic, Sky correspondent   Sandringham is synonymous with Christmas. It's where the Royal Family put on a united front every year as they walk to St Mary Magdalene Church for the morning prayer service in Norfolk. Yet the huge estate, which is privately owned by the King, could soon also be known as the place where the monarch maroons his younger brother Andrew Mountbatten Windsor in a bid to quell public discontent. But nearby residents, who are normally proud of their area's royal connections, aren't too thrilled. One woman told Sky News: \"He's moving from a nice house to another nice house. I don't really understand why that's happening. I know he's had his titles taken away from him. I don't really think that's much of a punishment.\" Another said: \"He's just a disgrace to the family.\" The grounds of Sandringham are blanketed in a sea of yellow and deep orange at this time of year as the trees are stripped of their leaves. \n                  Andrew urged to 'be a man'  and tell police about his time with Epstein \n                 \n                  Newly released emails show Andrew suggested 'catch-up' with Jeffrey Epstein after his prison release\n                 \n                  Public supports King's move to strip Andrew's titles, YouGov poll shows\n                 Not everyone thinks that Andrew, stripped of his royal titles, should be so publicly shunned. A man, who had been walking in a park, said: \"He hasn't been found guilty of anything, in my view. People forget that he was a war hero in the Falklands. That's all gone now, isn't it? Nobody's thinking that he's done any good.\" A runner, who had just finished a Parkrun, added: \"I think it is quite reasonable for him to move to Sandringham. And I think it's time the whole thing was resolved - it seems people are probably going to an unreasonable length about this.\" Read more:Andrew urged to 'be a man' and tell police about his time with EpsteinBrother of Virginia Giuffre praises King over Andrew decision  Andrew is not expected to move to Sandringham until 2026, avoiding potentially awkward headlines for the Royal Family. \"I think he has to go somewhere, but we'd prefer him not to be here, because obviously Sandringham's a lovely place and he's going to bring a bad rep to it,\" said a woman. The Palace will be hoping that's not the case and that Andrew will live a relatively quiet life away from the public when he finally does relocate. The neighbours mostly do too."
    },
    {
        "title": "Canoeist and OnlyFans creator criticises two-year ban over 'explicit' Instagram video",
        "description": "Canoeist Kurts Adams Rozentals has criticised the decision by his governing body, Paddle UK, to ban him for two years, as the OnlyFans creator insisted an \"edgy\" video he posted on Instagram was not explicit.",
        "url": "https://news.sky.com/story/canoeist-and-onlyfans-creator-criticises-two-year-ban-over-explicit-instagram-video-13461765",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kurts-adams-canoe_6930743.jpg?20251101153811",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-01 14:30:00",
        "Headline": "Kurts Adams Rozentals started posting revealing content of himself on OnlyFans to raise money for his canoeing career. But a video, posted on Instagram, has caused trouble with Paddle UK, the national governing body.",
        "Content": "Canoeist Kurts Adams Rozentals has criticised the decision by his governing body, Paddle UK, to ban him for two years, as the OnlyFans creator insisted an \"edgy\" video he posted on Instagram was not explicit. He told Sky News: \"I think the outcome is very extreme. I'm only human. I make mistakes, but banning me for two years... I think it's pretty wild.\" Mr Rozentals started posting revealing content of himself on OnlyFans - a subscription-based service that is known for hosting adult content - to raise money for his canoeing career. During a previous Sky News interview in May, Mr Rozentals said he received £16,000 in funding from Paddle UK for his training, but this \"is not anywhere near enough to be able to pursue elite sport\". He added he made more than six figures on OnlyFans. In a statement on Friday, Paddle UK - the national governing body - said \"the athlete had intentionally misinformed the press that his suspension was related to his OnlyFans social media account\". It added that he had \"admitted posting an explicit video on their public Instagram profile which was subsequently removed given its explicit nature\". But Mr Rozentals insisted the video was not explicit, although it was \"edgy\". \"It didn't get removed by Instagram... it wasn't explicit. It wasn't anything that's not suitable for Instagram.\" \n                  Train stabbing: 10 in hospital - 9 with life-threatening injuries - as counter-terrorism police join investigation | Latest\n                 \n                  Moment armed police arrive at train stabbing in Huntingdon\n                 \n                  'Large-scale response' deployed and 10 taken to hospital after 'horrifying' train stabbing\n                 But he accepts his OnlyFans material clashes with the image he thinks Paddle UK wants athletes to portray. \"In regards to the social media content, of course it's not what they want their athletes to be ideally making... it's obviously edgy content. \"I understand that image that they [Paddle UK] want athletes to portray. And it does not align with [the] image that Paddle UK is trying to cultivate of professionalism and whatnot. \"But also that doesn't get views... that also doesn't get that doesn't drive attention... and that's not going to drive sponsorships.\" Paddle UK said the athlete had faced a disciplinary hearing which concluded \"breaches of the Athlete Code of Conduct and Performance Athlete Agreement amounted to gross misconduct\". The breaches were described as \"deliberate actions or omissions that bring Paddle UK's name into serious disrepute\", \"indecent, offensive or immoral behaviour\" and \"offensive use of social media\". Mr Rozentals was asked whether he would now have to choose between a career as a competitive canoeist or OnlyFans creator. \"That's tough because I grew up with no money. And I don't care about money for money's sake. \"However, now I'm blessed to be in a position where I can treat my mum, who sacrificed everything in her life to be able to give me the opportunities to chase this Olympic dream, and just being able to give back... that means more to me than getting a medal\". And he vowed to continue competing in the sport: \"One way or another, I'll make it to the Olympics.\" Paddle UK's statement added: \"Paddle UK is committed to ensuring a safe and open environment for all, and action under the Athlete Disciplinary Policy is taken where necessary and proportionate.\""
    },
    {
        "title": "Reform councillor defects to Tories after becoming 'uncomfortable' with party",
        "description": "A Reform UK councillor has defected to the Tories after becoming \"uncomfortable\" with Nigel Farage's party.",
        "url": "https://news.sky.com/story/reform-councillor-defects-to-tories-after-becoming-uncomfortable-with-party-13461586",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reform-uk-rosette_7068411.jpg?20251101080911",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-01 01:27:00",
        "Headline": "James Buchan said he wanted to be able to \"look my family in the eye and say, 'that's not who I am'\" after his former party announced plans to scrap indefinite leave to remain.",
        "Content": "A Reform UK councillor has defected to the Tories after becoming \"uncomfortable\" with Nigel Farage's party. James Buchan said he wanted to be able to \"look my family in the eye and say, 'that's not who I am'\" after his former party announced plans to scrap indefinite leave to remain. The Dartford Borough councillor, who won his seat for Reform in a by-election in July, said the policy creates a \"huge amount of fear and anxiety\". He also accused the party of having \"a pretty unfortunate way of treating people\". Read more: What is indefinite leave to remain? In a statement, Mr Buchan said: \"I stood for election with the sole aim of working for my community and getting things done for local families. \"Having had the opportunity to see Reform from the inside, I've concluded that the party doesn't really have the experience or ambition to do that.\" He said \"relying on rhetoric and slogans isn't going to help real families in communities\" like his and \"the more I saw of Reform UK, the more uncomfortable I felt to be part of it\". \"Things like a proposal to remove indefinite leave to remain from all non-EU residents who are working here perfectly legally is an example that could be devastating for decent people who have built a life here and contribute to our country,\" he added. Read more from Sky News:Andrew suggested 'catch-up' with Epstein after prison releaseA 'cultural workout' could be the key to better health Earlier this year Reform announced it would axe indefinite leave to remain and replace it with new visas that would require migrants to reapply to live in the UK as part of plans to tighten immigration. Conservative council leader Jeremy Kite welcomed Mr Buchan, who represents the Stone House ward, to the party. \"James knows that getting elected isn't about power, it's about service and being supportive of people,\" he said. A Reform source told the PA news agency: \"He got elected in July 2025 as a Reform councillor. He should resign his seat but he won't because he knows he will lose under the Tory banner. \"We look forward to winning this seat back as soon as possible.\""
    },
    {
        "title": "Forget the gym - a 'cultural workout' could be the key to better health",
        "description": "Culture lovers have long believed in the healing power art. Now, science has caught up, with new research showing it has measurable benefits on the body.",
        "url": "https://news.sky.com/story/forget-the-gym-a-cultural-workout-could-be-the-key-to-better-health-13461435",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-art-health-vincent-van-gogh_7068174.jpg?20251101112654",
        "type": "UK",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-01 00:01:00",
        "Headline": "A King's College London study involving masterpieces by artists including Manet, Van Gogh and Gauguin has shown that art immediately calms the body.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Culture lovers have long believed in the healing power art. Now, science has caught up, with new research showing it has measurable benefits on the body. A study from King's College London has found that looking at original artworks, in a gallery, doesn't just lift us emotionally - it also has a positive impact on our physical health. Fifty people aged between 18 and 40 were shown art by a selection of leading 19th-century artists: Toulouse-Lautrec, Manet, van Gogh and Gauguin. Participants viewed five paintings for three minutes each, in a 20-minute session. But while half viewed the original paintings in the Courtauld Gallery in London, the others looked at reproductions in a neutral setting. Their heart rates and skin temperature were measured with research-grade digital watches to indicate levels of interest and arousal, and saliva samples were taken with swabs before and after the session to measure stress hormones. The results in those looking at the results in the gallery were significant, and immediate: The stress hormone cortisol fell by 22% and inflammatory markers linked to health problems including heart disease, diabetes and depression were reduced by as much as 30%. \n                  Shaine March: Man who stabbed pregnant girlfriend to death after release for teen's murder jailed \n                 \n                  Elderly patients facing 'war-like' conditions in Britain's hospitals, says report\n                 \n                  Uxbridge triple stabbing: Safi Dawood appears in court charged with murder and attempted murder\n                 No change was observed in the reproduction group. Dr Tony Woods of King's College London, who was the study's lead researcher, told Sky News: \"The magnitude of the difference between being in here and looking at the real art, looking at the copies in the laboratory, the difference between the two participant groups was quite enormous.\" It's good news for the NHS, which is increasing its use of social prescribing, which can include visits to galleries. Dr Woods went on: \"The government's health strategy is all about prevention. And this is a gift to [Health Secretary] Wes Streeting. Art is very well worth investing in because of the return on investment - it will keep people out of hospitals.\" Over one and a half million people in the UK accessed social prescribing between September and August this year across the UK, and NHS England told Sky News their ambition is to make it available to every person in England. Dr Woods says the next steps of the study will be to find out how long the positive effects last, and research further into the effects of art on older participants. Russell Tovey, actor, art lover and co-host of Talk Art, chatted to Sky News about his favourite piece at the gallery - van Gogh's Self-Portrait with Bandaged Ear (1889). Tovey jokes: \"Look at this painting here. It's quite a troublesome picture, especially for me with my ears… \"But you can look at the surface and the way that he makes brushstrokes and the scale of the things and the colour he used. And you think about his life at the time and where he was living, and all those questions and answers will reveal the painting.\" Tovey adds: \"Art is intrinsic to humanity,\" and \"shows us who we are\". And now with the new findings, the hope is that gallery visits will be considered just as good as your 'five-a-day'. Tovey goes on: \"It's good for your health, it's beneficial to your mental health and to your wellbeing to be in a museum and to be around art… \"If you eat well, go to the gym and go to a regular art gallery visit, then your health will be through the roof.\" Tovey's podcast co-host, gallery owner Robert Diament, agrees: \"I think it's really important just to slow down a bit. Going to a museum or gallery can be part of your self-care routine… It will improve your life.\" Amid rising costs, reduced funding and dwindling visitor numbers, the findings could also provide a boost to galleries. Jenny Waldman, Art Fund director, told Sky News: \"These museums and galleries were set up in all cities and towns by people, you know, hundreds of years ago, who felt that it was good for people. So, this is the evidence, finally, that they were right.\" The national charity for museums and galleries, Art Fund champions art around the country, with initiatives including the National Art Pass which offers free or discounted entry to hundreds of museums, galleries and historic places around the UK. So, what do gallery visitors think of the news that their time looking at art will positively impact their wellbeing? Charlie, 10, from London said: \"It makes me feel quite calm, and it draws me in.\" His dad Patrick, who had brought Charlie with his two young brothers to see the exhibition, added: \"Looking at them on screens, or even in books, you just don't get the full impression.\" Taeseok, an arts student from Amsterdam visiting the UK for the first time, said it felt good to stand and focus on just one thing, with no distractions. He summed it up: \"Things around you start to not matter at all… It's just you and the artwork.\" Re-framed as a course of treatment instead of an indulgent pastime, could the hard edge of science change the role galleries play in society? If so, it could be a fitting reminder to the government of the true power of art, at a time when so many institutions are struggling to survive."
    },
    {
        "title": "Ukrainian troops 'start surrendering' in key city but Kyiv says situation 'dynamic'",
        "description": "Ukrainian soldiers encircled by Russian forces in the key eastern city of Pokrovsk have started surrendering, the defence ministry in Moscow claims.",
        "url": "https://news.sky.com/story/ukrainian-troops-start-surrendering-in-key-city-but-kyiv-says-situation-dynamic-13461786",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ukrainian-troops-ukraine_7068681.jpg?20251101151821",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-01 14:51:00",
        "Headline": "The Ukrainian military has claimed its positions in some districts of Pokrovsk have improved despite the city being infiltrated by Russian troops.",
        "Content": "Ukrainian soldiers encircled by Russian forces in the key eastern city of Pokrovsk have started surrendering, the defence ministry in Moscow claims. But Ukraine's military has pushed back on the report by the TASS state news agency, saying the situation is \"difficult and dynamic\". Kyiv has also claimed its positions in some districts of Pokrovsk have improved despite its city being infiltrated by Russian troops. Latest: Russian attacks are 'nuclear terrorism', Ukraine warns Ukraine is increasing its number of assault troops in the area, the 7th Rapid Response Corps said on Facebook. And Ukrainian troops are also working to cut Moscow's military logistics routes, it added. The Russian defence ministry also said its forces defeated a team of Ukrainian special forces that headed to Pokrovsk in a bid to prevent Russian forces from advancing further into the city. \n                  Ukraine will work on ceasefire plan within next 10 days, Volodymyr Zelenskyy says\n                 \n                  Vladimir Putin tests new 'invincible' nuclear-powered missile\n                 \n                  Sanctions alone won't force Putin to end Ukraine war\n                 'Footage of Ukrainian troops after surrendering' It later posted videos of two Ukrainian troops who, it claimed, had surrendered. The footage showed the men, one dressed in fatigues and the other in a dark green jacket, sat against a wall in a dark room, as they spoke of fierce fighting and encirclement by Russian forces. The videos' authenticity could not be independently verified, and there was no immediate public comment from Kyiv on the Russian ministry's claims. Ukraine's President Volodymyr Zelenskyy has previously acknowledged that some Russian units had infiltrated the city. But he maintained that Ukraine is tackling them. He said Russia had deployed 170,000 troops in Ukraine's eastern Donetsk province, where Pokrovsk is located, in a major offensive to capture the city and claim a big battlefield victory.  'Operation to destroy enemy forces' Ukraine's army chief Oleksandr Syrskyi said on Saturday the situation in Pokrovsk remained \"hardest\" for Ukrainian forces, who were trying to push Russian troops out. But he insisted there was no encirclement or blockade as Moscow has claimed. \"A comprehensive operation to destroy and push out enemy forces from Pokrovsk is ongoing. The main burden lies on the shoulders of the units of the armed forces of Ukraine, particularly UAV operators and assault units,\" Mr Syrskyi said. Read more:Ukraine will work on ceasefire plan within next 10 days24 hours in the kill zone  Why is Pokrovsk important? One of Moscow's key aims has been to take all of Ukraine's industrial heartland of coal-rich Donbas, which comprises of the Luhansk and Donetsk provinces. Kyiv still controls about 10% of Donbas. Capturing Pokrovsk, which Russian media has dubbed \"the gateway to Donetsk\", and Kostiantynivka to its northeast, would give Moscow a platform to drive north towards the two biggest remaining Ukrainian-controlled cities in Donetsk - Kramatorsk and Sloviansk. 'Key Russian fuel pipeline struck' Meanwhile, Ukraine's military intelligence, known as HUR, has said its forces have hit an important fuel pipeline in the Moscow region that supplies the Russian army.  In a statement on Telegram, HUR said the operation late on Friday was a \"serious blow\" to Russia's military logistics. HUR said its forces struck the Koltsevoy pipeline, which is 250 miles long and supplies the Russian army with gasoline, diesel and jet fuel from refineries in Ryazan, Nizhny Novgorod and Moscow. The operation, which targeted infrastructure near Ramensky district, destroyed all three fuel lines, HUR said. The pipeline was capable of transporting up to three million tonnes of jet fuel, 2.8 million tonnes of diesel and 1.6 million tonnes of gasoline annually, HUR said. Russia 'targets gas production site' Also overnight, Russia launched an attack on a gas production site in Poltava, in central Ukraine. A fire broke out, the local administration said, but no injuries were reported. Kyiv condemns 'nuclear terrorism' Ukraine's foreign ministry has condemned Russian strikes this week on substations powering some of its nuclear plants. It accused Russia of carrying out \"targeted strikes on such substations\" which \"bear the hallmarks of nuclear terrorism\". Elsewhere, a civilian died and 15 more were injured on Saturday morning after Russia struck the Mykolaiv region in southern Ukraine with a ballistic Iskander missile, local official Vitaliy Kim said. A child was among those hurt in the strike, he added."
    },
    {
        "title": "Tense days ahead as tens of thousands line streets for anniversary of Novi Sad tragedy",
        "description": "The organisers said they didn&#8217;t want people to bring banners or whistles, and there were no political speeches. Today was about commemoration, not protest.",
        "url": "https://news.sky.com/story/tense-days-ahead-as-tens-of-thousands-line-streets-for-anniversary-of-novi-sad-tragedy-13462068",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-novi-sad-serbia_7068995.jpg?20251101175657",
        "type": "World",
        "Author": "Alistair Bunkall",
        "Date Published": "2025-11-01 17:51:00",
        "Headline": "Vast crowds gathered in commemoration a year after a canopy collapsed outside a train station and killed 16 people in Serbia. ",
        "Content": "\n          Europe correspondent\n              @AliBunkallSKY\n  The organisers said they didn’t want people to bring banners or whistles, and there were no political speeches. Today was about commemoration, not protest. However, the image of tens of thousands lining the city's avenues was a statement in itself. People had been travelling to Novi Sad for days. The train line from Belgrade was shut because of a reported bomb scare and some roads had been closed, but the crowds slowly making their way to the centre of the city were vast and all ages. It was sombre and quiet. I saw doctors and medical staff in uncontrollable tears as they laid wreaths to the 16 dead. The train station, supposed to be a symbol of Serbian modernity and big infrastructure, has become a symbol of corruption and cost-cutting for many. Today it is empty, the exposed concrete beams a reminder of what happened 12 months ago and motivation for a protest movement that has grown over the year and is demanding change. \n                  Ukrainian troops 'start surrendering' in key city but Kyiv says situation 'dynamic'\n                 \n                  'Shell shock' and an emotional reunion in 'ground zero' for Hurricane Melissa\n                 \n                  Satellite images show US military edging closer to Venezuela - as Trump's intentions questioned\n                  The police and state security, feared by many here, were nowhere to be seen today. As I put my earpiece in, preparing to go live on Sky News, one person mistook me for police. \"You're not welcome here today,\" I was told, before he realised his mistake. Read more from Sky News:Emotional reunion in Hurricane Melissa 'ground zero'Woman, 38, charged over Louvre jewellery heist Instead Serbian war veterans, now a part of the protest group, were the visible presence and a sign of how the movement has spread through generations. They protected the families of the victims as they laid flowers outside the building where their loved ones died. Serbia's President had declared 24 hours of national mourning on Friday evening - it probably helped lower tensions but will have done little to reduce the anger. The day passed without violence, as was hoped, but there is little doubt that tense days lie ahead. The Serbian government is under pressure but so far unmovable. This has become a battle for the future of the country. The protest movement believes it has momentum, and they seem absolutely determined to carry on."
    },
    {
        "title": "'Shell shock' and an emotional reunion in 'ground zero' for Hurricane Melissa",
        "description": "In the town of Middle Quarters, close to where Hurricane Melissa made landfall, Vivienne Bennett is sitting propped up against a house without a roof. Her right hand is wrapped in a kitchen towel.",
        "url": "https://news.sky.com/story/we-have-no-food-no-water-it-feels-like-the-wilderness-the-communities-shredded-and-still-stranded-by-hurricane-melissa-13461594",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jamaica-hurricane-melissa_7068375.png?20251101071247",
        "type": "World",
        "Author": "Martha Kelner",
        "Date Published": "2025-11-01 05:11:00",
        "Headline": "Sky News travels to areas where people have yet to see any government aid and lack even basic painkillers for injuries sustained in the hurricane. ",
        "Content": "\n          US correspondent\n              @marthakelner\n  In the town of Middle Quarters, close to where Hurricane Melissa made landfall, Vivienne Bennett is sitting propped up against a house without a roof. Her right hand is wrapped in a kitchen towel. \"I lost my finger in the hurricane,\" she says, showing me her finger which is exposed to the bone. \"I opened the door of my house to try and escape, and the wind slammed it back and cut my finger off.\" She asks me for painkillers and says she doesn't have any medication to stave off infection. I ask if she has seen any government aid. \"No,\" she replies, \"we haven't seen anybody yet, so we're trying to get some help. I need to get to a hospital but I don't know how because all the roads are blocked.\" Her daughter, Leila, has a baby and other children are playing nearby. \"We have no nappies, we have no food, we have no water,\" Leila says, \"it feels like the wilderness here now.\" The death toll in Jamaica after Hurricane Melissa could rise, with some communities still marooned from the rest of the island, according to the police chief for the worst-affected area. Coleridge Minto, superintendent of police for St Elizabeth Parish, told Sky News his area has recorded six deaths directly related to the hurricane. \"We are hoping there is no more,\" he said. \"The reality is we have not yet communicated with all our station commanders in some of the other areas and so as soon as we have those reports, we could be hearing of other injuries, other situations that we were not privy to at this moment.\" The UK has pledged £7.5m to assist the Caribbean's recovery from the hurricane. Aid flights have been arriving over the past couple of days into Jamaica's two international airports, but it's not getting to where they need it the most. The road to ground zero The road leading to Black River, the town authorities are referring to as \"ground zero\" for this disaster, is difficult to pass, but not impossible. A journey from the capital, Kingston, that would usually take two hours, now takes six. We drive through murky floodwater, a couple of feet deep, and through an avenue of twisted bamboo stalks. On arrival, it's a desperate scene. People here seem almost shell-shocked, still processing what has happened to them, unsure what to do next. One man walks past our cameraman and holds his hands in the air. \"Jamaica needs help,\" he says. \"It's been mashed up.\" I ask what help he needs. \"We need houses, food and water,\" he replies. Black River was once a wealthy town, the first in Jamaica to have electricity. But the storm has laid waste to the main street. The 300-year-old church, the seafront restaurant, the pharmacy, the Chinese supermarket, the whole town has been shredded. A group of people sit at a bus stop on the seafront surrounded by huge rocks washed up by a 16-foot storm surge. \"It's a disaster, a disaster,\" one woman calls out to me. With communications still down across most of the island, people here have been unable to contact friends and family for five days now. Read more:'Send help': The desperate pleas from hurricane survivorsBefore and after images show hurricane's destructionWhat we know from the ground following the devastation A woman called Inkiru Bernard, who is Jamaican but lives in New York, has been in touch with our team and asked us to try to find her 67-year-old mother, who lives in Black River. She's not heard from her since the storm. Daughter's emotional reunion When we arrive at the address she provides, her mother, Inez McRae, is sitting on the porch. She shows me around what remains of the house where she weathered the storm. The roof is entirely gone, everything is sodden and thick with mud. \"But I'm alive,\" she says, \"I've been spared.\" When Inkiru finally sees her mother on a video call, she cries with relief. \"Oh mummy,\" she says, \"I've been so worried.\"  Tanks have been positioned on the main street in Black River and soldiers patrol it after shops and businesses were looted. The police chief for this area, Coleridge Minto, says he understands the desperation but is urging people to be patient. \"We can appreciate that persons are trying to grab things,\" he says, \"persons are devastated, but we want to ensure that we maintain law.\" Army helicopters were flying over the disaster zone and some aid is now arriving into Black River. But with other villages still largely cut off from the rest of the island, this situation is growing more dire by the day."
    },
    {
        "title": "Satellite images show US military edging closer to Venezuela - as Trump's intentions questioned",
        "description": "Satellite images of a US military ship just under 200km from the coastline of Venezuela, carrying out military drills, have been verified by Sky News.",
        "url": "https://news.sky.com/story/satellite-images-show-us-military-edging-closer-to-venezuela-as-questions-raised-about-trumps-intentions-13461237",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-teaser-dandf_7067912.png?20251031143437",
        "type": "World",
        "Author": "Freya Gibson and Sophia Massam, Data and Forensics team",
        "Date Published": "2025-11-01 00:01:00",
        "Headline": "Marines operating under US Southern Command conducted live-fire training on a US assault ship just off the coast of Venezuela. ",
        "Content": "By Freya Gibson and Sophia Massam, Data and Forensics team  Satellite images of a US military ship just under 200km from the coastline of Venezuela, carrying out military drills, have been verified by Sky News. Defence expert and former US military colonel Mark Cancian said the operation could be viewed by the Venezuelan regime, characterised by its authoritarian rule under President Nicolas Maduro, as an intimidation tactic. It comes as the US has been scaling up its military presence in the Caribbean Sea and Eastern Pacific, deploying warships, aircraft and thousands of troops. Officials have said they are targeting drug trafficking networks, but it has raised speculation that the US might be preparing to attack key Venezuelan military targets without congressional approval. Mr Maduro on Friday accused the US of creating a false narrative to justify an attack and impose regime change. On 24 October, US President Donald Trump said \"drugs coming in by sea are 5% of what they were a year ago, so now they're coming in by land, and even the land is concerned because I told them that's going to be next\". He has since said he is not considering strikes within Venezuela, appearing to contradict previous comments.  Announcements by Mr Trump and US Secretary of War Pete Hegseth on Truth Social and X indicate 61 people have been killed in the strikes on boats since the first strike was announced on 2 September. What can imagery tell us about what's happening? On 30 October, US Southern Command posted videos and photos on X of Marines conducting live-fire drills. A live fire exercise is a military exercise in which live ammunition and ordnance are used, as opposed to blanks or dummies. It helps troops prepare for combat and train in realistic scenarios. Sky News has verified satellite imagery that shows the position of USS Iwo Jima, the ship where these live-shooting drills were happening. The imagery shows the ship less than 200km away from the coastline of Venezuela. USS Iwo Jima is an amphibious assault ship that serves as a core component of US expeditionary forces, capable of launching amphibious invasions. USS Iwo Jima was also seen accompanied by two other USS destroyers, within around 20km of each other. The ship's arrival follows the announcement that the USS Gerald R Ford Aircraft carrier is also being moved towards the Caribbean Sea, with three US destroyers alongside it. Sean Parnell, assistant to the Secretary of War for Public Affairs, said in a statement on X on 24 October that the forces will \"enhance and augment existing capabilities to disrupt narcotics trafficking and degrade and dismantle\" transnational criminal organisations. He was thought to be describing fishing boats which they suspected of trafficking drugs, but so far there is no evidence to confirm this. The deployment means there will be 14% of the US Navy's fleet in the Caribbean, showing a significant build-up of force. USS Gerald R Ford was spotted just off the coast of Italy on its way to the Caribbean on 29 October. Mr Cancian, senior advisor of defence and security at the Centre for Strategic International Studies (CSIS), told Sky News: \"The United States only has 11 carriers, three are at sea at any one time. So, moving one of them into the Caribbean is very significant, it does a couple of things. It puts more pressure on the Maduro regime, and it brings a lot of combat power into the Caribbean.\" He described the USS Gerald R Ford as a \"use it or lose it\" asset, saying \"it's so powerful and so scarce, carrier strike groups, that other regional commanders will want to use the battle group\". He added, when the airstrike carrier arrives in the Caribbean, a decision will have to be made. \"If the administration wants to conduct strikes, the arrival of the Ford would open that window for those attacks,\" he said. On 30 October, the Wall Street Journal reported that US officials said the Trump administration has identified targets in Venezuela that include military facilities used to smuggle drugs. Read more:Is Trump preparing to go to war with Venezuela?More than a dozen killed as US attacks alleged drug boats Is the USS Gerald R Ford aircraft carrier the best military asset for targeting drug boats? Nick Brown, director at Janes defence intelligence company, told Sky News the \"Gerald R Ford is the US Navy's newest aircraft carrier and the largest warship currently in US service\". He said there are 4,805 crew members on board and a full range of precision air-to-surface bombs, missiles and rockets, \"able to tackle a wide variety of tactical and strategic targets\". The aircraft carrier also carries an abundance of fighter jets, typically 24 F/A-18s and 24 F-35s. Mr Cancian said: \"It's not a very good asset for countering drug traffic. The strike aircraft are very powerful, but they move too fast to identify small boats. There are some helicopters that could help, but what the carrier is very good at is attacks against adversary military forces or targets ashore. \"The strike aircraft operate at 500, 600mph. So, they're going very fast. And to spot a small boat and then to identify it, very difficult.\" Increasing pressure in the skies As well as the sea, the US appears to have been more active in the air over the Caribbean Sea. Flight tracking data shows the US have flown bombers off the Venezuelan coast, B1s and B52s. The B1-B bomber is primarily a fast, heavy-hitting conventional \"bomb truck\" designed rapidly to deliver massive amounts of precision weapons, while the B-52 bomber is a versatile, long-range \"missile truck\". Flight tracking data from 27 October shows two B1-B bomber jets flying over the Caribbean Sea. \"The administration has flown bombers off the Venezuelan coast, B1s and B52s. So, they have been steadily increasing the pressure,\" Mr Cancian said. Three B-52 bombers were also seen on flight tracking on 30 October, leaving from Jacksonville (Florida) and Shreveport (Louisiana). They circled their surrounding areas for two hours before returning to their base. The satellite imagery below shows six F35-B fighter jets, capable of performing air-to-surface, electronic warfare, intelligence gathering, and air-to-air missions simultaneously at Puerto Rico on 17 October. Uptick of strikes in the Pacific  US Southern Command have been criticised for choosing targets in the Caribbean Sea rather than the Eastern Pacific. Mr Cancian explained that \"much of the drug traffic that comes to the United States allegedly comes along the Pacific route... so not focusing on that flow\" was considered curious. On 28 October, the US Southern Command defended their operational targets in a post on X saying: \"The Department has spent over TWO DECADES defending other homelands. Now, we're defending our own. These narco-terrorists have killed more Americans than Al-Qaeda, and they will be treated the same. We will track them, we will network them, and then, we will hunt and kill them.\" The Data X Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "Israel says latest remains returned from Gaza are not hostages",
        "description": "The remains of three people transferred to Israel from Gaza do not belong to any of the missing hostages, according to reports by Israeli sources.",
        "url": "https://news.sky.com/story/israel-says-latest-remains-returned-from-gaza-are-not-hostages-13461621",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-deir-al-balah_7067080.jpg?20251030155330",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-01 07:51:00",
        "Headline": "It is not the first time Israel has accused Hamas of violating the ceasefire agreement by failing to return the bodies of hostages.",
        "Content": "The remains of three people transferred to Israel from Gaza do not belong to any of the missing hostages, according to reports by Israeli sources. The Red Cross said it transferred the unidentified remains of three people to Israel late on Friday - but Israeli military sources told the AP news agency they were not any of the hostages. Earlier this week, Israel's prime minister ordered airstrikes on Gaza, which killed more than 100 people, after accusing Hamas of a \"clear violation\" of the ceasefire agreement by releasing remains of a hostage already recovered by troops nearly two years ago It is not the first time Israel has accused Hamas of violating the ceasefire deal, which came into effect on 10 October, by failing to return the bodies of hostages. On 15 October, the Israeli military said one of four bodies returned to Israel was not a hostage. Under the ceasefire agreement, Hamas released all living hostages held in Gaza in return for nearly 2,000 Palestinians, while Israel agreed to pull back its troops, halt its offensive and increase aid. Hamas also agreed to hand over the remains of all 28 dead hostages in exchange for 360 Palestinian militants killed in the war. The remains of the last 11 hostages have yet to be returned. Israel: Hamas 'violating truce' Israel has consistently accused Hamas of violating the truce by stalling in handing over bodies. Hamas argues there are problems finding them due to a lack of equipment to sift through the devastation and rubble in Gaza. Israel returned the bodies of 30 Palestinians to authorities in Gaza on Friday. At Nasser Hospital, in the southern city of Khan Younis, medical workers were striving to identify them. Late on Thursday, Israel confirmed that the remains of two hostages, returned by Palestinian militants, had been confirmed as those of Sahar Baruch and Amiram Cooper, both taken during the 7 October attack. Read more from Sky News:Israel warns of 'imminent terror attack'Farmers targeted amid olive harvestAnalysis: Can 'shaky' ceasefire hold? So far, the number of Palestinian bodies returned by Israel has reached 225, only 75 of which have been identified by families, according to Gaza's health ministry. Images from the grounds of Nasser Hospital show remains, in white body bags, arranged in rows. Health officials have struggled to identify bodies without access to DNA kits. Boy shot by Israeli soldiers In the central West Bank town of Silwad on Friday, people gathered for the funeral of Yamen Hamed, 15, who Palestinian health officials say was shot by an Israeli soldier. His father said his son left home on Thursday to meet friends and soon after learned the teenager had been injured. An ambulance driver who tried to reach Hamed told the AP news agency that troops held him up multiple times. The boy died before he could reach him. Israel's military called the teenager a \"terrorist\" and said troops had fired, believing that he was holding an explosive, but did not provide any evidence."
    },
    {
        "title": "Woman, 38, one of two charged in connection with Louvre jewellery heist",
        "description": "A 38-year-old woman has been charged in connection with the Louvre jewellery heist in Paris, according to local media. ",
        "url": "https://news.sky.com/story/woman-38-charged-in-connection-with-louvre-jewellery-heist-13461622",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-louvre-paris_7058733.jpg?20251022192846",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-01 07:59:00",
        "Headline": "She is among a number of people arrested over the £76m raid at the world-famous museum on 19 October. ",
        "Content": "A 38-year-old woman has been charged in connection with the Louvre jewellery heist in Paris, according to local media.  She is among a number of people who have been arrested over the raid, which was carried out while the world-famous museum was open to visitors on 19 October. The woman, who has not been named but lives in a northern suburb in Paris, has been charged with complicity in organised theft and criminal conspiracy with a view to committing a crime, according to media reports. A 37-year-old man was also charged in connection with the heist. Four thieves stole nine items - one of which was dropped and recovered at the scene - worth an estimated £76m in less than eight minutes. They forced open a window and cut into cases with power tools after gaining access via a vehicle-mounted mechanical lift.  On Wednesday, a prosecutor said two suspects arrested over the jewellery heist had \"partially\" confessed to their involvement in the heist. They were handed preliminary charges of criminal conspiracy and theft committed by an organised gang, and remanded in custody. Later on the same day, five more people were arrested in coordinated raids in the French capital, but searches did not lead to the stolen jewellery. The woman appeared before a magistrate on Saturday. The heist exposed major gaps in the Louvre's security, with Paris police chief Patrice Faure telling politicians that ageing security systems had left weak spots. Read more:How the Louvre investigation is unfolding'Race against time' as police try to recover 'priceless' jewels'Matter of time' before thieves struck, expert says The thieves made away with a total of eight objects, including a sapphire diadem (a jewelled headband), necklace and single earring from a set linked to 19th-century queens Marie-Amelie and Hortense. They also took an emerald necklace and earrings tied to Empress Marie-Louise, Napoleon Bonaparte's second wife, as well as a reliquary brooch. Empress Eugenie's diamond diadem and her large corsage-bow brooch - an imperial ensemble of rare craftsmanship - were also stolen. One piece - Eugenie's emerald-set imperial crown with more than 1,300 diamonds - was later found damaged outside the museum."
    },
    {
        "title": "Nine dead in crowd crush at temple in India",
        "description": "Nine people have died in a crowd surge at a popular Hindu temple in southern India, authorities have said.",
        "url": "https://news.sky.com/story/nine-dead-in-crowd-crush-at-temple-in-india-13461689",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-india-temple_7068544.png?20251101125324",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-01 12:31:00",
        "Headline": "Despite having a maximum capacity of 3,000, the crowd at the temple swelled to around 25,000 on Saturday, on one of Hinduism's sacred days.",
        "Content": "Nine people have died in a crowd surge at a popular Hindu temple in southern India, authorities have said. Dozens of others were injured in the crush at the Swamy Venkateswara Temple, where thousands of devotees had gathered to mark a sacred day in the Hindu calendar. Despite having a maximum capacity of 3,000, the crowd at the temple swelled to around 25,000 on Saturday. According to an initial investigation, an iron grille meant to maintain the queue of worshippers at the temple broke, leading to an uncontrolled surge of people, a senior police officer said. Senior local government official Swapnil Dinkar Pundkar said more casualties were feared. \"Initially, we had reports of seven deaths, but two more people have succumbed to their injuries, while the condition of two others is critical,\" he said. Among the dead are eight women and a child. Read more from Sky News:Cloud-seeding trial over smog-choked New Delhi Video footage on local media showed people rushing to help those who fainted in the crowd surge and were gasping for breath. Prime Minister Narendra Modi was among those who expressed grief in the aftermath of the incident."
    },
    {
        "title": "Canada's prime minister Mark Carney apologises to Donald Trump over anti-tariff advert featuring Ronald Reagan",
        "description": "Canadian Prime Minister Mark Carney has apologised to Donald Trump over an anti-tariff advert featuring a clip of Ronald Reagan.",
        "url": "https://news.sky.com/story/canadas-prime-minister-mark-carney-apologises-to-donald-trump-over-anti-tariff-advert-featuring-ronald-reagan-13461644",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mark-carney-donald-trump_7068469.jpg?20251101105524",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-01 09:58:00",
        "Headline": "The commercial, commissioned by Ontario Premier Doug Ford, included a quote from Republican former president Ronald Reagan saying tariffs cause trade wars and economic disaster.",
        "Content": "Canadian Prime Minister Mark Carney has apologised to Donald Trump over an anti-tariff advert featuring a clip of Ronald Reagan. Speaking at the Asia-Pacific summit in South Korea, he also said he had reviewed the commercial and told Ontario Premier Doug Ford not to air it. \"I did apologise to the president,\" Mr Carney said on Saturday, confirming earlier comments made by the US president on Friday. \"I told [Doug] Ford I did not want to go forward with the ad,\" he added. The private conversation with Mr Trump happened at a dinner hosted by South Korea's president on Wednesday. The commercial, commissioned by Mr Ford, included a quote from Republican former president Ronald Reagan saying that tariffs cause trade wars and economic disaster.  Mr Trump said the advert was misleading and, in response, announced that he was increasing tariffs on goods from Canada and halting trade talks with Canada. In a post on Truth Social, he wrote: \"Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10% over and above what they are paying now.\" It prompted the Ontario premier to pull the ad. On Friday, the US president expressed his irritation at the advert but also told reporters he had accepted Mr Carney's apology. \"I like him [Carney] a lot but what they did was wrong,\" he said. \"He apologised for what they did with the commercial because it was a false commercial.\" But, critically, he added that the US and Canada will not restart trade talks. Mr Ford has been a vocal critic of the Trump administration's tariffs and trade policies, which are hurting Ontario's carmakers and steel industry. Read more from Sky News:Trump says China tariffs will be cutHow tariffs would hit UK film sectorIs Trump heading for a third term? The ad by the Ontario government has a voiceover of Ronald Reagan criticising tariffs on foreign goods while saying they cause job losses and trade wars. The video uses five complete sentences from a five-minute weekly address recorded in 1987, but edited together out of order. The ad does not mention that the former US president was explaining that tariffs imposed on Japan by his administration should be seen as a sadly unavoidable exception to his basic belief in free trade as the key to prosperity. Meanwhile, Mr Carney said his talks with Chinese President Xi Jinping on Friday were a turning point in relations after years of tensions. He also met Japan's Prime Minister Sanae Takaichi on the sidelines of the summit."
    },
    {
        "title": "Foreign secretary calls for immediate ceasefire in Sudan after reported massacre",
        "description": "Foreign Secretary Yvette Cooper has joined calls for an immediate ceasefire in Sudan after tens of thousands of people were reportedly killed in the city of Al Fashir.",
        "url": "https://news.sky.com/story/foreign-secretary-calls-for-immediate-ceasefire-in-sudan-after-reported-massacre-13461658",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-al-fashir_7063213.jpg?20251026191619",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-01 11:23:00",
        "Headline": "Yvette Cooper condemned \"atrocities, mass executions, starvation and the devastating use of rape as a weapon of war\" in Darfur.",
        "Content": " Foreign Secretary Yvette Cooper has joined calls for an immediate ceasefire in Sudan after tens of thousands of people were reportedly killed in the city of Al Fashir. Some 260,000 people, half of them children, are now feared to be trapped in the Darfur capital after the Rapid Support Forces (RSF) captured it. Speaking in Bahrain on Saturday, Ms Cooper condemned \"atrocities, mass executions, starvation and the devastating use of rape as a weapon of war\" in Darfur, describing reports from the region as \"truly horrifying\". \"In Sudan right now, there is just despair,\" she told the Manama Dialogue Conference. She noted that while \"progress\" had been made on Gaza, the international community \"is currently failing to deal with the humanitarian crisis and the devastating conflict in Sudan\". The RSF has been waging a civil war against the Sudanese government since 2023 and has been accused of multiple human rights violations over the course of the conflict. The foreign secretary also announced that the UK will send £5m in aid to Sudan, with £2m to be focused on supporting survivors of sexual violence. Read more:Sudanese militia leader convicted of war crimes in DarfurUAE is 'main backer' behind Sudan war - intelligence officer Tens of thousands killed in two days The aid announcement came after RSF forces swept into Al Fashir. Analysts believe tens of thousands of people were killed in the city in a two-day window, Sky News' Africa correspondent Yousra Elbagir reported. Stains and shapes resembling blood and corpses can be seen from space in satellite images analysed by Yale Humanitarian Labs. The Sudan Doctors Network has also shared that the RSF \"cold-bloodedly killed everyone they found inside Al Saudi Hospital, including patients, their companions, and anyone else present in the wards\". In the early hours of Saturday morning, an RSF drone hit the North Darfur town of Tine on the border with Chad. An eyewitness told Sky News the drone dropped at least 5 bombs, injuring civilians and remains in the sky over the town. On Wednesday, an RSF drone dropped three bombs. Two hit military sites and a third hit a displacement shelter but did not detonate."
    },
    {
        "title": "Canada's prime minister Mark Carney apologises to Donald Trump over anti-tariff advert featuring Ronald Reagan",
        "description": "Canadian Prime Minister Mark Carney has apologised to Donald Trump over an anti-tariff advert featuring a clip of Ronald Reagan.",
        "url": "https://news.sky.com/story/canadas-prime-minister-mark-carney-apologises-to-donald-trump-over-anti-tariff-advert-featuring-ronald-reagan-13461644",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mark-carney-donald-trump_7068469.jpg?20251101105524",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-01 09:58:00",
        "Headline": "The commercial, commissioned by Ontario Premier Doug Ford, included a quote from Republican former president Ronald Reagan saying tariffs cause trade wars and economic disaster.",
        "Content": "Canadian Prime Minister Mark Carney has apologised to Donald Trump over an anti-tariff advert featuring a clip of Ronald Reagan. Speaking at the Asia-Pacific summit in South Korea, he also said he had reviewed the commercial and told Ontario Premier Doug Ford not to air it. \"I did apologise to the president,\" Mr Carney said on Saturday, confirming earlier comments made by the US president on Friday. \"I told [Doug] Ford I did not want to go forward with the ad,\" he added. The private conversation with Mr Trump happened at a dinner hosted by South Korea's president on Wednesday. The commercial, commissioned by Mr Ford, included a quote from Republican former president Ronald Reagan saying that tariffs cause trade wars and economic disaster.  Mr Trump said the advert was misleading and, in response, announced that he was increasing tariffs on goods from Canada and halting trade talks with Canada. In a post on Truth Social, he wrote: \"Because of their serious misrepresentation of the facts, and hostile act, I am increasing the Tariff on Canada by 10% over and above what they are paying now.\" It prompted the Ontario premier to pull the ad. On Friday, the US president expressed his irritation at the advert but also told reporters he had accepted Mr Carney's apology. \"I like him [Carney] a lot but what they did was wrong,\" he said. \"He apologised for what they did with the commercial because it was a false commercial.\" But, critically, he added that the US and Canada will not restart trade talks. Mr Ford has been a vocal critic of the Trump administration's tariffs and trade policies, which are hurting Ontario's carmakers and steel industry. Read more from Sky News:Trump says China tariffs will be cutHow tariffs would hit UK film sectorIs Trump heading for a third term? The ad by the Ontario government has a voiceover of Ronald Reagan criticising tariffs on foreign goods while saying they cause job losses and trade wars. The video uses five complete sentences from a five-minute weekly address recorded in 1987, but edited together out of order. The ad does not mention that the former US president was explaining that tariffs imposed on Japan by his administration should be seen as a sadly unavoidable exception to his basic belief in free trade as the key to prosperity. Meanwhile, Mr Carney said his talks with Chinese President Xi Jinping on Friday were a turning point in relations after years of tensions. He also met Japan's Prime Minister Sanae Takaichi on the sidelines of the summit."
    },
    {
        "title": "City tycoons plot cash shell float to fund $5bn takeover deal",
        "description": "A group of senior City figures is in talks to raise hundreds of millions of pounds for a new listed vehicle that would be used to target a major corporate takeover.",
        "url": "https://news.sky.com/story/city-tycoons-plot-cash-shell-float-to-fund-5bn-takeover-deal-13461613",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-city-skyline-walkie-talkie_5645153.jpg?20220118143814",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-01 07:26:00",
        "Headline": "Prominent financiers including Jeremy Isaacs and Noam Gottesman are in talks to raise up to $500m for a new London-listed acquisition vehicle, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A group of senior City figures is in talks to raise hundreds of millions of pounds for a new listed vehicle that would be used to target a major corporate takeover. Sky News has learnt that JRJ Group, which was co-founded by the former Lehman Brothers executives Jeremy Isaacs and Roger Nagioff, is orchestrating talks with investors about the launch of a London-listed acquisition company. TOMS Capital, which was established by former hedge fund manager Noam Gottesman, is also involved in the new venture, which has been codenamed Project Mayflower. This weekend, City sources said that initial discussions with institutional investors about backing the vehicle had already got underway. One of those approached about it said the talks were expected to be accelerated in the coming weeks amid signs of strong demand. The group is said to be targeting an initial fundraising of about $500m, with scores of takeover targets in multiple industries likely to be reviewed. They are understood to be particularly focused on bid targets worth between $2bn and $5bn. \n                  The modern payment method that has led people with 'perfect' credit scores to be refused mortgage | Money blog\n                 \n                  'Significant' step in establishing national restorative justice programme for Post Office victims\n                 \n                  Former TGI Fridays chief in move to snap up UK chain \n                 Jefferies, the investment bank, is involved in the listing plan. One source said the founders had chosen London because of its investor-friendly structure for so-called cash shells. The vehicle's launch comes at a time when London's depressed environment for initial public offerings (IPOs) has coincided with pressure on asset-owners such as private equity firms to generate liquidity from their portfolios. This combination of factors had created \"a generational opportunity to buy assets at attractive prices\", the source added. Mayflower's founders are expected to invest significant amounts of their own money in the venture to ensure alignment with external investors. Since leaving Lehman prior to its collapse exacerbated the global financial meltdown in 2008, Mr Isaacs and Mr Nagioff have enjoyed financial success through JRJ. The firm was a big shareholder in Marex, a commodities broker which listed in New York last year at a valuation of over $1.3bn. Mr Gottesman, meanwhile, has founded a string of so-called 'blank cheque' companies, most notable Nomad Holdings, which bought the frozen foods brand Birds Eye's owner in a €2.6bn deal in 2015. There have been modest signs of a revival in the London listings market in the last fortnight, with challenger bank Shawbrook Group making a strong debut this week. Princes, the tinned food producer, had a more lacklustre start to life as a publicly traded company, with its stock closing broadly flat after opening at 475p-per-share. Cash shells, or special purpose acquisition companies (SPACs), enjoyed a multiyear boom in the US, financing takeovers of companies including Sir Richard Branson's Virgin Galactic and electric vehicle manufacturers such as Lucid and Nikola. Many of the companies which went public in this way, including the DNA testing business 23andMe and British online car retailer Cazoo, subsequently went bust. A number of new SPACs have emerged in recent months amid signs of renewed investor appetite for the vehicles. None of those involved with the plan could be reached for comment on Saturday."
    },
    {
        "title": "Reform councillor defects to Tories after becoming 'uncomfortable' with party",
        "description": "A Reform UK councillor has defected to the Tories after becoming \"uncomfortable\" with Nigel Farage's party.",
        "url": "https://news.sky.com/story/reform-councillor-defects-to-tories-after-becoming-uncomfortable-with-party-13461586",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-reform-uk-rosette_7068411.jpg?20251101080911",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-01 01:27:00",
        "Headline": "James Buchan said he wanted to be able to \"look my family in the eye and say, 'that's not who I am'\" after his former party announced plans to scrap indefinite leave to remain.",
        "Content": "A Reform UK councillor has defected to the Tories after becoming \"uncomfortable\" with Nigel Farage's party. James Buchan said he wanted to be able to \"look my family in the eye and say, 'that's not who I am'\" after his former party announced plans to scrap indefinite leave to remain. The Dartford Borough councillor, who won his seat for Reform in a by-election in July, said the policy creates a \"huge amount of fear and anxiety\". He also accused the party of having \"a pretty unfortunate way of treating people\". Read more: What is indefinite leave to remain? In a statement, Mr Buchan said: \"I stood for election with the sole aim of working for my community and getting things done for local families. \"Having had the opportunity to see Reform from the inside, I've concluded that the party doesn't really have the experience or ambition to do that.\" He said \"relying on rhetoric and slogans isn't going to help real families in communities\" like his and \"the more I saw of Reform UK, the more uncomfortable I felt to be part of it\". \"Things like a proposal to remove indefinite leave to remain from all non-EU residents who are working here perfectly legally is an example that could be devastating for decent people who have built a life here and contribute to our country,\" he added. Read more from Sky News:Andrew suggested 'catch-up' with Epstein after prison releaseA 'cultural workout' could be the key to better health Earlier this year Reform announced it would axe indefinite leave to remain and replace it with new visas that would require migrants to reapply to live in the UK as part of plans to tighten immigration. Conservative council leader Jeremy Kite welcomed Mr Buchan, who represents the Stone House ward, to the party. \"James knows that getting elected isn't about power, it's about service and being supportive of people,\" he said. A Reform source told the PA news agency: \"He got elected in July 2025 as a Reform councillor. He should resign his seat but he won't because he knows he will lose under the Tory banner. \"We look forward to winning this seat back as soon as possible.\""
    },
    {
        "title": "Forget the gym - a 'cultural workout' could be the key to better health",
        "description": "Culture lovers have long believed in the healing power art. Now, science has caught up, with new research showing it has measurable benefits on the body.",
        "url": "https://news.sky.com/story/forget-the-gym-a-cultural-workout-could-be-the-key-to-better-health-13461435",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-art-health-vincent-van-gogh_7068174.jpg?20251101112654",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-11-01 00:01:00",
        "Headline": "A King's College London study involving masterpieces by artists including Manet, Van Gogh and Gauguin has shown that art immediately calms the body.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Culture lovers have long believed in the healing power art. Now, science has caught up, with new research showing it has measurable benefits on the body. A study from King's College London has found that looking at original artworks, in a gallery, doesn't just lift us emotionally - it also has a positive impact on our physical health. Fifty people aged between 18 and 40 were shown art by a selection of leading 19th-century artists: Toulouse-Lautrec, Manet, van Gogh and Gauguin. Participants viewed five paintings for three minutes each, in a 20-minute session. But while half viewed the original paintings in the Courtauld Gallery in London, the others looked at reproductions in a neutral setting. Their heart rates and skin temperature were measured with research-grade digital watches to indicate levels of interest and arousal, and saliva samples were taken with swabs before and after the session to measure stress hormones. The results in those looking at the results in the gallery were significant, and immediate: The stress hormone cortisol fell by 22% and inflammatory markers linked to health problems including heart disease, diabetes and depression were reduced by as much as 30%. \n                  Shaine March: Man who stabbed pregnant girlfriend to death after release for teen's murder jailed \n                 \n                  Elderly patients facing 'war-like' conditions in Britain's hospitals, says report\n                 \n                  Uxbridge triple stabbing: Safi Dawood appears in court charged with murder and attempted murder\n                 No change was observed in the reproduction group. Dr Tony Woods of King's College London, who was the study's lead researcher, told Sky News: \"The magnitude of the difference between being in here and looking at the real art, looking at the copies in the laboratory, the difference between the two participant groups was quite enormous.\" It's good news for the NHS, which is increasing its use of social prescribing, which can include visits to galleries. Dr Woods went on: \"The government's health strategy is all about prevention. And this is a gift to [Health Secretary] Wes Streeting. Art is very well worth investing in because of the return on investment - it will keep people out of hospitals.\" Over one and a half million people in the UK accessed social prescribing between September and August this year across the UK, and NHS England told Sky News their ambition is to make it available to every person in England. Dr Woods says the next steps of the study will be to find out how long the positive effects last, and research further into the effects of art on older participants. Russell Tovey, actor, art lover and co-host of Talk Art, chatted to Sky News about his favourite piece at the gallery - van Gogh's Self-Portrait with Bandaged Ear (1889). Tovey jokes: \"Look at this painting here. It's quite a troublesome picture, especially for me with my ears… \"But you can look at the surface and the way that he makes brushstrokes and the scale of the things and the colour he used. And you think about his life at the time and where he was living, and all those questions and answers will reveal the painting.\" Tovey adds: \"Art is intrinsic to humanity,\" and \"shows us who we are\". And now with the new findings, the hope is that gallery visits will be considered just as good as your 'five-a-day'. Tovey goes on: \"It's good for your health, it's beneficial to your mental health and to your wellbeing to be in a museum and to be around art… \"If you eat well, go to the gym and go to a regular art gallery visit, then your health will be through the roof.\" Tovey's podcast co-host, gallery owner Robert Diament, agrees: \"I think it's really important just to slow down a bit. Going to a museum or gallery can be part of your self-care routine… It will improve your life.\" Amid rising costs, reduced funding and dwindling visitor numbers, the findings could also provide a boost to galleries. Jenny Waldman, Art Fund director, told Sky News: \"These museums and galleries were set up in all cities and towns by people, you know, hundreds of years ago, who felt that it was good for people. So, this is the evidence, finally, that they were right.\" The national charity for museums and galleries, Art Fund champions art around the country, with initiatives including the National Art Pass which offers free or discounted entry to hundreds of museums, galleries and historic places around the UK. So, what do gallery visitors think of the news that their time looking at art will positively impact their wellbeing? Charlie, 10, from London said: \"It makes me feel quite calm, and it draws me in.\" His dad Patrick, who had brought Charlie with his two young brothers to see the exhibition, added: \"Looking at them on screens, or even in books, you just don't get the full impression.\" Taeseok, an arts student from Amsterdam visiting the UK for the first time, said it felt good to stand and focus on just one thing, with no distractions. He summed it up: \"Things around you start to not matter at all… It's just you and the artwork.\" Re-framed as a course of treatment instead of an indulgent pastime, could the hard edge of science change the role galleries play in society? If so, it could be a fitting reminder to the government of the true power of art, at a time when so many institutions are struggling to survive."
    }
]