[
    {
        "title": "Software issue hits thousands of Airbus planes - UK passengers warned of potential disruption",
        "description": "Airline passengers have been warned of potential travel disruption after thousands of Airbus planes were impacted by a software issue.",
        "url": "https://news.sky.com/story/software-issue-impacts-thousands-of-airbus-planes-as-uk-passengers-warned-of-potential-disruption-13476684",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-airbus-a320-airbus_7094888.jpg?20251128200229",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-28 16:37:00",
        "Headline": "The software change is affecting up to 6,000 planes after concerns were raised over the impact of intense solar radiation.",
        "Content": " Airline passengers have been warned of potential travel disruption after thousands of Airbus planes were impacted by a software issue. Airlines are racing to implement the required software update in order to return aircraft back into service and minimise disruption. In a statement, plane-maker Airbus said: \"Analysis of a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls. \"Airbus has consequently identified a significant number of A320 Family aircraft currently in-service which may be impacted.\" EasyJet, British Airways, Aer Lingus, Indigo, Lufthansa, American Airlines, Delta, Air New Zealand, Flynas and Wizz Air were all affected by the issue - although the severity of the impact varies depending on the carrier. It is understood the incident that triggered the software warning involved a JetBlue flight from Cancun, Mexico, to Newark on 30 October. That flight was diverted to Florida's Tampa International Airport after it suffered a flight control issue and experienced a sharp loss of altitude, which injured several passengers. An Airbus spokesperson told Sky News the necessary software change would affect up to 6,000 planes. The fix involves A320 aircraft reverting to an earlier software update, with planes unable to fly passengers until this has been completed, according to a bulletin to airlines. Airbus stressed that for most of the affected aircraft, the required software update would only take two to three hours. However, some aircraft would need new hardware to be able to adopt the required software and those aircraft would be affected for longer.  'Concerning' Travel expert Simon Calder said the situation was \"very concerning\" but that he had full faith in the safety procedures of Airbus and airlines. He went on to say that \"aviation remains extraordinarily safe\". However, he warned that customers may not be entitled to cash compensation if affected by delays, as the issue would be considered out of the control of airlines.  Gatwick Airport has said the software directive \"may result in some disruption\" and urged passengers to contact their airlines for more information. Airbus told Sky News that it had proactively asked the European Union Aviation Safety Agency (EASA) to issue an air worthiness directive for the affected aircraft. The company said the issue is only affecting A320s that are in service, not aircraft that are due to be delivered.  The UK Civil Aviation Authority said it was likely to mean some disruption and cancellation to flights. Transport Secretary Heidi Alexander said: \"The good news is it seems the impact on UK airlines seems limited, with a smaller number of aircraft requiring more complex software and hardware changes.\" She added that it was \"heartening this issue has been identified and will be addressed so swiftly\", saying that this demonstrated \"the high aviation safety standards globally\". Read more:Which airlines are affected by Airbus disruption?Why plane's sudden drop in altitude led to thousands needing software updates What have airlines said? In a statement, easyJet said it had \"commenced and already completed the software update on many aircraft which require them and continue to work closely with the safety authorities\". \"We plan to operate our flying programme normally on Saturday and ask that customers travelling continue to monitor their flights on flight tracker,\" it added. American Airlines said the Airbus software issue would impact 340 aircraft and it expected some operational delays. Irish carrier Aer Lingus said a limited number of aircraft were impacted and it was taking steps to complete the required software installation. It expects there will be no significant operational disruption. Wizz Air said some of its flights over the weekend may be affected, while Air India said the issue could lead to delays. Colombian airline Avianca announced that it would close ticket sales for 10 days due to the issue. British Airways told Sky News that only three of its aircraft were affected and it was not expected to disrupt its operations. Heathrow Airport is not currently expecting any disruption to its services. In October, the Airbus A320 family broke a major milestone when it overtook Boeing's 737 to become the most-delivered jetliner in history."
    },
    {
        "title": "Which airlines are affected by Airbus disruption?",
        "description": "Airbus has announced a sweeping recall requiring immediate repairs on 6,000 A320 planes, affecting more than half of the global fleet.",
        "url": "https://news.sky.com/story/which-airlines-are-affected-by-airbus-disruption-13476810",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-plane-wizzair-easyjet_7094948.jpg?20251128210113",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-28 21:25:00",
        "Headline": "The sweeping safety order affects more than half of the global A320 fleet and could cause operational disruptions as airlines implement software and hardware repairs.",
        "Content": " Airbus has announced a sweeping recall requiring immediate repairs on 6,000 A320 planes, affecting more than half of the global fleet. It appears to be one of the biggest recalls Airbus has faced in its 55-year history and comes just weeks after the A320 surpassed the Boeing 737 as the most-produced aircraft. The move was triggered by a recent incident involving an A320-family aircraft, which revealed that intense solar radiation may corrupt data critical to the functioning of flight controls. Follow the latest updates on Airbus disruption  Industry sources said roughly two-thirds of the affected aircraft will face only short groundings as airlines roll back to an earlier software version. However, hundreds of jets may also need hardware replacements, potentially leading to much longer delays. At the time Airbus issued its notice to more than 350 operators, some 3,000 A320 aircraft were flying worldwide. Here is how airlines are affected by the issue: British Airways British Airways told Sky News that only three of its aircraft were affected and the required fixes will be carried out overnight and are not expected to disrupt its operations. American Airlines The world's largest A320 operator, American Airlines, said some 340 of its 480 A320 aircraft would need the fix. The airline said it mostly expected these to be completed by Saturday with about two hours required for each plane. Delta Air Lines Delta Air Lines said it will comply with the directive and expects any operational impact on its Airbus A320 family fleet to be limited. Lufthansa German carrier Lufthansa said it has been informed of potential software issues affecting its Airbus A320-family fleet. The airline warned that a small number of flight cancellations or delays may occur over the weekend, and confirmed it is fully complying with all manufacturer and regulatory requirements, having already begun implementing the measures prescribed by Airbus. Wizz Air A Wizz Air spokesperson confirmed that some of the airline's aircraft are among those requiring a software update flagged by Airbus. The airline has already scheduled the necessary maintenance, but some flights over the weekend may be affected. EasyJet EasyJet said that following the safety directive issued to airlines operating A320 aircraft, \"we have commenced and already completed the software update on many aircraft that require it and continue to work closely with the safety authorities\". The airline added that it plans to operate flights normally on Saturday and asked customers to continue monitoring their flights. Aer Lingus Irish carrier Aer Lingus said it has a \"limited number of aircraft impacted\" and is taking \"immediate steps\" to deal with the problem. Turkish Airlines Turkish Airlines said eight A320 aircraft in its fleet will be safely returned to service after completing the required actions, and all operations continue safely and without interruption. Avianca Colombian airline Avianca said on Friday that a major Airbus A320 recall impacts over 70% of its fleet, leading to \"significant\" operational disruptions over the next 10 days. The carrier also announced it had suspended ticket sales for travel through to 8 December. Air India Air India said it is aware of an Airbus directive affecting its in-service A320-family aircraft. The airline warned that required software and hardware updates on part of its fleet could lead to longer turnaround times and delays to scheduled operations. IndiGo  India's low-cost carrier IndiGo said it is proactively completing the required updates on its A320 aircraft and warned that some flights may experience slight schedule changes. Air New Zealand Air New Zealand said it is currently affected by a global software issue impacting its Airbus aircraft. The airline warned that several flights may be disrupted, with a number of cancellations expected across the fleet. Flynas Saudi Arabian budget airline Flynas said software and technical recalibration will be carried out on part of its fleet, causing some schedule delays following the Airbus recall. United Airlines The US carrier confirmed it was not impacted by the Airbus announcement. Azul Airlines Brazil's Azul Airlines said that none of its A320 jets are affected by the Airbus recall."
    },
    {
        "title": "Why Airbus plane's sudden drop in altitude led to thousands needing software updates",
        "description": "Thousands of planes from Airbus's widely-used A320 family have been ordered for repairs following a software issue.",
        "url": "https://news.sky.com/story/why-does-solar-radiation-mean-thousands-of-airbus-planes-require-software-changes-13476813",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-airbus-a320_7094985.jpg?20251128214725",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-28 21:23:00",
        "Headline": "Airbus has ordered software updates for 6,000 of its jets - around half the global fleet - threatening travel disruption for airline passengers. But why have airlines been told to carry out a software update for the planes, and how is solar radiation involved?",
        "Content": " Thousands of planes from Airbus's widely-used A320 family have been ordered for repairs following a software issue. The aircraft manufacturer is carrying out software updates for 6,000 of its jets - around half the global fleet - threatening travel disruption for airline passengers. The UK's Civil Aviation Authority said it expects some disruptions to airlines and flights, with easyJet and Wizz Air saying they will take some planes briefly out of service to do the repairs. But why have airlines been told to carry out a software update for the planes, and how is solar radiation involved? Follow the latest updates on this story  What triggered the repair order? It is understood the incident that triggered the unexpected repair order involved a JetBlue flight from Cancun, Mexico, to Newark, New Jersey, on 30 October. The flight suffered a control problem and a sudden uncommanded drop in altitude, basically a sharp loss of height, which left 15 passengers with injuries and forced the flight to make an emergency landing in Tampa, Florida. After investigating the incident, Airbus said \"intense solar radiation\" may corrupt data critical to the functioning of flight controls. The issue is known as bit flip, where solar radiation can strike a computer's memory, changing its data from a 0 to a 1 and vice versa - a risk which also affects spacecraft. Read more: Which airlines are affected by Airbus disruption?  'Very concerning' - but 'very low likelihood' of such an event The situation was \"very concerning\", travel expert Simon Calder told Sky News presenter Gillian Joseph. However, he said there was a \"very low likelihood\" of such an event happening, adding: \"In aviation, nothing is taken for granted.\" He said: \"Aviation remains extraordinarily safe. And that is partly because as soon as a possible threat is identified, then action is taken immediately.\" What is the fix? The fix involves reverting to earlier software, but must be carried out before the planes can fly again, according to a bulletin to airlines. Airbus said for most of the affected aircraft, the required update would only take between two to three hours. However, some jets may need to have their hardware replaced to adopt the required software - a process which would take a longer time. The Airbus bulletin traced the problem to a flight system called ELAC (Elevator and Aileron Computer), which sends commands from the pilot's side-stick to elevators at the rear of the plane, Reuters reported. Those elevators control the aircraft's pitch or nose angle, determining which way it is flying. The A320 was first launched in 1984 and is the main competitor to the Boeing 737 MAX, which was grounded worldwide between March 2019 and December 2020, as well as during January 2024, after fatal crashes in 2018 and 2019 caused by faulty flight-control software."
    },
    {
        "title": "Zelenskyy will cut a lonely figure without his towering chief of staff",
        "description": "The loss of Volodymyr Zelenskyy's closest aide is a huge personal blow for the Ukrainian president, and could well weaken his authority.",
        "url": "https://news.sky.com/story/zelenskyy-will-cut-a-lonely-figure-without-his-towering-chief-of-staff-13476702",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7094730.jpg?20251128171403",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-28 16:57:00",
        "Headline": "Andrii Yermak's departure is by far the most significant from Volodymyr Zelenskyy's inner circle since Russia launched its full-scale invasion almost four years ago.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The loss of Volodymyr Zelenskyy's closest aide is a huge personal blow for the Ukrainian president, and could well weaken his authority. Andrii Yermak resigned on Friday, hours after anti-corruption officials raided his home amid a major corruption scandal that has shaken the country. Two ministers have already been forced to resign. Ukraine war latest: Kremlin says it's only negotiating with US But Yermak is by far the most significant departure from Zelenskyy's inner circle since Russia launched its full-scale invasion almost four years ago. The dramatic move could not have come at a worse time for Ukraine, which is under daily Russian bombardment as well as increased American pressure to strike a deal with Moscow to end the war. At a time when he needs to be stronger than ever, Zelenskyy will instead cut a lonely figure without his towering chief of staff, who has been by his side since he ran for president in 2019 and has been a hugely influential confidant ever since the first Russian missiles targeted Kyiv on 24 February 2022. Yermak, despite being an unelected figure, has wielded tremendous power, including over ministerial and military appointments and over who had access to the president. He was also appointed lead negotiator in peace talks, most recently representing Ukraine in Geneva alongside the US secretary of state Marco Rubio. But critics have long been wary about his elevated wartime status, with Yermak effectively the second most powerful person in the country after Zelenskyy. Read more:British passenger missing after falling from cruise shipAlleged mercenary arrested over Albanian gang boss kidnap plot Aide risked tarnishing president It meant questions were immediately raised about what he may or may not have known when it emerged earlier this month that Ukraine's two main anti-corruption agencies had uncovered a plot to control contracts at the state atomic energy agency worth around $100m (£76m) in kickbacks and laundered money. It is not yet clear what investigators were looking for when they raided Yermak's home, and he has said he was cooperating fully. He has not been charged with any crime or named as a suspect. However, anti-corruption activists were quick to demand he leave his job or else risk tarnishing Zelenskyy's reputation in the scandal as well."
    },
    {
        "title": "Trump says he will cancel all Biden executive orders 'signed with autopen'",
        "description": "Donald Trump has said he will cancel all executive orders that he claims were signed with an autopen by his predecessor Joe Biden.",
        "url": "https://news.sky.com/story/trump-says-he-will-cancel-all-biden-executive-orders-signed-with-autopen-13476770",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-joe-biden-donald-trump_6792886.jpg?20250106151645",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-28 19:50:00",
        "Headline": "The US president claimed Joe Biden was \"not involved\" in signing the orders, without providing any evidence for his claims.",
        "Content": "Donald Trump has said he will cancel all executive orders that he claims were signed with an autopen by his predecessor Joe Biden. The US president alleged Mr Biden was \"not involved\" in signing the orders and claimed \"the radical left lunatics circling Biden around the beautiful Resolute Desk in the Oval Office took the presidency away from him\". He did not provide any evidence for his claims. An autopen is a device which reproduces a person's signature, allowing them to repeatedly sign documents without having to do so by hand each time. In a post on his Truth Social platform, he said: \"Any document signed by Sleepy Joe Biden with the Autopen, which was approximately 92% of them, is hereby terminated, and of no further force or effect. \"The Autopen is not allowed to be used if approval is not specifically given by the President of the United States.\" He added: \"I am hereby cancelling all Executive Orders, and anything else that was not directly signed by Crooked Joe Biden, because the people who operated the Autopen did so illegally. \"Joe Biden was not involved in the Autopen process and, if he says he was, he will be brought up on charges of perjury.\" Read more from Sky News:Trump: Land ops against Venezuela starting 'very soon'US to review immigration from 19 countries after shooting Mr Trump has repeatedly claimed Mr Biden was not mentally capable by the end of his term and his staff made decisions on his behalf, using an autopen to sign them off without his knowledge. Mr Trump has not provided any evidence for his claims, while Mr Biden and his former aides have denied they made decisions on his behalf. In June, Mr Biden said: \"Let me be clear: I made the decisions during my presidency. \"I made the decisions about the pardons, executive orders, legislation, and proclamations. Any suggestion that I didn't is ridiculous and false.\" Mr Trump has also used an autopen, but claimed he only used it \"for very unimportant papers\".  Earlier this year, Mr Trump replaced a portrait of Mr Biden in the Oval Office with a picture of an autopen signing the former president's name."
    },
    {
        "title": "Budget 2025: Reeves accused of deliberately making UK finances look worse",
        "description": "Rachel Reeves has been accused of making the country's economic situation appear in a worse state than it really was ahead of the budget.",
        "url": "https://news.sky.com/story/budget-2025-reeves-accused-of-deliberately-making-uk-finances-look-worse-13476622",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092465.jpg?20251126123700",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-28 15:08:00",
        "Headline": "Tories claim the chancellor misled the country when she warned she would have to make tough choices due to dire economic circumstances. Letter reveals the OBR had already told her she was running a surplus.",
        "Content": "Rachel Reeves has been accused of making the country's economic situation appear in a worse state than it really was ahead of the budget. A letter from the Office for Budget Responsibility (OBR), published on Friday, revealed it told the chancellor as early as 17 September that prevailing economic winds meant the £20bn gap in meeting her self-imposed fiscal rule of not borrowing for day-to-day spending would actually be much smaller. Later, in October, it informed her that the spending gap had closed altogether and the government would be running a surplus. Wednesday's budget, which increased taxes by more than £26bn, followed weeks of dire warnings from Ms Reeves that she would have to make \"hard choices\" to meet her tax and spending commitments. This included an early morning news conference on 4 November, after the OBR told her the spending gap had closed, when she suggested she was likely to have to break a manifesto promise and raise income tax rates to secure the UK's economic future. Ms Reeves did not end up increasing income tax rates in the budget. But the chancellor did extend the freeze on income tax thresholds, in a move that her critics have described as a stealth tax. Conservative leader Kemi Badenoch said the letter showed Ms Reeves had \"lied to the public\" and should be sacked. \n                  The future of the OBR with Ed Conway \n                 \n                  Politics latest: Rachel Reeves accused of misleading voters over reason for tax rises\n                 \n                  PM's rap battle with Sky's Beth Rigby goes viral - and one of the AI satirists behind it explains why\n                 But Downing Street denied she had misled the public and the markets in the run-up to the budget. \"I don't accept that,\" the prime minister's spokesman said. \"As she set out in the speech that she gave here (Downing Street), she talked about the challenges the country was facing and she set out her decisions incredibly clearly at the budget.\" Read more:How much is the mansion tax and who will have to pay it?The main budget announcementsChancellor has backloaded the worst of the budget - and it's a gamble  The idea of a hike in income tax rates was dropped on 13 November after several weeks of being trailed, as the Treasury cited better than expected forecasts. But the OBR suggested it had provided ministers with no new forecasting in November. \"No changes were made to our pre-measures forecast after October 31,\" the fiscal watchdog's letter to the Treasury Select Committee said. Read more:4 November: Reeves refuses to rule out manifesto-breaking tax hikes11 November: Reeves signals she will break tax pledges  Ben Zaranko, an economist for the Institute for Fiscal Studies, queried the rationale behind the negative briefings ahead of the budget. \"At no point in the process did the OBR have the government missing its fiscal rules by a large margin. Leaves me baffled by the months of speculation and briefing,\" he wrote on X. \"Was the plan to lead everyone to expect a big income tax rise, then surprise them on the day by not doing it?\" Ms Badenoch said: \"Yet more evidence, as if we needed it, that the chancellor must be sacked. For months Reeves has lied to the public to justify record tax hikes to pay for more welfare. \"Her budget wasn't about stability. It was about politics: bribing Labour MPs to save her own skin. Shameful.\" Ms Reeves' Tory counterpart, shadow chancellor Sir Mel Stride said the downbeat briefings were \"all a smokescreen\". \"Labour knew all along that they did not need to raise taxes and break their promises,\" he said. \"It was an active choice to do so, to fund a huge increase in welfare spending. The OBR have now made that very clear. \"It appears the country has been deliberately misled.\""
    },
    {
        "title": "Man jailed for murder of family friend in act of 'unimaginable depravity'",
        "description": "A man who murdered a family friend in her sleep before committing sexual offences on her body in an act of \"unimaginable depravity\" has been jailed for at least 26 years.",
        "url": "https://news.sky.com/story/man-jailed-for-murder-of-family-friend-in-act-of-unimaginable-depravity-13476730",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ernestas-juska-maidstone_7094541.jpg?20251128140326",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-28 18:06:00",
        "Headline": "Ernestas Juska, 21, had taken cocaine and consumed alcohol before the killing of his mother's 39-year-old friend, Nina Denisova",
        "Content": "A man who murdered a family friend in her sleep before committing sexual offences on her body in an act of \"unimaginable depravity\" has been jailed for at least 26 years. Warning: Readers may find this content distressing  Ernestas Juska, 21, murdered his mother's friend, Nina Denisova, 39, while she slept in a spare bedroom at his mother's house in Dartford, Kent, in August 2024. He then left the family home and walked to a nearby bus stop, where he asked a member of the public to call police as he had just killed someone. On Friday, Maidstone Crown Court heard how medical experts found Juska's consumption of violent pornography had an \"extreme impact\" on him. Mr Justice Dexter Dias KC said it \"cannot be a coincidence\" that the defendant wanted to \"try\" having sex with a corpse after consuming pornography which included dead bodies, rape and bestiality. He imposed a life sentence with a minimum term of 26 years on Juska - minus the time he has already spent on remand. In sentencing, Mr Justice Dias said: \"I have no doubt that the last moments of Nina Denisova's life were lived in extreme, unexpected and undeserved horror.\" Juska had spent the evening socialising with his mother and some family friends, including Ms Denisova, at their home, the court heard. He had taken some cocaine and consumed alcohol when his mother started to criticise him for being unemployed and Ms Denisova had gone to bed. Mr Justice Dias said: \"He decided he wanted to kill someone, he thought through his options, he did not want to kill his mother or sister, and he knew Ms Denisova was in the house and asleep.\" Between 5.30am and 6am, Juska took the \"biggest knife he could find\" in the kitchen and went upstairs to Ms Denisova's room, the prosecution said. \"He stabbed her in the neck, she did not die, and she began to struggle, he put his hands over her mouth, he then stabbed her through both eyes,\" said Danny Moore KC, prosecuting. He then stabbed her in the belly and in the chest and later told police he \"didn't feel anything\" when he attacked for the last time. Juska received a two-year concurrent sentence for sexual penetration of a corpse. Read more:Teenagers accused of attempted rape have charges withdrawnWhy did Ballymena become the latest site of anti-immigration riots? Ms Denisova arrived in the UK from Lithuania in 2006, and in a statement read to court, her brother described her as a \"very calm and positive person,\" who loved giving gifts. \"We can never forgive him for what he's done, and we will never be able to understand why he did what he did that sad day,\" her brother wrote. He and Ms Denisova's father were in court for the two-day sentencing. Mr Justice Dias said: \"I agree with the assessment of the Kent Police. This was a murder involving acts of almost unimaginable depravity.\""
    },
    {
        "title": "The chilling aspects of video showing Israeli forces killing two Palestinians after apparent surrender",
        "description": "There are so many chilling aspects to the video from Jenin.",
        "url": "https://news.sky.com/story/the-many-chilling-aspects-of-video-showing-israeli-forces-killing-two-palestinians-after-apparent-surrender-13476725",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-west-bank-shooting_7094124.jpg?20251128011820",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-28 17:52:00",
        "Headline": "There will be an investigation into these killings, and the Israeli military insists it is transparent. But for those expecting accountability and independent investigation, the precedents are not encouraging.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  There are so many chilling aspects to the video from Jenin. The men being shot, calmly and precisely, from close range after appearing to surrender; the digger being used to bring down part of the building on top of their bodies. The total lack of shock among the soldiers - at least six of them - who were involved. But perhaps the most troubling is the realisation that we only know about this because someone filmed it. Otherwise, this might well have gone down as a military operation where two people - invariably referred to as \"terrorists\" - were killed. Within Jenin, to the north of the occupied West Bank, everyone has heard of this video. Farha Abu Alheja tells me that she was \"angry and frustrated\" after seeing the footage.  \"They were killed in cold blood,\" she says. \"They could have just arrested them, not executed them. It's a heinous crime. As a Palestinian woman, and mother, my heart goes out. I can't imagine how their mothers are feeling.\" Farha reflects a blend of hopelessness and helplessness: \"We have no international protection. I feel that we Palestinians don't mean anything to the rest of the world. \"This is not the first time this has happened, but nobody does anything. We have no life in Jenin - we live in a state of fear and tension. \"You leave home and you don't know if the Israelis will have demolished it when you come back. They don't need an excuse to do anything.\" There will be an investigation into these killings, and the Israeli military insists it is transparent. The IDF's spokesperson, Lt Col Nadav Shoshani, admitted that shots had been \"directed toward\" the two men as they \"exited\" a building (even though the footage shows them going back into it, at the behest of soldiers). He added: \"The incident is under review by the commanders on the ground, and will be transferred to the relevant professional bodies.\" But for those expecting accountability and independent investigation, the precedents are not encouraging. Between 2018 and 2022, the last years for which data are available, there were 219 court cases launched into allegations of Palestinians being killed, illegally, by Israeli soldiers on the West Bank. Of these, 112 were deemed to be unworthy of investigation. Of the remaining 107, it was decided that 106 did not merit an indictment. In the single case where a soldier was indicted, he was convicted of killing a Palestinian after opening fire at the scene of a traffic accident. His punishment was three months of community service. Over the course of many years, Jenin has been the crucible of so much tension and violence - the scene of endless clashes between Palestinians and Israeli forces. According to the Oslo Accords of 30 years ago, it is under Palestinian control, but the Israeli military routinely go there to exert control, demolish buildings and arrest people. They claim they are thwarting terrorism; others see it as a form of creeping annexation. Read more:Impossible to imagine people living here - yet some doControversial Gaza aid operation to close down Tensions are always high there. But now, with Palestinians affected by the twin spectres of Gaza's destruction and a wave of violence carried out by settlers in the West Bank, the anxiety is thick in the air. And it is stirred by the unapologetic response of plenty in Israel. More than 60% of Israeli Jews oppose investigations being carried out into soldiers accused of abusing Palestinians. Itamar Ben-Gvir, the minister in charge of national security, is unstinting in his praise of the military and his fury at the idea that soldiers should be investigated. In the wake of these killings, he doubled down, saying that Israelis needed to \"stop this distorted procedure\" of questioning soldiers. \"We are fighting enemies and murderers who want to rape women and burn babies,\" he said. This is the backdrop to the killing of these two men. The footage seems clear - the shots fired calmly and deliberately. The question is how this could have happened - why was this allowed? But many in Israel don't want the question to be asked, and nor do they want to know the answers."
    },
    {
        "title": "Black Sheep brewer on brink of calling last orders",
        "description": "The brewery group behind brands such as Black Sheep, Hofmeister and Fourpure is on the brink of collapse as it grapples with a lethal cocktail of surging costs and waning consumer confidence in the run-up to this week's budget.",
        "url": "https://news.sky.com/story/black-sheep-brewer-on-brink-of-calling-last-orders-13476434",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-black-sheep_6142048.jpg?20230503105738",
        "type": "Home",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-28 09:56:00",
        "Headline": "Keystone Brewing Group, which also counts Fourpure and Hofmeister among its portfolio, is lining up FRP Advisory as administrator as it races to secure a restructuring or sale, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The brewery group behind brands such as Black Sheep, Hofmeister and Fourpure is on the brink of collapse as it grapples with a lethal cocktail of surging costs and waning consumer confidence in the run-up to this week's budget. Sky News has learnt that Keystone Brewing Group, which also owns Purity Brewing Company and distributes a range of other brands, has filed a notice of intention to appoint administrators to give the company time to orchestrate a restructuring or sale. Keystone employs roughly 190 people at breweries across the country. It owns a number of brands outright, while others - including Hofmeister, the well-known Bavarian lager - are the subject of exclusive sales and distribution partnerships. Some of the beers in the Keystone stable are among the best-known in Britain, with Black Sheep having been founded in 1992 by a member of the Theakston brewing family. Black Sheep previously fell into administration in 2023, before being rescued by its current owner. The notice of intention to appoint FRP Advisory as administrators to Keystone is understood to have been made amid pressure from a number of the company's trade creditors. Industry sources said that Keystone had seen a slump in sales this month amid dwindling confidence from key trade customers and consumers ahead of Rachel Reeves's budget earlier this week. Read more from Sky News:Anglo American faces bloody nose over exec payoutsWTW in talks to buy NatWest pensions unit CushonNew £10bn 'landmark tower' could be built in London One brewing executive said the persistent drip-feed of speculation about tax hikes - some of which failed to materialise in the chancellor's speech - had prompted trade customers to rein in orders and consumers to reduce spending in the last few weeks. Keystone is run by industry veteran Steve Cox, who joined earlier this year with a brief to hit a £100m annual sales target by 2028. The company is backed by Breal, an investment firm which has poured millions of pounds of investment into the brewery sector in recent years, including rescue deals for a number of struggling businesses. Breal could not be reached for comment."
    },
    {
        "title": "Software issue hits thousands of Airbus planes - UK passengers warned of potential disruption",
        "description": "Airline passengers have been warned of potential travel disruption after thousands of Airbus planes were impacted by a software issue.",
        "url": "https://news.sky.com/story/software-issue-impacts-thousands-of-airbus-planes-as-uk-passengers-warned-of-potential-disruption-13476684",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-airbus-a320-airbus_7094888.jpg?20251128200229",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 16:37:00",
        "Headline": "The software change is affecting up to 6,000 planes after concerns were raised over the impact of intense solar radiation.",
        "Content": " Airline passengers have been warned of potential travel disruption after thousands of Airbus planes were impacted by a software issue. Airlines are racing to implement the required software update in order to return aircraft back into service and minimise disruption. In a statement, plane-maker Airbus said: \"Analysis of a recent event involving an A320 Family aircraft has revealed that intense solar radiation may corrupt data critical to the functioning of flight controls. \"Airbus has consequently identified a significant number of A320 Family aircraft currently in-service which may be impacted.\" EasyJet, British Airways, Aer Lingus, Indigo, Lufthansa, American Airlines, Delta, Air New Zealand, Flynas and Wizz Air were all affected by the issue - although the severity of the impact varies depending on the carrier. It is understood the incident that triggered the software warning involved a JetBlue flight from Cancun, Mexico, to Newark on 30 October. That flight was diverted to Florida's Tampa International Airport after it suffered a flight control issue and experienced a sharp loss of altitude, which injured several passengers. An Airbus spokesperson told Sky News the necessary software change would affect up to 6,000 planes. The fix involves A320 aircraft reverting to an earlier software update, with planes unable to fly passengers until this has been completed, according to a bulletin to airlines. Airbus stressed that for most of the affected aircraft, the required software update would only take two to three hours. However, some aircraft would need new hardware to be able to adopt the required software and those aircraft would be affected for longer.  'Concerning' Travel expert Simon Calder said the situation was \"very concerning\" but that he had full faith in the safety procedures of Airbus and airlines. He went on to say that \"aviation remains extraordinarily safe\". However, he warned that customers may not be entitled to cash compensation if affected by delays, as the issue would be considered out of the control of airlines.  Gatwick Airport has said the software directive \"may result in some disruption\" and urged passengers to contact their airlines for more information. Airbus told Sky News that it had proactively asked the European Union Aviation Safety Agency (EASA) to issue an air worthiness directive for the affected aircraft. The company said the issue is only affecting A320s that are in service, not aircraft that are due to be delivered.  The UK Civil Aviation Authority said it was likely to mean some disruption and cancellation to flights. Transport Secretary Heidi Alexander said: \"The good news is it seems the impact on UK airlines seems limited, with a smaller number of aircraft requiring more complex software and hardware changes.\" She added that it was \"heartening this issue has been identified and will be addressed so swiftly\", saying that this demonstrated \"the high aviation safety standards globally\". Read more:Which airlines are affected by Airbus disruption?Why plane's sudden drop in altitude led to thousands needing software updates What have airlines said? In a statement, easyJet said it had \"commenced and already completed the software update on many aircraft which require them and continue to work closely with the safety authorities\". \"We plan to operate our flying programme normally on Saturday and ask that customers travelling continue to monitor their flights on flight tracker,\" it added. American Airlines said the Airbus software issue would impact 340 aircraft and it expected some operational delays. Irish carrier Aer Lingus said a limited number of aircraft were impacted and it was taking steps to complete the required software installation. It expects there will be no significant operational disruption. Wizz Air said some of its flights over the weekend may be affected, while Air India said the issue could lead to delays. Colombian airline Avianca announced that it would close ticket sales for 10 days due to the issue. British Airways told Sky News that only three of its aircraft were affected and it was not expected to disrupt its operations. Heathrow Airport is not currently expecting any disruption to its services. In October, the Airbus A320 family broke a major milestone when it overtook Boeing's 737 to become the most-delivered jetliner in history."
    },
    {
        "title": "Why Airbus plane's sudden drop in altitude led to thousands needing software updates",
        "description": "Thousands of planes from Airbus's widely-used A320 family have been ordered for repairs following a software issue.",
        "url": "https://news.sky.com/story/why-does-solar-radiation-mean-thousands-of-airbus-planes-require-software-changes-13476813",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-airbus-a320_7094985.jpg?20251128214725",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 21:23:00",
        "Headline": "Airbus has ordered software updates for 6,000 of its jets - around half the global fleet - threatening travel disruption for airline passengers. But why have airlines been told to carry out a software update for the planes, and how is solar radiation involved?",
        "Content": " Thousands of planes from Airbus's widely-used A320 family have been ordered for repairs following a software issue. The aircraft manufacturer is carrying out software updates for 6,000 of its jets - around half the global fleet - threatening travel disruption for airline passengers. The UK's Civil Aviation Authority said it expects some disruptions to airlines and flights, with easyJet and Wizz Air saying they will take some planes briefly out of service to do the repairs. But why have airlines been told to carry out a software update for the planes, and how is solar radiation involved? Follow the latest updates on this story  What triggered the repair order? It is understood the incident that triggered the unexpected repair order involved a JetBlue flight from Cancun, Mexico, to Newark, New Jersey, on 30 October. The flight suffered a control problem and a sudden uncommanded drop in altitude, basically a sharp loss of height, which left 15 passengers with injuries and forced the flight to make an emergency landing in Tampa, Florida. After investigating the incident, Airbus said \"intense solar radiation\" may corrupt data critical to the functioning of flight controls. The issue is known as bit flip, where solar radiation can strike a computer's memory, changing its data from a 0 to a 1 and vice versa - a risk which also affects spacecraft. Read more: Which airlines are affected by Airbus disruption?  'Very concerning' - but 'very low likelihood' of such an event The situation was \"very concerning\", travel expert Simon Calder told Sky News presenter Gillian Joseph. However, he said there was a \"very low likelihood\" of such an event happening, adding: \"In aviation, nothing is taken for granted.\" He said: \"Aviation remains extraordinarily safe. And that is partly because as soon as a possible threat is identified, then action is taken immediately.\" What is the fix? The fix involves reverting to earlier software, but must be carried out before the planes can fly again, according to a bulletin to airlines. Airbus said for most of the affected aircraft, the required update would only take between two to three hours. However, some jets may need to have their hardware replaced to adopt the required software - a process which would take a longer time. The Airbus bulletin traced the problem to a flight system called ELAC (Elevator and Aileron Computer), which sends commands from the pilot's side-stick to elevators at the rear of the plane, Reuters reported. Those elevators control the aircraft's pitch or nose angle, determining which way it is flying. The A320 was first launched in 1984 and is the main competitor to the Boeing 737 MAX, which was grounded worldwide between March 2019 and December 2020, as well as during January 2024, after fatal crashes in 2018 and 2019 caused by faulty flight-control software."
    },
    {
        "title": "Man jailed for murder of family friend in act of 'unimaginable depravity'",
        "description": "A man who murdered a family friend in her sleep before committing sexual offences on her body in an act of \"unimaginable depravity\" has been jailed for at least 26 years.",
        "url": "https://news.sky.com/story/man-jailed-for-murder-of-family-friend-in-act-of-unimaginable-depravity-13476730",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ernestas-juska-maidstone_7094541.jpg?20251128140326",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 18:06:00",
        "Headline": "Ernestas Juska, 21, had taken cocaine and consumed alcohol before the killing of his mother's 39-year-old friend, Nina Denisova",
        "Content": "A man who murdered a family friend in her sleep before committing sexual offences on her body in an act of \"unimaginable depravity\" has been jailed for at least 26 years. Warning: Readers may find this content distressing  Ernestas Juska, 21, murdered his mother's friend, Nina Denisova, 39, while she slept in a spare bedroom at his mother's house in Dartford, Kent, in August 2024. He then left the family home and walked to a nearby bus stop, where he asked a member of the public to call police as he had just killed someone. On Friday, Maidstone Crown Court heard how medical experts found Juska's consumption of violent pornography had an \"extreme impact\" on him. Mr Justice Dexter Dias KC said it \"cannot be a coincidence\" that the defendant wanted to \"try\" having sex with a corpse after consuming pornography which included dead bodies, rape and bestiality. He imposed a life sentence with a minimum term of 26 years on Juska - minus the time he has already spent on remand. In sentencing, Mr Justice Dias said: \"I have no doubt that the last moments of Nina Denisova's life were lived in extreme, unexpected and undeserved horror.\" Juska had spent the evening socialising with his mother and some family friends, including Ms Denisova, at their home, the court heard. He had taken some cocaine and consumed alcohol when his mother started to criticise him for being unemployed and Ms Denisova had gone to bed. Mr Justice Dias said: \"He decided he wanted to kill someone, he thought through his options, he did not want to kill his mother or sister, and he knew Ms Denisova was in the house and asleep.\" Between 5.30am and 6am, Juska took the \"biggest knife he could find\" in the kitchen and went upstairs to Ms Denisova's room, the prosecution said. \"He stabbed her in the neck, she did not die, and she began to struggle, he put his hands over her mouth, he then stabbed her through both eyes,\" said Danny Moore KC, prosecuting. He then stabbed her in the belly and in the chest and later told police he \"didn't feel anything\" when he attacked for the last time. Juska received a two-year concurrent sentence for sexual penetration of a corpse. Read more:Teenagers accused of attempted rape have charges withdrawnWhy did Ballymena become the latest site of anti-immigration riots? Ms Denisova arrived in the UK from Lithuania in 2006, and in a statement read to court, her brother described her as a \"very calm and positive person,\" who loved giving gifts. \"We can never forgive him for what he's done, and we will never be able to understand why he did what he did that sad day,\" her brother wrote. He and Ms Denisova's father were in court for the two-day sentencing. Mr Justice Dias said: \"I agree with the assessment of the Kent Police. This was a murder involving acts of almost unimaginable depravity.\""
    },
    {
        "title": "Famous names affected by prostate cancer criticise NHS screening decision",
        "description": "Famous names affected by prostate cancer have spoken of their disappointment after&#160;mass screening for the illness was not recommended for use on the NHS.",
        "url": "https://news.sky.com/story/national-prostate-cancer-screening-not-recommended-on-nhs-13476471",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-david-cameron-dermot-murnaghan_7094664.jpg?20251128155348",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 10:27:00",
        "Headline": "The National Screening Committee (NSC) has told the government that screening is \"likely to cause more harm than good\".",
        "Content": " Famous names affected by prostate cancer have spoken of their disappointment after mass screening for the illness was not recommended for use on the NHS. The National Screening Committee (NSC), comprised of doctors and economists, told the government that screening is \"likely to cause more harm than good\". Its decision means the NHS is unlikely to offer mass screening for men over the age of 45. Six-time Olympic gold-medallist Sir Chris Hoy, former Prime Minister David Cameron, Sir Stephen Fry, actor and author Tony Robinson and journalist Dermot Murnaghan, who have all been diagnosed with the disease, spoke out after today's decision. In a draft recommendation, the committee said the reason it was \"not recommending whole population screening using the prostate specific antigen (PSA) test was that it was likely to cause more harm than good\". Instead, it proposes a targeted screening programme every two years for men with specific genetic mutations, known as BRCA-1 and BRCA-2, between the ages of 45 and 61. But Sir Chris, who confirmed last year that his prostate cancer diagnosis was terminal, with doctors giving him two to four years to live, criticised the move. The former Team GB cyclist, who confirmed in February 2024 that he was undergoing treatment, said: \"I am extremely disappointed and saddened by the recommendation announced by the National Screening Committee today to rule against national screening for men at high risk of prostate cancer. \"More than 12,000 men are dying of prostate cancer every year; it is now the UK's most common cancer in men, with black men at double the risk, along with men with a family history, like myself. \"While introducing regular checks for men carrying the BRCA genes is a very small step forward, it is not enough. I know, first hand, that by sharing my story following my own diagnosis two years ago, many, many lives have been saved. \"Early screening and diagnosis saves lives. I am determined to continue to use my platform to raise awareness, encourage open discussion, raise vital funds for further research and support, and to campaign for change.\" His views were echoed by Lord Cameron, who this month announced he was treated for prostate cancer last year. Lord Cameron said in a post on X: \"I am disappointed by today's recommendation on prostate cancer screening from the National Committee. \"Targeted screening is a natural first step - but the recommendation today is far too targeted, not including black men or men with a family history, both high-risk groups. \"Prostate cancer is the most common cancer among British men. We are letting down too many men if we don't push for a wider screening programme that includes all high-risk groups - and not just the men involved, but their families too, who risk losing a loved one unnecessarily. As I know all too well, prostate cancer can be symptomless early on. \"That's why screening is so essential - catching the cancers early when they can be more effectively and successfully treated, like in my own case.\" Sir Tony, journalist Mr Murnaghan and retired footballer Les Ferdinand also voiced their disappointment after the decision. Sir Tony, 79, who starred as Baldrick in Blackadder, said: \"I'm bitterly disappointed. Getting an early diagnosis for prostate cancer could save your life, but we still have no screening programme for it in the UK. \"I was lucky I found my cancer early, but nearly 10,000 men a year are diagnosed too late for a cure, and that's just not right.\"  Broadcaster Mr Murnaghan, 67, added: \"With prostate cancer cases higher than they've ever been, and the disease dominating the national conversation, I really thought we were heading to an exciting moment here. \"I'm so disappointed that the committee has decided not to recommend screening - it felt about time progress was made for men.\" He added in a statement shared with Sky News: \"An acceptable halfway house, would perhaps be to extend screening to black men - and those with a known history of cancer in their family. But clearly a full nationwide screening programme would be best.\" Sir Stephen, who is a Prostate Cancer Research ambassador who revealed in 2018 he had undergone surgery after being diagnosed with the disease, said: \"I'm deeply disappointed by today's news. Men in the UK deserve so much better. Prostate cancer remains the second biggest cancer killer of men in this country, with more than 12,000 dying every year. \"The only way we will make a dent in that appalling statistic is by catching prostate cancer early, before symptoms appear - and the best way to do that is through a screening programme. I hope the country sees sense.\" Mr Ferdinand, whose grandfather died from prostate cancer, added: \"I've seen members of my family survive prostate cancer, because their cancer was found in time. \"Without a national screening programme, the responsibility to find prostate cancer early and in time for a cure rests entirely on men's shoulders, and it shouldn't be this way. \"Black men are at double the risk of prostate cancer and twice as likely to die, and something has to be done.\"  Colin McFarlane, an actor who was diagnosed with prostate cancer in 2023, told Sky News presenter Jonathan Samuels the decision was a \"massive mistake\". \"I've been diagnosed with prostate cancer, but I'm not having any treatment. I have something called active surveillance, so every three months I have a PSA blood test, and then once a year I have an MRI,\" he said. McFarlane said black men over the age of 45 are at high risk, and \"should be invited for screening\". He added: \"I personally think men over 50 should be invited for screening, because they're also at risk. I'm concerned now for all the black men out there who are high risk.\" NSC added it did not recommend extensive screening for black men due to a current lack of evidence and data. The committee also does not recommend targeted screening for men with a family history of the disease, who are also at a higher risk of prostate cancer. Health Secretary Wes Streeting said he would consider the findings ahead of March's final decision, adding that he wanted to see earlier diagnosis and quicker treatment, but that needed to be balanced against \"the harms that wider screening could cause to men\". Professor Sir Mike Richards, a former national cancer director and chairman of the NSC, told a briefing that modelling on PSA shows \"whole population screening may lead to a small reduction in prostate cancer deaths, but the very high levels of overdiagnoses\" means the harms outweigh the benefits. Experts are also waiting to see data from a large trial launched by Prostate Cancer UK last week into whether combining PSA with other tests, such as rapid MRI scans, may lead to recommending population-wide screening. Read more from Sky News:Why prostate cancer is expected to be left without national screeningScotland to roll out 'simple' genetic test The trial is looking at the most promising screening techniques available, including PSA blood tests, genetic tests and 10-minute MRI scans, and whether they can be combined for a national screening programme. The results will be ready within two years, it is hoped. Mr Streeting added: \"In the meantime, we will keep making progress on cutting cancer waiting times and investing in research into prostate cancer detection - in the last 12 months, 193,000 more patients received a diagnosis for suspected cancer on time. \"We are also providing funding to the £42m TRANSFORM trial, which has the potential to revolutionise prostate cancer screening, cutting out harmful side effects and making screening far more accurate.\""
    },
    {
        "title": "UK weather: Yellow warning issued for heavy rain across large swathes of England",
        "description": "A yellow weather warning for rain has been issued across parts of the UK, covering the weekend and extending into early next week.",
        "url": "https://news.sky.com/story/yellow-weather-warning-issued-for-heavy-rain-13476612",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-weather-rain_7094833.jpg?20251128185724",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 14:49:00",
        "Headline": "Forecasters say a developing area of low pressure will move across southern and central parts of the UK on Saturday, bringing \"bands of heavy rain and gusty winds\", particularly across Wales, the Midlands and southern England.",
        "Content": "A yellow weather warning for rain has been issued across parts of the UK, covering the weekend and extending into early next week. Heavy rain could cause travel disruption, difficult driving conditions and possibly impact outdoor plans, the Met Office is warning. Forecasters said a developing area of low pressure would move across southern and central parts of the UK on Saturday, bringing \"bands of heavy rain and gusty winds\", particularly across Wales, the Midlands and southern England. Check the weather forecast where you are As much as 50mm of rain is possible in some places, with the potential for 20-30mm to fall across England and Wales. There is a low chance of between 60-80mm of rain falling on high ground. Jason Kelly, chief meteorologist at the Met Office, said: \"While the exact track of the low remains uncertain at this time, there is a clear signal for strong winds and periods of heavy rain, which could lead to surface water flooding and delays to road and rail travel. \"Rain will also push into northeast England during Saturday, some of which could fall as snow over higher ground when the system meets colder air coming down from the north. \"Sunday will be drier and brighter, albeit colder, for many areas with blustery winds lingering near some North Sea coasts. Expect widespread frost overnight into Monday before the next weather system approaches.\" Read more from Sky News:National prostate cancer screening not recommended on NHSBritish passenger missing after falling from cruise ship Fresh Atlantic system to bring more rain Another Atlantic system will sweep in from the South West at the end of the weekend, the Met Office said. It is expected to bring further rain, with the heaviest rainfall likely over parts of south and southwest England and South Wales. The Met Office said there will also be strong winds, with gusts reaching gale force along exposed coasts. \"Yellow warnings for rain have been issued and we are closely monitoring developments. Forecasts will be updated as the situation evolves,\" a spokesperson said. There is a chance homes and businesses could be flooded, with a small chance some communities will become cut off by flooded roads, the forecaster added. It estimated the chance of power cuts and loss of other services to some homes and businesses was \"slight\". Next week, the weather is expected to remain changeable, with occasional dry spells. Homes across Scotland left without power It comes after homes across Scotland were left without power following severe gales overnight. The Met Office had issued a yellow weather warning for wind, covering Orkney, Shetland and western parts of the Highlands and Argyll and Bute, which expired at 11am on Friday. Scottish and Southern Electricity Networks said gusts reached 83mph on the Western Isles and 75mph on the Isle of Mull. A spokesperson said around 1,000 homes on the Isle of Mull were without power by mid-morning on Friday, but most have since been restored."
    },
    {
        "title": "Delivery driver who killed girl, 7, in head-on crash in Lincolnshire jailed for six years",
        "description": "A delivery driver who killed a seven-year-old girl in a head-on crash during a dangerous overtake manoeuvre in Lincolnshire has been jailed for six years.",
        "url": "https://news.sky.com/story/delivery-driver-who-killed-girl-7-in-head-on-crash-in-lincolnshire-jailed-for-six-years-13476653",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-lincoln-police-metheringham-heath-lane_7094604.jpg?20251128145304",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 15:48:00",
        "Headline": "Veselin Dudenski, 39, admitted causing death by dangerous driving after his van hit a family car with seven-year-old Elsie Gascoigne in the passenger seat after her dad had taken her shopping.",
        "Content": "A delivery driver who killed a seven-year-old girl in a head-on crash during a dangerous overtake manoeuvre in Lincolnshire has been jailed for six years. Veselin Dudenski, 39, was out delivering parcels when his white Citroen Relay van struck a blue Kia Rio carrying Elsie Gascoigne in the back seat. The incident happened in Metheringham Heath Lane, Nocton, on the evening of 3 January this year. Elsie died the next day in hospital.  Her father, who was driving the car and had taken her shopping and to McDonald's before the crash, suffered fractures to his breast bone, lower back and arm, including a \"major injury with significant long-term implications\". The defendant, a professional van and lorry driver for 17 years, was banned from driving for eight years during Friday's sentencing at Lincoln Crown Court. Dudenski, who the court heard has a young child, is likely to face automatic deportation as he is a foreign national. He pleaded guilty at an earlier hearing to causing death by dangerous driving and causing serious injury by dangerous driving in relation to Elsie's father. Prosecutor Claire Holmes told the court: \"[The defendant] made a dangerous overtake of an unknown vehicle. At the time he overtook this vehicle, he was approaching a hidden dip in the road. \"There were warnings of the dip, namely a road sign and road markings. A careful and competent driver should have been fully aware of the hidden dip.\" Read more from Sky News:Robber who killed pensioner for cottage pie jailed for murderNational prostate cancer screening not recommended on NHS She said a warning sign about a hidden dip stood 425m from the crash site and noted if the defendant had waited to overtake, he would have seen the oncoming Kia. The hearing was attended by members of Elsie's family. In a statement read to the court, Elsie's parents said she was \"bright, loving, funny and full of life\". \"Losing Elsie is not just the loss of a child, it's the loss of our entire future,\" they said. \"We have lost her laughter, her dreams and everything she would have become.\" Defending Dudenski, Charles Myatt told the court the defendant believed the road was clear as he started the overtake. Mr Myatt said the defendant was usually a \"decent, law-abiding driver\" who made a \"catastrophic error of judgement\"."
    },
    {
        "title": "New rules set to stop savers getting around reduced cash ISA limit",
        "description": "New rules will be introduced to prevent savers from bypassing the upcoming lower limit on cash ISAs.",
        "url": "https://news.sky.com/story/holders-of-cash-isas-face-new-rules-and-charges-as-government-lowers-annual-limit-13476735",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-money-blog-widow-pension_7091158.jpg?20251125061949",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 18:23:00",
        "Headline": "The adult cash ISA allowance will drop from April 2027, with HMRC introducing measures to prevent circumvention and plans for a more flexible ISA for first-time homebuyers.",
        "Content": "New rules will be introduced to prevent savers from bypassing the upcoming lower limit on cash ISAs. Guidance published on the HM Revenue and Customs (HMRC) website said rules will be introduced \"to avoid circumvention of the lower limit for cash ISAs\". These rules are expected to include charges on interest earned on cash held within stocks and shares ISAs, as well as checks to determine whether money is being kept in \"cash-like\" accounts. At present, adults can save up to £20,000 each year across cash ISAs, stocks and shares ISAs, or a combination of both. However, the government announced in the budget that, from April 2027, the annual cash ISA allowance for adults will drop to £12,000. Only savers aged 65 and over will keep the full £20,000 cash ISA limit. The overall adult ISA contribution limit will remain at £20,000, which may encourage some savers who reach the £12,000 cash ISA cap to invest more in stocks and shares ISAs. \n                  Millions of jobs at risk due to AI, forecasting watchdog tells Treasury\n                 \n                  Budget 2025: Reeves urged to 'make the case' for income tax freeze - as PM hits out at defenders of 'failed' policy\n                 \n                  Is the government gaslighting us over tax rises? \n                 HMRC said the new rules will prevent transfers from stocks and shares ISAs or Innovative Finance ISAs into cash ISAs. They will also include tests to check whether an investment qualifies as a stocks and shares ISA or is considered \"cash-like\". Read more:Cash ISA limit has been slashed - but some people are exemptBudget 2025: The key points at a glance In addition, charges could be applied to any interest earned on cash held in stocks and shares or Innovative Finance ISAs. HMRC said industry will be consulted on the draft legislation, which will amend ISA regulations and be presented to parliament well before April 2027. 'New, simpler' ISA product The budget also revealed plans for a consultation in early 2026 on a \"new, simpler\" ISA for first-time homebuyers, which would replace the Lifetime ISA. The new product is expected to be more flexible, removing withdrawal penalties and allowing savers to access the bonus when buying a house even if circumstances change. Jason Hollands, managing director of online investment platform Bestinvest, warned there were still \"unanswered questions\" about how the reduced £12,000 cash ISA limit will work. Mr Hollands raised concerns that HMRC’s proposed charges on cash held in stocks and shares ISAs were a potential \"stealth tax\" on investors, and said tests to determine \"cash-like\" investments could create uncertainty over alternatives such as money market funds and short-dated bonds. He added that if ISA managers faced fees on client cash balances, these costs would likely be passed on to account holders."
    },
    {
        "title": "Alleged mercenary arrested in London over Albanian gang boss kidnap plot",
        "description": "An alleged mercenary has been arrested in London over a plot to kidnap the boss of an Albanian crime gang in revenge for a multimillion-pound drug theft.&#160;",
        "url": "https://news.sky.com/story/alleged-mercenary-arrested-in-london-over-albanian-gang-boss-kidnap-plot-13476599",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ainis-balodis-weapons_7094564.jpg?20251128142758",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-28 14:18:00",
        "Headline": "Latvian national Ainis Balodis, 45, was allegedly among a group of highly trained men hired by a rival organised crime group.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n An alleged mercenary has been arrested in London over a plot to kidnap the boss of an Albanian crime gang in revenge for a multimillion-pound drug theft.  Latvian national Ainis Balodis, 45, was one of four men held in an international operation led by German police earlier this month. The group, some of whom are former French Foreign Legion soldiers, are said by police to be highly trained and were equipped with professional equipment. They were allegedly hired by an organised crime group to kidnap the leader of a rival drug trafficking gang. The target, an Albanian crime boss, is suspected of orchestrating the theft of tonnes of cannabis worth millions of euros. Balodis, who flew into the UK on 31 October, is fighting extradition to Germany where he is wanted on charges of conspiracy to kidnap between August and October last year. Westminster Magistrates' Court heard he was arrested at a six-bedroom gated property in London where he is believed to have been working as a security guard. Balodis has been remanded in custody ahead of a full extradition hearing next year. German police said the investigation began in October last year after two Latvian nationals were found with professional surveillance gear and gas-powered weapons during a vehicle stop in the city of Herne, in west Germany. They have already been convicted and handed prison sentences, according to police. Investigators also arrested a gang of Albanian suspects after discovering more than 6,000 cannabis plants from three large cannabis plantations. Four people were arrested in Denmark, France, Latvia and the UK on Wednesday 12 November in the German-led investigation. 'Violence as a service' trend Europol said the operation is linked to the growing \"violence as a service\" trend, where highly trained specialists - often former special forces members - are hired by organised crime groups. \"A few of the suspects in this case are former French Foreign Legion soldiers,\" Europol said. \"This represents an alarming trend emerging from the war in Ukraine. Ukrainians trained by American forces, legionnaires and Russian mercenaries, all former combat-trained soldiers, are returning from the front and making use of their skills for organised crime, posing a potential threat.\" The organisation warned: \"Europe may face an increased number of these highly trained individuals engaging in criminal activities\" as the war continues and in its aftermath. \"It is crucial to monitor this development and prepare for the potential security challenges it presents,\" Europol said."
    },
    {
        "title": "Robber who kicked and punched pensioner for cottage pie jailed for his murder",
        "description": "A robber who kicked and punched a pensioner before taking off with a box of cornflakes and a cottage pie has been sentenced to life imprisonment with a minimum term of 23 years.",
        "url": "https://news.sky.com/story/robber-who-kicked-and-punched-pensioner-for-cottage-pie-jailed-for-his-murder-13476396",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-peter-augustine-police_7094206.jpg?20251128111632",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-28 11:19:00",
        "Headline": "John Mackey, 87, was targeted by Peter Augustine after he visited a Co-op store in Manor House, north London, on 6 May.",
        "Content": " A robber who kicked and punched a pensioner before taking off with a box of cornflakes and a cottage pie has been sentenced to life imprisonment with a minimum term of 23 years. John Mackey, 87, was targeted by Peter Augustine after he visited a Co-op store in Manor House, north London, on 6 May. Augustine, 59, was convicted by jurors of murder and robbery following a trial at the Old Bailey earlier this month. He did not attend his sentencing on Friday, claiming he was suffering from back pain. Judge Sarah Whitehouse KC said Augustine attacked \"gentle, innocent\" Mr Mackey \"for a box of cornflakes, a pint of milk and a saveloy sausage\". \"I have no doubt that if this defendant was genuinely starving and had asked Mr Mackey for help, this kind, generous gentleman would have,\" she said. \"I have no doubt that the defendant targeted him specifically because he was frail - it was a cowardly act, the defendant has shown no remorse.\" Passers-by saw Augustine attacking Mr Mackey and searching his jacket as he lay on the ground. A member of the public alerted police after she heard a shout of \"give me the bag\" and saw Mr Mackey lying motionless on the pavement. Mr Mackey, who was bleeding from his head, regained consciousness but was unable to tell officers what had happened. He was treated in hospital for bleeding on the brain and broken ribs, but died from his injuries two days later. Augustine was arrested two days after the attack, after CCTV viewed by the Metropolitan Police showed him watching Mr Mackey buying food at a kebab shop.  Read more from Sky News:British passenger missing after falling from cruise shipReeves urged to 'make the case' for income tax freeze After attacking Mr Mackey, Augustine took his bag which contained a newspaper, cornflakes, cottage pie and his dinner of sausage and chips. While in custody after his arrest, Augustine showed no remorse - making a series of threats, acting violently and throwing hot coffee at an officer, police said. A search of the defendant's room uncovered what was left of the pensioner's groceries and wrapping from the cottage pie, and sausage and chips. Prosecutor Jane Bickerstaff KC previously told jurors Mr Mackey was 5ft 5in and weighed less than nine stone. \"He would have been largely unable to put up any resistance to the attack due to his age and infirmity,\" she said. The prosecutor said at the time Augustine was living in \"reduced circumstances\" and was effectively homeless. Mr Mackey's niece, Patricia Schan, described her \"perfect uncle\" as \"funny, charming, mysterious, and very definitely mischievous\", and went on to criticise Augustine's behaviour during the trial. She said it \"showed complete disdain, disrespect and disregard for the family throughout the trial and caused even further distress from what was already an extremely traumatic experience\". \"His refusal to even attend during the trial caused anguish and uncertainty because we did not know what we would be facing on a daily basis,\" she said. \"He was constantly turning around and looking at us and shouting at us - and frankly terrifying us - from the witness box, which was just a few metres away.\" Acting Detective Chief Inspector John Marriott, who led the investigation, said: \"It is a shameful tragedy that John was killed by Augustine, for a mere few bits of shopping. He deserved better.\" "
    },
    {
        "title": "Why Airbus plane's sudden drop in altitude led to thousands needing software updates",
        "description": "Thousands of planes from Airbus's widely-used A320 family have been ordered for repairs following a software issue.",
        "url": "https://news.sky.com/story/why-does-solar-radiation-mean-thousands-of-airbus-planes-require-software-changes-13476813",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-airbus-a320_7094985.jpg?20251128214725",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-28 21:23:00",
        "Headline": "Airbus has ordered software updates for 6,000 of its jets - around half the global fleet - threatening travel disruption for airline passengers. But why have airlines been told to carry out a software update for the planes, and how is solar radiation involved?",
        "Content": " Thousands of planes from Airbus's widely-used A320 family have been ordered for repairs following a software issue. The aircraft manufacturer is carrying out software updates for 6,000 of its jets - around half the global fleet - threatening travel disruption for airline passengers. The UK's Civil Aviation Authority said it expects some disruptions to airlines and flights, with easyJet and Wizz Air saying they will take some planes briefly out of service to do the repairs. But why have airlines been told to carry out a software update for the planes, and how is solar radiation involved? Follow the latest updates on this story  What triggered the repair order? It is understood the incident that triggered the unexpected repair order involved a JetBlue flight from Cancun, Mexico, to Newark, New Jersey, on 30 October. The flight suffered a control problem and a sudden uncommanded drop in altitude, basically a sharp loss of height, which left 15 passengers with injuries and forced the flight to make an emergency landing in Tampa, Florida. After investigating the incident, Airbus said \"intense solar radiation\" may corrupt data critical to the functioning of flight controls. The issue is known as bit flip, where solar radiation can strike a computer's memory, changing its data from a 0 to a 1 and vice versa - a risk which also affects spacecraft. Read more: Which airlines are affected by Airbus disruption?  'Very concerning' - but 'very low likelihood' of such an event The situation was \"very concerning\", travel expert Simon Calder told Sky News presenter Gillian Joseph. However, he said there was a \"very low likelihood\" of such an event happening, adding: \"In aviation, nothing is taken for granted.\" He said: \"Aviation remains extraordinarily safe. And that is partly because as soon as a possible threat is identified, then action is taken immediately.\" What is the fix? The fix involves reverting to earlier software, but must be carried out before the planes can fly again, according to a bulletin to airlines. Airbus said for most of the affected aircraft, the required update would only take between two to three hours. However, some jets may need to have their hardware replaced to adopt the required software - a process which would take a longer time. The Airbus bulletin traced the problem to a flight system called ELAC (Elevator and Aileron Computer), which sends commands from the pilot's side-stick to elevators at the rear of the plane, Reuters reported. Those elevators control the aircraft's pitch or nose angle, determining which way it is flying. The A320 was first launched in 1984 and is the main competitor to the Boeing 737 MAX, which was grounded worldwide between March 2019 and December 2020, as well as during January 2024, after fatal crashes in 2018 and 2019 caused by faulty flight-control software."
    },
    {
        "title": "'Even if my parents are dead, I just want to know': Hong Kong residents stunned by tower tragedy",
        "description": "What do you do, how do you spend your time, when you&#8217;ve just lost everything you have?&#160;",
        "url": "https://news.sky.com/story/even-if-my-parents-are-dead-i-just-want-to-know-hong-kong-residents-stunned-by-tower-tragedy-13476603",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hong-kong-tower_7094616.jpg?20251128150520",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-11-28 14:33:00",
        "Headline": "The seven blackened towers are now still and quiet. The blaze is finally out.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  What do you do, how do you spend your time, when you’ve just lost everything you have?  This was the dilemma for thousands today in Hong Kong. On the whole, it seemed people chose to stay close to the scene. Hong Kong fire block latest: More arrests in deadly tower blaze The square that had become the heart of the community response was heaving. Many poured through the piles of clothes, blankets and other supplies. Some simply sat and watched on, their faces blank and stunned. Above them, the seven blackened towers are now still and quiet. The blaze is finally out. But an unknown number are still lying somewhere inside - and the wait for news is unbearable. \"Even if they are dead, I just want to know,\" cries Mr Lau, whose elderly parents lived 27 floors up. His grief is raw and unchecked. \"I want to ask John Lee [Hong Kong's chief executive], what are you actually doing? All you did was wander around and hold press conferences. What about us?\" His questions reflect a noticeable shift in the tone here. There is a tension emerging, an anxiety, even an anger. Of course, people are furious with the construction company that was undertaking renovations and is accused of cutting corners. But that is not their only target. Many here believe the Beijing-backed government has not enforced good enough safety standards, batting away residents' concerns and turning a blind eye to issues like overcrowding. They say it is now too focused on deflecting the blame. \"With every building maintenance project, there are criticisms, but these criticisms are always suppressed,\" explains one man who lives in the neighbourhood. And do you think there's corruption, I ask? \"Absolutely,\" he says. They are particularly exercised about what they see as an overfocus on the bamboo scaffolding. Considered almost a part of Hong Kong's cultural heritage, it was already being phased out. A convenient distraction from other failings, according to people here.  Tensions are high, too, between different groups of volunteers. We witnessed two separate arguments where local grassroots organisers accused some who are part of a government-linked group of attempting to seize control and take the credit. In the Hong Kong of old, there would almost certainly have been vigils here. But after a massive crackdown on pro-democracy movements that climaxed in 2019, any mass gathering in today's Hong Kong is seen as dangerous. Even if it is just to honour the dead. It feels like the resentments left over from that time are not that far from the surface. This is still a human tragedy, but the fallout could well be political."
    },
    {
        "title": "Zelenskyy will cut a lonely figure without his towering chief of staff",
        "description": "The loss of Volodymyr Zelenskyy's closest aide is a huge personal blow for the Ukrainian president, and could well weaken his authority.",
        "url": "https://news.sky.com/story/zelenskyy-will-cut-a-lonely-figure-without-his-towering-chief-of-staff-13476702",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-volodymyr-zelenskyy_7094730.jpg?20251128171403",
        "type": "World",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-28 16:57:00",
        "Headline": "Andrii Yermak's departure is by far the most significant from Volodymyr Zelenskyy's inner circle since Russia launched its full-scale invasion almost four years ago.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n  The loss of Volodymyr Zelenskyy's closest aide is a huge personal blow for the Ukrainian president, and could well weaken his authority. Andrii Yermak resigned on Friday, hours after anti-corruption officials raided his home amid a major corruption scandal that has shaken the country. Two ministers have already been forced to resign. Ukraine war latest: Kremlin says it's only negotiating with US But Yermak is by far the most significant departure from Zelenskyy's inner circle since Russia launched its full-scale invasion almost four years ago. The dramatic move could not have come at a worse time for Ukraine, which is under daily Russian bombardment as well as increased American pressure to strike a deal with Moscow to end the war. At a time when he needs to be stronger than ever, Zelenskyy will instead cut a lonely figure without his towering chief of staff, who has been by his side since he ran for president in 2019 and has been a hugely influential confidant ever since the first Russian missiles targeted Kyiv on 24 February 2022. Yermak, despite being an unelected figure, has wielded tremendous power, including over ministerial and military appointments and over who had access to the president. He was also appointed lead negotiator in peace talks, most recently representing Ukraine in Geneva alongside the US secretary of state Marco Rubio. But critics have long been wary about his elevated wartime status, with Yermak effectively the second most powerful person in the country after Zelenskyy. Read more:British passenger missing after falling from cruise shipAlleged mercenary arrested over Albanian gang boss kidnap plot Aide risked tarnishing president It meant questions were immediately raised about what he may or may not have known when it emerged earlier this month that Ukraine's two main anti-corruption agencies had uncovered a plot to control contracts at the state atomic energy agency worth around $100m (£76m) in kickbacks and laundered money. It is not yet clear what investigators were looking for when they raided Yermak's home, and he has said he was cooperating fully. He has not been charged with any crime or named as a suspect. However, anti-corruption activists were quick to demand he leave his job or else risk tarnishing Zelenskyy's reputation in the scandal as well."
    },
    {
        "title": "Which airlines are affected by Airbus disruption?",
        "description": "Airbus has announced a sweeping recall requiring immediate repairs on 6,000 A320 planes, affecting more than half of the global fleet.",
        "url": "https://news.sky.com/story/which-airlines-are-affected-by-airbus-disruption-13476810",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-plane-wizzair-easyjet_7094948.jpg?20251128210113",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-28 21:25:00",
        "Headline": "The sweeping safety order affects more than half of the global A320 fleet and could cause operational disruptions as airlines implement software and hardware repairs.",
        "Content": " Airbus has announced a sweeping recall requiring immediate repairs on 6,000 A320 planes, affecting more than half of the global fleet. It appears to be one of the biggest recalls Airbus has faced in its 55-year history and comes just weeks after the A320 surpassed the Boeing 737 as the most-produced aircraft. The move was triggered by a recent incident involving an A320-family aircraft, which revealed that intense solar radiation may corrupt data critical to the functioning of flight controls. Follow the latest updates on Airbus disruption  Industry sources said roughly two-thirds of the affected aircraft will face only short groundings as airlines roll back to an earlier software version. However, hundreds of jets may also need hardware replacements, potentially leading to much longer delays. At the time Airbus issued its notice to more than 350 operators, some 3,000 A320 aircraft were flying worldwide. Here is how airlines are affected by the issue: British Airways British Airways told Sky News that only three of its aircraft were affected and the required fixes will be carried out overnight and are not expected to disrupt its operations. American Airlines The world's largest A320 operator, American Airlines, said some 340 of its 480 A320 aircraft would need the fix. The airline said it mostly expected these to be completed by Saturday with about two hours required for each plane. Delta Air Lines Delta Air Lines said it will comply with the directive and expects any operational impact on its Airbus A320 family fleet to be limited. Lufthansa German carrier Lufthansa said it has been informed of potential software issues affecting its Airbus A320-family fleet. The airline warned that a small number of flight cancellations or delays may occur over the weekend, and confirmed it is fully complying with all manufacturer and regulatory requirements, having already begun implementing the measures prescribed by Airbus. Wizz Air A Wizz Air spokesperson confirmed that some of the airline's aircraft are among those requiring a software update flagged by Airbus. The airline has already scheduled the necessary maintenance, but some flights over the weekend may be affected. EasyJet EasyJet said that following the safety directive issued to airlines operating A320 aircraft, \"we have commenced and already completed the software update on many aircraft that require it and continue to work closely with the safety authorities\". The airline added that it plans to operate flights normally on Saturday and asked customers to continue monitoring their flights. Aer Lingus Irish carrier Aer Lingus said it has a \"limited number of aircraft impacted\" and is taking \"immediate steps\" to deal with the problem. Turkish Airlines Turkish Airlines said eight A320 aircraft in its fleet will be safely returned to service after completing the required actions, and all operations continue safely and without interruption. Avianca Colombian airline Avianca said on Friday that a major Airbus A320 recall impacts over 70% of its fleet, leading to \"significant\" operational disruptions over the next 10 days. The carrier also announced it had suspended ticket sales for travel through to 8 December. Air India Air India said it is aware of an Airbus directive affecting its in-service A320-family aircraft. The airline warned that required software and hardware updates on part of its fleet could lead to longer turnaround times and delays to scheduled operations. IndiGo  India's low-cost carrier IndiGo said it is proactively completing the required updates on its A320 aircraft and warned that some flights may experience slight schedule changes. Air New Zealand Air New Zealand said it is currently affected by a global software issue impacting its Airbus aircraft. The airline warned that several flights may be disrupted, with a number of cancellations expected across the fleet. Flynas Saudi Arabian budget airline Flynas said software and technical recalibration will be carried out on part of its fleet, causing some schedule delays following the Airbus recall. United Airlines The US carrier confirmed it was not impacted by the Airbus announcement. Azul Airlines Brazil's Azul Airlines said that none of its A320 jets are affected by the Airbus recall."
    },
    {
        "title": "The chilling aspects of video showing Israeli forces killing two Palestinians after apparent surrender",
        "description": "There are so many chilling aspects to the video from Jenin.",
        "url": "https://news.sky.com/story/the-many-chilling-aspects-of-video-showing-israeli-forces-killing-two-palestinians-after-apparent-surrender-13476725",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-west-bank-shooting_7094124.jpg?20251128011820",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-28 17:52:00",
        "Headline": "There will be an investigation into these killings, and the Israeli military insists it is transparent. But for those expecting accountability and independent investigation, the precedents are not encouraging.",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n  There are so many chilling aspects to the video from Jenin. The men being shot, calmly and precisely, from close range after appearing to surrender; the digger being used to bring down part of the building on top of their bodies. The total lack of shock among the soldiers - at least six of them - who were involved. But perhaps the most troubling is the realisation that we only know about this because someone filmed it. Otherwise, this might well have gone down as a military operation where two people - invariably referred to as \"terrorists\" - were killed. Within Jenin, to the north of the occupied West Bank, everyone has heard of this video. Farha Abu Alheja tells me that she was \"angry and frustrated\" after seeing the footage.  \"They were killed in cold blood,\" she says. \"They could have just arrested them, not executed them. It's a heinous crime. As a Palestinian woman, and mother, my heart goes out. I can't imagine how their mothers are feeling.\" Farha reflects a blend of hopelessness and helplessness: \"We have no international protection. I feel that we Palestinians don't mean anything to the rest of the world. \"This is not the first time this has happened, but nobody does anything. We have no life in Jenin - we live in a state of fear and tension. \"You leave home and you don't know if the Israelis will have demolished it when you come back. They don't need an excuse to do anything.\" There will be an investigation into these killings, and the Israeli military insists it is transparent. The IDF's spokesperson, Lt Col Nadav Shoshani, admitted that shots had been \"directed toward\" the two men as they \"exited\" a building (even though the footage shows them going back into it, at the behest of soldiers). He added: \"The incident is under review by the commanders on the ground, and will be transferred to the relevant professional bodies.\" But for those expecting accountability and independent investigation, the precedents are not encouraging. Between 2018 and 2022, the last years for which data are available, there were 219 court cases launched into allegations of Palestinians being killed, illegally, by Israeli soldiers on the West Bank. Of these, 112 were deemed to be unworthy of investigation. Of the remaining 107, it was decided that 106 did not merit an indictment. In the single case where a soldier was indicted, he was convicted of killing a Palestinian after opening fire at the scene of a traffic accident. His punishment was three months of community service. Over the course of many years, Jenin has been the crucible of so much tension and violence - the scene of endless clashes between Palestinians and Israeli forces. According to the Oslo Accords of 30 years ago, it is under Palestinian control, but the Israeli military routinely go there to exert control, demolish buildings and arrest people. They claim they are thwarting terrorism; others see it as a form of creeping annexation. Read more:Impossible to imagine people living here - yet some doControversial Gaza aid operation to close down Tensions are always high there. But now, with Palestinians affected by the twin spectres of Gaza's destruction and a wave of violence carried out by settlers in the West Bank, the anxiety is thick in the air. And it is stirred by the unapologetic response of plenty in Israel. More than 60% of Israeli Jews oppose investigations being carried out into soldiers accused of abusing Palestinians. Itamar Ben-Gvir, the minister in charge of national security, is unstinting in his praise of the military and his fury at the idea that soldiers should be investigated. In the wake of these killings, he doubled down, saying that Israelis needed to \"stop this distorted procedure\" of questioning soldiers. \"We are fighting enemies and murderers who want to rape women and burn babies,\" he said. This is the backdrop to the killing of these two men. The footage seems clear - the shots fired calmly and deliberately. The question is how this could have happened - why was this allowed? But many in Israel don't want the question to be asked, and nor do they want to know the answers."
    },
    {
        "title": "British passenger missing after falling from cruise ship off coast of Tenerife",
        "description": "A British passenger is missing after falling overboard from a cruise ship off the coast of Tenerife.",
        "url": "https://news.sky.com/story/british-passenger-missing-after-falling-from-cruise-ship-off-coast-of-tenerife-13451471",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-marella-explorer-marella-explorer-2_7094310.jpg?20251128102208",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-28 09:55:00",
        "Headline": "A search is under way for the 76-year-old man who was reported missing from the Marella Explorer 2 on Thursday morning.",
        "Content": "A British passenger is missing after falling overboard from a cruise ship off the coast of Tenerife. A search is under way for the 76-year-old man who was reported missing from the Marella Explorer 2 on Thursday morning. Coast guards told Sky News they received an alert yesterday at 9.48am local time from the cruise ship, which was located 16.5 nautical miles northwest of Punta Teno, Tenerife. Helicopters and patrol boats are taking part in the search. A statement from Marella Cruises said: \"We are deeply saddened to confirm that a guest was seen entering the water while the ship was on passage to La Gomera. Our thoughts are with the individual and their loved ones during this difficult time. \"Our dedicated care team is supporting the family, providing assistance and comfort. \"We are working closely with local authorities and will continue to offer every possible support.\" The boat was crossing between Funchal in Madeira and San Sebastian de La Gomera in Spain's Canary Islands, according to news website Voz Populi. The incident forced the captain to immediately activate the international \"man overboard\" protocol, which includes checking cameras, launching marker rafts and search manoeuvres, according to the website. The Marella Explorer 2, which is operated by TUI and also took part in the search, docked at the port of Santa Cruz de Tenerife at 2.40am local time. The vessel had reportedly departed from Tenerife on 21 November as part of a seven-day tour. Read more from Sky News:Robber who murdered pensioner for cottage pie jailed for lifeHand transplant journey of woman told she had two hours to live Lesley-Anne Kelly, 40, from Dundee, was on the ship with her mother, and recalled the moment passengers were alerted to what had happened. She said they were having breakfast and an alarm came on, followed by an announcement: \"Man overboard, man overboard, man overboard.\" Ms Kelly said crew members then all filed out to keep watch and the coast guard arrived around half an hour later. A few hours later when they were in their cabin, she said the captain announced a marker had been put down and the ship had to stay in position until the coast guard said they could leave. Later, passengers were told the search had been stood down due to darkness and that it would continue in the morning. \"It was pretty sombre last night, especially after the announcement that they were standing down the search,\" she said. Ms Kelly said passengers were told that witnesses were being interviewed. \"People had clearly seen it happen,\" she said, adding: \"It was breakfast time. Everybody was up and about. \"It was pretty bright, so yeah I can imagine if someone had gone in at that time of the day they would have been seen by multiple people.\" The Foreign Office said it has not been contacted for consular assistance in this case, but staff stand ready to support British nationals overseas at all times. "
    },
    {
        "title": "France will soon be able to intercept suspected migrant taxi boats in the Channel",
        "description": "France will be able to stop small boats in the sea as they head to pick up migrants to take them to the UK, French maritime police have said.",
        "url": "https://news.sky.com/story/france-will-soon-be-able-to-intercept-suspected-migrant-taxi-boats-in-the-channel-13476499",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-police-migrants-gravelines_7073850.jpg?20251106150945",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-28 11:01:00",
        "Headline": "French maritime police say they will \"soon be able to carry out control and intervention operations at sea\" on suspected taxi boats.",
        "Content": " France will be able to stop small boats in the sea as they head to pick up migrants to take them to the UK, French maritime police have said. They said people smugglers are increasingly using the \"taxi-boat\" method, where they send \"a precarious inflatable boat, eight to 10 metres long\" from a point further up or down the northern French coast from where the migrants are. Politics latest: Labour in major U-turn on day one of protections for workers The smugglers then sail along the coast to pick up passengers at different points along the shoreline, with migrants embarking in the water \"in increasingly chaotic conditions\". In a statement, the French Maritime Police said: \"The French State's response to the phenomenon of dangerous sea crossings to the United Kingdom is continuously adapting to the risks deliberately taken by smugglers. \"In order to protect human life and fight against smugglers involved in criminal human trafficking networks, the Maritime Gendarmerie will soon be able to carry out control and intervention operations at sea on vessels suspected of being taxi-boats.\"  They also said it is \"important to clearly distinguish\" between measures to save lives and these \"upcoming control and intervention operations\". \n                  Rise in number of asylum seekers being housed in hotels, as official net migration stats are released\n                 \n                  Inverness primary school cancels Christmas show after 'racist abuse'\n                 \n                  Britain's immigration system changes explained amid 'biggest shake-up' in 50 years\n                 There had been reports of the French police using nets to jam the boats' propellers. However, the maritime police said: \"The use of nets to stop taxi-boats is not being considered at this stage.\" The fact French police have not been intervening to stop the boats overladen with people trying to cross to the UK has been a source of frustration for the British government, which has promised to \"smash the gangs\". Read more:Labour MPs hit out at 'definite manifesto breach'Chancellor has backloaded the worst of the budget - and it's a gamble Sky News has witnessed French police looking on from beaches in northern France as migrants clamber on board overcrowded, flimsy rigid inflatable boats (RIBs). French police protocol and international law mean that once a vessel is afloat, especially with children and babies on board, intervention becomes risky and complex. More migrants have made the journey illegally so far this year than in the whole of last year. But that total remains lower than the record high in 2022. There have also been no small boats crossings recorded since 14 November - a gap of a fortnight. A UK government spokesperson said: \"We continue to work closely with our French partners on the shared challenge of illegal migration, and we have already worked to ensure officers in France review their maritime tactics so they can intervene in the shallow waters.\" The prime minister's spokesperson said Sir Keir Starmer and French President Emmanuel Macron are \"in close contact and our cooperation over this issue is ongoing\". He said 20,000 crossings have been prevented this year and pointed to the UK-France migrant returns deal, and the agreement that France would \"review their maritime response\" so their border enforcement teams can intervene in shallow waters. The spokesperson added that there is \"no silver bullet\" to tackling the crossings, but that the government \"inherited\" a situation where there was \"no effective deterrent\" and only \"a Rwanda gimmick\"."
    },
    {
        "title": "Alleged mercenary arrested in London over Albanian gang boss kidnap plot",
        "description": "An alleged mercenary has been arrested in London over a plot to kidnap the boss of an Albanian crime gang in revenge for a multimillion-pound drug theft.&#160;",
        "url": "https://news.sky.com/story/alleged-mercenary-arrested-in-london-over-albanian-gang-boss-kidnap-plot-13476599",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ainis-balodis-weapons_7094564.jpg?20251128142758",
        "type": "World",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-28 14:18:00",
        "Headline": "Latvian national Ainis Balodis, 45, was allegedly among a group of highly trained men hired by a rival organised crime group.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n An alleged mercenary has been arrested in London over a plot to kidnap the boss of an Albanian crime gang in revenge for a multimillion-pound drug theft.  Latvian national Ainis Balodis, 45, was one of four men held in an international operation led by German police earlier this month. The group, some of whom are former French Foreign Legion soldiers, are said by police to be highly trained and were equipped with professional equipment. They were allegedly hired by an organised crime group to kidnap the leader of a rival drug trafficking gang. The target, an Albanian crime boss, is suspected of orchestrating the theft of tonnes of cannabis worth millions of euros. Balodis, who flew into the UK on 31 October, is fighting extradition to Germany where he is wanted on charges of conspiracy to kidnap between August and October last year. Westminster Magistrates' Court heard he was arrested at a six-bedroom gated property in London where he is believed to have been working as a security guard. Balodis has been remanded in custody ahead of a full extradition hearing next year. German police said the investigation began in October last year after two Latvian nationals were found with professional surveillance gear and gas-powered weapons during a vehicle stop in the city of Herne, in west Germany. They have already been convicted and handed prison sentences, according to police. Investigators also arrested a gang of Albanian suspects after discovering more than 6,000 cannabis plants from three large cannabis plantations. Four people were arrested in Denmark, France, Latvia and the UK on Wednesday 12 November in the German-led investigation. 'Violence as a service' trend Europol said the operation is linked to the growing \"violence as a service\" trend, where highly trained specialists - often former special forces members - are hired by organised crime groups. \"A few of the suspects in this case are former French Foreign Legion soldiers,\" Europol said. \"This represents an alarming trend emerging from the war in Ukraine. Ukrainians trained by American forces, legionnaires and Russian mercenaries, all former combat-trained soldiers, are returning from the front and making use of their skills for organised crime, posing a potential threat.\" The organisation warned: \"Europe may face an increased number of these highly trained individuals engaging in criminal activities\" as the war continues and in its aftermath. \"It is crucial to monitor this development and prepare for the potential security challenges it presents,\" Europol said."
    },
    {
        "title": "Trump's targeting of 'third world' immigrants after the DC shooting is spreading fear",
        "description": "Late on Wednesday evening I caught a taxi home from the office after a long and sobering day.",
        "url": "https://news.sky.com/story/trumps-targeting-of-third-world-immigrants-after-the-dc-shooting-is-spreading-fear-13476430",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-estate_7094512.jpg?20251128133311",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-11-28 09:48:00",
        "Headline": "America is coming to terms with the shooting of two National Guard members, and even those who have come to the country legally are scared of the fall-out.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Late on Wednesday evening I caught a taxi home from the office after a long and sobering day. Washington DC was still absorbing the news that two young National Guard members had been shot in broad daylight at near-point blank range a block from the White House. One of them, Sarah Beckstrom, 20, has died. \"Late night in the office?\" the cab driver said. \"Yes...\" I replied, not massively enthusiastic for a chat. \"We'll need to go a different way. The roads are closed because of the shooting.\" he told me. \"Terrible, eh?\" I replied. \"Yes. I just heard the president...\" he said pointing to his car radio. An hour earlier President Donald Trump had addressed the nation from his Mar-a-Lago resort in Florida. He'd reflected on the shooting, revealed that the gunman was from Afghanistan, blamed former President Biden for allowing him into the country and vowed a massive new immigration crackdown. He singled out Afghans, and then, for reasons that remain unclear, the Somali community in Minnesota. The alleged gunman had arrived from Afghanistan in 2021. He was among more than 70,000 Afghans brought to America, via a basic vetting process in Qatar, as part of Operation Allies Welcome. It was part of the fallout from the chaotic American military withdrawal from Afghanistan. As the Taliban regained power, the Biden administration sought to help the thousands of Afghans who had worked with American and other NATO forces for two decades in Afghanistan. Read more:Washington DC shooting suspect named with links to CIADonald Trump condemns 'animal' suspect in shooting \"I'm Abdullah...\" the driver said to me. I had guessed already that he might be from Afghanistan. He then confirmed it. \"I came to America in 2012,\" he told me. \"I worked with the Americans and the British in Kandahar. \"I prefer the British!\" he joked, recognising my accent. \"Your language is pure. But America is the dream.\" I asked how he felt about the events of the day. \"Well, I understand the president's message. As a leader he is right to want to make his country safe,\" Abdullah said. \"But I am worried now,\" he added. \"The Afghan diaspora in America is big\", he said. \"It's scary for us all now...\" America's foreign misadventures over decades have often been coupled with an influx of immigrants from the collapsed nations left behind. The American dream usually outweighs any bitterness immigrants may have for the mess they left behind. Abdullah hinted at his role with US forces in Kandahar two decades ago. He said he was a combat medic. Now he is driving an Uber through the night to make ends meet. \"I shouldn't be driving now, after this shooting\", he said. \"Why?\" I asked. \"Because if I get stopped - pulled over for a broken tail light or something - they will probably detain me.\" \"Arrest first and ask questions later?\" I asked. \"Right... you've seen what they have been doing?\" He was referring to the ICE raids - immigration crackdowns across the country to round up suspected illegal immigrants.  As part of the crackdown, people with legal residency, as well as people within the asylum process and even US citizens have been detained. Abdullah is legally in America. But it's clear from our conversation that this doesn't give him any comfort. \"You know those signs on the metro\", he says. \"See something, say something…?\" He was referring to a US government public awareness campaign that's been running for years to encourage people to report suspicious activity. \"They will report us now...\" It's not surprising to me that he might be worried about being reported just because of what he looks like. Ever since 9/11 this has been a worry for minority communities. The fundamental difference now is that the authorities no longer guarantee security for those who have done nothing wrong. President Trump's rhetoric will unquestionably stir xenophobia. His jump from \"an evil act of terror\" to authorising a dramatic extension to his immigration crackdown came within that first statement on Wednesday night. He pivoted quickly from Afghanistan, \"the hell hole on earth\", to the Somali community in Minnesota, despite no connection with the DC shooting. He said the Somalis are \"ripping off our country and ripping apart that once-great state\", adding that Somalia as a country has \"no laws, no water, no military, no nothing\". This president doesn't wait before engaging politically. It's not his style. The emerging facts suggest that Wednesday's gunman worked with an elite Afghan unit alongside the CIA. This would have prompted a layered vetting process. Data also suggests that the suspect was granted asylum under Trump's administration despite entering the country when Joe Biden was president. The president has now vowed to to \"permanently pause\" immigration from \"third world countries\" and to \"re-examine every single alien\" who has entered the country from Afghanistan. That would presumably include the man driving me home this evening. Abdullah is a law-abiding legal resident of the United States who fought alongside the Americans in Afghanistan. He should have nothing to fear. But in Trump's America, he does."
    },
    {
        "title": "Trump says land operations against Venezuela drugs gangs to start 'very soon'",
        "description": "Donald Trump has warned US action against suspected Venezuelan drug traffickers will move to the land \"very soon\".",
        "url": "https://news.sky.com/story/trump-says-land-operations-against-venezuela-drugs-gangs-to-start-very-soon-13476358",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-donald_7094134.jpg?20251128032236",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-28 02:56:00",
        "Headline": "Donald Trump's comments come a few days after the US designated Venezuela's Cartel de los Soles as a foreign terrorist organisation.",
        "Content": " Donald Trump has warned US action against suspected Venezuelan drug traffickers will move to the land \"very soon\". American forces have carried out at least 21 strikes on boats it claims were carrying narcotics to its shores over the last few months. The US has accused the South American country's president, Nicolas Maduro, of being involved in the drugs trade - a claim he denies. Venezuela has said the attacks, which have killed more than 80 people, amount to murder. 'We warned them,' says Trump America's most advanced aircraft carrier is among the ships that have been deployed to the Caribbean Sea and eastern Pacific as part of Operation Southern Spear. Mr Trump said on Thursday he was preparing to significantly ramp up the response. \"You probably noticed that people aren't wanting to be delivering by sea, and we'll be starting to stop them by land also,\" he told military service members in a call. \"The land is easier, but that's going to start very soon.\" \"We warned them to stop sending poison to our country,\" Mr Trump added. The US has released videos of boats being targeted, but hasn't provided evidence - such as photos of their cargo - to support the smuggling claims.  Even if the boats are cartel vessels, Sky's chief correspondent Stuart Ramsay says the final destination for the drugs is likely to be Europe and West Africa. The Pentagon has sought to justify the strikes by labelling the drug gangs as foreign terrorist organisations - putting them on par with the likes of al Qaeda and Hamas. This week it formally designated Cartel de los Soles (Cartel of the Suns) as such, and said the group was headed by Mr Maduro and \"other high-ranking individuals\" from his regime. Another Venezuelan drugs group, Tren de Aragua, was designated a terror organisation by the US in January.  Read more:Trump may have another motive in war on drugsThe US-Venezuela crisis explained Mr Maduro - seen by most countries as a dictator who's cheated elections - has accused the US of \"fabricating\" a war to overthrow him and install a more favourable government. Venezuelan officials have also claimed Mr Trump's true motivation is access to the country's plentiful oil reserves and other natural resources such as gold and diamonds. Experts say Mr Maduro, 63, could use oil as a bargaining chip in any future negotiations. Mr Trump has said previously he would be open to talks - but that prospect seems unlikely, with the Venezuelan leader wielding a sword this week as he vowed to \"defend every inch of this blessed land from imperialist threat\"."
    },
    {
        "title": "Trump says he will cancel all Biden executive orders 'signed with autopen'",
        "description": "Donald Trump has said he will cancel all executive orders that he claims were signed with an autopen by his predecessor Joe Biden.",
        "url": "https://news.sky.com/story/trump-says-he-will-cancel-all-biden-executive-orders-signed-with-autopen-13476770",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-joe-biden-donald-trump_6792886.jpg?20250106151645",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-28 19:50:00",
        "Headline": "The US president claimed Joe Biden was \"not involved\" in signing the orders, without providing any evidence for his claims.",
        "Content": "Donald Trump has said he will cancel all executive orders that he claims were signed with an autopen by his predecessor Joe Biden. The US president alleged Mr Biden was \"not involved\" in signing the orders and claimed \"the radical left lunatics circling Biden around the beautiful Resolute Desk in the Oval Office took the presidency away from him\". He did not provide any evidence for his claims. An autopen is a device which reproduces a person's signature, allowing them to repeatedly sign documents without having to do so by hand each time. In a post on his Truth Social platform, he said: \"Any document signed by Sleepy Joe Biden with the Autopen, which was approximately 92% of them, is hereby terminated, and of no further force or effect. \"The Autopen is not allowed to be used if approval is not specifically given by the President of the United States.\" He added: \"I am hereby cancelling all Executive Orders, and anything else that was not directly signed by Crooked Joe Biden, because the people who operated the Autopen did so illegally. \"Joe Biden was not involved in the Autopen process and, if he says he was, he will be brought up on charges of perjury.\" Read more from Sky News:Trump: Land ops against Venezuela starting 'very soon'US to review immigration from 19 countries after shooting Mr Trump has repeatedly claimed Mr Biden was not mentally capable by the end of his term and his staff made decisions on his behalf, using an autopen to sign them off without his knowledge. Mr Trump has not provided any evidence for his claims, while Mr Biden and his former aides have denied they made decisions on his behalf. In June, Mr Biden said: \"Let me be clear: I made the decisions during my presidency. \"I made the decisions about the pardons, executive orders, legislation, and proclamations. Any suggestion that I didn't is ridiculous and false.\" Mr Trump has also used an autopen, but claimed he only used it \"for very unimportant papers\".  Earlier this year, Mr Trump replaced a portrait of Mr Biden in the Oval Office with a picture of an autopen signing the former president's name."
    },
    {
        "title": "Suspect in US National Guard shooting now facing first-degree murder charge",
        "description": "The suspect in the shooting of two National Guard members in Washington DC is facing a first-degree murder charge.",
        "url": "https://news.sky.com/story/suspect-in-national-guard-shooting-charged-with-first-degree-murder-13476623",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rahmanullah-lakanwal_7093729.jpg?20251127155135",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-28 15:09:00",
        "Headline": "US attorney Jeanine Pirro says there are \"many charges to come\" beyond the upgraded murder charge and that the suspect had driven across the US for the attack.",
        "Content": "The suspect in the shooting of two National Guard members in Washington DC is facing a first-degree murder charge. It follows the death of one of the soldiers, 20-year-old Sarah Beckstrom. The other soldier, Andrew Wolfe, 24, was taken to hospital in critical condition after the incident on Wednesday afternoon. On Friday, West Virginia's governor said Wolfe remained in a \"very critical condition\".   US attorney Jeanine Pirro's office said the suspect, 29-year-old Rahmanullah Lakanwal, now faces charges including one count of first-degree murder, three counts of possession of a firearm during a crime of violence and two counts of assault with intent to kill while armed. Pirro said there are \"many charges to come\" beyond the upgraded murder charge and that Lakanwal had driven across the country to launch an \"ambush-style\" attack with a revolver.  She said her heart went out to the family of Beckstrom, who volunteered to serve and \"ended up being shot ambush-style on the cold streets of Washington DC by an individual who will now be charged with murder in the first degree\". President Donald Trump called Beckstrom, part of the West Virginia guard, a \"highly respected\" and \"magnificent person\". 👉 Tap to follow Trump100 wherever you get your podcasts👈 Investigators are continuing to execute warrants in the state of Washington, where the suspect lived, and other parts of the country, Pirro said. However, she declined to discuss the suspect's motive, saying officials have been working around the clock on that question. Officials said Lakanwal entered the US in 2021 through Operation Allies Welcome, a Biden administration programme that evacuated and resettled tens of thousands of Afghans after the US's chaotic withdrawal from the country. People who knew him say he served in a CIA-backed Afghan army unit before immigrating to the US. Kristina Widman, Lakanwal's former landlord, said he had been living in Bellingham, close to Seattle, with his wife and five children. The #AfghanEvac charity said Lakanwal applied for asylum during the Biden administration, but his asylum was approved under the Trump administration. Read more:Trump's targeting of 'third world' immigrants spreads fearUS to review immigration from 19 countries after shooting On Wednesday night, Mr Trump called for the reinvestigation of all Afghan refugees who had entered under the Biden administration. The director of US Citizenship and Immigration Services, Joseph Edlow, said in a statement that the agency would take additional steps to screen people from 19 \"high-risk\" countries \"to the maximum degree possible\". The president has since said he wants to \"permanently pause migration\" from poorer nations and is promising to seek to expel millions of immigrants from the US by revoking their legal status. Organisations that work with refugees are worried that those who fled dangerous situations to start again in America will face a backlash after the shooting."
    },
    {
        "title": "US to review immigration from 19 countries after Washington DC double shooting",
        "description": "The US will review green cards issued to the citizens of 19 countries after two members of the National Guard were shot by a suspected Afghan gunman in Washington DC.",
        "url": "https://news.sky.com/story/us-to-review-immigration-from-19-countries-after-washington-dc-double-shooting-13476400",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-washington-dc-national-guard_7092892.jpg?20251126202056",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-28 08:21:00",
        "Headline": "It comes after an Afghan national, Rahmanullah Lakanwal, was named as the main suspect in the fatal attack in the US capital.",
        "Content": " The US will review green cards issued to the citizens of 19 countries after two members of the National Guard were shot by a suspected Afghan gunman in Washington DC. Immigration from Afghanistan has also been suspended indefinitely, the White House said, following the double shooting on Wednesday. Joseph Edlow, director of US Citizenship and Immigration Services (USCIS), revealed the order from President Trump. He wrote on X, formerly Twitter: \"At the direction of @POTUS, I have directed a full scale, rigorous re-examination of every Green Card for every alien from every country of concern.\" Asked which countries would be affected, USCIS pointed to a presidential proclamation from June listing 19 countries. The proclamation sought to \"fully restrict\" arrivals from Afghanistan, Burma, Chad, the Republic of the Congo, Equatorial Guinea, Eritrea, Haiti, Iran, Libya, Somalia, Sudan, and Yemen. It also \"partially\" restricted arrivals from Burundi, Cuba, Laos, Sierra Leone, Togo, Turkmenistan, and Venezuela. \n                  Trump says he will cancel all Biden executive orders 'signed with autopen'\n                 \n                  Suspect in US National Guard shooting now facing first-degree murder charge\n                 \n                  Trump's targeting of 'third world' immigrants after the DC shooting is spreading fear\n                 Afghan national Rahmanullah Lakanwal, 29, has been named as the suspected gunman in this week's shooting and has been detained. He worked as part of a CIA-backed unit in Afghanistan, and reportedly came to the States under a programme meant to help Afghans who'd risked their lives assisting US troops in Afghanistan. He's thought to have driven thousands of miles to the capital from his home in Washington state, where he lives with his wife and five children. Attorney general Pam Bondi called him \"a lone gunman\" who \"opened fire without provocation, ambush style\". President Trump described him as a \"savage monster\". He was granted asylum in April this year, according to NBC News. One of his victims, 20-year-old Sarah Beckstrom, died of her wounds, while the other, Andrew Wolfe, 24, remains in a critical condition. Lakanwal reportedly came to the US under Operation Allies Welcome, a programme enacted by former President Joe Biden after he pulled American forces out of Afghanistan in 2021. Edlow explictly targeted the previous president as he announced the new green card regime. Read more:Trump condemns 'monstrous' attack near White HouseElection interference charges against Donald Trump dismissed He wrote on X: \"The protection of this country and of the American people remains paramount, and the American people will not bear the cost of the prior administration's reckless resettlement policies.\" Speaking after the attack, President Trump was even more caustic. He said: \"The suspect in custody is a foreigner, who entered our country from Afghanistan, a hellhole on Earth. \"He was flown in by the Biden administration in September 2021 on those infamous flights that everybody was talking about. \"His status was extended under legislation signed by President Biden - a disastrous president, the worst in the history of our country.\" 👉 Tap here to follow Trump100 wherever you get your podcasts👈 He continued: \"This attack underscores the greatest national security threat facing our nation. \"The last administration let in 20 million unknown and unvetted foreigners from all over the world, from places that you don't even want to know about. \"No country can tolerate such a risk to our very survival.\""
    },
    {
        "title": "Trump's targeting of 'third world' immigrants after the DC shooting is spreading fear",
        "description": "Late on Wednesday evening I caught a taxi home from the office after a long and sobering day.",
        "url": "https://news.sky.com/story/trumps-targeting-of-third-world-immigrants-after-the-dc-shooting-is-spreading-fear-13476430",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-estate_7094512.jpg?20251128133311",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-11-28 09:48:00",
        "Headline": "America is coming to terms with the shooting of two National Guard members, and even those who have come to the country legally are scared of the fall-out.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Late on Wednesday evening I caught a taxi home from the office after a long and sobering day. Washington DC was still absorbing the news that two young National Guard members had been shot in broad daylight at near-point blank range a block from the White House. One of them, Sarah Beckstrom, 20, has died. \"Late night in the office?\" the cab driver said. \"Yes...\" I replied, not massively enthusiastic for a chat. \"We'll need to go a different way. The roads are closed because of the shooting.\" he told me. \"Terrible, eh?\" I replied. \"Yes. I just heard the president...\" he said pointing to his car radio. An hour earlier President Donald Trump had addressed the nation from his Mar-a-Lago resort in Florida. He'd reflected on the shooting, revealed that the gunman was from Afghanistan, blamed former President Biden for allowing him into the country and vowed a massive new immigration crackdown. He singled out Afghans, and then, for reasons that remain unclear, the Somali community in Minnesota. The alleged gunman had arrived from Afghanistan in 2021. He was among more than 70,000 Afghans brought to America, via a basic vetting process in Qatar, as part of Operation Allies Welcome. It was part of the fallout from the chaotic American military withdrawal from Afghanistan. As the Taliban regained power, the Biden administration sought to help the thousands of Afghans who had worked with American and other NATO forces for two decades in Afghanistan. Read more:Washington DC shooting suspect named with links to CIADonald Trump condemns 'animal' suspect in shooting \"I'm Abdullah...\" the driver said to me. I had guessed already that he might be from Afghanistan. He then confirmed it. \"I came to America in 2012,\" he told me. \"I worked with the Americans and the British in Kandahar. \"I prefer the British!\" he joked, recognising my accent. \"Your language is pure. But America is the dream.\" I asked how he felt about the events of the day. \"Well, I understand the president's message. As a leader he is right to want to make his country safe,\" Abdullah said. \"But I am worried now,\" he added. \"The Afghan diaspora in America is big\", he said. \"It's scary for us all now...\" America's foreign misadventures over decades have often been coupled with an influx of immigrants from the collapsed nations left behind. The American dream usually outweighs any bitterness immigrants may have for the mess they left behind. Abdullah hinted at his role with US forces in Kandahar two decades ago. He said he was a combat medic. Now he is driving an Uber through the night to make ends meet. \"I shouldn't be driving now, after this shooting\", he said. \"Why?\" I asked. \"Because if I get stopped - pulled over for a broken tail light or something - they will probably detain me.\" \"Arrest first and ask questions later?\" I asked. \"Right... you've seen what they have been doing?\" He was referring to the ICE raids - immigration crackdowns across the country to round up suspected illegal immigrants.  As part of the crackdown, people with legal residency, as well as people within the asylum process and even US citizens have been detained. Abdullah is legally in America. But it's clear from our conversation that this doesn't give him any comfort. \"You know those signs on the metro\", he says. \"See something, say something…?\" He was referring to a US government public awareness campaign that's been running for years to encourage people to report suspicious activity. \"They will report us now...\" It's not surprising to me that he might be worried about being reported just because of what he looks like. Ever since 9/11 this has been a worry for minority communities. The fundamental difference now is that the authorities no longer guarantee security for those who have done nothing wrong. President Trump's rhetoric will unquestionably stir xenophobia. His jump from \"an evil act of terror\" to authorising a dramatic extension to his immigration crackdown came within that first statement on Wednesday night. He pivoted quickly from Afghanistan, \"the hell hole on earth\", to the Somali community in Minnesota, despite no connection with the DC shooting. He said the Somalis are \"ripping off our country and ripping apart that once-great state\", adding that Somalia as a country has \"no laws, no water, no military, no nothing\". This president doesn't wait before engaging politically. It's not his style. The emerging facts suggest that Wednesday's gunman worked with an elite Afghan unit alongside the CIA. This would have prompted a layered vetting process. Data also suggests that the suspect was granted asylum under Trump's administration despite entering the country when Joe Biden was president. The president has now vowed to to \"permanently pause\" immigration from \"third world countries\" and to \"re-examine every single alien\" who has entered the country from Afghanistan. That would presumably include the man driving me home this evening. Abdullah is a law-abiding legal resident of the United States who fought alongside the Americans in Afghanistan. He should have nothing to fear. But in Trump's America, he does."
    },
    {
        "title": "Trump says land operations against Venezuela drugs gangs to start 'very soon'",
        "description": "Donald Trump has warned US action against suspected Venezuelan drug traffickers will move to the land \"very soon\".",
        "url": "https://news.sky.com/story/trump-says-land-operations-against-venezuela-drugs-gangs-to-start-very-soon-13476358",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-trump-donald_7094134.jpg?20251128032236",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-28 02:56:00",
        "Headline": "Donald Trump's comments come a few days after the US designated Venezuela's Cartel de los Soles as a foreign terrorist organisation.",
        "Content": " Donald Trump has warned US action against suspected Venezuelan drug traffickers will move to the land \"very soon\". American forces have carried out at least 21 strikes on boats it claims were carrying narcotics to its shores over the last few months. The US has accused the South American country's president, Nicolas Maduro, of being involved in the drugs trade - a claim he denies. Venezuela has said the attacks, which have killed more than 80 people, amount to murder. 'We warned them,' says Trump America's most advanced aircraft carrier is among the ships that have been deployed to the Caribbean Sea and eastern Pacific as part of Operation Southern Spear. Mr Trump said on Thursday he was preparing to significantly ramp up the response. \"You probably noticed that people aren't wanting to be delivering by sea, and we'll be starting to stop them by land also,\" he told military service members in a call. \"The land is easier, but that's going to start very soon.\" \"We warned them to stop sending poison to our country,\" Mr Trump added. The US has released videos of boats being targeted, but hasn't provided evidence - such as photos of their cargo - to support the smuggling claims.  Even if the boats are cartel vessels, Sky's chief correspondent Stuart Ramsay says the final destination for the drugs is likely to be Europe and West Africa. The Pentagon has sought to justify the strikes by labelling the drug gangs as foreign terrorist organisations - putting them on par with the likes of al Qaeda and Hamas. This week it formally designated Cartel de los Soles (Cartel of the Suns) as such, and said the group was headed by Mr Maduro and \"other high-ranking individuals\" from his regime. Another Venezuelan drugs group, Tren de Aragua, was designated a terror organisation by the US in January.  Read more:Trump may have another motive in war on drugsThe US-Venezuela crisis explained Mr Maduro - seen by most countries as a dictator who's cheated elections - has accused the US of \"fabricating\" a war to overthrow him and install a more favourable government. Venezuelan officials have also claimed Mr Trump's true motivation is access to the country's plentiful oil reserves and other natural resources such as gold and diamonds. Experts say Mr Maduro, 63, could use oil as a bargaining chip in any future negotiations. Mr Trump has said previously he would be open to talks - but that prospect seems unlikely, with the Venezuelan leader wielding a sword this week as he vowed to \"defend every inch of this blessed land from imperialist threat\"."
    },
    {
        "title": "JPMorgan Chase unveils plans to build new £10bn 'landmark tower' in London - double the size of The Shard",
        "description": "Plans have been announced for a new \"landmark tower\" in London with double the floor space of Britain's tallest building, The Shard.",
        "url": "https://news.sky.com/story/jpmorgan-chase-unveils-plans-to-build-new-16310bn-landmark-tower-in-london-double-the-size-of-the-shard-13476388",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jpmorgan-tower-london_7094189.jpg?20251128074326",
        "type": "Business",
        "Author": "Daniel Binns, business reporter",
        "Date Published": "2025-11-28 07:39:00",
        "Headline": "The proposed office block in Canary Wharf, if approved, would have double the floor space of The Shard, although its height is yet to be finalised.",
        "Content": "By Daniel Binns, business reporter  Plans have been announced for a new \"landmark tower\" in London with double the floor space of Britain's tallest building, The Shard. JPMorgan Chase unveiled details of the proposed office block after banks escaped having their taxes raised in the budget earlier this week. The US multinational bank said the new building in Canary Wharf, in the east of the capital, would have a floor space of three million square feet. The Shard, in London Bridge, covers 1.3 million square feet. However, the final design of the tower, including its height, is still being finalised. A spokesperson for the firm told Sky News that they hoped to have clarity \"soon\" on how tall the building would be and the number of storeys. But it is expected to be one of the biggest office blocks in Europe. Money latest: Not paying your student loan back yet? That could change sooner than you think JPMorgan Chase boss Jamie Dimon reportedly signed off on the plans late last week. It came after Sir Keir Starmer's business envoy Varun Chandra flew out to New York to personally \"offer assurances about the government's business-friendly policies,\" the Financial Times reported on Friday. The company also warned in a press release that its plans were \"subject to a continuing positive business environment in the UK\", as well as planning permission from local authorities. JPMorgan Chase said the project could contribute up to £9.9bn to the UK economy over six years, including by generating 7,800 jobs, many of them in the construction industry. Read more from Sky News:TGI Fridays' UK chain up for sale'Sticking to Labour manifesto pledge costs workers'HSBC chair candidates to pitch to board next week The tower would house up to 12,000 people and serve as JPMorgan Chase's main UK headquarters and its most significant presence in Europe, the Middle East and Africa. The firm, which employs 23,000 people in the UK, said the tower would be \"one of the largest and most sophisticated in Europe\". The building is being designed by British architects Foster and Partners, known for landmarks projects including the new Wembley Stadium and London's Millennium Bridge. Mr Dimon said: \"London has been a trading and financial hub for more than a thousand years, and maintaining it as a vibrant place for finance and business is critical to the health of the UK economy. \"This building will represent our lasting commitment to the city, the UK, our clients and our people.\" Mr Dimon added: \"The UK government's priority of economic growth has been a critical factor in helping us make this decision.\" Chancellor Rachel Reeves said she was \"thrilled\" about the announcement, while Mayor of London Sir Sadiq Khan said it represented a \"huge vote of confidence in the capital's future\"."
    },
    {
        "title": "Black Sheep brewer on brink of calling last orders",
        "description": "The brewery group behind brands such as Black Sheep, Hofmeister and Fourpure is on the brink of collapse as it grapples with a lethal cocktail of surging costs and waning consumer confidence in the run-up to this week's budget.",
        "url": "https://news.sky.com/story/black-sheep-brewer-on-brink-of-calling-last-orders-13476434",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/skynews-black-sheep_6142048.jpg?20230503105738",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-28 09:56:00",
        "Headline": "Keystone Brewing Group, which also counts Fourpure and Hofmeister among its portfolio, is lining up FRP Advisory as administrator as it races to secure a restructuring or sale, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The brewery group behind brands such as Black Sheep, Hofmeister and Fourpure is on the brink of collapse as it grapples with a lethal cocktail of surging costs and waning consumer confidence in the run-up to this week's budget. Sky News has learnt that Keystone Brewing Group, which also owns Purity Brewing Company and distributes a range of other brands, has filed a notice of intention to appoint administrators to give the company time to orchestrate a restructuring or sale. Keystone employs roughly 190 people at breweries across the country. It owns a number of brands outright, while others - including Hofmeister, the well-known Bavarian lager - are the subject of exclusive sales and distribution partnerships. Some of the beers in the Keystone stable are among the best-known in Britain, with Black Sheep having been founded in 1992 by a member of the Theakston brewing family. Black Sheep previously fell into administration in 2023, before being rescued by its current owner. The notice of intention to appoint FRP Advisory as administrators to Keystone is understood to have been made amid pressure from a number of the company's trade creditors. Industry sources said that Keystone had seen a slump in sales this month amid dwindling confidence from key trade customers and consumers ahead of Rachel Reeves's budget earlier this week. Read more from Sky News:Anglo American faces bloody nose over exec payoutsWTW in talks to buy NatWest pensions unit CushonNew £10bn 'landmark tower' could be built in London One brewing executive said the persistent drip-feed of speculation about tax hikes - some of which failed to materialise in the chancellor's speech - had prompted trade customers to rein in orders and consumers to reduce spending in the last few weeks. Keystone is run by industry veteran Steve Cox, who joined earlier this year with a brief to hit a £100m annual sales target by 2028. The company is backed by Breal, an investment firm which has poured millions of pounds of investment into the brewery sector in recent years, including rescue deals for a number of struggling businesses. Breal could not be reached for comment."
    },
    {
        "title": "WTW in talks to buy NatWest pensions unit Cushon",
        "description": "The pensions giant WTW is in talks to buy the workplace retirement schemes platform owned by NatWest Group, the FTSE-100 lender.",
        "url": "https://news.sky.com/story/wtw-in-talks-to-buy-natwest-pensions-unit-cushon-13476518",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-natwest-money-current-account_7079296.jpg?20251111151310",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-28 11:56:00",
        "Headline": "The pensions giant formerly known as Willis Towers Watson is the leading contender to buy the workplace pensions platform acquired by NatWest in 2023, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The pensions giant WTW is in talks to buy the workplace retirement schemes platform owned by NatWest Group, the FTSE-100 lender. Sky News has learnt that WTW - formerly known as Willis Towers Watson - has emerged as the frontrunner to buy Cushon from NatWest following an auction which attracted several leading industry names. The price under negotiation was unclear on Friday. Cushon manages assets worth £3.7bn, according to the latest figures provided by NatWest, which bought a controlling stake in the business for £144m two years ago. The pensions business serves roughly 650,000 members across approximately 21,000 employers. NatWest owns an 85% stake in Cushon, with the remainder held by the subsidiary's management. For NatWest, a sale would reflect chief Paul Thwaite's determination to refocus the bank - which shed the last vestiges of taxpayer ownership earlier this year - on its core strategic priorities. These include a bank-wide simplification programme and more active balance sheet and risk management. Cushon offers workplace pension products as well as a range of workplace ISAs, including Junior ISAs, Lifetime ISAs and General Investment Accounts. Read more from Sky News:Anglo American faces bloody nose over exec payoutsTGI Fridays' UK chain up for saleHSBC chair candidates to pitch to board next week NatWest's acquisition of the business was aimed at diversifying its non-interest income by offering Cushon's products to the bank's commercial and business banking customers. The government announced major pensions reforms this year aimed at driving greater scale and reducing unnecessary bureaucratic expenses, with a view to defined contribution schemes managing at least £25bn in assets by 2030. Chancellor Rachel Reeves this week hit salary sacrifice pension schemes with a multibillion pound tax raid, which has caused uproar within the industry. NatWest and WTW have both been contacted for comment."
    },
    {
        "title": "Miner Anglo American faces bloody nose over executive payouts",
        "description": "An influential City group is urging investors to oppose plans that would guarantee a multimillion pound share bonanza to executives at Anglo American as it finalises a $33bn merger with Canada&#8217;s Teck Resources.",
        "url": "https://news.sky.com/story/miner-anglo-american-faces-bloody-nose-over-executive-payouts-13476432",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anglo-american-los-bronces_7094308.jpg?20251128101202",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-28 09:50:00",
        "Headline": "The Investment Association’s voting advisory service has ‘red-topped’ the FTSE-100 mining group’s proposal to guarantee millions of pounds of payouts as it finalises a $33bn merger with Teck Resources, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An influential City group is urging investors to oppose plans that would guarantee a multimillion pound share bonanza to executives at Anglo American as it finalises a $33bn merger with Canada’s Teck Resources. Sky News understands that the Investment Association's IVIS voting advisory service has issued next month's vote on amendments to Anglo's long-term incentive awards with a 'red-top' alert - its strongest possible warning against the resolution. The development comes days after rival miner BHP approached Anglo for a second time about a potential takeover, before abruptly withdrawing. Anglo, the mining group which owns De Beers, wants to amend its share awards to guarantee that they would pay out at least 62.5% of their value if the merger completes. Institutional Shareholder Services, which has recommended that shareholders vote in favour of the merger itself, has also recommended opposition to the bonus scheme amendments. \"The amending of awards to reflect M&A factors not envisioned when the awards were first granted is not considered inappropriate in the UK market per se,\" ISS said in a report to clients. \"However, in this case, the amending of in-flight LTIP awards in order to ensure a minimum payout linked to the completion of the merger transaction is. \"Indeed, the linking of variable incentives to the completion of transactions is not considered good practice, which is itself recognised by the company.\" Read more from Sky News:TGI Fridays' UK chain up for sale'Sticking to Labour manifesto pledge costs workers'HSBC chair candidates to pitch to board next week The IA declined to comment further on the red-top alert. A spokesman for Anglo American said the proposed changes would drive \"even greater alignment with shareholders' interests\"."
    },
    {
        "title": "Budget 2025: Reeves accused of deliberately making UK finances look worse",
        "description": "Rachel Reeves has been accused of making the country's economic situation appear in a worse state than it really was ahead of the budget.",
        "url": "https://news.sky.com/story/budget-2025-reeves-accused-of-deliberately-making-uk-finances-look-worse-13476622",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-budget_7092465.jpg?20251126123700",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-28 15:08:00",
        "Headline": "Tories claim the chancellor misled the country when she warned she would have to make tough choices due to dire economic circumstances. Letter reveals the OBR had already told her she was running a surplus.",
        "Content": "Rachel Reeves has been accused of making the country's economic situation appear in a worse state than it really was ahead of the budget. A letter from the Office for Budget Responsibility (OBR), published on Friday, revealed it told the chancellor as early as 17 September that prevailing economic winds meant the £20bn gap in meeting her self-imposed fiscal rule of not borrowing for day-to-day spending would actually be much smaller. Later, in October, it informed her that the spending gap had closed altogether and the government would be running a surplus. Wednesday's budget, which increased taxes by more than £26bn, followed weeks of dire warnings from Ms Reeves that she would have to make \"hard choices\" to meet her tax and spending commitments. This included an early morning news conference on 4 November, after the OBR told her the spending gap had closed, when she suggested she was likely to have to break a manifesto promise and raise income tax rates to secure the UK's economic future. Ms Reeves did not end up increasing income tax rates in the budget. But the chancellor did extend the freeze on income tax thresholds, in a move that her critics have described as a stealth tax. Conservative leader Kemi Badenoch said the letter showed Ms Reeves had \"lied to the public\" and should be sacked. \n                  The future of the OBR with Ed Conway \n                 \n                  Politics latest: Rachel Reeves accused of misleading voters over reason for tax rises\n                 \n                  PM's rap battle with Sky's Beth Rigby goes viral - and one of the AI satirists behind it explains why\n                 But Downing Street denied she had misled the public and the markets in the run-up to the budget. \"I don't accept that,\" the prime minister's spokesman said. \"As she set out in the speech that she gave here (Downing Street), she talked about the challenges the country was facing and she set out her decisions incredibly clearly at the budget.\" Read more:How much is the mansion tax and who will have to pay it?The main budget announcementsChancellor has backloaded the worst of the budget - and it's a gamble  The idea of a hike in income tax rates was dropped on 13 November after several weeks of being trailed, as the Treasury cited better than expected forecasts. But the OBR suggested it had provided ministers with no new forecasting in November. \"No changes were made to our pre-measures forecast after October 31,\" the fiscal watchdog's letter to the Treasury Select Committee said. Read more:4 November: Reeves refuses to rule out manifesto-breaking tax hikes11 November: Reeves signals she will break tax pledges  Ben Zaranko, an economist for the Institute for Fiscal Studies, queried the rationale behind the negative briefings ahead of the budget. \"At no point in the process did the OBR have the government missing its fiscal rules by a large margin. Leaves me baffled by the months of speculation and briefing,\" he wrote on X. \"Was the plan to lead everyone to expect a big income tax rise, then surprise them on the day by not doing it?\" Ms Badenoch said: \"Yet more evidence, as if we needed it, that the chancellor must be sacked. For months Reeves has lied to the public to justify record tax hikes to pay for more welfare. \"Her budget wasn't about stability. It was about politics: bribing Labour MPs to save her own skin. Shameful.\" Ms Reeves' Tory counterpart, shadow chancellor Sir Mel Stride said the downbeat briefings were \"all a smokescreen\". \"Labour knew all along that they did not need to raise taxes and break their promises,\" he said. \"It was an active choice to do so, to fund a huge increase in welfare spending. The OBR have now made that very clear. \"It appears the country has been deliberately misled.\""
    },
    {
        "title": "The future of the OBR with Ed Conway ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>        ",
        "url": "https://news.sky.com/story/the-future-of-the-obr-with-ed-conway-13476656",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-daily-podcast-rachel-reeves_7094669.png?20251128155330",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-28 15:50:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  The Office for Budget Responsibility has attracted huge criticism and anger from Chancellor Rachel Reeves, after mistakenly revealing the details of her budget hours before she delivered it. But the watchdog already had its critics. Liz Truss says she never realised how powerful the OBR was and that it should be abolished. And Sir Keir Starmer has criticised the OBR's assessment of his government's fiscal plans. So how will the budget leak affect the OBR's future? Niall Paterson talks to Ed Conway, Sky's economics and data editor about exactly what the OBR is, whether it has too much power and if it will survive. Producer: Emma Rae Woodhouse Editor: Wendy Parker"
    },
    {
        "title": "Why prostate cancer is expected to be left as the only major cancer without national screening",
        "description": "Prostate cancer is expected to remain the only major cancer not to have a national screening programme under new recommendations from government advisers.",
        "url": "https://news.sky.com/story/why-prostate-cancer-is-expected-to-be-left-as-the-only-major-cancer-without-national-screening-13476528",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-brca-test-cancer-prostate-cancer_7094467.jpg?20251128165303",
        "type": "Technology",
        "Author": "Thomas Moore",
        "Date Published": "2025-11-28 12:36:00",
        "Headline": "The national committee of doctors and economists advising the government says the harms outweigh the benefits for screening all men in their 50s and 60s.",
        "Content": "\n          Science correspondent\n              @SkyNewsThomas\n  Prostate cancer is expected to remain the only major cancer not to have a national screening programme under new recommendations from government advisers. The National Screening Committee, which is made up of doctors and economists, says the harms outweigh the benefits for screening all men in their 50s and 60s. Instead, the committee will recommend screening only for the one in 260 men who have inherited the BRCA cancer gene. The big problem? They may not know they have the gene, so they won't be screened. BRCA is sometimes known as the 'Jolie gene', named after the actress Angelina Jolie, who had a preventative double mastectomy after being told she had the gene and an 87% risk of breast cancer. The mutated gene also increases the risk of prostate cancer. One in three men with the gene is likely to develop aggressive disease. But usually men will only know they may have inherited the BRCA gene if their mother or sister has had breast or ovarian cancer at a young age - and the female relative has had gene testing as a result. \n                  Prostate cancer: NHS screening programme could come one step closer today\n                 \n                  Calls grow for national screening programme for prostate cancer\n                 \n                  Ultra-processed foods leading cause of 'chronic disease pandemic', say experts\n                 However, male relatives may not have been told or understand the implications for them. They may be in the dark, not have BRCA testing themselves, and therefore never come forward for prostate screening. The PSA blood test, which is the first step in prostate screening, has pitfalls. Yes, it flags men who may have cancer. But it doesn't determine whether the cancer is aggressive and life-threatening. So it can lead to some men having treatment that is risky but unnecessary. The committee wants to wait for clearer evidence before giving the green light. Its draft recommendations will be put out for public consultation, with charities and campaigners expected to lobby for other high-risk men to be included in screening. Black men are at twice the risk of prostate cancer. And including men with a close relative who has had prostate, breast or ovarian cancer at a young age would side-step the problems in BRCA testing. Read more from Sky News:Woman's hand transplant journeyNeck scan could detect risk of stroke Men like Olympian Sir Chris Hoy, who has a family risk but was diagnosed only when his prostate cancer was advanced, have made a strong case for targeted screening. The committee isn't convinced. But even if the final recommendations don't change when the public consultation is complete, it is Health Secretary Wes Streeting who will make the final decision. And he will be more sensitive to politics."
    }
]