[
    {
        "title": "Lucy was murdered in 2005. There's been no confirmed sighting of a key suspect ever since",
        "description": "Britain's most-wanted fugitive is still on the run - exactly 20 years after the fatal shooting of a young mother of three.",
        "url": "https://news.sky.com/story/lucy-hargreaves-was-shot-dead-in-2005-her-home-set-on-fire-a-suspect-in-her-murder-is-still-at-large-13405512",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lucy-hargreaves-appeal_6980614.jpg?20250802121632",
        "type": "Home",
        "Author": "Martin Brunt",
        "Date Published": "2025-08-02 23:27:00",
        "Headline": "Lucy Hargreaves was shot dead at her home in Liverpool in 2005. After 20 years and many appeals for information, there has been no confirmed sighting, word or trace of the man suspected of her murder.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n Britain's most-wanted fugitive is still on the run - exactly 20 years after the fatal shooting of a young mother of three. Kevin Parle is a suspect in the murder of Lucy Hargreaves, 22, who was shot dead at her home in Liverpool before the house was set on fire on 3 August 2005. Since then, after many appeals for information, there has been no confirmed sighting, word or trace of him. Two decades on, Ms Hargreaves' family have had no justice. Two young men prosecuted for her murder had charges dropped when a judge ruled there was insufficient evidence against them. In a statement marking the anniversary of her death, they said: \"The way we lost Lucy is not something families can ever truly come to terms with - it is still incredibly difficult and painful to think about. \"Over the past 20 years, people will have talked with family and friends. A number of people were contacted by males using a phone that was stolen along with a vehicle used in Lucy's murder. \"We appeal directly to them to please come forward. Now is the time.\" Three men burst into Lucy's home 20 years ago today, shot her dead as she slept on a sofa, and set alight the duvet she'd been sleeping under. It's believed the gang were looking for her boyfriend Gary Campbell, who was upstairs. He fled from a window with their two-year-old daughter and then tried in vain to save Ms Hargreaves. Mr Campbell had allegedly been a passenger in a stolen car that had hit and killed a young boy 12 years earlier, supposedly the motive for the shooting. He denied he was in the car at the time. Howard Rubbery, head of the Serious Crime Review Unit at Merseyside Police said: \"The family remain absolutely devastated by Lucy's death. \"It's important to note Lucy is an absolutely innocent victim. She's not from a family of criminality. She wasn't involved in criminality. \"The hunt for Kevin Parle is very much on, and we ask anybody with information, anybody who is close to Parle and knows where he is, to please come forward. \"There were three males responsible for this offence and we are looking for justice for Lucy's family in relation to all three. \"I do believe that there are people out there who have yet to speak to the police, even though it's 20 years on, who hold information that's absolutely vital to our investigation.\" Police believe Parle, now in his 40s, fled to Spain where he hid among the vast expat community with criminal help. Several years later, I tracked his movements to a holiday complex near Torrevieja, where staff convinced me he had stayed there for several weeks. 'Huge value to organised crime' Former Scotland Yard detective Peter Bleksley, who recently spent four years on a personal hunt for Parle, also visited the complex and said: \"He was bold and he was brash and he had a girlfriend at one point. \"The police actually should have captured him there, but they were too late.\" He claimed he nearly caught up with Parle at a villa elsewhere in Spain, but spooked him into disappearing again. Mr Bleksley hosted an award-winning podcast and wrote a book in which he chronicled his manhunt. He said: \"Kevin Parle has remained hidden because he is funded, protected, looked after and of huge value to global, serious and organised crime.\" Parle can't be hard to spot - he's well-built, 6ft 5in tall, red-haired with a face scar and, originally at least, has a Liverpool accent. Of course, he might be dead. Mr Bleksley said: \"I can think of many reasons why certain criminals would want to get rid of Kevin Parle because he could, in terms of evidence about the cases that he's wanted for, should he flip and become a witness for the Crown, be highly damaging for a lot of very tasty criminals.\" Parle is also wanted in connection with the murder of 16-year-old Liam Kelly, who was shot dead over an alleged £200 debt in June 2004, a year before Lucy's death. Parle was arrested and questioned, but then freed on bail. There have been reports of the fugitive in Australia and Dubai, but nothing to corroborate any of them. If he's alive and if no one is prepared to shop him, what might lead to his capture? \"I think when he has a fallout with those who have guarded him, funded him, fed him, put a roof over his head and all of that, maybe even paid for his plastic surgery that could have altered his appearance,\" Mr Bleksley said. \"When he finally has a fallout, when he's no longer of use, then perhaps that will be the day that somebody goes, Peter, he's here.\""
    },
    {
        "title": "Hamas responds to disarmament reports as health officials say 18 killed in Israeli fire - including people trying to access food",
        "description": "Hamas has said it will not disarm unless an independent Palestinian state is established with Jerusalem as its capital.",
        "url": "https://news.sky.com/story/hamas-responds-to-disarmament-reports-as-health-officials-say-18-killed-in-israeli-fire-including-people-trying-to-access-food-13405722",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hamas-gaza_6980915.jpg?20250802152347",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-02 13:59:00",
        "Headline": "Hamas also condemned a US envoy's visit to an aid distribution centre in Gaza as \"nothing more than a premeditated staged show\".",
        "Content": "Hamas has said it will not disarm unless an independent Palestinian state is established with Jerusalem as its capital. The militant group said it was issuing a statement \"in response to media reports quoting US envoy Steve Witkoff, claiming [Hamas] has shown willingness to disarm\". It continued: \"We reaffirm that resistance and its arms are a legitimate national and legal right as long as the occupation continues. \"This right is recognised by international laws and norms, and it cannot be relinquished except through the full restoration of our national rights - first and foremost, the establishment of an independent, fully sovereign Palestinian state with Jerusalem as its capital.\" Hamas also condemned Mr Witkoff's visit to an aid distribution centre in Gaza on Friday as \"nothing more than a premeditated staged show\". Donald Trump's Middle East envoy Mr Witkoff and Mike Huckabee, the US ambassador to Israel, visited a centre run by the controversial Gaza Humanitarian Foundation (GHF).  Hamas said the trip was \"designed to mislead public opinion, polish the image of the occupation, and provide it with political cover for its starvation campaign and continued systematic killing of defenceless children and civilians in the Gaza Strip\". Mr Witkoff said he spent \"over five hours in Gaza\". In a post on X on Friday, he said: \"The purpose of the visit was to give [President Trump] a clear understanding of the humanitarian situation and help craft a plan to deliver food and medical aid to the people of Gaza.\" Elidalis Burges, a critical care nurse in Gaza, told Sky News she saw the US visit as a \"PR stunt\" and that the American officials were \"just being shown a small portion of what is actually happening\".  \"I think the visit to the GHF site was just a controlled visit dictated by the Israeli military,\" she said. \"If they really wanted people to see what is happening here, they would allow international journalists from around the world to enter. \"They would allow the leaders of the world to come here and see.\" Hamas releases hostage video It comes as Hamas released a video showing Israeli man, Evyatar David, being held hostage in what appears to be a tunnel.  Mr David was taken from the Nova Music Festival on 7 October 2023. His family have given permission for media outlets to show the video. More than a dozen killed by Israeli fire Gaza health officials have said 18 people, including eight who were trying to access food, were killed by Israeli fire on Saturday. Witness Yahia Youssef told Reuters news agency he helped carry three people wounded by gunshots and saw others lying on the ground near a food distribution centre. In response to questions about several eyewitness accounts of violence at one of its facilities, GHF said \"nothing [happened] at or near our sites\". The US and Israel-backed GHF has been marred by controversy and fatal shootings ever since it was set up earlier this year. According to the United Nations' human rights office, at least 859 people have been killed \"in the vicinity\" of GHF aid sites since late May. Read more:Doctor says colleague 'followed and killed by drone''Little confidence' in US officials seeing full picture Dr Tom Adamkiewicz, who is working at a hospital in Gaza, has said Palestinian children, women and men are \"being shot at, basically like rabbits\". It is a \"level of barbarity I don't think the world has seen\", he told Sky News. The Israel Defence Forces has repeatedly said it \"categorically rejects the claims of intentional harm to civilians\" and has blamed Hamas militants for fomenting chaos and endangering civilians.  The war in Gaza began when Hamas-led militants killed around 1,200 people, mostly civilians, in an attack on Israel on 7 October 2023 and abducted 251 others. Of those, they still hold around 50, with 20 believed to be alive, after most of the others were released in ceasefires or other deals. Israel's retaliatory offensive has killed more than 60,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "Jon Ruben remanded into custody on child cruelty charges after children fell ill at summer camp",
        "description": "A man has been remanded into custody charged with child cruelty offences after allegedly lacing sweets with sedatives.",
        "url": "https://news.sky.com/story/jon-ruben-remanded-into-custody-on-child-cruelty-charges-after-children-fell-ill-at-summer-camp-13405446",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jonathon-ruben-leicester_6980556.jpg?20250802110145",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-02 05:06:00",
        "Headline": "Leicestershire Police received a report of children feeling unwell at a camp being held at Stathern Lodge, near Melton, last Sunday.",
        "Content": "A man has been remanded into custody charged with child cruelty offences after allegedly lacing sweets with sedatives. Jon Ruben, 76, of Ruddington, Nottinghamshire, appeared at Leicester Magistrates' Court on Saturday after youngsters fell ill at a summer camp in Stathern, Leicestershire. He has been charged with three counts of wilfully assaulting, ill-treating, neglecting, abandoning or exposing children in a manner likely to cause them unnecessary suffering or injury to health. The charges relate to three boys at the camp between 25-29 July. Ruben spoke only to confirm his name, age and address. Police received a report of children feeling unwell at a camp being held at Stathern Lodge, near Melton in Leicestershire, last Sunday. Officers said paramedics attended the scene and eight boys - aged between eight and 11 - were taken to hospital as a precaution, as was an adult. They have since been discharged. Read more from Sky News:Couple relive watching Rotherham riots unfoldWhy the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe Police said the \"owners and operators of Stathern Lodge are independent from those people who use or hire the lodge and are not connected to the incident\". Leicestershire Police has referred itself to the Independent Office for Police Conduct, after officers initially reported the incident as having happened on Monday, only to later amend it to Sunday. It is still unclear when officers responded and whether that is why the watchdog referral has been made. Ruben will next appear at Leicester Crown Court on 29 August."
    },
    {
        "title": "India hints it will keep buying Russian oil - despite Trump threats",
        "description": "India has indicated it will defy threats made by US President Donald Trump and continue buying Russian oil.",
        "url": "https://news.sky.com/story/india-hints-it-will-keep-buying-russian-oil-despite-trump-threats-13406054",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russian-oil-tanker_6981429.jpg?20250802222602",
        "type": "Home",
        "Author": "Victoria Seabrook, news reporter",
        "Date Published": "2025-08-02 20:41:00",
        "Headline": "India appeared to double down on Russian oil after Donald Trump criticised the relationship between the two major economies - as his frustration with Russian President Vladimir Putin mounts.",
        "Content": "By Victoria Seabrook, news reporter  India has indicated it will defy threats made by US President Donald Trump and continue buying Russian oil. The world's third-largest crude importer - after China and the US - cashed in on cheap Russian oil when its price plummeted after Vladimir Putin's full-scale invasion of Ukraine. Historically, it had bought most of its crude from countries in the Middle East. But this changed after the invasion in February 2022, when western countries slapped sanctions on Russia in a bid to choke off money fuelling Moscow's war chest.  It prompted the recent energy crisis that saw household bills in the UK soar. On Friday, the Indian foreign ministry said its relationship with Russia was \"steady and time-tested\", and warned against viewing it through the lens of another country. \n                  Trump orders two nuclear subs to be moved closer to Russia\n                 \n                  Trump ally calls for big tech 'united front' to fight UK and EU online safety laws\n                 \n                  Epstein abuse survivor Virginia Giuffre wanted files released, her family say\n                 Addressing a weekly meeting, spokesman Randhir Jaiswal said India's general position on procuring energy was guided by supply in the markets and prevailing global circumstances. The sentiment was echoed by two further government sources cited by the Reuters news agency. \"These are long-term oil contracts,\" one of the sources said. \"It is not so simple to just stop buying overnight.\" India is highly dependent on oil imports, which supply 87% of its needs, according to the International Energy Agency. The comments follow a threat made by President Trump to impose a 25% tariff on goods from India, as well as an additional import tax, because of New Delhi's purchases of Russian oil. The US president made ending the war in Ukraine a top priority - pledging to do so within his first 24 hours in office. But recently Mr Trump - who has repeatedly praised the Mr Putin over the years - has started to sour on the Russian leader for failing to agree to a ceasefire in Ukraine.  He called it \"disappointing\" and also threatened new economic sanctions on Russia if progress is not made. Mr Trump also this week said he had ordered two US nuclear submarines to be positioned in the \"appropriate regions\" in a row with former Russian president Dmitry Medvedev. The pressure on India comes after it upped it Russian crude purchases from 68,000 barrels per day in January 2022 to 1.12 million barrels per day by June that year. Supplies rose as high as nearly 40% of India's imports at one point, making Russia the largest supplier of crude to New Delhi, according to the Press Trust of India, citing data from analytics firm Kpler. Home to 1.3 billion people, India is expected to become an even bigger oil consumer over the remainder of the decade, fuelled by spectacular growth in its economy, as well as rising population and demographics. Demand has been rising fastest for petrol, with rising household incomes sparking a boom in motorcycle and car ownership."
    },
    {
        "title": "Lucy was murdered in 2005. There's been no confirmed sighting of a key suspect ever since",
        "description": "Britain's most-wanted fugitive is still on the run - exactly 20 years after the fatal shooting of a young mother of three.",
        "url": "https://news.sky.com/story/lucy-hargreaves-was-shot-dead-in-2005-her-home-set-on-fire-a-suspect-in-her-murder-is-still-at-large-13405512",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-lucy-hargreaves-appeal_6980614.jpg?20250802121632",
        "type": "UK",
        "Author": "Martin Brunt",
        "Date Published": "2025-08-02 23:27:00",
        "Headline": "Lucy Hargreaves was shot dead at her home in Liverpool in 2005. After 20 years and many appeals for information, there has been no confirmed sighting, word or trace of the man suspected of her murder.",
        "Content": "\n          Crime correspondent\n              @skymartinbrunt\n Britain's most-wanted fugitive is still on the run - exactly 20 years after the fatal shooting of a young mother of three. Kevin Parle is a suspect in the murder of Lucy Hargreaves, 22, who was shot dead at her home in Liverpool before the house was set on fire on 3 August 2005. Since then, after many appeals for information, there has been no confirmed sighting, word or trace of him. Two decades on, Ms Hargreaves' family have had no justice. Two young men prosecuted for her murder had charges dropped when a judge ruled there was insufficient evidence against them. In a statement marking the anniversary of her death, they said: \"The way we lost Lucy is not something families can ever truly come to terms with - it is still incredibly difficult and painful to think about. \"Over the past 20 years, people will have talked with family and friends. A number of people were contacted by males using a phone that was stolen along with a vehicle used in Lucy's murder. \"We appeal directly to them to please come forward. Now is the time.\" Three men burst into Lucy's home 20 years ago today, shot her dead as she slept on a sofa, and set alight the duvet she'd been sleeping under. It's believed the gang were looking for her boyfriend Gary Campbell, who was upstairs. He fled from a window with their two-year-old daughter and then tried in vain to save Ms Hargreaves. Mr Campbell had allegedly been a passenger in a stolen car that had hit and killed a young boy 12 years earlier, supposedly the motive for the shooting. He denied he was in the car at the time. Howard Rubbery, head of the Serious Crime Review Unit at Merseyside Police said: \"The family remain absolutely devastated by Lucy's death. \"It's important to note Lucy is an absolutely innocent victim. She's not from a family of criminality. She wasn't involved in criminality. \"The hunt for Kevin Parle is very much on, and we ask anybody with information, anybody who is close to Parle and knows where he is, to please come forward. \"There were three males responsible for this offence and we are looking for justice for Lucy's family in relation to all three. \"I do believe that there are people out there who have yet to speak to the police, even though it's 20 years on, who hold information that's absolutely vital to our investigation.\" Police believe Parle, now in his 40s, fled to Spain where he hid among the vast expat community with criminal help. Several years later, I tracked his movements to a holiday complex near Torrevieja, where staff convinced me he had stayed there for several weeks. 'Huge value to organised crime' Former Scotland Yard detective Peter Bleksley, who recently spent four years on a personal hunt for Parle, also visited the complex and said: \"He was bold and he was brash and he had a girlfriend at one point. \"The police actually should have captured him there, but they were too late.\" He claimed he nearly caught up with Parle at a villa elsewhere in Spain, but spooked him into disappearing again. Mr Bleksley hosted an award-winning podcast and wrote a book in which he chronicled his manhunt. He said: \"Kevin Parle has remained hidden because he is funded, protected, looked after and of huge value to global, serious and organised crime.\" Parle can't be hard to spot - he's well-built, 6ft 5in tall, red-haired with a face scar and, originally at least, has a Liverpool accent. Of course, he might be dead. Mr Bleksley said: \"I can think of many reasons why certain criminals would want to get rid of Kevin Parle because he could, in terms of evidence about the cases that he's wanted for, should he flip and become a witness for the Crown, be highly damaging for a lot of very tasty criminals.\" Parle is also wanted in connection with the murder of 16-year-old Liam Kelly, who was shot dead over an alleged £200 debt in June 2004, a year before Lucy's death. Parle was arrested and questioned, but then freed on bail. There have been reports of the fugitive in Australia and Dubai, but nothing to corroborate any of them. If he's alive and if no one is prepared to shop him, what might lead to his capture? \"I think when he has a fallout with those who have guarded him, funded him, fed him, put a roof over his head and all of that, maybe even paid for his plastic surgery that could have altered his appearance,\" Mr Bleksley said. \"When he finally has a fallout, when he's no longer of use, then perhaps that will be the day that somebody goes, Peter, he's here.\""
    },
    {
        "title": "Rival groups face off outside migrant hotel - as asylum seekers 'blow kisses' at protesters",
        "description": "Several demonstrators have been detained after rival groups faced off over a hotel accommodating asylum seekers in north London, with police breaking up brief clashes. ",
        "url": "https://news.sky.com/story/rival-groups-face-off-outside-migrant-hotel-as-asylum-seekers-blow-kisses-at-protesters-13405697",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-thistle-city-barbican_6980978.jpg?20250802154713",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-02 13:37:00",
        "Headline": "People believed to be asylum seekers watched on from inside the Thistle City Barbican Hotel in Islington, north London, with some waving and blowing kisses from the windows.",
        "Content": " Several demonstrators have been detained after rival groups faced off over a hotel accommodating asylum seekers in north London, with police breaking up brief clashes.  The Metropolitan Police has since imposed conditions on the protest and counter-protest outside the Thistle City Barbican Hotel in Islington. The protest was organised by local residents under the banner \"Thistle Barbican needs to go - locals say no\". The group of several hundred people waved union flags and banners, and one man chanted: \"Get these scum off our streets.\" A larger group staged a counter demonstration to voice support for asylum seekers, bearing a banner that read: \"Refugees are welcome.\" People inside the hotel, believed to be migrants, watched on, with some waving and blowing kisses from the windows. A man wearing an England football shirt was detained by police after getting into an altercation with officers. \n                  Small boat Channel arrivals pass 25,000 - the earliest in year figure has been reached so far\n                 \n                  Man suffers cardiac arrest on boat trying to reach UK\n                 \n                  Epping disorder: Police launch appeal to find two men\n                 There have been nine arrests so far, six of which were for breaching conditions police put on the protests under the Public Order Act. One was for also breaching those conditions, as well as twice assaulting an emergency worker. Police also arrested a 22-year-old woman for expressing support for Palestine Action. And a 33-year-old man, who was a part of the anti-immigration demonstration, was arrested for a racially aggravated public order offence. Rival groups separated by police Another protest was scheduled in Newcastle on Saturday, outside The New Bridge Hotel, as anti-migrant sentiment ripples through some communities around the country, also flaring up recently in Epping.  The counter-protest in London was organised by local branches of Stand Up To Racism, and supported by former Labour leader and Islington North MP Jeremy Corbyn. Other community groups including Finsbury Park Mosque and Islington Labour Party were also involved. Groups online that backed the original protest include \"Patriots of Britain\" and \"Together for the Children\". At one point, a large group of masked protesters dressed in black, calling themselves anti-fascists, appeared from a side street and marched towards the rival group outside the hotel. The two groups briefly clashed before police rushed in to separate them. Why are asylum hotels used? The government is legally required to provide accommodation and subsistence to destitute asylum seekers while their claims are being decided, most of whom are prohibited from working. A jump in the use of hotels since 2020 has been attributed to the impacts of the COVID pandemic, a backlog in unresolved asylum cases, and an increase in the number of migrants crossing the Channel in small boats. However, the number of asylum seekers living in hotels has fallen recently, from 38,079 at the end of 2024 to 32,345 at the end of March 2025, according to the Refugee Council. How police tried to keep groups apart The police imposed conditions on both groups in London to prevent \"serious disorder\" and minimise disruption to the community. Those in the anti-asylum hotel protest were told to remain within King Charles Square, and to gather not before 1pm and wrap up by 4pm. Those in the counter-protest were to required to stay in an area in Lever Street, and assemble only between 12pm and 4pm, but were still in eye and ear shot of the other group. Chief Superintendent Clair Haynes, in charge of the policing operation, said: \"We have been in discussions with the organisers of both protests in recent days, building on the ongoing engagement between local officers, community groups and partners. \"We understand that there are strongly held views on all sides. \"Our officers will police without fear or favour, ensuring those exercising their right to protest can do so safely, but intervening at the first sign of actions that cross the line into criminality.\" Meanwhile, the protest in Newcastle was promoted by online posts saying it was \"for our children, for our future\". The \"stop the far right and fascists in Newcastle\" counter-protest was organised by Stand Up To Racism at the nearby Laing Art Gallery."
    },
    {
        "title": "Jon Ruben remanded into custody on child cruelty charges after children fell ill at summer camp",
        "description": "A man has been remanded into custody charged with child cruelty offences after allegedly lacing sweets with sedatives.",
        "url": "https://news.sky.com/story/jon-ruben-remanded-into-custody-on-child-cruelty-charges-after-children-fell-ill-at-summer-camp-13405446",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jonathon-ruben-leicester_6980556.jpg?20250802110145",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-02 05:06:00",
        "Headline": "Leicestershire Police received a report of children feeling unwell at a camp being held at Stathern Lodge, near Melton, last Sunday.",
        "Content": "A man has been remanded into custody charged with child cruelty offences after allegedly lacing sweets with sedatives. Jon Ruben, 76, of Ruddington, Nottinghamshire, appeared at Leicester Magistrates' Court on Saturday after youngsters fell ill at a summer camp in Stathern, Leicestershire. He has been charged with three counts of wilfully assaulting, ill-treating, neglecting, abandoning or exposing children in a manner likely to cause them unnecessary suffering or injury to health. The charges relate to three boys at the camp between 25-29 July. Ruben spoke only to confirm his name, age and address. Police received a report of children feeling unwell at a camp being held at Stathern Lodge, near Melton in Leicestershire, last Sunday. Officers said paramedics attended the scene and eight boys - aged between eight and 11 - were taken to hospital as a precaution, as was an adult. They have since been discharged. Read more from Sky News:Couple relive watching Rotherham riots unfoldWhy the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe Police said the \"owners and operators of Stathern Lodge are independent from those people who use or hire the lodge and are not connected to the incident\". Leicestershire Police has referred itself to the Independent Office for Police Conduct, after officers initially reported the incident as having happened on Monday, only to later amend it to Sunday. It is still unclear when officers responded and whether that is why the watchdog referral has been made. Ruben will next appear at Leicester Crown Court on 29 August."
    },
    {
        "title": "Why the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe performers ",
        "description": "For years now, many performers at Edinburgh Fringe have spoken about their struggles to afford the sky-high prices for their accommodation each August.",
        "url": "https://news.sky.com/story/why-the-oasis-effect-has-been-catastrophic-for-edinburgh-fringe-performers-13405222",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-cardiff_6957505.jpg?20250704233136",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-02 00:14:00",
        "Headline": "With Oasis's reunion tour coming to the city for three nights, the cost of securing a room for a month at the arts festival is even higher.",
        "Content": "\n          Arts and entertainment correspondent\n        For years now, many performers at Edinburgh Fringe have spoken about their struggles to afford the sky-high prices for their accommodation each August. This year, with Oasis's reunion tour coming to the city for three nights, the cost of securing a room for a month at the biggest arts festival in the world is even higher. Comedian Marc Borrows says \"the 'Oasis effect' on the Fringe economy has been catastrophic\". Rather fittingly, his stand-up show this year is called The Britpop Hour. \"It's an idea I'd had in my back pocket for a while,\" he explains. \"Then the band reformed and when I saw they were playing Edinburgh I thought 'yeah, this is the year to do this!'\" While he's thrilled that the Gallagher brothers are coming to town, it means many performers are taking a financial hit. \"I'll give you an example, I tried to get the same flat that I've had the last two years at the Fringe, a student flat, nothing fancy, and it costs an extra thousand pounds this year.\" Because of the increased demand for beds, newcomer Amy Albright will be sleeping in her red Volkswagen for her two-week stint at the Fringe. \"Costs are even more expensive,\" she says. \"It's just not an option for me, so instead I'm living in my car.\" With blackout blinds and a portable coffee maker, she says it's actually not as bad as some might think. \"I park just outside of town in a really nice safe area, I use a gym for showers ... this saves me so much money ... I wouldn't be able to afford to perform at the Fringe otherwise.\" Holly Spillar's show Tall Child explores her relationship with class. She was fortunate enough to be one of 180 recipients of a £2,500 bursary from the Edinburgh Festival Fringe Society. It is the third year the Keep it Fringe fund has been run, backed this year by a £1m injection of government money. As Holly explains: \"I live month to month on a minimum wage job ... and it costs me about five grand to do the fringe.\" Alongside the grant, she's also had to take out a loan, which she says will take her two years to pay back. \"It's a very precarious situation you put yourself in just to be in the room,\" she adds. Chloe Petts - now an established name on the comedy circuit - says the problem needs to be recognised for being less about Oasis and more about a problem that's been brewing for years. \"Accommodation is just totally out of control,\" she says. \"If this leads us to further conversations about that, then fantastic but ... it has to be a conversation about how it's totally unaffordable for the average person to come to the Fringe, and I think that's stopping a lot of people coming up who deserve to be here.\" Scottish comedian Susan McCabe, a lifelong Oasis fan, reckons there's no point getting too worked up, especially given the siblings fractious relationship. \"We are here every year and they may not even be here for those three gigs ... they might have fallen out by then!\" She adds: \"It is what it is, at the end of the day ... they were the greatest rock and roll band of the 1990s, just let them be.\" Read more:Jewish comedian says shows cancelled - as Gaza in spotlightWatch: How do geopolitics feed into Fringe festival? • Amy Albright is performing her stand-up at locations across Edinburgh, including Not My Audience!, on 8 August• Holly Spillar: Tall Child is at Underbelly until 24 August• Chloe Petts: Big Naturals is at Pleasance Courtyard until 24 August• Susan McCabe: Best Behaviour is at Gordon Aikman Theatre until 24 August• The Britpop Hour with Marc Burrows is at Underbelly until 25 August"
    },
    {
        "title": "Another arrest after aircraft vandalised at RAF Brize Norton",
        "description": "Another arrest has been made in connection with two aircraft being damaged at RAF Brize Norton in Oxfordshire.",
        "url": "https://news.sky.com/story/another-arrest-after-aircraft-vandalised-at-raf-brize-norton-13405535",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brize-plane_6946806.jpg?20250627113358",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-02 10:34:00",
        "Headline": "The arrest follows four people being charged last month in connection with the incident, which saw two Voyager planes damaged at RAF Brize Norton, Oxfordshire, on 20 June.",
        "Content": "Another arrest has been made in connection with two aircraft being damaged at RAF Brize Norton in Oxfordshire. A 22-year-old man, of no fixed abode, was arrested on Friday in Bedford on suspicion of the commission, preparation or instigation of acts of terrorism, contrary to Section 41 of the Terrorism Act 2000, Counter Terrorism Policing South said. Two Voyager planes were damaged at RAF Brize Norton, Oxfordshire, on 20 June. The arrested man is currently in police custody, police added. The Palestine Action group claimed responsibility for causing £7m worth of damage to the aircraft. Four people were charged last month in connection with the security breach and vandalism. Amy Gardiner-Gibson, 29, Lewie Chiaramello, 22, Daniel George Jeronymides-Norie, 36, and Jony Cink, 24, are accused of conspiring to damage the aircraft and entering a prohibited area. They are alleged to have ridden scooters onto RAF Brize Norton and sprayed the planes with red paint on 20 June. Read more:UK's conditional Palestine recognition planDoctor says medic and pregnant woman attacked in GazaProtesters demonstrate against banning of Palestine Action Palestine Action was proscribed under the Terrorism Act 2000 at the start of last month, after MPs overwhelmingly voted in favour of adding the protest group to the list of banned organisations with the likes of National Action, al Qaeda, ISIS and Hezbollah."
    },
    {
        "title": "Murder investigation launched after teenager stabbed in Bury car park",
        "description": "A murder investigation has been launched after the death of a teenager who was stabbed in a car park.",
        "url": "https://news.sky.com/story/murder-investigation-launched-after-teenager-stabbed-in-bury-car-park-13405612",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-market-street-bury_6980757.jpg?20250802134137",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-02 12:13:00",
        "Headline": "Greater Manchester Police said the attack was \"targeted\" and there will be a police presence in the area in the coming days.",
        "Content": "A murder investigation has been launched after the death of a teenager who was stabbed in a car park. The 19-year-old was attacked just before 9pm on 1 August in a car park on Market Street in Bury, Greater Manchester Police (GMP) said. He sustained several stab wounds and later died from his injuries. The force said no arrests have been made so far. Detective Chief Inspector John Charlton, from GMP, said specially trained officers are supporting the victim's family after the \"tragic and upsetting incident\". He said: \"This incident will have shocked the community and distressed anyone who witnessed it, but we believe this was a targeted attack with no wider threat. \"We have several scenes in place with the investigation ongoing in order to identify and apprehend the offenders responsible. \"There will be officers in the area today and in the coming days as we are determined to bring the family the answers they deserve.\" Read more from Sky News:Man remanded into custody on child cruelty chargesFresh arrest after aircraft vandalised at RAF base GMP urged anyone with information connected to the attack to contact the force."
    },
    {
        "title": "Hamas responds to disarmament reports as health officials say 18 killed in Israeli fire - including people trying to access food",
        "description": "Hamas has said it will not disarm unless an independent Palestinian state is established with Jerusalem as its capital.",
        "url": "https://news.sky.com/story/hamas-responds-to-disarmament-reports-as-health-officials-say-18-killed-in-israeli-fire-including-people-trying-to-access-food-13405722",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hamas-gaza_6980915.jpg?20250802152347",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-02 13:59:00",
        "Headline": "Hamas also condemned a US envoy's visit to an aid distribution centre in Gaza as \"nothing more than a premeditated staged show\".",
        "Content": "Hamas has said it will not disarm unless an independent Palestinian state is established with Jerusalem as its capital. The militant group said it was issuing a statement \"in response to media reports quoting US envoy Steve Witkoff, claiming [Hamas] has shown willingness to disarm\". It continued: \"We reaffirm that resistance and its arms are a legitimate national and legal right as long as the occupation continues. \"This right is recognised by international laws and norms, and it cannot be relinquished except through the full restoration of our national rights - first and foremost, the establishment of an independent, fully sovereign Palestinian state with Jerusalem as its capital.\" Hamas also condemned Mr Witkoff's visit to an aid distribution centre in Gaza on Friday as \"nothing more than a premeditated staged show\". Donald Trump's Middle East envoy Mr Witkoff and Mike Huckabee, the US ambassador to Israel, visited a centre run by the controversial Gaza Humanitarian Foundation (GHF).  Hamas said the trip was \"designed to mislead public opinion, polish the image of the occupation, and provide it with political cover for its starvation campaign and continued systematic killing of defenceless children and civilians in the Gaza Strip\". Mr Witkoff said he spent \"over five hours in Gaza\". In a post on X on Friday, he said: \"The purpose of the visit was to give [President Trump] a clear understanding of the humanitarian situation and help craft a plan to deliver food and medical aid to the people of Gaza.\" Elidalis Burges, a critical care nurse in Gaza, told Sky News she saw the US visit as a \"PR stunt\" and that the American officials were \"just being shown a small portion of what is actually happening\".  \"I think the visit to the GHF site was just a controlled visit dictated by the Israeli military,\" she said. \"If they really wanted people to see what is happening here, they would allow international journalists from around the world to enter. \"They would allow the leaders of the world to come here and see.\" Hamas releases hostage video It comes as Hamas released a video showing Israeli man, Evyatar David, being held hostage in what appears to be a tunnel.  Mr David was taken from the Nova Music Festival on 7 October 2023. His family have given permission for media outlets to show the video. More than a dozen killed by Israeli fire Gaza health officials have said 18 people, including eight who were trying to access food, were killed by Israeli fire on Saturday. Witness Yahia Youssef told Reuters news agency he helped carry three people wounded by gunshots and saw others lying on the ground near a food distribution centre. In response to questions about several eyewitness accounts of violence at one of its facilities, GHF said \"nothing [happened] at or near our sites\". The US and Israel-backed GHF has been marred by controversy and fatal shootings ever since it was set up earlier this year. According to the United Nations' human rights office, at least 859 people have been killed \"in the vicinity\" of GHF aid sites since late May. Read more:Doctor says colleague 'followed and killed by drone''Little confidence' in US officials seeing full picture Dr Tom Adamkiewicz, who is working at a hospital in Gaza, has said Palestinian children, women and men are \"being shot at, basically like rabbits\". It is a \"level of barbarity I don't think the world has seen\", he told Sky News. The Israel Defence Forces has repeatedly said it \"categorically rejects the claims of intentional harm to civilians\" and has blamed Hamas militants for fomenting chaos and endangering civilians.  The war in Gaza began when Hamas-led militants killed around 1,200 people, mostly civilians, in an attack on Israel on 7 October 2023 and abducted 251 others. Of those, they still hold around 50, with 20 believed to be alive, after most of the others were released in ceasefires or other deals. Israel's retaliatory offensive has killed more than 60,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "Videos of emaciated Israeli hostage Evyatar David released by Hamas",
        "description": "Two videos of an emaciated Israeli hostage, Evyatar David, have been released by Hamas, after US special envoy Steve Witkoff this week met with the families of the hostages.",
        "url": "https://news.sky.com/story/videos-of-emaciated-israeli-hostage-evyatar-david-released-by-hamas-13405798",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-evyatar-david-hostage_6981161.jpg?20250802173646",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-02 15:20:00",
        "Headline": "Two videos show a skeletal 24-year-old Evyatar David after US officials visited a Gaza aid site and met with hostages' families. The UN says the starvation across the Strip is caused by Israel's blockade.",
        "Content": " Two videos of an emaciated Israeli hostage, Evyatar David, have been released by Hamas, after US special envoy Steve Witkoff this week met with the families of the hostages. The now 24-year-old looks skeletal, with his shoulder blades protruding from his back, and says he has not eaten for three days. The distressing videos show him apparently digging his own grave. He worked in a restaurant, according to a video posted by Labour Friends of Israel, before he was abducted from the Nova music festival on 7 October 2023.  Since then, he has been held in captivity in Gaza, and the videos suggest he is being kept in dark tunnels and surviving on scarce portions of lentils and beans. Gaza itself is suffering \"man-made mass starvation\" because of Israel's blockade on aid to the enclave, the head of the World Health Organization (WHO) has previously said. \n                  Hamas responds to disarmament reports as health officials say 18 killed in Israeli fire - including people trying to access food\n                 \n                  'Drone followed Gaza colleague home and wiped out his family', says British doctor\n                 \n                  US officials to make 'highly unusual' visit to Gaza - amid warnings of 'politically manmade' famine\n                 In the second video, released on Saturday, Mr David - according to the English subtitles - says: \"I haven't eaten for three days.\" The captions continue as he speaks while in an underground tunnel: \"There's no [sic] enough food. I barely get drinking water.\" The video shows him talking through what ate in July, which has been recorded on a handmade calendar hung up on the side of an underground Gaza tunnel. Speaking while under captivity and under duress, he adds: \"They give me what they can get.\" At the end of the video, he is digging a hole. The subtitle reads: \"This is the grave where I think I'm going to be buried in. Time is running out.\" He then appears to break down, crouching on the floor and leaning his head on his arm while still clinging to the shovel. In a statement, his family said: \"We are forced to witness our beloved son and brother, Evyatar David, deliberately and cynically starved in Hamas's tunnels in Gaza - a living skeleton, buried alive. \"Our son has only a few days left to live in his current condition.\" They added: \"Israel and the international community must oppose Hamas's cruelty and ensure that our Evyatar immediately receives proper nutrition. \"The intentional starvation, torture, and abuse of Evyatar for propaganda purposes violate even the lowest standards of humanitarian law and basic human decency.\"  'Famine' looms in Gaza On Friday, US special envoy Steve Witkoff visited a site where the US and Israel-backed Gaza Humanitarian Foundation (GHF) has been distributing food in Gaza. Read more: 'Little confidence' US Gaza delegation would see full picture The controversial GHF scheme has been widely condemned, including by the UK government, after fatal shootings ever since it was set up earlier this year. According to the United Nations' human rights office, at least 859 people have been killed \"in the vicinity\" of GHF aid sites since late May. The Israel Defence Forces has repeatedly said it \"categorically rejects the claims of intentional harm to civilians\" and has blamed Hamas militants for fomenting chaos and endangering civilians. Meanwhile, the UN's Integrated Food Security Phase Classification (IFSPC) this week said a \"worst-case scenario of famine\" was sinking in across the besieged enclave. It has also said more than 20,000 children have been treated for acute malnutrition since April. Families of the 50 hostages still in Gaza are concerned they are also starving, and blame Hamas. On Saturday, Gaza's health ministry said a further seven Palestinians had died of malnutrition-related causes in the past 24 hours, including a child."
    },
    {
        "title": "India hints it will keep buying Russian oil - despite Trump threats",
        "description": "India has indicated it will defy threats made by US President Donald Trump and continue buying Russian oil.",
        "url": "https://news.sky.com/story/india-hints-it-will-keep-buying-russian-oil-despite-trump-threats-13406054",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-russian-oil-tanker_6981429.jpg?20250802222602",
        "type": "World",
        "Author": "Victoria Seabrook, news reporter",
        "Date Published": "2025-08-02 20:41:00",
        "Headline": "India appeared to double down on Russian oil after Donald Trump criticised the relationship between the two major economies - as his frustration with Russian President Vladimir Putin mounts.",
        "Content": "By Victoria Seabrook, news reporter  India has indicated it will defy threats made by US President Donald Trump and continue buying Russian oil. The world's third-largest crude importer - after China and the US - cashed in on cheap Russian oil when its price plummeted after Vladimir Putin's full-scale invasion of Ukraine. Historically, it had bought most of its crude from countries in the Middle East. But this changed after the invasion in February 2022, when western countries slapped sanctions on Russia in a bid to choke off money fuelling Moscow's war chest.  It prompted the recent energy crisis that saw household bills in the UK soar. On Friday, the Indian foreign ministry said its relationship with Russia was \"steady and time-tested\", and warned against viewing it through the lens of another country. \n                  Trump orders two nuclear subs to be moved closer to Russia\n                 \n                  Trump ally calls for big tech 'united front' to fight UK and EU online safety laws\n                 \n                  Epstein abuse survivor Virginia Giuffre wanted files released, her family say\n                 Addressing a weekly meeting, spokesman Randhir Jaiswal said India's general position on procuring energy was guided by supply in the markets and prevailing global circumstances. The sentiment was echoed by two further government sources cited by the Reuters news agency. \"These are long-term oil contracts,\" one of the sources said. \"It is not so simple to just stop buying overnight.\" India is highly dependent on oil imports, which supply 87% of its needs, according to the International Energy Agency. The comments follow a threat made by President Trump to impose a 25% tariff on goods from India, as well as an additional import tax, because of New Delhi's purchases of Russian oil. The US president made ending the war in Ukraine a top priority - pledging to do so within his first 24 hours in office. But recently Mr Trump - who has repeatedly praised the Mr Putin over the years - has started to sour on the Russian leader for failing to agree to a ceasefire in Ukraine.  He called it \"disappointing\" and also threatened new economic sanctions on Russia if progress is not made. Mr Trump also this week said he had ordered two US nuclear submarines to be positioned in the \"appropriate regions\" in a row with former Russian president Dmitry Medvedev. The pressure on India comes after it upped it Russian crude purchases from 68,000 barrels per day in January 2022 to 1.12 million barrels per day by June that year. Supplies rose as high as nearly 40% of India's imports at one point, making Russia the largest supplier of crude to New Delhi, according to the Press Trust of India, citing data from analytics firm Kpler. Home to 1.3 billion people, India is expected to become an even bigger oil consumer over the remainder of the decade, fuelled by spectacular growth in its economy, as well as rising population and demographics. Demand has been rising fastest for petrol, with rising household incomes sparking a boom in motorcycle and car ownership."
    },
    {
        "title": "'Drone followed Gaza colleague home and wiped out his family', says British doctor",
        "description": "A British doctor who has just returned from Gaza says a drone followed her colleague home where it wiped out his family. ",
        "url": "https://news.sky.com/story/gaza-woman-21-lost-baby-after-being-blown-up-in-her-tent-british-doctor-says-13405332",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-nada-al-hadithy-gaza_6980248.jpg?20250801202533",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-02 06:11:00",
        "Headline": "It comes after Donald Trump's Middle East envoy visited a food distribution site in Gaza. Steve Witkoff and the US ambassador to Israel, Mike Huckabee, toured a Gaza Humanitarian Foundation (GHF) distribution site in the southern city of Rafah.",
        "Content": " A British doctor who has just returned from Gaza says a drone followed her colleague home where it wiped out his family.  Nada Al Hadithy also told Sky News presenter Matt Barbet. how one of her patients, a 21-year-old woman who was six months pregnant, lost her baby after she was \"blown up in her tent\". \"Her husband was killed, she lost her eye, she had an open fracture, and both her legs were completely destroyed from the bomb blast,\" \"This woman is completely emaciated, with no vitamins, no food. And one day her baby stopped moving.\" It comes after Donald Trump's Middle East envoy visited a food distribution site in Gaza. Steve Witkoff and the US ambassador to Israel, Mike Huckabee, toured a Gaza Humanitarian Foundation (GHF) distribution site in the southern city of Rafah on Friday. The Israeli-backed American contractor's efforts to deliver food to the region have been mired in violence and controversy, with hundreds killed by Israeli fire while walking to such aid sites since May, according to eyewitnesses, health officials and the UN human rights office. Israel's military says it has only fired warning shots at people who approached its forces, while GHF said its armed contractors have only fired warning shots to prevent deadly crowding.  Ms Hadithy said the situation in Gaza is \"absolutely desperate\" and a school classroom's worth of children \"are dying every single day\". She said there was \"a tangible difference in the amount of starvation and the emaciation of our patients\" during the three weeks she was in Gaza, adding: \"Even the severity of and relentlessness of the bombings was worse. \"It was mass casualty after mass casualty, with people being blown up in their tents, which were meant to be in green zones. The situation was catastrophic.\" She said one colleague - who she described as \"patient, joyful and hardworking\" - was followed home one day by a quadcopter drone, according to eyewitness testimony from fellow medical workers. The drone \"didn't kill him on the route where he was on his own, it waited until he was in his tent and greeted his three children and killed all of them\", she added. During her time in Gaza, Ms Hadithy said she saw \"emaciated children\", adding: \"So now you've got two million starving people in [an area] the same size as Exeter, which in our country and in our census in 2021 had 130,000 people in it. \"That's two million people with no water, no sanitation, no food, no medical supplies.\" Ms Hadithy also said Gazan health workers themselves are starving. \"Never before have I seen such dignified, committed people,\" she added. Read more:Sky News unveils pattern of deadly Israeli attacks on familiesExplainer: What does recognising a Palestinian state mean? In a post on X, Mr Witkoff said he had spent more than five hours inside Gaza to gain \"a clear understanding of the humanitarian situation and help craft a plan to deliver food and medical aid to the people of Gaza\". He did not request any meetings with UN officials in Gaza during the visit, UN deputy spokesperson Farhan Haq said.  The war began when Hamas-led militants killed around 1,200 people, mostly civilians, in an attack on Israel on 7 October 2023 and abducted 251 others. Of those, they still hold around 50, with 20 believed to be alive, after most of the others were released in ceasefires or other deals. Israel's retaliatory offensive has killed more than 60,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count. The Israel Defence Forces (IDF) has been approached for a comment."
    },
    {
        "title": "US manhunt for 'dangerous' murder suspect who dropped off baby after four relatives found dead",
        "description": "A car has been found during the search for a man suspected of killing the parents, grandmother and uncle of a baby girl found abandoned in a US state.\n\n",
        "url": "https://news.sky.com/story/us-manhunt-for-dangerous-murder-suspect-who-dropped-off-baby-after-four-relatives-found-dead-13405464",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-drummond-tennessee_6980497.jpg?20250802091710",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-02 06:48:00",
        "Headline": "Austin Robert Drummond, 28, is suspected of having murdered James M Wilson, 21, Adrianna Williams, 20, Cortney Rose, 38, and Braydon Williams, 15, who were identified on Wednesday.",
        "Content": "A car has been found during the search for a man suspected of killing the parents, grandmother and uncle of a baby girl found abandoned in a US state.\n\n Austin Robert Drummond, 28, is suspected of having murdered four relatives in Tennessee - James M Wilson, 21, Adrianna Williams, 20, Cortney Rose, 38, and Braydon Williams, 15, who were identified on Wednesday. Mr Wilson and Adrianna Williams were the parents of the infant found alive in a car seat in a front yard on Tuesday afternoon. Police say Drummond then dropped off the baby and made people aware of the child, in an act of \"compassion\". However, officers added Drummond remains on the run and should be considered \"armed and dangerous\". Ms Rose was Adrianna and Braydon Williams' mother, according to District Attorney Danny Goodman. No details have been given on how they were murdered. Drummond dropped off the seven-month-old infant and brought attention to people nearby to come get the child, Tennessee Bureau of Investigation Director David Rausch said during a news conference. The baby is safe and being cared for, according to Stephen Sutton, a spokesperson for the Lake and Dyer county sheriffs. \"While this was an extremely tragic and violent event... there was a sign of compassion, if you will,\" Mr Rausch said. \"That tells us that there's a possibility that Austin may have a sense that there is hope for him to be able to come in and have a conversation about what happened.\" Mr Rausch said he believes it was a targeted attack by Drummond, who had a relationship with the victims and their family. A relative of the victims posted on Facebook after the deaths, saying the suspect has \"literally been nothing short of amazing to us and our kids\", according to our US partner network NBC News. \"We all trusted him,\" the relative added. Read more US news:Tesla ordered to pay $243m over crashTrump orders nuclear subs closer to Russia The unoccupied car that police said Drummond had been driving was found on Friday in Jackson, Tennessee, about 70 miles from where the bodies were found and some 40 miles from where the baby was left in a car seat in a front yard. The Tennessee Bureau of Investigation has said it obtained warrants for Drummond. He is wanted on four counts of first-degree murder, one count of aggravated kidnapping, and weapons offences. Authorities offered a $15,000 reward for information leading to his arrest. Drummond was convicted of one count of aggravated robbery in August 2014, according to public records. His sentence ended in September 2024, according to Tennessee Department of Correction records. He was charged criminally for activities inside the prison, including attempted murder, after he completed the sentence that put him behind bars, District Attorney Mr Goodman said. Drummond was out on bond on the other charges at the time of the killings, he added."
    },
    {
        "title": "World champion sprinter Sha'Carri Richardson arrested for allegedly assaulting boyfriend at Washington airport",
        "description": "Reigning 100m world champion Sha'Carri Richardson was arrested last weekend for allegedly assaulting her boyfriend at an airport in Washington.",
        "url": "https://news.sky.com/story/world-champion-sprinter-shacarri-richardson-arrested-for-allegedly-assaulting-boyfriend-at-washington-airport-13405713",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-richardson-run_6980916.jpg?20250802152651",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-02 13:56:00",
        "Headline": "The US sprinter, 25, was arrested last Sunday on a fourth-degree domestic violence offence, according to a police report.",
        "Content": "Reigning 100m world champion Sha'Carri Richardson was arrested last weekend for allegedly assaulting her boyfriend at an airport in Washington. The American sprinter, 25, was arrested last Sunday on a fourth-degree domestic violence offence, according to a police report obtained by The Associated Press. That was four days before she ran in the opening round of the women's 100m event at the USA Track & Field (USATF) Championships in Eugene, Oregon.   The police report said an officer at the Seattle-Tacoma International Airport was notified by a Transportation Security Administration (TSA) supervisor of a disturbance between Richardson and her boyfriend, sprinter Christian Coleman. It said the officer reviewed camera footage and observed Richardson reach out with her left arm and grab Coleman's backpack and yank it away. Read more from Sky News: Coldplay's viral kiss cam set to feature in UK showsKemi Badenoch: I no longer identify as Nigerian Richardson then appeared to get in Coleman's way with Coleman trying to step around her, the report said, adding that Coleman was shoved into a wall. The report later said Richardson appeared to throw an item at Coleman, which the TSA indicated may have been headphones. In the police report, the officer said: \"I was told Coleman did not want to participate any further in the investigation and declined to be a victim.\" Richardson was booked into the South Correctional Entity (SCORE) in Des Moines, Washington, at 6.54pm last Sunday and released on Monday at 1.13pm. \"USATF is aware of the reports and is not commenting on this matter,\" the sport's national governing body said in a statement. Richardson has an automatic bye to the world championships in September in Tokyo as the defending champion."
    },
    {
        "title": "SpaceX brings new crew to International Space Station in just 15 hours - but it's still short of Russian record",
        "description": "SpaceX has successfully delivered a new team of astronauts to the International Space Station (ISS) in a short 15-hour trip.",
        "url": "https://news.sky.com/story/spacex-brings-new-crew-to-international-space-station-in-just-15-hours-but-its-still-short-of-russian-record-13405462",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-spacex-iss_6980555.jpg?20250802110141",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-02 06:48:00",
        "Headline": "The four US, Russian and Japanese astronauts pulled up in their SpaceX capsule after launching from NASA's Kennedy Space Centre. Their arrival brought the current number of people at the station to 11.",
        "Content": " SpaceX has successfully delivered a new team of astronauts to the International Space Station (ISS) in a short 15-hour trip. The four US, Russian and Japanese astronauts pulled up in their SpaceX capsule after launching from NASA's Kennedy Space Centre. Their arrival brought the current number of people at the station to 11. While a 15-hour trip is considered speedy by US standards, the Russians hold the record for the fastest trip to the space station - a lightning-fast three hours. The four astronauts to join the team on the ISS are NASA's Zena Cardman and Mike Fincke, Japan's Kimiya Yui and Russia's Oleg Platonov - each of whom had been originally assigned to other missions. \"Hello, space station,\" Mr Fincke radioed as soon as the capsule belonging to billionaire Elon Musk's space company docked high above the South Pacific. Ms Cardman and another astronaut were pulled from a SpaceX flight last year to make room for NASA's two stuck astronauts, Boeing Starliner test pilots Butch Wilmore and Suni Williams, who ended up stranded on the ISS for nine months. Mr Fincke and Mr Yui had been training for the next Starliner mission but switched to SpaceX as Starliner is grounded by thruster and other problems until 2026. Read more from Sky News:Musk vows to appeal over $243m Tesla crash caseBritish children who drowned off Spanish coast namedKemi Badenoch: I no longer identify as Nigerian Mr Platonov was bumped from the Soyuz launch line-up a couple of years ago because of an undisclosed illness. The crew will spend at least six months at the orbital lab, swapping places with four colleagues who have been on the ISS since March. It's expected SpaceX will bring the previous four back to Earth as early as Wednesday."
    },
    {
        "title": "World champion sprinter Sha'Carri Richardson arrested for allegedly assaulting boyfriend at Washington airport",
        "description": "Reigning 100m world champion Sha'Carri Richardson was arrested last weekend for allegedly assaulting her boyfriend at an airport in Washington.",
        "url": "https://news.sky.com/story/world-champion-sprinter-shacarri-richardson-arrested-for-allegedly-assaulting-boyfriend-at-washington-airport-13405713",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-richardson-run_6980916.jpg?20250802152651",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-02 13:56:00",
        "Headline": "The US sprinter, 25, was arrested last Sunday on a fourth-degree domestic violence offence, according to a police report.",
        "Content": "Reigning 100m world champion Sha'Carri Richardson was arrested last weekend for allegedly assaulting her boyfriend at an airport in Washington. The American sprinter, 25, was arrested last Sunday on a fourth-degree domestic violence offence, according to a police report obtained by The Associated Press. That was four days before she ran in the opening round of the women's 100m event at the USA Track & Field (USATF) Championships in Eugene, Oregon.   The police report said an officer at the Seattle-Tacoma International Airport was notified by a Transportation Security Administration (TSA) supervisor of a disturbance between Richardson and her boyfriend, sprinter Christian Coleman. It said the officer reviewed camera footage and observed Richardson reach out with her left arm and grab Coleman's backpack and yank it away. Read more from Sky News: Coldplay's viral kiss cam set to feature in UK showsKemi Badenoch: I no longer identify as Nigerian Richardson then appeared to get in Coleman's way with Coleman trying to step around her, the report said, adding that Coleman was shoved into a wall. The report later said Richardson appeared to throw an item at Coleman, which the TSA indicated may have been headphones. In the police report, the officer said: \"I was told Coleman did not want to participate any further in the investigation and declined to be a victim.\" Richardson was booked into the South Correctional Entity (SCORE) in Des Moines, Washington, at 6.54pm last Sunday and released on Monday at 1.13pm. \"USATF is aware of the reports and is not commenting on this matter,\" the sport's national governing body said in a statement. Richardson has an automatic bye to the world championships in September in Tokyo as the defending champion."
    },
    {
        "title": "US manhunt for 'dangerous' murder suspect who dropped off baby after four relatives found dead",
        "description": "A car has been found during the search for a man suspected of killing the parents, grandmother and uncle of a baby girl found abandoned in a US state.\n\n",
        "url": "https://news.sky.com/story/us-manhunt-for-dangerous-murder-suspect-who-dropped-off-baby-after-four-relatives-found-dead-13405464",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-drummond-tennessee_6980497.jpg?20250802091710",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-02 06:48:00",
        "Headline": "Austin Robert Drummond, 28, is suspected of having murdered James M Wilson, 21, Adrianna Williams, 20, Cortney Rose, 38, and Braydon Williams, 15, who were identified on Wednesday.",
        "Content": "A car has been found during the search for a man suspected of killing the parents, grandmother and uncle of a baby girl found abandoned in a US state.\n\n Austin Robert Drummond, 28, is suspected of having murdered four relatives in Tennessee - James M Wilson, 21, Adrianna Williams, 20, Cortney Rose, 38, and Braydon Williams, 15, who were identified on Wednesday. Mr Wilson and Adrianna Williams were the parents of the infant found alive in a car seat in a front yard on Tuesday afternoon. Police say Drummond then dropped off the baby and made people aware of the child, in an act of \"compassion\". However, officers added Drummond remains on the run and should be considered \"armed and dangerous\". Ms Rose was Adrianna and Braydon Williams' mother, according to District Attorney Danny Goodman. No details have been given on how they were murdered. Drummond dropped off the seven-month-old infant and brought attention to people nearby to come get the child, Tennessee Bureau of Investigation Director David Rausch said during a news conference. The baby is safe and being cared for, according to Stephen Sutton, a spokesperson for the Lake and Dyer county sheriffs. \"While this was an extremely tragic and violent event... there was a sign of compassion, if you will,\" Mr Rausch said. \"That tells us that there's a possibility that Austin may have a sense that there is hope for him to be able to come in and have a conversation about what happened.\" Mr Rausch said he believes it was a targeted attack by Drummond, who had a relationship with the victims and their family. A relative of the victims posted on Facebook after the deaths, saying the suspect has \"literally been nothing short of amazing to us and our kids\", according to our US partner network NBC News. \"We all trusted him,\" the relative added. Read more US news:Tesla ordered to pay $243m over crashTrump orders nuclear subs closer to Russia The unoccupied car that police said Drummond had been driving was found on Friday in Jackson, Tennessee, about 70 miles from where the bodies were found and some 40 miles from where the baby was left in a car seat in a front yard. The Tennessee Bureau of Investigation has said it obtained warrants for Drummond. He is wanted on four counts of first-degree murder, one count of aggravated kidnapping, and weapons offences. Authorities offered a $15,000 reward for information leading to his arrest. Drummond was convicted of one count of aggravated robbery in August 2014, according to public records. His sentence ended in September 2024, according to Tennessee Department of Correction records. He was charged criminally for activities inside the prison, including attempted murder, after he completed the sentence that put him behind bars, District Attorney Mr Goodman said. Drummond was out on bond on the other charges at the time of the killings, he added."
    },
    {
        "title": "Elon Musk vows to appeal after Tesla ordered to pay $243m to victims of Autopilot crash",
        "description": "A jury has ruled that Tesla is partly to blame for the death of a young woman who was hit by an electric car on Autopilot.",
        "url": "https://news.sky.com/story/tesla-ordered-to-pay-243m-to-victims-of-fatal-autopilot-crash-13405416",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-naibel-benavides-dillon-angulo_6965053.jpg?20250715050110",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-02 01:25:00",
        "Headline": "Miguel Custodio, a car crash lawyer not involved in this trial, added: \"This will open the floodgates. It will embolden a lot of people to come to court.\"",
        "Content": "A jury has ruled that Tesla is partly to blame for the death of a young woman who was hit by an electric car on Autopilot. Naibel Benavides Leon was stargazing at the time of the collision, which sent her flying 22m (75ft) through the air in Florida. Her boyfriend was seriously injured in the 2019 incident, while her body was discovered in a wooded area. The company has now been ordered to pay $243m (£183m) in damages to Ms Benavides Leon's family, and to her partner Dillon Angulo. Jurors concluded that not all of the blame could be put on a reckless driver who admitted he was distracted by his phone before he hit the young couple. The motorist, George McGee, reached a separate settlement with the victims' families in an earlier case. Brett Schreiber, who represented the victims, said: \"Tesla designed Autopilot only for controlled-access highways yet deliberately chose not to restrict drivers from using it elsewhere, alongside Elon Musk telling the world Autopilot drove better than humans. \n                  Tesla looks to cheaper model as revenue suffers worst drop in over a decade\n                 \n                  Can Tesla survive without Trump?\n                 \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \"Today's verdict represents justice for Naibel's tragic death and Dillon's lifelong injuries.\"  Tesla - and Elon Musk - have said it will appeal the verdict, labelling it \"wrong\" and a setback for automotive safety. The verdict would also work to \"jeopardise Tesla's and the entire industry's efforts to develop and implement life-saving technology\", the company warmed. Tesla had claimed Mr McGee was solely to blame for the fatal crash because he had reached down to pick up a dropped mobile phone as his Model S sped through an intersection in Key Largo, Florida, at about 62mph. Mr McGee allegedly did not receive alerts as he ran a stop sign and a red light - and the plaintiffs' lawyer argued that the driver's assistance should have warned the driver and braked before the collision. The collision sent Ms Benavides Leon flying 22m (75ft) through the air, with her body later being discovered in a wooded area, while Mr Angulo suffered serious injuries. \"To be clear, no car in 2019, and none today, would have prevented this crash,\" Tesla said. \"This was never about Autopilot; it was a fiction concocted by plaintiffs' lawyers blaming the car when the driver - from day one - admitted and accepted responsibility.\" Read more from Sky News:Trump hits out again at 'stubborn moron'World's oldest baby born in the US Lawyers for the plaintiffs also alleged that Tesla either hid or lost key evidence, including data and video recorded seconds before the collision. They showed the court that the company had the evidence all along, despite repeated denials, after hiring a forensic data expert who dug it up. After being shown the evidence, Tesla said it made a mistake and honestly hadn't thought it was there. Past cases against Tesla were dismissed or settled, so the verdict in this case could encourage more legal action. Miguel Custodio, a car crash lawyer not involved in this trial, added: \"This will open the floodgates. It will embolden a lot of people to come to court.\" The verdict comes as Mr Musk plans to roll out a driverless taxi service, hoping to convince people his vehicles are safe enough to drive on their own. Improvements to the company's driver assistance and partial self-driving features have been made in recent years - but in 2023, 2.3 million Tesla vehicles were recalled amid fears Autopilot was failing to sufficiently alert drivers not paying attention to the road."
    },
    {
        "title": "SpaceX brings new crew to International Space Station in just 15 hours - but it's still short of Russian record",
        "description": "SpaceX has successfully delivered a new team of astronauts to the International Space Station (ISS) in a short 15-hour trip.",
        "url": "https://news.sky.com/story/spacex-brings-new-crew-to-international-space-station-in-just-15-hours-but-its-still-short-of-russian-record-13405462",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-spacex-iss_6980555.jpg?20250802110141",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-02 06:48:00",
        "Headline": "The four US, Russian and Japanese astronauts pulled up in their SpaceX capsule after launching from NASA's Kennedy Space Centre. Their arrival brought the current number of people at the station to 11.",
        "Content": " SpaceX has successfully delivered a new team of astronauts to the International Space Station (ISS) in a short 15-hour trip. The four US, Russian and Japanese astronauts pulled up in their SpaceX capsule after launching from NASA's Kennedy Space Centre. Their arrival brought the current number of people at the station to 11. While a 15-hour trip is considered speedy by US standards, the Russians hold the record for the fastest trip to the space station - a lightning-fast three hours. The four astronauts to join the team on the ISS are NASA's Zena Cardman and Mike Fincke, Japan's Kimiya Yui and Russia's Oleg Platonov - each of whom had been originally assigned to other missions. \"Hello, space station,\" Mr Fincke radioed as soon as the capsule belonging to billionaire Elon Musk's space company docked high above the South Pacific. Ms Cardman and another astronaut were pulled from a SpaceX flight last year to make room for NASA's two stuck astronauts, Boeing Starliner test pilots Butch Wilmore and Suni Williams, who ended up stranded on the ISS for nine months. Mr Fincke and Mr Yui had been training for the next Starliner mission but switched to SpaceX as Starliner is grounded by thruster and other problems until 2026. Read more from Sky News:Musk vows to appeal over $243m Tesla crash caseBritish children who drowned off Spanish coast namedKemi Badenoch: I no longer identify as Nigerian Mr Platonov was bumped from the Soyuz launch line-up a couple of years ago because of an undisclosed illness. The crew will spend at least six months at the orbital lab, swapping places with four colleagues who have been on the ISS since March. It's expected SpaceX will bring the previous four back to Earth as early as Wednesday."
    },
    {
        "title": "Thousands of hot dogs spill across busy highway ",
        "description": "A truckload of hot dogs has spilled across a busy road in Pennsylvania.",
        "url": "https://news.sky.com/story/hot-dog-spill-blocks-highway-on-wurst-fry-day-for-motorists-13405436",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hot-dogs-shrewsbury_6980439.jpg?20250802035446",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-02 02:55:00",
        "Headline": "Crews mustard up the courage to dispose of thousands of sausages, with a fire chief saying: \"I can tell you personally, hot dogs are very slippery. I did not know that.\"",
        "Content": " A truckload of hot dogs has spilled across a busy road in Pennsylvania. A mechanical problem meant the truck scraped along a concrete divider - ripping the trailer open and scattering the sausages across the highway. It was the wurst Fry-day commute that motorists in Shrewsbury had to contend with for years. Crews mustard up the courage to begin a morning rush hour clean-up - and didn't mince their words. \"Once those leave the truck and hit the road, that's all garbage, and it's still pretty warm,\" Shrewsbury Fire Company Chief Brad Dauberman said. \"I can tell you personally, hot dogs are very slippery,\" he added. \"I did not know that.\" A front-end loader was used to scoop up the wieners and drop them into a dump truck."
    },
    {
        "title": "Tech companies are racing to make their products smaller - and much, much thinner ",
        "description": "Some of the world's leading tech companies are betting big on very small innovations.",
        "url": "https://news.sky.com/story/tech-companies-are-racing-to-make-their-products-smaller-and-much-much-thinner-13404973",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-honor-xreal_6979657.jpg?20250801102257",
        "type": "Business",
        "Author": "Martin Kimber, business producer",
        "Date Published": "2025-08-02 02:37:00",
        "Headline": "There is a growing focus on the miniature market within many consumer-facing tech firms - and it's one that could even call into question the current smartphone dominance.",
        "Content": "By Martin Kimber, business producer  Some of the world's leading tech companies are betting big on very small innovations. Last week, Samsung released its Galaxy Z Fold 7 which - when open - has a thickness of just 4.2mm, one of the slimmest folding phones ever to hit the market. And Honor, a spin-off from Chinese smartphone company Huawei, will soon ship its latest foldable - the slimmest in the world. Its new Honor Magic V5 model is only 8.8mm thick when folded, and a mere 4.1mm when open. Apple is also expected to release a foldable in the second half of next year, according to a note by analysts at JPMorgan published this week. The race to miniaturise technology is speeding up, the ultimate prize being the next evolution in consumer devices. Whether it be wearable devices, such as smartglasses, watches, rings or foldables - there is enormous market potential for any manufacturer that can make its products small enough. Despite being thinner than its predecessor, Honor claims its Magic V5 also offers significant improvements to battery life, processing power, and camera capabilities. \n                  Weekend Money: 'My seven-year-old pays rent' - when should parents start charging and how much?\n                 \n                  185-year-old Bridgerton costumier Angels screens investors\n                 \n                  US trade war: The state of play as Trump signs order imposing new tariffs - but there are more delays\n                 Hope Cao, a product expert at Honor told Sky News the progress was \"due largely to our silicon carbon battery technology\". These batteries are a next-generation breakthrough that offers higher energy density compared to traditional lithium-ion batteries, and are becoming more common in consumer devices. Honor also told Sky News it had used its own AI model \"to precisely test and find the optimum design, which was both the slimmest, as well as, the most durable.\" However, research and development into miniaturisation goes well beyond just folding phones. A company that's been at the forefront of developing augmented reality (AR) glasses, Xreal, was one of the first to release a viable pair to the consumer market. Xreal's Ralph Jodice told Sky News \"one of our biggest engineering challenges is shrinking powerful augmented reality technology into a form factor that looks and feels like everyday sunglasses\". Xreal's specs can display images on the lenses like something out of a sci-fi movie - allowing the wearer to connect most USB-C compatible devices such as phones, laptops and handheld consoles to an IMAX-sized screen anywhere they go. Experts at The Metaverse Society suggest prices of these wearable devices could be lowered by shifting the burden of computing from the headset to a mobile phone or computer, whose battery and processor would power the glasses via a cable. However, despite the daunting challenge, companies are doubling down on research and making leaps in the area. Social media giant Meta is also vying for dominance in the miniature market. Meta's Ray-Ban sunglasses (to which they recently added an Oakley range), cannot project images on the lenses like the pair from Xreal - instead they can capture photos, footage and sound. When connected to a smartphone they can even use your phone's 5G connection to ask Meta's AI what you're looking at, and ask how to save a particular type of houseplant for example. Gareth Sutcliffe, a tech and media analyst at Enders Analysis, tells Sky News wearables \"are a green field opportunity for Meta and Google\" to capture a market of \"hundreds of millions of users if these devices sell at similar rates to mobile phones\". Li-Chen Miller, Meta's vice president of product and wearables, recently said: \"You'd be hard-pressed to find a more interesting engineering problem in the company than the one that's at the intersection of these two dynamics, building glasses [with onboard technology] that people are comfortable wearing on their faces for extended periods of time ... and willing to wear them around friends, family, and others nearby.\" Mr Sutcliffe points out that \"Meta's R&D spend on wearables looks extraordinary in the context of limited sales now, but should the category explode in popularity, it will be seen as a great strategic bet.\" Facebook founder Mark Zuckerberg's long-term aim is to combine the abilities of both Xreal and the Ray-Bans into a fully functioning pair of smartglasses, capable of capturing content, as well as display graphics onscreen. However, despite recently showcasing a prototype model, the company was at pains to point out that it was still far from ready for the consumer market. This race is a marathon not a sprint - or as Sutcliffe tells Sky News \"a decade-long slog\" - but 17 years after the release of the first iPhone, people are beginning to wonder what will replace it - and it could well be a pair of glasses."
    },
    {
        "title": "185-year-old Bridgerton costumier Angels screens investors",
        "description": "One of the world&#8217;s leading supplier of costumes to stars of stage and screen is in talks to secure external investment for the first time in its 185-year-old history.",
        "url": "https://news.sky.com/story/185-year-old-bridgerton-costumier-angels-screens-investors-13405487",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-bridgerton-series-three_6549897.jpg?20240511041606",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-02 08:28:00",
        "Headline": "Angels, which is in its seventh generation of family ownership and has supplied productions including Star Wars and The English Patient, is working with advisers to find external investors, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n One of the world’s leading supplier of costumes to stars of stage and screen is in talks to secure external investment for the first time in its 185-year-old history. Sky News has learnt that Angels, which is based in London, is working with advisers to raise millions of pounds from the sale of a minority stake in the business. Kroll, the professional services firm, has been engaged to oversee the talks with prospective investors, which has been dubbed Project Carousel. This weekend, City sources said that Angels - which was founded in 1840 - had initiated talks with a number of parties who had a track record of investing in the media and showbusiness industries. Initial offers are understood to have been submitted in the last six weeks, with discussions ongoing. The company's principal clients include the BBC, Netflix, Amazon's Prime Video, Paramount Pictures and The Walt Disney Company. It saw its financial performance hit hard by the pandemic and then the Hollywood writers' and actors' strikes in 2023, which brought much of the film and television industries to a standstill. Angels has been through seven generations of family ownership, and is currently chaired by Tim Angel, a former chairman of BAFTA. The company was founded by Daniel Angel, who had arrived in London from Frankfurt in 1813 and set up a barrow selling secondhand clothing. Years later, when an actor asked if he could rent a suit rather than buy it from Mr Angel, his hire business took off, according to an history of the business published online. Notable moments in Angels' history included being called in during the 1920s to re-dress Madame Tussauds' collection of waxworks after the premises had been destroyed by fire. The company has supplied costumes for 47 Best Costume Oscar-winners, including Hamlet, Doctor Zhivago, Star Wars, Chariots of Fire, Braveheart, The English Patient, Shakespeare in Love, The Great Gatsby, and The Grand Budapest Hotel. It has also played a role supplying 37 Best Costume BAFTA-winners, according to information circulated by Kroll to potential investors. In 2016, Angels was itself awarded a BAFTA for Outstanding British Contribution to Cinema. Angels' collection of costumes numbers more than 1 million items, which would stretch for more than ten miles if hung next to each other. Its former head office on London's Shaftesbury Avenue is now a fancy dress shop with costumes available for hire. \"Our industry has been through some of its toughest years, from COVID and strikes to the LA fires, at one point leaving over 80% of our sector unemployed,\" said Jeremy Angel, a director of Angels. \"We stood by our staff, protected the business, and made it through. \"We are optimistic now with many new productions starting and government incentives coming in [and are] seeking a small investment to help us grow and continue supporting designers, directors, and actors, just as we've done since my family founded the business in 1840.\" Angels is understood to have recorded a loss in its last financial year but is forecasting a return to profitability in 2026, according to figures supplied by Kroll to interested parties."
    },
    {
        "title": "Inside Jeremy Corbyn's new party and the battle for leadership",
        "description": "Zarah Sultana and Jeremy Corbyn may be the figureheads of a new left-wing party, but already there is a battle over leadership.",
        "url": "https://news.sky.com/story/inside-jeremy-corbyns-new-party-and-the-battle-for-leadership-13405051",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-corbyn-labour_6980443.png?20250802043250",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-08-02 03:37:00",
        "Headline": "A debate is already raging over whether Mr Corbyn and Zarah Sultana should be crowned co-leaders - or whether outside candidates should be given the chance to run in a \"grassroots\" contest.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Zarah Sultana and Jeremy Corbyn may be the figureheads of a new left-wing party, but already there is a battle over leadership. The confusion behind the initial launch speaks to a wider debate happening behind closed doors as to who should steer the party - now and in the future. Already, in the true spirit of Mr Corbyn's politics, there is talk of an open leadership contest and grassroots participation. Some supporters of the new party - which is being temporarily called \"Your Party\" while a formal name is decided by members - believe that allowing a leadership contest to take place honours Mr Corbyn's commitment to open democracy.  They point out that under Mr Corbyn's leadership of the Labour Party, members famously backed plans to make it easier for local constituency parties to deselect sitting MPs - a concept he strongly believed in. His allies now say the former Labour leader, who is 76, is open to there being a leadership contest for the new party, possibly at its inaugural conference in the autumn, where names lesser known than himself can throw their hat into the ring. \"Jeremy would rather die than not have an open leadership contest,\" one source familiar with the internal politics told Sky News. \n                  Green leadership contenders reject calls for Corbyn pact - and say party must retain 'distinctive identity'\n                 \n                  How Corbyn's new party is preparing for battle - and where insiders think they could win\n                 \n                  Inside Jeremy Corbyn's new party: Is the Labour left making a comeback?\n                 However, there have been suggestions that Ms Sultana appears to be less keen on the idea of a leadership contest, and that she is more committed to the co-leadership model than her political partner. Those who have been opposed to the co-leadership model believe it could give Ms Sultana an unfair advantage and exclude other potential candidates from standing in the future.  One source told Sky News they believed Mr Corbyn should lead the party for two years, to get it established, before others are allowed to stand as leader. They said Ms Sultana, who became an independent MP after she was suspended from Labour for opposing the two-child benefit cap, was \"highly ambitious but completely untested as leader\" and \"had a lot of growing into the role to do\". \"It's not about her - it's about taking a democratic approach, which is what we're supposed to be doing,\" they said. \"There are so many people who have done amazing things locally and they need to have a chance to emerge as leaders. \"We are not only fishing from a pool of two people. \"It needs to be an open contest. Nobody needs to be crowned.\" Sky News approached Zarah Sultana for a comment. Although she didn't respond directly, she later tweeted her response. While Mr Corbyn and Ms Sultana undoubtedly have the biggest profiles out of would-be leaders, advocates for a grassroots approach to the leadership point to the success some independent candidates have enjoyed at a local level - for example, 24-year-old British Palestinian Leanne Mohamad, who came within 528 votes of unseating Health Secretary Wes Streeting in Ilford North.  Fiona Lali of the Revolutionary Communist Party, who stood in last year's general election for the Stratford and Bow constituency, has also been mentioned in some circles as someone with potential leadership credentials. However, sources close to Mr Corbyn and Ms Sultana downplayed suggestions of any divide over the leadership model, pointing out that their joint statement acknowledged that members would \"decide the party's direction\" at the inaugural conference in the autumn, including the model of leadership and the policies that are needed to transform society. Read more:Where insiders think Corbyn's new party could winPM would be foolish not to recognise threat party poses A spokesperson for Mr Corbyn told Sky News: \"Jeremy will be working with Zarah, his independent colleagues, and people from trade unions and social movements up and down the country to make an autumn conference a reality. \"This will be the moment where people come together to launch a new democratic party that belongs to the members.\""
    },
    {
        "title": "Kemi Badenoch says she no longer identifies as Nigerian",
        "description": "Kemi Badenoch has said she does not see herself as Nigerian and no longer has a passport for the country she grew up in.",
        "url": "https://news.sky.com/story/kemi-badenoch-says-she-no-longer-identifies-as-nigerian-13405449",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kemi-badenoch-conservatives_6980470.jpg?20250802075030",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-02 05:22:00",
        "Headline": "The Tory leader said she is \"interested\" in the country she grew up in, but her home is with her family and the Conservative Party.",
        "Content": "Kemi Badenoch has said she does not see herself as Nigerian and no longer has a passport for the country she grew up in. The leader of the Conservative Party was born in the London suburb of Wimbledon but was raised in Lagos, Nigeria. When Nigeria's economy collapsed in the 1990s, Ms Badenoch, then aged 16, moved back to the UK to live with a family friend and continue her education. Speaking to former MP and television presenter Gyles Brandreth on the Rosebud podcast, Ms Badenoch said as most of her life has been in the UK, she \"does not identify\" as Nigerian. \"I'm Nigerian through ancestry, by birth, despite not being born there because of my parents... but by identity I'm not really,\" the North West Essex MP said. \"I have not renewed my Nigerian passport, I think, not since the early 2000s.\" Ms Badenoch added that her home is now where her family is, which includes her extended political family. On Nigeria, she said: \"I know the country very well, I have a lot of family there, and I'm very interested in what happens there.\" \"But home is where my now family is, and my now family is my children, it's my husband and my brother and his children, in-laws. The Conservative Party is very much part of my family - my extended family, I call it,\" she added. Ms Badenoch said on her return to Nigeria after her father, Femi, who was a GP with his own clinic, died, she faced a \"big fandango\" to get a visa. She also said her early experiences in Nigeria shaped her political outlook, including why she doesn't like socialism. \"I remember never quite feeling that I belonged there,\" she added. Read more from Sky News:Inside Jeremy Corbyn's new partyReeves dodges wealth tax calls from predecessor Last year, Nigerian vice president Kashim Shettima accused Ms Badenoch of disparaging the country, adding that she has \"every right to remove the Kemi from her name\". The criticism came after Ms Badenoch spoke about her life and childhood in Nigeria during the Tory leadership race. A spokesperson for Ms Badenoch responded to Mr Shettima at the time, saying the Conservative leader was \"not the PR for Nigeria\"."
    },
    {
        "title": "Make 'significant adjustments' to Online Safety Act, X urges govt",
        "description": "The Online Safety Act is putting free speech at risk and needs significant adjustments, Elon Musk's social network X has warned.",
        "url": "https://news.sky.com/story/x-criticises-online-safety-act-and-warns-its-putting-free-speech-in-the-uk-at-risk-13405434",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-x-elonmusk_6980438.jpg?20250802034931",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-02 01:33:00",
        "Headline": "The new rules came into force last week, requiring platforms like Facebook, YouTube, TikTok and X, as well as sites hosting pornography, to bring in measures to prove that someone using them is over the age of 18.",
        "Content": "The Online Safety Act is putting free speech at risk and needs significant adjustments, Elon Musk's social network X has warned. New rules that came into force last week require platforms such as Facebook, YouTube, TikTok and X - as well as sites hosting pornography - to bring in measures to prove that someone using them is over the age of 18. The Online Safety Act requires sites to protect children and to remove illegal content, but critics have said that the rules have been implemented too broadly, resulting in the censorship of legal content. X has warned the act's laudable intentions were \"at risk of being overshadowed by the breadth of its regulatory reach\". It said: \"When lawmakers approved these measures, they made a conscientious decision to increase censorship in the name of 'online safety'. \"It is fair to ask if UK citizens were equally aware of the trade-off being made.\"  X claims the timetable for platforms to meet mandatory measures had been unnecessarily tight - and despite complying, sites still faced threats of enforcement and fines, \"encouraging over-censorship\". \n                  Ofcom launches investigation into new age checks on 34 pornography websites\n                 \n                  Cabinet minister reiterates colleague's claim Nigel Farage is on side of Jimmy Savile\n                 \n                  Hundreds of thousands of people backlash against internet safety rules\n                 \"A balanced approach is the only way to protect individual liberties, encourage innovation and safeguard children. It's safe to say that significant changes must take place to achieve these objectives in the UK,\" it said. A UK government spokesperson said it is \"demonstrably false\" that the Online Safety Act compromises free speech. \"As well as legal duties to keep children safe, the very same law places clear and unequivocal duties on platforms to protect freedom of expression,\" they added. Users have complained about age checks that require personal data to be uploaded to access sites that show pornography, and 468,000 people have already signed a petition asking for the new law to be repealed. In response to the petition, the government said it had \"no plans\" to reverse the Online Safety Act.  Reform UK's leader Nigel Farage likened the new rules to \"state suppression of genuine free speech\" and said his party would ditch the regulations. Technology Secretary Peter Kyle said on Tuesday that those who wanted to overturn the act were \"on the side of predators\" - to which Mr Farage demanded an apology, calling Mr Kyle's comments \"absolutely disgusting\". Regulator Ofcom said on Thursday it had launched an investigation into how four companies - that collectively run 34 pornography sites - are complying with new age-check requirements. Read more from Sky News:British children who drowned off Spain namedMan charged after children fell ill at summer camp These companies - 8579 LLC, AVS Group Ltd, Kick Online Entertainment S.A. and Trendio Ltd - run dozens of sites, and collectively have more than nine million unique monthly UK visitors, the internet watchdog said. The regulator said it prioritised the companies based on the risk of harm posed by the services they operated and their user numbers. It adds to the 11 investigations already in progress into 4chan, as well as an unnamed online suicide forum, seven file-sharing services, and two adult websites. Ofcom said it expects to make further enforcement announcements in the coming months."
    },
    {
        "title": "SpaceX brings new crew to International Space Station in just 15 hours - but it's still short of Russian record",
        "description": "SpaceX has successfully delivered a new team of astronauts to the International Space Station (ISS) in a short 15-hour trip.",
        "url": "https://news.sky.com/story/spacex-brings-new-crew-to-international-space-station-in-just-15-hours-but-its-still-short-of-russian-record-13405462",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-spacex-iss_6980555.jpg?20250802110141",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-02 06:48:00",
        "Headline": "The four US, Russian and Japanese astronauts pulled up in their SpaceX capsule after launching from NASA's Kennedy Space Centre. Their arrival brought the current number of people at the station to 11.",
        "Content": " SpaceX has successfully delivered a new team of astronauts to the International Space Station (ISS) in a short 15-hour trip. The four US, Russian and Japanese astronauts pulled up in their SpaceX capsule after launching from NASA's Kennedy Space Centre. Their arrival brought the current number of people at the station to 11. While a 15-hour trip is considered speedy by US standards, the Russians hold the record for the fastest trip to the space station - a lightning-fast three hours. The four astronauts to join the team on the ISS are NASA's Zena Cardman and Mike Fincke, Japan's Kimiya Yui and Russia's Oleg Platonov - each of whom had been originally assigned to other missions. \"Hello, space station,\" Mr Fincke radioed as soon as the capsule belonging to billionaire Elon Musk's space company docked high above the South Pacific. Ms Cardman and another astronaut were pulled from a SpaceX flight last year to make room for NASA's two stuck astronauts, Boeing Starliner test pilots Butch Wilmore and Suni Williams, who ended up stranded on the ISS for nine months. Mr Fincke and Mr Yui had been training for the next Starliner mission but switched to SpaceX as Starliner is grounded by thruster and other problems until 2026. Read more from Sky News:Musk vows to appeal over $243m Tesla crash caseBritish children who drowned off Spanish coast namedKemi Badenoch: I no longer identify as Nigerian Mr Platonov was bumped from the Soyuz launch line-up a couple of years ago because of an undisclosed illness. The crew will spend at least six months at the orbital lab, swapping places with four colleagues who have been on the ISS since March. It's expected SpaceX will bring the previous four back to Earth as early as Wednesday."
    },
    {
        "title": "Make 'significant adjustments' to Online Safety Act, X urges govt",
        "description": "The Online Safety Act is putting free speech at risk and needs significant adjustments, Elon Musk's social network X has warned.",
        "url": "https://news.sky.com/story/x-criticises-online-safety-act-and-warns-its-putting-free-speech-in-the-uk-at-risk-13405434",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-x-elonmusk_6980438.jpg?20250802034931",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-02 01:33:00",
        "Headline": "The new rules came into force last week, requiring platforms like Facebook, YouTube, TikTok and X, as well as sites hosting pornography, to bring in measures to prove that someone using them is over the age of 18.",
        "Content": "The Online Safety Act is putting free speech at risk and needs significant adjustments, Elon Musk's social network X has warned. New rules that came into force last week require platforms such as Facebook, YouTube, TikTok and X - as well as sites hosting pornography - to bring in measures to prove that someone using them is over the age of 18. The Online Safety Act requires sites to protect children and to remove illegal content, but critics have said that the rules have been implemented too broadly, resulting in the censorship of legal content. X has warned the act's laudable intentions were \"at risk of being overshadowed by the breadth of its regulatory reach\". It said: \"When lawmakers approved these measures, they made a conscientious decision to increase censorship in the name of 'online safety'. \"It is fair to ask if UK citizens were equally aware of the trade-off being made.\"  X claims the timetable for platforms to meet mandatory measures had been unnecessarily tight - and despite complying, sites still faced threats of enforcement and fines, \"encouraging over-censorship\". \n                  Ofcom launches investigation into new age checks on 34 pornography websites\n                 \n                  Cabinet minister reiterates colleague's claim Nigel Farage is on side of Jimmy Savile\n                 \n                  Hundreds of thousands of people backlash against internet safety rules\n                 \"A balanced approach is the only way to protect individual liberties, encourage innovation and safeguard children. It's safe to say that significant changes must take place to achieve these objectives in the UK,\" it said. A UK government spokesperson said it is \"demonstrably false\" that the Online Safety Act compromises free speech. \"As well as legal duties to keep children safe, the very same law places clear and unequivocal duties on platforms to protect freedom of expression,\" they added. Users have complained about age checks that require personal data to be uploaded to access sites that show pornography, and 468,000 people have already signed a petition asking for the new law to be repealed. In response to the petition, the government said it had \"no plans\" to reverse the Online Safety Act.  Reform UK's leader Nigel Farage likened the new rules to \"state suppression of genuine free speech\" and said his party would ditch the regulations. Technology Secretary Peter Kyle said on Tuesday that those who wanted to overturn the act were \"on the side of predators\" - to which Mr Farage demanded an apology, calling Mr Kyle's comments \"absolutely disgusting\". Regulator Ofcom said on Thursday it had launched an investigation into how four companies - that collectively run 34 pornography sites - are complying with new age-check requirements. Read more from Sky News:British children who drowned off Spain namedMan charged after children fell ill at summer camp These companies - 8579 LLC, AVS Group Ltd, Kick Online Entertainment S.A. and Trendio Ltd - run dozens of sites, and collectively have more than nine million unique monthly UK visitors, the internet watchdog said. The regulator said it prioritised the companies based on the risk of harm posed by the services they operated and their user numbers. It adds to the 11 investigations already in progress into 4chan, as well as an unnamed online suicide forum, seven file-sharing services, and two adult websites. Ofcom said it expects to make further enforcement announcements in the coming months."
    },
    {
        "title": "Elon Musk vows to appeal after Tesla ordered to pay $243m to victims of Autopilot crash",
        "description": "A jury has ruled that Tesla is partly to blame for the death of a young woman who was hit by an electric car on Autopilot.",
        "url": "https://news.sky.com/story/tesla-ordered-to-pay-243m-to-victims-of-fatal-autopilot-crash-13405416",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-naibel-benavides-dillon-angulo_6965053.jpg?20250715050110",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-02 01:25:00",
        "Headline": "Miguel Custodio, a car crash lawyer not involved in this trial, added: \"This will open the floodgates. It will embolden a lot of people to come to court.\"",
        "Content": "A jury has ruled that Tesla is partly to blame for the death of a young woman who was hit by an electric car on Autopilot. Naibel Benavides Leon was stargazing at the time of the collision, which sent her flying 22m (75ft) through the air in Florida. Her boyfriend was seriously injured in the 2019 incident, while her body was discovered in a wooded area. The company has now been ordered to pay $243m (£183m) in damages to Ms Benavides Leon's family, and to her partner Dillon Angulo. Jurors concluded that not all of the blame could be put on a reckless driver who admitted he was distracted by his phone before he hit the young couple. The motorist, George McGee, reached a separate settlement with the victims' families in an earlier case. Brett Schreiber, who represented the victims, said: \"Tesla designed Autopilot only for controlled-access highways yet deliberately chose not to restrict drivers from using it elsewhere, alongside Elon Musk telling the world Autopilot drove better than humans. \n                  Tesla looks to cheaper model as revenue suffers worst drop in over a decade\n                 \n                  Can Tesla survive without Trump?\n                 \n                  Revealed: The huge financial impact of Elon Musk's row with Donald Trump\n                 \"Today's verdict represents justice for Naibel's tragic death and Dillon's lifelong injuries.\"  Tesla - and Elon Musk - have said it will appeal the verdict, labelling it \"wrong\" and a setback for automotive safety. The verdict would also work to \"jeopardise Tesla's and the entire industry's efforts to develop and implement life-saving technology\", the company warmed. Tesla had claimed Mr McGee was solely to blame for the fatal crash because he had reached down to pick up a dropped mobile phone as his Model S sped through an intersection in Key Largo, Florida, at about 62mph. Mr McGee allegedly did not receive alerts as he ran a stop sign and a red light - and the plaintiffs' lawyer argued that the driver's assistance should have warned the driver and braked before the collision. The collision sent Ms Benavides Leon flying 22m (75ft) through the air, with her body later being discovered in a wooded area, while Mr Angulo suffered serious injuries. \"To be clear, no car in 2019, and none today, would have prevented this crash,\" Tesla said. \"This was never about Autopilot; it was a fiction concocted by plaintiffs' lawyers blaming the car when the driver - from day one - admitted and accepted responsibility.\" Read more from Sky News:Trump hits out again at 'stubborn moron'World's oldest baby born in the US Lawyers for the plaintiffs also alleged that Tesla either hid or lost key evidence, including data and video recorded seconds before the collision. They showed the court that the company had the evidence all along, despite repeated denials, after hiring a forensic data expert who dug it up. After being shown the evidence, Tesla said it made a mistake and honestly hadn't thought it was there. Past cases against Tesla were dismissed or settled, so the verdict in this case could encourage more legal action. Miguel Custodio, a car crash lawyer not involved in this trial, added: \"This will open the floodgates. It will embolden a lot of people to come to court.\" The verdict comes as Mr Musk plans to roll out a driverless taxi service, hoping to convince people his vehicles are safe enough to drive on their own. Improvements to the company's driver assistance and partial self-driving features have been made in recent years - but in 2023, 2.3 million Tesla vehicles were recalled amid fears Autopilot was failing to sufficiently alert drivers not paying attention to the road."
    },
    {
        "title": "Tech companies are racing to make their products smaller - and much, much thinner ",
        "description": "Some of the world's leading tech companies are betting big on very small innovations.",
        "url": "https://news.sky.com/story/tech-companies-are-racing-to-make-their-products-smaller-and-much-much-thinner-13404973",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-honor-xreal_6979657.jpg?20250801102257",
        "type": "Technology",
        "Author": "Martin Kimber, business producer",
        "Date Published": "2025-08-02 02:37:00",
        "Headline": "There is a growing focus on the miniature market within many consumer-facing tech firms - and it's one that could even call into question the current smartphone dominance.",
        "Content": "By Martin Kimber, business producer  Some of the world's leading tech companies are betting big on very small innovations. Last week, Samsung released its Galaxy Z Fold 7 which - when open - has a thickness of just 4.2mm, one of the slimmest folding phones ever to hit the market. And Honor, a spin-off from Chinese smartphone company Huawei, will soon ship its latest foldable - the slimmest in the world. Its new Honor Magic V5 model is only 8.8mm thick when folded, and a mere 4.1mm when open. Apple is also expected to release a foldable in the second half of next year, according to a note by analysts at JPMorgan published this week. The race to miniaturise technology is speeding up, the ultimate prize being the next evolution in consumer devices. Whether it be wearable devices, such as smartglasses, watches, rings or foldables - there is enormous market potential for any manufacturer that can make its products small enough. Despite being thinner than its predecessor, Honor claims its Magic V5 also offers significant improvements to battery life, processing power, and camera capabilities. \n                  Weekend Money: 'My seven-year-old pays rent' - when should parents start charging and how much?\n                 \n                  185-year-old Bridgerton costumier Angels screens investors\n                 \n                  US trade war: The state of play as Trump signs order imposing new tariffs - but there are more delays\n                 Hope Cao, a product expert at Honor told Sky News the progress was \"due largely to our silicon carbon battery technology\". These batteries are a next-generation breakthrough that offers higher energy density compared to traditional lithium-ion batteries, and are becoming more common in consumer devices. Honor also told Sky News it had used its own AI model \"to precisely test and find the optimum design, which was both the slimmest, as well as, the most durable.\" However, research and development into miniaturisation goes well beyond just folding phones. A company that's been at the forefront of developing augmented reality (AR) glasses, Xreal, was one of the first to release a viable pair to the consumer market. Xreal's Ralph Jodice told Sky News \"one of our biggest engineering challenges is shrinking powerful augmented reality technology into a form factor that looks and feels like everyday sunglasses\". Xreal's specs can display images on the lenses like something out of a sci-fi movie - allowing the wearer to connect most USB-C compatible devices such as phones, laptops and handheld consoles to an IMAX-sized screen anywhere they go. Experts at The Metaverse Society suggest prices of these wearable devices could be lowered by shifting the burden of computing from the headset to a mobile phone or computer, whose battery and processor would power the glasses via a cable. However, despite the daunting challenge, companies are doubling down on research and making leaps in the area. Social media giant Meta is also vying for dominance in the miniature market. Meta's Ray-Ban sunglasses (to which they recently added an Oakley range), cannot project images on the lenses like the pair from Xreal - instead they can capture photos, footage and sound. When connected to a smartphone they can even use your phone's 5G connection to ask Meta's AI what you're looking at, and ask how to save a particular type of houseplant for example. Gareth Sutcliffe, a tech and media analyst at Enders Analysis, tells Sky News wearables \"are a green field opportunity for Meta and Google\" to capture a market of \"hundreds of millions of users if these devices sell at similar rates to mobile phones\". Li-Chen Miller, Meta's vice president of product and wearables, recently said: \"You'd be hard-pressed to find a more interesting engineering problem in the company than the one that's at the intersection of these two dynamics, building glasses [with onboard technology] that people are comfortable wearing on their faces for extended periods of time ... and willing to wear them around friends, family, and others nearby.\" Mr Sutcliffe points out that \"Meta's R&D spend on wearables looks extraordinary in the context of limited sales now, but should the category explode in popularity, it will be seen as a great strategic bet.\" Facebook founder Mark Zuckerberg's long-term aim is to combine the abilities of both Xreal and the Ray-Bans into a fully functioning pair of smartglasses, capable of capturing content, as well as display graphics onscreen. However, despite recently showcasing a prototype model, the company was at pains to point out that it was still far from ready for the consumer market. This race is a marathon not a sprint - or as Sutcliffe tells Sky News \"a decade-long slog\" - but 17 years after the release of the first iPhone, people are beginning to wonder what will replace it - and it could well be a pair of glasses."
    },
    {
        "title": "Why the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe performers ",
        "description": "For years now, many performers at Edinburgh Fringe have spoken about their struggles to afford the sky-high prices for their accommodation each August.",
        "url": "https://news.sky.com/story/why-the-oasis-effect-has-been-catastrophic-for-edinburgh-fringe-performers-13405222",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-oasis-cardiff_6957505.jpg?20250704233136",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-08-02 00:14:00",
        "Headline": "With Oasis's reunion tour coming to the city for three nights, the cost of securing a room for a month at the arts festival is even higher.",
        "Content": "\n          Arts and entertainment correspondent\n        For years now, many performers at Edinburgh Fringe have spoken about their struggles to afford the sky-high prices for their accommodation each August. This year, with Oasis's reunion tour coming to the city for three nights, the cost of securing a room for a month at the biggest arts festival in the world is even higher. Comedian Marc Borrows says \"the 'Oasis effect' on the Fringe economy has been catastrophic\". Rather fittingly, his stand-up show this year is called The Britpop Hour. \"It's an idea I'd had in my back pocket for a while,\" he explains. \"Then the band reformed and when I saw they were playing Edinburgh I thought 'yeah, this is the year to do this!'\" While he's thrilled that the Gallagher brothers are coming to town, it means many performers are taking a financial hit. \"I'll give you an example, I tried to get the same flat that I've had the last two years at the Fringe, a student flat, nothing fancy, and it costs an extra thousand pounds this year.\" Because of the increased demand for beds, newcomer Amy Albright will be sleeping in her red Volkswagen for her two-week stint at the Fringe. \"Costs are even more expensive,\" she says. \"It's just not an option for me, so instead I'm living in my car.\" With blackout blinds and a portable coffee maker, she says it's actually not as bad as some might think. \"I park just outside of town in a really nice safe area, I use a gym for showers ... this saves me so much money ... I wouldn't be able to afford to perform at the Fringe otherwise.\" Holly Spillar's show Tall Child explores her relationship with class. She was fortunate enough to be one of 180 recipients of a £2,500 bursary from the Edinburgh Festival Fringe Society. It is the third year the Keep it Fringe fund has been run, backed this year by a £1m injection of government money. As Holly explains: \"I live month to month on a minimum wage job ... and it costs me about five grand to do the fringe.\" Alongside the grant, she's also had to take out a loan, which she says will take her two years to pay back. \"It's a very precarious situation you put yourself in just to be in the room,\" she adds. Chloe Petts - now an established name on the comedy circuit - says the problem needs to be recognised for being less about Oasis and more about a problem that's been brewing for years. \"Accommodation is just totally out of control,\" she says. \"If this leads us to further conversations about that, then fantastic but ... it has to be a conversation about how it's totally unaffordable for the average person to come to the Fringe, and I think that's stopping a lot of people coming up who deserve to be here.\" Scottish comedian Susan McCabe, a lifelong Oasis fan, reckons there's no point getting too worked up, especially given the siblings fractious relationship. \"We are here every year and they may not even be here for those three gigs ... they might have fallen out by then!\" She adds: \"It is what it is, at the end of the day ... they were the greatest rock and roll band of the 1990s, just let them be.\" Read more:Jewish comedian says shows cancelled - as Gaza in spotlightWatch: How do geopolitics feed into Fringe festival? • Amy Albright is performing her stand-up at locations across Edinburgh, including Not My Audience!, on 8 August• Holly Spillar: Tall Child is at Underbelly until 24 August• Chloe Petts: Big Naturals is at Pleasance Courtyard until 24 August• Susan McCabe: Best Behaviour is at Gordon Aikman Theatre until 24 August• The Britpop Hour with Marc Burrows is at Underbelly until 25 August"
    },
    {
        "title": "Coldplay's viral kiss cam set to feature in UK shows",
        "description": "Fans attending this month's Coldplay concerts in Hull could find themselves going viral thanks to the band's kiss cam.",
        "url": "https://news.sky.com/story/coldplays-viral-kiss-cam-set-to-feature-in-uk-shows-13405471",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-coldplay-concert-chris-martin_6968256.jpg?20250719035201",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-02 07:37:00",
        "Headline": "Couples attending the band's shows in Hull may find themselves projected on the big screen - which led to a hugely viral moment when used in the US.",
        "Content": "Fans attending this month's Coldplay concerts in Hull could find themselves going viral thanks to the band's kiss cam. Dr Paul Sewell, chairman of rugby league team Hull Kingston Rovers, has confirmed that the famous kiss cam - which caught a US tech boss embracing one of his employees - will make an appearance at the British band's shows at Craven Park stadium. In a post on X, Dr Sewell wrote: \"To those business sorts bringing their PAs - the 'Big Kiss Cam' will feature!!\" It comes after the internet was sent into a frenzy over a clip of the chief executive of tech firm Astronomer, Andy Byron, being caught cuddling the company's chief people officer, Kristin Cabot, during a concert in Boston. The pair were picked from the crowd during the gig at the Gillette Stadium, in Massachusetts, on 16 July, and projected onto the big screen by the band's kiss cam. Once both of them realise, Mr Byron quickly ducks out of view, while Ms Cabot plunges her head into her hands and turns her back to the screen.  Coldplay's lead singer Chris Martin poked fun at the couple at the time - quipping: \"Either they're having an affair or they're very shy.\" Both Mr Byron and Ms Cabot subsequently resigned from Astronomer after the footage was posted online, and the company later released a tongue-in-cheek clip on social media - featuring Chris Martin's ex-wife Gwyneth Paltrow as a \"temporary spokesperson\". Read more from Sky News:Why Oasis reunion is 'catastrophic' for EdinburghBrian Cox: Trump talking 'b*******s' on independence After making headlines in the US, Coldplay are now heading to the UK. First up is Craven Park stadium on 18 and 19 August, before 10 nights at London's Wembley Stadium from 22 August to 9 September. It will be the first time the band has played in Hull and, in a world first for a stadium show, the Wembley gigs will be powered entirely by solar, wind and kinetic energy."
    },
    {
        "title": "Thousands of hot dogs spill across busy highway ",
        "description": "A truckload of hot dogs has spilled across a busy road in Pennsylvania.",
        "url": "https://news.sky.com/story/hot-dog-spill-blocks-highway-on-wurst-fry-day-for-motorists-13405436",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hot-dogs-shrewsbury_6980439.jpg?20250802035446",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-08-02 02:55:00",
        "Headline": "Crews mustard up the courage to dispose of thousands of sausages, with a fire chief saying: \"I can tell you personally, hot dogs are very slippery. I did not know that.\"",
        "Content": " A truckload of hot dogs has spilled across a busy road in Pennsylvania. A mechanical problem meant the truck scraped along a concrete divider - ripping the trailer open and scattering the sausages across the highway. It was the wurst Fry-day commute that motorists in Shrewsbury had to contend with for years. Crews mustard up the courage to begin a morning rush hour clean-up - and didn't mince their words. \"Once those leave the truck and hit the road, that's all garbage, and it's still pretty warm,\" Shrewsbury Fire Company Chief Brad Dauberman said. \"I can tell you personally, hot dogs are very slippery,\" he added. \"I did not know that.\" A front-end loader was used to scoop up the wieners and drop them into a dump truck."
    },
    {
        "title": "'This shouldn't have happened': Bishop who interrupted church choir in dressing gown apologises",
        "description": "A bishop who interrupted a church concert in his dressing gown - and told singers to \"leave his house\" - has formally apologised to the choir.",
        "url": "https://news.sky.com/story/bishop-who-interrupted-church-concert-in-his-dressing-down-formally-apologises-to-choir-13405435",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-bishop-church_6974905.jpg?20250727014901",
        "type": "Strange",
        "Author": "Connor Sephton",
        "Date Published": "2025-08-02 02:00:00",
        "Headline": "The choir have said it was \"upsetting\" that they were unable to finish their show as planned, but \"hold no hard feelings and wish the bishop well\".",
        "Content": "\n          News reporter\n              @ConnorSephton\n  A bishop who interrupted a church concert in his dressing gown - and told singers to \"leave his house\" - has formally apologised to the choir. Jonathan Baker was filmed standing barefoot at a microphone as he criticised performers for making a \"terrible racket\" at St Andrew's Church in central London. Addressing the City Academy Voices choir directly, the bishop of Fulham said: \"I write to apologise for the distress and offence I caused in bringing the concert to a premature end. \"This should not have happened … I also apologise for remarks which were made in haste, and which have understandably caused hurt and distress.\" Mr Baker had demanded for the performance to stop because it was 10pm - and says he didn't realise the choir had booked the church until 11pm. In the statement obtained by Sky News, he added: \"I have lived here on site at St Andrew's for 10 years, for much of which City Academy has rehearsed and performed here. \"You have been, and continue to be, welcome - and I hope that you will be able to continue the relationship with us. \n                  Lucy was murdered in 2005. There's been no confirmed sighting of a key suspect ever since\n                 \n                  Strictly Come Dancing: BBC responds as two TV stars accused of taking cocaine\n                 \n                  Inside the prison doing family visits differently - as children visit father 'at work'\n                 \"I can give you every assurance that the events of Friday evening will not recur, and I apologise again to performers (especially those unable to perform at the end of the evening) and the audience alike.\" The choir was performing to a 300-strong audience in Holborn when the lights were suddenly turned off, with Mr Baker declaring the concert was \"over\". A church employee then asked the crowd to leave quietly and for the musicians to step down from the stage, attracting boos from the audience. The choir went on to perform one last song, an A cappella version of ABBA's Dancing Queen, before bringing their show to a close. Read more from Sky News:Why Oasis tour is 'catastrophic' for Fringe performersNorth Korea opens its doors to Russian tourists  One member of the audience, who was attending with his 10-year-old daughter, told Sky News he initially thought the interruption was a staged joke. Benedict Collins had said: \"This work deserves respect, not to be disparaged as a 'terrible racket'. The people here had put their heart and soul into it. \"The bishop cut them off in midstream, preventing soloists who had worked their hardest from singing - and preventing the audience, which included people of all ages, from enjoying it to the end.\" The choir told Sky News it was \"upsetting\" that they were unable to finish their show as planned, but \"hold no hard feelings and wish the bishop well\". A spokesperson added: \"If anyone is thinking of joining one of our choirs, the City Academy Voices rehearse on Mondays in central London. Dressing gowns optional.\""
    }
]