[
    {
        "title": "'Nobody likes Trump': Sky News finds defiance on the streets of Tehran",
        "description": "To&#160;the sound of mournful chants and the slow beat of drums, they march, whipping their backs with metal flails.",
        "url": "https://news.sky.com/story/nobody-likes-trump-sky-news-finds-defiance-on-the-streets-of-tehran-13392867",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ashura-iran_6958088.jpg?20250705175551",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-05 16:02:00",
        "Headline": "Iran believed it was making diplomatic progress in talks with America, which it hoped could lead to a deal. Then Israel launched its attacks and, instead of condemning them, the US joined in. Iranian officials are outwardly defiant, but privately pursuing fresh negotiations.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  To the sound of mournful chants and the slow beat of drums, they march, whipping their backs with metal flails. It is an ancient ceremony going back almost 14 centuries - the Shia commemoration of Ashura. But this year in particular has poignant significance for Iranians. The devout remember the betrayal and death of the Imam Hussein as if it happened yesterday.  We filmed men and women weep as they worshipped at the Imamzadeh Saleh Shrine in northern Tehran. The grandson of the Prophet Muhammad was killed by the armies of the Caliph Yazid in the seventh century Battle of Karbala. \n                  Inside Iran's Evin Prison - as Tehran says damage shows Israel targeted civilians\n                 \n                  What's it actually like in Iran right now?\n                 \n                  Iran: Still a chance for peace talks with US\n                 Shia Muslims mark the anniversary every year and reflect on the virtue it celebrates - of resistance against oppression and injustice. But more so than ever this year, in the wake of Israel and America's attacks on their country. The story is one of prevailing over adversity and deception. A sense of betrayal is keenly felt here by people and officials. Many Iranians believe they were lured into pursuing diplomacy as part of a ruse by the US. Iran believed it was making diplomatic progress in talks with America, which it hoped could lead to a deal. Then Israel launched its attacks and, instead of condemning them, the US joined in. \"Death to Israel\" chants resounded outside the mosque in skies that for 12 days were filled with the sounds of Israeli jets. There is a renewed sense of defiance here. One man told us: \"The lesson to be learned from Hussein is not to give in to oppression, even if it is the most powerful force in the world.\" A woman was dismissive about the US president. \"I don't think about Trump. Nobody likes him. He always wants to attack too many countries.\" Pictures on billboards nearby link Imam Hussein's story and current events. They show the seventh century imam on horseback alongside images of modern missiles and drones from the present day. Other huge signs remember the dead. Iran says almost 1,000 people were killed in the strikes, many of them women and children. Officially Iran is projecting defiance, but not closing the door to diplomacy. Government spokeswoman Dr Fatemeh Mohajerani told Sky News that Israel should not even think about attacking again. \"We are very strong in defence, and as state officials have announced, this time Israel will receive an even stronger response compared to previous times. We hope that Israel will not make such a mistake.\" But there is also a hint of conciliation. Senior Iranian officials have told Sky News back-channel efforts are under way to explore new talks with the US. Israel had hoped its attacks could topple the Iranian leadership. Those hopes proved unfounded. The government is in control here. For many Iranians it seems quite the opposite happened - the 12-day war has brought them closer together."
    },
    {
        "title": "Elon Musk says he's created his own political party - the 'America Party'",
        "description": "Elon Musk says he has created a new political party - the America Party - \nafter asking his followers if he should do so in an online poll.",
        "url": "https://news.sky.com/story/elon-musk-says-hes-created-his-own-political-party-the-america-party-13392958",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-white-house_6958224.jpg?20250705213724",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-05 19:57:00",
        "Headline": "A day after Donald Trump signed into law his sweeping tax cut and spending bill, which Musk had repeatedly attacked, the billionaire Tesla boss says he is forming the 'America Party'.",
        "Content": "Elon Musk says he has created a new political party - the America Party - \nafter asking his followers if he should do so in an online poll. It follows his public falling out with Republican President Donald Trump. On Friday, the tech billionaire had asked his followers on X whether a new US political party should be created. On Saturday evening he wrote on the same platform: \"By a factor of 2 to 1, you want a new political party and you shall have it! \"When it comes to bankrupting our country with waste & graft, we live in a one-party system, not a democracy. \"Today, the America Party is formed to give you back your freedom.\"  The world's richest man made the announcement just one day after President Trump signed a tax-cut and spending bill into law on Friday, which Musk had fiercely opposed. \n                  More bad news for Elon Musk as Tesla deliveries miss target again\n                 \n                  Donald Trump's 'big, beautiful bill' has sparked ugly debate - so why is it so controversial?\n                 \n                  Videos show driverless Tesla 'robotaxis' braking hard without warning - and on wrong side of the road \n                 Musk had previously said he would form and fund a new political party to unseat lawmakers who supported the bill. From bromance to bust-up The Tesla boss backed Mr Trump's election campaign with more than a quarter of a billion dollars, later rewarded with a high-profile role running the newly created department of government efficiency (DOGE). But observers of the two men, both with huge wealth and reputations, wondered how long the bromance would last. In May, Musk left the role, still on good terms with the president but criticising key parts of his legislative agenda. After that the attacks spiralled, with Musk slamming the sweeping tax and spending bill as a \"disgusting abomination\" and Mr Trump hitting back in a barbed tit-for-tat. President Trump earlier this week threatened to cut off the billion-dollar federal subsidies that flow to Musk's companies, and said he would even consider deporting him."
    },
    {
        "title": "Police arrest 29 protesters on suspicion of terror offences after Palestine Action banned",
        "description": "Police have arrested 29 protesters on suspicion of terror offences after a ban on the Palestine Action group came into effect.",
        "url": "https://news.sky.com/story/police-arrest-protesters-supporting-palestine-action-after-group-designated-as-terrorist-organisation-13392763",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestine-action-protest_6957887.jpg?20250705143428",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-05 13:12:00",
        "Headline": "The protest group was officially classified as a terrorist organisation from midnight on Saturday after the measure received overwhelming support from MPs and following the failure of a last-minute legal challenge to delay it.",
        "Content": " Police have arrested 29 protesters on suspicion of terror offences after a ban on the Palestine Action group came into effect. The protest group was officially proscribed as a terrorist organisation from midnight on Saturday after a last-minute legal challenge at the Court of Appeal to delay it failed. The Metropolitan Police said on Saturday afternoon that the protesters had been held on suspicion of committing offences under the Terrorism Act 2000 following a protest in London's Parliament Square. \"The group is now proscribed and expressing support for them is a criminal offence,\" the force added. \"Arrests are being made.\" MPs overwhelmingly voted in favour of Home Secretary Yvette Cooper's decision to ban the protest group under the legislation on Wednesday and the House of Lords approved the move the following day. The law change adds Palestine Action to the list of banned organisations along with the likes of al Qaeda, ISIS and Hezbollah, and makes membership of, or support for, the direct action group a criminal offence punishable by up to 14 years in prison. Even wearing a T-shirt or badge with the group's name on attracts a maximum six-month sentence. On Saturday, a large number of Metropolitan Police officers circled around dozens of protesters carrying placards that said: \"I oppose genocide. I support Palestine Action.\" Israel has strongly denied any allegations of genocide. Campaign group Defend Our Juries said demonstrators were set to gather in Parliament Square on Saturday holding signs supporting Palestine Action. Officers who attended the protest were met with cries of \"Met Police you are puppets of the Zionist state\" and \"leave them alone\". Others were heard shouting, \"British police off our streets\", and \"from the river to the sea, Palestine will be free\". Chants of \"shame\" were directed at police. A woman seen lying on the floor in handcuffs was carried away by officers and put in a police van. She was heard saying: \"Free Palestine, stop the genocide, I oppose genocide, I support the rights of the Palestinian people, I support freedom of speech, I support freedom of assembly.\" A large group of people crowded around to film the scene. Officers placed her in a vehicle before returning to the square's Mahatma Gandhi statue. The protest started at about 1.10pm and officers were seen taking people away shortly after 1.30pm. Most of the officers dispersed at around 2.10pm. 'Creeping totalitarianism' Leslie Tate, 76, a Green councillor from Hertfordshire, said the group is not a violent organisation, and the proscription is wrong, adding the protest was \"necessary to defend our democracy, and this is the creeping edge of totalitarianism\". Among those removed by police was Reverend Sue Parfitt, who is 83. Ms Cooper announced plans to proscribe Palestine Action after two Voyager aircraft were allegedly damaged at RAF Brize Norton in Oxfordshire on 20 June, which police said caused around £7m worth of damage. T-shirt could bring six-month jail term Even wearing a T-shirt or badge with the group's name on attracts a maximum six-month sentence. On Friday, the High Court heard the decision to ban the group was taken before the aircraft were allegedly damaged and as early as March this year. Huda Ammori, the co-founder of Palestine Action, is seeking to bring a legal challenge against the Home Office with a hearing for permission to bring a judicial review set to take place during the week of 21 July. On Friday, her lawyers applied for \"interim relief\" to temporarily block the legislation from coming into force until that hearing, arguing the Irish author Sally Rooney, who wrote Normal People, was among supporters who fear the \"ramifications\". But three judges, including the Lady Chief Justice Baroness Carr, refused a bid to pause the ban coming into effect pending any Supreme Court bid at about 10.30pm on Friday, less than two hours before the ban was due to come into force. Read more on Sky News:Oasis reunion 'all about the music'Liverpool stars at Jota's funeralReform MP suspends himself In their judgment, the judges said: \"The role of the court is simply to interpret and apply the law. \"The merits of the underlying decision to proscribe a particular group is not a matter for the court... Similarly, it is not a matter for this court to express any views on whether or not the allegations or claims made by Palestine Action are right or wrong.\""
    },
    {
        "title": "Ozzy Osbourne reunites with Black Sabbath for 'final bow' in emotional metal goodbye",
        "description": "Ozzy Osbourne has reunited with Black Sabbath and performed his final gig - telling fans \"you've no idea how I feel - thank you from the bottom of my heart\", in an emotional but truly metal goodbye.",
        "url": "https://news.sky.com/story/ozzy-osbourne-reunites-with-black-sabbath-for-final-gig-in-emotional-metal-goodbye-13392999",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne_6958282.jpg?20250705235044",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-05 22:06:00",
        "Headline": "The Back To The Beginning concert was billed as the \"final bow\" for the man revered as a founder of heavy metal after several years of health problems, including Parkinson's disease.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Ozzy Osbourne has reunited with Black Sabbath and performed his final gig - telling fans \"you've no idea how I feel - thank you from the bottom of my heart\", in an emotional but truly metal goodbye. Announced earlier this year, Back To The Beginning at Villa Park stadium was billed as the \"final bow\" for the man revered as a founder of heavy metal after several years of health problems, including Parkinson's disease. Rising up on a black throne featuring jewelled skulls, the 76-year-old performed a solo set before being joined by his original bandmates - Terence \"Geezer\" Butler, Tony Iommi and Bill Ward - for Black Sabbath's first performance in 20 years. \"Let the madness begin,\" Osbourne cried as he appeared for the first time, telling about 40,000 fans: \"It's so good to be on this stage.\" With the crowd chanting his name, he performed both sets sitting down, but the voice and the crazed glint in his eyes were there almost throughout. Singing fan favourites including Mr Crowley and Crazy Train, and Iron Man and Paranoid with Black Sabbath, Osbourne conducted the crowd to sing \"louder, louder\", and \"go f****** crazy\". This was an orchestrated exit by heavy metal's biggest character, with a supporting line-up of hard rock luminaries - from Slayer and Halestorm to Metallica and Guns 'n' Roses, plus stars including Steven Tyler, Ronnie Wood, Yungblud, Travis Barker and Chad Smith, who showed up for \"supergroup\" performances. \n                  Who is Ozzy Osbourne? From Black Sabbath's Prince Of Darkness to relationship with Sharon and reality TV stardom\n                 \n                  Ozzy Osbourne to reunite with Black Sabbath for 'final bow' performance\n                 \n                  Ozzy Osbourne's former guitarist shot multiple times while walking his dog\n                 Many said they would not be the musicians they are without Osbourne and Black Sabbath. \"You know, there's not another guy as respected in metal as Ozzy Osbourne,\" former Van Halen singer Sammy Hagar told Sky News just ahead of his performance. \"And for him to be sick and to be saying, I'm out, I'm done. Man. There's no one else that can replace that.\" \"Without Sabbath, there would be no Metallica,\" said frontman James Hetfield during their performance. \"We're not here to say goodbye,\" said Anthrax's Scott Ian. \"We're just here to say thank you.\" Throughout the day, giant Ozzy and Black Sabbath beach balls, in the Aston Villa claret and blue, were bounced around a jubilant crowd. Tributes from other celebrity friends and fans, from Billy Idol and Ricky Gervais to Dolly Parton and Sir Elton John, were played on screen. Read more: From Black Sabbath's Prince of Darkness to reality TV star Hollywood actor Jason Momoa, who hosted the event, told the crowd heavy metal had been a \"safehaven\" for many growing up, and Black Sabbath's music had \"influenced and inspired musicians\" of all eras and genres. The farewell show was the idea of Osbourne's wife, Sharon - one final gig to finish his performing career on a high - after he was forced to cancel shows he had planned in 2023, telling fans he \"never imagined\" his touring days would end that way. Sharon Osbourne told Sky News earlier this year that his one regret was not being able to say a thank you to his fans, and so the idea for the reunion gig was born. Profits from the show will be shared between Cure Parkinson's, Birmingham Children's Hospital, and Acorn's Children's Hospice. The gig came after the Black Sabbath band members were awarded the freedom of Birmingham earlier in June, recognised for their significance to the cultural and musical identity of the city they grew up in. The group formed in 1968 and went on to become one of the most successful metal bands of all time, selling more than 75 million albums worldwide over the years. They were inducted into the Rock & Roll Hall of Fame in 2006 - Osbourne again later as a solo artist last year - and awarded a lifetime Ivor Novello songwriting award in 2015. In 2019, they were presented with a Grammy lifetime achievement prize. Now, their first performance in 20 years will also be their last - one for the metal history books. The show ended with fireworks and a roar from the crowd, who had chanted Ozzy's name throughout. For fans, Back To The Beginning capped it all - the ultimate rock and metal line-up, and one last opportunity to show their love for the Prince of Darkness. \"I feel lucky to be able to attend this,\" said Calum Kennedy, 19, from Dunfermline. \"It's the biggest metal show known to man, [the biggest line-up] ever. I've never seen anything better.\" Read more from Sky News:Oasis reunion: Ultimately, it was all about the musicBBC to stop showing 'high risk' performances live Ben Sutton, 24, from Chester, added: \"I feel like it's important - we're of the younger generation - for us to see some of the heritage and history of the genre we love, metal in general. It's such an honour to say goodbye to him.\" Steve Townson, from Lincolnshire, said: \"I saw him the first time round and the fact that he's still going is incredible, isn't it? I was there at the start, I'm happy to be here at the end.\""
    },
    {
        "title": "Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat",
        "description": "On Thursday, Reform UK's Zia Yusuf was gloating that a hard-left party led by Jeremy Corbyn meant the odds of Nigel Farage becoming PM had narrowed further.",
        "url": "https://news.sky.com/story/reform-uk-mp-james-mcmurdock-comes-out-fighting-as-rivals-gloat-13392899",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-james-mcmurdock-reform-uk_6958145.jpg?20250705191511",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-07-05 17:30:00",
        "Headline": "Mr McMurdock strongly insists his business dealings were always lawful, compliant and checked by relevant authorities. But that hasn't stopped rival parties from revelling in the \"chaos\", as the number of Reform MPs drops from five to four.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  On Thursday, Reform UK's Zia Yusuf was gloating that a hard-left party led by Jeremy Corbyn meant the odds of Nigel Farage becoming PM had narrowed further. But now that James McMurdock's self-suspension over \"business propriety\" allegations means Reform UK is down from five MPs to four - again - it's Reform's rivals who are gloating. \"Does Farage think he [McMurdock] is fit to be an MP?\" demanded Labour's chair, Ellie Reeves, while the Conservatives claimed: \"Reform are perpetually in chaos…\"   Despite garnering 14.3% of the votes in the general election a year ago, Mr Farage's party won just five seats. Then there were four, after Rupert Lowe was ousted in March. Then, after Sarah Pochin's triumph in the Runcorn and Helsby by-election in May, it was five again. And now it's four again. For now, at least. A defiant Mr McMurdock is fighting back and says he only removed the party whip from himself as a precaution and to protect Reform UK. \"All my business dealings [have] always been conducted fully within the law and in compliance with all regulations,\" he wrote on X on Saturday. The Sunday Times claims he took out £70,000 of loans during the pandemic under a government Bounce Back scheme through two companies he owned. Read more:Has Labour's first year been a success or failure?New party under Corbyn would threaten StarmerChancellor hints at tax rises in Autumn budget The paper claims one had no employees and neither filed accounts, a violation of the Companies Act, and he failed to declare one of the directorships in the MPs' register of interests. This is not the first controversy for Mr McMurdock, whose 39th birthday was last Saturday, since he became an MP a year ago. It has been a difficult 12 months for him. He was, in fact, never meant to become an MP. He was what's known in political jargon as a \"paper candidate\", picked at the last moment to fight a seat held by the Tories with a majority of nearly 20,000. But Basildon South and Thurrock East voted 73% for Brexit, one of the highest margins of the 2016 referendum, so perhaps a shock win for Reform UK shouldn't have come as a surprise. After a marathon recount, Mr McMurdock won by just 98 votes, with Labour second and the former Conservative MP Stephen Metcalfe, who'd held the seat since 2010, third. Before long it emerged that aged 19 he was imprisoned for a week for assaulting a former girlfriend. He's admitted it's the \"biggest regret of my life\". And Mr Farage has revealed: \"He wasn't vetted.\" The Reform UK leader has also claimed his party was \"stitched up\" by a firm it contracted to vet candidates. Now Mr McMurdock is claiming he's been stitched up - by The Sunday Times. He's also come out fighting against the allegations, insisting \"appropriately qualified professionals had reviewed all activity\" and confirmed compliance with the law. And he rebutted the paper's charge that he failed to declare a directorship in the MPs' register of interests. He says he completed his entry with the support of the parliamentary authorities. 👉 Click here to listen to Electoral Dysfunction on your podcast app👈 That hasn't stopped Labour demanding an inquiry by the parliamentary committee for standards. After all, we've seen Sir Keir Starmer at PMQs in recent weeks taking every opportunity to attack Reform UK. In Reform UK's defence against vetting lapses, it's claimed that an insurgent party is bound to attract mavericks. But amid the heady talk of a Reform UK government at the next election, Mr Farage has a cunning plan. He's now talking about following Gordon Brown's example and recruiting GOATS, a \"government of all the talents\". Mr Brown appointed former CBI boss Digby Jones and Lord West, the former First Sea Lord. For now, though, the latest James McMurdock row is more about gloats than GOATs."
    },
    {
        "title": "Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest",
        "description": "This was Gondomar's saddest day.",
        "url": "https://news.sky.com/story/porto-suburbs-saddest-day-as-diogo-jota-and-his-brother-andre-silva-are-laid-to-rest-13392947",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diogo-jota-funeral_6957682.jpg?20250705110459",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-07-05 19:21:00",
        "Headline": "In the saddest of circumstances, Gondomar's football fans now know the world appreciated Jota's talents as much as they did.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  This was Gondomar's saddest day. The Igreja Matriz de Gondomar church was overflowing. Mourners spilled out of the doors into the fierce morning heat. And residents lined the streets nearby in the baking sunshine. This eastern suburb of Porto was the focus of world football in a way never imagined, nor desired.  There was no raucous chanting. No attempts to chase selfies with mourners from the football world. Just sombre applause, as residents listened to an audio relay of the service, offered in solidarity with a family grieving. Two days after dying together in a car crash in northern Spain, brothers Diogo Jota, a Liverpool striker, and fellow footballer Andre Silva were buried together. It is a heartache no parent is prepared for. Isabel and Joaquim Silva attending a joint funeral for both sons. A wife burying her husband of 11 days. Addressing Rute Cardoso and the three children she had with Diogo, the Bishop of Porto, Manuel Linda, said: \"If it is hard to see an adult cry, it is much harder to see a child cry.\" The family was left in no doubt how beloved the brothers were in their community, country and the sport they loved. From Wolves - Jota's first club in England - a message was brought on a wreath carried by João Moutinho, a teammate there and also with Portugal. \"Your desire to fight and win lit up Molineux,\" it read, referring to the Wolverhampton Stadium. Flowers in the shape of a football pitch were brought by Liverpool, featuring the brothers' shirt numbers. A number 20 for Liverpool's scorer of 65 goals was carried by captain Virgil van Dijk. Andy Robertson brought another featuring a number 30 - honouring Silva as the player in Portugal's second division with Penafiel. Read more:Diogo Jota and Andre Silva's funeral in picturesLiverpool stars to attend funeral for Diogo Jota and his brother Both started their footballing journeys at Gondomar's small local team. \"May their memory and love remain forever in our hearts,\" read a message brought by Liverpool. The last time they were together as a squad in May was to parade the Premier League trophy with Jota through Liverpool. Now they have broken off from summer holidays to mourn the man whose goals brought so much glory, who will never return to the team. And in Gondomar you could find the proudest fans. Fabio Silva came in a treasured shirt signed by Jota in which he scored one of 65 goals for the Reds on Boxing Day 2023. \"We in Portugal,\" the 36-year-old said, \"didn't know how famous or how special Diogo was around the world\". In the saddest of circumstances, now they know the world appreciated Jota's talents as much as they did. \"Since Thursday, it has been some difficult days,\" Fabio Silva added. \"And for the family it will be very long weeks and months.\" Diogo Jota was only 28. Andre Silva, who went by the family's surname, three years younger. After enduring such trauma, so publicly, the family will surely look to grieve in private. The hope will be that both are remembered by how they lived, and not how they died - as humble footballers and family men who inspired beyond their hometown."
    },
    {
        "title": "Women's Euros: France v England",
        "description": null,
        "url": "https://news.sky.com/story/womens-euros-wales-v-netherlands-13392909",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ella-toone-football_6958234.jpg?20250705221040",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-05 17:53:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Diogo Jota: Liverpool players join mourners as Premier League star and his brother Andre Silva buried in Portugal",
        "description": "Liverpool players past and present have joined the family and friends of Diogo Jota and his brother Andre Silva for their funeral in Portugal.",
        "url": "https://news.sky.com/story/diogo-jota-liverpool-players-join-mourners-as-premier-league-star-and-his-brother-andre-silva-buried-in-portugal-13392726",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-liverpool-joe-gomez-and-arne-slot_6957664.jpg?20250705104036",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-07-05 11:35:00",
        "Headline": "A funeral service was held for the brothers, who died in a car crash on Thursday, at the Igreja Matriz de Gondomar church in their hometown of Gondomar near Porto in northern Portugal on Saturday morning.",
        "Content": " Liverpool players past and present have joined the family and friends of Diogo Jota and his brother Andre Silva for their funeral in Portugal. A service was held in the Igreja Matriz de Gondomar church in their hometown of Gondomar near Porto in northern Portugal on Saturday morning. Mourners lined the streets and some in the crowd clapped as the brothers' coffins were carried into the church. The funeral - in pictures Jota, 28, leaves behind his wife of only 11 days, Rute Cardoso, and three young children. His younger brother, 25, was an attacking midfielder for Penafiel in the second tier of Portuguese football. Liverpool manager Arne Slot, captain Virgil Van Dijk and teammates including Andy Robertson, Conor Bradley, Ryan Gravenberch, Cody Gakpo, Curtis Jones, Darwin Nunez and Joe Gomez were seen at the service. \n                  'Nobody likes Trump': Sky News finds defiance on the streets of Tehran\n                 \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Hamas gives 'positive' response to ceasefire proposal but asks for amendments\n                 Former teammates Jordan Henderson, James Milner and Fabinho were also there. Van Dijk carried a red wreath with Jota's number 20, while Robertson had a wreath featuring number 30, Silva's number at Penafiel. Some of Jota's teammates in the Portuguese national side also attended, including Bruno Fernandes, of Manchester United, Ruben Dias and Bernardo Silva, of Manchester City, Joao Felix and Renato Veiga, of Chelsea, Nelson Semedo, from Wolves, Joao Moutinho and Rui Patricio. Ruben Neves was one of the pallbearers after flying in from Florida where he played for Al Hilal in the Club World Cup quarter-final on Friday night. 'More than a friend' In a post published on Instagram before the service, he told Jota he had been \"more than a friend, we're family, and we won't stop being that way just because you've decided to sign a contract a little further away from us!\" Jota's fellow Liverpool midfielder, Alexis Mac Allister, said on Instagram: \"I can't believe it. I'll always remember your smiles, your anger, your intelligence, your camaraderie, and everything that made you a person. It hurts so much; we'll miss you. Rest in peace, dear Diogo.\" Porto FC president Andre Villas-Boas and Portugal national team manager Roberto Martinez were also in attendance. 'With us forever' Speaking after the ceremony, Martinez said the period since their deaths had been \"really, really sad days, as you can imagine, but today we showed we are a large, close family. \"Their spirit will be with us forever.\" The service was private, but the words spoken by the Bishop of Porto, Manuel Linda, were broadcast to those standing outside the church. He told Jota's children, who were not at the service, that he was praying for them specifically, as well as their mother and grandparents. \"There are no words, but there are feelings,\" he said, adding: \"We also suffer a lot and we are with you emotionally.\" The brothers died after a Lamborghini they were travelling in burst into flames following a suspected tyre blowout in the early hours of Thursday morning. Read more on Sky News:Oasis reunion 'all about the music'24 dead in Texas floodsReform MP suspends himself No other vehicles are said to have been involved in the incident. Liverpool have delayed the return of their players for pre-season following Jota's death and players past and present paid tribute to him and his brother on social media. Flowers have been left outside Anfield, where flags have been lowered to half-mast and all club shops, museums and tours have been closed until Monday."
    },
    {
        "title": "Diogo Jota: Liverpool players join mourners as Premier League star and his brother Andre Silva buried in Portugal",
        "description": "Liverpool players past and present have joined the family and friends of Diogo Jota and his brother Andre Silva for their funeral in Portugal.",
        "url": "https://news.sky.com/story/diogo-jota-liverpool-players-join-mourners-as-premier-league-star-and-his-brother-andre-silva-buried-in-portugal-13392726",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-liverpool-joe-gomez-and-arne-slot_6957664.jpg?20250705104036",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-05 11:35:00",
        "Headline": "A funeral service was held for the brothers, who died in a car crash on Thursday, at the Igreja Matriz de Gondomar church in their hometown of Gondomar near Porto in northern Portugal on Saturday morning.",
        "Content": " Liverpool players past and present have joined the family and friends of Diogo Jota and his brother Andre Silva for their funeral in Portugal. A service was held in the Igreja Matriz de Gondomar church in their hometown of Gondomar near Porto in northern Portugal on Saturday morning. Mourners lined the streets and some in the crowd clapped as the brothers' coffins were carried into the church. The funeral - in pictures Jota, 28, leaves behind his wife of only 11 days, Rute Cardoso, and three young children. His younger brother, 25, was an attacking midfielder for Penafiel in the second tier of Portuguese football. Liverpool manager Arne Slot, captain Virgil Van Dijk and teammates including Andy Robertson, Conor Bradley, Ryan Gravenberch, Cody Gakpo, Curtis Jones, Darwin Nunez and Joe Gomez were seen at the service. \n                  'Nobody likes Trump': Sky News finds defiance on the streets of Tehran\n                 \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Hamas gives 'positive' response to ceasefire proposal but asks for amendments\n                 Former teammates Jordan Henderson, James Milner and Fabinho were also there. Van Dijk carried a red wreath with Jota's number 20, while Robertson had a wreath featuring number 30, Silva's number at Penafiel. Some of Jota's teammates in the Portuguese national side also attended, including Bruno Fernandes, of Manchester United, Ruben Dias and Bernardo Silva, of Manchester City, Joao Felix and Renato Veiga, of Chelsea, Nelson Semedo, from Wolves, Joao Moutinho and Rui Patricio. Ruben Neves was one of the pallbearers after flying in from Florida where he played for Al Hilal in the Club World Cup quarter-final on Friday night. 'More than a friend' In a post published on Instagram before the service, he told Jota he had been \"more than a friend, we're family, and we won't stop being that way just because you've decided to sign a contract a little further away from us!\" Jota's fellow Liverpool midfielder, Alexis Mac Allister, said on Instagram: \"I can't believe it. I'll always remember your smiles, your anger, your intelligence, your camaraderie, and everything that made you a person. It hurts so much; we'll miss you. Rest in peace, dear Diogo.\" Porto FC president Andre Villas-Boas and Portugal national team manager Roberto Martinez were also in attendance. 'With us forever' Speaking after the ceremony, Martinez said the period since their deaths had been \"really, really sad days, as you can imagine, but today we showed we are a large, close family. \"Their spirit will be with us forever.\" The service was private, but the words spoken by the Bishop of Porto, Manuel Linda, were broadcast to those standing outside the church. He told Jota's children, who were not at the service, that he was praying for them specifically, as well as their mother and grandparents. \"There are no words, but there are feelings,\" he said, adding: \"We also suffer a lot and we are with you emotionally.\" The brothers died after a Lamborghini they were travelling in burst into flames following a suspected tyre blowout in the early hours of Thursday morning. Read more on Sky News:Oasis reunion 'all about the music'24 dead in Texas floodsReform MP suspends himself No other vehicles are said to have been involved in the incident. Liverpool have delayed the return of their players for pre-season following Jota's death and players past and present paid tribute to him and his brother on social media. Flowers have been left outside Anfield, where flags have been lowered to half-mast and all club shops, museums and tours have been closed until Monday."
    },
    {
        "title": "Diogo Jota and Andre Silva's funeral in pictures",
        "description": "The family and friends of Diogo Jota and his brother Andre Silva have been joined by Liverpool stars past and present and other Portuguese players at the pair's funeral near Porto.",
        "url": "https://news.sky.com/story/diogo-jota-and-andre-silva-funeral-in-pictures-13392703",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diogo-jota-andre-silva_6957675.jpg?20250705110013",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-05 10:44:00",
        "Headline": "The funeral was held at the Igreja Matriz de Gondomar church in the town of Gondomar near Porto with images showing players and managers arriving for the ceremony.",
        "Content": " The family and friends of Diogo Jota and his brother Andre Silva have been joined by Liverpool stars past and present and other Portuguese players at the pair's funeral near Porto. The Liverpool forward, 28, and his brother died in a car crash in Spain on Thursday. Pictures below show the funeral at the Igreja Matriz de Gondomar church in the town of Gondomar near Porto. Click here for our liveblog coverage of the day's events.  "
    },
    {
        "title": "Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat",
        "description": "On Thursday, Reform UK's Zia Yusuf was gloating that a hard-left party led by Jeremy Corbyn meant the odds of Nigel Farage becoming PM had narrowed further.",
        "url": "https://news.sky.com/story/reform-uk-mp-james-mcmurdock-comes-out-fighting-as-rivals-gloat-13392899",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-james-mcmurdock-reform-uk_6958145.jpg?20250705191511",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-07-05 17:30:00",
        "Headline": "Mr McMurdock strongly insists his business dealings were always lawful, compliant and checked by relevant authorities. But that hasn't stopped rival parties from revelling in the \"chaos\", as the number of Reform MPs drops from five to four.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  On Thursday, Reform UK's Zia Yusuf was gloating that a hard-left party led by Jeremy Corbyn meant the odds of Nigel Farage becoming PM had narrowed further. But now that James McMurdock's self-suspension over \"business propriety\" allegations means Reform UK is down from five MPs to four - again - it's Reform's rivals who are gloating. \"Does Farage think he [McMurdock] is fit to be an MP?\" demanded Labour's chair, Ellie Reeves, while the Conservatives claimed: \"Reform are perpetually in chaos…\"   Despite garnering 14.3% of the votes in the general election a year ago, Mr Farage's party won just five seats. Then there were four, after Rupert Lowe was ousted in March. Then, after Sarah Pochin's triumph in the Runcorn and Helsby by-election in May, it was five again. And now it's four again. For now, at least. A defiant Mr McMurdock is fighting back and says he only removed the party whip from himself as a precaution and to protect Reform UK. \"All my business dealings [have] always been conducted fully within the law and in compliance with all regulations,\" he wrote on X on Saturday. The Sunday Times claims he took out £70,000 of loans during the pandemic under a government Bounce Back scheme through two companies he owned. Read more:Has Labour's first year been a success or failure?New party under Corbyn would threaten StarmerChancellor hints at tax rises in Autumn budget The paper claims one had no employees and neither filed accounts, a violation of the Companies Act, and he failed to declare one of the directorships in the MPs' register of interests. This is not the first controversy for Mr McMurdock, whose 39th birthday was last Saturday, since he became an MP a year ago. It has been a difficult 12 months for him. He was, in fact, never meant to become an MP. He was what's known in political jargon as a \"paper candidate\", picked at the last moment to fight a seat held by the Tories with a majority of nearly 20,000. But Basildon South and Thurrock East voted 73% for Brexit, one of the highest margins of the 2016 referendum, so perhaps a shock win for Reform UK shouldn't have come as a surprise. After a marathon recount, Mr McMurdock won by just 98 votes, with Labour second and the former Conservative MP Stephen Metcalfe, who'd held the seat since 2010, third. Before long it emerged that aged 19 he was imprisoned for a week for assaulting a former girlfriend. He's admitted it's the \"biggest regret of my life\". And Mr Farage has revealed: \"He wasn't vetted.\" The Reform UK leader has also claimed his party was \"stitched up\" by a firm it contracted to vet candidates. Now Mr McMurdock is claiming he's been stitched up - by The Sunday Times. He's also come out fighting against the allegations, insisting \"appropriately qualified professionals had reviewed all activity\" and confirmed compliance with the law. And he rebutted the paper's charge that he failed to declare a directorship in the MPs' register of interests. He says he completed his entry with the support of the parliamentary authorities. 👉 Click here to listen to Electoral Dysfunction on your podcast app👈 That hasn't stopped Labour demanding an inquiry by the parliamentary committee for standards. After all, we've seen Sir Keir Starmer at PMQs in recent weeks taking every opportunity to attack Reform UK. In Reform UK's defence against vetting lapses, it's claimed that an insurgent party is bound to attract mavericks. But amid the heady talk of a Reform UK government at the next election, Mr Farage has a cunning plan. He's now talking about following Gordon Brown's example and recruiting GOATS, a \"government of all the talents\". Mr Brown appointed former CBI boss Digby Jones and Lord West, the former First Sea Lord. For now, though, the latest James McMurdock row is more about gloats than GOATs."
    },
    {
        "title": "Police arrest 29 protesters on suspicion of terror offences after Palestine Action banned",
        "description": "Police have arrested 29 protesters on suspicion of terror offences after a ban on the Palestine Action group came into effect.",
        "url": "https://news.sky.com/story/police-arrest-protesters-supporting-palestine-action-after-group-designated-as-terrorist-organisation-13392763",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-palestine-action-protest_6957887.jpg?20250705143428",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-05 13:12:00",
        "Headline": "The protest group was officially classified as a terrorist organisation from midnight on Saturday after the measure received overwhelming support from MPs and following the failure of a last-minute legal challenge to delay it.",
        "Content": " Police have arrested 29 protesters on suspicion of terror offences after a ban on the Palestine Action group came into effect. The protest group was officially proscribed as a terrorist organisation from midnight on Saturday after a last-minute legal challenge at the Court of Appeal to delay it failed. The Metropolitan Police said on Saturday afternoon that the protesters had been held on suspicion of committing offences under the Terrorism Act 2000 following a protest in London's Parliament Square. \"The group is now proscribed and expressing support for them is a criminal offence,\" the force added. \"Arrests are being made.\" MPs overwhelmingly voted in favour of Home Secretary Yvette Cooper's decision to ban the protest group under the legislation on Wednesday and the House of Lords approved the move the following day. The law change adds Palestine Action to the list of banned organisations along with the likes of al Qaeda, ISIS and Hezbollah, and makes membership of, or support for, the direct action group a criminal offence punishable by up to 14 years in prison. Even wearing a T-shirt or badge with the group's name on attracts a maximum six-month sentence. On Saturday, a large number of Metropolitan Police officers circled around dozens of protesters carrying placards that said: \"I oppose genocide. I support Palestine Action.\" Israel has strongly denied any allegations of genocide. Campaign group Defend Our Juries said demonstrators were set to gather in Parliament Square on Saturday holding signs supporting Palestine Action. Officers who attended the protest were met with cries of \"Met Police you are puppets of the Zionist state\" and \"leave them alone\". Others were heard shouting, \"British police off our streets\", and \"from the river to the sea, Palestine will be free\". Chants of \"shame\" were directed at police. A woman seen lying on the floor in handcuffs was carried away by officers and put in a police van. She was heard saying: \"Free Palestine, stop the genocide, I oppose genocide, I support the rights of the Palestinian people, I support freedom of speech, I support freedom of assembly.\" A large group of people crowded around to film the scene. Officers placed her in a vehicle before returning to the square's Mahatma Gandhi statue. The protest started at about 1.10pm and officers were seen taking people away shortly after 1.30pm. Most of the officers dispersed at around 2.10pm. 'Creeping totalitarianism' Leslie Tate, 76, a Green councillor from Hertfordshire, said the group is not a violent organisation, and the proscription is wrong, adding the protest was \"necessary to defend our democracy, and this is the creeping edge of totalitarianism\". Among those removed by police was Reverend Sue Parfitt, who is 83. Ms Cooper announced plans to proscribe Palestine Action after two Voyager aircraft were allegedly damaged at RAF Brize Norton in Oxfordshire on 20 June, which police said caused around £7m worth of damage. T-shirt could bring six-month jail term Even wearing a T-shirt or badge with the group's name on attracts a maximum six-month sentence. On Friday, the High Court heard the decision to ban the group was taken before the aircraft were allegedly damaged and as early as March this year. Huda Ammori, the co-founder of Palestine Action, is seeking to bring a legal challenge against the Home Office with a hearing for permission to bring a judicial review set to take place during the week of 21 July. On Friday, her lawyers applied for \"interim relief\" to temporarily block the legislation from coming into force until that hearing, arguing the Irish author Sally Rooney, who wrote Normal People, was among supporters who fear the \"ramifications\". But three judges, including the Lady Chief Justice Baroness Carr, refused a bid to pause the ban coming into effect pending any Supreme Court bid at about 10.30pm on Friday, less than two hours before the ban was due to come into force. Read more on Sky News:Oasis reunion 'all about the music'Liverpool stars at Jota's funeralReform MP suspends himself In their judgment, the judges said: \"The role of the court is simply to interpret and apply the law. \"The merits of the underlying decision to proscribe a particular group is not a matter for the court... Similarly, it is not a matter for this court to express any views on whether or not the allegations or claims made by Palestine Action are right or wrong.\""
    },
    {
        "title": "Reform MP suspends himself from party over allegations around his business affairs",
        "description": "Reform MP James McMurdock has suspended himself from the party. ",
        "url": "https://news.sky.com/story/reform-mp-suspends-himself-from-party-over-allegations-around-his-business-affairs-13392746",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-james-mcmurdock-house-of-commons_6621769.jpg?20250104164728",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-05 12:20:00",
        "Headline": "Reform chief whip Lee Anderson said the suspension concerns allegations around James McMurdock's business affairs published in a national newspaper.",
        "Content": "Reform MP James McMurdock has suspended himself from the party.  In a statement, Reform chief whip Lee Anderson said it is over allegations around his business affairs published in a national newspaper. Mr McMurdock has denied any wrongdoing. The statement said: \"I have today received a call from James McMurdock who has advised me, as Chief Whip, that he has removed the party whip from himself pending the outcome of an investigation into allegations that are likely to be published by a national newspaper. \"The allegations relate to business propriety during the pandemic and before he became an MP. \"At Reform UK we take these matters very seriously and James has agreed to cooperate in full with any investigation. \"We will not be commenting further at this moment.\" A Sunday Times article claims that companies he owned received a total of £70,000 from the government's Covid Bounce Back loan scheme despite being effectively dormant. \n                  Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat\n                 \n                  Who will take the fall for welfare chaos?\n                 \n                  Reform would win most seats in general election, in-depth poll suggests\n                 One had no employees and negligible assets but borrowed £50,000, the paper reports. That meant it should have had a turnover of £200,000. Another was dormant until January 31, 2020. Over the following year, it borrowed £20,000, which would have required turnover of £100,000 under the Bounce Back scheme. Neither filed accounts or corporate filings after the loans, which the paper says is a violation of the Companies Act. In his own statement Mr McMurdock said he had told a journalist working on the story that \"all my business dealings had always been conducted fully within the law and in compliance with all regulations\". The MP wrote in a post on X that he had asked for the whip to be suspended as a \"precautionary measure\" and \"for the protection of Reform UK\". Mr McMurdock joined Reform UK in 2024 after having worked in the banking sector. In last year's general election, he was elected as the MP for South Basildon and East Thurrock. He beat Labour by a whisker, winning by 98 votes, taking the seat from the Conservatives. It marks the latest incident of a Reform MP having the party whip removed. Rupert Lowe was suspended in March over alleged threats of physical violence towards the party's then chairman Zia Yusuf. The allegations were then referred to the Metropolitan Police, who later said Mr Lowe would not be charged. The MP for Great Yarmouth has always denied wrongdoing and claimed he was the victim of a witch hunt after speaking out against party leader Nigel Farage in the media."
    },
    {
        "title": "Ozzy Osbourne reunites with Black Sabbath for 'final bow' in emotional metal goodbye",
        "description": "Ozzy Osbourne has reunited with Black Sabbath and performed his final gig - telling fans \"you've no idea how I feel - thank you from the bottom of my heart\", in an emotional but truly metal goodbye.",
        "url": "https://news.sky.com/story/ozzy-osbourne-reunites-with-black-sabbath-for-final-gig-in-emotional-metal-goodbye-13392999",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne_6958282.jpg?20250705235044",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-05 22:06:00",
        "Headline": "The Back To The Beginning concert was billed as the \"final bow\" for the man revered as a founder of heavy metal after several years of health problems, including Parkinson's disease.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Ozzy Osbourne has reunited with Black Sabbath and performed his final gig - telling fans \"you've no idea how I feel - thank you from the bottom of my heart\", in an emotional but truly metal goodbye. Announced earlier this year, Back To The Beginning at Villa Park stadium was billed as the \"final bow\" for the man revered as a founder of heavy metal after several years of health problems, including Parkinson's disease. Rising up on a black throne featuring jewelled skulls, the 76-year-old performed a solo set before being joined by his original bandmates - Terence \"Geezer\" Butler, Tony Iommi and Bill Ward - for Black Sabbath's first performance in 20 years. \"Let the madness begin,\" Osbourne cried as he appeared for the first time, telling about 40,000 fans: \"It's so good to be on this stage.\" With the crowd chanting his name, he performed both sets sitting down, but the voice and the crazed glint in his eyes were there almost throughout. Singing fan favourites including Mr Crowley and Crazy Train, and Iron Man and Paranoid with Black Sabbath, Osbourne conducted the crowd to sing \"louder, louder\", and \"go f****** crazy\". This was an orchestrated exit by heavy metal's biggest character, with a supporting line-up of hard rock luminaries - from Slayer and Halestorm to Metallica and Guns 'n' Roses, plus stars including Steven Tyler, Ronnie Wood, Yungblud, Travis Barker and Chad Smith, who showed up for \"supergroup\" performances. \n                  Who is Ozzy Osbourne? From Black Sabbath's Prince Of Darkness to relationship with Sharon and reality TV stardom\n                 \n                  Ozzy Osbourne to reunite with Black Sabbath for 'final bow' performance\n                 \n                  Ozzy Osbourne's former guitarist shot multiple times while walking his dog\n                 Many said they would not be the musicians they are without Osbourne and Black Sabbath. \"You know, there's not another guy as respected in metal as Ozzy Osbourne,\" former Van Halen singer Sammy Hagar told Sky News just ahead of his performance. \"And for him to be sick and to be saying, I'm out, I'm done. Man. There's no one else that can replace that.\" \"Without Sabbath, there would be no Metallica,\" said frontman James Hetfield during their performance. \"We're not here to say goodbye,\" said Anthrax's Scott Ian. \"We're just here to say thank you.\" Throughout the day, giant Ozzy and Black Sabbath beach balls, in the Aston Villa claret and blue, were bounced around a jubilant crowd. Tributes from other celebrity friends and fans, from Billy Idol and Ricky Gervais to Dolly Parton and Sir Elton John, were played on screen. Read more: From Black Sabbath's Prince of Darkness to reality TV star Hollywood actor Jason Momoa, who hosted the event, told the crowd heavy metal had been a \"safehaven\" for many growing up, and Black Sabbath's music had \"influenced and inspired musicians\" of all eras and genres. The farewell show was the idea of Osbourne's wife, Sharon - one final gig to finish his performing career on a high - after he was forced to cancel shows he had planned in 2023, telling fans he \"never imagined\" his touring days would end that way. Sharon Osbourne told Sky News earlier this year that his one regret was not being able to say a thank you to his fans, and so the idea for the reunion gig was born. Profits from the show will be shared between Cure Parkinson's, Birmingham Children's Hospital, and Acorn's Children's Hospice. The gig came after the Black Sabbath band members were awarded the freedom of Birmingham earlier in June, recognised for their significance to the cultural and musical identity of the city they grew up in. The group formed in 1968 and went on to become one of the most successful metal bands of all time, selling more than 75 million albums worldwide over the years. They were inducted into the Rock & Roll Hall of Fame in 2006 - Osbourne again later as a solo artist last year - and awarded a lifetime Ivor Novello songwriting award in 2015. In 2019, they were presented with a Grammy lifetime achievement prize. Now, their first performance in 20 years will also be their last - one for the metal history books. The show ended with fireworks and a roar from the crowd, who had chanted Ozzy's name throughout. For fans, Back To The Beginning capped it all - the ultimate rock and metal line-up, and one last opportunity to show their love for the Prince of Darkness. \"I feel lucky to be able to attend this,\" said Calum Kennedy, 19, from Dunfermline. \"It's the biggest metal show known to man, [the biggest line-up] ever. I've never seen anything better.\" Read more from Sky News:Oasis reunion: Ultimately, it was all about the musicBBC to stop showing 'high risk' performances live Ben Sutton, 24, from Chester, added: \"I feel like it's important - we're of the younger generation - for us to see some of the heritage and history of the genre we love, metal in general. It's such an honour to say goodbye to him.\" Steve Townson, from Lincolnshire, said: \"I saw him the first time round and the fact that he's still going is incredible, isn't it? I was there at the start, I'm happy to be here at the end.\""
    },
    {
        "title": "Women's Euros: France v England",
        "description": null,
        "url": "https://news.sky.com/story/womens-euros-wales-v-netherlands-13392909",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ella-toone-football_6958234.jpg?20250705221040",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-05 17:53:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Murder investigation launched after 85-year-old man found dead in London",
        "description": "Police have launched a murder investigation after an 85-year-old man was found dead at a property in London.",
        "url": "https://news.sky.com/story/murder-investigation-launched-after-85-year-old-man-found-dead-in-london-13392702",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-churchmore-road-streatham_6957767.jpg?20250705121906",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-07-05 10:41:00",
        "Headline": "A 36-year-old man has been arrested on suspicion of murder and remains in custody after the incident.",
        "Content": "Police have launched a murder investigation after an 85-year-old man was found dead at a property in London. Officers were called at around 1pm on Friday to an address in Churchmore Road, in Streatham, south London, following reports a male had sustained a number of injuries. Emergency services personnel tried to save his life but the man was pronounced dead at the scene. He is yet to be formally identified. A 36-year-old man has been arrested on suspicion of murder and remains in custody. A post-mortem examination is due to take place soon. The officer leading the inquiry, Detective Chief Inspector Sarah Lee, said anyone with information is asked to get in touch. \n                  How Prevent is tackling young extremism 20 years after the 7/7 bombings\n                 \n                  Diogo Jota: Liverpool players join mourners as Premier League star and his brother Andre Silva buried in Portugal\n                 \n                  Diogo Jota and Andre Silva's funeral in pictures\n                 She said: \"We are working hard to piece together the events that unfolded in Churchmore Road yesterday, and offer our heartfelt condolences to the family of the victim and those affected by this tragic incident. \"I would like to thank... those that are speaking to police and supporting the investigation already. We will continue to have an increased presence in the area whilst we continue our enquiries. \"We are not currently looking for any other suspects.\""
    },
    {
        "title": "'Nobody likes Trump': Sky News finds defiance on the streets of Tehran",
        "description": "To&#160;the sound of mournful chants and the slow beat of drums, they march, whipping their backs with metal flails.",
        "url": "https://news.sky.com/story/nobody-likes-trump-sky-news-finds-defiance-on-the-streets-of-tehran-13392867",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ashura-iran_6958088.jpg?20250705175551",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-07-05 16:02:00",
        "Headline": "Iran believed it was making diplomatic progress in talks with America, which it hoped could lead to a deal. Then Israel launched its attacks and, instead of condemning them, the US joined in. Iranian officials are outwardly defiant, but privately pursuing fresh negotiations.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  To the sound of mournful chants and the slow beat of drums, they march, whipping their backs with metal flails. It is an ancient ceremony going back almost 14 centuries - the Shia commemoration of Ashura. But this year in particular has poignant significance for Iranians. The devout remember the betrayal and death of the Imam Hussein as if it happened yesterday.  We filmed men and women weep as they worshipped at the Imamzadeh Saleh Shrine in northern Tehran. The grandson of the Prophet Muhammad was killed by the armies of the Caliph Yazid in the seventh century Battle of Karbala. \n                  Inside Iran's Evin Prison - as Tehran says damage shows Israel targeted civilians\n                 \n                  What's it actually like in Iran right now?\n                 \n                  Iran: Still a chance for peace talks with US\n                 Shia Muslims mark the anniversary every year and reflect on the virtue it celebrates - of resistance against oppression and injustice. But more so than ever this year, in the wake of Israel and America's attacks on their country. The story is one of prevailing over adversity and deception. A sense of betrayal is keenly felt here by people and officials. Many Iranians believe they were lured into pursuing diplomacy as part of a ruse by the US. Iran believed it was making diplomatic progress in talks with America, which it hoped could lead to a deal. Then Israel launched its attacks and, instead of condemning them, the US joined in. \"Death to Israel\" chants resounded outside the mosque in skies that for 12 days were filled with the sounds of Israeli jets. There is a renewed sense of defiance here. One man told us: \"The lesson to be learned from Hussein is not to give in to oppression, even if it is the most powerful force in the world.\" A woman was dismissive about the US president. \"I don't think about Trump. Nobody likes him. He always wants to attack too many countries.\" Pictures on billboards nearby link Imam Hussein's story and current events. They show the seventh century imam on horseback alongside images of modern missiles and drones from the present day. Other huge signs remember the dead. Iran says almost 1,000 people were killed in the strikes, many of them women and children. Officially Iran is projecting defiance, but not closing the door to diplomacy. Government spokeswoman Dr Fatemeh Mohajerani told Sky News that Israel should not even think about attacking again. \"We are very strong in defence, and as state officials have announced, this time Israel will receive an even stronger response compared to previous times. We hope that Israel will not make such a mistake.\" But there is also a hint of conciliation. Senior Iranian officials have told Sky News back-channel efforts are under way to explore new talks with the US. Israel had hoped its attacks could topple the Iranian leadership. Those hopes proved unfounded. The government is in control here. For many Iranians it seems quite the opposite happened - the 12-day war has brought them closer together."
    },
    {
        "title": "Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says",
        "description": "Two American security workers in Gaza were injured after grenades were thrown during food distribution in Khan Younis, the Gaza Humanitarian Foundation (GHF) has said.",
        "url": "https://news.sky.com/story/two-security-workers-injured-after-grenades-thrown-at-aid-site-gaza-humanitarian-foundation-says-13392739",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-gaza-aid_6957521.jpg?20250705014807",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-05 12:11:00",
        "Headline": "The US and Israeli-backed aid group said a targeted terrorist attack was carried out at one of its sites in Khan Younis on Saturday morning.",
        "Content": "Two American security workers in Gaza were injured after grenades were thrown during food distribution in Khan Younis, the Gaza Humanitarian Foundation (GHF) has said. In a statement, the US and Israeli-backed aid group said a targeted terrorist attack was carried out at one of its sites in southern Gaza on Saturday morning. The two Americans injured \"are receiving medical treatment and are in stable condition,\" it said, adding that the delivery of aid was \"otherwise successful\" and that \"no local aid workers or civilians were harmed\". GHF didn't say exactly when the incident happened but claimed Hamas was behind the attack, adding: \"GHF has repeatedly warned of credible threats from Hamas, including explicit plans to target American personnel, Palestinian aid workers, and the civilians who rely on our sites for food. \"Today's attack tragically affirms those warnings.\" Later, the aid group posted a picture on social media, which it said showed \"fragments of a grenade packed with ball bearings\" that was used in the attack. Asked by Sky's US partner network, NBC News, whether the two injured individuals were responsible for handing out aid or were responsible for providing security, GHF said they were \"American security workers\" and \"two American veterans.\" \n                  Gaza: The man in the room acting as backchannel for Hamas in negotiations with US\n                 \n                  94 killed in Israeli strikes in Gaza, health authorities say – as UN expert calls situation ‘apocalyptic’\n                 \n                  Gaza ceasefire proposal a significant moment - but there are still many unanswered questions\n                 The aid group did not provide specific evidence that Hamas was behind the attack. The US and Israeli-backed group has been primarily responsible for aid distribution since Israel lifted its 11-week blockade of the Gaza Strip in May. Read more:Hamas gives 'positive' response to ceasefire proposalOutcry as Israeli strike hits school94 killed in Israeli strikes in Gaza, health staff say It comes after Sky News analysis showed GHF aid distributions are associated with a significant increase in deaths in Gaza. According to Gaza's health ministry, 600 Palestinians have been killed while seeking aid from GHF sites as of 3 July, which charities and the UN have branded \"death traps\". Meanwhile, the Associated Press has reported that Israeli-backed American contractors guarding GHF aid centres in Gaza are using live ammunition and stun grenades.  GHF has vehemently denied the accusations, adding that it investigated AP's allegations and found them to be \"categorically false\". Israel's military added that it fires only warning shots and is investigating reports of civilian harm. It denies deliberately shooting at any innocent civilians and says it's examining how to reduce \"friction with the population\" in the areas surrounding the distribution centres."
    },
    {
        "title": "Diogo Jota and Andre Silva's funeral in pictures",
        "description": "The family and friends of Diogo Jota and his brother Andre Silva have been joined by Liverpool stars past and present and other Portuguese players at the pair's funeral near Porto.",
        "url": "https://news.sky.com/story/diogo-jota-and-andre-silva-funeral-in-pictures-13392703",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diogo-jota-andre-silva_6957675.jpg?20250705110013",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-05 10:44:00",
        "Headline": "The funeral was held at the Igreja Matriz de Gondomar church in the town of Gondomar near Porto with images showing players and managers arriving for the ceremony.",
        "Content": " The family and friends of Diogo Jota and his brother Andre Silva have been joined by Liverpool stars past and present and other Portuguese players at the pair's funeral near Porto. The Liverpool forward, 28, and his brother died in a car crash in Spain on Thursday. Pictures below show the funeral at the Igreja Matriz de Gondomar church in the town of Gondomar near Porto. Click here for our liveblog coverage of the day's events.  "
    },
    {
        "title": "Remembered by how they lived - and not how they died: Diogo Jota and his brother laid to rest",
        "description": "This was Gondomar's saddest day.",
        "url": "https://news.sky.com/story/porto-suburbs-saddest-day-as-diogo-jota-and-his-brother-andre-silva-are-laid-to-rest-13392947",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-diogo-jota-funeral_6957682.jpg?20250705110459",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-07-05 19:21:00",
        "Headline": "In the saddest of circumstances, Gondomar's football fans now know the world appreciated Jota's talents as much as they did.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  This was Gondomar's saddest day. The Igreja Matriz de Gondomar church was overflowing. Mourners spilled out of the doors into the fierce morning heat. And residents lined the streets nearby in the baking sunshine. This eastern suburb of Porto was the focus of world football in a way never imagined, nor desired.  There was no raucous chanting. No attempts to chase selfies with mourners from the football world. Just sombre applause, as residents listened to an audio relay of the service, offered in solidarity with a family grieving. Two days after dying together in a car crash in northern Spain, brothers Diogo Jota, a Liverpool striker, and fellow footballer Andre Silva were buried together. It is a heartache no parent is prepared for. Isabel and Joaquim Silva attending a joint funeral for both sons. A wife burying her husband of 11 days. Addressing Rute Cardoso and the three children she had with Diogo, the Bishop of Porto, Manuel Linda, said: \"If it is hard to see an adult cry, it is much harder to see a child cry.\" The family was left in no doubt how beloved the brothers were in their community, country and the sport they loved. From Wolves - Jota's first club in England - a message was brought on a wreath carried by João Moutinho, a teammate there and also with Portugal. \"Your desire to fight and win lit up Molineux,\" it read, referring to the Wolverhampton Stadium. Flowers in the shape of a football pitch were brought by Liverpool, featuring the brothers' shirt numbers. A number 20 for Liverpool's scorer of 65 goals was carried by captain Virgil van Dijk. Andy Robertson brought another featuring a number 30 - honouring Silva as the player in Portugal's second division with Penafiel. Read more:Diogo Jota and Andre Silva's funeral in picturesLiverpool stars to attend funeral for Diogo Jota and his brother Both started their footballing journeys at Gondomar's small local team. \"May their memory and love remain forever in our hearts,\" read a message brought by Liverpool. The last time they were together as a squad in May was to parade the Premier League trophy with Jota through Liverpool. Now they have broken off from summer holidays to mourn the man whose goals brought so much glory, who will never return to the team. And in Gondomar you could find the proudest fans. Fabio Silva came in a treasured shirt signed by Jota in which he scored one of 65 goals for the Reds on Boxing Day 2023. \"We in Portugal,\" the 36-year-old said, \"didn't know how famous or how special Diogo was around the world\". In the saddest of circumstances, now they know the world appreciated Jota's talents as much as they did. \"Since Thursday, it has been some difficult days,\" Fabio Silva added. \"And for the family it will be very long weeks and months.\" Diogo Jota was only 28. Andre Silva, who went by the family's surname, three years younger. After enduring such trauma, so publicly, the family will surely look to grieve in private. The hope will be that both are remembered by how they lived, and not how they died - as humble footballers and family men who inspired beyond their hometown."
    },
    {
        "title": "Women's Euros: France v England",
        "description": null,
        "url": "https://news.sky.com/story/womens-euros-wales-v-netherlands-13392909",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ella-toone-football_6958234.jpg?20250705221040",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-05 17:53:00",
        "Headline": "No subtitle found",
        "Content": ""
    },
    {
        "title": "Diogo Jota: Liverpool players join mourners as Premier League star and his brother Andre Silva buried in Portugal",
        "description": "Liverpool players past and present have joined the family and friends of Diogo Jota and his brother Andre Silva for their funeral in Portugal.",
        "url": "https://news.sky.com/story/diogo-jota-liverpool-players-join-mourners-as-premier-league-star-and-his-brother-andre-silva-buried-in-portugal-13392726",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-liverpool-joe-gomez-and-arne-slot_6957664.jpg?20250705104036",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-07-05 11:35:00",
        "Headline": "A funeral service was held for the brothers, who died in a car crash on Thursday, at the Igreja Matriz de Gondomar church in their hometown of Gondomar near Porto in northern Portugal on Saturday morning.",
        "Content": " Liverpool players past and present have joined the family and friends of Diogo Jota and his brother Andre Silva for their funeral in Portugal. A service was held in the Igreja Matriz de Gondomar church in their hometown of Gondomar near Porto in northern Portugal on Saturday morning. Mourners lined the streets and some in the crowd clapped as the brothers' coffins were carried into the church. The funeral - in pictures Jota, 28, leaves behind his wife of only 11 days, Rute Cardoso, and three young children. His younger brother, 25, was an attacking midfielder for Penafiel in the second tier of Portuguese football. Liverpool manager Arne Slot, captain Virgil Van Dijk and teammates including Andy Robertson, Conor Bradley, Ryan Gravenberch, Cody Gakpo, Curtis Jones, Darwin Nunez and Joe Gomez were seen at the service. \n                  'Nobody likes Trump': Sky News finds defiance on the streets of Tehran\n                 \n                  Two security workers injured after grenades thrown at aid site, Gaza Humanitarian Foundation says\n                 \n                  Hamas gives 'positive' response to ceasefire proposal but asks for amendments\n                 Former teammates Jordan Henderson, James Milner and Fabinho were also there. Van Dijk carried a red wreath with Jota's number 20, while Robertson had a wreath featuring number 30, Silva's number at Penafiel. Some of Jota's teammates in the Portuguese national side also attended, including Bruno Fernandes, of Manchester United, Ruben Dias and Bernardo Silva, of Manchester City, Joao Felix and Renato Veiga, of Chelsea, Nelson Semedo, from Wolves, Joao Moutinho and Rui Patricio. Ruben Neves was one of the pallbearers after flying in from Florida where he played for Al Hilal in the Club World Cup quarter-final on Friday night. 'More than a friend' In a post published on Instagram before the service, he told Jota he had been \"more than a friend, we're family, and we won't stop being that way just because you've decided to sign a contract a little further away from us!\" Jota's fellow Liverpool midfielder, Alexis Mac Allister, said on Instagram: \"I can't believe it. I'll always remember your smiles, your anger, your intelligence, your camaraderie, and everything that made you a person. It hurts so much; we'll miss you. Rest in peace, dear Diogo.\" Porto FC president Andre Villas-Boas and Portugal national team manager Roberto Martinez were also in attendance. 'With us forever' Speaking after the ceremony, Martinez said the period since their deaths had been \"really, really sad days, as you can imagine, but today we showed we are a large, close family. \"Their spirit will be with us forever.\" The service was private, but the words spoken by the Bishop of Porto, Manuel Linda, were broadcast to those standing outside the church. He told Jota's children, who were not at the service, that he was praying for them specifically, as well as their mother and grandparents. \"There are no words, but there are feelings,\" he said, adding: \"We also suffer a lot and we are with you emotionally.\" The brothers died after a Lamborghini they were travelling in burst into flames following a suspected tyre blowout in the early hours of Thursday morning. Read more on Sky News:Oasis reunion 'all about the music'24 dead in Texas floodsReform MP suspends himself No other vehicles are said to have been involved in the incident. Liverpool have delayed the return of their players for pre-season following Jota's death and players past and present paid tribute to him and his brother on social media. Flowers have been left outside Anfield, where flags have been lowered to half-mast and all club shops, museums and tours have been closed until Monday."
    },
    {
        "title": "Elon Musk says he's created his own political party - the 'America Party'",
        "description": "Elon Musk says he has created a new political party - the America Party - \nafter asking his followers if he should do so in an online poll.",
        "url": "https://news.sky.com/story/elon-musk-says-hes-created-his-own-political-party-the-america-party-13392958",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-elon-musk-white-house_6958224.jpg?20250705213724",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-07-05 19:57:00",
        "Headline": "A day after Donald Trump signed into law his sweeping tax cut and spending bill, which Musk had repeatedly attacked, the billionaire Tesla boss says he is forming the 'America Party'.",
        "Content": "Elon Musk says he has created a new political party - the America Party - \nafter asking his followers if he should do so in an online poll. It follows his public falling out with Republican President Donald Trump. On Friday, the tech billionaire had asked his followers on X whether a new US political party should be created. On Saturday evening he wrote on the same platform: \"By a factor of 2 to 1, you want a new political party and you shall have it! \"When it comes to bankrupting our country with waste & graft, we live in a one-party system, not a democracy. \"Today, the America Party is formed to give you back your freedom.\"  The world's richest man made the announcement just one day after President Trump signed a tax-cut and spending bill into law on Friday, which Musk had fiercely opposed. \n                  More bad news for Elon Musk as Tesla deliveries miss target again\n                 \n                  Donald Trump's 'big, beautiful bill' has sparked ugly debate - so why is it so controversial?\n                 \n                  Videos show driverless Tesla 'robotaxis' braking hard without warning - and on wrong side of the road \n                 Musk had previously said he would form and fund a new political party to unseat lawmakers who supported the bill. From bromance to bust-up The Tesla boss backed Mr Trump's election campaign with more than a quarter of a billion dollars, later rewarded with a high-profile role running the newly created department of government efficiency (DOGE). But observers of the two men, both with huge wealth and reputations, wondered how long the bromance would last. In May, Musk left the role, still on good terms with the president but criticising key parts of his legislative agenda. After that the attacks spiralled, with Musk slamming the sweeping tax and spending bill as a \"disgusting abomination\" and Mr Trump hitting back in a barbed tit-for-tat. President Trump earlier this week threatened to cut off the billion-dollar federal subsidies that flow to Musk's companies, and said he would even consider deporting him."
    },
    {
        "title": "Octopus Energy sparks £10bn demerger of tech arm Kraken",
        "description": "Octopus Energy Group, Britain's largest residential gas and electricity supplier, is plotting a &#163;10bn demerger of its technology arm that would reinforce its status as one of the country's most valuable private companies.",
        "url": "https://news.sky.com/story/octopus-energy-sparks-16310bn-demerger-of-tech-arm-kraken-13392627",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-octopus-energy-istock_6957559.jpg?20250705073237",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-05 06:25:00",
        "Headline": "The UK's biggest household energy supplier is close to hiring bankers to oversee a £10bn separation and stake sale for Kraken Technologies, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Octopus Energy Group, Britain's largest residential gas and electricity supplier, is plotting a £10bn demerger of its technology arm that would reinforce its status as one of the country's most valuable private companies. Sky News can exclusively reveal that Octopus Energy is close to hiring investment bankers to help formally separate Kraken Technologies from the rest of the group. The demerger, which would be expected to take place in the next 12 months, would see Octopus Energy's existing investors given shares in the newly independent Kraken business. A minority stake in Kraken of up to 20% is expected to be sold to external shareholders in order to help validate the technology platform's valuation, according to insiders. One banking source said that Kraken could be valued at as much as $14bn (£10.25bn) in a forthcoming demerger. Citi, Goldman Sachs, JP Morgan and Morgan Stanley are among the investment banks invited to pitch for the demerger mandate in recent weeks. A deal will augment Octopus Energy chief executive Greg Jackson's paper fortune, and underline his success at building a globally significant British-based company over the last decade. \n                  Energy future: Paying up front should lead to tangible savings ahead\n                 \n                  Energy bills: Network charges set to rise as price cap eases\n                 \n                  Spanish-owned Scottish Power sparks merger talks with Ovo Energy\n                 Octopus Energy now has 7.5 million retail customers in Britain, following its 2022 rescue of the collapsed energy supplier Bulb, and the subsequent acquisition of Shell's home energy business. In January, it announced that it had become the country's biggest supplier - surpassing Centrica-owned British Gas - with a 24% market share. It also has a further 2.5 million customers outside the UK. Sources said a £10bn valuation of Kraken would now imply that the whole group, including the retail supply business, was worth in the region of £15bn or more. That would be double its valuation of just over a year ago, when the company announced that it had secured new backing from funds Galvanize Climate Solutions and Lightrock. Shortly before that, former US vice president Al Gore's firm, Generation Investment Management, and the Canada Pension Plan Investment Board increased their stakes in Octopus Energy in a transaction valuing the company at $9bn (£7.2bn). Kraken is an operating system which is licensed to other energy providers, water companies and telecoms suppliers. It connects all parts of the energy system, including customer billing and the flexible management of renewable generation and energy devices such as heat pumps and electric vehicle batteries. The business also unlocks smart grids which enable people to use more renewable energy when there is an abundant supply of it. In the UK, its platform is licensed to Octopus Energy's rivals EON and EDF Energy, as well as the water company Severn Trent and broadband provider Cuckoo. Overseas, Kraken serves Origin Energy in Australia, Japan's Tokyo Gas and Plentitude in countries including France and Greece. Its biggest coup came recently, when it struck a deal with National Grid in the US to serve 6.5m customers in New York and Massachusetts. Sources said other major licensing agreements in the US were expected to be struck in the coming months. Kraken, which is chaired by Gavin Patterson, the former BT Group chief executive, is now contracted to more than 70 million customer accounts globally - putting it easily on track to hit a target of 100 million by 2027. Earlier this year, Mr Jackson said that target now risked being seen as \"embarrassingly unambitious\". Last July, Kraken recruited Amir Orad, a former boss of NICE Actimize, a US-listed provider of enterprise software to global banks and Fortune 500 companies, as its first chief executive. A demerger of Kraken will trigger speculation about an eventual public market listing of the business. Its growth in the US, and the relative public market valuations of technology companies in New York and London, may put the UK at a disadvantage when Kraken eventually considers where to list. One key advantage of demerging Kraken from the rest of Octopus Energy Group would be to remove the perception of a conflict of interest among potential customers of the technology platform. A source said the unified corporate ownership of both businesses had acted as a deterrent to some energy suppliers. Kraken has also diversified beyond the energy sector, and earlier this year joined a consortium which was exploring a takeover bid for stricken Thames Water. This weekend, Octopus Energy declined to comment."
    },
    {
        "title": "Reform MP suspends himself from party over allegations around his business affairs",
        "description": "Reform MP James McMurdock has suspended himself from the party. ",
        "url": "https://news.sky.com/story/reform-mp-suspends-himself-from-party-over-allegations-around-his-business-affairs-13392746",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-james-mcmurdock-house-of-commons_6621769.jpg?20250104164728",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-05 12:20:00",
        "Headline": "Reform chief whip Lee Anderson said the suspension concerns allegations around James McMurdock's business affairs published in a national newspaper.",
        "Content": "Reform MP James McMurdock has suspended himself from the party.  In a statement, Reform chief whip Lee Anderson said it is over allegations around his business affairs published in a national newspaper. Mr McMurdock has denied any wrongdoing. The statement said: \"I have today received a call from James McMurdock who has advised me, as Chief Whip, that he has removed the party whip from himself pending the outcome of an investigation into allegations that are likely to be published by a national newspaper. \"The allegations relate to business propriety during the pandemic and before he became an MP. \"At Reform UK we take these matters very seriously and James has agreed to cooperate in full with any investigation. \"We will not be commenting further at this moment.\" A Sunday Times article claims that companies he owned received a total of £70,000 from the government's Covid Bounce Back loan scheme despite being effectively dormant. \n                  Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat\n                 \n                  Who will take the fall for welfare chaos?\n                 \n                  Reform would win most seats in general election, in-depth poll suggests\n                 One had no employees and negligible assets but borrowed £50,000, the paper reports. That meant it should have had a turnover of £200,000. Another was dormant until January 31, 2020. Over the following year, it borrowed £20,000, which would have required turnover of £100,000 under the Bounce Back scheme. Neither filed accounts or corporate filings after the loans, which the paper says is a violation of the Companies Act. In his own statement Mr McMurdock said he had told a journalist working on the story that \"all my business dealings had always been conducted fully within the law and in compliance with all regulations\". The MP wrote in a post on X that he had asked for the whip to be suspended as a \"precautionary measure\" and \"for the protection of Reform UK\". Mr McMurdock joined Reform UK in 2024 after having worked in the banking sector. In last year's general election, he was elected as the MP for South Basildon and East Thurrock. He beat Labour by a whisker, winning by 98 votes, taking the seat from the Conservatives. It marks the latest incident of a Reform MP having the party whip removed. Rupert Lowe was suspended in March over alleged threats of physical violence towards the party's then chairman Zia Yusuf. The allegations were then referred to the Metropolitan Police, who later said Mr Lowe would not be charged. The MP for Great Yarmouth has always denied wrongdoing and claimed he was the victim of a witch hunt after speaking out against party leader Nigel Farage in the media."
    },
    {
        "title": "Reform UK MP James McMurdock comes out fighting after self-suspension - as rivals gloat",
        "description": "On Thursday, Reform UK's Zia Yusuf was gloating that a hard-left party led by Jeremy Corbyn meant the odds of Nigel Farage becoming PM had narrowed further.",
        "url": "https://news.sky.com/story/reform-uk-mp-james-mcmurdock-comes-out-fighting-as-rivals-gloat-13392899",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-james-mcmurdock-reform-uk_6958145.jpg?20250705191511",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-07-05 17:30:00",
        "Headline": "Mr McMurdock strongly insists his business dealings were always lawful, compliant and checked by relevant authorities. But that hasn't stopped rival parties from revelling in the \"chaos\", as the number of Reform MPs drops from five to four.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  On Thursday, Reform UK's Zia Yusuf was gloating that a hard-left party led by Jeremy Corbyn meant the odds of Nigel Farage becoming PM had narrowed further. But now that James McMurdock's self-suspension over \"business propriety\" allegations means Reform UK is down from five MPs to four - again - it's Reform's rivals who are gloating. \"Does Farage think he [McMurdock] is fit to be an MP?\" demanded Labour's chair, Ellie Reeves, while the Conservatives claimed: \"Reform are perpetually in chaos…\"   Despite garnering 14.3% of the votes in the general election a year ago, Mr Farage's party won just five seats. Then there were four, after Rupert Lowe was ousted in March. Then, after Sarah Pochin's triumph in the Runcorn and Helsby by-election in May, it was five again. And now it's four again. For now, at least. A defiant Mr McMurdock is fighting back and says he only removed the party whip from himself as a precaution and to protect Reform UK. \"All my business dealings [have] always been conducted fully within the law and in compliance with all regulations,\" he wrote on X on Saturday. The Sunday Times claims he took out £70,000 of loans during the pandemic under a government Bounce Back scheme through two companies he owned. Read more:Has Labour's first year been a success or failure?New party under Corbyn would threaten StarmerChancellor hints at tax rises in Autumn budget The paper claims one had no employees and neither filed accounts, a violation of the Companies Act, and he failed to declare one of the directorships in the MPs' register of interests. This is not the first controversy for Mr McMurdock, whose 39th birthday was last Saturday, since he became an MP a year ago. It has been a difficult 12 months for him. He was, in fact, never meant to become an MP. He was what's known in political jargon as a \"paper candidate\", picked at the last moment to fight a seat held by the Tories with a majority of nearly 20,000. But Basildon South and Thurrock East voted 73% for Brexit, one of the highest margins of the 2016 referendum, so perhaps a shock win for Reform UK shouldn't have come as a surprise. After a marathon recount, Mr McMurdock won by just 98 votes, with Labour second and the former Conservative MP Stephen Metcalfe, who'd held the seat since 2010, third. Before long it emerged that aged 19 he was imprisoned for a week for assaulting a former girlfriend. He's admitted it's the \"biggest regret of my life\". And Mr Farage has revealed: \"He wasn't vetted.\" The Reform UK leader has also claimed his party was \"stitched up\" by a firm it contracted to vet candidates. Now Mr McMurdock is claiming he's been stitched up - by The Sunday Times. He's also come out fighting against the allegations, insisting \"appropriately qualified professionals had reviewed all activity\" and confirmed compliance with the law. And he rebutted the paper's charge that he failed to declare a directorship in the MPs' register of interests. He says he completed his entry with the support of the parliamentary authorities. 👉 Click here to listen to Electoral Dysfunction on your podcast app👈 That hasn't stopped Labour demanding an inquiry by the parliamentary committee for standards. After all, we've seen Sir Keir Starmer at PMQs in recent weeks taking every opportunity to attack Reform UK. In Reform UK's defence against vetting lapses, it's claimed that an insurgent party is bound to attract mavericks. But amid the heady talk of a Reform UK government at the next election, Mr Farage has a cunning plan. He's now talking about following Gordon Brown's example and recruiting GOATS, a \"government of all the talents\". Mr Brown appointed former CBI boss Digby Jones and Lord West, the former First Sea Lord. For now, though, the latest James McMurdock row is more about gloats than GOATs."
    },
    {
        "title": "Rachel Reeves hints at tax rises in autumn budget after welfare bill U-turn",
        "description": "Rachel Reeves has hinted that taxes are likely to be raised this autumn after a major U-turn on the government's controversial welfare bill.",
        "url": "https://news.sky.com/story/rachel-reeves-hints-at-tax-rises-in-autumn-budget-after-welfare-bill-u-turn-13392652",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-sir-keir-starmer_6957623.jpg?20250705095908",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-07-05 07:38:00",
        "Headline": "Initially aimed at saving £5.5bn, the watered-down welfare bill now leaves the government with an estimated £5.5bn black hole - close to breaching the chancellor's fiscal rules set out last year.",
        "Content": "Rachel Reeves has hinted that taxes are likely to be raised this autumn after a major U-turn on the government's controversial welfare bill. Sir Keir Starmer's Universal Credit and Personal Independent Payment Bill passed through the House of Commons on Tuesday after multiple concessions and threats of a major rebellion. MPs ended up voting for only one part of the plan: a cut to universal credit (UC) sickness benefits for new claimants from £97 a week to £50 from 2026/7. Initially aimed at saving £5.5bn, it now leaves the government with an estimated £5.5bn black hole - close to breaching Ms Reeves's fiscal rules set out last year. Read more:Yet another fiscal 'black hole'? Here's why this one mattersSuccess or failure: One year of Keir in nine charts  In an interview with The Guardian, the chancellor did not rule out tax rises later in the year, saying there were \"costs\" to watering down the welfare bill. \"I'm not going to [rule out tax rises], because it would be irresponsible for a chancellor to do that,\" Ms Reeves told the outlet. \n                  Did Keir Starmer screw up his own anniversary?\n                 \n                  Sir Keir Starmer unveils 10-year plan for the NHS and declares: 'The future already looks better'\n                 \n                  Chancellor Rachel Reeves says she is 'totally' up for the job of chancellor in first comments since tearful PMQs\n                 \"We took the decisions last year to draw a line under unfunded commitments and economic mismanagement. \"So we'll never have to do something like that again. But there are costs to what happened.\" Meanwhile, The Times reported that, ahead of the Commons vote on the welfare bill, Ms Reeves told cabinet ministers the decision to offer concessions would mean taxes would have to be raised. The outlet reported that the chancellor said the tax rises would be smaller than those announced in the 2024 budget, but that she is expected to have to raise tens of billions more. It comes after Ms Reeves said she was \"totally\" up to continuing as chancellor after appearing tearful at Prime Minister's Questions.  Criticising Sir Keir for the U-turns on benefit reform during PMQs, Conservative leader Kemi Badenoch said the chancellor looked \"absolutely miserable\", and questioned whether she would remain in post until the next election. Sir Keir did not explicitly say that she would, and Ms Badenoch interjected to say: \"How awful for the chancellor that he couldn't confirm that she would stay in place.\" In her first comments after the incident, Ms Reeves said she was having a \"tough day\" before adding: \"People saw I was upset, but that was yesterday. \"Today's a new day and I'm just cracking on with the job.\"  Sir Keir also told Sky News' political editor Beth Rigby on Thursday that he \"didn't appreciate\" that Ms Reeves was crying in the Commons. \"In PMQs, it is bang, bang, bang,\" he said. \"That's what it was yesterday. \"And therefore, I was probably the last to appreciate anything else going on in the chamber, and that's just a straightforward human explanation, common sense explanation.\""
    },
    {
        "title": "Octopus Energy sparks £10bn demerger of tech arm Kraken",
        "description": "Octopus Energy Group, Britain's largest residential gas and electricity supplier, is plotting a &#163;10bn demerger of its technology arm that would reinforce its status as one of the country's most valuable private companies.",
        "url": "https://news.sky.com/story/octopus-energy-sparks-16310bn-demerger-of-tech-arm-kraken-13392627",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-octopus-energy-istock_6957559.jpg?20250705073237",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-07-05 06:25:00",
        "Headline": "The UK's biggest household energy supplier is close to hiring bankers to oversee a £10bn separation and stake sale for Kraken Technologies, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Octopus Energy Group, Britain's largest residential gas and electricity supplier, is plotting a £10bn demerger of its technology arm that would reinforce its status as one of the country's most valuable private companies. Sky News can exclusively reveal that Octopus Energy is close to hiring investment bankers to help formally separate Kraken Technologies from the rest of the group. The demerger, which would be expected to take place in the next 12 months, would see Octopus Energy's existing investors given shares in the newly independent Kraken business. A minority stake in Kraken of up to 20% is expected to be sold to external shareholders in order to help validate the technology platform's valuation, according to insiders. One banking source said that Kraken could be valued at as much as $14bn (£10.25bn) in a forthcoming demerger. Citi, Goldman Sachs, JP Morgan and Morgan Stanley are among the investment banks invited to pitch for the demerger mandate in recent weeks. A deal will augment Octopus Energy chief executive Greg Jackson's paper fortune, and underline his success at building a globally significant British-based company over the last decade. \n                  Energy future: Paying up front should lead to tangible savings ahead\n                 \n                  Energy bills: Network charges set to rise as price cap eases\n                 \n                  Spanish-owned Scottish Power sparks merger talks with Ovo Energy\n                 Octopus Energy now has 7.5 million retail customers in Britain, following its 2022 rescue of the collapsed energy supplier Bulb, and the subsequent acquisition of Shell's home energy business. In January, it announced that it had become the country's biggest supplier - surpassing Centrica-owned British Gas - with a 24% market share. It also has a further 2.5 million customers outside the UK. Sources said a £10bn valuation of Kraken would now imply that the whole group, including the retail supply business, was worth in the region of £15bn or more. That would be double its valuation of just over a year ago, when the company announced that it had secured new backing from funds Galvanize Climate Solutions and Lightrock. Shortly before that, former US vice president Al Gore's firm, Generation Investment Management, and the Canada Pension Plan Investment Board increased their stakes in Octopus Energy in a transaction valuing the company at $9bn (£7.2bn). Kraken is an operating system which is licensed to other energy providers, water companies and telecoms suppliers. It connects all parts of the energy system, including customer billing and the flexible management of renewable generation and energy devices such as heat pumps and electric vehicle batteries. The business also unlocks smart grids which enable people to use more renewable energy when there is an abundant supply of it. In the UK, its platform is licensed to Octopus Energy's rivals EON and EDF Energy, as well as the water company Severn Trent and broadband provider Cuckoo. Overseas, Kraken serves Origin Energy in Australia, Japan's Tokyo Gas and Plentitude in countries including France and Greece. Its biggest coup came recently, when it struck a deal with National Grid in the US to serve 6.5m customers in New York and Massachusetts. Sources said other major licensing agreements in the US were expected to be struck in the coming months. Kraken, which is chaired by Gavin Patterson, the former BT Group chief executive, is now contracted to more than 70 million customer accounts globally - putting it easily on track to hit a target of 100 million by 2027. Earlier this year, Mr Jackson said that target now risked being seen as \"embarrassingly unambitious\". Last July, Kraken recruited Amir Orad, a former boss of NICE Actimize, a US-listed provider of enterprise software to global banks and Fortune 500 companies, as its first chief executive. A demerger of Kraken will trigger speculation about an eventual public market listing of the business. Its growth in the US, and the relative public market valuations of technology companies in New York and London, may put the UK at a disadvantage when Kraken eventually considers where to list. One key advantage of demerging Kraken from the rest of Octopus Energy Group would be to remove the perception of a conflict of interest among potential customers of the technology platform. A source said the unified corporate ownership of both businesses had acted as a deterrent to some energy suppliers. Kraken has also diversified beyond the energy sector, and earlier this year joined a consortium which was exploring a takeover bid for stricken Thames Water. This weekend, Octopus Energy declined to comment."
    },
    {
        "title": "Ozzy Osbourne reunites with Black Sabbath for 'final bow' in emotional metal goodbye",
        "description": "Ozzy Osbourne has reunited with Black Sabbath and performed his final gig - telling fans \"you've no idea how I feel - thank you from the bottom of my heart\", in an emotional but truly metal goodbye.",
        "url": "https://news.sky.com/story/ozzy-osbourne-reunites-with-black-sabbath-for-final-gig-in-emotional-metal-goodbye-13392999",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne_6958282.jpg?20250705235044",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-07-05 22:06:00",
        "Headline": "The Back To The Beginning concert was billed as the \"final bow\" for the man revered as a founder of heavy metal after several years of health problems, including Parkinson's disease.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  Ozzy Osbourne has reunited with Black Sabbath and performed his final gig - telling fans \"you've no idea how I feel - thank you from the bottom of my heart\", in an emotional but truly metal goodbye. Announced earlier this year, Back To The Beginning at Villa Park stadium was billed as the \"final bow\" for the man revered as a founder of heavy metal after several years of health problems, including Parkinson's disease. Rising up on a black throne featuring jewelled skulls, the 76-year-old performed a solo set before being joined by his original bandmates - Terence \"Geezer\" Butler, Tony Iommi and Bill Ward - for Black Sabbath's first performance in 20 years. \"Let the madness begin,\" Osbourne cried as he appeared for the first time, telling about 40,000 fans: \"It's so good to be on this stage.\" With the crowd chanting his name, he performed both sets sitting down, but the voice and the crazed glint in his eyes were there almost throughout. Singing fan favourites including Mr Crowley and Crazy Train, and Iron Man and Paranoid with Black Sabbath, Osbourne conducted the crowd to sing \"louder, louder\", and \"go f****** crazy\". This was an orchestrated exit by heavy metal's biggest character, with a supporting line-up of hard rock luminaries - from Slayer and Halestorm to Metallica and Guns 'n' Roses, plus stars including Steven Tyler, Ronnie Wood, Yungblud, Travis Barker and Chad Smith, who showed up for \"supergroup\" performances. \n                  Who is Ozzy Osbourne? From Black Sabbath's Prince Of Darkness to relationship with Sharon and reality TV stardom\n                 \n                  Ozzy Osbourne to reunite with Black Sabbath for 'final bow' performance\n                 \n                  Ozzy Osbourne's former guitarist shot multiple times while walking his dog\n                 Many said they would not be the musicians they are without Osbourne and Black Sabbath. \"You know, there's not another guy as respected in metal as Ozzy Osbourne,\" former Van Halen singer Sammy Hagar told Sky News just ahead of his performance. \"And for him to be sick and to be saying, I'm out, I'm done. Man. There's no one else that can replace that.\" \"Without Sabbath, there would be no Metallica,\" said frontman James Hetfield during their performance. \"We're not here to say goodbye,\" said Anthrax's Scott Ian. \"We're just here to say thank you.\" Throughout the day, giant Ozzy and Black Sabbath beach balls, in the Aston Villa claret and blue, were bounced around a jubilant crowd. Tributes from other celebrity friends and fans, from Billy Idol and Ricky Gervais to Dolly Parton and Sir Elton John, were played on screen. Read more: From Black Sabbath's Prince of Darkness to reality TV star Hollywood actor Jason Momoa, who hosted the event, told the crowd heavy metal had been a \"safehaven\" for many growing up, and Black Sabbath's music had \"influenced and inspired musicians\" of all eras and genres. The farewell show was the idea of Osbourne's wife, Sharon - one final gig to finish his performing career on a high - after he was forced to cancel shows he had planned in 2023, telling fans he \"never imagined\" his touring days would end that way. Sharon Osbourne told Sky News earlier this year that his one regret was not being able to say a thank you to his fans, and so the idea for the reunion gig was born. Profits from the show will be shared between Cure Parkinson's, Birmingham Children's Hospital, and Acorn's Children's Hospice. The gig came after the Black Sabbath band members were awarded the freedom of Birmingham earlier in June, recognised for their significance to the cultural and musical identity of the city they grew up in. The group formed in 1968 and went on to become one of the most successful metal bands of all time, selling more than 75 million albums worldwide over the years. They were inducted into the Rock & Roll Hall of Fame in 2006 - Osbourne again later as a solo artist last year - and awarded a lifetime Ivor Novello songwriting award in 2015. In 2019, they were presented with a Grammy lifetime achievement prize. Now, their first performance in 20 years will also be their last - one for the metal history books. The show ended with fireworks and a roar from the crowd, who had chanted Ozzy's name throughout. For fans, Back To The Beginning capped it all - the ultimate rock and metal line-up, and one last opportunity to show their love for the Prince of Darkness. \"I feel lucky to be able to attend this,\" said Calum Kennedy, 19, from Dunfermline. \"It's the biggest metal show known to man, [the biggest line-up] ever. I've never seen anything better.\" Read more from Sky News:Oasis reunion: Ultimately, it was all about the musicBBC to stop showing 'high risk' performances live Ben Sutton, 24, from Chester, added: \"I feel like it's important - we're of the younger generation - for us to see some of the heritage and history of the genre we love, metal in general. It's such an honour to say goodbye to him.\" Steve Townson, from Lincolnshire, said: \"I saw him the first time round and the fact that he's still going is incredible, isn't it? I was there at the start, I'm happy to be here at the end.\""
    }
]