[
    {
        "title": "Home secretary announces shakeup of family reunion rules for asylum seekers to deter Channel crossings",
        "description": "The home secretary has announced a shakeup of family reunion rules for refugees in a bid to deter small boat crossings.",
        "url": "https://news.sky.com/story/home-secretary-announces-shakeup-of-family-reunion-rules-for-asylum-seekers-to-deter-channel-crossings-13423205",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7008585.jpg?20250901185325",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-01 18:00:00",
        "Headline": "Yvette Cooper says people smugglers are using the promise of family reunion to promote dangerous small boat crossings in the Channel.",
        "Content": " The home secretary has announced a shakeup of family reunion rules for refugees in a bid to deter small boat crossings. Yvette Cooper said people smugglers were using the promise of family reunion to promote dangerous journeys across the Channel. Addressing the House of Commons, Ms Cooper said the government would now suspend new applications under the existing family reunion route for refugees until a new framework had been introduced. Politics latest: Badenoch urged to 'come clean' over university admittance claims She highlighted how refugee families arriving in the UK were seeking homelessness assistance, putting pressure on local authorities that was \"not sustainable\". Ms Cooper told MPs the government would deliver an asylum policy statement later this year, which would set out a new system for family migration, with the aim of having \"some of those changes in place for the spring\". She said it would look at contribution requirements and whether there should be longer periods before newly granted refugees can apply for family reunion. \n                  Reform took advantage of the PM's holiday - and it's clear he's now changed strategy\n                 \n                  Small town tensions: The asylum crisis in Middle England\n                 \n                  'There's something in the air': The deep divides over asylum seekers in Nuneaton\n                 \"Even just before the pandemic, refugees who applied to bring family to the UK did so on average more than one or two years after they had been granted protection, long enough for them to be able to get jobs or find housing, or be able to provide their family with some support,\" she explained. \"In Denmark and Switzerland, currently, those granted humanitarian protection are not able to apply to bring family for at least two years after protection has been granted. But here in the UK now, however, those applications come in on average in around a month after protection has been granted, often even before a newly granted refugee has left asylum accommodation. \"As a consequence, refugee families who arrive are far more likely to be seeking homelessness assistance. \"And some councils are finding that more than a quarter of their family homelessness applications are linked to refugee family reunion. That is not sustainable.\" The home secretary continued: \"Therefore, we are bringing forward new immigration rules this week to temporarily suspend new applications under the existing dedicated refugee family reunion route. \"Until the new framework is introduced, refugees will be covered by the same family migration rules and conditions as everyone else.\" The move comes as the government struggles to cope with the continued arrival of small boats in the Channel, which have reached 29,003 - the highest on record for this point in a year. There is palpable anger in certain communities at the use of hotels to house asylum seekers, most notably in Epping, Essex, where there were protests at the weekend after the government successfully overturned a temporary injunction which would have blocked asylum seekers from staying at the Bell Hotel. The protests prompted Nigel Farage, the leader of Reform UK, to warn there was a \"genuine threat to public order\". Read more:Tories call for investigation into Angela Rayner over tax affairsWhat is the UK-France migrant returns deal? He has promised to deport up to 600,000 asylum seekers in the first parliament of a Reform UK government if he wins the next election - a plan opponents have criticised as unworkable. The home secretary said the government was working \"at pace\" to end the use of all asylum hotels, and said they would be closed \"for good\" under a \"controlled, managed and orderly programme - driving down inflow into the asylum system, clearing the appeals backlog... and continuing to increase returns\". She added: \"I understand and agree with local councils and communities who want the asylum hotels in their communities closed because we need to close all asylum hotels, and we need to do so for good, but that must be done in a controlled and orderly manner, and not through a return to the previous government's chaos that led to the opening of hotels in the first place.\" 'Things are getting worse' In response, shadow home secretary Chris Philp said Channel crossings were up 38% on the previous year, adding: \"Things are not getting any better, they are getting worse.\" He said \"tweaking the family reunion rules is not enough\" and referred again to the Tories' Rwanda scheme, which Labour scrapped on winning office."
    },
    {
        "title": "Reform took advantage of the PM's holiday - and it's clear he's now changed strategy",
        "description": "Immigration was the first thing on the government's agenda to kick off the first week back from recess, and they wanted you to know it.",
        "url": "https://news.sky.com/story/yvette-cooper-attempts-to-seize-the-limelight-from-reform-on-immigration-13423406",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-farage_6927488.jpg?20250525233805",
        "type": "Home",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-01 21:00:00",
        "Headline": "After a summer dominated by Reform turning up the heat on immigration, it's finally hit home for the government that the public want proof of change, not just rhetoric.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Immigration was the first thing on the government's agenda to kick off the first week back from recess, and they wanted you to know it. The home secretary gave an update to the House, announcing a shakeup of family reunion rules for asylum seekers, even before some backbenchers had made it back to parliament from their break. Facing criticism for being on the back foot after a summer of protest outside asylum hotels, they were keen to defend their record and get back on track - but is it too late? It's a clear nod to the political void Reform UK has seized on while the prime minister has been on holiday. Last week, Nigel Farage unveiled his party's mass deportation policy - though the issue of women and children still seems to be worked out. But perhaps none of that matters as voters overwhelmingly believe Reform cares about this issue - and as Chris Philp, the shadow home secretary, pointed out on Monday, voters have lost confidence in the government somewhat to solve what many see as an immigration crisis on their doorstep. So it's clear the strategy has changed from the government. Read more:Starmer's 'Mr Fixit' is likely to be a recipe for conflictTories call for investigation into Angela Rayner  Gone are the bold slogans of \"smashing the gangs\" and instead, detail and policy was given on Monday. It was nothing new, but more substance on what the government has done and where they want to move to. Even controversially, reassessing their relationship with the European Convention on Human Rights (ECHR). The biggest update though, was on their one-in-one-out policy agreement with France, which will now set to start returns later this month. It's finally hit home for the government that the public want proof not just rhetoric, and they want to know crucially when they will start to see change. But the fightback, the reset, whatever the government wants to call it, will only make a difference once that finally starts to work."
    },
    {
        "title": "Russia responds to GPS jamming accusations - but such instances are expected to escalate",
        "description": "Bulgarian authorities have said they suspect Russia of jamming the GPS system of the jet carrying the EU Commission president on Sunday.",
        "url": "https://news.sky.com/story/russia-responds-to-gps-jamming-accusations-but-such-instances-are-expected-to-escalate-13423288",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ursula-von-der-leyen_7008577.jpg?20250901185009",
        "type": "Home",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-09-01 16:42:00",
        "Headline": "The EU Commission president's plane has allegedly been targeted as the bloc prepares to impose more sanctions on Moscow.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Bulgarian authorities have said they suspect Russia of jamming the GPS system of the jet carrying the EU Commission president on Sunday. If someone deliberately jams your jet's GPS, it's fair to assume they are trying to threaten or intimidate you. The Kremlin hasn't responded to Sky News but its spokesperson told the Financial Times \"your information is incorrect\", when asked about the allegations. However, the timing of the alleged interference is interesting. It happened as the EU is preparing its 19th sanctions package on Russia, and European leaders are discussing what security guarantees they can offer Ukraine while also trying to persuade the US to get tough. It also came as EU Commission chief Ursula von der Leyen was on a four-day tour of member states that border or are near to Russia. She was seeing \"first-hand the everyday challenges of threats coming from Russia and its proxies\", according to her spokesperson. These threats are part of the hybrid war that numerous European leaders, generals and the NATO chief have repeatedly warned about since Russia invaded Ukraine in 2022. The hybrid attacks they accuse Moscow of carrying out range from cyber attacks to suspected attempts to spy on NATO bases. I remember Lieutenant General Andre Bodemann, head of Germany's homeland defence command, vividly laying out some of the challenges being faced when I interviewed him last year. \"We have a lot of hybrid threats: that's fake news, disinformation, cyber attacks, espionage and sabotage... We see drones over my operations cell, for example, we even saw explosives in the vicinity of the NATO pipeline,\" he said. These types of alleged attacks have continued and are expected to escalate as the EU puts more pressure on Moscow, according to experts. Last week, a security source told me that they were aware of several unidentified drones monitoring NATO members' troop movements as they travelled through eastern Germany and the state of Thuringia to the eastern front to transport ammunition to Ukraine. Read more from Sky News:Who is messing with GPS signals - and why? They suspect this was part of an intelligence gathering exercise by the Russians as the focus was on movements by NATO nations. It follows similar allegations published by the New York Times that Russian drones were flying over US weapons routes in Germany. The Kremlin has denied these and all the previous allegations that it's behind hybrid attacks. Asked about the New York Times report, Dmitry Peskov, Russian President Vladimir Putin's press secretary, told journalists the Kremlin had not had time to read the story closely. \"But it's hard to imagine, because then the Germans would have seen it clearly, and they would hardly have kept quiet. So, of course, all this looks more like another newspaper fake,\" he said. However, the chief of domestic intelligence for the state of Thuringia, Stephan Kramer, told me his team were taking the reports seriously. So, with these allegations in mind, plus the fact the GPS-jamming happened as the EU is trying to put extra pressure on the Kremlin, many will understand why Bulgaria has said it suspects Russia of being involved."
    },
    {
        "title": "Premier League flexes its financial muscle in record-breaking transfer window",
        "description": "The transfer window was a show of strength in a record-breaking summer across the Premier League.",
        "url": "https://news.sky.com/story/premier-league-flexes-its-financial-muscle-in-record-breaking-transfer-window-13423441",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-premier-league-transfer-window_7008819.jpg?20250901234058",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-09-01 21:42:00",
        "Headline": "More than half of the record spend flowed between Premier League clubs rather than abroad, and even though the feared threat from Saudi Arabia has not materialised, it nonetheless contributed to some of the big deals.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The transfer window was a show of strength in a record-breaking summer across the Premier League. The totaliser crept over £3bn in spending, with more than half of it flowing among the 20 clubs rather than having a redistributing effect across Europe. The start of new Premier League TV deals - the biggest individual source of income being from Sky News' parent company Comcast - provides certainty for the next four years, while rival leagues can struggle to sell rights. And the feared threat from Saudi Arabia has not materialised. It is an attractive and lucrative destination for some players, but not yet the ultimate destination. But the kingdom has still influenced this transfer window. Let's start with Newcastle, four years into their ownership by the Saudi sovereign wealth fund. Having secured a return to the Champions League, bringing UEFA riches, this was the summer to grow rather than lose talent to rivals. But the Premier League's pecking order became clear when Alexander Isak pushed for a move to Liverpool and rejected bids that did not deter his ambitions. Player power won out. The 25-year-old striker was able to withdraw himself from the squad, miss the opening three matches of the season, and put out a statement claiming promises had been broken by the Magpies. Read more: Isak completes £125m Liverpool move  Liverpool 'loading up on talent' And so he held on until deadline day, biding his time, sitting it out, and standing firm. Newcastle folded, accepting £125m - £20m lower than their apparent valuation. Breaking the British record fee was Liverpool's American ownership flexing financial muscle like never before. The Premier League champions allowed manager Arne Slot to build from a position of strength. This was the second time they broke the record in this window after bringing in another forward, Florian Wirtz, in a £116m deal. More than £400m in reinforcements arrived at Anfield in a matter of weeks. Former Liverpool managing director Christian Purslow told Sky Sports: \"Liverpool are making hay while the sun shines, going for it. Really loading up on talent. \"Other clubs should be fearful and respectful of the way [Fenway Sports Group] are running their club.\" The Isak deal weakened their Champions League rivals from the North East after banking £57m from another club owned by the Public Investment Fund when Darwin Nunez was offloaded to Saudi. And PIF funded Chelsea's summer spending spree in less obvious ways. The Blues did negotiate a £44m package with PIF-backed Al Nassr deal for Joao Felix, recouping the fee paid just a year earlier. But then there was the £90m prize money collected for winning the new FIFA Club World Cup - a competition bankrolled by PIF subsidiaries. Where does this leave Newcastle? Still spending around £250m. Players and Liverpool couldn't get all their way this summer, with Marc Guehi forced to stay at Crystal Palace after the FA Cup winners failed to secure a replacement for the England centre-back. The late drama was just the latest of the summer transfer window's twists and turns. Read more from Sky News:Heavyweight champion diesAsylum seeker rules to changeUS Open cap-grabber apologises Both Arsenal and Manchester United also spent more than £200m each. The Gunners spent big in pursuit of a title that's eluded them since 2004, while the Red Devils are just trying to get back into the Champions League. It added up to a new record total outlay that comfortably eclipsed the previous Premier League record of £2.46bn from 2023. The £3bn is more than the rest of Europe combined, showing both where the power is in world football and why the Premier League is the one the world wants to watch."
    },
    {
        "title": "The red tape keeping these flats empty - and threatening Labour's vital new homes target",
        "description": "There are 1,210 completed homes which cannot be occupied because of delays in the work of the government's building safety regulator, Sky News can reveal.",
        "url": "https://news.sky.com/story/the-red-tape-keeping-these-flats-empty-and-threatening-labours-vital-new-homes-target-13423446",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-acton-housing_7008838.jpg?20250902010118",
        "type": "Home",
        "Author": "Sam Coates, deputy political editor, and Joe Cook, politics producer",
        "Date Published": "2025-09-01 22:04:00",
        "Headline": "Sir Keir Starmer has made house building one of his government's priorities, and regularly rails against NIMBY culture. But Sky News can reveal the government's own regulator has also been getting in the way of people moving into new homes. ",
        "Content": "By Sam Coates, deputy political editor, and Joe Cook, politics producer   There are 1,210 completed homes which cannot be occupied because of delays in the work of the government's building safety regulator, Sky News can reveal. The safety inspection regime created in the wake of the Grenfell tragedy, which claimed 72 lives, is \"not fit for purpose\", according to those who depend on its work. Politics Hub: Follow live updates Sky News has visited an empty block of 99 flats in west London where future residents - who have purchased the properties - have been unable to move in for over a year because of the lack of regulator approval. New data obtained exclusively by Sky News through a Freedom of Information request shows the extent of the issue. As of 1 August, there is \"no decision\" on eight applications covering 1,210 completed new residential units. For sites yet to be built, there are 156 applications with no decision, covering 34,965 new residential units. Sir Keir Starmer says economic growth is his top priority and the 1.5 million new homes target this parliament is a key part of this agenda. But two years after its creation, the government agency has come under fire for failing to fulfil vital functions in a timely manner. After complaints, the regulator has already faced one overhaul, and will shortly move from part of the Health and Safety Executive (HSE) to become an arm's length body which is part of Angela Rayner's Ministry of Housing, Communities and Local Government. But developers say they are still struggling to get answers from the body. Sky News has conducted an analysis of public data and found the backlog growing. New buildings ought to be signed off within a 12-week period, but Sky News found the percentage of applications determined inside that window is falling - from 47% at the end of September last year, to 32% by the end of March. In a statement, leading financial analyst S&P said delays by the regulator are pushing up building costs and making it harder to deliver the key government target. Chris Williamson, chief business economist at S&P, said: \"We have received anecdotal feedback from a few companies regarding the Building Safety Act, indicating that some may be experiencing challenges related to orders. This could contribute to an increase in costs within the construction sector, which is already facing financial pressures.\" In an apparent admission of the issues, the government told Sky News it is now in the process of recruiting over 100 new staff to strengthen capacity by the end of the year. In a statement to Sky News, the building safety regulator (BSR) itself said it had been a complex task creating a new safety body post Grenfell, in such a short time, and improvements are already being made. It said: \"BSR is working closely with industry to deliver safer, higher-quality buildings while advancing a culture of excellence in building safety.\" Executives from the BSR will appear before a Commons Select Committee later today. It also points the finger at property developers for failing to submit paperwork correctly. The industry vehemently rejects the claim, saying there are few guidelines of what to submit and the BSR makes little attempt to clarify what it wants. A bad sign However, problems persist. Sky News saw how in one newly built property in Acton, west London, the sign-off for a building by the BSR was delayed in part because a sign was two millimetres too small and all the signs had to be changed. This has contributed to a 14-month delay in a green light for residents to move in. According to the Federation of Master Builders and the Chartered Institute of Building, 38% of developers believe planning delays are the number one issue. Developers have told Sky News the agency was meant to speed up approvals by ending a system where they have to bring in external consultants to approve the application, but this has not yet happened. Jon Spring, the managing director of Fairview Homes, said: \"We currently have three applications that are delayed within the BSR. The current dates we're looking at, that they've given us, one is six months, one is nine months, and one is 12 months. Clearly extremely different to the original three months that the process is supposed to take. \"That makes forecasting for when we're going to start on site very difficult. We have tens of millions of pounds tied up in the three sites that we're waiting to develop. And inevitably, the holding costs of those are considerable and affect the viability of the project.\" Mr Spring said the delays could make building unviable. \"If you look at each of our projects have been delayed, if […] it's going to take 25% longer to deliver that project, that means that our productivity is ultimately reduced by 25%. That would be the same for all developers and therefore the reduction in housing that's been delivered will be considerable.\" Developers 'won't touch' high-rises Jamie Lester, an estate agent from Haus Properties, said: \"The government are encouraging property developers to build, build, build, and just get on with it - I think that's what Keir Starmer said. \"But when there are buildings like this that can't be signed off for over a year and are costing property developers, in this instance, £100,000 a week, I don't understand. \"The government won't encourage property developers to build like this any more. I know many property developers who won't touch high-rise buildings at the moment simply because the building safety regulator can't get their act together and sign these buildings off.\" Read more from our politics experts:PM's 'Mr Fix-it' may be a recipe for conflictHome secretary bids to seize limelight from Reform 'High standards' A spokesperson for the HSE said: \"Protecting residents, making sure there is never another tragedy like Grenfell, has been our priority throughout this process. Setting up a new regulator has been complex, and huge progress has been made in a short time. The construction industry must meet standards that will keep residents safe in high-rise buildings. \"The recently announced innovation unit is the result of ongoing discussions between industry and BSR to uphold high standards. BSR is working closely with industry to deliver safer, higher-quality buildings while advancing a culture of excellence in building safety.\" 'It has turned out to be a disaster' Some have blamed the government, not the regulator itself. The boss of one major house building company, who did not want to be named, said ministers aren't willing to face up to reality. \"Regulation comes from the government and the regulator is implementing the rules,\" they said. \"Their mandate is nothing to do with housing supply so it's up to ministers to balance that. All the house builders said this would be a disaster and funnily enough it has turned out to be a disaster.\" A government spokesman from the housing department said problems were already being tackled and safety was important: \"We've announced a package of reforms to reduce delays, including a fast track process to speed up new build decisions.\" They added 100 new staff were being employed."
    },
    {
        "title": "Police ask for help with unsolved murder more than 50 years ago",
        "description": "Police are asking for help with an unsolved case, 52 years after the murder of a schoolboy in Belfast.",
        "url": "https://news.sky.com/story/police-ask-for-help-with-unsolved-murder-more-than-50-years-ago-13423297",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-brian-mcdermott-belfast_7008566.jpg?20250901183836",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-01 17:14:00",
        "Headline": "Schoolboy Brian McDermott disappeared from Ormeau Park in Belfast on 2 September 1973, and his remains were recovered almost a week later from the River Lagan.",
        "Content": "Police are asking for help with an unsolved case, 52 years after the murder of a schoolboy in Belfast. Brian McDermott was 10 when he disappeared from Ormeau Park on Sunday 2 September 1973. His remains were recovered from the River Lagan almost a week later. Detectives from the Police Service of Northern Ireland's Legacy Investigation Branch have given a timeline of events as part of their appeal. Brian left his home on Well Street in the lower Woodstock Road area of east Belfast at around 12.30pm and failed to return for his Sunday dinner. Detectives said he was last seen playing alone in the playground between 1pm and 3pm that afternoon. His remains were recovered in the water, close to the Belfast Boat Club. Read more from Sky News:Union issues warning over schoolsPremier League's record-breaking transfer window A PSNI spokesperson said: \"We are acutely aware of the pain and suffering that Brian's family continue to feel, and our thoughts very much remain with the family at this time. \"Despite the passage of time, this murder case has never been closed and I am hopeful that someone may be able to provide information, no matter how small, which may open a new line of inquiry, or add a new dimension to information already available. \"It is also possible that someone who did not volunteer information at the time may be willing to speak with police now. Legacy Investigation Branch Detectives will consider all investigative opportunities as part of the review into Brian's murder.\" "
    },
    {
        "title": "Schools 'left to pick up the pieces' from 'crumbling public services', says teaching union",
        "description": "Schools and colleges are increasingly being expected to offer support which goes \"far beyond teaching and learning\" because of rising child poverty and \"crumbling public services\", a teaching union has warned.",
        "url": "https://news.sky.com/story/schools-left-to-pick-up-the-pieces-from-crumbling-public-services-says-teaching-union-13423131",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-school-generic_5296080.jpg?20250901145233",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-01 12:45:00",
        "Headline": "The Association of School and College Leaders (ASCL) says the expectations on headteachers have \"expanded significantly\" and should not include running food banks, supporting families with housing, and mediating parental disputes.",
        "Content": "Schools and colleges are increasingly being expected to offer support which goes \"far beyond teaching and learning\" because of rising child poverty and \"crumbling public services\", a teaching union has warned. A report by the Association of School and College Leaders (ASCL) said teachers have been \"left to pick up the pieces\" as \"underfunded wider public services crumble around them\". It added that schools are \"not officially recognised or resourced to provide broader services, but are having to do so anyway\", following the pandemic, austerity measures and a cost of living crisis. \"From running food banks and supporting families with housing, to resolving parking issues and mediating parental disputes, the burden placed on school and college teachers and leaders has never been higher,\" according to Julie McCulloch, the ASCL's director of strategy and policy. The ASCL has set out a roadmap for what services schools in England should reasonably be expected to provide, and which should be the responsibility of other agencies. Things like dental checks, health of pupils' families, and pupil behaviour on social media out of school hours should not be expected of schools, the report said. \"Some of these issues are obviously of great importance, but they cannot continue to be shouldered by educators,\" said Ms McCulloch. \"More needs to be done to clearly distinguish where the core responsibilities of education staff start and end. \"It is time to rethink exactly what we expect from schools and colleges and how they should be resourced to meet these demands.\" The roadmap recommends 16 actions to address challenges facing the education system, including: investing in children's services; setting out clear responsibilities for education, health and social care in each area; ensuring league tables focus on core education only; and allowing schools to flag issues if external agencies are falling short. Read more from Sky News:Parents must tackle bad behaviourFree school meals expandedWarning over 'unorthodox' schooling The report also sets out some responsibilities that schools might reasonably be expected to take on, with the proper funding and resources, like helping pupils with their personal hygiene, mental health, advising on sexual health matters, and providing technology. Other measures could include running parenting classes, holiday food and activity clubs, or financial support in the form of school uniforms and other clothing for struggling families. The ASCL recommends boosting pay to reflect the demands of the profession, increasing the range of professional qualifications, offering flexible working and tackling excessive paperwork. The report also warns that the \"status of teaching has diminished in recent years\" impacting morale, job satisfaction, and retention rates."
    },
    {
        "title": "The BTO Kid: 'I spent months in a coma - AI has given me a musical voice'",
        "description": "\"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\"",
        "url": "https://news.sky.com/story/the-bto-kid-i-spent-months-in-a-coma-ai-has-given-me-a-musical-voice-13423167",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lucas-horne-coma-the-bto-kid_7008436.jpg?20250901153356",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-01 23:01:00",
        "Headline": "Lucas Horne, from Nottinghamshire, spent almost four months in a coma after suffering a brain bleed in 2016, at the age of 17. Since then he has been writing songs for several years, but AI has helped him become The BTO Kid - and he is now shortlisted for the first Future Sound Awards.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  \"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\" Lucas was 17 when, in December 2016, with no warning, he suffered a large, traumatic bleed across his brain. He didn't wake up until almost four months later. Unknowingly, he had been living with a defect in the blood vessels known as an AVM (arteriovenous malformation), a ticking time bomb which had ruptured, and the next three years of his life were spent in recovery in a care home. He couldn't walk and struggled to talk. Writing down his thoughts, almost like a diary, was something he says he wanted to do from very early on. \"During my care home days when I couldn't really express myself very well - I still can't - but I could write about it, it was an outlet for me,\" he says. \"Since I woke up, I've been writing... but for a long time I couldn't record anything.\" Lucas, now 26, has spent years working on his physical recovery and speech. But when he was eventually physically able to record the songs he had been writing himself, he became frustrated by the way his voice had changed. \"It never sounded how I had [it in] my head,\" he says. \"I'm very monotone in how I speak, I struggle to really display emotion.\" And so he turned to AI (artificial intelligence). Now, Lucas is also known as The BTO Kid, and is one of 15 creators from around the world, shortlisted from more than 500 entries, for the inaugural Future Sound Awards - celebrating artificial intelligence in music. While some artists such as will.i.am, David Guetta, Grimes, Timbaland and even Sir Paul McCartney have embraced certain aspects of AI, it can be a controversial subject in the creative industries - with concerns raised by many in the about issues including copyright, human replacement, fakes, and regulation. It was one of the issues behind the Hollywood actors' and writers' strikes in 2023 - and the more recent video game actor strike, which ended in June after nearly a year of industrial action. Despite the criticism, AI isn't going away. Last year was a \"breakout\" year for the technology in music, according to the International Music Summit's latest annual business report, with 60m users using AI software. Lucas says he is a perfect example of how the technology can be used for good. \"I've been able to use AI to express how I'm feeling,\" he says. \"It's been big for me to create [music] that I'm proud of. I can see the arguments [against it], but from my view I know AI helped me create something I couldn't before. I'm not Adele, but I have been able to make something that I'm proud of and that expresses my view point of what's happened to me.\" Read more on AI in the music industry:Will.i.am on embracing AIAI used to help create 'the last Beatles record  'AI is lowering the barriers' BTO stands for Beat The Odds and his shortlisted track is titled AI Gave Me A Voice. \"I pinch myself every day because this just can't be true,\" is the opening line - which he says reflects how far he has come from the moment he woke up and discovered what had happened. \"That comes from reality. I do have moments where I think so much has happened that it must not be true... every line means something to me.\" Lucas, who lives in Nottingham, used the AI-powered music production platform TwoShot to create the track, using prompts on what he wanted for the sound alongside his lyrics, inspired by melodic rap. \"I think we're gonna get quite a lot more people like me that can't record music and have been given a voice through AI,\" he says. \"AI is lowering the barriers to entry for a lot of things.\" Which can be a negative as well as a positive, he acknowledges. \"We'll have to see where it goes.\" Launched by the Fanvue World AI Creator Awards, The Future Sound Awards aim to highlight the ethical use of AI in music, organisers say. Fanvue is a subscription creator platform with more than 180,000 users. Some 15 artists from the US, Europe, Australia and Asia, as well as the UK, have been shortlisted for prizes, and the winners will be announced later in September. Lucas is one of two British creators on the list, alongside Gallis, from Essex. The 31-year-old first dipped his toe into the waters of the music industry about 10 years ago, after joining the urban-pop boy band Mr Meanor, but says the industry was hard and \"it all got a bit too much\". He is now a tattoo artist and fine painter, but continued his songwriting and started to try out AI music production tools about 18 months ago. Read more on AI in the music industry:'Regulate it before we're all finished''It's like saying you can burgle my house unless I ask you not to'Silent album released in AI protest AI has 'made me more creative' As an artist, he says he had his own concerns about AI before he started using it himself, particularly after image generators started becoming prominent online. \"It was stealing the work that I was doing,\" is how he describes his initial feelings. \"But I ended up jumping on board with it and for me personally, it's inspired me so much. It's made me quicker at what I'm doing, it's made me more creative. And I think it's the same with music. I think it's gonna, if anything, grow the industry.\" However, he says he agrees with criticism about the ethics of how some AI models are trained - following controversy about work by human music artists and authors being used without consent. \"And trying to impersonate exactly someone else and using someone else's voice, I don't agree with that at all,\" he adds. Gallis's shortlisted song, Chiropractor emerged from \"friendly competition\" with a community of creators he came across when he moved into AI, trading feedback and ratings. The genre is Trinibad, which he says there isn't enough of \"in the AI world\", and the track is designed to get people dancing. \"I mainly stick to urban music, but I like writing in a lot of different styles,\" he says. \"I've done house songs, I've done UK drill songs, Afrobeats, amapiano. I'm a bit of a vibes man so if it makes me dance and move and smile that's when I really enjoy it.\" Narcis Marincat, head of AI at Fanvue, says the stories behind the selected songs show a \"richness and human emotion\" that appealed to him and other judges. \"The impact of AI in music continues to divide opinion,\" he says. \"But for the first time, via the Future Sound Awards, we're able to show a different perspective on the positive impact of AI in music - uncovering the real people behind the technology and sharing their stories and music.\""
    },
    {
        "title": "The red tape keeping these flats empty - and threatening Labour's vital new homes target",
        "description": "There are 1,210 completed homes which cannot be occupied because of delays in the work of the government's building safety regulator, Sky News can reveal.",
        "url": "https://news.sky.com/story/the-red-tape-keeping-these-flats-empty-and-threatening-labours-vital-new-homes-target-13423446",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-acton-housing_7008838.jpg?20250902010118",
        "type": "UK",
        "Author": "Sam Coates, deputy political editor, and Joe Cook, politics producer",
        "Date Published": "2025-09-01 22:04:00",
        "Headline": "Sir Keir Starmer has made house building one of his government's priorities, and regularly rails against NIMBY culture. But Sky News can reveal the government's own regulator has also been getting in the way of people moving into new homes. ",
        "Content": "By Sam Coates, deputy political editor, and Joe Cook, politics producer   There are 1,210 completed homes which cannot be occupied because of delays in the work of the government's building safety regulator, Sky News can reveal. The safety inspection regime created in the wake of the Grenfell tragedy, which claimed 72 lives, is \"not fit for purpose\", according to those who depend on its work. Politics Hub: Follow live updates Sky News has visited an empty block of 99 flats in west London where future residents - who have purchased the properties - have been unable to move in for over a year because of the lack of regulator approval. New data obtained exclusively by Sky News through a Freedom of Information request shows the extent of the issue. As of 1 August, there is \"no decision\" on eight applications covering 1,210 completed new residential units. For sites yet to be built, there are 156 applications with no decision, covering 34,965 new residential units. Sir Keir Starmer says economic growth is his top priority and the 1.5 million new homes target this parliament is a key part of this agenda. But two years after its creation, the government agency has come under fire for failing to fulfil vital functions in a timely manner. After complaints, the regulator has already faced one overhaul, and will shortly move from part of the Health and Safety Executive (HSE) to become an arm's length body which is part of Angela Rayner's Ministry of Housing, Communities and Local Government. But developers say they are still struggling to get answers from the body. Sky News has conducted an analysis of public data and found the backlog growing. New buildings ought to be signed off within a 12-week period, but Sky News found the percentage of applications determined inside that window is falling - from 47% at the end of September last year, to 32% by the end of March. In a statement, leading financial analyst S&P said delays by the regulator are pushing up building costs and making it harder to deliver the key government target. Chris Williamson, chief business economist at S&P, said: \"We have received anecdotal feedback from a few companies regarding the Building Safety Act, indicating that some may be experiencing challenges related to orders. This could contribute to an increase in costs within the construction sector, which is already facing financial pressures.\" In an apparent admission of the issues, the government told Sky News it is now in the process of recruiting over 100 new staff to strengthen capacity by the end of the year. In a statement to Sky News, the building safety regulator (BSR) itself said it had been a complex task creating a new safety body post Grenfell, in such a short time, and improvements are already being made. It said: \"BSR is working closely with industry to deliver safer, higher-quality buildings while advancing a culture of excellence in building safety.\" Executives from the BSR will appear before a Commons Select Committee later today. It also points the finger at property developers for failing to submit paperwork correctly. The industry vehemently rejects the claim, saying there are few guidelines of what to submit and the BSR makes little attempt to clarify what it wants. A bad sign However, problems persist. Sky News saw how in one newly built property in Acton, west London, the sign-off for a building by the BSR was delayed in part because a sign was two millimetres too small and all the signs had to be changed. This has contributed to a 14-month delay in a green light for residents to move in. According to the Federation of Master Builders and the Chartered Institute of Building, 38% of developers believe planning delays are the number one issue. Developers have told Sky News the agency was meant to speed up approvals by ending a system where they have to bring in external consultants to approve the application, but this has not yet happened. Jon Spring, the managing director of Fairview Homes, said: \"We currently have three applications that are delayed within the BSR. The current dates we're looking at, that they've given us, one is six months, one is nine months, and one is 12 months. Clearly extremely different to the original three months that the process is supposed to take. \"That makes forecasting for when we're going to start on site very difficult. We have tens of millions of pounds tied up in the three sites that we're waiting to develop. And inevitably, the holding costs of those are considerable and affect the viability of the project.\" Mr Spring said the delays could make building unviable. \"If you look at each of our projects have been delayed, if […] it's going to take 25% longer to deliver that project, that means that our productivity is ultimately reduced by 25%. That would be the same for all developers and therefore the reduction in housing that's been delivered will be considerable.\" Developers 'won't touch' high-rises Jamie Lester, an estate agent from Haus Properties, said: \"The government are encouraging property developers to build, build, build, and just get on with it - I think that's what Keir Starmer said. \"But when there are buildings like this that can't be signed off for over a year and are costing property developers, in this instance, £100,000 a week, I don't understand. \"The government won't encourage property developers to build like this any more. I know many property developers who won't touch high-rise buildings at the moment simply because the building safety regulator can't get their act together and sign these buildings off.\" Read more from our politics experts:PM's 'Mr Fix-it' may be a recipe for conflictHome secretary bids to seize limelight from Reform 'High standards' A spokesperson for the HSE said: \"Protecting residents, making sure there is never another tragedy like Grenfell, has been our priority throughout this process. Setting up a new regulator has been complex, and huge progress has been made in a short time. The construction industry must meet standards that will keep residents safe in high-rise buildings. \"The recently announced innovation unit is the result of ongoing discussions between industry and BSR to uphold high standards. BSR is working closely with industry to deliver safer, higher-quality buildings while advancing a culture of excellence in building safety.\" 'It has turned out to be a disaster' Some have blamed the government, not the regulator itself. The boss of one major house building company, who did not want to be named, said ministers aren't willing to face up to reality. \"Regulation comes from the government and the regulator is implementing the rules,\" they said. \"Their mandate is nothing to do with housing supply so it's up to ministers to balance that. All the house builders said this would be a disaster and funnily enough it has turned out to be a disaster.\" A government spokesman from the housing department said problems were already being tackled and safety was important: \"We've announced a package of reforms to reduce delays, including a fast track process to speed up new build decisions.\" They added 100 new staff were being employed."
    },
    {
        "title": "Police ask for help with unsolved murder more than 50 years ago",
        "description": "Police are asking for help with an unsolved case, 52 years after the murder of a schoolboy in Belfast.",
        "url": "https://news.sky.com/story/police-ask-for-help-with-unsolved-murder-more-than-50-years-ago-13423297",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-brian-mcdermott-belfast_7008566.jpg?20250901183836",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-01 17:14:00",
        "Headline": "Schoolboy Brian McDermott disappeared from Ormeau Park in Belfast on 2 September 1973, and his remains were recovered almost a week later from the River Lagan.",
        "Content": "Police are asking for help with an unsolved case, 52 years after the murder of a schoolboy in Belfast. Brian McDermott was 10 when he disappeared from Ormeau Park on Sunday 2 September 1973. His remains were recovered from the River Lagan almost a week later. Detectives from the Police Service of Northern Ireland's Legacy Investigation Branch have given a timeline of events as part of their appeal. Brian left his home on Well Street in the lower Woodstock Road area of east Belfast at around 12.30pm and failed to return for his Sunday dinner. Detectives said he was last seen playing alone in the playground between 1pm and 3pm that afternoon. His remains were recovered in the water, close to the Belfast Boat Club. Read more from Sky News:Union issues warning over schoolsPremier League's record-breaking transfer window A PSNI spokesperson said: \"We are acutely aware of the pain and suffering that Brian's family continue to feel, and our thoughts very much remain with the family at this time. \"Despite the passage of time, this murder case has never been closed and I am hopeful that someone may be able to provide information, no matter how small, which may open a new line of inquiry, or add a new dimension to information already available. \"It is also possible that someone who did not volunteer information at the time may be willing to speak with police now. Legacy Investigation Branch Detectives will consider all investigative opportunities as part of the review into Brian's murder.\" "
    },
    {
        "title": "Schools 'left to pick up the pieces' from 'crumbling public services', says teaching union",
        "description": "Schools and colleges are increasingly being expected to offer support which goes \"far beyond teaching and learning\" because of rising child poverty and \"crumbling public services\", a teaching union has warned.",
        "url": "https://news.sky.com/story/schools-left-to-pick-up-the-pieces-from-crumbling-public-services-says-teaching-union-13423131",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-school-generic_5296080.jpg?20250901145233",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-01 12:45:00",
        "Headline": "The Association of School and College Leaders (ASCL) says the expectations on headteachers have \"expanded significantly\" and should not include running food banks, supporting families with housing, and mediating parental disputes.",
        "Content": "Schools and colleges are increasingly being expected to offer support which goes \"far beyond teaching and learning\" because of rising child poverty and \"crumbling public services\", a teaching union has warned. A report by the Association of School and College Leaders (ASCL) said teachers have been \"left to pick up the pieces\" as \"underfunded wider public services crumble around them\". It added that schools are \"not officially recognised or resourced to provide broader services, but are having to do so anyway\", following the pandemic, austerity measures and a cost of living crisis. \"From running food banks and supporting families with housing, to resolving parking issues and mediating parental disputes, the burden placed on school and college teachers and leaders has never been higher,\" according to Julie McCulloch, the ASCL's director of strategy and policy. The ASCL has set out a roadmap for what services schools in England should reasonably be expected to provide, and which should be the responsibility of other agencies. Things like dental checks, health of pupils' families, and pupil behaviour on social media out of school hours should not be expected of schools, the report said. \"Some of these issues are obviously of great importance, but they cannot continue to be shouldered by educators,\" said Ms McCulloch. \"More needs to be done to clearly distinguish where the core responsibilities of education staff start and end. \"It is time to rethink exactly what we expect from schools and colleges and how they should be resourced to meet these demands.\" The roadmap recommends 16 actions to address challenges facing the education system, including: investing in children's services; setting out clear responsibilities for education, health and social care in each area; ensuring league tables focus on core education only; and allowing schools to flag issues if external agencies are falling short. Read more from Sky News:Parents must tackle bad behaviourFree school meals expandedWarning over 'unorthodox' schooling The report also sets out some responsibilities that schools might reasonably be expected to take on, with the proper funding and resources, like helping pupils with their personal hygiene, mental health, advising on sexual health matters, and providing technology. Other measures could include running parenting classes, holiday food and activity clubs, or financial support in the form of school uniforms and other clothing for struggling families. The ASCL recommends boosting pay to reflect the demands of the profession, increasing the range of professional qualifications, offering flexible working and tackling excessive paperwork. The report also warns that the \"status of teaching has diminished in recent years\" impacting morale, job satisfaction, and retention rates."
    },
    {
        "title": "The BTO Kid: 'I spent months in a coma - AI has given me a musical voice'",
        "description": "\"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\"",
        "url": "https://news.sky.com/story/the-bto-kid-i-spent-months-in-a-coma-ai-has-given-me-a-musical-voice-13423167",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lucas-horne-coma-the-bto-kid_7008436.jpg?20250901153356",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-01 23:01:00",
        "Headline": "Lucas Horne, from Nottinghamshire, spent almost four months in a coma after suffering a brain bleed in 2016, at the age of 17. Since then he has been writing songs for several years, but AI has helped him become The BTO Kid - and he is now shortlisted for the first Future Sound Awards.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  \"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\" Lucas was 17 when, in December 2016, with no warning, he suffered a large, traumatic bleed across his brain. He didn't wake up until almost four months later. Unknowingly, he had been living with a defect in the blood vessels known as an AVM (arteriovenous malformation), a ticking time bomb which had ruptured, and the next three years of his life were spent in recovery in a care home. He couldn't walk and struggled to talk. Writing down his thoughts, almost like a diary, was something he says he wanted to do from very early on. \"During my care home days when I couldn't really express myself very well - I still can't - but I could write about it, it was an outlet for me,\" he says. \"Since I woke up, I've been writing... but for a long time I couldn't record anything.\" Lucas, now 26, has spent years working on his physical recovery and speech. But when he was eventually physically able to record the songs he had been writing himself, he became frustrated by the way his voice had changed. \"It never sounded how I had [it in] my head,\" he says. \"I'm very monotone in how I speak, I struggle to really display emotion.\" And so he turned to AI (artificial intelligence). Now, Lucas is also known as The BTO Kid, and is one of 15 creators from around the world, shortlisted from more than 500 entries, for the inaugural Future Sound Awards - celebrating artificial intelligence in music. While some artists such as will.i.am, David Guetta, Grimes, Timbaland and even Sir Paul McCartney have embraced certain aspects of AI, it can be a controversial subject in the creative industries - with concerns raised by many in the about issues including copyright, human replacement, fakes, and regulation. It was one of the issues behind the Hollywood actors' and writers' strikes in 2023 - and the more recent video game actor strike, which ended in June after nearly a year of industrial action. Despite the criticism, AI isn't going away. Last year was a \"breakout\" year for the technology in music, according to the International Music Summit's latest annual business report, with 60m users using AI software. Lucas says he is a perfect example of how the technology can be used for good. \"I've been able to use AI to express how I'm feeling,\" he says. \"It's been big for me to create [music] that I'm proud of. I can see the arguments [against it], but from my view I know AI helped me create something I couldn't before. I'm not Adele, but I have been able to make something that I'm proud of and that expresses my view point of what's happened to me.\" Read more on AI in the music industry:Will.i.am on embracing AIAI used to help create 'the last Beatles record  'AI is lowering the barriers' BTO stands for Beat The Odds and his shortlisted track is titled AI Gave Me A Voice. \"I pinch myself every day because this just can't be true,\" is the opening line - which he says reflects how far he has come from the moment he woke up and discovered what had happened. \"That comes from reality. I do have moments where I think so much has happened that it must not be true... every line means something to me.\" Lucas, who lives in Nottingham, used the AI-powered music production platform TwoShot to create the track, using prompts on what he wanted for the sound alongside his lyrics, inspired by melodic rap. \"I think we're gonna get quite a lot more people like me that can't record music and have been given a voice through AI,\" he says. \"AI is lowering the barriers to entry for a lot of things.\" Which can be a negative as well as a positive, he acknowledges. \"We'll have to see where it goes.\" Launched by the Fanvue World AI Creator Awards, The Future Sound Awards aim to highlight the ethical use of AI in music, organisers say. Fanvue is a subscription creator platform with more than 180,000 users. Some 15 artists from the US, Europe, Australia and Asia, as well as the UK, have been shortlisted for prizes, and the winners will be announced later in September. Lucas is one of two British creators on the list, alongside Gallis, from Essex. The 31-year-old first dipped his toe into the waters of the music industry about 10 years ago, after joining the urban-pop boy band Mr Meanor, but says the industry was hard and \"it all got a bit too much\". He is now a tattoo artist and fine painter, but continued his songwriting and started to try out AI music production tools about 18 months ago. Read more on AI in the music industry:'Regulate it before we're all finished''It's like saying you can burgle my house unless I ask you not to'Silent album released in AI protest AI has 'made me more creative' As an artist, he says he had his own concerns about AI before he started using it himself, particularly after image generators started becoming prominent online. \"It was stealing the work that I was doing,\" is how he describes his initial feelings. \"But I ended up jumping on board with it and for me personally, it's inspired me so much. It's made me quicker at what I'm doing, it's made me more creative. And I think it's the same with music. I think it's gonna, if anything, grow the industry.\" However, he says he agrees with criticism about the ethics of how some AI models are trained - following controversy about work by human music artists and authors being used without consent. \"And trying to impersonate exactly someone else and using someone else's voice, I don't agree with that at all,\" he adds. Gallis's shortlisted song, Chiropractor emerged from \"friendly competition\" with a community of creators he came across when he moved into AI, trading feedback and ratings. The genre is Trinibad, which he says there isn't enough of \"in the AI world\", and the track is designed to get people dancing. \"I mainly stick to urban music, but I like writing in a lot of different styles,\" he says. \"I've done house songs, I've done UK drill songs, Afrobeats, amapiano. I'm a bit of a vibes man so if it makes me dance and move and smile that's when I really enjoy it.\" Narcis Marincat, head of AI at Fanvue, says the stories behind the selected songs show a \"richness and human emotion\" that appealed to him and other judges. \"The impact of AI in music continues to divide opinion,\" he says. \"But for the first time, via the Future Sound Awards, we're able to show a different perspective on the positive impact of AI in music - uncovering the real people behind the technology and sharing their stories and music.\""
    },
    {
        "title": "Home secretary announces shakeup of family reunion rules for asylum seekers to deter Channel crossings",
        "description": "The home secretary has announced a shakeup of family reunion rules for refugees in a bid to deter small boat crossings.",
        "url": "https://news.sky.com/story/home-secretary-announces-shakeup-of-family-reunion-rules-for-asylum-seekers-to-deter-channel-crossings-13423205",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7008585.jpg?20250901185325",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-01 18:00:00",
        "Headline": "Yvette Cooper says people smugglers are using the promise of family reunion to promote dangerous small boat crossings in the Channel.",
        "Content": " The home secretary has announced a shakeup of family reunion rules for refugees in a bid to deter small boat crossings. Yvette Cooper said people smugglers were using the promise of family reunion to promote dangerous journeys across the Channel. Addressing the House of Commons, Ms Cooper said the government would now suspend new applications under the existing family reunion route for refugees until a new framework had been introduced. Politics latest: Badenoch urged to 'come clean' over university admittance claims She highlighted how refugee families arriving in the UK were seeking homelessness assistance, putting pressure on local authorities that was \"not sustainable\". Ms Cooper told MPs the government would deliver an asylum policy statement later this year, which would set out a new system for family migration, with the aim of having \"some of those changes in place for the spring\". She said it would look at contribution requirements and whether there should be longer periods before newly granted refugees can apply for family reunion. \n                  Reform took advantage of the PM's holiday - and it's clear he's now changed strategy\n                 \n                  Small town tensions: The asylum crisis in Middle England\n                 \n                  'There's something in the air': The deep divides over asylum seekers in Nuneaton\n                 \"Even just before the pandemic, refugees who applied to bring family to the UK did so on average more than one or two years after they had been granted protection, long enough for them to be able to get jobs or find housing, or be able to provide their family with some support,\" she explained. \"In Denmark and Switzerland, currently, those granted humanitarian protection are not able to apply to bring family for at least two years after protection has been granted. But here in the UK now, however, those applications come in on average in around a month after protection has been granted, often even before a newly granted refugee has left asylum accommodation. \"As a consequence, refugee families who arrive are far more likely to be seeking homelessness assistance. \"And some councils are finding that more than a quarter of their family homelessness applications are linked to refugee family reunion. That is not sustainable.\" The home secretary continued: \"Therefore, we are bringing forward new immigration rules this week to temporarily suspend new applications under the existing dedicated refugee family reunion route. \"Until the new framework is introduced, refugees will be covered by the same family migration rules and conditions as everyone else.\" The move comes as the government struggles to cope with the continued arrival of small boats in the Channel, which have reached 29,003 - the highest on record for this point in a year. There is palpable anger in certain communities at the use of hotels to house asylum seekers, most notably in Epping, Essex, where there were protests at the weekend after the government successfully overturned a temporary injunction which would have blocked asylum seekers from staying at the Bell Hotel. The protests prompted Nigel Farage, the leader of Reform UK, to warn there was a \"genuine threat to public order\". Read more:Tories call for investigation into Angela Rayner over tax affairsWhat is the UK-France migrant returns deal? He has promised to deport up to 600,000 asylum seekers in the first parliament of a Reform UK government if he wins the next election - a plan opponents have criticised as unworkable. The home secretary said the government was working \"at pace\" to end the use of all asylum hotels, and said they would be closed \"for good\" under a \"controlled, managed and orderly programme - driving down inflow into the asylum system, clearing the appeals backlog... and continuing to increase returns\". She added: \"I understand and agree with local councils and communities who want the asylum hotels in their communities closed because we need to close all asylum hotels, and we need to do so for good, but that must be done in a controlled and orderly manner, and not through a return to the previous government's chaos that led to the opening of hotels in the first place.\" 'Things are getting worse' In response, shadow home secretary Chris Philp said Channel crossings were up 38% on the previous year, adding: \"Things are not getting any better, they are getting worse.\" He said \"tweaking the family reunion rules is not enough\" and referred again to the Tories' Rwanda scheme, which Labour scrapped on winning office."
    },
    {
        "title": "Reform took advantage of the PM's holiday - and it's clear he's now changed strategy",
        "description": "Immigration was the first thing on the government's agenda to kick off the first week back from recess, and they wanted you to know it.",
        "url": "https://news.sky.com/story/yvette-cooper-attempts-to-seize-the-limelight-from-reform-on-immigration-13423406",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-farage_6927488.jpg?20250525233805",
        "type": "UK",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-01 21:00:00",
        "Headline": "After a summer dominated by Reform turning up the heat on immigration, it's finally hit home for the government that the public want proof of change, not just rhetoric.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Immigration was the first thing on the government's agenda to kick off the first week back from recess, and they wanted you to know it. The home secretary gave an update to the House, announcing a shakeup of family reunion rules for asylum seekers, even before some backbenchers had made it back to parliament from their break. Facing criticism for being on the back foot after a summer of protest outside asylum hotels, they were keen to defend their record and get back on track - but is it too late? It's a clear nod to the political void Reform UK has seized on while the prime minister has been on holiday. Last week, Nigel Farage unveiled his party's mass deportation policy - though the issue of women and children still seems to be worked out. But perhaps none of that matters as voters overwhelmingly believe Reform cares about this issue - and as Chris Philp, the shadow home secretary, pointed out on Monday, voters have lost confidence in the government somewhat to solve what many see as an immigration crisis on their doorstep. So it's clear the strategy has changed from the government. Read more:Starmer's 'Mr Fixit' is likely to be a recipe for conflictTories call for investigation into Angela Rayner  Gone are the bold slogans of \"smashing the gangs\" and instead, detail and policy was given on Monday. It was nothing new, but more substance on what the government has done and where they want to move to. Even controversially, reassessing their relationship with the European Convention on Human Rights (ECHR). The biggest update though, was on their one-in-one-out policy agreement with France, which will now set to start returns later this month. It's finally hit home for the government that the public want proof not just rhetoric, and they want to know crucially when they will start to see change. But the fightback, the reset, whatever the government wants to call it, will only make a difference once that finally starts to work."
    },
    {
        "title": "Joe Bugner: Former British heavyweight boxing champion, who fought Muhammad Ali, dies",
        "description": "Joe Bugner, the former British heavyweight boxing champion, who challenged Muhammad Ali for the world title, has died aged 75.",
        "url": "https://news.sky.com/story/joe-bugner-former-british-heavyweight-boxing-champion-who-fought-muhammad-ali-dies-13423208",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-joe-bugner-boxing_7008745.jpg?20250901214711",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-01 15:00:00",
        "Headline": "The Hungary-born fighter held the British title twice and was a three-time European champion, taking US legends Muhammad Ali and Joe Frazier the distance and ending the career of British champion Henry Cooper.",
        "Content": "Joe Bugner, the former British heavyweight boxing champion, who challenged Muhammad Ali for the world title, has died aged 75. Bugner, who also held the European and Commonwealth heavyweight crowns, died at a care home in Brisbane, Australia, the British Boxing Board of Control (BBBC) said. Announcing his death \"with great sadness\", the board said it \"passes on its condolences to Joe's family\". Over a 32-year career beginning in 1967, the fighter won 69 of his 83 contests - 41 inside the distance - with 13 defeats and one draw. He fought Ali twice, losing on points both times, including when challenging the American legend for the world heavyweight title in Kuala Lumpur in 1975. He was born in Hungary in 1950 before his family moved to the UK, after fleeing amid the 1956 Soviet invasion. Bugner forced Henry Cooper into retirement after a controversial points win in 1971, capturing the British, Commonwealth and European crowns in the process. \n                  Australia's social media ban can be enforced 'effectively', official report finds\n                 \n                  Three Scottish brothers set new world record for 9,000-mile row across Pacific Ocean\n                 \n                  Manhunt after two police officers shot dead and third seriously injured in Australia\n                 It was one of two British title wins, while he was also a three-time European champion. His victory over Cooper by a quarter of a point at a time when fights were counted in fractions, meant he struggled for acceptance in his adopted country. He lost to Joe Frazier, another legend of the ring, on points, having taken him the distance in 1973, before a 1987 stoppage defeat to Frank Bruno led to his retirement from the ring. Eight years later, money troubles forced him into a comeback, taking the Australian title as well as the lightly-regarded WBF (World Boxing Federation) belt, aged 48. He retired at 49 after beating US fighter Levi Billups on Australia's Gold Coast in 1999. Bugner was affectionately known as 'Aussie Joe' in the last few years as a boxer, having been warmly received in Australia in a manner he had been unaccustomed to during his career in Britain. Read more on Sky News:Queen 'fought off attacker with shoe'Hollywood star working in a barTransfer deadline day - latest Bruno said in a post on X it was \"a sad day for boxing\", calling Bugner a \"character\" who \"played Mr bad guy\" before their fight. Promoter Frank Warren wrote on X that Bugner was \"a great man who will be missed\". After giving up the sport, Bugner was involved within the film industry and appeared on I'm A Celebrity...Get Me Out Of Here! in 2009."
    },
    {
        "title": "Mother of woman killed by boyfriend 'absolutely betrayed' by justice system",
        "description": "The mother of a woman killed by her boyfriend says she feels \"completely betrayed\" by the justice system after he received a hospital order for manslaughter.",
        "url": "https://news.sky.com/story/mother-of-woman-killed-by-boyfriend-absolutely-betrayed-by-justice-system-13423319",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-westcarr-sabaroche_7008607.jpg?20250901205747",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-01 18:02:00",
        "Headline": " Gogoa Lois Tape, 28, was detained under the Mental Health Act for strangling 25-year-old Kennedi Westcarr-Sabaroche in east London last year and driving her body around before confessing the killing.",
        "Content": "The mother of a woman killed by her boyfriend says she feels \"completely betrayed\" by the justice system after he received a hospital order for manslaughter. Gogoa Lois Tape, 28, has been detained under the Mental Health Act after strangling 25-year-old Kennedi Westcarr-Sabaroche in Hackney, east London, in April last year. After killing her, he drove around with her body before later confessing to his brother. The defendant was initially charged with murder, but prosecutors accepted a guilty plea to manslaughter due to diminished responsibility. The two met when they were teenagers in college about 10 years ago and have a daughter. Around 40 of Ms Westcarr-Sabaroche's loved ones attended the sentencing at Inner London Crown Court, with some leaving the courtroom as the defence read statements from the defendant's family describing him as a loving person before his mental health declined. Judge Freya Newbery issued Tape a hospital order under Section 37 of the Mental Health Act, along with a Section 41 restriction, allowing for his indefinite detention. \n                  The red tape keeping these flats empty - and threatening Labour's vital new homes target\n                 \n                  Police ask for help with unsolved murder more than 50 years ago\n                 \n                  Schools 'left to pick up the pieces' from 'crumbling public services', says teaching union\n                 She said he was an \"undiagnosed schizophrenic\" at the time of the attack, suffering from \"paranoid and persecutory delusions\" that severely affected his judgement and self-control. System 'failed us' Linda Westcarr, the victim's mother, said after the hearing she was \"devastated\" at the outcome and that \"although I don't dismiss mental health and the challenges and struggles that people face, we still feel justice has not been served\". \"The system has failed us in many ways - failed to support us, failed to explain to us the decisions that they have made,\" she said. \"We haven't been consulted with we've been dictated to. That needs to change.\" The family have demanded an urgent review of Tape's sentence, and a meeting with the prime minister, the home secretary and the lord chancellor and director of public prosecutions \"to answer for these failures.\" 'I stand with the family' Emma Webber, whose son Barnaby was killed by Valdo Calocane in Nottingham in 2023, spoke out after he was given a hospital order for admitting manslaughter due to diminished responsibility in the triple stabbing. She said: \"I stand with Kennedi's family not just in grief, but in outrage.\" Read more from Sky News:Vicar involved in body modification ring jailed for three yearsMan arrested on suspicion of murder after woman falls from flats A review of the Crown Prosecution Service's (CPS) handling of Calocane's case concluded that accepting the manslaughter plea was justified, but highlighted areas where the case could have been better managed. The report urged ministers to revisit long-standing Law Commission proposals to introduce a three-tier system for homicide charges-first-degree murder, second-degree murder, and manslaughter-a reform also recommended by Chief Inspector Anthony Rogers of His Majesty's CPS Inspectorate. Julian Hendy, director of Hundred Families, a charity which supports families bereaved by people with mental health problems, said defendants sentenced to a hospital order can often return to the community on licence after five to 10 years."
    },
    {
        "title": "Premier League flexes its financial muscle in record-breaking transfer window",
        "description": "The transfer window was a show of strength in a record-breaking summer across the Premier League.",
        "url": "https://news.sky.com/story/premier-league-flexes-its-financial-muscle-in-record-breaking-transfer-window-13423441",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-premier-league-transfer-window_7008819.jpg?20250901234058",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-09-01 21:42:00",
        "Headline": "More than half of the record spend flowed between Premier League clubs rather than abroad, and even though the feared threat from Saudi Arabia has not materialised, it nonetheless contributed to some of the big deals.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The transfer window was a show of strength in a record-breaking summer across the Premier League. The totaliser crept over £3bn in spending, with more than half of it flowing among the 20 clubs rather than having a redistributing effect across Europe. The start of new Premier League TV deals - the biggest individual source of income being from Sky News' parent company Comcast - provides certainty for the next four years, while rival leagues can struggle to sell rights. And the feared threat from Saudi Arabia has not materialised. It is an attractive and lucrative destination for some players, but not yet the ultimate destination. But the kingdom has still influenced this transfer window. Let's start with Newcastle, four years into their ownership by the Saudi sovereign wealth fund. Having secured a return to the Champions League, bringing UEFA riches, this was the summer to grow rather than lose talent to rivals. But the Premier League's pecking order became clear when Alexander Isak pushed for a move to Liverpool and rejected bids that did not deter his ambitions. Player power won out. The 25-year-old striker was able to withdraw himself from the squad, miss the opening three matches of the season, and put out a statement claiming promises had been broken by the Magpies. Read more: Isak completes £125m Liverpool move  Liverpool 'loading up on talent' And so he held on until deadline day, biding his time, sitting it out, and standing firm. Newcastle folded, accepting £125m - £20m lower than their apparent valuation. Breaking the British record fee was Liverpool's American ownership flexing financial muscle like never before. The Premier League champions allowed manager Arne Slot to build from a position of strength. This was the second time they broke the record in this window after bringing in another forward, Florian Wirtz, in a £116m deal. More than £400m in reinforcements arrived at Anfield in a matter of weeks. Former Liverpool managing director Christian Purslow told Sky Sports: \"Liverpool are making hay while the sun shines, going for it. Really loading up on talent. \"Other clubs should be fearful and respectful of the way [Fenway Sports Group] are running their club.\" The Isak deal weakened their Champions League rivals from the North East after banking £57m from another club owned by the Public Investment Fund when Darwin Nunez was offloaded to Saudi. And PIF funded Chelsea's summer spending spree in less obvious ways. The Blues did negotiate a £44m package with PIF-backed Al Nassr deal for Joao Felix, recouping the fee paid just a year earlier. But then there was the £90m prize money collected for winning the new FIFA Club World Cup - a competition bankrolled by PIF subsidiaries. Where does this leave Newcastle? Still spending around £250m. Players and Liverpool couldn't get all their way this summer, with Marc Guehi forced to stay at Crystal Palace after the FA Cup winners failed to secure a replacement for the England centre-back. The late drama was just the latest of the summer transfer window's twists and turns. Read more from Sky News:Heavyweight champion diesAsylum seeker rules to changeUS Open cap-grabber apologises Both Arsenal and Manchester United also spent more than £200m each. The Gunners spent big in pursuit of a title that's eluded them since 2004, while the Red Devils are just trying to get back into the Champions League. It added up to a new record total outlay that comfortably eclipsed the previous Premier League record of £2.46bn from 2023. The £3bn is more than the rest of Europe combined, showing both where the power is in world football and why the Premier League is the one the world wants to watch."
    },
    {
        "title": "Afghanistan earthquake kills hundreds and destroys villages - all we know so far",
        "description": "More than 800 people have been killed and at least 2,800 others injured after an earthquake hit eastern Afghanistan, according to Taliban state officials. ",
        "url": "https://news.sky.com/story/afghanistan-earthquake-kills-hundreds-and-destroys-villages-all-we-know-so-far-13422896",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-afghanistan-earthquake_7008004.jpg?20250901081126",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-01 07:07:00",
        "Headline": "One of the world's poorest countries has been hit by a deadly 6.0 quake, completely destroying several villages.",
        "Content": " More than 800 people have been killed and at least 2,800 others injured after an earthquake hit eastern Afghanistan, according to Taliban state officials.  The quake hit the country's rugged northeastern province of Kunar, near the Pakistan border, at roughly midnight on Sunday, destroying several villages, officials said. Rescuers are continuing to work in several districts of the mountainous province where the quake hit, while officials in the capital city of Kabul have warned the number of casualties could rise. Afghan disaster latest updates Here's what we know so far. What happened?  A 6.0 quake hit Kunar at around 11.47pm local time (8.17pm UK time) on Sunday. The quake's epicentre was near Jalalabad, Nangarhar province, at a depth of just five miles (8km). Shallower quakes such as these tend to cause more damage. Jalalabad is situated about 74 miles (119km) from Kabul. It is considered a remote and mountainous area. A second earthquake struck in the same province about 20 minutes later, with a magnitude of 4.5 and a depth of 6.2 miles (10km). This was later followed by a 5.2 earthquake at the same depth. Homes of mud and stone were levelled by the quake, with deaths and injuries reported in the districts of Nur Gul, Soki, Watpur, Manogi and Chapadare, according to the Kunar Disaster Management Authority. The first quake hit 17 miles east-northeast of the city of Jalalabad in Nangarhar province, the US Geological Survey said. Jalalabad is a bustling trade city due to its proximity to a key border crossing between Afghanistan and Pakistan. It has a population of around 300,000 people, according to the municipality, but its metropolitan area is believed to be much larger. Most of its buildings are low-rise constructions predominantly made from concrete and brick, though its outer areas include homes built of mud bricks and wood. Number of casualties high and area difficult to access, officials say Sharafat Zaman, a spokesman for Afghanistan's ministry of public health, said: \"Rescue operations are still under way there, and several villages have been completely destroyed. \"The figures for martyrs and injured are changing. \"Medical teams from Kunar, Nangarhar and the capital Kabul have arrived in the area.\" He said many areas have not been able to report casualty figures and that \"numbers were expected to change\" as deaths and injuries are reported.  Zabihullah Mujahid, a spokesman for the Islamic Emirate of Afghanistan, said: \"Sadly, tonight's earthquake has caused loss of life and property damage in some of our eastern provinces. \"Local officials and residents are currently engaged in rescue efforts for the affected people. Support teams from the centre and nearby provinces are also on their way.\" According to earlier reports, 30 people were killed in a single village, the health ministry said. \"The number of casualties and injuries is high, but since the area is difficult to access, our teams are still on site,\" said health ministry spokesperson Sharafat Zaman. The Afghan Red Crescent said its officials and medical teams \"rushed to the affected areas and are currently providing emergency assistance to impacted families\". Quake measures slightly lower than the country's deadliest disaster Afghanistan is prone to earthquakes, particularly in the Hindu Kush mountain range, where the Indian and Eurasian tectonic plates meet. The country is also one of the world's poorest, having suffered decades of conflict, with poor infrastructure leaving it particularly vulnerable to natural disasters. A magnitude 6.3 earthquake and strong aftershocks struck Afghanistan on 7 October 2023. The country's Taliban government said at least 4,000 people had been killed, but the United Nations said the number of people killed was around 1,500. The 2023 earthquake is considered the deadliest natural disaster to hit Afghanistan in recent memory.  A series of other earthquakes in the country's west killed more than 1,000 people last year. Humanitarian officials and locals many villages are still recovering and living in temporary structures after the previous disasters. International correspondent Earthquakes represent a constant danger in Afghanistan, a country that sits across three geological faultlines.\n But the people of this impoverished nation are also vulnerable in a number of other ways.\n Since the Taliban regained control in 2021, the international community has withdrawn much of the financial support, which formed the bulk of government spending in Afghanistan.\n Even humanitarian aid, which generally bypasses government institutions, has shrunk substantially - from $3.8bn (£2.8bn) in 2022 to $767m (£566m) this year. The US government, through its international development arm USAID, provided 45% of all assistance granted to Afghanistan last year, but those sums have been slashed by the Trump administration.\n The UK, along with France, Germany, Sweden, and others, has also made deep cuts to humanitarian aid. As a consequence, hundreds of hospitals and local health clinics in the country have been shut this year and related medical posts have been lost.\n This funding crisis comes as the country tries to absorb millions of people who fled Afghanistan when the Taliban took power. More than two million in fact, have come back this year, with Pakistan and Iran taking measures to force their return. On arrival, they discover a country where more than half the population requires urgent humanitarian assistance, according to the UN, with millions suffering from acute food insecurity. Large parts of northern Afghanistan are suffering a lengthy drought.\n Destructive earthquakes are an unfortunate fact of life in the country. This most recent rupture near the city of Jalalabad represents the third major quake in the past four years. But the catastrophe is compounded in a nation that ranks as one of the poorest – and most desperate - on Earth. Disaster adds to 'perfect storm of problems' for Afghanistan The earthquake is a \"perfect storm\" in a country that is already suffering a \"multiplicity of crises,\" the United Nations High Commissioner for Refugees has told Sky News. Filippo Grandi said the situation in the country was \"very tragic\" and added: \"We have very little information as of yet, but already, reports of hundreds of people killed and many more made homeless.\" Afghanistan already has finite resources, as it is one of the world's poorest countries and is also war-torn, having been taken over by the Taliban in 2021 when foreign forces withdrew after years of fighting. The withdrawal triggered a cut to the international funding that formed the bulk of government finances in Afghanistan. Humanitarian aid, aimed at bypassing political institutions to serve urgent needs, has shrunk to $767m (£567m) this year, down from $3.8bn (£2.08bn) in 2022, according to Reuters, yet the United Nations estimates more than half the population is in urgent need of aid. Mr Grandi said Afghanistan is also suffering from a \"big drought\", while Iran has \"sent back almost 2 million people\" and Pakistan \"threatens to do the same\".  \"It's extremely difficult to mobilise resources because of the Taliban. So it's a perfect storm,\" he added. \"And this earthquake, likely to have been quite devastating, is going to just add to the misery.\" He appealed to \"all those who can help to please do that\". Emergency relief hampered by lack of women's rights, charity warns Diplomats and aid officials say crises elsewhere in the world, along with donor frustration over the Taliban's policies towards women, have spurred the cuts in funding. Oxfam's chief executive Halima Begum told Sky News: \"Emergency relief in Afghanistan, either over the long term or even during this emergency, is a really difficult process because women's rights are not upheld very well in this country.\" She said providing aid \"presents a very difficult and complex challenge for us\" and that the charity had to pull out of the country \"for reasons to do with operational difficulty\". Oxfam is working through partner agencies such as the British Red Cross, \"trying to figure out how best we can get support to what you can see are very difficult, mountainous regions\", she said. She added: \"All of the NGOs [non-governmental organisations] and charities will be getting together, figuring out who is present there. \"And of course, there's an ongoing conversation and monitoring with the Disasters Emergency Committee to just see where the death toll goes and what that response level should be.\" \"So far, no foreign governments have reached out to provide support for rescue or relief work,\" a spokesperson of Afghanistan's foreign office said. A spokesperson for China's foreign ministry said the country was ready to provide disaster relief assistance \"according to Afghanistan's needs and within its capacity\". In a post on X, UN Secretary General Antonio Guterres said its mission in Afghanistan was preparing to help those in areas devastated by the quake."
    },
    {
        "title": "Chinese, Russian and Indian leaders seek to show unity and push for new world order in Beijing meeting",
        "description": "Chinese, Russian and Indian leaders hope their meeting in Beijing this week projects unity and helps usher in a new world order.",
        "url": "https://news.sky.com/story/chinese-russian-and-indian-leaders-seek-to-show-unity-and-push-for-new-world-order-in-beijing-meeting-13423244",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-china-summit-vladimir-putin_7008086.jpg?20250901103435",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-09-01 15:47:00",
        "Headline": "The threesome bromance flowering this week is not all that it seems and there are cracks that a competent US administration could seek to exploit.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Chinese, Russian and Indian leaders hope their meeting in Beijing this week projects unity and helps usher in a new world order. They want to offer an alternative to American superpower hegemony. And with Donald Trump taking a wrecking ball to the old world order, they believe this is their moment. But don't get carried away. Much of this is kabuki theatre, long on posture and short on substance. Take Russian leader Vladimir Putin. He hopes the event puts Russia on a par with China in the eyes of the world, in turn validating his war in Ukraine and propping up his standing back home. But in reality, Russia is on the way to becoming a vassal state to Beijing. Trade between the two countries has shot up by two thirds since the start of the Ukraine war, most of it on China's terms.  China gets Russian oil, on the cheap, because sanctions stop Putin selling it elsewhere and in return Russia buys a lot of Chinese goods. China has Russia over a barrel literally and is taking full advantage. China's leader Xi Jinping says the threesome should see themselves as \"partners not rivals\". But Indian leader Narendra Modi knows economic frictions between the two countries and border disputes undermine all that. \n                  China-led SCO economic summit is a show designed to rattle the West\n                 \n                  How Moscow and its allies are trying to display their immunity to Western pressure\n                 \n                  China and India discuss disputed border at key summit - as Putin talks about Trump\n                 And then there's tension between China and Russia over North Korea. North Korea is on Chinese turf, in mafia terms, but Putin has been muscling in increasingly cosy with the hermit kingdom's leader Kim Jong Un. So the threesome bromance flowering this week is not all that it seems. There are cracks that a competent US administration could seek to exploit. The Trump team may not do so based on current form. It is letting the Ukraine war continue instead of applying the kind of pressure on Russia its allies believe will bring it to an end. Read more from Sky News:China-led economic summit a show designed to rattle the WestRussia-Ukraine war reshapes global trade and forged new alliances The longer the war goes on, the stronger the ties between Moscow, Beijing and Pyongyang. And the more divisions it seems in the western alliance. Instead of courting the only democracy in the troika India, Trump has worked hard to alienate, imposing 50 percent tariffs. The one winner in all this is China, the rising power the Trump administration says it's most worried about. Xi Jinping may say he wants a multipolar world. In reality, he wants the world reordered to suit Chinese interests. And nothing this week will deter him from pursuing that end."
    },
    {
        "title": "Russia responds to GPS jamming accusations - but such instances are expected to escalate",
        "description": "Bulgarian authorities have said they suspect Russia of jamming the GPS system of the jet carrying the EU Commission president on Sunday.",
        "url": "https://news.sky.com/story/russia-responds-to-gps-jamming-accusations-but-such-instances-are-expected-to-escalate-13423288",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ursula-von-der-leyen_7008577.jpg?20250901185009",
        "type": "World",
        "Author": "Siobhan Robbins",
        "Date Published": "2025-09-01 16:42:00",
        "Headline": "The EU Commission president's plane has allegedly been targeted as the bloc prepares to impose more sanctions on Moscow.",
        "Content": "\n          Europe correspondent\n              @SiobhanRobbins\n Bulgarian authorities have said they suspect Russia of jamming the GPS system of the jet carrying the EU Commission president on Sunday. If someone deliberately jams your jet's GPS, it's fair to assume they are trying to threaten or intimidate you. The Kremlin hasn't responded to Sky News but its spokesperson told the Financial Times \"your information is incorrect\", when asked about the allegations. However, the timing of the alleged interference is interesting. It happened as the EU is preparing its 19th sanctions package on Russia, and European leaders are discussing what security guarantees they can offer Ukraine while also trying to persuade the US to get tough. It also came as EU Commission chief Ursula von der Leyen was on a four-day tour of member states that border or are near to Russia. She was seeing \"first-hand the everyday challenges of threats coming from Russia and its proxies\", according to her spokesperson. These threats are part of the hybrid war that numerous European leaders, generals and the NATO chief have repeatedly warned about since Russia invaded Ukraine in 2022. The hybrid attacks they accuse Moscow of carrying out range from cyber attacks to suspected attempts to spy on NATO bases. I remember Lieutenant General Andre Bodemann, head of Germany's homeland defence command, vividly laying out some of the challenges being faced when I interviewed him last year. \"We have a lot of hybrid threats: that's fake news, disinformation, cyber attacks, espionage and sabotage... We see drones over my operations cell, for example, we even saw explosives in the vicinity of the NATO pipeline,\" he said. These types of alleged attacks have continued and are expected to escalate as the EU puts more pressure on Moscow, according to experts. Last week, a security source told me that they were aware of several unidentified drones monitoring NATO members' troop movements as they travelled through eastern Germany and the state of Thuringia to the eastern front to transport ammunition to Ukraine. Read more from Sky News:Who is messing with GPS signals - and why? They suspect this was part of an intelligence gathering exercise by the Russians as the focus was on movements by NATO nations. It follows similar allegations published by the New York Times that Russian drones were flying over US weapons routes in Germany. The Kremlin has denied these and all the previous allegations that it's behind hybrid attacks. Asked about the New York Times report, Dmitry Peskov, Russian President Vladimir Putin's press secretary, told journalists the Kremlin had not had time to read the story closely. \"But it's hard to imagine, because then the Germans would have seen it clearly, and they would hardly have kept quiet. So, of course, all this looks more like another newspaper fake,\" he said. However, the chief of domestic intelligence for the state of Thuringia, Stephan Kramer, told me his team were taking the reports seriously. So, with these allegations in mind, plus the fact the GPS-jamming happened as the EU is trying to put extra pressure on the Kremlin, many will understand why Bulgaria has said it suspects Russia of being involved."
    },
    {
        "title": "Russia suspected of 'blatant interference' after GPS of EU Commission president's plane jammed over Bulgaria",
        "description": "A plane carrying European Commission President Ursula von der Leyen suffered GPS jamming as a result of suspected Russian interference, an EU spokesperson has confirmed to Sky News.",
        "url": "https://news.sky.com/story/russia-suspected-of-blatant-interference-after-gps-of-eu-commission-presidents-plane-jammed-over-bulgaria-13423043",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ursula-von-der-leyen_7008164.jpg?20250901123444",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-01 11:08:00",
        "Headline": "The aircraft carrying Ursula von der Leyen was hit by GPS jamming in a suspected Russian operation, an EU spokesperson tells Sky News.",
        "Content": "A plane carrying European Commission President Ursula von der Leyen suffered GPS jamming as a result of suspected Russian interference, an EU spokesperson has confirmed to Sky News. The attack disabled GPS navigation services at a Bulgarian airport and forced the aircraft to land using paper maps, the Financial Times reported. The aircraft, which was flying to Plovdiv on Sunday afternoon, was deprived of electronic navigational aids as it approached the city's airport, the newspaper said. It circled the airport for an hour before the pilot decided to manually land the plane using paper maps. Bulgaria issued a statement saying \"the satellite signal used for the aircraft's GPS navigation was disrupted\". \"As the aircraft approached Plovdiv Airport, the GPS signal was lost,\" the statement added. An EU spokesperson told Sky News on Monday: \"We can confirm there was GPS jamming but the plane landed safe. \"We have received information from Bulgarian authorities that they suspect this blatant interference was carried out by Russia. \"We are well aware that threats and intimidation are a regular component of Russia's hostile actions. \"This will further reinforce our unshakable commitment to ramp up our defence capabilities and support for Ukraine.\" Read more from Sky News:Who is messing with GPS signals - and why? Ms Von der Leyen, a fierce critic of Russian President Vladimir Putin and Moscow's war in Ukraine - is on a four-day tour of the European Union's nations bordering Russia and its ally Belarus. \"This incident underlines the urgency of the president's current trip to frontline member states, where she has seen first hand the every day threats from Russia and its proxies,\" the spokesperson added. \"The EU will continue to invest in defence and in Europe's readiness.\" Russia has denied involvement in the failure of GPS navigation systems on the plane carrying Ms Ursula von der Leyen during her trip to Bulgaria on Monday. \"Your information is incorrect,\" Kremlin spokesman Dmitry Peskov told the Financial Times, after reports said the pilots had to rely on paper maps to land safely at Plovdiv airport. Arianna Podesta, the European Commission's spokesperson, said Ms Von der Leyen would continue her planned tour. It includes visits to arms factories and border installations."
    },
    {
        "title": "Historic al Nuri mosque reopens eight years after it was destroyed by IS",
        "description": "The historic al Nuri mosque has been reopened in the heart of Mosul's Old City in Iraq, eight years after it was destroyed by Islamic State (IS) militants.",
        "url": "https://news.sky.com/story/historic-al-nuri-mosque-with-iconic-minaret-reopens-eight-years-after-it-was-destroyed-by-is-13423368",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mosque-al-nuri-iraq_7008707.jpg?20250901205829",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-01 19:17:00",
        "Headline": "The mosque was destroyed in 2017 after the IS militant group detonated explosives at the site as it faced defeat in a battle with Iraqi military forces.",
        "Content": "The historic al Nuri mosque has been reopened in the heart of Mosul's Old City in Iraq, eight years after it was destroyed by Islamic State (IS) militants. The mosque was where then-IS leader Abu Bakr al Baghdadi declared the so-called \"caliphate\" by delivering a Friday sermon and leading prayers in 2014. Three years later, IS later destroyed the site by detonating explosives as it faced defeat in a battle with Iraqi military forces for control of Mosul. The leaning al Hadba minaret of the mosque had stood as a famous landmark for 850 years before the blasts. However UNESCO - the UN's scientific, educational and cultural organisation - later worked alongside Iraqi heritage and Sunni religious authorities to reconstruct the minaret using traditional techniques and materials salvaged from the rubble. UNESCO raised $115m (£85m) for the reconstruction project, with large shares coming from the United Arab Emirates and the European Union. Prime Minister Mohammed Shia al Sudani, who presided over the official reopening of the mosque on Monday, said the site's reconstruction \"will remain a milestone, reminding all enemies of the heroism of Iraqis, their defence of their land, and their rebuilding of everything destroyed by those who want to obscure the truth\". \n                  President Bush determined to 'rid world of evil-doer Saddam Hussein', new records reveal\n                 \n                  Sixty-one dead and others missing after shopping centre fire in eastern Iraq city of Kut\n                 \n                  Iraq's delicate balancing act - where Iran-aligned militia have vowed to attack Americans\n                 \"We will continue our support for culture, and efforts to highlight Iraqi antiquities, as a social necessity, a gateway to our country for the world, an opportunity for sustainable development, and a space for youth to innovate,\" he said. At its peak, IS ruled an area half the size of the United Kingdom in Iraq and Syria and was notorious for its brutality. It beheaded civilians and enslaved and raped thousands of women from the Yazidi community, one of Iraq's oldest religious minorities. Read more from Sky News:Chinese, Russian and Indian leaders seek to show unityMedia groups unite against Israeli attacksMore than 800 killed in Afghanistan earthquake In addition to the mosque, war-damaged churches were rebuilt as part of the reconstruction project, aiming to preserve the heritage of the city's shrinking Christian population. Mr Sudani said Mosul embraces all of its communities and \"embodies all the characteristics of Iraq's diverse society\". UN investigators have said IS militants committed war crimes against Christians in Iraq, including seizing their property, engaging in sexual violence, enslavement, forced conversions and destruction of cultural and religious sites. Most of Mosul's small population of Christians fled when IS launched its offensive in 2014. In 2003, Mosul's Christian population stood at around 50,000. Now, fewer than 20 Christian families remain as permanent residents in the city, although some who resettled in the semi-autonomous Kurdish area of northern Iraq still return to Mosul for church services. The reconstruction project in Mosul could serve as a model for restoring other cultural sites in war-torn areas - including neighbouring Syria, which is starting to emerge from nearly 14 years of civil war after the fall of former president Bashar Assad last year."
    },
    {
        "title": "'Stop killing journalists in Gaza': Media groups unite against Israeli attacks",
        "description": "Media organisations from across the world have renewed calls for the killing of journalists in Gaza to stop - warning there will \"soon be no one left to keep you informed\".",
        "url": "https://news.sky.com/story/stop-killing-journalists-in-gaza-media-groups-unite-against-israeli-attacks-13422993",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vigil-nuj-gaza-journalists_7003049.jpg?20250827205028",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-01 10:00:00",
        "Headline": "More than 200 journalists have been killed in Gaza since October 2023, according to campaign groups - while foreign media groups have been denied free access to report on the conflict.",
        "Content": "Media organisations from across the world have renewed calls for the killing of journalists in Gaza to stop - warning there will \"soon be no one left to keep you informed\". The campaign is also demanding foreign media is allowed free access to Gaza and an \"end to the impunity for crimes perpetrated by the Israeli army\" against Palestinian journalists. Reporters Without Borders (RSF) and Avaaz, a non-profit organisation which promotes global activism, said hundreds of media groups in more than 50 countries were supporting its demands. They included the emergency evacuation of journalists wanting to leave Gaza - and for governments to help Palestinian media seeking to leave the region. RSF said 220 journalists had been killed in Gaza since October 2023 by the Israeli army, which has previously insisted its forces do not target the media. But in recent attacks, six media workers were killed on 10 August while five journalists died just over a fortnight later. RSF director general Thibaut Bruttin said: \"At the rate journalists are being killed in Gaza by the Israeli army, there will soon be no one left to keep you informed. \"This campaign calls on world leaders to do their duty: stop the Israeli army from committing these crimes against journalists, resume the evacuation of the journalists who wish to leave Gaza, and ensure the foreign press has independent access to the Palestinian territory.\" Journalism industry trade magazine and website, Press Gazette, warned that more deaths of media workers would \"not only plunge the region into darkness, they will send a message out to conflict zones around the world that journalists are fair game for the military\". The US-based Committee To Protect Journalists said there were 21 cases where journalists were targeted because of their profession - and described these killings as \"murder\".  Read more:'Israel is certainly killing a lot of journalists'Journalists demand action from PM over Gaza'Israel silences more crucial reporting voices'  A month ago, more than 100 journalists, photographers and war correspondents signed a petition demanding \"immediate and unsupervised foreign press access to the Gaza Strip\". And in June, the managing director of Sky News, Jonathan Levy, joined the ongoing calls for international journalists to be allowed in and out of Gaza. \"The ongoing denial of access to Gaza feels much less about the safety of journalists and more about preventing proper scrutiny and accountability of the desperate situation there,\" he wrote. Levy added there was \"a war on truth\" and this was \"at odds with Israel's proud and oft-repeated claim to be the Middle East's only democracy and it should not be allowed to stand\"."
    },
    {
        "title": "Joe Bugner: Former British heavyweight boxing champion, who fought Muhammad Ali, dies",
        "description": "Joe Bugner, the former British heavyweight boxing champion, who challenged Muhammad Ali for the world title, has died aged 75.",
        "url": "https://news.sky.com/story/joe-bugner-former-british-heavyweight-boxing-champion-who-fought-muhammad-ali-dies-13423208",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-joe-bugner-boxing_7008745.jpg?20250901214711",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-01 15:00:00",
        "Headline": "The Hungary-born fighter held the British title twice and was a three-time European champion, taking US legends Muhammad Ali and Joe Frazier the distance and ending the career of British champion Henry Cooper.",
        "Content": "Joe Bugner, the former British heavyweight boxing champion, who challenged Muhammad Ali for the world title, has died aged 75. Bugner, who also held the European and Commonwealth heavyweight crowns, died at a care home in Brisbane, Australia, the British Boxing Board of Control (BBBC) said. Announcing his death \"with great sadness\", the board said it \"passes on its condolences to Joe's family\". Over a 32-year career beginning in 1967, the fighter won 69 of his 83 contests - 41 inside the distance - with 13 defeats and one draw. He fought Ali twice, losing on points both times, including when challenging the American legend for the world heavyweight title in Kuala Lumpur in 1975. He was born in Hungary in 1950 before his family moved to the UK, after fleeing amid the 1956 Soviet invasion. Bugner forced Henry Cooper into retirement after a controversial points win in 1971, capturing the British, Commonwealth and European crowns in the process. \n                  Australia's social media ban can be enforced 'effectively', official report finds\n                 \n                  Three Scottish brothers set new world record for 9,000-mile row across Pacific Ocean\n                 \n                  Manhunt after two police officers shot dead and third seriously injured in Australia\n                 It was one of two British title wins, while he was also a three-time European champion. His victory over Cooper by a quarter of a point at a time when fights were counted in fractions, meant he struggled for acceptance in his adopted country. He lost to Joe Frazier, another legend of the ring, on points, having taken him the distance in 1973, before a 1987 stoppage defeat to Frank Bruno led to his retirement from the ring. Eight years later, money troubles forced him into a comeback, taking the Australian title as well as the lightly-regarded WBF (World Boxing Federation) belt, aged 48. He retired at 49 after beating US fighter Levi Billups on Australia's Gold Coast in 1999. Bugner was affectionately known as 'Aussie Joe' in the last few years as a boxer, having been warmly received in Australia in a manner he had been unaccustomed to during his career in Britain. Read more on Sky News:Queen 'fought off attacker with shoe'Hollywood star working in a barTransfer deadline day - latest Bruno said in a post on X it was \"a sad day for boxing\", calling Bugner a \"character\" who \"played Mr bad guy\" before their fight. Promoter Frank Warren wrote on X that Bugner was \"a great man who will be missed\". After giving up the sport, Bugner was involved within the film industry and appeared on I'm A Celebrity...Get Me Out Of Here! in 2009."
    },
    {
        "title": "Man who snatched tennis player's cap from boy at US Open apologises",
        "description": "A businessman who snatched a cap being given to a young fan by tennis player Kamil Majchrzak at the US Open has offered a \"sincere apology\" for his actions and said he has returned it.",
        "url": "https://news.sky.com/story/man-who-snatched-tennis-players-cap-from-boy-at-us-open-apologises-13423193",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kamil-majchrzak-us-open_7005395.jpg?20250830090633",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-01 14:26:00",
        "Headline": "After an online backlash, Piotr Szczerek issued an apology and said he believed Polish tennis player Kamil Majchrzak was handing him the cap at the US Open in New York.",
        "Content": "A businessman who snatched a cap being given to a young fan by tennis player Kamil Majchrzak at the US Open has offered a \"sincere apology\" for his actions and said he has returned it. Piotr Szczerek said he believed Majchrzak was handing the cap to him, and it had caused him to \"instinctively reach out\". Footage circulating online showed 29-year-old Polish player Majchrzak signing autographs for fans at Flushing Meadows in New York after beating Russia's Karen Khachanov last Thursday. But as he gave his cap to a boy, it was snatched by Szczerek. Majchrzak later tracked down the boy and presented him with a new cap and a goodie bag. After a backlash on social media, Szczerek, who is reported to be the head of a Polish paving firm, wrote on Instagram: \"Due to the situation that occurred during Kamil Majchrzak's match at the US Open, I would like to offer my sincere apology to the injured boy, his family, all the fans, and the player himself. \"In the midst of the excitement and celebration after my victory, I believed the tennis player was handing his cap to me - for my sons, who had previously asked for autographs. \"This mistaken belief caused me to instinctively reach out. \"Today, I know I did something that seemed like deliberately taking a souvenir from a child. It wasn't my intention, but that doesn't change the fact that I hurt the boy and disappointed the fans.\" Read more from Sky News:'Stop killing journalists in Gaza': Media groups uniteQueen fought off attacker on train, book claims  He added that he and his wife helped children and young athletes, but admitted the incident at the US Open had been \"a painful but necessary lesson in humility\"."
    },
    {
        "title": "Burning Man: Dead body found 'in a pool of blood' at festival",
        "description": "A man has been found dead \"in a pool of blood\" at the Burning Man festival in Nevada, officials say.",
        "url": "https://news.sky.com/story/burning-man-dead-body-found-in-a-pool-of-blood-at-festival-13422942",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-burning-man-festival_7008062.jpg?20250901095819",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-01 09:01:00",
        "Headline": "The man was found as the festival's iconic large wooden effigy was burned on Saturday night.",
        "Content": " A man has been found dead \"in a pool of blood\" at the Burning Man festival in Nevada, officials say. The man's body, described as a white adult, was found \"lying on the ground\" after 9pm on Saturday at the art and music festival in the Black Rock Desert, roughly 110 miles north of Reno, the Pershing County Sheriff's Office said. They said he was discovered while the festival's large wooden effigy of a man at the centre of the festival was engulfed in flames - a tradition during the annual event. Officials said a festival goer flagged down a sheriff's deputy and reported seeing \"a male subject lying in a pool of blood\". The sheriff's office set up a perimeter at the scene and has been treating it as a homicide, interviewing several participants. The body, which has not been identified, was taken to a medical examiner's office, while the festival continues until 6pm local time on Monday (2am Tuesday UK time). \"Although this act appears to be a singular crime, all participants should always be vigilant of their surroundings and acquaintances,\" the sheriff's office said. \n                  Ozzy Osbourne's former guitarist shot multiple times while walking his dog\n                 \n                  Naked Donald Trump statue near Las Vegas branded 'deplorable'\n                 \n                  Robert Telles: Former politician guilty of murdering investigative journalist\n                 Officials say the crime scene is being preserved, but that the case is a \"complicated investigation\" as the makeshift Black Rock City where the event is located will be gone by the middle of the week. Read more:Rudy Giuliani rushed to hospital after car crashAfghanistan earthquake kills hundreds and destroys villages - all we know so far Burning Man organisers said they were cooperating with law enforcement and asked participants not to interfere with their investigation. \"The safety and well-being of our community are paramount,\" their statement said, adding that support services, including a crisis support team, were available and participants had access to free Wi-Fi if they need to communicate with loved ones. Burning Man is a celebration of self-expression that culminates in the ceremonial burning of its towering 40ft effigy. Its origins can be traced back to the incineration of an eight-foot wooden \"man\" on San Francisco's Baker Beach in 1986, which eventually evolved into an annual gathering in the Black Rock Desert."
    },
    {
        "title": "Man who snatched tennis player's cap from boy at US Open apologises",
        "description": "A businessman who snatched a cap being given to a young fan by tennis player Kamil Majchrzak at the US Open has offered a \"sincere apology\" for his actions and said he has returned it.",
        "url": "https://news.sky.com/story/man-who-snatched-tennis-players-cap-from-boy-at-us-open-apologises-13423193",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-kamil-majchrzak-us-open_7005395.jpg?20250830090633",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-01 14:26:00",
        "Headline": "After an online backlash, Piotr Szczerek issued an apology and said he believed Polish tennis player Kamil Majchrzak was handing him the cap at the US Open in New York.",
        "Content": "A businessman who snatched a cap being given to a young fan by tennis player Kamil Majchrzak at the US Open has offered a \"sincere apology\" for his actions and said he has returned it. Piotr Szczerek said he believed Majchrzak was handing the cap to him, and it had caused him to \"instinctively reach out\". Footage circulating online showed 29-year-old Polish player Majchrzak signing autographs for fans at Flushing Meadows in New York after beating Russia's Karen Khachanov last Thursday. But as he gave his cap to a boy, it was snatched by Szczerek. Majchrzak later tracked down the boy and presented him with a new cap and a goodie bag. After a backlash on social media, Szczerek, who is reported to be the head of a Polish paving firm, wrote on Instagram: \"Due to the situation that occurred during Kamil Majchrzak's match at the US Open, I would like to offer my sincere apology to the injured boy, his family, all the fans, and the player himself. \"In the midst of the excitement and celebration after my victory, I believed the tennis player was handing his cap to me - for my sons, who had previously asked for autographs. \"This mistaken belief caused me to instinctively reach out. \"Today, I know I did something that seemed like deliberately taking a souvenir from a child. It wasn't my intention, but that doesn't change the fact that I hurt the boy and disappointed the fans.\" Read more from Sky News:'Stop killing journalists in Gaza': Media groups uniteQueen fought off attacker on train, book claims  He added that he and his wife helped children and young athletes, but admitted the incident at the US Open had been \"a painful but necessary lesson in humility\"."
    },
    {
        "title": "Donald Trump says he is awarding Rudy Giuliani the Presidential Medal of Freedom",
        "description": "Donald Trump has announced he will award Rudolph Giuliani the Presidential Medal of Freedom, a day after the former New York mayor and political ally was seriously injured in a traffic accident.",
        "url": "https://news.sky.com/story/donald-trump-says-he-is-awarding-rudy-giuliani-the-presidential-medal-of-freedom-13423438",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-giuliani-trump_7007846.jpg?20250831221323",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-01 21:35:00",
        "Headline": "Donald Trump announced he will award his ally the nation's highest civilian honor, praising him as 'the greatest mayor in New York City' and a 'great American patriot.'",
        "Content": "Donald Trump has announced he will award Rudolph Giuliani the Presidential Medal of Freedom, a day after the former New York mayor and political ally was seriously injured in a traffic accident. The medal is the nation's highest civilian honour. In a statement on social media on Monday, Mr Trump described Mr Giuliani as \"the greatest mayor in New York City's history and an equally great American patriot\". Mr Giuliani has been celebrated for his leadership after the September 11 attacks but has also drawn controversy for his strong support of Mr Trump. As the president's lawyer, he became a central figure in efforts to overturn the 2020 election. On Sunday, Mr Giuliani was taken to hospital after a car crash in New Hampshire, a spokesperson for the former mayor said. He suffered \"a fractured thoracic vertebrae, multiple lacerations and contusions, as well as injuries to his left arm and lower leg\", according to Michael Ragusa, Mr Giuliani's head of security. \n                  Chinese, Russian and Indian leaders seek to show unity and push for new world order in Beijing meeting\n                 \n                  China-led SCO economic summit is a show designed to rattle the West\n                 \n                  Is political chaos fuelled by the media? \n                 His vehicle was struck from behind while driving on a highway near Manchester, New York, on Saturday evening. \"He sustained injuries but is in good spirits and recovering tremendously,\" Mr Ragusa said in a statement on X, adding: \"This was not a targeted attack.\" Mr Giuliani was in a rental car and \"no one knew it was him\", according to Mr Ragusa. His head of security said the former mayor had been \"flagged down by a woman who was the victim of a domestic violence incident\" and contacted police on her behalf. The crash was \"random and unrelated\" to the domestic violence incident, Mr Ragusa said. Mr Giuliani, 81, is expected to be released from hospital in a few days. Read more from Sky News:Family reunion rules shakeup for asylum seekers announcedFormer British heavyweight boxing champion dies His son, Andrew Giuliani, thanked people for reaching out after hearing about his father's accident, writing on X: \"Your prayers mean the world.\" \"As a son, I can tell you that I'm honored to have a Dad that I can call the toughest SOB I've ever seen,\" he added. Turbulent years  The crash on Saturday comes after several turbulent years for Mr Giuliani, who earned the nickname \"America's mayor\" for his leadership in New York following the 9/11 attacks in 2001. He sought the Republican nomination for the 2008 presidential election but ultimately dropped out and endorsed John McCain. Mr Giuliani re-emerged as Mr Trump's personal lawyer in 2018 and later backed his unfounded claims of fraud in the 2020 election, which was won by Democrat Joe Biden. However, Mr Trump's legal team lost numerous lawsuits alleging fraud, and multiple recounts, audits, and reviews of the 2020 election uncovered no evidence of significant wrongdoing or error. Two Georgia election workers won a defamation lawsuit against Mr Giuliani after he falsely accused them of helping to rig the presidential election. He was ordered to pay $148m (£118m) in damages."
    },
    {
        "title": "Thames Water creditors offer £1bn 'sweetener' in rescue deal",
        "description": "Thames Water&#8217;s largest group of creditors is to offer an additional &#163;1bn-plus sweetener in a bid to persuade Ofwat and the government to pursue a rescue deal with them that would head off the nationalisation of Britain's biggest water utility.",
        "url": "https://news.sky.com/story/thames-water-creditors-offer-1631bn-sweetener-in-rescue-deal-13423292",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-water-vans-repair-site_6915324.jpg?20250513153358",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-01 17:10:00",
        "Headline": "A group of lenders which wants to take control of the UK's biggest water company is preparing to offer regulators an additional £1.25bn package of new equity and debt write-offs, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Thames Water’s largest group of creditors is to offer an additional £1bn-plus sweetener in a bid to persuade Ofwat and the government to pursue a rescue deal with them that would head off the nationalisation of Britain's biggest water utility. Sky News has learnt that the senior creditors, which account for roughly £13bn of Thames Water's top-ranking debt, will propose this month that they inject hundreds of millions of pounds of new equity and write off a substantial additional portion of their existing capital. In total, the extra equity and debt haircut are understood to total roughly £1.25bn, although the precise split between them was unclear on Monday evening. Money latest: The £80 toy topping Christmas list The numbers were still subject to being finalised as part of a comprehensive plan to be submitted to Ofwat, according to people close to the process. Thames Water has about 16 million customers and serves about a quarter of the UK population. The creditor group, which includes funds such as Elliott Management and Silver Point Capital, is racing to secure backing for a deal that would avoid seeing their investments effectively wiped out in a special administration regime (SAR). \n                  Thames Water agrees £122m fine payment plan - as future hangs in balance\n                 \n                  Consumers could get new roles in effort to rebuild trust in water companies\n                 \n                  Thames Water crisis: Ministers line up administrator for utility giant\n                 Sky News revealed last month that Steve Reed, the environment secretary, had authorised the appointment of FTI Consulting, a City restructuring firm, to advise on contingency planning for a SAR.  On Monday, The Times reported that Rachel Reeves, the chancellor, had reaffirmed the government's desire to see a \"market-based solution\" to the crisis at Thames Water. The company's main group of creditors had already offered £3bn of new equity and roughly £2bn of debt financing, which, alongside other elements, represented a roughly 20pc haircut on their existing exposure to Thames Water. On Tuesday, the creditors are expected to set out further details of their operational plans for the company, in an attempt to allay concerns that they are insufficiently experienced to take on the task of running the UK's biggest water company."
    },
    {
        "title": "McLaren F1 arm valued at over £3bn in stake sale",
        "description": "The McLaren Formula One team is to be valued at over &#163;3bn in a deal that will reap a stellar return for the investors which helped bail out its parent company during the pandemic.",
        "url": "https://news.sky.com/story/mclaren-f1-arm-valued-at-over-1633bn-in-stake-sale-13422859",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-mclaren-piastri_7008090.jpg?20250901104336",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-01 05:59:00",
        "Headline": "Mumtalakat and CYVN Holdings are buying out the minority stakes in McLaren Racing owned by MSP Sports Capital and other investors at a valuation underlining its resurgent performance, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The McLaren Formula One team is to be valued at over £3bn in a deal that will reap a stellar return for the investors which helped bail out its parent company during the pandemic. Sky News can exclusively reveal that McLaren Group's owners - Mumtalakat, the Bahraini sovereign wealth fund, and Abu Dhabi-based automotive investment group CYVN Holdings - are to buy out the 30% stake in McLaren Racing that they do not already own. Sources said the deal, which will give the two Gulf investors full ownership of McLaren Racing, could be announced as soon as Tuesday. Money blog: Child psychiatrist's advice for parents If confirmed, a transaction would value McLaren Racing at over £3bn, the sources said, underlining the resurgent performance of its motorsport operations under chief executive Zak Brown. McLaren driver Oscar Piastri won last weekend's Dutch Grand Prix at Zandvoort, with McLaren holding an apparently impregnable grip on this year's F1 constructors' championship. Briton Lando Norris sits in second place in the drivers' rankings, behind his Australian team-mate. \n                  Christian Horner says Red Bull sacking came as a 'shock' in farewell speech\n                 \n                  Christian Horner sacked by F1 team Red Bull\n                 \n                  Former Formula 1 team owner and broadcaster Eddie Jordan dies aged 76\n                 The deal will involve Mumtalakat and CYVN acquiring the stakes in McLaren Racing currently owned by MSP Sports Capital, Ares Investment Management, UBS O'Connor and a number of other small shareholders. MSP Sports Capital spearheaded a deal announced in 2020 to buy an initial 15% stake in McLaren Racing which gave the business a post-money valuation of £560m. The deal provided urgently needed capital to the wider McLaren Group, whose automotive arm's finances were placed in a parlous state by the pandemic. McLaren Group engineered a series of capital injections, the sale of its Applied Technologies division and the sale-and-leaseback of its spectacular Surrey headquarters in a bid to strengthen its balance sheet. The £3bn-plus valuation at which the 30% stake is expected to change hands this week reflects the stronger financial position of the broader McLaren Group, as well as the phenomenal performance of the McLaren Racing business. McLaren Racing is owned by McLaren Group Ltd, while McLaren Group Holdings - the entity owned by CYVN - in turn owns 100% of McLaren Automotive. Sports financiers said it would also underline growing investor appetite for F1-related assets, with Aston Martin saying in July that it would sell its stake in its eponymous Grand Prix team at a valuation of £2.4bn. There has also been speculation about the future of Red Bull's investment in the sport, and about Ineos's long-term commitment to the Mercedes F1 team. Some of the minority investors in McLaren Racing acquired their stakes in 2021 and will also bank a handsome windfall from the sale to McLaren Group. Mumtalakat will retain a controlling stake in McLaren Racing after the buyout of the minority investors, according to insiders. The deal will further simplify the ownership of one of the most famous names in the global luxury car industry. Bankers have talked up the prospect of a McLaren public listing for years, but its repeated need to tap private shareholders for funding and the supply chain challenges which have hindered its recovery mean that an IPO is still likely to be several years away. During the COVID-19 pandemic, the company was forced into a far-reaching restructuring that saw hundreds of jobs axed. Founded in 1963 by Bruce McLaren, the group's name is among the most famous in motorsport. During half a century of competing in F1, it has won the constructors' championship numerous times, while its drivers have included the likes of Mika Hakkinen, Lewis Hamilton, Alain Prost and Ayrton Senna. In total, the team has won more than 200 Grands Prix, three Indianapolis 500s and the Le Mans 24 Hours on its debut. The company saw its separate divisions reunited following the departure in 2017 of Ron Dennis, the veteran McLaren boss who had steered its F1 team through the most successful period in its history. Mr Dennis offloaded his stake in a £275m deal following a bitter dispute with fellow shareholders. McLaren Racing declined to comment."
    },
    {
        "title": "'I'm a child psychiatrist - here's the biggest source of stress for children (and my advice for parents)'",
        "description": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to consultant child and adolescent psychiatrist at Berkshire Healthcare NHS Trust, Dr Guy Northover...",
        "url": "https://news.sky.com/story/im-a-child-psychiatrist-heres-my-tip-for-parents-and-the-one-thing-that-can-improve-your-mental-health-13423009",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-guy-northover-money_7007913.jpg?20250901060854",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-01 10:25:00",
        "Headline": "It's a job that brings him to tears, but Dr Guy Northover has a job that makes a difference. It's not easy to get into - and it may not always be so easy to stick at it - but the rewards are there in more ways than one. He's been speaking to the Money blog team.",
        "Content": "If you've ever spent your morning commute daydreaming about starting afresh with your career, this feature is for you. Each Monday, the Money blog speaks to someone from a different profession to discover what it's really like. This week we chat to consultant child and adolescent psychiatrist at Berkshire Healthcare NHS Trust, Dr Guy Northover... The pay is good, but the career path is a long one... After five or six years at medical school, you are usually earning about £36,000. This salary goes up as you progress through the resident doctor stages to £70,000 - it takes a minimum of eight years. Once you become a consultant, the salary increases again, and for a full-time consultant child and adolescent psychiatrist, you can expect to earn between £105,000 and £140,000 depending on experience. Money latest: Today's blog A great advantage of working in the NHS is that you get a really good pension... through a Career Average Revalued Earnings (CARE) scheme. This means that for each year of membership, a fraction of your pensionable earnings is added to your pension pot and then revalued annually until you retire. Contributions are tiered, starting at 5.5%; however, I contribute 12.5% of my salary to this pension, and my employer adds a further 22%. Children and their families can be affected by money worries... Parents often need to stay at home to look after their children, taking them to appointments, which can require a lot of travel time and cost, while also taking a step back from work so that they can do this. Young people on the road to recovery won't just need therapy or medication but also opportunities to engage with society through clubs, the gym and meeting friends which all ends up costing money as well. My job does make me cry... I think that every child and adolescent psychiatrist will find themselves struggling with the emotions that arise out of supporting very unwell young people. Fortunately, this is well recognised, and in my experience, I have been supported right from the beginning of my training. Psychiatry trainees are expected to be part of support groups, we have peer supervision to discuss complex cases and the impact that it is having on us, and mentoring is encouraged at all levels of expertise. It's important that psychiatrists (as well as the wider healthcare workforce) can access comprehensive mental health and wellbeing support. I know the college is calling for ring-fenced funding for this. Holidays and finding ways to relax outside work are also really important. Demand for child and adolescent mental health services is far greater than what can presently be offered but... the biggest issue is the understanding of the difference between emotional wellbeing and mental health in children and young people. There has been a significant increase in mental health issues and a significant decrease in emotional wellbeing, but when the two things become confused, it makes support for both worse. Emotional wellbeing can be how you feel about exams... peer pressure, how you cope with day-to-day challenges and how you recover from feeling sad. If this is seen as a mental illness, then there is a risk that people who could help (schools, parents, community support) feel that they cannot help, so you end up being referred for specialist help and waiting a lot longer for a level of support you may not need. On the other hand, if mental illness is seen as an emotional wellbeing problem, then you may not be referred for the right level of support and people may start thinking that feeling sad is the same thing as feeling severely depressed and set up the wrong services to help. This can lead to a situation where there is not enough expertise or services for people with severe depression, and those young people end up with support that does not help them. However, it is obviously the case at the moment that there are not enough child and adolescent mental health services to meet the level of need, and there is not a situation of overdiagnosis (most likely we are still underdiagnosing). I would encourage parents to find time and space to talk to their child from an early age... let them build up the confidence to talk to you about difficult things when their life is going well so that when it is not going well, they are still able to talk to you. If your child is not talking to you as a parent, if you don't know what their worries, fears, anxieties or ambitions and goals are, then they may have a lot going on that is affecting their emotional wellbeing. The impact of social media is a really big subject... which does not have an easy answer. We are seeing more and more research showing that having a mobile phone and using social media at a young age may impact someone's mental health but exactly why is still not clear. There are obvious things that can harm our mental wellbeing through social media, and we should absolutely be ensuring that young people are not exposed to these things, but there are also positives such as sharing useful information and experiences. Parents and carers can support children with smartphones... by having open discussions about how they can stay safe on them and what they may encounter in online spaces. It's also important to balance screen time with other activities such as socialising, exercising and sleep. All the young people I see are memorable for one reason or another... and I believe that I learn from every young person I meet in clinic. Many of the young people I see are initially struggling with their own thoughts, not able to go to school, not able to leave their home. It is amazing to see them get better, recover and find themselves happy with their lives. I focus on young people who are presenting with psychosis... Psychosis is a very severe symptom of mental illness where a person is not able to think clearly, and their brain starts making links between thoughts and ideas where there are no links. This usually results in someone believing that very strange things are happening when they are not and hearing/seeing things that are not there. There has been a definite increase in the number of child/adolescent referrals for mental health difficulties... such as anxiety, depression, eating disorders, autism and ADHD; however, there has not been an increase in psychosis. Read more of this feature:'I'm a brain surgeon - here's how to keep your mind healthy''I'm a hair surgeon - here's the celebrity with the best transplant' The biggest source of stress for young people is... school. Of course, not every young person finds school stressful but when school goes wrong, either because of learning challenges or friendship challenges, it becomes hugely challenging. I think in part this is because of how society links poor school grades with failure (which it absolutely should not) and how you can no longer leave school problems at school. As a young person, you are continuously linked to school through homework and social media... If you are bullied, this can now continue at home. If you are struggling at school, you are reminded of this both through the way homework is set through apps and through the social media messages of other young people who are not struggling. One thing everyone can do to improve their mental health is... sport, sport and more sport! Sport is fantastic, it is an exercise which we know improves mental health, but it is also a social activity. Socialising improves mental health, gets us away from our phones and gets us fresh air. We work in sessions that are each half a day... I complete 10 sessions every week, which equates to 40 hours or five days. On top of this, we usually do \"on calls\" which is out-of-hours work where we usually do not need to see a young person but may give telephone advice. This varies from area to area, but I am on call around two nights a month. We also get dedicated time for professional development to stay up to date. I use some of this time to be involved in research and some to work at the Royal College of Psychiatrists, which sets and aims to raise the standards of doctors in mental health care. I usually get into the office between 8am and 9am... to check any emails I have received around my research and Royal College work. During the morning, I will see patients. I work in a very specialist team that does much longer complex assessments of young people, so I may see one new patient and review two patients I already know in a morning. I will also take some phone calls and talk to other members of the team about the young people we are supporting. In the afternoon, I will do management work, or I may have a clinical team meeting followed by a home visit. One frustration is... the amount of paperwork that we have to do, so usually the last couple of hours of the day are spent writing up all the information about the young people I have seen. Additional admin support would help address these pressures and improve the day-to-day lives of psychiatrists. People respond to mental health difficulties incredibly well with the right help... recovery is not just possible, it is expected. Being able to access evidence-based support early makes a world of difference."
    },
    {
        "title": "Reform took advantage of the PM's holiday - and it's clear he's now changed strategy",
        "description": "Immigration was the first thing on the government's agenda to kick off the first week back from recess, and they wanted you to know it.",
        "url": "https://news.sky.com/story/yvette-cooper-attempts-to-seize-the-limelight-from-reform-on-immigration-13423406",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-farage_6927488.jpg?20250525233805",
        "type": "Politics",
        "Author": "Serena Barker-Singh",
        "Date Published": "2025-09-01 21:00:00",
        "Headline": "After a summer dominated by Reform turning up the heat on immigration, it's finally hit home for the government that the public want proof of change, not just rhetoric.",
        "Content": "\n          Political correspondent\n              @serenabarksing\n  Immigration was the first thing on the government's agenda to kick off the first week back from recess, and they wanted you to know it. The home secretary gave an update to the House, announcing a shakeup of family reunion rules for asylum seekers, even before some backbenchers had made it back to parliament from their break. Facing criticism for being on the back foot after a summer of protest outside asylum hotels, they were keen to defend their record and get back on track - but is it too late? It's a clear nod to the political void Reform UK has seized on while the prime minister has been on holiday. Last week, Nigel Farage unveiled his party's mass deportation policy - though the issue of women and children still seems to be worked out. But perhaps none of that matters as voters overwhelmingly believe Reform cares about this issue - and as Chris Philp, the shadow home secretary, pointed out on Monday, voters have lost confidence in the government somewhat to solve what many see as an immigration crisis on their doorstep. So it's clear the strategy has changed from the government. Read more:Starmer's 'Mr Fixit' is likely to be a recipe for conflictTories call for investigation into Angela Rayner  Gone are the bold slogans of \"smashing the gangs\" and instead, detail and policy was given on Monday. It was nothing new, but more substance on what the government has done and where they want to move to. Even controversially, reassessing their relationship with the European Convention on Human Rights (ECHR). The biggest update though, was on their one-in-one-out policy agreement with France, which will now set to start returns later this month. It's finally hit home for the government that the public want proof not just rhetoric, and they want to know crucially when they will start to see change. But the fightback, the reset, whatever the government wants to call it, will only make a difference once that finally starts to work."
    },
    {
        "title": "The red tape keeping these flats empty - and threatening Labour's vital new homes target",
        "description": "There are 1,210 completed homes which cannot be occupied because of delays in the work of the government's building safety regulator, Sky News can reveal.",
        "url": "https://news.sky.com/story/the-red-tape-keeping-these-flats-empty-and-threatening-labours-vital-new-homes-target-13423446",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-acton-housing_7008838.jpg?20250902010118",
        "type": "Politics",
        "Author": "Sam Coates, deputy political editor, and Joe Cook, politics producer",
        "Date Published": "2025-09-01 22:04:00",
        "Headline": "Sir Keir Starmer has made house building one of his government's priorities, and regularly rails against NIMBY culture. But Sky News can reveal the government's own regulator has also been getting in the way of people moving into new homes. ",
        "Content": "By Sam Coates, deputy political editor, and Joe Cook, politics producer   There are 1,210 completed homes which cannot be occupied because of delays in the work of the government's building safety regulator, Sky News can reveal. The safety inspection regime created in the wake of the Grenfell tragedy, which claimed 72 lives, is \"not fit for purpose\", according to those who depend on its work. Politics Hub: Follow live updates Sky News has visited an empty block of 99 flats in west London where future residents - who have purchased the properties - have been unable to move in for over a year because of the lack of regulator approval. New data obtained exclusively by Sky News through a Freedom of Information request shows the extent of the issue. As of 1 August, there is \"no decision\" on eight applications covering 1,210 completed new residential units. For sites yet to be built, there are 156 applications with no decision, covering 34,965 new residential units. Sir Keir Starmer says economic growth is his top priority and the 1.5 million new homes target this parliament is a key part of this agenda. But two years after its creation, the government agency has come under fire for failing to fulfil vital functions in a timely manner. After complaints, the regulator has already faced one overhaul, and will shortly move from part of the Health and Safety Executive (HSE) to become an arm's length body which is part of Angela Rayner's Ministry of Housing, Communities and Local Government. But developers say they are still struggling to get answers from the body. Sky News has conducted an analysis of public data and found the backlog growing. New buildings ought to be signed off within a 12-week period, but Sky News found the percentage of applications determined inside that window is falling - from 47% at the end of September last year, to 32% by the end of March. In a statement, leading financial analyst S&P said delays by the regulator are pushing up building costs and making it harder to deliver the key government target. Chris Williamson, chief business economist at S&P, said: \"We have received anecdotal feedback from a few companies regarding the Building Safety Act, indicating that some may be experiencing challenges related to orders. This could contribute to an increase in costs within the construction sector, which is already facing financial pressures.\" In an apparent admission of the issues, the government told Sky News it is now in the process of recruiting over 100 new staff to strengthen capacity by the end of the year. In a statement to Sky News, the building safety regulator (BSR) itself said it had been a complex task creating a new safety body post Grenfell, in such a short time, and improvements are already being made. It said: \"BSR is working closely with industry to deliver safer, higher-quality buildings while advancing a culture of excellence in building safety.\" Executives from the BSR will appear before a Commons Select Committee later today. It also points the finger at property developers for failing to submit paperwork correctly. The industry vehemently rejects the claim, saying there are few guidelines of what to submit and the BSR makes little attempt to clarify what it wants. A bad sign However, problems persist. Sky News saw how in one newly built property in Acton, west London, the sign-off for a building by the BSR was delayed in part because a sign was two millimetres too small and all the signs had to be changed. This has contributed to a 14-month delay in a green light for residents to move in. According to the Federation of Master Builders and the Chartered Institute of Building, 38% of developers believe planning delays are the number one issue. Developers have told Sky News the agency was meant to speed up approvals by ending a system where they have to bring in external consultants to approve the application, but this has not yet happened. Jon Spring, the managing director of Fairview Homes, said: \"We currently have three applications that are delayed within the BSR. The current dates we're looking at, that they've given us, one is six months, one is nine months, and one is 12 months. Clearly extremely different to the original three months that the process is supposed to take. \"That makes forecasting for when we're going to start on site very difficult. We have tens of millions of pounds tied up in the three sites that we're waiting to develop. And inevitably, the holding costs of those are considerable and affect the viability of the project.\" Mr Spring said the delays could make building unviable. \"If you look at each of our projects have been delayed, if […] it's going to take 25% longer to deliver that project, that means that our productivity is ultimately reduced by 25%. That would be the same for all developers and therefore the reduction in housing that's been delivered will be considerable.\" Developers 'won't touch' high-rises Jamie Lester, an estate agent from Haus Properties, said: \"The government are encouraging property developers to build, build, build, and just get on with it - I think that's what Keir Starmer said. \"But when there are buildings like this that can't be signed off for over a year and are costing property developers, in this instance, £100,000 a week, I don't understand. \"The government won't encourage property developers to build like this any more. I know many property developers who won't touch high-rise buildings at the moment simply because the building safety regulator can't get their act together and sign these buildings off.\" Read more from our politics experts:PM's 'Mr Fix-it' may be a recipe for conflictHome secretary bids to seize limelight from Reform 'High standards' A spokesperson for the HSE said: \"Protecting residents, making sure there is never another tragedy like Grenfell, has been our priority throughout this process. Setting up a new regulator has been complex, and huge progress has been made in a short time. The construction industry must meet standards that will keep residents safe in high-rise buildings. \"The recently announced innovation unit is the result of ongoing discussions between industry and BSR to uphold high standards. BSR is working closely with industry to deliver safer, higher-quality buildings while advancing a culture of excellence in building safety.\" 'It has turned out to be a disaster' Some have blamed the government, not the regulator itself. The boss of one major house building company, who did not want to be named, said ministers aren't willing to face up to reality. \"Regulation comes from the government and the regulator is implementing the rules,\" they said. \"Their mandate is nothing to do with housing supply so it's up to ministers to balance that. All the house builders said this would be a disaster and funnily enough it has turned out to be a disaster.\" A government spokesman from the housing department said problems were already being tackled and safety was important: \"We've announced a package of reforms to reduce delays, including a fast track process to speed up new build decisions.\" They added 100 new staff were being employed."
    },
    {
        "title": "Sir Keir Starmer's 'Mr Fixit' is likely to be a recipe for conflict",
        "description": "After a torrid time before the summer break, Sir Keir Starmer has reshuffled his inner circle again on the first day back.&#160;",
        "url": "https://news.sky.com/story/sir-keir-starmers-mr-fixit-is-likely-to-be-a-recipe-for-conflict-13423267",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-darren-jones-downing-street_7008202.jpg?20250901122122",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-01 17:22:00",
        "Headline": "As chief secretary, Mr Jones is meant to have gone item by item through every department's budget. He knows where the financial bodies are buried.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n  After a torrid time before the summer break, Sir Keir Starmer has reshuffled his inner circle again on the first day back.  This has become something of a habit. Politics latest: Cooper pledges to end use of asylum hotels 'for good' Although none of the Number 10 team are household names or public figures, the tally of those cycling through the top jobs is worth noting. As of now, he's had four chiefs of staff - the incumbent returning to the job, two cabinet secretaries with a third rumoured to be on the way and five directors of communications - a job that routinely fails to last a year these days. The lesson this tells us is that when there's blame to go around, Sir Keir is happy to apportion it to his closest aides. In an interview today, the prime minister was clear that these changes are about moving to a new phase of government, more focused on delivery. \n                  Labour plans to 'overhaul broken asylum system'\n                 \n                  Migrants to be deported to France 'within weeks' - as Farage vows to scrap human rights law\n                 \n                  The latest migration stats are going in the wrong direction - and the argument might get more vicious\n                 A delivery phase implies legislation completed and a focus on implementation. Bluntly, this is not the case or an accurate assessment of the job that now needs to be done. The autumn term is not about implementation. It's about filling the £20bn to £40bn black hole we expect to emerge in the autumn budget, as well as continuing to deal with an uncertain world globally, and deciding on massively tricky domestic issues like reform of special educational needs and whether to revisit welfare reform. We are still at the \"big choices\" section of this parliament, not the delivery phase. The big choice in Sir Keir's reset on Monday has been to bring in his own Mr Fixit into Downing Street. He chose a mid-level cabinet minister, Darren Jones - until today the number two in the Treasury - and has parachuted him into his office to oversee policy. This is an appointment, I'm told, that was pushed and encouraged by Rachel Reeves because of Mr Jones' role in the spending review. As chief secretary, Mr Jones is meant to have gone item by item through every department's budget. He knows where the financial bodies are buried and will be a major alternate source of advice for Sir Keir to individual cabinet ministers. Read more:Angela Rayner a 'great British success story', says PM Reform deputy hits back after Archbishop's intervention This is undoubtedly a recipe for conflict. There are already some around the cabinet table who found Mr Jones' style a touch brusque. His fans say this is part of why he is effective: he is prepared to challenge what he's told, is an independent thinker and unafraid to challenge big beasts. He will now play this role permanently, on behalf of the prime minister, and structurally, this means he is bound to be disliked by several of these colleagues who will no doubt, in time, seek to undermine him, just as he will challenge them and have the last word with Sir Keir. No matter that some might be surprised at the choice, as a fiscal and reforming hawk, since few would put him on the same ideological wing of the party as the prime minister. He is also a late joiner to the Starmer project, although joining in opposition spent years longer than some as chair of the business select committee rather than taking more junior roles. This is now immaterial. He is responsible for making Sir Keir's government work in practice. His colleagues could do worse than to sincerely wish him good luck and leave him to it, as there is a great deal to be done."
    },
    {
        "title": "Former Conservative MP David Warburton accused of sexual misconduct and cocaine use, dies 'unexpectedly' at 59",
        "description": "A former Conservative MP who quit after being accused of sexual misconduct and cocaine use has died at the age of 59, police have said.",
        "url": "https://news.sky.com/story/former-conservative-mp-david-warburton-accused-of-sexual-misconduct-and-cocaine-use-dies-unexpectedly-at-59-13423311",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-david-warburton-mp_7008576.jpg?20250901184847",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-01 17:38:00",
        "Headline": "The ex-Somerset MP, who was found dead in west London on Tuesday, had admitted using the Class A drug but denied other claims made against him.",
        "Content": "A former Conservative MP who quit after being accused of sexual misconduct and cocaine use has died at the age of 59, police have said. David Warburton, who represented the Somerset constituency of Somerton and Frome between 2015 and June 2023, was found dead in west London on Tuesday, Scotland Yard said. Officers were called to an address in Sands End in Fulham, where they found a man in his 50s dead at the scene, the force said, adding his death is being treated as \"unexpected but not suspicious\". Politics latest: Cooper pledges end to asylum hotels The former backbench MP had admitted taking the Class A drug but denied claims of sexual misconduct against him and hit out at a parliamentary investigation into the allegations, which had taken 14 months by the time he stepped down. He said he had not been given a fair hearing and was left with \"no choice\" but to provoke \"the upheaval of a by-election\", which was won by Liberal Democrat MP Sarah Dyke. The seat was abolished as part of boundary changes that came into effect at last summer's general election. A Metropolitan Police spokesperson said on Monday: \"Police were called by the London Ambulance Service at 10.47hrs on Tuesday, 26 August to an address at Chelsea Crescent, Sands End. \"A man in his 50s was found dead at the scene. His next of kin have been informed. \"His death is being treated as unexpected but not suspicious.\" A London Ambulance Service spokesperson said: \"We were called on Tuesday 26 August at 10.14am to reports of an incident in Chelsea Crescent, Chelsea Harbour, SW10. \"We sent (an) ambulance crew and a clinician on a bicycle. \"Sadly, a man was pronounced dead at the scene.\" Read more on Sky News:PM's Mr Fixit may create issuesStarmer backs 'success story' Rayner  Mr Warburton was first elected in 2015 with a majority of 20,268, or 53% of the vote. He was re-elected in 2017 and 2019, with majorities of 22,906 and 19,213, respectively."
    },
    {
        "title": "Home secretary announces shakeup of family reunion rules for asylum seekers to deter Channel crossings",
        "description": "The home secretary has announced a shakeup of family reunion rules for refugees in a bid to deter small boat crossings.",
        "url": "https://news.sky.com/story/home-secretary-announces-shakeup-of-family-reunion-rules-for-asylum-seekers-to-deter-channel-crossings-13423205",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-migrants-english-channel_7008585.jpg?20250901185325",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-01 18:00:00",
        "Headline": "Yvette Cooper says people smugglers are using the promise of family reunion to promote dangerous small boat crossings in the Channel.",
        "Content": " The home secretary has announced a shakeup of family reunion rules for refugees in a bid to deter small boat crossings. Yvette Cooper said people smugglers were using the promise of family reunion to promote dangerous journeys across the Channel. Addressing the House of Commons, Ms Cooper said the government would now suspend new applications under the existing family reunion route for refugees until a new framework had been introduced. Politics latest: Badenoch urged to 'come clean' over university admittance claims She highlighted how refugee families arriving in the UK were seeking homelessness assistance, putting pressure on local authorities that was \"not sustainable\". Ms Cooper told MPs the government would deliver an asylum policy statement later this year, which would set out a new system for family migration, with the aim of having \"some of those changes in place for the spring\". She said it would look at contribution requirements and whether there should be longer periods before newly granted refugees can apply for family reunion. \n                  Reform took advantage of the PM's holiday - and it's clear he's now changed strategy\n                 \n                  Small town tensions: The asylum crisis in Middle England\n                 \n                  'There's something in the air': The deep divides over asylum seekers in Nuneaton\n                 \"Even just before the pandemic, refugees who applied to bring family to the UK did so on average more than one or two years after they had been granted protection, long enough for them to be able to get jobs or find housing, or be able to provide their family with some support,\" she explained. \"In Denmark and Switzerland, currently, those granted humanitarian protection are not able to apply to bring family for at least two years after protection has been granted. But here in the UK now, however, those applications come in on average in around a month after protection has been granted, often even before a newly granted refugee has left asylum accommodation. \"As a consequence, refugee families who arrive are far more likely to be seeking homelessness assistance. \"And some councils are finding that more than a quarter of their family homelessness applications are linked to refugee family reunion. That is not sustainable.\" The home secretary continued: \"Therefore, we are bringing forward new immigration rules this week to temporarily suspend new applications under the existing dedicated refugee family reunion route. \"Until the new framework is introduced, refugees will be covered by the same family migration rules and conditions as everyone else.\" The move comes as the government struggles to cope with the continued arrival of small boats in the Channel, which have reached 29,003 - the highest on record for this point in a year. There is palpable anger in certain communities at the use of hotels to house asylum seekers, most notably in Epping, Essex, where there were protests at the weekend after the government successfully overturned a temporary injunction which would have blocked asylum seekers from staying at the Bell Hotel. The protests prompted Nigel Farage, the leader of Reform UK, to warn there was a \"genuine threat to public order\". Read more:Tories call for investigation into Angela Rayner over tax affairsWhat is the UK-France migrant returns deal? He has promised to deport up to 600,000 asylum seekers in the first parliament of a Reform UK government if he wins the next election - a plan opponents have criticised as unworkable. The home secretary said the government was working \"at pace\" to end the use of all asylum hotels, and said they would be closed \"for good\" under a \"controlled, managed and orderly programme - driving down inflow into the asylum system, clearing the appeals backlog... and continuing to increase returns\". She added: \"I understand and agree with local councils and communities who want the asylum hotels in their communities closed because we need to close all asylum hotels, and we need to do so for good, but that must be done in a controlled and orderly manner, and not through a return to the previous government's chaos that led to the opening of hotels in the first place.\" 'Things are getting worse' In response, shadow home secretary Chris Philp said Channel crossings were up 38% on the previous year, adding: \"Things are not getting any better, they are getting worse.\" He said \"tweaking the family reunion rules is not enough\" and referred again to the Tories' Rwanda scheme, which Labour scrapped on winning office."
    },
    {
        "title": "Angela Rayner a 'great British success story', says PM after tax affairs row",
        "description": "Angela Rayner is a \"great British success story\" and it is a \"mistake\" for people to be briefing against her, Sir Keir Starmer has said. ",
        "url": "https://news.sky.com/story/angela-rayner-a-great-british-success-story-says-pm-after-tax-affairs-row-13423133",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-angela-rayner_6875119.jpg?20250403175404",
        "type": "Politics",
        "Author": "Faye Brown, political reporter",
        "Date Published": "2025-09-01 12:48:00",
        "Headline": "Sir Keir Starmer criticised people briefing against his deputy after scrutiny of her tax affairs.",
        "Content": "By Faye Brown, political reporter  Angela Rayner is a \"great British success story\" and it is a \"mistake\" for people to be briefing against her, Sir Keir Starmer has said.  The prime minister strongly defended his deputy after she came under scrutiny over her tax affairs. Politics latest: Yvette Cooper announces shake-up of family reunion rules The Daily Telegraph has reported that Ms Rayner, who is also the housing secretary, avoided £40,000 in stamp duty when buying a second home after telling tax authorities it was her main home. Ms Rayner insists she paid the correct duty while her allies suggest briefings against her are driven by classism and misogyny. Asked if she has questions to answer, Sir Keir told BBC Radio 5 Live: \"Angela came from a very humble background, battled all sorts of challenges along the way. \"I'm proud of her as our deputy prime minister and one of the things that drives me about politics is that aspiration is an opportunity for people to go as far as their talent will take them\". \n                  Tories call for investigation into Angela Rayner over her tax affairs\n                 \n                  Is the government preparing for a summer of riots? \n                 \n                  Unite votes to suspend Angela Rayner over Birmingham bin strike\n                 The prime minister said Ms Rayner has had \"people briefing against her and talking her down over and over again\" and that is a \"big mistake\". He called her a \"great story of British success\" that will give \"working class children, particularly girls, a real sense of aspiration\". \"They will look at Angela and think, I can do something like that. What a brilliant thing.\" Ms Rayner grew up on a council estate in Stockport and left school at 16 pregnant with no qualifications. She said she had no books in her house growing up because her mother couldn't read or write and she was told she would \"never amount to anything\". Sir Keir's remarks come after a Downing Street spokesman insisted the prime minister had confidence in Ms Rayner and that there is a court order which restricts her from providing further information over her tax affairs \"which she's urgently working on rectifying in the interests of public transparency\". The spokesman rejected a suggestion that Darren Jones, who has been appointed to the new ministerial role of chief secretary to the prime minister, would be a de facto deputy prime minister. There is no suggestion Ms Rayner broke any laws over the stamp duty on her home, but the Tories said she should face an ethics investigation.  Stamp duty is a tax paid in England and Northern Ireland when someone buys a property over a certain price. In last autumn's budget, the government increased the additional rate of stamp duty on second homes by 5%.  According to the Telegraph, Ms Rayner is understood to have removed her name from the deeds of her house in Greater Manchester a few weeks before buying a flat in Hove, East Sussex, worth £800,000, meaning the Hove property is the only property she owns. Read More:Reform hits back after archbishop's intervention on migrant policyLabour plans to 'overhaul broken asylum system' The changes enabled her to avoid a higher rate of stamp duty that would have been applicable if the Hove flat was classed as a second home, the paper said. It claimed she paid £30,000 rather than £70,000 in stamp duty, saving £40,000 in the process. The newspaper also claimed Ms Rayner previously suggested the Greater Manchester home remained her primary residence, saving around £2,000 in council tax on her grace and favour home in central London. Kevin Hollinkrake, the Conservative Party chairman, said the arrangement amounted to \"hypocritical tax avoidance, by a minister who supports higher taxes on family homes, high-value homes and second homes\". A spokesperson for Ms Rayner has said she \"paid the correct duty\" on the purchase \"entirely properly\" - and \"any suggestion otherwise is entirely without basis\". A Cabinet Office spokesman added that Ms Rayner \"has followed advice on the allocation of her official residence at all times\"."
    },
    {
        "title": "The BTO Kid: 'I spent months in a coma - AI has given me a musical voice'",
        "description": "\"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\"",
        "url": "https://news.sky.com/story/the-bto-kid-i-spent-months-in-a-coma-ai-has-given-me-a-musical-voice-13423167",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lucas-horne-coma-the-bto-kid_7008436.jpg?20250901153356",
        "type": "Technology",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-01 23:01:00",
        "Headline": "Lucas Horne, from Nottinghamshire, spent almost four months in a coma after suffering a brain bleed in 2016, at the age of 17. Since then he has been writing songs for several years, but AI has helped him become The BTO Kid - and he is now shortlisted for the first Future Sound Awards.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  \"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\" Lucas was 17 when, in December 2016, with no warning, he suffered a large, traumatic bleed across his brain. He didn't wake up until almost four months later. Unknowingly, he had been living with a defect in the blood vessels known as an AVM (arteriovenous malformation), a ticking time bomb which had ruptured, and the next three years of his life were spent in recovery in a care home. He couldn't walk and struggled to talk. Writing down his thoughts, almost like a diary, was something he says he wanted to do from very early on. \"During my care home days when I couldn't really express myself very well - I still can't - but I could write about it, it was an outlet for me,\" he says. \"Since I woke up, I've been writing... but for a long time I couldn't record anything.\" Lucas, now 26, has spent years working on his physical recovery and speech. But when he was eventually physically able to record the songs he had been writing himself, he became frustrated by the way his voice had changed. \"It never sounded how I had [it in] my head,\" he says. \"I'm very monotone in how I speak, I struggle to really display emotion.\" And so he turned to AI (artificial intelligence). Now, Lucas is also known as The BTO Kid, and is one of 15 creators from around the world, shortlisted from more than 500 entries, for the inaugural Future Sound Awards - celebrating artificial intelligence in music. While some artists such as will.i.am, David Guetta, Grimes, Timbaland and even Sir Paul McCartney have embraced certain aspects of AI, it can be a controversial subject in the creative industries - with concerns raised by many in the about issues including copyright, human replacement, fakes, and regulation. It was one of the issues behind the Hollywood actors' and writers' strikes in 2023 - and the more recent video game actor strike, which ended in June after nearly a year of industrial action. Despite the criticism, AI isn't going away. Last year was a \"breakout\" year for the technology in music, according to the International Music Summit's latest annual business report, with 60m users using AI software. Lucas says he is a perfect example of how the technology can be used for good. \"I've been able to use AI to express how I'm feeling,\" he says. \"It's been big for me to create [music] that I'm proud of. I can see the arguments [against it], but from my view I know AI helped me create something I couldn't before. I'm not Adele, but I have been able to make something that I'm proud of and that expresses my view point of what's happened to me.\" Read more on AI in the music industry:Will.i.am on embracing AIAI used to help create 'the last Beatles record  'AI is lowering the barriers' BTO stands for Beat The Odds and his shortlisted track is titled AI Gave Me A Voice. \"I pinch myself every day because this just can't be true,\" is the opening line - which he says reflects how far he has come from the moment he woke up and discovered what had happened. \"That comes from reality. I do have moments where I think so much has happened that it must not be true... every line means something to me.\" Lucas, who lives in Nottingham, used the AI-powered music production platform TwoShot to create the track, using prompts on what he wanted for the sound alongside his lyrics, inspired by melodic rap. \"I think we're gonna get quite a lot more people like me that can't record music and have been given a voice through AI,\" he says. \"AI is lowering the barriers to entry for a lot of things.\" Which can be a negative as well as a positive, he acknowledges. \"We'll have to see where it goes.\" Launched by the Fanvue World AI Creator Awards, The Future Sound Awards aim to highlight the ethical use of AI in music, organisers say. Fanvue is a subscription creator platform with more than 180,000 users. Some 15 artists from the US, Europe, Australia and Asia, as well as the UK, have been shortlisted for prizes, and the winners will be announced later in September. Lucas is one of two British creators on the list, alongside Gallis, from Essex. The 31-year-old first dipped his toe into the waters of the music industry about 10 years ago, after joining the urban-pop boy band Mr Meanor, but says the industry was hard and \"it all got a bit too much\". He is now a tattoo artist and fine painter, but continued his songwriting and started to try out AI music production tools about 18 months ago. Read more on AI in the music industry:'Regulate it before we're all finished''It's like saying you can burgle my house unless I ask you not to'Silent album released in AI protest AI has 'made me more creative' As an artist, he says he had his own concerns about AI before he started using it himself, particularly after image generators started becoming prominent online. \"It was stealing the work that I was doing,\" is how he describes his initial feelings. \"But I ended up jumping on board with it and for me personally, it's inspired me so much. It's made me quicker at what I'm doing, it's made me more creative. And I think it's the same with music. I think it's gonna, if anything, grow the industry.\" However, he says he agrees with criticism about the ethics of how some AI models are trained - following controversy about work by human music artists and authors being used without consent. \"And trying to impersonate exactly someone else and using someone else's voice, I don't agree with that at all,\" he adds. Gallis's shortlisted song, Chiropractor emerged from \"friendly competition\" with a community of creators he came across when he moved into AI, trading feedback and ratings. The genre is Trinibad, which he says there isn't enough of \"in the AI world\", and the track is designed to get people dancing. \"I mainly stick to urban music, but I like writing in a lot of different styles,\" he says. \"I've done house songs, I've done UK drill songs, Afrobeats, amapiano. I'm a bit of a vibes man so if it makes me dance and move and smile that's when I really enjoy it.\" Narcis Marincat, head of AI at Fanvue, says the stories behind the selected songs show a \"richness and human emotion\" that appealed to him and other judges. \"The impact of AI in music continues to divide opinion,\" he says. \"But for the first time, via the Future Sound Awards, we're able to show a different perspective on the positive impact of AI in music - uncovering the real people behind the technology and sharing their stories and music.\""
    },
    {
        "title": "Summer 2025 was warmest on record - and repeat is now 70 times more likely, Met Office says",
        "description": "The UK has just sizzled through its hottest summer on record, a phenomenon made 70 times more likely by climate change, the Met Office said today.",
        "url": "https://news.sky.com/story/summer-2025-was-warmest-on-record-and-repeat-is-now-70-times-more-likely-met-office-says-13423040",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-uk-summer-weather-heatwave_6988884.jpg?20250812122815",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-01 15:13:00",
        "Headline": "It beats the previous high set in 2018, and relegates the famously hot summer of 1976 to sixth place. The persistent heat drove water shortfalls, hosepipe bans and \"false autumn\".",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  The UK has just sizzled through its hottest summer on record, a phenomenon made 70 times more likely by climate change, the Met Office said today. It beat the previous high set in 2018, and kicks the notoriously hot summer of 1976 into sixth place. The persistent heat drove hosepipe bans, \"nationally significant\" water shortfalls, and even a \"false autumn\" in places. The new provisional data found temperatures between 1 June and 31 August 2025 were 16.10C on average across the UK - much higher than the previous record of 15.76C in 2018. The difference might sound small, but - as an average over a three-month period, including day and nighttime temperatures - is in fact substantial. All the top five warmest summers have occurred since the year 2000, which the Met Office called a \"clear sign of the UK's changing and warming climate\". Did autumn come early this year? \n                  Brazil implores businesses to attend major climate summit, despite 'second thoughts' amid Trump backlash\n                 \n                  Calls to charge SUV drivers more for parking amid 'carspreading'\n                 \n                  Spain deploys another 500 soldiers to tackle wildfires - as part of Camino de Santiago pilgrimage route closed\n                 The heat gave rise to early signs of autumn, with blackberries ripening early and leaves turning brown and falling to the ground in August. This so-called \"false autumn\" is not the early arrival of the next season, but a survival mechanism of trees and plants when stressed by extreme summer conditions. They shed leaves and fruit ahead of schedule to conserve water and energy, especially the younger trees whose shallow roots can't access moisture further underground. Kevin Martin from Kew Gardens called false autumns a \"visible warning sign\". \"Trees are remarkably resilient, but they are also long-lived organisms facing rapid environmental changes.\" Was this summer warmer than 1976? This summer was the hottest on record going back to 1884, and far warmer even than the memorably hot summer of 1976, which now trails in sixth place. The Met Office's Dr Mark McCarthy said this shows how \"what would have been seen as extremes in the past are becoming more common in our changing climate\". The summer of 1976 is remembered for its heatwave that lasted more than two weeks, and 16 days in total with temperatures over 32C. Although 2025 has had just nine days of temperatures over 32C, what is \"striking\" about this summer is how consistently warm it was, the Met Office said. Why was this summer so warm? There were a number of factors that made it so warm, so persistently. Lingering high pressure made for settled, sunny and warm weather, and fuelled four heatwaves. It was also very dry, with about a quarter less rain than average for summer - though that varied by region. But it followed the driest spring in England for more than a century. Dry ground holds less moisture that can evaporate: a process that usually cools things down. And a marine heatwave sent sea temperatures on the surface well above average, with a knock-on impact on air temperatures. Overnight temperatures were also high, keeping the average up. What about climate change? Climate change made a summer as hot or hotter than this year 70 times more likely, the Met Office said. It adds another layer of heat on top of the other weather patterns that may have happened without humans changing the climate. The UK is warming by roughly 0.25C per decade, and is already at least 1.24C warmer than the period between 1961-1990. Without climate change, a summer like in 2025 would have happened about once in every 340 years. Now it's expected once in five years. Anna Roguski from Friends of the Earth, said the summer \"underlined how unprepared the UK is for extreme heat\". She said we \"urgently\" need to adapt towns with things like stricter building standards, shaded streets and \"far more nature woven through neighbourhoods - trees, wetlands and green spaces help to keep things cool\". \"But adaptation alone won't be enough. To stop summers spiralling ever hotter, we must slash emissions.\""
    },
    {
        "title": "Every mobile phone to receive emergency alert: When it will happen - and what it will say",
        "description": "Mobile phones across the UK will be sent an emergency alert as the government tests the system nationwide.",
        "url": "https://news.sky.com/story/every-mobile-phone-to-receive-emergency-alert160when-it-will-happen-and-what-it-will-say-13393683",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-mobile-phone-government_6959561.jpg?20250707171146",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-01 14:05:00",
        "Headline": "Mobile phones in the UK will be sent an emergency alert as the government tests the nationwide system for the second time. Here is what you need to know.",
        "Content": " Mobile phones across the UK will be sent an emergency alert as the government tests the system nationwide. During the test, the second only of its kind, approximately 87 million mobile devices will ring out unprompted. The system was first tested in April 2023, but the government said some users reported that their phones did not sound, with the problem traced back to specific networks. It has also been used on several occasions to warn of adverse weather events and, in one case last year, when an unexploded Second World War bomb was due to be moved by the military. Here is what you can expect. When is it going to happen? The test is due to happen at 3pm on Sunday 7 September. Phones will vibrate and emit a loud siren sound for roughly 10 seconds, even if they are set to silent. A message will also appear on phone screens warning people it is only a test and no action needs to be taken. The government said it is testing the system to ensure it is working optimally and so the public become familiar with the alerts. But critics have said the alerts themselves could put people's safety at risk, including drivers who may become distracted and domestic violence victims who keep a secret phone. Emma Pickering from the charity Refuge said: \"When used correctly and as intended, technology can make vast improvements to our lives, and we know that having a hidden device that can be used to access support without fear of being tracked can offer a lifeline for many survivors. \"However, in the hands of a perpetrator of abuse, technology becomes another tool to misuse and weaponise, often with devastating effects.\" Pat McFadden, the chancellor of the Duchy of Lancaster, said the test is \"really important\" but for those who are in vulnerable positions there is an option to opt out if they want to. He added: \"It'll be a really important moment where we can do the equivalent at a national level of testing the country's fire alarm or smoke alarm. [It is] part of our defences, part of our resilience, and a really important communication tool between the government and the public.\" What the test message will say The message will be sent to all 4G and 5G phone networks in the UK and will make clear people know it is a test and no further action is required. It will also include a sentence in Welsh, directing individuals who need it to a full translated version of the text. The full message will say: This is a test of Emergency Alerts, a UK government service that will warn you if there's a life-threatening emergency nearby. You do not need to take any action. In a real emergency, follow the instructions in the alert to keep yourself and others safe. Find simple and effective advice on how to prepare for emergencies at gov.uk/prepare. Visit gov.uk/alerts for more information or to view this message in Welsh. Ewch i gov.uk/alerts am ragor o wybodaeth neu i weld y neges hon yn y Gymraeg. How to turn it off Alerts can be switched off on iOS and Android devices by searching settings for \"emergency alerts\" and turn off \"severe alerts\" and \"emergency alerts\" to switch off the alerts. The other option is switching off the device entirely or putting it in aeroplane mode before 3pm. Ahead of Sunday's test, drivers are being urged not to be distracted if they are behind the wheel at the time, and theatre-goers will be advised to turn off their phones. When has the system been used for real? Since the first national test of the system in April 2023, five alerts have been sent to warn the public of real emergencies. The largest ever use of the system happened in January this year, when approximately 4.5 million people in Scotland and Northern Ireland received an alert during Storm Eowyn, after a rare red weather warning - meaning there was a risk to life - was issued. Also in January, the alert warned people of severe flooding at Proctor's Pleasure caravan park near Barrow upon Soar. The message told people in the park to evacuate to a nearby rest centre.  Another alert in December 2024 was sent to approximately 3.5 million people across Wales and the South West of England during Storm Darragh, during which two people died. The system was used for a non-weather event in February 2024. An alert was issued by Plymouth City Council to warn local residents to avoid a certain route that was being used to convoy an unexploded Second World War bomb through the city to the sea.  It told residents to stay away from the cordoned area in Keyham for a three-hour window. Tracey Lee, the chief executive of Plymouth City Council said the government's alert tool was \"invaluable\" at the time, and allowed the council to reach \"thousands of residents instantly\". How does the technology work? The emergency alerts are broadcast via mobile phone masts and work on all 4G and 5G phone networks. That's different to how the government sent out lockdown orders during the COVID-19 pandemic, when SMS messages were sent directly to phone numbers. It means whoever sends an alert does not need your number, so it's not something you need to reply to, nor will you receive a voicemail if you miss it. No location or other data will be collected, either. It also means alerts could be sent to tablets and smartwatches on their own data plans. Anyone in the range of a mast will receive an alert, and they can be tuned based on geography - for example, Manchester residents would not need an alert about life-threatening flooding in Cornwall. Read more:How emergency alerts work in other countries Manuel Cornelisse, Everbridge's senior director for public warnings, told Sky News the tech had proved its worth in other countries, including his homeland of the Netherlands. \"It's a very well-proven technology with very strong, quality reach,\" he said. \"And because it's part of the very highest priority of signalling, the service will always remain available, even if a network gets congested when there is massive usage (such as at a sports ground).\""
    },
    {
        "title": "Australia's social media ban can be enforced 'effectively', official report finds",
        "description": "Australia's incoming ban of under-16s on social media can be \"privately, effectively and efficiently\" enforced, an official report has found.&#160;",
        "url": "https://news.sky.com/story/australias-social-media-ban-can-be-enforced-effectively-official-report-finds-13422988",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-instagram-social-media_6879892.jpg?20250408145527",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-09-01 09:58:00",
        "Headline": "The Australian government is banning young teenagers from social media from December and commissioned the report to look into how the new rules could be enforced. The study into age verification tools found some groups faced \"reduced accuracy\" in certain scenarios.",
        "Content": "\n          Science and technology reporter\n       Australia's incoming ban of under-16s on social media can be \"privately, effectively and efficiently\" enforced, an official report has found.  The Australian government is banning young teenagers from social media from December and commissioned the report to look into how the new rules could be enforced. It explored a number of methods for verifying users' ages, including AI facial age estimation, ID checks and parental consent. The report found that although there was no \"one-size-fits-all\" approach, there were a \"plethora of approaches that fit different use cases in different ways\".  \"This is the most comprehensive and independent evaluation of age assurance we've seen,\" said Julie Dawson, co-chair of the Age Verification Providers Association (AVPA). \"It shows the technology works, that it can be privacy-preserving and that it is mature enough to give policymakers real confidence.\" Although the findings were celebrated by the age verification industry, the report did find inequalities in how the tech guessed the ages of some groups of people. \n                  Joe Bugner: Former British heavyweight boxing champion, who fought Muhammad Ali, dies\n                 \n                  Three Scottish brothers set new world record for 9,000-mile row across Pacific Ocean\n                 \n                  Manhunt after two police officers shot dead and third seriously injured in Australia\n                  Non-Caucasian, older and female-presenting users faced \"reduced accuracy\" in certain scenarios, and the fact that indigenous people were underrepresented in training data \"remains a challenge\", according to the report. Teenagers around the age of 16 also faced higher levels of inaccuracy, with 8.2% of 16-year-olds being rejected when they tried to verify they were 16. Read more from Sky News:Rudy Giuliani rushed to hospital after car crashAfghanistan earthquake kills hundreds - all we know so far In those cases, the user would likely be asked to verify their age another way, either with their ID or with parental consent, according to the report. \"It seems like there are a lot of variations in accuracy,\" said Justine Humphry from the University of Sydney, who specialises in online safety. \"That variation is concerning, with the tight schedule for the introduction of a system that will need to be robust and working by the end of this year,\" she said.  According to the law that passed last November, social media platforms will be liable for fines of up to AUS$50m (£25m) if they don't prevent children younger than 16 from holding accounts. The technology explored in the report is the same used by many internet providers in Britain since Ofcom's new internet safety rules came into force. The chief executive of Yoti, one of the companies already offering widespread age verification, called the report's results \"very bad news for many opponents who have persistently claimed that even leading safety tech check methods are inaccurate, immature, insecure, privacy chilling & discriminatory.\""
    },
    {
        "title": "The BTO Kid: 'I spent months in a coma - AI has given me a musical voice'",
        "description": "\"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\"",
        "url": "https://news.sky.com/story/the-bto-kid-i-spent-months-in-a-coma-ai-has-given-me-a-musical-voice-13423167",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lucas-horne-coma-the-bto-kid_7008436.jpg?20250901153356",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-01 23:01:00",
        "Headline": "Lucas Horne, from Nottinghamshire, spent almost four months in a coma after suffering a brain bleed in 2016, at the age of 17. Since then he has been writing songs for several years, but AI has helped him become The BTO Kid - and he is now shortlisted for the first Future Sound Awards.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n  \"AI has changed my life, absolutely,\" Lucas Horne tells Sky News. \"When I play my music, I'm happy because the words I know mean a lot to me can now be heard by everyone else.\" Lucas was 17 when, in December 2016, with no warning, he suffered a large, traumatic bleed across his brain. He didn't wake up until almost four months later. Unknowingly, he had been living with a defect in the blood vessels known as an AVM (arteriovenous malformation), a ticking time bomb which had ruptured, and the next three years of his life were spent in recovery in a care home. He couldn't walk and struggled to talk. Writing down his thoughts, almost like a diary, was something he says he wanted to do from very early on. \"During my care home days when I couldn't really express myself very well - I still can't - but I could write about it, it was an outlet for me,\" he says. \"Since I woke up, I've been writing... but for a long time I couldn't record anything.\" Lucas, now 26, has spent years working on his physical recovery and speech. But when he was eventually physically able to record the songs he had been writing himself, he became frustrated by the way his voice had changed. \"It never sounded how I had [it in] my head,\" he says. \"I'm very monotone in how I speak, I struggle to really display emotion.\" And so he turned to AI (artificial intelligence). Now, Lucas is also known as The BTO Kid, and is one of 15 creators from around the world, shortlisted from more than 500 entries, for the inaugural Future Sound Awards - celebrating artificial intelligence in music. While some artists such as will.i.am, David Guetta, Grimes, Timbaland and even Sir Paul McCartney have embraced certain aspects of AI, it can be a controversial subject in the creative industries - with concerns raised by many in the about issues including copyright, human replacement, fakes, and regulation. It was one of the issues behind the Hollywood actors' and writers' strikes in 2023 - and the more recent video game actor strike, which ended in June after nearly a year of industrial action. Despite the criticism, AI isn't going away. Last year was a \"breakout\" year for the technology in music, according to the International Music Summit's latest annual business report, with 60m users using AI software. Lucas says he is a perfect example of how the technology can be used for good. \"I've been able to use AI to express how I'm feeling,\" he says. \"It's been big for me to create [music] that I'm proud of. I can see the arguments [against it], but from my view I know AI helped me create something I couldn't before. I'm not Adele, but I have been able to make something that I'm proud of and that expresses my view point of what's happened to me.\" Read more on AI in the music industry:Will.i.am on embracing AIAI used to help create 'the last Beatles record  'AI is lowering the barriers' BTO stands for Beat The Odds and his shortlisted track is titled AI Gave Me A Voice. \"I pinch myself every day because this just can't be true,\" is the opening line - which he says reflects how far he has come from the moment he woke up and discovered what had happened. \"That comes from reality. I do have moments where I think so much has happened that it must not be true... every line means something to me.\" Lucas, who lives in Nottingham, used the AI-powered music production platform TwoShot to create the track, using prompts on what he wanted for the sound alongside his lyrics, inspired by melodic rap. \"I think we're gonna get quite a lot more people like me that can't record music and have been given a voice through AI,\" he says. \"AI is lowering the barriers to entry for a lot of things.\" Which can be a negative as well as a positive, he acknowledges. \"We'll have to see where it goes.\" Launched by the Fanvue World AI Creator Awards, The Future Sound Awards aim to highlight the ethical use of AI in music, organisers say. Fanvue is a subscription creator platform with more than 180,000 users. Some 15 artists from the US, Europe, Australia and Asia, as well as the UK, have been shortlisted for prizes, and the winners will be announced later in September. Lucas is one of two British creators on the list, alongside Gallis, from Essex. The 31-year-old first dipped his toe into the waters of the music industry about 10 years ago, after joining the urban-pop boy band Mr Meanor, but says the industry was hard and \"it all got a bit too much\". He is now a tattoo artist and fine painter, but continued his songwriting and started to try out AI music production tools about 18 months ago. Read more on AI in the music industry:'Regulate it before we're all finished''It's like saying you can burgle my house unless I ask you not to'Silent album released in AI protest AI has 'made me more creative' As an artist, he says he had his own concerns about AI before he started using it himself, particularly after image generators started becoming prominent online. \"It was stealing the work that I was doing,\" is how he describes his initial feelings. \"But I ended up jumping on board with it and for me personally, it's inspired me so much. It's made me quicker at what I'm doing, it's made me more creative. And I think it's the same with music. I think it's gonna, if anything, grow the industry.\" However, he says he agrees with criticism about the ethics of how some AI models are trained - following controversy about work by human music artists and authors being used without consent. \"And trying to impersonate exactly someone else and using someone else's voice, I don't agree with that at all,\" he adds. Gallis's shortlisted song, Chiropractor emerged from \"friendly competition\" with a community of creators he came across when he moved into AI, trading feedback and ratings. The genre is Trinibad, which he says there isn't enough of \"in the AI world\", and the track is designed to get people dancing. \"I mainly stick to urban music, but I like writing in a lot of different styles,\" he says. \"I've done house songs, I've done UK drill songs, Afrobeats, amapiano. I'm a bit of a vibes man so if it makes me dance and move and smile that's when I really enjoy it.\" Narcis Marincat, head of AI at Fanvue, says the stories behind the selected songs show a \"richness and human emotion\" that appealed to him and other judges. \"The impact of AI in music continues to divide opinion,\" he says. \"But for the first time, via the Future Sound Awards, we're able to show a different perspective on the positive impact of AI in music - uncovering the real people behind the technology and sharing their stories and music.\""
    },
    {
        "title": "Hollywood star Rupert Everett spotted working behind bar of village pub",
        "description": "Hollywood star Rupert Everett has been working behind the bar of his village pub in a bid to keep the doors open. ",
        "url": "https://news.sky.com/story/hollywood-star-rupert-everett-spotted-working-behind-bar-of-village-pub-13423046",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rupert-everett-camra_7008201.png?20250901122118",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-01 11:15:00",
        "Headline": "Everett, known for his roles in Another Country and My Best Friend's Wedding, has joined a roster of volunteers working to save The Swan, a local pub in Wiltshire, that is currently under threat of closure.",
        "Content": "Hollywood star Rupert Everett has been working behind the bar of his village pub in a bid to keep the doors open.  Everett, known for his roles in Another Country and My Best Friend's Wedding, has joined a roster of volunteers working to save The Swan, a local pub in Enford, Wiltshire, that is currently under threat of closure. The pub is staffed by a rotation of 30 people after it was initially closed when the previous licensee left. \"There has been an amazing effort by our community to keep this pub open,\" said the 66-year-old Shrek voice actor. \"Times are hard for rural pubs and this is the heart and hub of the village. I think that it is important to express my support. I have recently joined CAMRA - the Campaign for Real Ale - as I know that real ale is the lifeblood of pubs both locally and nationally. \"Our small local breweries need our help, cask ale must survive - it is almost a uniquely British tradition.\" Steve Stringer, secretary of the Salisbury and South Wiltshire branch of CAMRA and an Enford resident, told local media: \"I am excited that Rupert has chosen to support the campaign. \n                  Starmer to hold first cabinet meeting since No 10 shakeup - as he declares start of 'phase two'\n                 \n                  Reform took advantage of the PM's holiday - and it's clear he's now changed strategy\n                 \n                  Police ask for help with unsolved murder more than 50 years ago\n                 \"As a lover of cask ales, it is only natural that he wishes to join us and to see him behind the bar serving the locals, shows his solidarity with the community effort.\" Ash Corbett-Collins, the CAMRA Chairman said the organisation was \"chuffed\" that Everett had been pulling pints to save his local.  \"Publicans are clawing at a cliff edge to keep their doors open, and grassroots campaigning to save local pubs is exactly what CAMRA stands for,\" he said. CAMRA, he said, wants to see the chancellor address pub closures in the Autumn budget by \"scrapping the increase in Employer National Insurance contributions, making business rates bills fairer, and lowering VAT and duty on pints of beer and cider served in pubs\"."
    },
    {
        "title": "Burning Man: Dead body found 'in a pool of blood' at festival",
        "description": "A man has been found dead \"in a pool of blood\" at the Burning Man festival in Nevada, officials say.",
        "url": "https://news.sky.com/story/burning-man-dead-body-found-in-a-pool-of-blood-at-festival-13422942",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-burning-man-festival_7008062.jpg?20250901095819",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-01 09:01:00",
        "Headline": "The man was found as the festival's iconic large wooden effigy was burned on Saturday night.",
        "Content": " A man has been found dead \"in a pool of blood\" at the Burning Man festival in Nevada, officials say. The man's body, described as a white adult, was found \"lying on the ground\" after 9pm on Saturday at the art and music festival in the Black Rock Desert, roughly 110 miles north of Reno, the Pershing County Sheriff's Office said. They said he was discovered while the festival's large wooden effigy of a man at the centre of the festival was engulfed in flames - a tradition during the annual event. Officials said a festival goer flagged down a sheriff's deputy and reported seeing \"a male subject lying in a pool of blood\". The sheriff's office set up a perimeter at the scene and has been treating it as a homicide, interviewing several participants. The body, which has not been identified, was taken to a medical examiner's office, while the festival continues until 6pm local time on Monday (2am Tuesday UK time). \"Although this act appears to be a singular crime, all participants should always be vigilant of their surroundings and acquaintances,\" the sheriff's office said. \n                  Ozzy Osbourne's former guitarist shot multiple times while walking his dog\n                 \n                  Naked Donald Trump statue near Las Vegas branded 'deplorable'\n                 \n                  Robert Telles: Former politician guilty of murdering investigative journalist\n                 Officials say the crime scene is being preserved, but that the case is a \"complicated investigation\" as the makeshift Black Rock City where the event is located will be gone by the middle of the week. Read more:Rudy Giuliani rushed to hospital after car crashAfghanistan earthquake kills hundreds and destroys villages - all we know so far Burning Man organisers said they were cooperating with law enforcement and asked participants not to interfere with their investigation. \"The safety and well-being of our community are paramount,\" their statement said, adding that support services, including a crisis support team, were available and participants had access to free Wi-Fi if they need to communicate with loved ones. Burning Man is a celebration of self-expression that culminates in the ceremonial burning of its towering 40ft effigy. Its origins can be traced back to the incineration of an eight-foot wooden \"man\" on San Francisco's Baker Beach in 1986, which eventually evolved into an annual gathering in the Black Rock Desert."
    }
]