[
    {
        "title": "Thousands march in Lyon after killing of far-right activist Quentin Deranque",
        "description": "Some 3,000 people joined a march in France on Saturday after the killing of a far-right activist in an incident that shocked the nation.",
        "url": "https://news.sky.com/story/thousands-march-in-lyon-after-killing-of-far-right-activist-quentin-deranque-13510594",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lyon-france-deranque_7171442.jpg?20260221213448",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-21 21:13:00",
        "Headline": "Quentin Deranque, 23, died in hospital last week after being beaten during a clash between far-right and far-left groups.",
        "Content": "Some 3,000 people joined a march in France on Saturday after the killing of a far-right activist in an incident that shocked the nation. Quentin Deranque, 23, died in hospital from brain injuries last week after being beaten in Lyon, where clashes between far-right and far-left groups have become more frequent. A minute's silence was held before the start of the march, organised by far-right groups, which saw some demonstrators hold white tulips while others carried banners and placards. Many people dressed in black, some with their faces partially covered, and chanted \"justice for Quentin\" and \"antifa assassin\". The march took place under heavy police scrutiny with no major incidents recorded, but the local authority said it had reported Nazi salutes and racist ‌insults filmed during the march to the prosecutor, after videos circulated on social media. French President Emmanuel Macron had called for calm ahead of the demonstration, saying: \"This is a moment of remembrance and respect for this young compatriot who was killed, for his family and loved ones. That must come first. \"And then it is a moment of firmness and responsibility.\" Mr Deranque's parents also called for calm and did not take part in the march. The 23-year-old died after being attacked during a fight that erupted between far-left and far-right supporters, on the margins of a student meeting where a far-left lawmaker was a keynote speaker. Clashes between the two sides have become frequent in Lyon. The fighting often takes the form of organised street battles in the city, sometimes involving groups of several dozen people. The city is seen by intelligence services as the cradle of far-right activism in France. Its left-leaning militant groups have been formed more recently, in reaction to the many far-right groups that have been active for several decades. Read more:British far-right activists 'banned from France'London terror attack cop sacked over 'offensive' texts Seven people are ⁠under formal investigation for their alleged roles in Mr Deranque's murder, including a former aide to a lawmaker for the ‌hard-left France Unbowed (LFI) party, which has condemned the killing. LFI's opponents have accused it of stirring up violence and tensions with its combative far-left politics. Its leader, Jean-Luc Melenchon, has condemned the violence and insisted his party is not to blame for the tragedy."
    },
    {
        "title": "Sweeping school reforms to be unveiled - but one mum says it's 'just what I was fearing'",
        "description": "Sweeping education reforms aimed at halving the disadvantage gap are to be unveiled by the government, with the plans also expected to include significant changes to the special educational needs and disabilities (SEND) system.",
        "url": "https://news.sky.com/story/sweeping-school-reforms-to-be-unveiled-but-one-mum-says-its-just-what-i-was-fearing-13510352",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-school-education_7006609.jpg?20250830224008",
        "type": "Home",
        "Author": "Anjum Peerbacos",
        "Date Published": "2026-02-21 15:42:00",
        "Headline": "Education Secretary Bridget Phillipson has claimed that the reforms represent a significant shift in how opportunity is delivered through the school system. Some parents fear their children could be left behind.",
        "Content": "\n          Education reporter\n       Sweeping education reforms aimed at halving the disadvantage gap are to be unveiled by the government, with the plans also expected to include significant changes to the special educational needs and disabilities (SEND) system. Ministers will aim to close the attainment gap between poorer pupils and more affluent peers, with a long-term target to halve the disadvantage gap by the time today's youngest pupils reach the end of secondary school. Education Secretary Bridget Phillipson described the proposals as a \"golden opportunity to cut the link between background and success\". \"Our schools have made great strides in recent decades,\" she said. \"Yet for too long, many children in our country have been let down by a one-size-fits-all system, denied opportunity because they're poor or because they have additional needs.\" The government's schools white paper - the policy document setting out its plans for future legislation - will also recommend changes to how disadvantage funding is allocated. Rather than relying primarily on free school meal eligibility, funding could instead consider factors such as household income levels, duration of disadvantage and geographic location. Ministers say this would reduce administrative burden on schools and ensure support reaches pupils who need it most, including those whose families do not formally claim free school meals. The government will also set a target to recover 20 million lost school days a year by 2028/29 compared with 2023/24 levels, alongside incentives of up to £15,000 to encourage new headteachers to work in areas facing recruitment challenges. Concern over SEND However, much of the public discussion ahead of publication has focused on proposed SEND reforms, which were leaked earlier this week. It's provoked anxiety among some families, who fear their access to specialist support could be reduced. Reports suggest that from 2029, Education, Health and Care Plans (EHCPs) - which specify the support required for those with additional needs - could be reassessed at the end of primary school. A new legally recognised framework known as Individual Support Plans (ISPs) would meanwhile be introduced for all children with SEND. Read more:Pupils with SEND to have support reviewedEducation sec: Schools should be 'phone-free' For some parents, the proposals have triggered deep concern about continuity of support during key transitions, particularly for children with complex needs. Tiya Currie's son, Arun, is diagnosed with delayed language disorder (DLD), a lifelong disability that impacts the speaking and understanding of language. 'I'm extremely scared' \"EHCPs will be removed for my child when he will need it for his secondary school,\" Ms Currie told Sky News. \"Just what I was fearing. \"In that time there is no way they will have mainstreams (schools) skilled up to a level to accommodate severe language disorders like DLD. And without EHCP, his access to speech and language therapy will be removed.\" The north London mother claimed the proposed changes left her \"extremely scared\" for her son's future. Parents and campaigners warn any move away from EHCPs risks reducing access to therapies such as speech and language therapy (SLT) and occupational therapy, which are often specified within legally binding plans. Others argue changing the structure of plans will not address long-standing shortages in specialist provision. Education Secretary Bridget Phillipson will be appearing on Sunday Morning with Trevor Phillips - watch on Sky News from 8.30am."
    },
    {
        "title": "Vitali Klitschko tells Sky News his message to Donald Trump",
        "description": "Vitali Klitschko has urged Donald Trump \"to be on the side of Ukraine\" during peace talks with Russia - but the mayor of Kyiv admitted to Sky News he sometimes finds the president's messaging hard to understand.",
        "url": "https://news.sky.com/story/us-support-is-critically-important-for-ukraines-war-effort-says-kyiv-mayor-vitali-klitschko-13510284",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-vitali-klitschko-ukraine_7170900.jpg?20260221154303",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-21 13:45:00",
        "Headline": "America's support of Ukraine is \"critically important\" and will be felt beyond the country's borders, the boxing legend told Sky's Trevor Phillips.",
        "Content": "Vitali Klitschko has urged Donald Trump \"to be on the side of Ukraine\" during peace talks with Russia - but the mayor of Kyiv admitted to Sky News he sometimes finds the president's messaging hard to understand. Speaking to Sunday Morning With Trevor Phillips, the former world heavyweight boxing champion said it was \"critically important\" to have Washington on his country's side in its battle against Russia. Asked if he is confident the US president will support Ukraine's attempts to hold as much of its territory as possible during peace negotiations, Mr Klitschko said: \"It's the United States, it's very important. It's critically important.\" He argued the US could secure wider stability by supporting Kyiv, adding: \"If we defend our national interest, if we're talking about the peace, if we're talking about democracy, the Trump administration has to be on the side of Ukraine. \"Ukraine is the largest country in Europe and the stability in the largest countries in Europe can bring the stability of the whole region.\" But asked if he trusts Mr Trump, Mr Klitschko - who has been mayor since 2014 - had to take a lengthy pause before saying: \"I try to trust him, but sometimes I don't understand clearly the messages from President Trump regarding peace in Ukraine. \"Peace in Ukraine is very important.\" The state of peace talks US-brokered peace talks between Moscow and Kyiv are ongoing, and the latest round took place in Geneva earlier this week. White House spokeswoman Karoline Leavitt said on Wednesday that \"meaningful progress\" had been made - but speaking in his nightly address, Volodymyr Zelenskyy said he was dissatisfied with the talks. \"As of today, we cannot say that the result is sufficient,\" the Ukrainian president said. \"The military discussed certain issues seriously ‌and substantively. \"Sensitive political matters, possible compromises and the necessary meeting of leaders have not yet been sufficiently addressed.\" Mr Klitschko told Sky News any peace deal should not be a \"capitulation agreement\". Read more:Russian detained over shooting of generalUkraine battles to keep Russia banned from football Speaking to Reuters news agency on the condition of anonymity, five of Europe's intelligence chiefs this week said they believe Russia does not want to end the war quickly. Four claimed Moscow is using the peace talks to push for sanctions relief and business deals, with one stating: \"Russia is not seeking a peace agreement. They are seeking their strategic goals, and those have not changed.\" Russia and Ukraine launch overnight strikes Mr Klitschko's comments came after Kyiv said on Saturday morning that it had struck an industrial site deep inside Russia. Ukraine said it hit a Russian plant manufacturing ballistic missiles in the remote Udmurtia region. Alexander Brechalov, the region's governor, ​said there had been \"damage and injuries\" after a site was attacked overnight with drones. Russia also attacked Ukraine overnight into Saturday, launching 120 drones and one ballistic missile, Ukraine's air force said. Oleh Kiper, the head of the Odesa region, said drones had damaged civilian and energy infrastructure facilities, including a secondary school and an energy company's warehouses. Two people were injured, he said in a statement on Telegram. Watch the full interview with Vitali Klitschko on Sunday Morning With Trevor Phillips at 8.30am. "
    },
    {
        "title": "NASA says moon mission could be delayed after discovering rocket fault",
        "description": "NASA may delay its mission to send astronauts to the moon for the first time in more than half a century after discovering a fault with its rocket.",
        "url": "https://news.sky.com/story/nasa-says-moon-mission-could-be-delayed-after-discovering-rocket-fault-13510481",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-artemis-nasa_7154154.jpg?20260203100139",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-21 17:17:00",
        "Headline": "Before the setback, the agency had announced that it was targeting 6 March to launch four astronauts around the moon and back.",
        "Content": "NASA may delay its mission to send astronauts to the moon for the first time in more than half a century after discovering a fault with its rocket. Artemis II has been due to blast off from Florida's Kennedy Space Center from as early as March. On Friday night, however, NASA discovered that the flow of helium - which is required for launch - to the rocket had been interrupted during a key part of the preparation process. A NASA spokesperson said: \"This will almost assuredly ​impact the March launch window.\" Before the setback, the agency had announced that it was targeting 6 March to launch four astronauts around the moon and back. The crew includes three ⁠US astronauts - Reid Wiseman, Victor Glover and Christina Koch - and Canadian ​Jeremy Hansen. They would become the first astronauts to fly to the moon since Apollo 17 in 1972 and make the farthest human flight into space ⁠ever. Read more:Everything to know about Artemis II There are no plans for the mission to land on its surface, however. Artemis II is ​a precursor to NASA's planned astronaut moon landing ​with Artemis III, which is scheduled for 2028. The Artemis missions are part of NASA's long-term plans to build a space station - called Lunar Gateway - where astronauts will be able to live and work and prepare for missions to Mars. A first rehearsal for the launch earlier this month was disrupted after a hydrogen leak was discovered. But a second test was completed on Thursday without any leaks identified after technicians replaced two seals, which launch director Charlie Blackwell-Thompson described as \"a big step in us earning our right to fly\". When the 10-day mission is able to go ahead, it will see the crew testing life support, navigation, and communication systems to confirm everything operates as it should in deep space. The capsule will then enter Earth's high orbit where the crew will manually pilot Orion before control is handed back to controllers at NASA's Johnson Space Center in Houston, Texas. The astronauts will then spend four days circling the moon, travelling approximately 4,600 miles beyond its far side before returning to Earth and splashing down in the Pacific Ocean."
    },
    {
        "title": "London Bridge terror attack officer sacked over 'offensive' Traveller messages",
        "description": "One of the first police officers on the scene of the 2017 London Bridge terror attack has been sacked for gross misconduct for his use of the word \"pikey\" in messages about Gypsy, Roma, and Traveller people.",
        "url": "https://news.sky.com/story/london-bridge-terror-attack-officer-sacked-over-offensive-traveller-messages-13510335",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-london-bridge-terror-attack_7170995.jpg?20260221154010",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-21 15:12:00",
        "Headline": "In one WhatsApp message, Detective Constable Mark Luker of British Transport Police used the term \"dags\", referencing a scene from the Guy Ritchie film Snatch. ",
        "Content": "One of the first police officers on the scene of the 2017 London Bridge terror attack has been sacked for gross misconduct for his use of the word \"pikey\" in messages about Gypsy, Roma, and Traveller people. In one WhatsApp message, Detective Constable Mark Luker of British Transport Police used the term \"dags\". He was referencing a scene from the Guy Ritchie film Snatch in which Stephen Graham's character struggles to understand Brad Pitt's character's accent when he mentions dogs, the misconduct panel heard. In another message Mr Luker referred to \"scrap metal, lead roofing and cable\", which he accepted was a joke to link theft to the Irish Traveller community, the panel was told. The panel concluded he was likely aware the language was \"offensive\" to a minority community and ruled it gross misconduct. But it accepted that DC Luker is not \"inherently racist\". The panel wrote: \"As an experienced BTP police officer used to dealing with a whole range of people, the panel found that, on the balance of probabilities, he probably would have known that this was an especially offensive use of language directed towards members of a minority community.\" Read more from Sky NewsBodies found in mountainsBishop of Lincoln arrested Mr Luker was on a WhatsApp group called \"Selbie Gumshoes\" with other members of the Major Serious and Organised Crime (MSOC) team, the panel heard. On 31 December 2024, discussing someone winning a bottle of whiskey that still had a security tag attached, he wrote: \"Was this a raffle on a certain kind of site? Lots of mobile type homes? Lots of 'Dags'.\" He added: \"You are the MSOC pikey liaison.\" The panel found these were \"deliberate messages, that clearly link the Irish Traveller community to acts of theft\". It said the use of the word \"dags\" in messages was \"derogatory\" as it refers to a scene in Snatch where a Gypsy character's accent is \"mocked\". On 17 March 2025, another group member shared a video of \"Paddy Day parade on Inishbofin\", with the message: \"Just like a Disney World Parade. They know how to put on a show.\" Mr Luker replied: \"Off to find some scrap metal, lead roofing and cable.\" The panel concluded this was \"deliberate and discriminatory\", linking the Gypsy, Roma, and Traveller community to theft. On 27 March 2025, he again used the word \"pikey\", which the panel found to be \"disrespectful\". Mr Luker said he was one of the first responders to the London Bridge terror attack and one of his coping mechanisms for dealing with that day can involve the use of humour. He said he did not intend to be offensive when using the word \"pikey\" in messages."
    },
    {
        "title": "Bodies found in Eryri mountain range during search for two missing men",
        "description": "Two bodies have been found in the Eryri mountain range (Snowdonia) during a search for two missing men, North Wales Police have said.",
        "url": "https://news.sky.com/story/bodies-found-in-eryri-mountain-range-during-search-for-two-missing-men-13510256",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-snowdon-snowdon-massif_7170808.jpg?20260221115332",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-21 11:17:00",
        "Headline": "An \"extensive multi-agency operation\" was carried out in full winter conditions to find two men aged 19 and 20, says the head of a rescue team.",
        "Content": "Two bodies have been found in the Eryri mountain range (Snowdonia) during a search for two missing men, North Wales Police have said. Concerns were raised to police over the welfare of the men, aged 19 and 20, on Wednesday. Crews from Llanberis Mountain Rescue Team, Aberglaslyn Mountain Rescue Team, RAF Mountain Rescue Service, SARDA and HM Coastguard were deployed and carried out extensive searches on Yr Wyddfa (Snowdon). North Wales Police said in a statement: \"Tragically, the bodies of the two men were located and recovered as part of these co-ordinated search efforts. \"Both have now been formally identified, and their families have been informed.\" Jurgen Dissmann, chair of Llanberis Mountain Rescue Team, said that he wanted to extend his \"most heartfelt condolences\" to the families and loved ones of the two men. He said: \"The team were tasked by North Wales Police and launched an extensive multi-agency operation in full winter conditions. \n                  Andrew latest: Kate makes first appearance since Andrew arrest - as police searches continue\n                 \n                  Inaccurate evidence from AI tool led to police pursuing ban on Israeli football fans, MPs find\n                 \n                  Sweeping school reforms to be unveiled - but one mum says it's 'just what I was fearing'\n                 \"Volunteers searched across challenging mountain terrain in snow and ice, working long hours through the night in difficult weather in an effort to locate the pair as quickly as possible. \"Despite the determined and sustained commitment of everyone involved, we are deeply saddened that, despite all efforts, the outcome was not what we had hoped for.\" Read more from Sky News:'Most notorious prisoner' vows to 'expose unlawful sentence'Inside lab that could be crucial for women's rugby future Meanwhile, officers from Police Scotland are trying to find a climber who failed to return from a planned hike on Ben Nevis. Brian Mcgillicuddy, 64, was reported missing on Thursday, having last been seen at 4am on Glasdrum Road in Fort William. Police Scotland believes the hiker planned to walk up to the Charles Inglis Clark Hut, which is typically used by mountaineers as a base camp on the north face of Ben Nevis. Sergeant Paige Macdonald said: \"Brian is an experienced hill walker, but he did not return from his planned hike and has not been heard from since.\" Mr Mcgillicuddy is 6ft 1in tall, of slim build, with short grey and white hair. He was wearing a white climbing helmet, a dark blue jacket, white jeans and blue and red gaiters, when he was last seen. Anyone with information is asked to contact Police Scotland."
    },
    {
        "title": "Bishop of Lincoln arrested on suspicion of sexual assault",
        "description": "The Bishop of Lincoln, the Right Reverend Stephen Conway, has been arrested on suspicion of sexual assault.",
        "url": "https://news.sky.com/story/bishop-of-lincoln-arrested-on-suspicion-of-sexual-assault-13510228",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bishop-of-lincoln-stephen-conway_7170779.jpg?20260221102306",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-21 07:40:00",
        "Headline": "Bishop Stephen Conway, who has been Bishop of Lincoln since 2023, has been suspended from his duties following a complaint to the Church of England's national safeguarding team.",
        "Content": "The Bishop of Lincoln, the Right Reverend Stephen Conway, has been arrested on suspicion of sexual assault. Lincolnshire Police confirmed a 68-year-old man had been arrested as part of an \"ongoing investigation following an allegation that a man was sexually assaulted between 2018 and 2025\". Bishop Conway has been released on conditional bail. Earlier, a statement shared on the Diocese of Lincoln website confirmed the bishop had been \"suspended from ministry\" following a complaint to the Church of England's national safeguarding team. The statement said \"support is in place for those affected\", and a referral had been made to the \"appropriate statutory authorities\". No details of the complaint were given. The statement added: \"We understand that this will be a deeply unsettling time\". \n                  Sarah Mullally's confirmation is immense step for Church of England - but could be just what it needs\n                 \n                  Church of England charities reprimanded for handling of sexual assault allegations against former bishop\n                 \n                  How did Gen Z become the most religious generation alive?\n                 The Bishop of Grantham, the Right Reverend Dr Nicholas Chamberlain, will be standing in during the suspension. Bishop Conway has been Bishop of Lincoln since 2023, and has previously served as Bishop of Ramsbury and Bishop of Ely. He has been a member of the House of Lords since 2014. Sky News has contacted Bishop Conway for comment."
    },
    {
        "title": "Sweeping school reforms to be unveiled - but one mum says it's 'just what I was fearing'",
        "description": "Sweeping education reforms aimed at halving the disadvantage gap are to be unveiled by the government, with the plans also expected to include significant changes to the special educational needs and disabilities (SEND) system.",
        "url": "https://news.sky.com/story/sweeping-school-reforms-to-be-unveiled-but-one-mum-says-its-just-what-i-was-fearing-13510352",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-school-education_7006609.jpg?20250830224008",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2026-02-21 15:42:00",
        "Headline": "Education Secretary Bridget Phillipson has claimed that the reforms represent a significant shift in how opportunity is delivered through the school system. Some parents fear their children could be left behind.",
        "Content": "\n          Education reporter\n       Sweeping education reforms aimed at halving the disadvantage gap are to be unveiled by the government, with the plans also expected to include significant changes to the special educational needs and disabilities (SEND) system. Ministers will aim to close the attainment gap between poorer pupils and more affluent peers, with a long-term target to halve the disadvantage gap by the time today's youngest pupils reach the end of secondary school. Education Secretary Bridget Phillipson described the proposals as a \"golden opportunity to cut the link between background and success\". \"Our schools have made great strides in recent decades,\" she said. \"Yet for too long, many children in our country have been let down by a one-size-fits-all system, denied opportunity because they're poor or because they have additional needs.\" The government's schools white paper - the policy document setting out its plans for future legislation - will also recommend changes to how disadvantage funding is allocated. Rather than relying primarily on free school meal eligibility, funding could instead consider factors such as household income levels, duration of disadvantage and geographic location. Ministers say this would reduce administrative burden on schools and ensure support reaches pupils who need it most, including those whose families do not formally claim free school meals. The government will also set a target to recover 20 million lost school days a year by 2028/29 compared with 2023/24 levels, alongside incentives of up to £15,000 to encourage new headteachers to work in areas facing recruitment challenges. Concern over SEND However, much of the public discussion ahead of publication has focused on proposed SEND reforms, which were leaked earlier this week. It's provoked anxiety among some families, who fear their access to specialist support could be reduced. Reports suggest that from 2029, Education, Health and Care Plans (EHCPs) - which specify the support required for those with additional needs - could be reassessed at the end of primary school. A new legally recognised framework known as Individual Support Plans (ISPs) would meanwhile be introduced for all children with SEND. Read more:Pupils with SEND to have support reviewedEducation sec: Schools should be 'phone-free' For some parents, the proposals have triggered deep concern about continuity of support during key transitions, particularly for children with complex needs. Tiya Currie's son, Arun, is diagnosed with delayed language disorder (DLD), a lifelong disability that impacts the speaking and understanding of language. 'I'm extremely scared' \"EHCPs will be removed for my child when he will need it for his secondary school,\" Ms Currie told Sky News. \"Just what I was fearing. \"In that time there is no way they will have mainstreams (schools) skilled up to a level to accommodate severe language disorders like DLD. And without EHCP, his access to speech and language therapy will be removed.\" The north London mother claimed the proposed changes left her \"extremely scared\" for her son's future. Parents and campaigners warn any move away from EHCPs risks reducing access to therapies such as speech and language therapy (SLT) and occupational therapy, which are often specified within legally binding plans. Others argue changing the structure of plans will not address long-standing shortages in specialist provision. Education Secretary Bridget Phillipson will be appearing on Sunday Morning with Trevor Phillips - watch on Sky News from 8.30am."
    },
    {
        "title": "Bodies found in Eryri mountain range during search for two missing men",
        "description": "Two bodies have been found in the Eryri mountain range (Snowdonia) during a search for two missing men, North Wales Police have said.",
        "url": "https://news.sky.com/story/bodies-found-in-eryri-mountain-range-during-search-for-two-missing-men-13510256",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-snowdon-snowdon-massif_7170808.jpg?20260221115332",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-21 11:17:00",
        "Headline": "An \"extensive multi-agency operation\" was carried out in full winter conditions to find two men aged 19 and 20, says the head of a rescue team.",
        "Content": "Two bodies have been found in the Eryri mountain range (Snowdonia) during a search for two missing men, North Wales Police have said. Concerns were raised to police over the welfare of the men, aged 19 and 20, on Wednesday. Crews from Llanberis Mountain Rescue Team, Aberglaslyn Mountain Rescue Team, RAF Mountain Rescue Service, SARDA and HM Coastguard were deployed and carried out extensive searches on Yr Wyddfa (Snowdon). North Wales Police said in a statement: \"Tragically, the bodies of the two men were located and recovered as part of these co-ordinated search efforts. \"Both have now been formally identified, and their families have been informed.\" Jurgen Dissmann, chair of Llanberis Mountain Rescue Team, said that he wanted to extend his \"most heartfelt condolences\" to the families and loved ones of the two men. He said: \"The team were tasked by North Wales Police and launched an extensive multi-agency operation in full winter conditions. \n                  Andrew latest: Kate makes first appearance since Andrew arrest - as police searches continue\n                 \n                  Inaccurate evidence from AI tool led to police pursuing ban on Israeli football fans, MPs find\n                 \n                  Sweeping school reforms to be unveiled - but one mum says it's 'just what I was fearing'\n                 \"Volunteers searched across challenging mountain terrain in snow and ice, working long hours through the night in difficult weather in an effort to locate the pair as quickly as possible. \"Despite the determined and sustained commitment of everyone involved, we are deeply saddened that, despite all efforts, the outcome was not what we had hoped for.\" Read more from Sky News:'Most notorious prisoner' vows to 'expose unlawful sentence'Inside lab that could be crucial for women's rugby future Meanwhile, officers from Police Scotland are trying to find a climber who failed to return from a planned hike on Ben Nevis. Brian Mcgillicuddy, 64, was reported missing on Thursday, having last been seen at 4am on Glasdrum Road in Fort William. Police Scotland believes the hiker planned to walk up to the Charles Inglis Clark Hut, which is typically used by mountaineers as a base camp on the north face of Ben Nevis. Sergeant Paige Macdonald said: \"Brian is an experienced hill walker, but he did not return from his planned hike and has not been heard from since.\" Mr Mcgillicuddy is 6ft 1in tall, of slim build, with short grey and white hair. He was wearing a white climbing helmet, a dark blue jacket, white jeans and blue and red gaiters, when he was last seen. Anyone with information is asked to contact Police Scotland."
    },
    {
        "title": "London Bridge terror attack officer sacked over 'offensive' Traveller messages",
        "description": "One of the first police officers on the scene of the 2017 London Bridge terror attack has been sacked for gross misconduct for his use of the word \"pikey\" in messages about Gypsy, Roma, and Traveller people.",
        "url": "https://news.sky.com/story/london-bridge-terror-attack-officer-sacked-over-offensive-traveller-messages-13510335",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-london-bridge-terror-attack_7170995.jpg?20260221154010",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-21 15:12:00",
        "Headline": "In one WhatsApp message, Detective Constable Mark Luker of British Transport Police used the term \"dags\", referencing a scene from the Guy Ritchie film Snatch. ",
        "Content": "One of the first police officers on the scene of the 2017 London Bridge terror attack has been sacked for gross misconduct for his use of the word \"pikey\" in messages about Gypsy, Roma, and Traveller people. In one WhatsApp message, Detective Constable Mark Luker of British Transport Police used the term \"dags\". He was referencing a scene from the Guy Ritchie film Snatch in which Stephen Graham's character struggles to understand Brad Pitt's character's accent when he mentions dogs, the misconduct panel heard. In another message Mr Luker referred to \"scrap metal, lead roofing and cable\", which he accepted was a joke to link theft to the Irish Traveller community, the panel was told. The panel concluded he was likely aware the language was \"offensive\" to a minority community and ruled it gross misconduct. But it accepted that DC Luker is not \"inherently racist\". The panel wrote: \"As an experienced BTP police officer used to dealing with a whole range of people, the panel found that, on the balance of probabilities, he probably would have known that this was an especially offensive use of language directed towards members of a minority community.\" Read more from Sky NewsBodies found in mountainsBishop of Lincoln arrested Mr Luker was on a WhatsApp group called \"Selbie Gumshoes\" with other members of the Major Serious and Organised Crime (MSOC) team, the panel heard. On 31 December 2024, discussing someone winning a bottle of whiskey that still had a security tag attached, he wrote: \"Was this a raffle on a certain kind of site? Lots of mobile type homes? Lots of 'Dags'.\" He added: \"You are the MSOC pikey liaison.\" The panel found these were \"deliberate messages, that clearly link the Irish Traveller community to acts of theft\". It said the use of the word \"dags\" in messages was \"derogatory\" as it refers to a scene in Snatch where a Gypsy character's accent is \"mocked\". On 17 March 2025, another group member shared a video of \"Paddy Day parade on Inishbofin\", with the message: \"Just like a Disney World Parade. They know how to put on a show.\" Mr Luker replied: \"Off to find some scrap metal, lead roofing and cable.\" The panel concluded this was \"deliberate and discriminatory\", linking the Gypsy, Roma, and Traveller community to theft. On 27 March 2025, he again used the word \"pikey\", which the panel found to be \"disrespectful\". Mr Luker said he was one of the first responders to the London Bridge terror attack and one of his coping mechanisms for dealing with that day can involve the use of humour. He said he did not intend to be offensive when using the word \"pikey\" in messages."
    },
    {
        "title": "Over 1,000 councillors sign Palestine solidarity pledge amid claims of 'political opportunism'",
        "description": "More than a thousand local councillors have signed a pledge of solidarity with the Palestinian people.",
        "url": "https://news.sky.com/story/over-1000-councillors-sign-palestine-solidarity-pledge-amid-claims-of-political-opportunism-13510205",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-palestine-palestine-pledge_7170694.jpg?20260221011007",
        "type": "UK",
        "Author": "Amanda Akass",
        "Date Published": "2026-02-21 00:01:00",
        "Headline": "They signed up to \"uphold the inalienable rights of the Palestinian people\" and ensure their council is not complicit in what they claim are \"Israel's violations of international law\".",
        "Content": "\n          Political correspondent\n              @amandaakass\n More than a thousand local councillors have signed a pledge of solidarity with the Palestinian people. With so many Labour-run councils already in jeopardy in the forthcoming local elections, campaigners believe this could be a deciding issue in key areas. But the Israeli embassy says the pledge is a \"disgraceful effort at intimidation\". In total, 1,028 councillors have now signed up to \"uphold the inalienable rights of the Palestinian people\" and ensure their council is not complicit in what they claim are \"Israel's violations of international law\", such as divesting from pension funds invested in arms companies. Among the signatories is Hackney Green councillor Zoe Garbett. \"I think that this is really important to uphold the rights of the Palestinian people and to make sure that we can make ethical investments,\" she told Sky News, adding this was an issue residents had raised with the council. \"They want to see their council representing them on a national level,\" she said. \"We know that most people really want to see an end to the genocide in Gaza, and an end to wars and conflicts all across the world, and they want to see their local representatives standing up for them.\" Israel denies the accusations of genocide in Gaza. Most signatories from Greens and Labour So far, 345 of the councillors who've signed the Palestine Pledge are from the Greens, followed by 338 from Labour, 104 Lib Dems, 38 members of the SNP, 17 from Plaid Cymru, 12 from Your Party, three Conservatives and many more independents. Labour has long been divided on the issue of Gaza. The prime minister's initial reluctance to call for a ceasefire after the October 7 attacks led to a drop in support among Muslim communities at the last election. Four Labour MPs lost their seats to pro-Palestinian candidates in July 2024, and the party is now under increasing pressure from other parties on the left. Read more: What's happening with this year's local elections? The pledge provides a rough indication of where it could be a factor in the local elections. In Labour-dominated Islington, 59% of councillors pledged, mostly from Labour. In Tower Hamlets, 49% have signed up, nearly all from the controlling group on the council, Aspire, and none from the Labour block of 16 councillors. In Sheffield, where no party currently has overall control, 24% have signed up - including 13 Greens and seven Labour councillors. But in Labour-controlled Bradford, 29% have signed up - the majority are Greens and independents. In Hackney - where there have been big debates over the issue of divestment - 16% have pledged, with just three of them from Labour. Pledges from Labour left While the prime minister recognised Palestinian statehood in September, many on the Labour left would like to see him do more. \"I think that so many Labour councillors have been so keen to sign the Palestine pledge as councillors because it puts on record that support for Palestine and distinguishes them from the position taken by the leader of the Labour Party,\" Richard Burgon, Labour MP for Leeds East, said. The pledge was launched by the Palestine Solidarity Campaign - the group behind many of the protest marches in support of the Palestinian cause - and supported by four other organisations, the Palestinian Youth Movement Britain, the Palestinian Forum in Britain, The Muslim Vote and the British Palestinian Committee. 'Dangerous road to go down' Former MP Lord Steve McCabe, from Labour Friends of Israel, is concerned about the potential impact of the pledge, saying the campaign was \"trying to interfere in local elections\" and \"encourage councils to develop their own foreign policies\". \"I think it's a dangerous road to go down. I think undoubtedly it could create tensions in some communities,\" he said. Lord McCabe added that the campaign comes at a time of heightened antisemitism. He said: \"Jewish people are alarmed. They're scared to go to their synagogue. Sometimes they're frightened to walk the streets of their own community. How this will do anything to relieve tensions, I can't see.\" A spokesperson from the Israeli embassy in London said: \"Contrary to what has been portrayed in the campaign, Israel is actively engaged in implementing the 20-point programme established by the Board of Peace. \"It is regrettable to see small-scale political opportunism and grifting carried out on the backs of people in the Middle East. \"The BDS [Boycott, Divestment, Sanctions] campaign is a disgraceful effort at intimidation that echoes some of the darkest chapters of history. Calls for boycott[s] should be rejected.\" Government needs to 'wake up', says senior Tory Conservative shadow communities secretary James Cleverly also shared his concern about the boycotts. \"This Labour Government must wake up to the growing antisemitism in town halls across the country,\" he said. \"Councillors, including many Labour and Green ones, are signing up to Israel boycotts, which are frequently a cover for attacking Jewish people and culture. And they are being deployed in a cynical, sectarian way to try and win votes. \"Keir Starmer pledged to eradicate anti-Jewish hate from his party - but it clearly persists at the local level.\" A Labour spokesperson responded: \"In September, alongside our international partners, the Labour government took the historic decision to recognise the state of Palestine. \"Palestinians and Israelis alike have the right to live in peace, free from violence and suffering. We continue to work closely with international partners to progress phase two of the peace plan. \"With Keir Starmer's leadership, we have rooted antisemitism out of the Labour Party and the government is continuing to step up its efforts to tackle antisemitism wherever it rears its head across society.\" Read more from Sky News:Gorton and Denton by-election: The UK's first crucial voteAnalysis: Starmer has even more to lose after latest U-turn Dan Iley-Williamson, political organiser at the Palestine Solidarity Campaign, said local authorities \"administer pension funds that invest more than £12bn in companies enabling Israel's crimes, including in arms firms that make the bombs and bullets used to kill Palestinians\". \"The mass movement for Palestine - which has brought millions onto Britain's streets - is not going away,\" he added. \"Vote Palestine will take our demands into the May elections and deliver a message to those seeking office: If you want our votes, stand up for Palestine.\""
    },
    {
        "title": "Bishop of Lincoln arrested on suspicion of sexual assault",
        "description": "The Bishop of Lincoln, the Right Reverend Stephen Conway, has been arrested on suspicion of sexual assault.",
        "url": "https://news.sky.com/story/bishop-of-lincoln-arrested-on-suspicion-of-sexual-assault-13510228",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-bishop-of-lincoln-stephen-conway_7170779.jpg?20260221102306",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-21 07:40:00",
        "Headline": "Bishop Stephen Conway, who has been Bishop of Lincoln since 2023, has been suspended from his duties following a complaint to the Church of England's national safeguarding team.",
        "Content": "The Bishop of Lincoln, the Right Reverend Stephen Conway, has been arrested on suspicion of sexual assault. Lincolnshire Police confirmed a 68-year-old man had been arrested as part of an \"ongoing investigation following an allegation that a man was sexually assaulted between 2018 and 2025\". Bishop Conway has been released on conditional bail. Earlier, a statement shared on the Diocese of Lincoln website confirmed the bishop had been \"suspended from ministry\" following a complaint to the Church of England's national safeguarding team. The statement said \"support is in place for those affected\", and a referral had been made to the \"appropriate statutory authorities\". No details of the complaint were given. The statement added: \"We understand that this will be a deeply unsettling time\". \n                  Sarah Mullally's confirmation is immense step for Church of England - but could be just what it needs\n                 \n                  Church of England charities reprimanded for handling of sexual assault allegations against former bishop\n                 \n                  How did Gen Z become the most religious generation alive?\n                 The Bishop of Grantham, the Right Reverend Dr Nicholas Chamberlain, will be standing in during the suspension. Bishop Conway has been Bishop of Lincoln since 2023, and has previously served as Bishop of Ramsbury and Bishop of Ely. He has been a member of the House of Lords since 2014. Sky News has contacted Bishop Conway for comment."
    },
    {
        "title": "Abbey Road is opening its doors for a rave: 'There's something about this place - hopefully we don't ruin it'",
        "description": "\"You will receive a text message after this call. Just follow the instructions....\"",
        "url": "https://news.sky.com/story/abbey-road-is-opening-its-doors-for-a-rave-theres-something-about-this-place-hopefully-we-dont-ruin-it-13509201",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-soulwax-2manydjs-abbey-road-rave_7169971.jpg?20260220085708",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-21 00:01:00",
        "Headline": "Sky News speaks to brothers David and Stephen Dewaele, also known as Soulwax, as they prepare to host the very first such event at the iconic Abbey Road Studios.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n \"You will receive a text message after this call. Just follow the instructions....\" This was the message for fans hoping to bag a spot for something unusual at Abbey Road Studios tonight. It is the world's first - and most famous - music studio, synonymous with The Beatles and with a Who's Who of artists it has welcomed over the decades, from Pink Floyd, Stevie Wonder and Kate Bush to Oasis, Radiohead and Blur, as well as the late Amy Winehouse, Lady Gaga and Stormzy. Now, it is doing something a little different - opening its doors to clubbers. Abbey Road After Hours, curated by electronic pioneers Soulwax, is the venue's first-ever \"rave\", a late-night party for just 340 fans who will be hitting the dancefloor in Studio 1. Brothers David and Stephen Dewaele, the Belgian musicians behind Soulwax, say it was an opportunity they could not refuse. \"Who doesn't want to do a party at Abbey Road?\" says Stephen. \"It's very hard to explain to people, but there's something when you walk into this building because there's so much history, but it also feels… \"For Dave and me, one idea after the other came just by walking from one of the rooms to the other room. So there's something about this place. And hopefully we don't ruin it.\" Soulwax went old-school, asking fans to call a special hotline in a nod to the method of discovering the secret locations of raves in the late 1980s and early '90s. While tonight's event won't be as rough-and-ready as raves were back in the day (the venue is already known, and it finishes at 1am, for a start), they are promising \"a good party\". (Glow sticks optional). Around 4,000 people tried to get tickets, with demand at more than 10 times the available capacity. \"It's really been exponentially way more than we thought and also way more than we can fit in,\" says Stephen. \"But we're filming the whole thing, so hopefully people will be able to see it afterwards.\" The brothers have been working at Abbey Road for the past few days, recording new music and cutting directly to vinyl, ready to play out live for the first time to tonight's ravers. They are sitting in Studio 1 as they talk to Sky News during a quick break from their work. This is the room where recorded music history began in 1931. The Beatles performed All You Need Is Love for the world's first global satellite broadcast here, and where some of the greatest film scores of the last 45 years have been recorded, from Raiders Of The Lost Ark and The Return Of The Jedi, to Harry Potter and Wicked. An attraction to 'stupid' ideas? Soulwax are electronic innovators who have been pushing boundaries since the mid-1990s. As well as being a band, they are DJs (2manydjs), a record label (DEEWEE), co-creators of their own custom-built soundsystem (Despacio), and Grammy-nominated producers. They are also known for their boundary-breaking live shows, so an Abbey Road rave seems like a good fit. \"Are you saying we have an attraction to stupid ideas?\" laughs David. \"Because we do... yeah, it fits completely because we've got sort of one foot very much in this world where… not just for us, I think most people's musical DNA is sort of shaped by these rooms, isn't it? Whether it's popular music or classical, and it's such a big part of the musical vernacular. So for us to be given the opportunity to bring something new in here, of course, yes, in our minds it makes complete sense.\" The idea is the brainchild of Mark Robertson, director of marketing and creative at Abbey Road, who says they are always looking for ways to innovate and expand on the traditional uses for the venue. \"I guess that spirit of creative exploration is why hosting a rave here in our house feels like the right thing to do,\" he says. \"Number one, it's unexpected. Number two, it's a way that we can bring people into the building, for fans to actually embrace the music… \"Being able to share some of our story with those people that are coming here for something really special is a great thing.\" Read more from Sky News entertainment:'The Ozzy tape I never played'Derry Girls creator on new show As a rave fan, Mark says it is exciting to bring that world into Abbey Road. \"It's kind of a strange thing... I think about all the different club nights that I've been to over the years, and now to come back and actually bring it into this place is amazing.\" So will there be more Abbey Road raves in the future? \"Never say never.\""
    },
    {
        "title": "Vitali Klitschko tells Sky News his message to Donald Trump",
        "description": "Vitali Klitschko has urged Donald Trump \"to be on the side of Ukraine\" during peace talks with Russia - but the mayor of Kyiv admitted to Sky News he sometimes finds the president's messaging hard to understand.",
        "url": "https://news.sky.com/story/us-support-is-critically-important-for-ukraines-war-effort-says-kyiv-mayor-vitali-klitschko-13510284",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-vitali-klitschko-ukraine_7170900.jpg?20260221154303",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-21 13:45:00",
        "Headline": "America's support of Ukraine is \"critically important\" and will be felt beyond the country's borders, the boxing legend told Sky's Trevor Phillips.",
        "Content": "Vitali Klitschko has urged Donald Trump \"to be on the side of Ukraine\" during peace talks with Russia - but the mayor of Kyiv admitted to Sky News he sometimes finds the president's messaging hard to understand. Speaking to Sunday Morning With Trevor Phillips, the former world heavyweight boxing champion said it was \"critically important\" to have Washington on his country's side in its battle against Russia. Asked if he is confident the US president will support Ukraine's attempts to hold as much of its territory as possible during peace negotiations, Mr Klitschko said: \"It's the United States, it's very important. It's critically important.\" He argued the US could secure wider stability by supporting Kyiv, adding: \"If we defend our national interest, if we're talking about the peace, if we're talking about democracy, the Trump administration has to be on the side of Ukraine. \"Ukraine is the largest country in Europe and the stability in the largest countries in Europe can bring the stability of the whole region.\" But asked if he trusts Mr Trump, Mr Klitschko - who has been mayor since 2014 - had to take a lengthy pause before saying: \"I try to trust him, but sometimes I don't understand clearly the messages from President Trump regarding peace in Ukraine. \"Peace in Ukraine is very important.\" The state of peace talks US-brokered peace talks between Moscow and Kyiv are ongoing, and the latest round took place in Geneva earlier this week. White House spokeswoman Karoline Leavitt said on Wednesday that \"meaningful progress\" had been made - but speaking in his nightly address, Volodymyr Zelenskyy said he was dissatisfied with the talks. \"As of today, we cannot say that the result is sufficient,\" the Ukrainian president said. \"The military discussed certain issues seriously ‌and substantively. \"Sensitive political matters, possible compromises and the necessary meeting of leaders have not yet been sufficiently addressed.\" Mr Klitschko told Sky News any peace deal should not be a \"capitulation agreement\". Read more:Russian detained over shooting of generalUkraine battles to keep Russia banned from football Speaking to Reuters news agency on the condition of anonymity, five of Europe's intelligence chiefs this week said they believe Russia does not want to end the war quickly. Four claimed Moscow is using the peace talks to push for sanctions relief and business deals, with one stating: \"Russia is not seeking a peace agreement. They are seeking their strategic goals, and those have not changed.\" Russia and Ukraine launch overnight strikes Mr Klitschko's comments came after Kyiv said on Saturday morning that it had struck an industrial site deep inside Russia. Ukraine said it hit a Russian plant manufacturing ballistic missiles in the remote Udmurtia region. Alexander Brechalov, the region's governor, ​said there had been \"damage and injuries\" after a site was attacked overnight with drones. Russia also attacked Ukraine overnight into Saturday, launching 120 drones and one ballistic missile, Ukraine's air force said. Oleh Kiper, the head of the Odesa region, said drones had damaged civilian and energy infrastructure facilities, including a secondary school and an energy company's warehouses. Two people were injured, he said in a statement on Telegram. Watch the full interview with Vitali Klitschko on Sunday Morning With Trevor Phillips at 8.30am. "
    },
    {
        "title": "Thousands march in Lyon after killing of far-right activist Quentin Deranque",
        "description": "Some 3,000 people joined a march in France on Saturday after the killing of a far-right activist in an incident that shocked the nation.",
        "url": "https://news.sky.com/story/thousands-march-in-lyon-after-killing-of-far-right-activist-quentin-deranque-13510594",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-lyon-france-deranque_7171442.jpg?20260221213448",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-21 21:13:00",
        "Headline": "Quentin Deranque, 23, died in hospital last week after being beaten during a clash between far-right and far-left groups.",
        "Content": "Some 3,000 people joined a march in France on Saturday after the killing of a far-right activist in an incident that shocked the nation. Quentin Deranque, 23, died in hospital from brain injuries last week after being beaten in Lyon, where clashes between far-right and far-left groups have become more frequent. A minute's silence was held before the start of the march, organised by far-right groups, which saw some demonstrators hold white tulips while others carried banners and placards. Many people dressed in black, some with their faces partially covered, and chanted \"justice for Quentin\" and \"antifa assassin\". The march took place under heavy police scrutiny with no major incidents recorded, but the local authority said it had reported Nazi salutes and racist ‌insults filmed during the march to the prosecutor, after videos circulated on social media. French President Emmanuel Macron had called for calm ahead of the demonstration, saying: \"This is a moment of remembrance and respect for this young compatriot who was killed, for his family and loved ones. That must come first. \"And then it is a moment of firmness and responsibility.\" Mr Deranque's parents also called for calm and did not take part in the march. The 23-year-old died after being attacked during a fight that erupted between far-left and far-right supporters, on the margins of a student meeting where a far-left lawmaker was a keynote speaker. Clashes between the two sides have become frequent in Lyon. The fighting often takes the form of organised street battles in the city, sometimes involving groups of several dozen people. The city is seen by intelligence services as the cradle of far-right activism in France. Its left-leaning militant groups have been formed more recently, in reaction to the many far-right groups that have been active for several decades. Read more:British far-right activists 'banned from France'London terror attack cop sacked over 'offensive' texts Seven people are ⁠under formal investigation for their alleged roles in Mr Deranque's murder, including a former aide to a lawmaker for the ‌hard-left France Unbowed (LFI) party, which has condemned the killing. LFI's opponents have accused it of stirring up violence and tensions with its combative far-left politics. Its leader, Jean-Luc Melenchon, has condemned the violence and insisted his party is not to blame for the tragedy."
    },
    {
        "title": "Three men killed in US strike on alleged drug boat",
        "description": "The US military says it has struck a boat \"engaged in narco-trafficking operations\", killing three men.",
        "url": "https://news.sky.com/story/three-men-killed-in-us-strike-on-alleged-drug-boat-13510216",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-us-narcoterrorist_7170700.jpg?20260221051929",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-21 04:48:00",
        "Headline": "Footage of the strike shows the small boat floating in the Pacific Ocean before an explosion, causing it to burst into flames.",
        "Content": "The US military says it has struck a boat \"engaged in narco-trafficking operations\", killing three men. The vessel \"was transiting along known narco-trafficking routes in the Eastern Pacific and was engaged in narco-trafficking operations\", the US Southern Command said on X. The military has not provided evidence that the boat or the men on board were involved in drug trafficking. Footage of the strike on Friday shows the small boat floating in the Pacific before an explosion, causing it to burst into flames. President Donald Trump previously said the US is in \"armed conflict\" with cartels in Latin America. US strikes on alleged drug boats have killed at least 148 people in at least 43 attacks in the Caribbean Sea and eastern Pacific Ocean since September, including 11 people earlier this week. Read more from Sky News:Trump announces global tariffTrump's trade war is not over Mr Trump has justified the attacks as a necessary escalation to stem the flow of drugs. But critics have questioned the legality and effectiveness of the strikes, as the fentanyl behind many fatal overdoses is smuggled into the US via land from Mexico, where it is produced with chemicals imported from China and India. In January, the US launched a direct military attack on Venezuela, extraditing Nicolas Maduro and his wife Cilia Flores, transporting them both to New York to face narcoterrorism and other charges, which both deny."
    },
    {
        "title": "NASA says moon mission could be delayed after discovering rocket fault",
        "description": "NASA may delay its mission to send astronauts to the moon for the first time in more than half a century after discovering a fault with its rocket.",
        "url": "https://news.sky.com/story/nasa-says-moon-mission-could-be-delayed-after-discovering-rocket-fault-13510481",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-artemis-nasa_7154154.jpg?20260203100139",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-21 17:17:00",
        "Headline": "Before the setback, the agency had announced that it was targeting 6 March to launch four astronauts around the moon and back.",
        "Content": "NASA may delay its mission to send astronauts to the moon for the first time in more than half a century after discovering a fault with its rocket. Artemis II has been due to blast off from Florida's Kennedy Space Center from as early as March. On Friday night, however, NASA discovered that the flow of helium - which is required for launch - to the rocket had been interrupted during a key part of the preparation process. A NASA spokesperson said: \"This will almost assuredly ​impact the March launch window.\" Before the setback, the agency had announced that it was targeting 6 March to launch four astronauts around the moon and back. The crew includes three ⁠US astronauts - Reid Wiseman, Victor Glover and Christina Koch - and Canadian ​Jeremy Hansen. They would become the first astronauts to fly to the moon since Apollo 17 in 1972 and make the farthest human flight into space ⁠ever. Read more:Everything to know about Artemis II There are no plans for the mission to land on its surface, however. Artemis II is ​a precursor to NASA's planned astronaut moon landing ​with Artemis III, which is scheduled for 2028. The Artemis missions are part of NASA's long-term plans to build a space station - called Lunar Gateway - where astronauts will be able to live and work and prepare for missions to Mars. A first rehearsal for the launch earlier this month was disrupted after a hydrogen leak was discovered. But a second test was completed on Thursday without any leaks identified after technicians replaced two seals, which launch director Charlie Blackwell-Thompson described as \"a big step in us earning our right to fly\". When the 10-day mission is able to go ahead, it will see the crew testing life support, navigation, and communication systems to confirm everything operates as it should in deep space. The capsule will then enter Earth's high orbit where the crew will manually pilot Orion before control is handed back to controllers at NASA's Johnson Space Center in Houston, Texas. The astronauts will then spend four days circling the moon, travelling approximately 4,600 miles beyond its far side before returning to Earth and splashing down in the Pacific Ocean."
    },
    {
        "title": "Three men killed in US strike on alleged drug boat",
        "description": "The US military says it has struck a boat \"engaged in narco-trafficking operations\", killing three men.",
        "url": "https://news.sky.com/story/three-men-killed-in-us-strike-on-alleged-drug-boat-13510216",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-us-narcoterrorist_7170700.jpg?20260221051929",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-21 04:48:00",
        "Headline": "Footage of the strike shows the small boat floating in the Pacific Ocean before an explosion, causing it to burst into flames.",
        "Content": "The US military says it has struck a boat \"engaged in narco-trafficking operations\", killing three men. The vessel \"was transiting along known narco-trafficking routes in the Eastern Pacific and was engaged in narco-trafficking operations\", the US Southern Command said on X. The military has not provided evidence that the boat or the men on board were involved in drug trafficking. Footage of the strike on Friday shows the small boat floating in the Pacific before an explosion, causing it to burst into flames. President Donald Trump previously said the US is in \"armed conflict\" with cartels in Latin America. US strikes on alleged drug boats have killed at least 148 people in at least 43 attacks in the Caribbean Sea and eastern Pacific Ocean since September, including 11 people earlier this week. Read more from Sky News:Trump announces global tariffTrump's trade war is not over Mr Trump has justified the attacks as a necessary escalation to stem the flow of drugs. But critics have questioned the legality and effectiveness of the strikes, as the fentanyl behind many fatal overdoses is smuggled into the US via land from Mexico, where it is produced with chemicals imported from China and India. In January, the US launched a direct military attack on Venezuela, extraditing Nicolas Maduro and his wife Cilia Flores, transporting them both to New York to face narcoterrorism and other charges, which both deny."
    },
    {
        "title": "Court approves law requiring Louisiana schools to display Ten Commandments",
        "description": "A US court has cleared the way for a law to take effect, which requires the Ten Commandments to be displayed in public classrooms in Louisiana.",
        "url": "https://news.sky.com/story/court-approves-law-requiring-louisiana-schools-to-display-ten-commandments-13510225",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-ten-commandments-louisiana_7170745.jpg?20260221083506",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-21 07:29:00",
        "Headline": "There has been pressure from Republicans, including Donald Trump, to incorporate religion into public school classrooms, but it has prompted legal challenges on constitutional grounds.",
        "Content": "A US court has cleared the way for a law to take effect, which requires the Ten Commandments to be displayed in public classrooms in Louisiana. The policy is controversial because critics argue it violates the separation of church and state, while supporters believe the Ten Commandments are historical and part of the foundation of US law. On Friday, the 5th US Circuit Court of Appeals voted 12 to 6 to lift a block that a lower court first placed on the Louisiana law in 2024. In the opinion released Friday, the court said it was too early to make a judgment on whether the legislation was constitutional. The panel decided it did not have enough information to consider any First Amendment issues, including how prominent the religious text is in schools and whether teachers will refer to it during classes. Arkansas has a similar law that has been challenged in federal court. A Texas law also took effect on 1 September, marking the widest-reaching attempt in the nation to hang the Ten Commandments in public schools. Some Texas school districts were barred from posting the commandments after federal judges issued injunctions in two cases challenging the law, but they have already been put up in many classrooms across the state. Legal challenges have been brought on constitutional grounds, based on a principle designed to ensure that government and religious institutions operate independently of one another. \n                  Death row inmate in US executed using nitrogen gas after Supreme Court appeal fails\n                 \n                  Southern US braced for rare winter storm - as LA warned of further fires\n                 \n                  Brother of New Orleans attack victim Martin 'Tiger' Bech reveals last words shared between them\n                 Circuit Judge James Ho wrote that the new law was \"not just constitutional - it affirms our nation's highest and most noble traditions\". But six judges who voted against the decision wrote a series of opposing arguments. There are different interpretations of the Ten Commandments across Jewish, Catholic, Protestant and Orthodox traditions. Here is the Church of England's take on the religious and ethical directives: • I am the Lord your God: you shall have no other gods but me. • You shall not make for yourself any idol.\n • You shall not dishonour the name of the Lord your God.\n • Remember the Sabbath and keep it holy.\n • Honour your father and mother.\n • You shall not commit murder.\n • You shall not commit adultery. • You shall not steal.\n • You shall not be a false witness.\n • You shall not covet anything which belongs to your neighbour.\n Some said the law exposes children to government-endorsed religion in a place where they are required to be, presenting a clear constitutional burden. Jeff Landry, Republican governor of Louisiana, celebrated the ruling on X, declaring, \"Common sense is making a comeback!\" Louisiana attorney general Liz Murrill said in a statement that \"don't kill or steal shouldn't be controversial\". \"My office has issued clear guidance to our public schools on how to comply with the law, and we have created multiple examples of posters demonstrating how it can be applied constitutionally. \"Louisiana public schools should follow the law,\" she added. Read more from Sky News:What next for Trump's tariffs?US strike on alleged drug boatUS politician wants Andrew meeting The Freedom From Religion Foundation called the ruling \"extremely disappointing\" while another group involved in the legal challenge, the American Civil Liberties Union (ACLU), pledged to explore all legal pathways to continue fighting the law. The laws represent pressure by Republicans, including Donald Trump, to incorporate religion into public school classrooms."
    },
    {
        "title": "Over 1,000 councillors sign Palestine solidarity pledge amid claims of 'political opportunism'",
        "description": "More than a thousand local councillors have signed a pledge of solidarity with the Palestinian people.",
        "url": "https://news.sky.com/story/over-1000-councillors-sign-palestine-solidarity-pledge-amid-claims-of-political-opportunism-13510205",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-palestine-palestine-pledge_7170694.jpg?20260221011007",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2026-02-21 00:01:00",
        "Headline": "They signed up to \"uphold the inalienable rights of the Palestinian people\" and ensure their council is not complicit in what they claim are \"Israel's violations of international law\".",
        "Content": "\n          Political correspondent\n              @amandaakass\n More than a thousand local councillors have signed a pledge of solidarity with the Palestinian people. With so many Labour-run councils already in jeopardy in the forthcoming local elections, campaigners believe this could be a deciding issue in key areas. But the Israeli embassy says the pledge is a \"disgraceful effort at intimidation\". In total, 1,028 councillors have now signed up to \"uphold the inalienable rights of the Palestinian people\" and ensure their council is not complicit in what they claim are \"Israel's violations of international law\", such as divesting from pension funds invested in arms companies. Among the signatories is Hackney Green councillor Zoe Garbett. \"I think that this is really important to uphold the rights of the Palestinian people and to make sure that we can make ethical investments,\" she told Sky News, adding this was an issue residents had raised with the council. \"They want to see their council representing them on a national level,\" she said. \"We know that most people really want to see an end to the genocide in Gaza, and an end to wars and conflicts all across the world, and they want to see their local representatives standing up for them.\" Israel denies the accusations of genocide in Gaza. Most signatories from Greens and Labour So far, 345 of the councillors who've signed the Palestine Pledge are from the Greens, followed by 338 from Labour, 104 Lib Dems, 38 members of the SNP, 17 from Plaid Cymru, 12 from Your Party, three Conservatives and many more independents. Labour has long been divided on the issue of Gaza. The prime minister's initial reluctance to call for a ceasefire after the October 7 attacks led to a drop in support among Muslim communities at the last election. Four Labour MPs lost their seats to pro-Palestinian candidates in July 2024, and the party is now under increasing pressure from other parties on the left. Read more: What's happening with this year's local elections? The pledge provides a rough indication of where it could be a factor in the local elections. In Labour-dominated Islington, 59% of councillors pledged, mostly from Labour. In Tower Hamlets, 49% have signed up, nearly all from the controlling group on the council, Aspire, and none from the Labour block of 16 councillors. In Sheffield, where no party currently has overall control, 24% have signed up - including 13 Greens and seven Labour councillors. But in Labour-controlled Bradford, 29% have signed up - the majority are Greens and independents. In Hackney - where there have been big debates over the issue of divestment - 16% have pledged, with just three of them from Labour. Pledges from Labour left While the prime minister recognised Palestinian statehood in September, many on the Labour left would like to see him do more. \"I think that so many Labour councillors have been so keen to sign the Palestine pledge as councillors because it puts on record that support for Palestine and distinguishes them from the position taken by the leader of the Labour Party,\" Richard Burgon, Labour MP for Leeds East, said. The pledge was launched by the Palestine Solidarity Campaign - the group behind many of the protest marches in support of the Palestinian cause - and supported by four other organisations, the Palestinian Youth Movement Britain, the Palestinian Forum in Britain, The Muslim Vote and the British Palestinian Committee. 'Dangerous road to go down' Former MP Lord Steve McCabe, from Labour Friends of Israel, is concerned about the potential impact of the pledge, saying the campaign was \"trying to interfere in local elections\" and \"encourage councils to develop their own foreign policies\". \"I think it's a dangerous road to go down. I think undoubtedly it could create tensions in some communities,\" he said. Lord McCabe added that the campaign comes at a time of heightened antisemitism. He said: \"Jewish people are alarmed. They're scared to go to their synagogue. Sometimes they're frightened to walk the streets of their own community. How this will do anything to relieve tensions, I can't see.\" A spokesperson from the Israeli embassy in London said: \"Contrary to what has been portrayed in the campaign, Israel is actively engaged in implementing the 20-point programme established by the Board of Peace. \"It is regrettable to see small-scale political opportunism and grifting carried out on the backs of people in the Middle East. \"The BDS [Boycott, Divestment, Sanctions] campaign is a disgraceful effort at intimidation that echoes some of the darkest chapters of history. Calls for boycott[s] should be rejected.\" Government needs to 'wake up', says senior Tory Conservative shadow communities secretary James Cleverly also shared his concern about the boycotts. \"This Labour Government must wake up to the growing antisemitism in town halls across the country,\" he said. \"Councillors, including many Labour and Green ones, are signing up to Israel boycotts, which are frequently a cover for attacking Jewish people and culture. And they are being deployed in a cynical, sectarian way to try and win votes. \"Keir Starmer pledged to eradicate anti-Jewish hate from his party - but it clearly persists at the local level.\" A Labour spokesperson responded: \"In September, alongside our international partners, the Labour government took the historic decision to recognise the state of Palestine. \"Palestinians and Israelis alike have the right to live in peace, free from violence and suffering. We continue to work closely with international partners to progress phase two of the peace plan. \"With Keir Starmer's leadership, we have rooted antisemitism out of the Labour Party and the government is continuing to step up its efforts to tackle antisemitism wherever it rears its head across society.\" Read more from Sky News:Gorton and Denton by-election: The UK's first crucial voteAnalysis: Starmer has even more to lose after latest U-turn Dan Iley-Williamson, political organiser at the Palestine Solidarity Campaign, said local authorities \"administer pension funds that invest more than £12bn in companies enabling Israel's crimes, including in arms firms that make the bombs and bullets used to kill Palestinians\". \"The mass movement for Palestine - which has brought millions onto Britain's streets - is not going away,\" he added. \"Vote Palestine will take our demands into the May elections and deliver a message to those seeking office: If you want our votes, stand up for Palestine.\""
    },
    {
        "title": "NASA says moon mission could be delayed after discovering rocket fault",
        "description": "NASA may delay its mission to send astronauts to the moon for the first time in more than half a century after discovering a fault with its rocket.",
        "url": "https://news.sky.com/story/nasa-says-moon-mission-could-be-delayed-after-discovering-rocket-fault-13510481",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-artemis-nasa_7154154.jpg?20260203100139",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-21 17:17:00",
        "Headline": "Before the setback, the agency had announced that it was targeting 6 March to launch four astronauts around the moon and back.",
        "Content": "NASA may delay its mission to send astronauts to the moon for the first time in more than half a century after discovering a fault with its rocket. Artemis II has been due to blast off from Florida's Kennedy Space Center from as early as March. On Friday night, however, NASA discovered that the flow of helium - which is required for launch - to the rocket had been interrupted during a key part of the preparation process. A NASA spokesperson said: \"This will almost assuredly ​impact the March launch window.\" Before the setback, the agency had announced that it was targeting 6 March to launch four astronauts around the moon and back. The crew includes three ⁠US astronauts - Reid Wiseman, Victor Glover and Christina Koch - and Canadian ​Jeremy Hansen. They would become the first astronauts to fly to the moon since Apollo 17 in 1972 and make the farthest human flight into space ⁠ever. Read more:Everything to know about Artemis II There are no plans for the mission to land on its surface, however. Artemis II is ​a precursor to NASA's planned astronaut moon landing ​with Artemis III, which is scheduled for 2028. The Artemis missions are part of NASA's long-term plans to build a space station - called Lunar Gateway - where astronauts will be able to live and work and prepare for missions to Mars. A first rehearsal for the launch earlier this month was disrupted after a hydrogen leak was discovered. But a second test was completed on Thursday without any leaks identified after technicians replaced two seals, which launch director Charlie Blackwell-Thompson described as \"a big step in us earning our right to fly\". When the 10-day mission is able to go ahead, it will see the crew testing life support, navigation, and communication systems to confirm everything operates as it should in deep space. The capsule will then enter Earth's high orbit where the crew will manually pilot Orion before control is handed back to controllers at NASA's Johnson Space Center in Houston, Texas. The astronauts will then spend four days circling the moon, travelling approximately 4,600 miles beyond its far side before returning to Earth and splashing down in the Pacific Ocean."
    },
    {
        "title": "Medical tampon could detect early signs of ovarian cancer",
        "description": "A new medical tampon may be able to detect the earliest signs of ovarian cancer, scientists have said.",
        "url": "https://news.sky.com/story/medical-tampon-could-detect-early-signs-of-ovarian-cancer-13509956",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-gallbladder-liver-bile-duct_7170103.jpg?20260220122808",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-21 00:01:00",
        "Headline": "A trial of the new device, described as a potential \"game-changer\" for the disease, is to be carried out by researchers in Southampton. Around 7,600 new cases of ovarian cancer are diagnosed in the UK each year.",
        "Content": "A new medical tampon may be able to detect the earliest signs of ovarian cancer, scientists have said. Researchers in Southampton are to carry out a trial of the new device, which identifies biological signals in vaginal fluid. There are around 7,600 new cases of ovarian cancer in the UK each year. Many of them are diagnosed at an advanced stage. Around 250 women are being recruited for the study, named Violet. It will include patients who have been diagnosed with ovarian cancer and are having their ovaries removed, as well as women with the BRCA gene mutation who are choosing to have risk-reducing surgery. According to Cancer Research UK, people with this gene mutation have a higher risk of developing several cancers, including breast, ovarian, pancreatic and prostate. Dr Jemma Longley, consultant medical oncologist at University Hospital Southampton and chief investigator for the trial, said: \"There is currently no screening programme available for ovarian cancer, and women with recognised genetic mutations, such as BRCA, may opt to have surgery to remove their ovaries and fallopian tubes to reduce their risk of developing the disease. \"However, this can have significant long-term health effects by putting younger women into a surgical menopause.\" \n                  Vaping in cars with children to be banned under new plans\n                 \n                  New cancer strategy is bold and ambitious - it can't afford to be anything else\n                 \n                  Cancer care: What can the NHS learn from Denmark? \n                 Read more from Sky News:Will the 'tobacco trials' come back to haunt tech giants?Universal vaccine for cold, flu, COVID and allergies 'a step closer' Consultant gynaecological oncology surgeon David Constable-Phelps, a co-investigator for the study, said that if the tampon worked, it \"would be a complete game-changer for women with ovarian cancer\". \"Ovarian cancer commonly has non-specific symptoms in its early and late stages, so the tumour can spread to other organs silently,\" he said. Mr Constable-Phelps added: \"We are really optimistic that we will find interesting biological signals in the vaginal fluid of women with early-stage tumours, meaning more women can expect to be cured. \"This study will pave the way towards further translational work to allow us to understand more about the biology of these cancers.\" The diagnostic tampon has been developed by the biotechnology company Daye. If successful, researchers are hopeful of conducting another, larger trial."
    },
    {
        "title": "Trial into puberty blockers for children paused over 'wellbeing concerns'",
        "description": "A clinical trial into puberty blockers has been paused after the medicines regulator raised \"new concerns directly related to the wellbeing of children\", the government said.",
        "url": "https://news.sky.com/story/trial-into-puberty-blockers-for-children-paused-over-wellbeing-concerns-13510214",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-istock-teenager-dark_7170698.jpg?20260221043153",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2026-02-21 03:09:00",
        "Headline": "Recruitment to the study will be postponed until the issues have been resolved with the sponsor, King's College, and it is concluded that it is \"both safe and necessary\", a spokesperson for the Department of Health and Social Care.",
        "Content": "A clinical trial into puberty blockers has been paused after the medicines regulator raised \"new concerns directly related to the wellbeing of children\", the government said. It comes after campaigners, including Harry Potter author JK Rowling, launched legal action against the government over the trial, which Ms Rowling described as \"an unethical experiment on children who can't give meaningful consent\". Announcing the pause, a spokesperson for the Department of Health and Social Care said the Medicines and Healthcare products Regulatory Agency (MHRA) has raised \"new concerns - directly related to the wellbeing of children and young people - and scientific dialogue will now follow with the trial sponsor\". \"As the evidence is now being interrogated by clinicians, preparations for the trial have been paused while the MHRA and clinical leaders work through these concerns,\" the spokesperson said. Researchers at King's College London, who were set to lead the Pathways trial, previously said they were aiming to recruit around 226 young people aged between 10 and almost 16. Recruitment to the study will be postponed until the issues have been resolved with the sponsor, King's College, and it is concluded that it is \"both safe and necessary\", the department spokesperson said. A spokesperson for King's College said: \"The wellbeing and health of young people with gender incongruence and their families has been, and will remain, our priority, and we will continue to work with the MHRA to support their further review of the trial, which has been designed by world-leading academics with scientific rigour at its core. \"That rigour and ongoing scientific discussion is important for any clinical trial, particularly one as complex as Pathways, which aims to build an evidence base that can help young people and clinicians to make better-informed decisions in the future.\" 'Poor' existing research on puberty blockers 'benefits' The trial was launched based on a recommendation by the Cass Review into children's gender care, which concluded that the quality of research claiming to show the benefits of puberty blockers for children with gender dysphoria was \"poor\". Baroness Hilary Cass, a senior paediatrician, said even though her report \"uncovered a very weak evidence base\" for these benefits, a trial \"was the only way forward\" given that there are \"clinicians, children and families who believe passionately in the beneficial effects\". Read more from Sky News:Man jailed after starving dogs to deathAndrew faces removal from line of succession She said a supervised puberty blocker trial is \"better\" than children buying puberty-suppressing drugs on the dark web. Conservative leader Kemi Badenoch previously wrote to Health Secretary Wes Streeting that the clinical trial must be stopped \"before more damage is done to children\". While Mr Streeting admitted he was \"uncomfortable\" with puberty blockers being given to children, he said he had a responsibility to follow expert advice and that going ahead with the trial was \"the right thing to do\"."
    },
    {
        "title": "Abbey Road is opening its doors for a rave: 'There's something about this place - hopefully we don't ruin it'",
        "description": "\"You will receive a text message after this call. Just follow the instructions....\"",
        "url": "https://news.sky.com/story/abbey-road-is-opening-its-doors-for-a-rave-theres-something-about-this-place-hopefully-we-dont-ruin-it-13509201",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-soulwax-2manydjs-abbey-road-rave_7169971.jpg?20260220085708",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-21 00:01:00",
        "Headline": "Sky News speaks to brothers David and Stephen Dewaele, also known as Soulwax, as they prepare to host the very first such event at the iconic Abbey Road Studios.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n \"You will receive a text message after this call. Just follow the instructions....\" This was the message for fans hoping to bag a spot for something unusual at Abbey Road Studios tonight. It is the world's first - and most famous - music studio, synonymous with The Beatles and with a Who's Who of artists it has welcomed over the decades, from Pink Floyd, Stevie Wonder and Kate Bush to Oasis, Radiohead and Blur, as well as the late Amy Winehouse, Lady Gaga and Stormzy. Now, it is doing something a little different - opening its doors to clubbers. Abbey Road After Hours, curated by electronic pioneers Soulwax, is the venue's first-ever \"rave\", a late-night party for just 340 fans who will be hitting the dancefloor in Studio 1. Brothers David and Stephen Dewaele, the Belgian musicians behind Soulwax, say it was an opportunity they could not refuse. \"Who doesn't want to do a party at Abbey Road?\" says Stephen. \"It's very hard to explain to people, but there's something when you walk into this building because there's so much history, but it also feels… \"For Dave and me, one idea after the other came just by walking from one of the rooms to the other room. So there's something about this place. And hopefully we don't ruin it.\" Soulwax went old-school, asking fans to call a special hotline in a nod to the method of discovering the secret locations of raves in the late 1980s and early '90s. While tonight's event won't be as rough-and-ready as raves were back in the day (the venue is already known, and it finishes at 1am, for a start), they are promising \"a good party\". (Glow sticks optional). Around 4,000 people tried to get tickets, with demand at more than 10 times the available capacity. \"It's really been exponentially way more than we thought and also way more than we can fit in,\" says Stephen. \"But we're filming the whole thing, so hopefully people will be able to see it afterwards.\" The brothers have been working at Abbey Road for the past few days, recording new music and cutting directly to vinyl, ready to play out live for the first time to tonight's ravers. They are sitting in Studio 1 as they talk to Sky News during a quick break from their work. This is the room where recorded music history began in 1931. The Beatles performed All You Need Is Love for the world's first global satellite broadcast here, and where some of the greatest film scores of the last 45 years have been recorded, from Raiders Of The Lost Ark and The Return Of The Jedi, to Harry Potter and Wicked. An attraction to 'stupid' ideas? Soulwax are electronic innovators who have been pushing boundaries since the mid-1990s. As well as being a band, they are DJs (2manydjs), a record label (DEEWEE), co-creators of their own custom-built soundsystem (Despacio), and Grammy-nominated producers. They are also known for their boundary-breaking live shows, so an Abbey Road rave seems like a good fit. \"Are you saying we have an attraction to stupid ideas?\" laughs David. \"Because we do... yeah, it fits completely because we've got sort of one foot very much in this world where… not just for us, I think most people's musical DNA is sort of shaped by these rooms, isn't it? Whether it's popular music or classical, and it's such a big part of the musical vernacular. So for us to be given the opportunity to bring something new in here, of course, yes, in our minds it makes complete sense.\" The idea is the brainchild of Mark Robertson, director of marketing and creative at Abbey Road, who says they are always looking for ways to innovate and expand on the traditional uses for the venue. \"I guess that spirit of creative exploration is why hosting a rave here in our house feels like the right thing to do,\" he says. \"Number one, it's unexpected. Number two, it's a way that we can bring people into the building, for fans to actually embrace the music… \"Being able to share some of our story with those people that are coming here for something really special is a great thing.\" Read more from Sky News entertainment:'The Ozzy tape I never played'Derry Girls creator on new show As a rave fan, Mark says it is exciting to bring that world into Abbey Road. \"It's kind of a strange thing... I think about all the different club nights that I've been to over the years, and now to come back and actually bring it into this place is amazing.\" So will there be more Abbey Road raves in the future? \"Never say never.\""
    },
    {
        "title": "The Ballad Of Wallis Island stars on becoming a word-of-mouth hit - and asking A-listers for selfies",
        "description": "After finding out about his BAFTA nominations, Tom Basden contemplated the red carpet. Specifically the stars, \"your Chalamets, your DiCaprios\", he might bump into as he walks it.",
        "url": "https://news.sky.com/story/the-ballad-of-wallis-island-stars-on-becoming-a-word-of-mouth-hit-and-asking-a-listers-for-selfies-13506189",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ballad-of-wallis-island_7096469.jpg?20251130143756",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2026-02-21 00:01:00",
        "Headline": "Sky News speaks to Tom Basden, co-star and co-writer of The Ballad Of Wallis Island, alongside comedian Tim Key, as well as director James Griffiths.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n After finding out about his BAFTA nominations, Tom Basden contemplated the red carpet. Specifically the stars, \"your Chalamets, your DiCaprios\", he might bump into as he walks it. His film, The Ballad Of Wallis Island, a quirky, wry comedy about fame and loss, also co-starring and co-written with Tim Key, was one of the UK's sleeper hits of 2025 - and described by romcom king Richard Curtis, no less, as one of the greatest British films of all time. But set on a fictional island off the Pembrokeshire coast in Wales, it is a world away from the big-budget, A-list-filled productions it is up against at this year's BAFTAs, including One Battle After, Marty Supreme and Sinners. Basden and his co-creators will likely be brushing shoulders with Leonardo DiCaprio and Timothee Chalamet, as well as fellow nominees including Michael B Jordan, Kate Hudson, Emma Stone and Benicio Del Toro. \"In truth, we sort of feel a bit like outsiders because we made this film really on our own terms with very little in the way of budget,\" Basden tells Sky News. \"So to be walking next to your Chalamets and your DiCaprios is obviously [going to be] completely surreal. \"I mean, yeah, we'll take it in our stride, of course, but we might end up asking for selfies, maybe.\" Before this, Basden, a writer and actor, was best known for co-creating and starring in the sitcoms Plebs and Here We Go. Key has written several books and appeared in films and series, including Peep Show, Taskmaster and Greed, but is probably most recognisable as Alan Partridge collaborator Sidekick Simon. In The Ballad Of Wallis Island, Basden plays Herb, a folk singer who once found fleeting fame alongside his former musical partner (and girlfriend) Nell, played by Carey Mulligan. Key is Charles, an eccentric two-time lottery winner and mega fan who hires the pair to play what turns out to be a reunion gig for an audience of one. Exceedingly British, very funny, and poignant in a way that avoids cliche, it premiered at the Sundance Film Festival in the US in January last year, and won three prizes - best joint lead performance, for Key and Basden, best screenplay and best original music - at the British Independent Film Awards in November. Now, it is up for three BAFTAs - outstanding British film, best adapted screenplay, and best supporting actress, for Mulligan. \"It's absolutely beyond our wildest expectations,\" Basden says of the reaction. \"We've just kind of watched it grow and watched word of mouth build as it's gone on. And now to be here with three BAFTA nominations a year after it premiered… is just mind-blowing.\" The film is based on their own short film, also BAFTA nominated, made in 2007, called The One and Only Herb McGwyer Plays Wallis Island - hence why it is up for adapted rather than original screenplay this time round. Both were directed by James Griffiths, who describes the story as the \"gift that keeps giving\" after almost 20 years. \"It feels really wonderful that we've come full circle.\" Getting Mulligan on board gave the plans the momentum needed for the film to be made. Already a BAFTA winner, the actress is also a triple Oscar nominee. But perhaps most importantly (or intimidatingly), she is also married to Marcus Mumford, a real-life folk star. \"Having her there meant that not only would we become confident that the film would be good, but it also meant that people would start taking it seriously and want to come and get involved, read the script and see if there was a way that they could support it,\" Basden says. \"I'm so happy she's been nominated, I think it's so, so deserved.\" There was \"never any danger\" of the music being too rehearsed, he says, as the film was shot in 18 days. \"We were really just having to go hell for leather. Carey and I played together a couple of times in the make-up truck, and then kind of, we just did it.\" No one, not even Key, had seen them perform together beforehand. The songs were re-recorded in the studio later on, with the intention of including the more polished version in the edit, but in the end, they decided they preferred the rawness of the original takes. \"It just felt really truthful and it really felt like a band sort of finding a connection that they'd previously lost,\" Basden says. Read more:'The Ozzy tape I never played': Recording found after 46 yearsOne Battle After Another: Film is 'devastatingly' timely Both he and Griffiths hope the profile given by the BAFTAs will help fly the flag for other British films. \"These smaller stories, lower-budget movies that are being made here,\" says Basden. \"Seek out the stories that we're making and feel proud that there's this creativity and brilliance at work in Britain and it doesn't all just immediately go to Hollywood. \"We've got some of the best craftspeople working in the industry here as well,\" adds Griffiths, highlighting in particular the remote and rugged coastline location needed for filming. \"It really is a testament to the effort and energy and enthusiasm of the crew and the craftspeople in the UK who are just happy to get their hands dirty and lug lenses up mountains and on really difficult tidal stretches of water… It certainly meant a lot of tractor rides up and down and to the coast. And poor Tom obviously spent a lot of time just wet in the cold water.\" This weekend's BAFTA ceremony will hopefully be a drier and warmer experience. \"I'm just looking forward to hugging everyone that helped make the film and giving big thanks to everyone who kind of got us to this point,\" says Griffiths. \"You know, the red carpet's kind of like a lovely finish, isn't it? But it's all the hard work that went into it and recognising all of that, that's the most important thing.\" And who knows. If they do bump into Leo and Timothee, maybe they will be the ones asking for selfies"
    }
]