[
    {
        "title": "'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump",
        "description": "Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine &#8211; but added the US has a red line in upcoming talks. ",
        "url": "https://news.sky.com/story/unlimited-potential-in-us-russia-trade-says-trump-after-two-hour-putin-call-13371047",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-trump-donald_6921898.jpg?20250519224130",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-19 15:06:00",
        "Headline": "The US president spoke to his Russian and Ukrainian counterparts on Monday as part of a bid to push Moscow and Kyiv towards agreeing a ceasefire.",
        "Content": " Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.  After a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussions will begin \"immediately\". It is unclear how these will differ from negotiations that already started in Turkey last Friday. Speaking to reporters in the Oval Office later on Monday, Mr Trump said he does have a red line on when he'll stop pushing Moscow and Kyiv for peace - but would not say what it is. There are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\" The US president also claimed he asked Mr Putin on their call: \"When are we going to end this bloodbath?\" He said of the Russian president: \"I do believe he wants to end [the war].\" \"My whole life is deals, one big deal, and if I thought that President Putin did not want to get this over with, I wouldn't even be talking about it because I'd just pull out,\" he added. The US president spoke to his Russian counterpart on Monday as part of a bid to push the two countries towards agreeing a truce in the war. In a Truth Social post, published shortly after the call, Mr Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\". Mr Trump continued: \"Russia wants to do large-scale trade with the United States when this catastrophic 'bloodbath' is over, and I agree. \"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is unlimited.\" Ukraine \"can be a great beneficiary on trade, in the process of rebuilding its country\", he said. The Vatican \"has stated that it would be very interested in hosting the negotiations\", Mr Trump added. He signed off his post with: \"Let the process begin!\" US correspondent For the war that Donald Trump said he'd solve in a day, read the war he couldn't solve at all.  By posting on Truth Social that an end to the Russia-Ukraine conflict will be negotiated between the two parties, the US president puts distance between himself and the deal he couldn't seal.  The United States appears to be taking a step back from its stewardship of negotiations, as it leaves both sides to it. The broker broken? For Trump, certainly, this has been a most intractable negotiation that he has never looked like closing. He mentions \"ceasefire\" in his social media post only as a discussion for Russia and Ukraine, not as the call he made for an unconditional cessation of hostilities. There's no mention of the frustrations he once threatened at intensive Russian bombing, or of the sanctions he once threatened against Moscow. Far from it, he speaks of \"large-scale trade with the United States when this bloodbath is over\". He adds that Ukraine can be a trade beneficiary from the country's rebuilding. In Kyiv and allied European capitals, they were looking for strong-armed support from Washington. European leaders had called Trump the day before he spoke to Putin to discuss sanctions and to reinforce their need for US support in steering the Russian leader towards serious engagement. They will be making further calls to the White House to clarify where they stand now, for fear they stand alone. Ukraine was never a pet project of Donald Trump. In his ambitions to reshape the world order, restored relations with Russia has always been a prize as he eyes China as adversary-in-chief. In the bigger picture, Ukraine has always been a small feature. It shows. Mr Putin found the call \"informative, frank and very useful\", Russian news agency RIA reported. \"A ceasefire in the situation in Ukraine for a certain period of time is possible if appropriate agreements are reached,\" the Russian leader reportedly said. Discussions are 'positive,' says Zelenskyy The US president spoke separately to Ukrainian President Volodymyr Zelenskyy and various European leaders. At a briefing after the day's calls had taken place, Ukraine's leader said he told Mr Trump that Russia \"might propose some particularly difficult conditions\" for a ceasefire - which could be \"a sign that it is the Russian side that is unwilling to end the war\". \"I think we are still discussing the very possibility of strong and severe sanctions [on Russia],\" he continued. \"I don't yet have an answer to that question.\" Kyiv is considering the possibility of a meeting between \"high-level\" teams from Ukraine, the US, Russia and some European countries, Mr Zelenskyy said, describing the talks on Monday as \"positive\". He continued: \"Such a meeting could take place in Turkey, the Vatican, or Switzerland. We are currently considering these three venues, as all three countries - all three venues - are neutral.\" European leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce. The Russian president has resisted that, insisting that conditions be met first. The Trump-Putin call came as Russia has continued to target Ukraine with attacks. Moscow on Monday claimed its forces have taken two villages in Ukraine, according to state news agency RIA. Read more:Russia bans Amnesty InternationalUkraine-Russia talks revealed stark reality - analysis Russia recently began pushing into the Sumy region after claiming it had ousted Kyiv's forces from Russia's neighbouring Kursk region. RIA cited the defence ministry as saying Novoolenivka, in the eastern Donetsk region, and Marine, in Sumy, have now been taken by Russian forces.  Ukraine's air force said Russia launched 112 drones over various parts of the country overnight, killing two people and leaving another 13 injured. On Sunday, Kyiv officials said Russia had launched the largest drone attack of the war so far by firing 273 explosives into Ukraine over the course of Saturday night into the following morning."
    },
    {
        "title": "UK-EU deal tips Britain down path towards Swiss-style arrangement",
        "description": "There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed.",
        "url": "https://news.sky.com/story/uk-eu-deal-tips-britain-down-path-towards-swiss-style-arrangement-13371123",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-von-der-leyen_6921796.png?20250519203748",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-05-19 17:24:00",
        "Headline": "If you're someone who believe Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed. That's what Donald Trump did last week when he was in Saudi Arabia and it's what Sir Keir Starmer did on Monday, promising the agreement with the EU should generate a whopping £9bn in gross domestic product (GDP) for the UK. Naturally, when you squint a little closer, that figure gets considerably less impressive than it first seems. After all, by 2040 - the year the government was referring to - £9bn will equate to roughly 0.2 percent of GDP, only a tiny fraction of the negative impact most economists have estimated Brexit will have on the economy (the OBR puts it at -4 percent). Whether those negative estimates are any more reliable than the one the prime minister came up with on Monday is a debate for another day, but anyway, this is one of those cases where the numbers are perhaps somewhat less meaningful than the politics. For one thing, even that seemingly small 0.2 percent of GDP is actually bigger than the calculated impact of the India trade deal unveiled earlier this month (and almost certainly bigger than any other trade deal signed since Brexit). That's because a small percentage of a big number is still a relatively big number, and Britain trades more with its neighbours than any other country in the world. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Read more from Sky News:What's in UK-EU Brexit reset trade deal?King writes to Biden after ex-president reveals cancer diagnosis Anyway, more consequential than any numbers is the fact that this government has committed to something its predecessors refused to countenance: aligning certain regulations (most notably food standards) with the European Union.  Previous Conservative governments all shied away from doing so - for fear, they said, of undermining their ability to seek free trade deals with other countries that would insist on greater access to their food markets. Countries like the US and India. That Starmer has managed to seal agreements with those two countries while still agreeing to align food standards with the EU is certainly a diplomatic coup. But it carries with it certain profound consequences. For one thing, it more or less rules out the prospects of Britain ever sealing a proper comprehensive trade deal with the US (as opposed to the rather limited agreements it has actually signed). It will push Britain over a regulatory Rubicon that was, up until now, seen as politically untenable. If you are one of those people who believe that, like it or not, Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption. What, after all, is a Swiss-style deal but a constellation of complex bilateral agreements with Europe that fall short of single market or customs union membership, while locking the parties into a sort of uncomfortable regulatory convergence? No one in government will ever describe it this way, of course. But while Monday's agreement doesn't amount to much in statistical terms, it nonetheless tips Britain down a path towards a Swiss-style arrangement - with all that goes with it. That certainly is a big deal."
    },
    {
        "title": "EU still suffering 'wounds of Brexit', bloc's foreign affairs chief tells Sky News",
        "description": "Britain should have access to the EU's rearmament fund before the end of the year but \"wounds of Brexit\" mean some member states want it to be limited, the bloc's foreign affairs chief has said.",
        "url": "https://news.sky.com/story/eu-foreign-affairs-chief-says-bloc-still-suffering-wounds-of-brexit-13371127",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kaja-kallas-eu-summit_6921285.jpg?20250519103548",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-19 17:28:00",
        "Headline": "Kaja Kallas told Sky News that some countries think the UK shouldn't have the same benefits as EU countries after it chose to leave the bloc. ",
        "Content": " Britain should have access to the EU's rearmament fund before the end of the year but \"wounds of Brexit\" mean some member states want it to be limited, the bloc's foreign affairs chief has said. Kaja Kallas told Sky News' political editor Beth Rigby that the \"technical details\" of Security Action for Europe (SAFE) still need to be sorted out. SAFE is a €150bn (£126bn) fund to provide loans to EU nations and other participants to bolster their defences. Politics Live: Starmer says EU deal 'win-win' As part of Sir Keir Starmer's new reset deal with the EU, a new defence partnership was struck that will allow the UK to access it. Asked when this might be, Ms Kallas said: \"The SAFE instrument has just been finalised between the institutions but it also needs approval from the European Council. And when that is done, we also move on with the implementation of that, and that is in the coming months.\"  Asked about reports that some member states think there should be a limit on what the UK can access, she said: \" Of course these discussions are there. We have the wounds from Brexit very clearly. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  Starmer's UK-EU deal: What does it mean for you?\n                 \"I mean you wanted to exit the European Union and then there are many voices who say that you shouldn't have the same benefits from the European instruments that the European Union countries have.\" According to The Times, France is pushing to freeze the UK out of 85% of the fund. Asked if Britain's access should be higher, Ms Kallas said her personal view is that given the current climate \"we should do both. We should invest more in European industry. But we should also cooperate with our outside partners like the UK\". She added that the EU hasn't had discussions in terms of percentage, because the fund is \"down to the capabilities\". \"That is, I think, more important than numbers,\" she said. Read more:Easing trade and signing a defence pact would be manifesto promises delivered - and PM could use a win The UK government has said accessing SAFE will support thousands of British jobs. Defence was one of the many areas that has been agreed as part of the new UK and the EU trade deal struck by Sir Keir Starmer - five years after Brexit kicked in. A key part of the deal involves giving European fishing boats a further 12 years of access to British waters. In return, there will be increased access to EU eGates for British passport holders in Europe, no health certificates every time pets travel to Europe and the removal of red tape from most UK food and drink imports and exports."
    },
    {
        "title": "David Chester: Man killed in Bicester fire went to help firefighters at former RAF base, family say",
        "description": "A man who was killed in a fire at a former RAF base was trying to help firefighters tackle the blaze, his family said.",
        "url": "https://news.sky.com/story/david-chester-man-killed-in-bicester-fire-went-to-help-firefighters-at-former-raf-base-family-say-13371271",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-valley-police_6921932.jpg?20250520005518",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-19 23:16:00",
        "Headline": "David Chester, 57, who ran the business Chesters & Sons on the site for 12 years, died in the incident on Thursday, along with firefighters Jennie Logan, 30, and Martyn Sadler, 38.",
        "Content": "A man who was killed in a fire at a former RAF base was trying to help firefighters tackle the blaze, his family said. David Chester, 57, who ran the business Chesters & Sons on the site for 12 years, died in the incident on Thursday, along with firefighters Jennie Logan, 30, and Martyn Sadler, 38. In a statement released by Thames Valley Police, Mr Chester's family called him a \"hero\" who assisted the fire crews in Oxfordshire \"without hesitation\".  They said that the business owner \"was the most amazing man we will ever know\" and that \"we love and miss him so much\". \"Dave was always known as the man you went to when you needed any sort of help,\" the family added. \"This is exactly what happened on Thursday evening, he saw firefighters needing assistance and helped without hesitation. \"He was not a victim but a hero, he died the way he lived - helping others and putting them ahead of himself.\" Oxfordshire County Council previously said that two further firefighters suffered serious injuries and remain in hospital. On Saturday, firefighters from Oxfordshire Fire and Rescue Service (OFRS) formed a guard of honour in memory of their two colleagues. Read more from Sky News:Diddy 'jealous' of actor Michael B Jordan, court hearsWhat is in the UK-EU Brexit reset trade deal?  Residents have been leaving personal messages underneath the Bicester Motion sign at the entrance to the site. A golden plaque has also been installed underneath with a tribute from the \"Bicester community\", which reads: \"Our thoughts and prayers go out to all of those affected by the sad loss of two firefighters and the member of the public.\" Rob MacDougall, chief fire officer from OFRS, said the firefighters' families were being supported, adding: \"Our thoughts are with them at this most difficult of times and we ask for their privacy to be respected.\""
    },
    {
        "title": "Pop star says Combs threatened to kill her if she spoke about violence as Cassie's ex-best friend gives evidence",
        "description": "A former pop star has told a court Sean \"Diddy\" Combs was \"frequently\" violent with his ex-partner Cassie Ventura, and that he threatened her life if she spoke out about it.",
        "url": "https://news.sky.com/story/pop-star-says-combs-threatened-to-kill-her-if-she-spoke-about-violence-as-cassies-ex-best-friend-gives-evidence-13371265",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dawn-richard-sean-combs_6921929.jpg?20250519232909",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-19 22:12:00",
        "Headline": "During the sixth day of the Sean \"Diddy\" Combs sex-trafficking trial, the court heard of multiple alleged attacks on Cassie Ventura, drugs \"in a Louis Vuitton pouch\" and the names of multiple celebrities were dropped during evidence.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n A former pop star has told a court Sean \"Diddy\" Combs was \"frequently\" violent with his ex-partner Cassie Ventura, and that he threatened her life if she spoke out about it. Dawn Richard told the jury in Manhattan federal court that Combs made the threat after she allegedly witnessed him trying to hit Cassie with an egg skillet. She said the Bad Boy Records founder told her and another woman who saw the alleged attack that \"we could go missing\" if they revealed details of what they saw. Richard, who was a former member of girl group Danity Kane and electric soul trio Dirty Money, said Combs would \"punch [Cassie], choke her, slap her in the mouth, kick her, and punch her in the stomach\". She said of the beatings: \"When [Cassie] had these moments of trying to stick up for herself, [Combs] would hurt her for it.\" Richard also said one alleged incident took place in a West Hollywood restaurant with celebrities including Usher, Big Daddy Kane, Jimmy Iovine and Ne-yo also present. Combs, 55, faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. He denies the allegations against him. \n                  New York helicopter crash tour company to close immediately, says FAA\n                 \n                  Private plane crash in New York kills ex-college football star Karenna Groff and family\n                 \n                  Brother pays tribute to relatives killed in Hudson River helicopter crash - as cause remains unclear\n                 Beginning her evidence on Friday, Richard told the jury Combs would store his drugs in a Louis Vuitton pouch and said she often\" saw him use \"Ketamine, cocaine, molly [also known as Ecstasy]\". Sean 'Diddy' Combs trial: Day 6 - As it happened During cross-examination it was suggested her story had changed over time, but Richard said she was doing her best to recall \"traumatic\" events from more than a decade ago. She admitted she had contacted Diddy after parting ways with his management and agreed that, despite being \"scared\" of him, she asked to come back to work for him. Defence lawyer Nicole Westmoreland suggested Richard was testifying because she was angry that Combs had ended Danity Kane and Diddy - Dirty Money. Ms Westmoreland asked: \"You felt that Mr Combs ruined your career not once but twice?\" \"Yes,\" Richard replied. Following Richard's stint in the stand, Cassie's ex-best friend Kerry Morgan gave evidence. Morgan and Cassie had been friends for more than 17 years after meeting as young models. 'I was dizzy, I vomited' Morgan, who said Combs was prone to \"mood swings\" and could be \"very aggressive\", described two occasions she allegedly saw Combs beat Cassie. She told the court about hearing Cassie's \"guttural, terrifying\" screams before allegedly seeing Combs dragging her by her hair from the master bedroom. Morgan also described when Combs \"choked her\" leaving \"finger marks\" on her throat, and threw a wooden hanger at her head, leaving her with concussion. She said: \"I was dizzy, I vomited a few times. I went to an urgent care facility. I hired a lawyer about the assault. I was planning on filing a lawsuit, but I did not.\" She told the court she received a $30,000 settlement from Combs over the alleged assault, organised by Cassie. Morgan said she and Cassie ceased to be friends after the incident, explaining: \"The reason I stopped speaking to her was because she was not supportive of me after that incident. I draw my line at physical abuse.\" Morgan said Cassie told her she could not leave Combs because she was reliant on him for \"her job, her car, her apartment\". Combs 'jealous' of Michael B Jordan During Cassie's cross-examination by the defence, the court was told that Cassie was jealous of Combs's ex, Kim Porter, while Combs was jealous of actor Michael B Jordan, whom Cassie had a brief relationship with in 2015. While Morgan said she couldn't confirm whether Cassie was in a relationship with the Creed star, she confirmed: \"What I remember was that she was speaking to Michael B Jordan and they hung out together and [Combs] was jealous of it.\" Morgan confirmed she had not wanted to appear in court, having \"moved on\" with her life, and had been subpoenaed to give testimony. Last on the stand was Combs's former personal assistant, David James, who described working 20-hour days for Combs at Bad Boy Records, for six or seven days, for up to three weeks at a time. James, who had also been subpoenaed, said Cassie told him she couldn't leave Combs's \"crazy\" world because \"he controls my career, pays my allowance, and pays my rent\". Combs, previously known as Puff Daddy and P Diddy, founded Bad Boy Records, and is credited with helping turn artists including Mary J Blige, Faith Evans, Notorious B.I.G. and Usher into household names in the 1990s and 2000s. Combs has been jailed since September and faces at least 15 years or possibly life in prison if convicted."
    },
    {
        "title": "Donald Trump 'surprised' public wasn't told about Biden's cancer diagnosis 'a long time ago'",
        "description": "Donald Trump has said he is \"surprised\" the public wasn't \"notified a long time ago\" after Joe Biden was diagnosed with an aggressive form of prostate cancer.",
        "url": "https://news.sky.com/story/donald-trump-surprised-public-wasnt-told-about-bidens-cancer-diagnosis-a-long-time-ago-13371261",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-joe-biden-donald-trump_6792886.jpg?20250106151645",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-19 21:56:00",
        "Headline": "Mr Trump also suggested at least one of the doctors treating Mr Biden had previously found the the former US president to be \"cognitively fine\".",
        "Content": "Donald Trump has said he is \"surprised\" the public wasn't \"notified a long time ago\" after Joe Biden was diagnosed with an aggressive form of prostate cancer. Mr Trump also suggested that at least one of the doctors treating Mr Biden for the disease had previously claimed the former US president was \"cognitively fine\" - something he claims later turned out to be \"not so\". Mr Biden, 82, was diagnosed with cancer on Friday, with tests revealing the disease had spread to his bones. Prostate cancer is assigned a Gleason score, which ranges from two to 10 and indicates how abnormal the cancer cells are when compared to healthy tissue under a microscope. Mr Biden's office reported his score was nine, suggesting a highly aggressive form of the disease. Asked by a reporter at the White House this evening if he had any comment about the diagnosis, Mr Trump said: \"I think it's very sad, actually. \"I'm surprised the public wasn't notified a long time ago because to get to stage nine, that's a long time.\" \n                  King writes to Biden after former US president reveals cancer diagnosis\n                 \n                  Was Trump's Middle East trip an 'unbridled success'?\n                 \n                  'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump\n                 Mr Trump said that he had just had a \"very complete\" physical test which included \"cognitive tests\" and added: \"I'm proud to announce I aced it.\" Mr Biden had been running against Mr Trump in the 2024 presidential election before stepping down after a disastrous debate performance fuelled concerns around his age and fitness to serve. Much of the concern was over his cognitive abilities following a series of gaffes - including referring to Ukrainian President Volodymyr Zelenskyy as \"President Putin\" during a NATO summit. In his comments at the White House, Mr Trump suggested that a doctor that had previously tested Mr Biden's cognitive abilities was also involved in diagnosing his cancer. The US president said: \"I think that, if you take a look it's the same doctor that said that Joe was cognitively fine... there was nothing wrong with him. \"Well... if it's the same doctor who said there was nothing wrong there... that's been proven to be a sad situation.\" Mr Trump added that \"in other words\" there are \"things going on that the public wasn't informed of\" and said it was \"very dangerous\". Referencing Mr Biden's diagnosis, the US president continued: \"The other thing you have to say is why did it take so long? I mean... this takes a long time, can take years to get to this level of danger.\" He added: \"I think people should try and find out what happened... Maybe it was the same doctor and somebody is not telling the facts.. That's a big problem.\" It is not clear if the US president was referring to the length of time it took for Mr Biden to get a diagnosis or the amount of time it took for it to be made public.  Mr Trump was speaking to reporters following a two-hour call with Russian President Vladimir Putin on Monday as he tries to negotiate an end to the war in Ukraine. The US president has said in the Oval Office there is a \"good chance\" of peace between Russia and Ukraine - but added that America has a red line in upcoming talks. Mr Trump would not say what that red line is. There are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\"  King send best wishes Earlier it emerged King Charles had privately written to Mr Biden following his cancer diagnosis. The monarch, who is undergoing his own treatment for an undisclosed cancer, hosted the former US president for tea and talks at Windsor in July 2023. The King's private message comes after British Prime Minister Sir Keir Starmer said he was \"very sorry to hear\" the news about Mr Biden's cancer diagnosis. \"All the very best to Joe, his wife Jill and their family, and wishing the President swift and successful treatment,\" he added. Former US president Barack Obama said: \"Michelle and I are thinking of the entire Biden family. \"Nobody has done more to find breakthrough treatments for cancer in all its forms than Joe, and I am certain he will fight this challenge with his trademark resolve and grace. We pray for a fast and full recovery.\" The former US president posted an image of himself and his wife Jill on X on Monday and wrote: \"Cancer touches us all. Like so many of you, Jill and I have learned that we are strongest in the broken places. Thank you for lifting us up with love and support.\""
    },
    {
        "title": "'I recognise the error and upset caused' - Gary Lineker releases statement as BBC departure confirmed",
        "description": "Gary Lineker has confirmed he is leaving the BBC after this season's Match Of The Day and will no longer present its World Cup coverage.",
        "url": "https://news.sky.com/story/gary-lineker-to-leave-bbc-next-week-and-will-no-longer-present-2026-world-cup-coverage-13370788",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-gary-lineker-match-of-the-day_6748739.jpg?20241115073300",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-19 05:13:00",
        "Headline": "The 64-year-old presenter sometimes expresses frank views online, which have raised questions about the BBC's impartiality.",
        "Content": " Gary Lineker has confirmed he is leaving the BBC after this season's Match Of The Day and will no longer present its World Cup coverage. It comes after the 64-year-old \"apologised unreservedly\" for sharing a social media post illustrated with a rat - which has been used to represent Jewish people in antisemitic propaganda, including Nazi Germany. Read more: A history of Gary Lineker's most controversial posts In a statement on Monday, Lineker said: \"Football has been at the heart of my life for as long as I can remember - both on the pitch and in the studio. \"I care deeply about the game, and about the work I've done with the BBC over many years. As I've said, I would never consciously repost anything antisemitic - it goes against everything I stand for. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" Analysis: BBC can breathe easier after Lineker leaves Lineker said he deleted the post when he learned about the rat's symbolism, adding he would \"never knowingly share anything antisemitic\". In a separate video posted to Instagram, the pundit added: \"I've stood up for minorities and humanitarian issues and against all forms of racism all of my life, including, of course, antisemitism, which I absolutely abhor. \"There's no place for it and never should be.\" He went on to thank the \"brilliant, talented\" people he has worked with and described his relationship with the BBC as \"long and wonderful\". He added: \"But it's the right time for the organisation and myself to go our separate ways.\" Lineker's last appearance on the BBC will be on Sunday 25 May, the final day of the season. Gary Lineker signed a five-year deal with the BBC in 2020, under which he agreed to adhere to their impartiality rules. The rules were then updated after his return to Match Of The Day in 2023.\n\n The latest regulations say high-profile BBC presenters should be able to express their views on political issues as long as they stop short of campaigning. It does not clarify what would constitute political campaigning for the big-name presenters. The guidelines also stress the importance of \"high standards of civility in public discourse\", which includes treating others with respect, even in the face of abuse and not using offensive or aggressive language. The policy only applies to presenters outside of its news coverage. News presenters are still subject to stricter impartiality guidelines. 'A defining voice in football coverage' Also confirming Lineker's exit, BBC director general Tim Davie said: \"Gary has acknowledged the mistake he made. Accordingly, we have agreed he will step back from further presenting after this season. \"Gary has been a defining voice in football coverage for the BBC for over two decades. His passion and knowledge have shaped our sports journalism and earned him the respect of sports fans across the UK and beyond. \"We want to thank him for the contribution he has made.\" Alex Kay-Jelski, the BBC's director of sport, said in an email sent to staff that it had been a \"difficult\" and \"emotional\" week. He went on to say: \"It is sad to be saying goodbye to such a brilliant broadcaster and I also want to thank Gary for his years of service. As ever, if you have questions, you know where I am. \"Let's finish the season strongly with Gary's final show, enjoy an incredible summer of sport and look forward with excitement to what lies ahead.\" Lineker announced in November he would step down from Match Of The Day this year, but was set to return to front the World Cup in 2026, as well as FA Cup coverage. The former England star was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's asylum policy. He will be replaced on Match Of The Day by Gabby Logan, Kelly Cates and Mark Chapman, who will share the presenting role from the next Premier League season. Read more from Sky News:What is in the Brexit reset agreement?Politicians send messages of support to Joe Biden Lineker has hosted Match Of The Day since 1999 and has been the BBC's highest-paid on-air talent for seven consecutive years. He joined the programme having started as a BBC Radio Five Live presenter, also working on the broadcaster's former flagship sports show Grandstand during his early years in broadcasting. The Leicester-born presenter is also the co-founder of podcast producing company Goalhanger, which makes the popular The Rest Is History series and its spin-offs about politics, football, entertainment and money. His parting ways with the BBC also includes the licensing deal for Goalhanger podcast titles on BBC Sounds, which ends this year, the PA news agency reported."
    },
    {
        "title": "EU still suffering 'wounds of Brexit', bloc's foreign affairs chief tells Sky News",
        "description": "Britain should have access to the EU's rearmament fund before the end of the year but \"wounds of Brexit\" mean some member states want it to be limited, the bloc's foreign affairs chief has said.",
        "url": "https://news.sky.com/story/eu-foreign-affairs-chief-says-bloc-still-suffering-wounds-of-brexit-13371127",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kaja-kallas-eu-summit_6921285.jpg?20250519103548",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-19 17:28:00",
        "Headline": "Kaja Kallas told Sky News that some countries think the UK shouldn't have the same benefits as EU countries after it chose to leave the bloc. ",
        "Content": " Britain should have access to the EU's rearmament fund before the end of the year but \"wounds of Brexit\" mean some member states want it to be limited, the bloc's foreign affairs chief has said. Kaja Kallas told Sky News' political editor Beth Rigby that the \"technical details\" of Security Action for Europe (SAFE) still need to be sorted out. SAFE is a €150bn (£126bn) fund to provide loans to EU nations and other participants to bolster their defences. Politics Live: Starmer says EU deal 'win-win' As part of Sir Keir Starmer's new reset deal with the EU, a new defence partnership was struck that will allow the UK to access it. Asked when this might be, Ms Kallas said: \"The SAFE instrument has just been finalised between the institutions but it also needs approval from the European Council. And when that is done, we also move on with the implementation of that, and that is in the coming months.\"  Asked about reports that some member states think there should be a limit on what the UK can access, she said: \" Of course these discussions are there. We have the wounds from Brexit very clearly. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  Starmer's UK-EU deal: What does it mean for you?\n                 \"I mean you wanted to exit the European Union and then there are many voices who say that you shouldn't have the same benefits from the European instruments that the European Union countries have.\" According to The Times, France is pushing to freeze the UK out of 85% of the fund. Asked if Britain's access should be higher, Ms Kallas said her personal view is that given the current climate \"we should do both. We should invest more in European industry. But we should also cooperate with our outside partners like the UK\". She added that the EU hasn't had discussions in terms of percentage, because the fund is \"down to the capabilities\". \"That is, I think, more important than numbers,\" she said. Read more:Easing trade and signing a defence pact would be manifesto promises delivered - and PM could use a win The UK government has said accessing SAFE will support thousands of British jobs. Defence was one of the many areas that has been agreed as part of the new UK and the EU trade deal struck by Sir Keir Starmer - five years after Brexit kicked in. A key part of the deal involves giving European fishing boats a further 12 years of access to British waters. In return, there will be increased access to EU eGates for British passport holders in Europe, no health certificates every time pets travel to Europe and the removal of red tape from most UK food and drink imports and exports."
    },
    {
        "title": "UK-EU trade deal: What is in the Brexit reset agreement?",
        "description": "The UK and the EU have agreed a new trade deal - five years after Brexit kicked in.",
        "url": "https://news.sky.com/story/uk-eu-trade-deal-what-is-in-the-brexit-reset-agreement-13370912",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ursula-von-der-leyen_6921296.jpg?20250519105344",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-19 10:23:00",
        "Headline": "From eGates and pet passports to the removal of red tape on food sales and the protection of British steel, a new deal has been agreed.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The UK and the EU have agreed a new trade deal - five years after Brexit kicked in. Following six months of talks after Sir Keir Starmer promised a fresh deal when he became prime minister last July, the two sides have come to an agreement. Politics latest: Starmer says 'Britain is back' Here are the details: eGates British passport holders will be able to use more eGates in Europe to avoid the long border control queues that have become the norm since Brexit in many EU countries. Pet travel \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Pet passports will be brought back so cats and dogs coming from the UK will no longer need pricey animal health certificates for every trip. After Brexit, pet owners had to get a certificate from a vet in the UK then a vet in the EU before returning. Red tape on food and drink sales A new sanitary and phytosanitary (SPS) deal has been agreed to reduce red tape currently needed to import and export food and drink between the UK and the EU. There is no time limit to this part of the deal, which the government says will reduce the burden on businesses and reduce lorry queues at the border. The \"vast majority\" of routine checks and certificates for animal and plant products will be removed completely, including between Great Britain and Northern Ireland. The government says this could lower food prices and increase choice on supermarket shelves. Some British foods that have been prevented from being sold in the EU since Brexit will be allowed back in again, including burgers and sausages. Fishing rights The current fishing deal agreed in 2020 will continue for 12 years. There will be no increase in fish quotas. EU fishing vessels can fish in UK waters, but they require a valid licence, and there are annual negotiations on access and share of stock. The UK government has announced a £360m investment into the fishing industry to go towards new technology and equipment to modernise the fleet, train the workforce, help revitalise coastal communities, support tourism and boost seafood exports. Defence A new security and defence partnership has been agreed so the UK defence industry can participate in the EU's plan for a £150bn defence fund called Security Action for Europe (SAFE). This will support thousands of British jobs. The UK and EU will also enhance cooperation over maritime security and accident reporting.  Carbon tax The deal will see closer co-operation on emissions by the UK and the EU, linking their own emissions trading systems. The UK's scheme sets a cap on the total amount of greenhouse gas emissions allowed from the power generation sector, energy-intensive industries and aviation, with companies issued allowances that they can trade with each other. Under the deal, UK businesses will avoid being hit by the EU's carbon tax, due to come in next year, which would have handed £800m to the EU. Steel British steel exports will be protected from new EU rules and tariffs to save UK steel £25m a year.  Further talks: Youth mobility scheme The UK and the EU have agreed to more negotiations on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period. The scheme would include visas for young people working, studying, volunteering, travelling and working as au pairs. Erasmus The EU and the UK have agreed they should work towards an Erasmus programme, the student exchange programme which was scrapped when Brexit took place. Catching criminals The two sides have agreed to enter talks about the UK having access to EU facial image data to help catch dangerous criminals. They will also encourage Europol and the UK's National Crime Agency to cooperate over criminal threats and exchanging information about terrorism and other serious crimes. Migration The two sides have agreed to further work on finding solutions to tackle illegal migration, including on returns and a joint commitment to tackle Channel crossings. They will also begin talks on making it easier for people to get visas to work in the UK and the EU and recognising professional qualifications. Analysis sharing on visa abuse by third country nationals will also be considered. Electricity The UK and the EU said they should explore the UK's participation in the EU's internal electricity market, including in its trading platforms."
    },
    {
        "title": "UK-EU deal tips Britain down path towards Swiss-style arrangement",
        "description": "There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed.",
        "url": "https://news.sky.com/story/uk-eu-deal-tips-britain-down-path-towards-swiss-style-arrangement-13371123",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-von-der-leyen_6921796.png?20250519203748",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-05-19 17:24:00",
        "Headline": "If you're someone who believe Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed. That's what Donald Trump did last week when he was in Saudi Arabia and it's what Sir Keir Starmer did on Monday, promising the agreement with the EU should generate a whopping £9bn in gross domestic product (GDP) for the UK. Naturally, when you squint a little closer, that figure gets considerably less impressive than it first seems. After all, by 2040 - the year the government was referring to - £9bn will equate to roughly 0.2 percent of GDP, only a tiny fraction of the negative impact most economists have estimated Brexit will have on the economy (the OBR puts it at -4 percent). Whether those negative estimates are any more reliable than the one the prime minister came up with on Monday is a debate for another day, but anyway, this is one of those cases where the numbers are perhaps somewhat less meaningful than the politics. For one thing, even that seemingly small 0.2 percent of GDP is actually bigger than the calculated impact of the India trade deal unveiled earlier this month (and almost certainly bigger than any other trade deal signed since Brexit). That's because a small percentage of a big number is still a relatively big number, and Britain trades more with its neighbours than any other country in the world. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Read more from Sky News:What's in UK-EU Brexit reset trade deal?King writes to Biden after ex-president reveals cancer diagnosis Anyway, more consequential than any numbers is the fact that this government has committed to something its predecessors refused to countenance: aligning certain regulations (most notably food standards) with the European Union.  Previous Conservative governments all shied away from doing so - for fear, they said, of undermining their ability to seek free trade deals with other countries that would insist on greater access to their food markets. Countries like the US and India. That Starmer has managed to seal agreements with those two countries while still agreeing to align food standards with the EU is certainly a diplomatic coup. But it carries with it certain profound consequences. For one thing, it more or less rules out the prospects of Britain ever sealing a proper comprehensive trade deal with the US (as opposed to the rather limited agreements it has actually signed). It will push Britain over a regulatory Rubicon that was, up until now, seen as politically untenable. If you are one of those people who believe that, like it or not, Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption. What, after all, is a Swiss-style deal but a constellation of complex bilateral agreements with Europe that fall short of single market or customs union membership, while locking the parties into a sort of uncomfortable regulatory convergence? No one in government will ever describe it this way, of course. But while Monday's agreement doesn't amount to much in statistical terms, it nonetheless tips Britain down a path towards a Swiss-style arrangement - with all that goes with it. That certainly is a big deal."
    },
    {
        "title": "David Chester: Man killed in Bicester fire went to help firefighters at former RAF base, family say",
        "description": "A man who was killed in a fire at a former RAF base was trying to help firefighters tackle the blaze, his family said.",
        "url": "https://news.sky.com/story/david-chester-man-killed-in-bicester-fire-went-to-help-firefighters-at-former-raf-base-family-say-13371271",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-thames-valley-police_6921932.jpg?20250520005518",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-19 23:16:00",
        "Headline": "David Chester, 57, who ran the business Chesters & Sons on the site for 12 years, died in the incident on Thursday, along with firefighters Jennie Logan, 30, and Martyn Sadler, 38.",
        "Content": "A man who was killed in a fire at a former RAF base was trying to help firefighters tackle the blaze, his family said. David Chester, 57, who ran the business Chesters & Sons on the site for 12 years, died in the incident on Thursday, along with firefighters Jennie Logan, 30, and Martyn Sadler, 38. In a statement released by Thames Valley Police, Mr Chester's family called him a \"hero\" who assisted the fire crews in Oxfordshire \"without hesitation\".  They said that the business owner \"was the most amazing man we will ever know\" and that \"we love and miss him so much\". \"Dave was always known as the man you went to when you needed any sort of help,\" the family added. \"This is exactly what happened on Thursday evening, he saw firefighters needing assistance and helped without hesitation. \"He was not a victim but a hero, he died the way he lived - helping others and putting them ahead of himself.\" Oxfordshire County Council previously said that two further firefighters suffered serious injuries and remain in hospital. On Saturday, firefighters from Oxfordshire Fire and Rescue Service (OFRS) formed a guard of honour in memory of their two colleagues. Read more from Sky News:Diddy 'jealous' of actor Michael B Jordan, court hearsWhat is in the UK-EU Brexit reset trade deal?  Residents have been leaving personal messages underneath the Bicester Motion sign at the entrance to the site. A golden plaque has also been installed underneath with a tribute from the \"Bicester community\", which reads: \"Our thoughts and prayers go out to all of those affected by the sad loss of two firefighters and the member of the public.\" Rob MacDougall, chief fire officer from OFRS, said the firefighters' families were being supported, adding: \"Our thoughts are with them at this most difficult of times and we ask for their privacy to be respected.\""
    },
    {
        "title": "'I recognise the error and upset caused' - Gary Lineker releases statement as BBC departure confirmed",
        "description": "Gary Lineker has confirmed he is leaving the BBC after this season's Match Of The Day and will no longer present its World Cup coverage.",
        "url": "https://news.sky.com/story/gary-lineker-to-leave-bbc-next-week-and-will-no-longer-present-2026-world-cup-coverage-13370788",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-gary-lineker-match-of-the-day_6748739.jpg?20241115073300",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-19 05:13:00",
        "Headline": "The 64-year-old presenter sometimes expresses frank views online, which have raised questions about the BBC's impartiality.",
        "Content": " Gary Lineker has confirmed he is leaving the BBC after this season's Match Of The Day and will no longer present its World Cup coverage. It comes after the 64-year-old \"apologised unreservedly\" for sharing a social media post illustrated with a rat - which has been used to represent Jewish people in antisemitic propaganda, including Nazi Germany. Read more: A history of Gary Lineker's most controversial posts In a statement on Monday, Lineker said: \"Football has been at the heart of my life for as long as I can remember - both on the pitch and in the studio. \"I care deeply about the game, and about the work I've done with the BBC over many years. As I've said, I would never consciously repost anything antisemitic - it goes against everything I stand for. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" Analysis: BBC can breathe easier after Lineker leaves Lineker said he deleted the post when he learned about the rat's symbolism, adding he would \"never knowingly share anything antisemitic\". In a separate video posted to Instagram, the pundit added: \"I've stood up for minorities and humanitarian issues and against all forms of racism all of my life, including, of course, antisemitism, which I absolutely abhor. \"There's no place for it and never should be.\" He went on to thank the \"brilliant, talented\" people he has worked with and described his relationship with the BBC as \"long and wonderful\". He added: \"But it's the right time for the organisation and myself to go our separate ways.\" Lineker's last appearance on the BBC will be on Sunday 25 May, the final day of the season. Gary Lineker signed a five-year deal with the BBC in 2020, under which he agreed to adhere to their impartiality rules. The rules were then updated after his return to Match Of The Day in 2023.\n\n The latest regulations say high-profile BBC presenters should be able to express their views on political issues as long as they stop short of campaigning. It does not clarify what would constitute political campaigning for the big-name presenters. The guidelines also stress the importance of \"high standards of civility in public discourse\", which includes treating others with respect, even in the face of abuse and not using offensive or aggressive language. The policy only applies to presenters outside of its news coverage. News presenters are still subject to stricter impartiality guidelines. 'A defining voice in football coverage' Also confirming Lineker's exit, BBC director general Tim Davie said: \"Gary has acknowledged the mistake he made. Accordingly, we have agreed he will step back from further presenting after this season. \"Gary has been a defining voice in football coverage for the BBC for over two decades. His passion and knowledge have shaped our sports journalism and earned him the respect of sports fans across the UK and beyond. \"We want to thank him for the contribution he has made.\" Alex Kay-Jelski, the BBC's director of sport, said in an email sent to staff that it had been a \"difficult\" and \"emotional\" week. He went on to say: \"It is sad to be saying goodbye to such a brilliant broadcaster and I also want to thank Gary for his years of service. As ever, if you have questions, you know where I am. \"Let's finish the season strongly with Gary's final show, enjoy an incredible summer of sport and look forward with excitement to what lies ahead.\" Lineker announced in November he would step down from Match Of The Day this year, but was set to return to front the World Cup in 2026, as well as FA Cup coverage. The former England star was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's asylum policy. He will be replaced on Match Of The Day by Gabby Logan, Kelly Cates and Mark Chapman, who will share the presenting role from the next Premier League season. Read more from Sky News:What is in the Brexit reset agreement?Politicians send messages of support to Joe Biden Lineker has hosted Match Of The Day since 1999 and has been the BBC's highest-paid on-air talent for seven consecutive years. He joined the programme having started as a BBC Radio Five Live presenter, also working on the broadcaster's former flagship sports show Grandstand during his early years in broadcasting. The Leicester-born presenter is also the co-founder of podcast producing company Goalhanger, which makes the popular The Rest Is History series and its spin-offs about politics, football, entertainment and money. His parting ways with the BBC also includes the licensing deal for Goalhanger podcast titles on BBC Sounds, which ends this year, the PA news agency reported."
    },
    {
        "title": "Teachers of Southport stabbing victim plan charity skydive to 'celebrate her incredible spirit'",
        "description": "The teachers of one of the Southport stabbing victims plan to \"celebrate her incredible spirit\" by jumping out of a plane at 15,000ft in a charity skydive.",
        "url": "https://news.sky.com/story/teachers-of-southport-stabbing-victim-plan-charity-skydive-to-celebrate-her-incredible-spirit-13370897",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-elsie-dot-stancombe_6921604.jpg?20250519172514",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-19 09:54:00",
        "Headline": "Jennifer Sephton and Adrian Antell will be raising funds for a charitable trust which has been set up in memory of Elsie Dot Stancombe.",
        "Content": "The teachers of one of the Southport stabbing victims plan to \"celebrate her incredible spirit\" by jumping out of a plane at 15,000ft in a charity skydive. Seven-year-old Elsie Dot Stancombe was killed along with Bebe King, six, and nine-year-old Alice da Silva Aguiar in an attack by Axel Rudakubana at a Taylor Swift-themed dance class last July. Jennifer Sephton and Adrian Antell, headteachers of Farnborough Road Infant School and Farnborough Road Junior School respectively, will be skydiving to raise funds for Elsie's Story Charitable Trust, which has been set up in memory of the former pupil. Children from the schools will be contributing by taking part in a \"break the rules day\", where they can donate in exchange for breaking one of 15 school rules, including dancing in the classroom and sporting temporary tattoos. Ms Sephton said: \"This is a charity so close to both our hearts. \"It was always a privilege to teach Elsie and be part of her learning journey at Farnborough. \"She was such a charismatic, determined young lady who always had an infectious energy and a sparkle in her eyes. \n                  Jailed wife of former Tory councillor says she 'never' meant to incite violence \n                 \n                  Southport riots review finds police have not kept up with social media risks\n                 \n                  Man who researched Southport killings jailed for 30 years for attempted murder of nine-year-old girl\n                 \"Elsie is our inspiration and we wanted to do something to honour her memory and celebrate her incredible spirit.\" Mr Antell said: \"Without a doubt we're both going to be very scared when it comes to jumping! But we know Elsie would be absolutely overjoyed to know her teachers were doing a skydive for her. \"Elsie's Story is such a wonderful charity that is determined to make positive, long-lasting change for the town and people of Southport. \"We want to show our unwavering commitment for the work they are determined to do.\" Read more: Review finds police haven't kept up with social media risksMeta 'too slow' during UK riots to deal with violent posts online The charity was set up by Elsie's family following her death to provide grants for children in the community, including funding activities, resources and special experiences to bring \"happiness and hope\". Rudakubana,18, was jailed for a minimum of 52 years in January for the murders of the three young girls and attempted murder of eight other children and two adults."
    },
    {
        "title": "Third man arrested over fires at properties linked to Sir Keir Starmer",
        "description": "A third man has been arrested in connection with fires at two properties and a car linked to Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/third-man-arrested-over-fires-at-properties-linked-to-sir-keir-starmer-13371046",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-fire-starmer_6915167.jpg?20250513131932",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-19 15:02:00",
        "Headline": "A 34-year-old is the third person to be arrested over fires at two properties and a car linked to Prime Minister Sir Keir Starmer.",
        "Content": "A third man has been arrested in connection with fires at two properties and a car linked to Prime Minister Sir Keir Starmer. The Metropolitan Police said a 34-year-old was arrested this morning in the Chelsea area of west London on suspicion of conspiracy to commit arson with intent to endanger life. On Saturday, a 26-year-old man was arrested at Luton Airport on suspicion of the same offence. He is currently still in police custody after a warrant of further detention was obtained at Westminster Magistrates' Court. It comes after a Ukrainian man, 21, was charged with three counts of arson with intent to endanger life. Roman Lavrynovych appeared at Westminster Magistrates' Court on Friday and was remanded in custody. Lavrynovych, of Sydenham, south-east London, denied arson in a police interview. He is due to appear at the Old Bailey in London in June. The arrests come after a fire in the early hours of 12 May at a house in Kentish Town, north London, where Sir Keir lived with his family before the election. Damage was caused to the property's entrance, but nobody was hurt. A car was also set alight in the same street on 8 May. Read more from Sky News:What is in the UK-EU Brexit reset trade deal?The Who drummer sacked from band for second time There was another blaze at the front door of a house converted into flats in Islington, also linked to the prime minister, on 11 May. One person was taken to safety via an internal staircase by crews wearing breathing apparatus."
    },
    {
        "title": "David Beckham meets King and Queen at Chelsea Flower Show",
        "description": "David Beckham has met the King and Queen at the Chelsea Flower Show, ahead of the launch of a new charity campaign to get more young people into horticulture.",
        "url": "https://news.sky.com/story/david-beckham-meets-king-and-queen-at-chelsea-flower-show-13370933",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-charles-beckham_6921692.jpg?20250519190725",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-19 11:01:00",
        "Headline": "The former England star attended the event in London for the first time in his role as ambassador to the King's Foundation, which is celebrating its 35th anniversary this year.",
        "Content": "David Beckham has met the King and Queen at the Chelsea Flower Show, ahead of the launch of a new charity campaign to get more young people into horticulture. The former Manchester United, Real Madrid, and England star attended the event in London for the first time in his role as ambassador to the King's Foundation, which is celebrating its 35th anniversary this year. Beckham, who has been an ambassador for the foundation for a year, met the royal couple at the Highgrove Shop stand. The stand sells products from the King's Highgrove Estate in Gloucestershire, as well as showcasing designs from fashion retailers, and all proceeds go towards the work of the foundation. Beckham also visited the London Square Chelsea Pensioners Garden, and spent time with legendary gardener and fellow King's Foundation ambassador Alan Titchmarsh. Read more:King and Queen host star-studded dinnerCharles and William share private moment at ceremony Beckham's attendance at Monday's event teases an upcoming campaign by the King's Foundation, which, in partnership with the RHS, will encourage young people to consider taking up work in horticulture. Beckham and Titchmarsh will be supporting the campaign in their roles as charity ambassadors."
    },
    {
        "title": "'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump",
        "description": "Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine &#8211; but added the US has a red line in upcoming talks. ",
        "url": "https://news.sky.com/story/unlimited-potential-in-us-russia-trade-says-trump-after-two-hour-putin-call-13371047",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-trump-donald_6921898.jpg?20250519224130",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-19 15:06:00",
        "Headline": "The US president spoke to his Russian and Ukrainian counterparts on Monday as part of a bid to push Moscow and Kyiv towards agreeing a ceasefire.",
        "Content": " Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.  After a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussions will begin \"immediately\". It is unclear how these will differ from negotiations that already started in Turkey last Friday. Speaking to reporters in the Oval Office later on Monday, Mr Trump said he does have a red line on when he'll stop pushing Moscow and Kyiv for peace - but would not say what it is. There are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\" The US president also claimed he asked Mr Putin on their call: \"When are we going to end this bloodbath?\" He said of the Russian president: \"I do believe he wants to end [the war].\" \"My whole life is deals, one big deal, and if I thought that President Putin did not want to get this over with, I wouldn't even be talking about it because I'd just pull out,\" he added. The US president spoke to his Russian counterpart on Monday as part of a bid to push the two countries towards agreeing a truce in the war. In a Truth Social post, published shortly after the call, Mr Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\". Mr Trump continued: \"Russia wants to do large-scale trade with the United States when this catastrophic 'bloodbath' is over, and I agree. \"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is unlimited.\" Ukraine \"can be a great beneficiary on trade, in the process of rebuilding its country\", he said. The Vatican \"has stated that it would be very interested in hosting the negotiations\", Mr Trump added. He signed off his post with: \"Let the process begin!\" US correspondent For the war that Donald Trump said he'd solve in a day, read the war he couldn't solve at all.  By posting on Truth Social that an end to the Russia-Ukraine conflict will be negotiated between the two parties, the US president puts distance between himself and the deal he couldn't seal.  The United States appears to be taking a step back from its stewardship of negotiations, as it leaves both sides to it. The broker broken? For Trump, certainly, this has been a most intractable negotiation that he has never looked like closing. He mentions \"ceasefire\" in his social media post only as a discussion for Russia and Ukraine, not as the call he made for an unconditional cessation of hostilities. There's no mention of the frustrations he once threatened at intensive Russian bombing, or of the sanctions he once threatened against Moscow. Far from it, he speaks of \"large-scale trade with the United States when this bloodbath is over\". He adds that Ukraine can be a trade beneficiary from the country's rebuilding. In Kyiv and allied European capitals, they were looking for strong-armed support from Washington. European leaders had called Trump the day before he spoke to Putin to discuss sanctions and to reinforce their need for US support in steering the Russian leader towards serious engagement. They will be making further calls to the White House to clarify where they stand now, for fear they stand alone. Ukraine was never a pet project of Donald Trump. In his ambitions to reshape the world order, restored relations with Russia has always been a prize as he eyes China as adversary-in-chief. In the bigger picture, Ukraine has always been a small feature. It shows. Mr Putin found the call \"informative, frank and very useful\", Russian news agency RIA reported. \"A ceasefire in the situation in Ukraine for a certain period of time is possible if appropriate agreements are reached,\" the Russian leader reportedly said. Discussions are 'positive,' says Zelenskyy The US president spoke separately to Ukrainian President Volodymyr Zelenskyy and various European leaders. At a briefing after the day's calls had taken place, Ukraine's leader said he told Mr Trump that Russia \"might propose some particularly difficult conditions\" for a ceasefire - which could be \"a sign that it is the Russian side that is unwilling to end the war\". \"I think we are still discussing the very possibility of strong and severe sanctions [on Russia],\" he continued. \"I don't yet have an answer to that question.\" Kyiv is considering the possibility of a meeting between \"high-level\" teams from Ukraine, the US, Russia and some European countries, Mr Zelenskyy said, describing the talks on Monday as \"positive\". He continued: \"Such a meeting could take place in Turkey, the Vatican, or Switzerland. We are currently considering these three venues, as all three countries - all three venues - are neutral.\" European leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce. The Russian president has resisted that, insisting that conditions be met first. The Trump-Putin call came as Russia has continued to target Ukraine with attacks. Moscow on Monday claimed its forces have taken two villages in Ukraine, according to state news agency RIA. Read more:Russia bans Amnesty InternationalUkraine-Russia talks revealed stark reality - analysis Russia recently began pushing into the Sumy region after claiming it had ousted Kyiv's forces from Russia's neighbouring Kursk region. RIA cited the defence ministry as saying Novoolenivka, in the eastern Donetsk region, and Marine, in Sumy, have now been taken by Russian forces.  Ukraine's air force said Russia launched 112 drones over various parts of the country overnight, killing two people and leaving another 13 injured. On Sunday, Kyiv officials said Russia had launched the largest drone attack of the war so far by firing 273 explosives into Ukraine over the course of Saturday night into the following morning."
    },
    {
        "title": "Sir Keir Starmer refuses to say whether 'genocide' is taking place in Gaza following UN warning",
        "description": "Sir Keir Starmer has refused to say whether Israel is committing genocide in Gaza following warnings from a top UN official.",
        "url": "https://news.sky.com/story/sir-keir-starmer-refuses-to-say-whether-genocide-is-taking-place-in-gaza-following-un-warning-13370978",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-khan-younis-gaza_6921514.jpg?20250519145414",
        "type": "World",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-05-19 12:29:00",
        "Headline": "The prime minister says the current situation in Gaza - where Israel has agreed to allow in a limited supply of aid - is \"unacceptable\" and \"intolerable\".",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer has refused to say whether Israel is committing genocide in Gaza following warnings from a top UN official. Tom Fletcher, head of the UN Office for the Coordination of Humanitarian Affairs, warned the body's security council last week that it must \"act now\" to \"prevent genocide\" - a claim that Israel has vehemently denied. He also accused Israel of \"deliberately and unashamedly\" imposing inhumane conditions on Palestinians by blocking aid from entering Gaza more than 10 weeks ago. Politics latest: Starmer says EU deal a 'win-win'  On Monday, following pressure from some of its allies, Israel agreed to allow limited deliveries to resume. The decision means 20 aid trucks carrying mostly food will enter Gaza following a three-month blockade that prompted multiple warnings of starvation and famine in the Palestinian territory. Under the Genocide Convention, genocide refers to acts committed with the \"intent to destroy, in whole or in part, a national, ethnical, racial or religious group\". \n                  First aid trucks enter Gaza since early March - as UN says it is a 'drop in the ocean'\n                 \n                  Gaza at mercy of what comes next as Israel ramps up brutal offensive\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 It can include killing members of the group, causing serious bodily or mental harm, and inflicting conditions that bring about its physical destruction. Israel has repeatedly denied accusations of genocide, with Prime Minister Benjamin Netanyahu branding a recent UN report on the issue biased and antisemitic. \"Instead of focusing on the crimes against humanity and war crimes committed by the Hamas terrorist organisation... the United Nations once again chooses to attack the state of Israel with false accusations,\" he said in a statement. Asked by Sky News' political editor Beth Rigby whether he believed a genocide was taking place in Gaza, Sir Keir Starmer did not directly answer. Instead the prime minister said there was a \"really serious, unacceptable, intolerable situation\" unfolding in the territory.  Sir Keir's words were echoed by European Commission President Ursula von der Leyen, who was speaking alongside the PM at a news conference in London to mark the new UK-EU trade deal. She also said the humanitarian situation in Gaza was \"unacceptable\" as she urged for the blockade on Gaza to be \"lifted now\". In a video statement posted to social media on Monday, Mr Netanyahu said he was allowing limited aid into Gaza because Israel's \"greatest friends in the world\" - whom he did not specify - had threatened to withdraw support for his country. He said a \"starvation crisis\" would jeopardise Israel's new offensive against Hamas in Gaza, and a \"basic\" amount of food would be allowed in. At the same time, Israel has ramped up its offensive in Gaza after Mr Netanyahu announced plans to seize all of the territory and hold it indefinitely. Read more:How Israel has escalated Gaza bombing campaignGaza at mercy of what comes next as Israel ramps up brutal offensive Israeli officials have said the plan - which would move Gaza's civilian population southward - will help it achieve its aim of defeating Hamas after the group's attack on 7 October 2023 which saw 1,200 people killed and about 250 taken hostage. Israel also believes the offensive will prevent Hamas from looting and distributing humanitarian aid, which it says strengthens the group's rule in Gaza. The UN has rejected the plan - which it said would mean aid is distributed in hubs - saying it was \"in contravention of globally-established humanitarian principles\" and raised the chance of aid \"not getting through to the most vulnerable people\". On Monday, the Israeli military issued an evacuation order for residents of Gaza's second-largest city, Khan Younis, and nearby towns, warning that the entire area \"will be considered a dangerous combat zone\". Gaza's health ministry says more than 53,000 people have died in Israel's 19-month campaign, although it does not distinguish between civilians and militants. It reported 464 people had died in Israeli military strikes in the week to Sunday."
    },
    {
        "title": "Iranian ambassador summoned to Foreign Office after three men charged under National Security Act",
        "description": "The UK government has summoned Iran's ambassador in response to three Iranian nationals being charged under the National Security Act.",
        "url": "https://news.sky.com/story/iranian-ambassador-summoned-to-foreign-office-after-three-men-charged-under-national-security-act-13370987",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-foreign-office-fcdo_6827718.png?20250213145408",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-19 12:42:00",
        "Headline": "The UK government said \"Iran must be held accountable for its actions\" after three Iranian nationals were charged with spying offences.",
        "Content": "The UK government has summoned Iran's ambassador in response to three Iranian nationals being charged under the National Security Act. The three men were charged with spying offences at Westminster Magistrates' Court over the weekend. Mostafa Sepahvand, 39, Farhad Javadi Manesh, 44, and Shapoor Qalehali Khani Noori, 55, are alleged to have targeted journalists working for Iran International, an independent media organisation based in London. Iran's ambassador to the UK, Seyed Ali Mousavi, has now been summoned to the Foreign Office, the government said on Monday. \"The UK government is clear that protecting national security remains our top priority and Iran must be held accountable for its actions,\" a statement read. \"The summons follows this weekend's announcement which stated that three Iranian nationals had been charged with engaging in conduct likely to assist a foreign intelligence service.\" Iranian news agency, ISNA, reported on Sunday that Iran had summoned the UK ambassador in Tehran in protest over what it called the \"unlawful baseless arrest of Iranian nationals\". Sepahvand, Manesh and Noori are accused of \"engaging in conduct likely to assist a foreign intelligence service\" between August 2024 and February 2025, following an investigation by counter-terror police. They are alleged to have arrived in the UK by \"irregular means\", including small boats and a lorry, before claiming asylum. Sepahvand is also charged with engaging in surveillance, reconnaissance and open-source research, intending to commit acts, namely serious violence against a person in the UK. Manesh and Noori are further charged with engaging in surveillance and reconnaissance, with the intention that acts, namely serious violence against a person in the UK, would be committed by others. 'Extremely serious' Commander Dominic Murphy, from the Metropolitan Police's Counter Terrorism Command, described the charges as \"extremely serious\". \"Since the men were arrested two weeks ago, detectives have been working around the clock and we have worked closely with colleagues in the Crown Prosecution Service to reach this point,\" he said on the weekend. \"Now that these men have been charged, I would urge people not to speculate about this case, so that the criminal justice process can run its course.\" Read more from Sky News:What is in the Brexit reset agreement?Gary Lineker departs from BBCMessages of support pour in for Joe Biden The trio were arrested on 3 May, the same day five other Iranian nationals were also arrested, in a separate, unrelated probe into an alleged plot reportedly targeting the Israeli embassy. Four of those five were released from custody on Saturday, while the fifth was released on bail with conditions. Sepahvand, Manesh and Noori are due to appear at the Old Bailey on 6 June."
    },
    {
        "title": "UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'",
        "description": "The UK and EU have agreed a new post-Brexit reset trade deal after months of negotiations.",
        "url": "https://news.sky.com/story/uk-and-eu-agree-new-trade-deal-13370825",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-eu-flag-parliament_6810976.jpg?20250126093028",
        "type": "World",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-19 07:19:00",
        "Headline": "Talks are continuing on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The UK and EU have agreed a new post-Brexit reset trade deal after months of negotiations. Sir Keir Starmer declared \"Britain is back on the world stage\", while European Commission President Ursula von der Leyen said it was a \"historic moment\". The talks were the first since Boris Johnson agreed the initial Brexit deal in January 2020, when the UK left the EU. Politics latest: Details of UK-EU deal emerge Some of the main points include eGate access for British passport holders in Europe, no health certificates every time pets travel to Europe and the removal of red tape from most food and drink imports and exports. Negotiations went \"down to the wire\", with a breakthrough at about 10.30pm on Sunday ahead of a Monday 10am deadline, as UK fishing rights were, yet again, a major sticking point. Sky News understands the EU wanted permanent access to UK waters for fishing, but they have agreed a deal which extends the current rules on fishing for 12 years. There will be no change to the current access for UK fishing communities, with no reduction in British quotas or increase in the amount the EU is allowed to catch, which is set annually. Fishing rights were a major part of the Brexit \"leave\" campaign, although the industry only accounts for 0.4% of GDP. Read more: What is in the Brexit reset agreement? eGates and pet passports Under the new deal, British passport holders will be able to use eGates in Europe following years of lengthy passport control queues. The prime minister called on EU members \"to help make this a reality without delay\". Pet passports will also be brought back so cats, dogs and ferrets coming from the UK will no longer need expensive health certificates from vets in both the UK and Europe to travel with their owners to the EU. Most routine checks and the need for certificates for food and drinks have been removed, which the government said will reduce the burden on businesses and reduce lorry queues at the border. Sir Keir said British burgers and sausages will be allowed into the UK again. Read more:People do feel like strangers in Britain, poll findsBritain may have to resort to anti-subversion laws Defence partnership A new security and defence partnership was agreed so the UK defence industry can participate in the EU's plan for a £150bn defence fund called Security Action for Europe (SAFE). What will concern Brexiteers is a line in the official document saying the UK and the EU \"note the importance\" of judicial cooperation in civil and commercial law, including family matters. The Leave campaign had said one of the benefits of Brexit would be judicial independence from the EU. Talks are continuing on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period to work, study and travel. This would also include au pairs. The UK and the EU will also work towards reviving Erasmus, the student exchange programme that was scrapped when Brexit happened. These two points have been controversial as the government is on a drive to cut net migration. The two sides have agreed to further work on finding solutions to tackle illegal migration, including on returns and a joint commitment to tackle Channel crossings.  'Not been easy' Sir Keir promised in his 2024 election manifesto that he would sign a new trade and security deal with the EU, and has embarked on a charm offensive across Europe since winning power. Chancellor Rachel Reeves told a meeting of business leaders it had \"not been easy\" to reach a deal but said it would \"make it easier\" for UK businesses. EU relations minister Nick Thomas-Symonds said it was a \"historic day\". \"Good for jobs, good for bills, good for borders,\" he posted on X. \"And more... Britain back on the world stage, with a government in the service of working people.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Conservative leader Kemi Badenoch called the deal \"very concerning\" and said that 12 years EU access for fishing is three times longer than the government wanted. \"We're becoming a rule-taker from Brussels once again,\" she said. \"And with no details on any cap or time limits on youth mobility, fears of free movement returning will only increase.\" Reform UK leader and Brexiteer Nigel Farage described the deal as a \"surrender\" and said the 12-year fishing deal \"will be the end of the fishing industry\". Business Secretary Jonathan Reynolds told Sky News that details were still being worked out just three hours before the deadline. With just over an hour to go before the 10am deadline, the EU ambassadors' committee approved the deal ahead of a summit with EU leaders in London on Monday."
    },
    {
        "title": "Sudan's war is in a dangerous new phase - can its new prime minister provide a steer for civilians?",
        "description": "After the trumpet horns of military victory sounded off in Sudan's capital Khartoum, the deadly buzz of Rapid Support Forces (RSF) drones followed.",
        "url": "https://news.sky.com/story/sudans-war-is-in-a-dangerous-new-phase-can-its-new-prime-minister-provide-a-steer-for-civilians-13371026",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sudan-port-fuel_6908229.jpg?20250506162052",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-05-19 14:00:00",
        "Headline": "It is the first time Sudan has installed a prime minister since 2021. But it's unclear how much power the PM will have as the army fights its devastating battle against paramilitary forces. ",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n After the trumpet horns of military victory sounded off in Sudan's capital Khartoum, the deadly buzz of Rapid Support Forces (RSF) drones followed. The war has entered a dangerous aerial phase with any illusions of normalcy shattered by multi-day drone attacks on the wartime administrative centre Port Sudan and sanctuary cities across the northeast. Sudan's army chief Abdel Fattah al Burhan appointed Kamil Idris, a former UN official, as prime minister of the country's military-led government on Monday. It is the first time Sudan has installed a PM since 2021, when a coup ousted civilian leadership and established a caretaker government. But it's unclear how much power Idris will have as the army fights its devastating battle against the paramilitary RSF. Will the appointment of the international diplomat as prime minister provide a steer for civilians in the growing chaos or entrench the military state on shifting sand? In February, the RSF held a conference in Nairobi, Kenya, announcing a parallel government as their loss of Khartoum was imminent. \n                  Sudan's paramilitary launches drone attacks on wartime capital\n                 \n                  Sudanese man separated from his family by war and wounded by a stray bullet, returns home after two years\n                 \n                  State of panic growing in Sudan's wartime capital amid drone strikes\n                 Now, the army is presenting its own counterweight to their opponent's growing aerial advantage. The current cabinet in Port Sudan will be dissolved and the new prime minister will have full powers to appoint ministers and run a transitional government. For the last two years of war, army chief Burhan has addressed the country as de facto president. As millions suffer from spreading armed conflict and starvation, he wore fatigues and spoke of military might.  Sudanese people have increasingly supported the army they protested against in the 2019 revolution out of sheer necessity. The only form of protection against the mass killing and sexual violence of the RSF. The two warring parties were security partners for two decades before they finally turned against one another.  Read more:What does Sudan execution video tell us?Sudan's history faces erasure once again Burhan and the head of the RSF, Mohamed Hamdan \"Hemedti\" Dagalo, teamed up in a joint coup in October 2021 to derail a transition to civilian governance after the revolution. Civilian authority has never been respected or honoured by either side. So can the same military elite who refused to hand over to the people after a popular uprising be trusted to give a civilian prime minister any authority in a state of martial law?"
    },
    {
        "title": "Romania's new president Nicosur Dan finally looks like he's enjoying life after a campaign full of rancour and division",
        "description": "The roads in the heart of Bucharest were swaying. People were singing, laughing, and looking up at a balcony, waiting for the next president to appear.",
        "url": "https://news.sky.com/story/romanias-new-president-nicosur-dan-finally-looks-like-hes-enjoying-life-after-a-campaign-full-of-rancour-and-division-13370764",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-adam-parsons-romania_6921164.png?20250519032041",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-05-19 01:23:00",
        "Headline": "Official results from almost all of Romania's voting stations showed Nicusor Dan, mayor of Bucharest, received about 54% of ballots cast.",
        "Content": "\n          Europe correspondent\n              @adamparsons\n The roads in the heart of Bucharest were swaying. People were singing, laughing, and looking up at a balcony, waiting for the next president to appear. In the end, he took to the street, walking along the pavement, high-fiving everyone within reach. After a campaign full of rancour and division, Nicosur Dan, a 55-year-old mathematician, finally looked like he was enjoying life. His victory was more comprehensive than most had predicted. A week ago, the favourite to win this election was his rival, the populist George Simion, but Dan gradually rose in the polls.  Among the crowd, there was a sense that some had voted because they wanted him to win, and others had backed him because they didn't like Mr Simion's Donald Trump-inspired brand of strongman leadership. Some even felt it brought back memories of the brutal communist past that once cowed this country. \"I have felt overwhelmed and scared,\" said Nicoletta. \"For the last couple of weeks we lived in terror of returning to something we had to live with for 45 years.\" Alongside her was Ada - one of many, many young voters I met in the crowd. She told me she felt like she was \"dreaming\", after waking up in the morning \"worried that the nightmare would not finish\". \n                  Nicusor Dan beats hard-right favourite George Simion in Romanian election\n                 \n                  Romania votes in second round of presidential election - with Bucharest mayor and hard-right Trump supporter almost tied in polls\n                 \n                  George Simion: Meeting the proud pro-Trumper who could be Romania's new president\n                 But now, she was thrilled - convinced that Mr Dan can reinvigorate his country: \"We put our trust in him because we don't want to leave the country - we are Romanians by home, we feel Romanian, we think Romanian.\" There were many flags here with the blue and yellow of the European Union - few doubt that Mr Dan had more affection for the EU than Mr Simion. I met a couple who had both draped themselves in EU flags and told me that \"we hope we will be going the European way\". Another couple told me they had been terrified that Mr Simion would take Romania out of the EU - a claim he flatly denied when I met him the day before the election.  We had spoken to Mr Simion earlier in the day, when he seemed quietly confident of victory. \"People are fed up with normal politicians,\" he told me in the shadow of Bucharest's enormous parliament - the biggest building in Europe. A landslide, he felt sure, was on the way. Around him were populist politicians and activists from around the world - including Britain, America, Italy, France, Poland and the Netherlands. They cheered him, and agreed that victory was within sight. And then came the exit poll, and the realisation that the momentum of his dominant triumph in the first round of this election had faded. Still, Mr Simion insisted he would win, naming himself as the Romanian president on Facebook. It was only in the small hours that Mr Simion admitted that he had been beaten by a million votes, emerging to declare that he would keep fighting. \"I will be there in all of the battles we have ahead of us - this work is just starting and I will be there with every one of you,\" he said, punching the air before walking off. He wants to remain the leader for, as he puts it, \"patriots, sovereignists and conservatives\" who want to return to \"democracy and common sense\". Read more from Sky News:Israel to allow 'basic quantity of food' into GazaJoe Biden diagnosed with 'aggressive' form of prostate cancerGary Lineker to leave BBC next week Romania has had a turbulent six months, starting with the decision to cancel the last presidential election because of suspected Russian interference, and then to ban Calin Georgescu, the man who allegedly benefited from that Moscow master plan. Even some of Mr Georgescu's most avowed opponents felt uneasy that an election had been cancelled in that way. Then the schism between the politics of Mr Simion and Mr Dan split the country, as did the lingering sense that Romanian democracy was under scrutiny. So now the challenge is to unite and heal this nation - a strategically crucial member of both the EU and NATO. And that is Mr Dan's most immediate challenge. As he was soaking up the cacophony and affection last night, a group of his supporters were opening champagne and pouring out glasses in the street, toasting their new president. For Mr Dan, victory is a great achievement, but if he is to succeed in this job, he will need many more great achievements ahead. To win is one thing; to prosper is quite another."
    },
    {
        "title": "One dead, more than 60 rescued, after migrant boat sinks off French coast",
        "description": "One person has died after a boat carrying migrants sank while attempting to cross the English Channel, according to French officials.",
        "url": "https://news.sky.com/story/one-dead-more-than-60-rescued-after-migrant-boat-sinks-off-french-coast-13370799",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-migrants-border-force_6530698.jpg?20240423132816",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-19 06:48:00",
        "Headline": "Among the survivors was a child and his mother suffering hypothermia, who were airlifted to hospital by helicopter, while the others were taken to the quay in Boulogne-sur-Mer, around 19 miles (30km) south of Calais.",
        "Content": "One person has died after a boat carrying migrants sank while attempting to cross the English Channel, according to French officials. The Maritime Prefect of the Channel and the North Sea said 61 survivors had been rescued overnight and taken to Boulogne-sur-Mer after their \"overloaded boat\" broke up. The French assistance and rescue intervention tug (RIAS) Abeille Normandie deployed three speedboats to recover 50 people. Two more were rescued by an RNLI lifeboat from Dungeness, and another nine by the British vessel Border Force Ranger - they were all transferred to the Abeille. In addition, an unconscious person was spotted in the water by a French Navy helicopter and recovered by the RNLI lifeboat. They were transferred to the French tug but declared dead by the medical team on board. Among the survivors was a child and his mother suffering hypothermia, who were airlifted to hospital by helicopter, while the others were taken to the quay in Boulogne-sur-Mer, around 19 miles (30km) south of Calais. There has been no update about their condition. A UK government spokesman said: \"We can confirm there has been a tragic incident in the Channel involving a small boat in French waters which has resulted in the loss of one life. \"This latest tragedy underlines the terrible dangers of small boat crossings, and we continue to do everything we can to prevent callous criminals exploiting vulnerable people. Our thoughts are with those affected.\" Read more from Sky News:Criminal record data stolen in cyber attackJoe Biden diagnosed with prostate cancerAnalysis: EU summit deal marks post-Brexit reset Recent figures show the number of people crossing the Channel has continued to rise, passing the 12,000 mark last week. The most recent figures on crossings show that 1,125 people were recorded arriving in the UK by small boat in the last seven days until 17 May. Sir Keir Starmer has committed his government to \"Smash The Gangs\", referring to a campaign of targeting people smugglers and small boat crossings, which remain at a record high this year. On Tuesday, the prime minister sparked a backlash from some of his MPs after arguing that Britain \"risked becoming an island of strangers\" if immigration levels are not cut. He plans to reduce net migration - the difference between immigration and emigration - by the end of this parliament in 2029."
    },
    {
        "title": "Russia bans Amnesty International as an 'undesirable organisation'",
        "description": "Russian authorities have outlawed Amnesty International, meaning involvement with the human rights group is now a criminal offence.",
        "url": "https://news.sky.com/story/russia-bans-amnesty-international-as-an-undesirable-organisation-13370917",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-amnesty-international_6921418.jpg?20250519131227",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-19 11:50:00",
        "Headline": "The Russian prosecutor general's office accused the international human rights group of being a \"centre for the preparation of global Russophobic projects\". But civil rights organisations argue it just proves Russia's \"dark, corrupt and criminal places and practices\".",
        "Content": "Russian authorities have outlawed Amnesty International, meaning involvement with the human rights group is now a criminal offence. The decision by the prosecutor general's office is the latest crackdown on Kremlin critics, journalists and activists that intensified after Moscow invaded Ukraine in February 2022. In its statement, the office labelled Amnesty International as an \"undesirable organisation\" and accused it of being a \"centre for the preparation of global Russophobic projects\". The designation means the group must stop any work in Russia, and anyone who cooperates or supports it could face prosecution. That includes if anyone shares Amnesty's reports on social media. The office also accused Amnesty of intensifying the military confrontation between Russia and Ukraine. \"They justify the crimes of Ukrainian neo-Nazis, call for an increase in their funding, and insist on the political and economic isolation of our country,\" the statement added. Russian officials regularly accuse Ukraine of being dominated by \"neo-Nazis\", an accusation widely seen in the West as baseless propaganda. Ukraine war latest: Why full ceasefire is unlikely Amnesty did not immediately reply to a request by Sky News for comment, but Human Rights Watch - another international civil rights group - said the ban \"simply highlights Russia's ambition to hide the truth about human rights violations\". Rachel Denber, deputy director of the Europe and Central Asia division, told Sky News: \"This designation is nothing more than an attempt by authorities to intimidate and deter Russian citizens from supporting or cooperating with this prominent, deeply respected organisation.\" Read more from Sky News:UK and EU agree Brexit reset trade dealIsrael allows 'basic quantity of food' into GazaPro-West candidate wins Romanian election Another independent group, the International Service for Human Rights, said: \"We deplore the effective criminalisation of Amnesty International in Russia.\" \"The banning of Amnesty in Russia just proves that there are dark, corrupt and criminal places and practices that [Vladimir] Putin doesn't want the world to see,\" executive director Phil Lynch told Sky News in a statement. Founded in 1961 and headquartered in London, Amnesty International campaigns for human rights across the world, including on behalf of those it designates prisoners of conscience. Campaigns supporting Russian rights In recent years, Amnesty International has released reports on Russia's war in Ukraine, accusing Moscow of crimes against humanity. It has also spoken out against the Kremlin's crackdown on dissent that has swept up thousands of people in recent years. Russia's list of \"undesirable organisations\" currently covers 223 entities, including prominent independent news outlets and rights groups. They include Radio Free Europe/Radio Liberty or Russian independent outlet Meduza, think tanks like UK-based Chatham House, anti-corruption group Transparency International and opposition group, Open Russia."
    },
    {
        "title": "King writes to Biden after former US president reveals cancer diagnosis",
        "description": "The King has written privately to former US president Joe Biden after he was diagnosed with an aggressive form of prostate cancer, Buckingham Palace said",
        "url": "https://news.sky.com/story/messages-of-support-pour-in-for-joe-biden-after-prostate-cancer-diagnosis-13370842",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-king-joe-biden-windsor-castle_6921515.jpg?20250519145744",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-19 07:53:00",
        "Headline": "The King's private message comes after politicians including Donald Trump, Barack Obama and Sir Keir Starmer wished the former US president a full and speedy recovery.",
        "Content": " The King has written privately to former US president Joe Biden after he was diagnosed with an aggressive form of prostate cancer, Buckingham Palace said The monarch, who is undergoing his own treatment for an undisclosed cancer, hosted the 82-year-old for tea and talks at Windsor in July 2023. Mr Biden was diagnosed on Friday, with tests revealing the cancer had spread to his bones. The former US president posted an image of himself and his wife Jill on X on Monday and wrote: \"Cancer touches us all. Like so many of you, Jill and I have learned that we are strongest in the broken places. Thank you for lifting us up with love and support.\" When the King was diagnosed with cancer at the start of 2024, Mr Biden was president and expressed his concern. Mr Biden, who is six years older than the 76-year-old monarch, told reporters at the time: \"I'm concerned about him. Just heard about his diagnosis. I'll be talking to him, God willing.\" He later tweeted: \"Navigating a cancer diagnosis, treatment, and survivorship takes hope and absolute courage.\" The King's private message comes after British Prime Minister Sir Keir Starmer said he was \"very sorry to hear\" the news about Mr Biden's cancer diagnosis. \"All the very best to Joe, his wife Jill and their family, and wishing the President swift and successful treatment,\" he added. Meanwhile, US President Donald Trump said he was \"saddened\" by the news, adding: \"We extend our warmest and best wishes to Jill and the family, and we wish Joe a fast and successful recovery.\" Former US president Barack Obama said: \"Michelle and I are thinking of the entire Biden family. \"Nobody has done more to find breakthrough treatments for cancer in all its forms than Joe, and I am certain he will fight this challenge with his trademark resolve and grace. We pray for a fast and full recovery.\" Read more: Biden diagnosed with 'aggressive' form of prostate cancer Mr Biden dropped out of the 2024 presidential race against Mr Trump after a disastrous debate performance fuelled concerns around his age and fitness to serve. Weeks after the debate, he referred to Ukrainian President Volodymyr Zelenskyy as \"President Putin\" during a NATO summit. When he dropped out of the race, he endorsed his vice president Kamala Harris. Ms Harris wrote on X after Mr Biden's cancer diagnosis: \"We are keeping him, Dr. Biden, and their entire family in our hearts and prayers during this time. \"Joe is a fighter - and I know he will face this challenge with the same strength, resilience, and optimism that have always defined his life and leadership. We are hopeful for a full and speedy recovery.\" Read more from Sky News:UK and EU sign reset deal - live updatesGary Lineker to leave BBC next weekPop singer says 'Diddy' would 'punch, choke and slap' Cassie  Former US president Bill Clinton wrote on social media: \"My friend Joe Biden's always been a fighter. Hillary and I are rooting for him and are keeping him, Jill, and the entire family in our thoughts.\" Former first lady Hillary Clinton, who unsuccessfully ran for president in 2016, said she was \"thinking of the Bidens as they take on cancer, a disease they've done so much to try to spare other families from\". Speaker of the US House of Representatives Mike Johnson said it was \"sad news\" and his family \"will be joining the countless others who are praying\" for Mr Biden. Former House speaker Nancy Pelosi described Mr Biden as a \"great American patriot\" and said she was \"praying for him to have strength and a swift recovery\". Mr Trump's secretary of state, Marco Rubio, wrote on social media that he and his wife were \"united in prayer for the Biden Family during this difficult time\". Mr Biden's diagnosis came after he reported urinary symptoms, which led doctors to discover a nodule on his prostate. Prostate cancer is assigned a Gleason score, which ranges from two to 10 and indicates how abnormal the cancer cells are when compared to healthy tissue under a microscope. Mr Biden's office reported his score was nine, suggesting a highly aggressive form of the disease. \"While this represents a more aggressive form of the disease, the cancer appears to be hormone-sensitive, which allows for effective management,\" a statement from Mr Biden's office read."
    },
    {
        "title": "Was Trump's Middle East trip an 'unbridled success'?",
        "description": "<a target=\"_blank\" href='https://podfollow.com/trump100/view'>👉 Follow Trump100 on your podcast app 👈  </a>",
        "url": "https://news.sky.com/story/was-trumps-middle-east-trip-an-unbridled-success-13370631",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-trump100-podcasts_6901216.png?20250430053042",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-19 04:05:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump100 on your podcast app 👈   Following President Trump's Middle East trip - which the White House is touting as an unbridled success - Sky News' Martha Kelner sits down with Barbara Leaf, who was US ambassador to the United Arab Emirates during Trump's first term and assistant secretary of state for Near Eastern affairs in the Biden administration. She was also in the team that formed the first formal US presence in Syria after more than a decade. On this episode, Martha and Barbara discuss the significance of Mr Trump's Middle East visit, including his meeting with the Syrian President Ahmed al Sharaa, drawing from Barbara's own meeting with the former jihadist. Plus, former president Joe Biden has been diagnosed with an aggressive form of prostate cancer. Martha shares Mr Trump's response to the news. If you've got a question you'd like the Trump100 team to answer, you can email it to trump100@sky.uk. Don't forget, you can also watch all episodes on our YouTube channel."
    },
    {
        "title": "'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump",
        "description": "Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine &#8211; but added the US has a red line in upcoming talks. ",
        "url": "https://news.sky.com/story/unlimited-potential-in-us-russia-trade-says-trump-after-two-hour-putin-call-13371047",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-trump-donald_6921898.jpg?20250519224130",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-19 15:06:00",
        "Headline": "The US president spoke to his Russian and Ukrainian counterparts on Monday as part of a bid to push Moscow and Kyiv towards agreeing a ceasefire.",
        "Content": " Donald Trump has said there is a \"good chance\" of peace between Russia and Ukraine – but added the US has a red line in upcoming talks.  After a two-hour phone call with Vladimir Putin, the US president announced on Monday that Russia-Ukraine discussions will begin \"immediately\". It is unclear how these will differ from negotiations that already started in Turkey last Friday. Speaking to reporters in the Oval Office later on Monday, Mr Trump said he does have a red line on when he'll stop pushing Moscow and Kyiv for peace - but would not say what it is. There are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\" The US president also claimed he asked Mr Putin on their call: \"When are we going to end this bloodbath?\" He said of the Russian president: \"I do believe he wants to end [the war].\" \"My whole life is deals, one big deal, and if I thought that President Putin did not want to get this over with, I wouldn't even be talking about it because I'd just pull out,\" he added. The US president spoke to his Russian counterpart on Monday as part of a bid to push the two countries towards agreeing a truce in the war. In a Truth Social post, published shortly after the call, Mr Trump said Russia and Ukraine \"will immediately start negotiations towards a ceasefire and, more importantly, an end to the war\". Mr Trump continued: \"Russia wants to do large-scale trade with the United States when this catastrophic 'bloodbath' is over, and I agree. \"There is a tremendous opportunity for Russia to create massive amounts of jobs and wealth. Its potential is unlimited.\" Ukraine \"can be a great beneficiary on trade, in the process of rebuilding its country\", he said. The Vatican \"has stated that it would be very interested in hosting the negotiations\", Mr Trump added. He signed off his post with: \"Let the process begin!\" US correspondent For the war that Donald Trump said he'd solve in a day, read the war he couldn't solve at all.  By posting on Truth Social that an end to the Russia-Ukraine conflict will be negotiated between the two parties, the US president puts distance between himself and the deal he couldn't seal.  The United States appears to be taking a step back from its stewardship of negotiations, as it leaves both sides to it. The broker broken? For Trump, certainly, this has been a most intractable negotiation that he has never looked like closing. He mentions \"ceasefire\" in his social media post only as a discussion for Russia and Ukraine, not as the call he made for an unconditional cessation of hostilities. There's no mention of the frustrations he once threatened at intensive Russian bombing, or of the sanctions he once threatened against Moscow. Far from it, he speaks of \"large-scale trade with the United States when this bloodbath is over\". He adds that Ukraine can be a trade beneficiary from the country's rebuilding. In Kyiv and allied European capitals, they were looking for strong-armed support from Washington. European leaders had called Trump the day before he spoke to Putin to discuss sanctions and to reinforce their need for US support in steering the Russian leader towards serious engagement. They will be making further calls to the White House to clarify where they stand now, for fear they stand alone. Ukraine was never a pet project of Donald Trump. In his ambitions to reshape the world order, restored relations with Russia has always been a prize as he eyes China as adversary-in-chief. In the bigger picture, Ukraine has always been a small feature. It shows. Mr Putin found the call \"informative, frank and very useful\", Russian news agency RIA reported. \"A ceasefire in the situation in Ukraine for a certain period of time is possible if appropriate agreements are reached,\" the Russian leader reportedly said. Discussions are 'positive,' says Zelenskyy The US president spoke separately to Ukrainian President Volodymyr Zelenskyy and various European leaders. At a briefing after the day's calls had taken place, Ukraine's leader said he told Mr Trump that Russia \"might propose some particularly difficult conditions\" for a ceasefire - which could be \"a sign that it is the Russian side that is unwilling to end the war\". \"I think we are still discussing the very possibility of strong and severe sanctions [on Russia],\" he continued. \"I don't yet have an answer to that question.\" Kyiv is considering the possibility of a meeting between \"high-level\" teams from Ukraine, the US, Russia and some European countries, Mr Zelenskyy said, describing the talks on Monday as \"positive\". He continued: \"Such a meeting could take place in Turkey, the Vatican, or Switzerland. We are currently considering these three venues, as all three countries - all three venues - are neutral.\" European leaders and Ukraine have demanded Russia agree to a ceasefire immediately, and Mr Trump has focused on getting Mr Putin to commit to a 30-day truce. The Russian president has resisted that, insisting that conditions be met first. The Trump-Putin call came as Russia has continued to target Ukraine with attacks. Moscow on Monday claimed its forces have taken two villages in Ukraine, according to state news agency RIA. Read more:Russia bans Amnesty InternationalUkraine-Russia talks revealed stark reality - analysis Russia recently began pushing into the Sumy region after claiming it had ousted Kyiv's forces from Russia's neighbouring Kursk region. RIA cited the defence ministry as saying Novoolenivka, in the eastern Donetsk region, and Marine, in Sumy, have now been taken by Russian forces.  Ukraine's air force said Russia launched 112 drones over various parts of the country overnight, killing two people and leaving another 13 injured. On Sunday, Kyiv officials said Russia had launched the largest drone attack of the war so far by firing 273 explosives into Ukraine over the course of Saturday night into the following morning."
    },
    {
        "title": "Pop star says Combs threatened to kill her if she spoke about violence as Cassie's ex-best friend gives evidence",
        "description": "A former pop star has told a court Sean \"Diddy\" Combs was \"frequently\" violent with his ex-partner Cassie Ventura, and that he threatened her life if she spoke out about it.",
        "url": "https://news.sky.com/story/pop-star-says-combs-threatened-to-kill-her-if-she-spoke-about-violence-as-cassies-ex-best-friend-gives-evidence-13371265",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dawn-richard-sean-combs_6921929.jpg?20250519232909",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-19 22:12:00",
        "Headline": "During the sixth day of the Sean \"Diddy\" Combs sex-trafficking trial, the court heard of multiple alleged attacks on Cassie Ventura, drugs \"in a Louis Vuitton pouch\" and the names of multiple celebrities were dropped during evidence.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n A former pop star has told a court Sean \"Diddy\" Combs was \"frequently\" violent with his ex-partner Cassie Ventura, and that he threatened her life if she spoke out about it. Dawn Richard told the jury in Manhattan federal court that Combs made the threat after she allegedly witnessed him trying to hit Cassie with an egg skillet. She said the Bad Boy Records founder told her and another woman who saw the alleged attack that \"we could go missing\" if they revealed details of what they saw. Richard, who was a former member of girl group Danity Kane and electric soul trio Dirty Money, said Combs would \"punch [Cassie], choke her, slap her in the mouth, kick her, and punch her in the stomach\". She said of the beatings: \"When [Cassie] had these moments of trying to stick up for herself, [Combs] would hurt her for it.\" Richard also said one alleged incident took place in a West Hollywood restaurant with celebrities including Usher, Big Daddy Kane, Jimmy Iovine and Ne-yo also present. Combs, 55, faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. He denies the allegations against him. \n                  New York helicopter crash tour company to close immediately, says FAA\n                 \n                  Private plane crash in New York kills ex-college football star Karenna Groff and family\n                 \n                  Brother pays tribute to relatives killed in Hudson River helicopter crash - as cause remains unclear\n                 Beginning her evidence on Friday, Richard told the jury Combs would store his drugs in a Louis Vuitton pouch and said she often\" saw him use \"Ketamine, cocaine, molly [also known as Ecstasy]\". Sean 'Diddy' Combs trial: Day 6 - As it happened During cross-examination it was suggested her story had changed over time, but Richard said she was doing her best to recall \"traumatic\" events from more than a decade ago. She admitted she had contacted Diddy after parting ways with his management and agreed that, despite being \"scared\" of him, she asked to come back to work for him. Defence lawyer Nicole Westmoreland suggested Richard was testifying because she was angry that Combs had ended Danity Kane and Diddy - Dirty Money. Ms Westmoreland asked: \"You felt that Mr Combs ruined your career not once but twice?\" \"Yes,\" Richard replied. Following Richard's stint in the stand, Cassie's ex-best friend Kerry Morgan gave evidence. Morgan and Cassie had been friends for more than 17 years after meeting as young models. 'I was dizzy, I vomited' Morgan, who said Combs was prone to \"mood swings\" and could be \"very aggressive\", described two occasions she allegedly saw Combs beat Cassie. She told the court about hearing Cassie's \"guttural, terrifying\" screams before allegedly seeing Combs dragging her by her hair from the master bedroom. Morgan also described when Combs \"choked her\" leaving \"finger marks\" on her throat, and threw a wooden hanger at her head, leaving her with concussion. She said: \"I was dizzy, I vomited a few times. I went to an urgent care facility. I hired a lawyer about the assault. I was planning on filing a lawsuit, but I did not.\" She told the court she received a $30,000 settlement from Combs over the alleged assault, organised by Cassie. Morgan said she and Cassie ceased to be friends after the incident, explaining: \"The reason I stopped speaking to her was because she was not supportive of me after that incident. I draw my line at physical abuse.\" Morgan said Cassie told her she could not leave Combs because she was reliant on him for \"her job, her car, her apartment\". Combs 'jealous' of Michael B Jordan During Cassie's cross-examination by the defence, the court was told that Cassie was jealous of Combs's ex, Kim Porter, while Combs was jealous of actor Michael B Jordan, whom Cassie had a brief relationship with in 2015. While Morgan said she couldn't confirm whether Cassie was in a relationship with the Creed star, she confirmed: \"What I remember was that she was speaking to Michael B Jordan and they hung out together and [Combs] was jealous of it.\" Morgan confirmed she had not wanted to appear in court, having \"moved on\" with her life, and had been subpoenaed to give testimony. Last on the stand was Combs's former personal assistant, David James, who described working 20-hour days for Combs at Bad Boy Records, for six or seven days, for up to three weeks at a time. James, who had also been subpoenaed, said Cassie told him she couldn't leave Combs's \"crazy\" world because \"he controls my career, pays my allowance, and pays my rent\". Combs, previously known as Puff Daddy and P Diddy, founded Bad Boy Records, and is credited with helping turn artists including Mary J Blige, Faith Evans, Notorious B.I.G. and Usher into household names in the 1990s and 2000s. Combs has been jailed since September and faces at least 15 years or possibly life in prison if convicted."
    },
    {
        "title": "Donald Trump 'surprised' public wasn't told about Biden's cancer diagnosis 'a long time ago'",
        "description": "Donald Trump has said he is \"surprised\" the public wasn't \"notified a long time ago\" after Joe Biden was diagnosed with an aggressive form of prostate cancer.",
        "url": "https://news.sky.com/story/donald-trump-surprised-public-wasnt-told-about-bidens-cancer-diagnosis-a-long-time-ago-13371261",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-joe-biden-donald-trump_6792886.jpg?20250106151645",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-19 21:56:00",
        "Headline": "Mr Trump also suggested at least one of the doctors treating Mr Biden had previously found the the former US president to be \"cognitively fine\".",
        "Content": "Donald Trump has said he is \"surprised\" the public wasn't \"notified a long time ago\" after Joe Biden was diagnosed with an aggressive form of prostate cancer. Mr Trump also suggested that at least one of the doctors treating Mr Biden for the disease had previously claimed the former US president was \"cognitively fine\" - something he claims later turned out to be \"not so\". Mr Biden, 82, was diagnosed with cancer on Friday, with tests revealing the disease had spread to his bones. Prostate cancer is assigned a Gleason score, which ranges from two to 10 and indicates how abnormal the cancer cells are when compared to healthy tissue under a microscope. Mr Biden's office reported his score was nine, suggesting a highly aggressive form of the disease. Asked by a reporter at the White House this evening if he had any comment about the diagnosis, Mr Trump said: \"I think it's very sad, actually. \"I'm surprised the public wasn't notified a long time ago because to get to stage nine, that's a long time.\" \n                  King writes to Biden after former US president reveals cancer diagnosis\n                 \n                  Was Trump's Middle East trip an 'unbridled success'?\n                 \n                  'Good chance' of Russia-Ukraine peace but US has a red line in talks, says Donald Trump\n                 Mr Trump said that he had just had a \"very complete\" physical test which included \"cognitive tests\" and added: \"I'm proud to announce I aced it.\" Mr Biden had been running against Mr Trump in the 2024 presidential election before stepping down after a disastrous debate performance fuelled concerns around his age and fitness to serve. Much of the concern was over his cognitive abilities following a series of gaffes - including referring to Ukrainian President Volodymyr Zelenskyy as \"President Putin\" during a NATO summit. In his comments at the White House, Mr Trump suggested that a doctor that had previously tested Mr Biden's cognitive abilities was also involved in diagnosing his cancer. The US president said: \"I think that, if you take a look it's the same doctor that said that Joe was cognitively fine... there was nothing wrong with him. \"Well... if it's the same doctor who said there was nothing wrong there... that's been proven to be a sad situation.\" Mr Trump added that \"in other words\" there are \"things going on that the public wasn't informed of\" and said it was \"very dangerous\". Referencing Mr Biden's diagnosis, the US president continued: \"The other thing you have to say is why did it take so long? I mean... this takes a long time, can take years to get to this level of danger.\" He added: \"I think people should try and find out what happened... Maybe it was the same doctor and somebody is not telling the facts.. That's a big problem.\" It is not clear if the US president was referring to the length of time it took for Mr Biden to get a diagnosis or the amount of time it took for it to be made public.  Mr Trump was speaking to reporters following a two-hour call with Russian President Vladimir Putin on Monday as he tries to negotiate an end to the war in Ukraine. The US president has said in the Oval Office there is a \"good chance\" of peace between Russia and Ukraine - but added that America has a red line in upcoming talks. Mr Trump would not say what that red line is. There are \"big egos involved\", he said before adding: \"This was a European situation, it should have remained a European situation.\"  King send best wishes Earlier it emerged King Charles had privately written to Mr Biden following his cancer diagnosis. The monarch, who is undergoing his own treatment for an undisclosed cancer, hosted the former US president for tea and talks at Windsor in July 2023. The King's private message comes after British Prime Minister Sir Keir Starmer said he was \"very sorry to hear\" the news about Mr Biden's cancer diagnosis. \"All the very best to Joe, his wife Jill and their family, and wishing the President swift and successful treatment,\" he added. Former US president Barack Obama said: \"Michelle and I are thinking of the entire Biden family. \"Nobody has done more to find breakthrough treatments for cancer in all its forms than Joe, and I am certain he will fight this challenge with his trademark resolve and grace. We pray for a fast and full recovery.\" The former US president posted an image of himself and his wife Jill on X on Monday and wrote: \"Cancer touches us all. Like so many of you, Jill and I have learned that we are strongest in the broken places. Thank you for lifting us up with love and support.\""
    },
    {
        "title": "Daily Mail-owner Rothermere eyes minority Telegraph stake in RedBird deal",
        "description": "The publisher of the Daily Mail has held talks in recent days about taking a minority stake in the Telegraph newspapers as part of a deal to end the two-year impasse over their ownership.",
        "url": "https://news.sky.com/story/daily-mail-owner-rothermere-eyes-minority-telegraph-stake-in-redbird-deal-13371049",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-lord-rothermere-daily-mail_6921553.jpg?20250519161644",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-19 15:08:00",
        "Headline": "The DMGT chief was in talks as recently as last week about an agreement to buy up to 10% of the Telegraph alongside RedBird and IMI, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The publisher of the Daily Mail has held talks in recent days about taking a minority stake in the Telegraph newspapers as part of a deal to end the two-year impasse over their ownership. Sky News has learnt that Lord Rothermere, who controls Daily Mail & General Trust (DMGT), was in detailed negotiations late last week which would have seen him taking a 9.9% stake in the Telegraph titles. It was unclear on Monday whether the talks were still live or whether they would result in a deal, with one adviser suggesting that the discussions may have faltered. One insider said that if DMGT did acquire a stake in the Telegraph, the transaction would be used as a platform to explore the sharing of costs across the two companies. They would, however, remain editorially independent. Sources said that RedBird and IMI, whose joint venture owns a call option to convert debt secured against the Telegraph into equity, were hoping to announce a deal for the future ownership of the media group this week, potentially on Thursday. However, the insider suggested that a transaction could yet be struck without any involvement from DMGT. \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  Money blog: Prices could fall 'significantly' due to UK-EU deal, supermarket says; roaming fees compared\n                 \n                  Energy bills set for series of falls as price cap due to be lowered, says forecaster\n                 The progress in the talks to seal new ownership for the right-leaning titles comes days after the government said it would allow foreign state investors to hold stakes of up to 15% in British national newspapers. That would pave the way for Abu Dhabi royal family-controlled IMI to own 15% of the Daily and Sunday Telegraph - a prospect which has sparked outrage from critics including the former Spectator editor Fraser Nelson. The decision to set the ownership threshold at 15% follows an intensive lobbying campaign by newspaper industry executives concerned that a permanent outright ban could cut off a vital source of funding to an already-embattled industry. RedBird Capital, the US-based fund, has already said it is exploring the possibility of taking full control of the Telegraph, while IMI would have - if the status quo had been maintained - been forced to relinquish any involvement in the right-leaning broadsheets. Other than RedBird, a number of suitors for the Telegraph have expressed interest but struggled to raise the funding for a deal. The most notable of these has been Dovid Efune, owner of The New York Sun, who has been trying for months to raise the £550m sought by RedBird IMI to recoup its outlay. On Sunday, the Financial Times reported that Mr Efune has secured backing from Jeremy Hosking, the prominent City investor. Another potential offer from Todd Boehly, the Chelsea Football Club co-owner, and media tycoon David Montgomery, has failed to materialise. RedBird IMI paid £600m in 2023 to acquire a call option that was intended to convert into ownership of the Telegraph newspapers and The Spectator magazine. That objective was thwarted by a change in media ownership laws - which banned any form of foreign state ownership - amid an outcry from parliamentarians. The Spectator was then sold last year for £100m to Sir Paul Marshall, the hedge fund billionaire, who has installed Lord Gove, the former cabinet minister, as its editor. The UAE-based IMI, which is controlled by the UAE's deputy prime minister and ultimate owner of Manchester City Football Club, Sheikh Mansour bin Zayed Al Nahyan, extended a further £600m to the Barclays to pay off a loan owed to Lloyds Banking Group, with the balance secured against other family-controlled assets. Other bidders for the Telegraph had included Lord Saatchi, the former advertising mogul, who offered £350m, while Lord Rothermere, the Daily Mail proprietor, pulled out of the bidding for control of his rival's titles last summer amid concerns that he would be blocked on competition grounds. The Telegraph's ownership had been left in limbo by a decision taken by Lloyds Banking Group, the principal lender to the Barclay family, to force some of the newspapers' related corporate entities into a form of insolvency proceedings. DMGT, RedBird and IMI all declined to comment."
    },
    {
        "title": "UK-EU deal tips Britain down path towards Swiss-style arrangement",
        "description": "There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed.",
        "url": "https://news.sky.com/story/uk-eu-deal-tips-britain-down-path-towards-swiss-style-arrangement-13371123",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-von-der-leyen_6921796.png?20250519203748",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-05-19 17:24:00",
        "Headline": "If you're someone who believe Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed. That's what Donald Trump did last week when he was in Saudi Arabia and it's what Sir Keir Starmer did on Monday, promising the agreement with the EU should generate a whopping £9bn in gross domestic product (GDP) for the UK. Naturally, when you squint a little closer, that figure gets considerably less impressive than it first seems. After all, by 2040 - the year the government was referring to - £9bn will equate to roughly 0.2 percent of GDP, only a tiny fraction of the negative impact most economists have estimated Brexit will have on the economy (the OBR puts it at -4 percent). Whether those negative estimates are any more reliable than the one the prime minister came up with on Monday is a debate for another day, but anyway, this is one of those cases where the numbers are perhaps somewhat less meaningful than the politics. For one thing, even that seemingly small 0.2 percent of GDP is actually bigger than the calculated impact of the India trade deal unveiled earlier this month (and almost certainly bigger than any other trade deal signed since Brexit). That's because a small percentage of a big number is still a relatively big number, and Britain trades more with its neighbours than any other country in the world. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Read more from Sky News:What's in UK-EU Brexit reset trade deal?King writes to Biden after ex-president reveals cancer diagnosis Anyway, more consequential than any numbers is the fact that this government has committed to something its predecessors refused to countenance: aligning certain regulations (most notably food standards) with the European Union.  Previous Conservative governments all shied away from doing so - for fear, they said, of undermining their ability to seek free trade deals with other countries that would insist on greater access to their food markets. Countries like the US and India. That Starmer has managed to seal agreements with those two countries while still agreeing to align food standards with the EU is certainly a diplomatic coup. But it carries with it certain profound consequences. For one thing, it more or less rules out the prospects of Britain ever sealing a proper comprehensive trade deal with the US (as opposed to the rather limited agreements it has actually signed). It will push Britain over a regulatory Rubicon that was, up until now, seen as politically untenable. If you are one of those people who believe that, like it or not, Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption. What, after all, is a Swiss-style deal but a constellation of complex bilateral agreements with Europe that fall short of single market or customs union membership, while locking the parties into a sort of uncomfortable regulatory convergence? No one in government will ever describe it this way, of course. But while Monday's agreement doesn't amount to much in statistical terms, it nonetheless tips Britain down a path towards a Swiss-style arrangement - with all that goes with it. That certainly is a big deal."
    },
    {
        "title": "Energy bills set for series of falls as price cap due to be lowered, says forecaster",
        "description": "Energy bills are set to fall from this July and will continue to drop in the autumn and winter, a forecaster has said.",
        "url": "https://news.sky.com/story/energy-bills-set-for-series-of-falls-as-price-cap-due-to-be-lowered-says-forecaster-13370938",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-cost-of-living-energy-price-cap_6789796.png?20250102121246",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-19 11:09:00",
        "Headline": "Regulator Ofgem had hiked the energy price cap three times in a row as wholesale gas prices were high.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Energy bills are set to fall from this July and will continue to drop in the autumn and winter, a forecaster has said. Households will be charged £129 less for a typical annual bill from July as the energy price cap is due to fall, according to energy consultants Cornwall Insight. From July, an average dual fuel bill will be £1,720 a year, 7% below the current price cap of £1,849 a year. The price cap limits the cost per unit of energy and is revised every three months by the energy regulator Ofgem. The official announcement from Ofgem will be made on Friday. Money blog: How markets reacted to EU-UK deal Bills had already been made more expensive for three three-month periods, or quarters, in a row, in October, January, and April, as wholesale gas prices rose and European stores of the fossil fuel were depleted due to cold weather. \n                  'It was a storm... now it's a hurricane': Has the cost of living crisis been forgotten?\n                 \n                  'We will see closures': The industries hit hardest by national insurance hike\n                 \n                  Bills, bills, bills: How can you beat the hikes?\n                 Electricity prices are tied to gas prices. The UK is also heavily reliant on gas for home heating and uses a significant amount for electricity generation. Drops when the cap is next changed in October and January will be \"modest\", Cornwall Insight said. Price falls are not a certainty, however, as weather patterns, gas storage rules, the war in Ukraine, and tariffs could all change pricing.  Bills still high since Ukraine war Energy costs have remained elevated following Russia's full-scale invasion of Ukraine, and bills are still \"well above\" the levels seen at the start of the decade, said Cornwall Insight's principal consultant, Dr Craig Lowrey. \"Prices are falling, but not by enough for the numerous households struggling under the weight of a cost-of-living crisis. \"As such, there remains a risk that energy will remain unaffordable for many,\" he said. \"If prices can go down, they can bounce back up, especially with the unsettled global economic and political landscape we are experiencing. This is not the moment for complacency.\" Read more from Sky News:Reeves 'open-minded' on banks' push for ring-fencing reformRyanair raises fares after profits hit by lower ticket prices The government was called on by Mr Lowrey to explore options such as social tariffs, where vulnerable customers could pay less. Proposals, including zonal pricing, which would see different regions of the country pay different rates, based on local supply and demand levels, are important but must be balanced with the urgent affordability crisis people are facing now, he said. The continued growth of domestically produced renewable energy is \"a positive step forward\" and a cause for optimism as it helps protect against global energy price shocks and improves energy security, Mr Lowrey added. \"That progress needs to continue at pace, not just for the net zero transition, but to help build a more stable and secure energy future for all.\""
    },
    {
        "title": "UK-EU trade deal: What is in the Brexit reset agreement?",
        "description": "The UK and the EU have agreed a new trade deal - five years after Brexit kicked in.",
        "url": "https://news.sky.com/story/uk-eu-trade-deal-what-is-in-the-brexit-reset-agreement-13370912",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ursula-von-der-leyen_6921296.jpg?20250519105344",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-19 10:23:00",
        "Headline": "From eGates and pet passports to the removal of red tape on food sales and the protection of British steel, a new deal has been agreed.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The UK and the EU have agreed a new trade deal - five years after Brexit kicked in. Following six months of talks after Sir Keir Starmer promised a fresh deal when he became prime minister last July, the two sides have come to an agreement. Politics latest: Starmer says 'Britain is back' Here are the details: eGates British passport holders will be able to use more eGates in Europe to avoid the long border control queues that have become the norm since Brexit in many EU countries. Pet travel \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Pet passports will be brought back so cats and dogs coming from the UK will no longer need pricey animal health certificates for every trip. After Brexit, pet owners had to get a certificate from a vet in the UK then a vet in the EU before returning. Red tape on food and drink sales A new sanitary and phytosanitary (SPS) deal has been agreed to reduce red tape currently needed to import and export food and drink between the UK and the EU. There is no time limit to this part of the deal, which the government says will reduce the burden on businesses and reduce lorry queues at the border. The \"vast majority\" of routine checks and certificates for animal and plant products will be removed completely, including between Great Britain and Northern Ireland. The government says this could lower food prices and increase choice on supermarket shelves. Some British foods that have been prevented from being sold in the EU since Brexit will be allowed back in again, including burgers and sausages. Fishing rights The current fishing deal agreed in 2020 will continue for 12 years. There will be no increase in fish quotas. EU fishing vessels can fish in UK waters, but they require a valid licence, and there are annual negotiations on access and share of stock. The UK government has announced a £360m investment into the fishing industry to go towards new technology and equipment to modernise the fleet, train the workforce, help revitalise coastal communities, support tourism and boost seafood exports. Defence A new security and defence partnership has been agreed so the UK defence industry can participate in the EU's plan for a £150bn defence fund called Security Action for Europe (SAFE). This will support thousands of British jobs. The UK and EU will also enhance cooperation over maritime security and accident reporting.  Carbon tax The deal will see closer co-operation on emissions by the UK and the EU, linking their own emissions trading systems. The UK's scheme sets a cap on the total amount of greenhouse gas emissions allowed from the power generation sector, energy-intensive industries and aviation, with companies issued allowances that they can trade with each other. Under the deal, UK businesses will avoid being hit by the EU's carbon tax, due to come in next year, which would have handed £800m to the EU. Steel British steel exports will be protected from new EU rules and tariffs to save UK steel £25m a year.  Further talks: Youth mobility scheme The UK and the EU have agreed to more negotiations on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period. The scheme would include visas for young people working, studying, volunteering, travelling and working as au pairs. Erasmus The EU and the UK have agreed they should work towards an Erasmus programme, the student exchange programme which was scrapped when Brexit took place. Catching criminals The two sides have agreed to enter talks about the UK having access to EU facial image data to help catch dangerous criminals. They will also encourage Europol and the UK's National Crime Agency to cooperate over criminal threats and exchanging information about terrorism and other serious crimes. Migration The two sides have agreed to further work on finding solutions to tackle illegal migration, including on returns and a joint commitment to tackle Channel crossings. They will also begin talks on making it easier for people to get visas to work in the UK and the EU and recognising professional qualifications. Analysis sharing on visa abuse by third country nationals will also be considered. Electricity The UK and the EU said they should explore the UK's participation in the EU's internal electricity market, including in its trading platforms."
    },
    {
        "title": "Ryanair raises fares after profits hit by lower ticket prices",
        "description": "Europe's largest airline has seen annual earnings drop by 16% after cutting air fares - but revealed a price hike as it seeks to return to growth.",
        "url": "https://news.sky.com/story/ryanair-raises-fares-after-profits-hit-by-lower-ticket-prices-13370792",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ryanair-money-blog_6893485.jpg?20250422063025",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-05-19 05:50:00",
        "Headline": "Demand is strong for the summer, Ryanair chief executive Michael O'Leary says, with most of the price drop set to be reversed.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n  Europe's largest airline has seen annual earnings drop by 16% after cutting air fares - but revealed a price hike as it seeks to return to growth. Ryanair reported profits after tax fell to €1.61bn (£1.35bn) for the year to 31 March, down from €1.92bn (£1.61bn) in 2024, still the second highest on record. On average, plane tickets were 7% cheaper during this period than the 12 months before, it said. Money blog: Secrets of a cabbie  There had been a 21% rise in fares in the year up to March 2024, which bosses had signalled was due to end. Higher-for-longer interest rates and inflation in the first half of the year meant ticket prices had to come down, the budget carrier said. But fares are already back on the rise, Ryanair's chief executive Michael O'Leary said. The airline \"cautiously\" expects to recover \"most, but not all\" of the fare decline, which he said will boost profits. Demand for summer flights is \"strong\", Mr O'Leary said, with peak fares \"modestly\" ahead of last year. In recent months, that rebound has already been under way. Fares since April are on track to be \"a mid-high teen per cent ahead\" by the end of next month, compared with the same period last year. That trend is expected to continue to July, August and September, Mr O'Leary said. \"While we cautiously expect to recover most, but not all of last year's 7% fare decline, which should lead to reasonable net profit growth in 2025-26, it is far too early to provide any meaningful guidance,\" he said. \"The final 2025-26 outcome remains heavily exposed to adverse external developments, including the risk of tariff wars, macro-economic shocks, conflict escalation in Ukraine and the Middle East and European air traffic control mismanagement/short staffing.\" Read more from Sky News:UK and EU agree 'Brexit reset' trade deal Passenger numbers grew to a record 200 million on the back of cheaper fares, hitting a target that had been reduced due to delays in delivering new Boeing planes. The US manufacturer has struggled with increased regulatory oversight after a door panel blew off an Alaska Airlines plane mid-flight in January last year. Strike action by staff had added to the delays. The forecast for passenger numbers has been reduced again. Ryanair now aims to transport 206 million passengers in this financial year. It hopes to reach 300 million passengers by 2034 and on Monday said it still expects to receive 300 new Boeing planes by 2033."
    },
    {
        "title": "Reeves 'open-minded' on banks' push for ring-fencing reform",
        "description": "Rachel Reeves, the chancellor, has told bank bosses she is \"open-minded\" about reforming the industry's ring-fencing regime amid a concerted push to abolish the most significant regulatory burden introduced after the financial crisis.",
        "url": "https://news.sky.com/story/reeves-open-minded-on-banks-push-for-ring-fencing-reform-13370856",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-rachel-reeves-derby_6916959.jpg?20250515091443",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-19 08:26:00",
        "Headline": "The chancellor has signalled a willingness to overhaul the most significant regulatory measure imposed on Britain's biggest high street banks in the wake of the 2008 financial crisis, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Rachel Reeves, the chancellor, has told bank bosses she is \"open-minded\" about reforming the industry's ring-fencing regime amid a concerted push to abolish the most significant regulatory burden introduced after the financial crisis. Sky News has seen a letter sent last week by Ms Reeves to the chief executives of a quartet of Britain's biggest banks, in which she acknowledges their view that adjustments to ring-fencing - which creates a firewall between groups' investment banking and retail operations - \"have not gone far enough\". \"As I have said previously, I am open-minded about the case for further reform,\" the chancellor told the CEOs of HSBC Holdings, Lloyds Banking Group, NatWest Group and Santander UK. \"My officials are considering the issues you have raised and they will reach out to your teams to discuss further. \"Banking is at the heart of the UK's financial services sector and plays a vital role in supporting growth across the UK economy and will be crucial to the success of the government's industrial strategy. \"If we want the UK to grow, we need a thriving banking sector and creating the right environment for that is a top priority for me.\" While Ms Reeves's response to the bankers stops short of explicitly signalling a willingness to abolish ring-fencing, industry sources believe the Treasury now recognises that there is a clear case for an overhaul of a system which cost billions of pounds to set up. \n                  Global bank chiefs hold talks over Trump tariffs crisis\n                 \n                  Bank payday outages 'will absolutely happen again', tech expert says\n                 \n                  Nearly 100 Santander UK branches to close - with 750 jobs at risk\n                 Money blog: Secrets of a cabbie Of the five banks subject to ring-fencing, only Barclays has openly argued in favour of its retention, with its rivals all arguing that the regime creates capital inefficiencies which inhibit lending into the British economy. The chancellor's letter comes amid a push by her - along with the prime minister and business secretary - to amend the remits of economic regulators to give them explicit growth objectives. In recent months, the Payment Systems Regulator has been scrapped and folded into the City watchdog, while the chairman of the Competition and Markets Authority has been ousted amid concerns in Whitehall that it was not sufficiently focused on growth. Ms Reeves told the bank chiefs in her letter that the Treasury was prioritising \"new growth-focused remits for the regulators and a commitment to look at how post-crisis regulation can be rebalanced to ensure it is proportionate and managing rather than eliminating risk\". Her response will fuel expectations that the chancellor will use her speech at July's Mansion House dinner to outline prospective reforms to ring-fencing. Last week, analysts at Royal Bank of Canada said that scrapping ring-fencing would deliver a benefit to the affected banks of as much as £2.5bn, by reducing funding costs in their wholesale banking operations. NatWest, said RBC, would be the single biggest beneficiary of such a shake-up. The push for reform comes at precisely the same time as another financially and symbolically important legacy of Britain's banking crisis is set to disappear. The government's stake in NatWest is now below 1%, according to a filing last week, having stood at more than 80% after the bank's £45.5bn bailout. The sale of the remaining stake is likely as soon as next week based on the current trajectory of share sales. In their joint letter to Ms Reeves, which was revealed exclusively last month by Sky News, the quartet of bank chiefs told Ms Reeves that: \"With global economic headwinds, it is crucial that, in support of its Industrial Strategy, the government's Financial Services Growth and Competitiveness Strategy removes unnecessary constraints on the ability of UK banks to support businesses across the economy and sends the clearest possible signal to investors in the UK of your commitment to reform. \"While we welcomed the recent technical adjustments to the ring-fencing regime, we believe it is now imperative to go further. \"Removing the ring-fencing regime is, we believe, among the most significant steps the government could take to ensure the prudential framework maximises the banking sector's ability to support UK businesses and promote economic growth.\" Banks spent billions of pounds designing and setting up their ring-fenced entities, with separate boards of directors appointed to each division. More recently, the Treasury has moved to increase the deposit threshold from £25bn to £35bn, amid pressure from a number of faster-growing banks. Sam Woods, the current chief executive of the UK banking regulator, the Prudential Regulation Authority, was involved in formulating proposals published by the Sir John Vickers-led Independent Commission on Banking in 2011. Last week, Sky News revealed that the Treasury is drawing up plans to recruit a successor to Mr Woods when his second term ends next year. Legislation to establish ring-fencing was passed in the Financial Services Reform (Banking) Act 2013, and the regime came into effect in 2019. In addition to ring-fencing, banks were forced to substantially increase the amount and quality of capital they held as a risk buffer, while they were also instructed to create so-called 'living wills' in the event that they ran into financial trouble. Britain is the only major economy to have adopted such an approach to regulating its banking industry - a fact which the bank chiefs say is now undermining UK competitiveness. \"Ring-fencing imposes significant and often overlooked costs on businesses, including SMEs, by exposing them to banking constraints not experienced by their international competitors, making it harder for them to scale and compete,\" the letter said. The four bosses called on Ms Reeves to use this summer's Mansion House dinner - the City's annual set-piece event - to deliver \"a clear statement of intent...to abolish ring-fencing during this Parliament\". Doing so, they argued, would \"demonstrate the government's determination to do what it takes to promote growth and send the strongest possible signal to investors of your commitment to the City and to strengthen the UK's position as a leading international financial centre\". The Treasury has been contacted for comment on Ms Reeves's letter."
    },
    {
        "title": "UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'",
        "description": "The UK and EU have agreed a new post-Brexit reset trade deal after months of negotiations.",
        "url": "https://news.sky.com/story/uk-and-eu-agree-new-trade-deal-13370825",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-eu-flag-parliament_6810976.jpg?20250126093028",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-19 07:19:00",
        "Headline": "Talks are continuing on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The UK and EU have agreed a new post-Brexit reset trade deal after months of negotiations. Sir Keir Starmer declared \"Britain is back on the world stage\", while European Commission President Ursula von der Leyen said it was a \"historic moment\". The talks were the first since Boris Johnson agreed the initial Brexit deal in January 2020, when the UK left the EU. Politics latest: Details of UK-EU deal emerge Some of the main points include eGate access for British passport holders in Europe, no health certificates every time pets travel to Europe and the removal of red tape from most food and drink imports and exports. Negotiations went \"down to the wire\", with a breakthrough at about 10.30pm on Sunday ahead of a Monday 10am deadline, as UK fishing rights were, yet again, a major sticking point. Sky News understands the EU wanted permanent access to UK waters for fishing, but they have agreed a deal which extends the current rules on fishing for 12 years. There will be no change to the current access for UK fishing communities, with no reduction in British quotas or increase in the amount the EU is allowed to catch, which is set annually. Fishing rights were a major part of the Brexit \"leave\" campaign, although the industry only accounts for 0.4% of GDP. Read more: What is in the Brexit reset agreement? eGates and pet passports Under the new deal, British passport holders will be able to use eGates in Europe following years of lengthy passport control queues. The prime minister called on EU members \"to help make this a reality without delay\". Pet passports will also be brought back so cats, dogs and ferrets coming from the UK will no longer need expensive health certificates from vets in both the UK and Europe to travel with their owners to the EU. Most routine checks and the need for certificates for food and drinks have been removed, which the government said will reduce the burden on businesses and reduce lorry queues at the border. Sir Keir said British burgers and sausages will be allowed into the UK again. Read more:People do feel like strangers in Britain, poll findsBritain may have to resort to anti-subversion laws Defence partnership A new security and defence partnership was agreed so the UK defence industry can participate in the EU's plan for a £150bn defence fund called Security Action for Europe (SAFE). What will concern Brexiteers is a line in the official document saying the UK and the EU \"note the importance\" of judicial cooperation in civil and commercial law, including family matters. The Leave campaign had said one of the benefits of Brexit would be judicial independence from the EU. Talks are continuing on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period to work, study and travel. This would also include au pairs. The UK and the EU will also work towards reviving Erasmus, the student exchange programme that was scrapped when Brexit happened. These two points have been controversial as the government is on a drive to cut net migration. The two sides have agreed to further work on finding solutions to tackle illegal migration, including on returns and a joint commitment to tackle Channel crossings.  'Not been easy' Sir Keir promised in his 2024 election manifesto that he would sign a new trade and security deal with the EU, and has embarked on a charm offensive across Europe since winning power. Chancellor Rachel Reeves told a meeting of business leaders it had \"not been easy\" to reach a deal but said it would \"make it easier\" for UK businesses. EU relations minister Nick Thomas-Symonds said it was a \"historic day\". \"Good for jobs, good for bills, good for borders,\" he posted on X. \"And more... Britain back on the world stage, with a government in the service of working people.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Conservative leader Kemi Badenoch called the deal \"very concerning\" and said that 12 years EU access for fishing is three times longer than the government wanted. \"We're becoming a rule-taker from Brussels once again,\" she said. \"And with no details on any cap or time limits on youth mobility, fears of free movement returning will only increase.\" Reform UK leader and Brexiteer Nigel Farage described the deal as a \"surrender\" and said the 12-year fishing deal \"will be the end of the fishing industry\". Business Secretary Jonathan Reynolds told Sky News that details were still being worked out just three hours before the deadline. With just over an hour to go before the 10am deadline, the EU ambassadors' committee approved the deal ahead of a summit with EU leaders in London on Monday."
    },
    {
        "title": "Wagamama owner in talks to snap up Oakman Inns",
        "description": "The hospitality company which owns Wagamama is in talks to buy a chunk of Oakman Group, the pub and restaurant chain.",
        "url": "https://news.sky.com/story/wagamama-owner-in-talks-to-snap-up-oakman-inns-13371012",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/image_6081853.jpg?20230308105156",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-19 13:21:00",
        "Headline": "The Restaurant Group, which is owned by private equity behemoth Apollo, is closing in on a deal to acquire close to half of Oakman's estate, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The hospitality company which owns Wagamama is in talks to buy a chunk of Oakman Group, the pub and restaurant chain. Sky News has learnt that The Restaurant Group (TRG), which is backed by the private equity firm Apollo Global Management, is in advanced discussions to buy some of the privately held company's assets. Industry sources said that Oakman and its advisers were negotiating with other prospective bidders about a sale of its remaining assets. Oakman trades from more than 30 sites, and has been working with advisers from PricewaterhouseCoopers for several weeks on an auction. Money blog: How the markets reacted after new EU-UK deal struck One insider said TRG was likely to acquire between one-third and half of Oakman's sites if the deal was successfully completed. The buyer, which is run by former Boots and Coral chief Andy Hornby, would then integrate them into its Brunning & Price pub estate, the insider added. \n                  Daily Mail-owner Rothermere eyes minority Telegraph stake in RedBird deal\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  Money blog: Prices could fall 'significantly' due to UK-EU deal, supermarket says; roaming fees compared\n                 Further details of the potential transaction were unclear on Monday afternoon, although it is likely to be worth somewhere between £50m and £100m. The Oakman sale process comes amid intensifying pressure on the hospitality industry, with recent tax rises and jittery consumer confidence triggering fresh warnings of job losses and business collapses. Last week, Sky News revealed that RedCat, the pubs operator founded by former Greene King boss Rooney Anand, was in talks to swoop on his former employer to buy its pub-hotel operations. TRG and PwC declined to comment."
    },
    {
        "title": "EU still suffering 'wounds of Brexit', bloc's foreign affairs chief tells Sky News",
        "description": "Britain should have access to the EU's rearmament fund before the end of the year but \"wounds of Brexit\" mean some member states want it to be limited, the bloc's foreign affairs chief has said.",
        "url": "https://news.sky.com/story/eu-foreign-affairs-chief-says-bloc-still-suffering-wounds-of-brexit-13371127",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-kaja-kallas-eu-summit_6921285.jpg?20250519103548",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-19 17:28:00",
        "Headline": "Kaja Kallas told Sky News that some countries think the UK shouldn't have the same benefits as EU countries after it chose to leave the bloc. ",
        "Content": " Britain should have access to the EU's rearmament fund before the end of the year but \"wounds of Brexit\" mean some member states want it to be limited, the bloc's foreign affairs chief has said. Kaja Kallas told Sky News' political editor Beth Rigby that the \"technical details\" of Security Action for Europe (SAFE) still need to be sorted out. SAFE is a €150bn (£126bn) fund to provide loans to EU nations and other participants to bolster their defences. Politics Live: Starmer says EU deal 'win-win' As part of Sir Keir Starmer's new reset deal with the EU, a new defence partnership was struck that will allow the UK to access it. Asked when this might be, Ms Kallas said: \"The SAFE instrument has just been finalised between the institutions but it also needs approval from the European Council. And when that is done, we also move on with the implementation of that, and that is in the coming months.\"  Asked about reports that some member states think there should be a limit on what the UK can access, she said: \" Of course these discussions are there. We have the wounds from Brexit very clearly. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  Starmer's UK-EU deal: What does it mean for you?\n                 \"I mean you wanted to exit the European Union and then there are many voices who say that you shouldn't have the same benefits from the European instruments that the European Union countries have.\" According to The Times, France is pushing to freeze the UK out of 85% of the fund. Asked if Britain's access should be higher, Ms Kallas said her personal view is that given the current climate \"we should do both. We should invest more in European industry. But we should also cooperate with our outside partners like the UK\". She added that the EU hasn't had discussions in terms of percentage, because the fund is \"down to the capabilities\". \"That is, I think, more important than numbers,\" she said. Read more:Easing trade and signing a defence pact would be manifesto promises delivered - and PM could use a win The UK government has said accessing SAFE will support thousands of British jobs. Defence was one of the many areas that has been agreed as part of the new UK and the EU trade deal struck by Sir Keir Starmer - five years after Brexit kicked in. A key part of the deal involves giving European fishing boats a further 12 years of access to British waters. In return, there will be increased access to EU eGates for British passport holders in Europe, no health certificates every time pets travel to Europe and the removal of red tape from most UK food and drink imports and exports."
    },
    {
        "title": "UK-EU trade deal: What is in the Brexit reset agreement?",
        "description": "The UK and the EU have agreed a new trade deal - five years after Brexit kicked in.",
        "url": "https://news.sky.com/story/uk-eu-trade-deal-what-is-in-the-brexit-reset-agreement-13370912",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ursula-von-der-leyen_6921296.jpg?20250519105344",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-19 10:23:00",
        "Headline": "From eGates and pet passports to the removal of red tape on food sales and the protection of British steel, a new deal has been agreed.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The UK and the EU have agreed a new trade deal - five years after Brexit kicked in. Following six months of talks after Sir Keir Starmer promised a fresh deal when he became prime minister last July, the two sides have come to an agreement. Politics latest: Starmer says 'Britain is back' Here are the details: eGates British passport holders will be able to use more eGates in Europe to avoid the long border control queues that have become the norm since Brexit in many EU countries. Pet travel \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Pet passports will be brought back so cats and dogs coming from the UK will no longer need pricey animal health certificates for every trip. After Brexit, pet owners had to get a certificate from a vet in the UK then a vet in the EU before returning. Red tape on food and drink sales A new sanitary and phytosanitary (SPS) deal has been agreed to reduce red tape currently needed to import and export food and drink between the UK and the EU. There is no time limit to this part of the deal, which the government says will reduce the burden on businesses and reduce lorry queues at the border. The \"vast majority\" of routine checks and certificates for animal and plant products will be removed completely, including between Great Britain and Northern Ireland. The government says this could lower food prices and increase choice on supermarket shelves. Some British foods that have been prevented from being sold in the EU since Brexit will be allowed back in again, including burgers and sausages. Fishing rights The current fishing deal agreed in 2020 will continue for 12 years. There will be no increase in fish quotas. EU fishing vessels can fish in UK waters, but they require a valid licence, and there are annual negotiations on access and share of stock. The UK government has announced a £360m investment into the fishing industry to go towards new technology and equipment to modernise the fleet, train the workforce, help revitalise coastal communities, support tourism and boost seafood exports. Defence A new security and defence partnership has been agreed so the UK defence industry can participate in the EU's plan for a £150bn defence fund called Security Action for Europe (SAFE). This will support thousands of British jobs. The UK and EU will also enhance cooperation over maritime security and accident reporting.  Carbon tax The deal will see closer co-operation on emissions by the UK and the EU, linking their own emissions trading systems. The UK's scheme sets a cap on the total amount of greenhouse gas emissions allowed from the power generation sector, energy-intensive industries and aviation, with companies issued allowances that they can trade with each other. Under the deal, UK businesses will avoid being hit by the EU's carbon tax, due to come in next year, which would have handed £800m to the EU. Steel British steel exports will be protected from new EU rules and tariffs to save UK steel £25m a year.  Further talks: Youth mobility scheme The UK and the EU have agreed to more negotiations on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period. The scheme would include visas for young people working, studying, volunteering, travelling and working as au pairs. Erasmus The EU and the UK have agreed they should work towards an Erasmus programme, the student exchange programme which was scrapped when Brexit took place. Catching criminals The two sides have agreed to enter talks about the UK having access to EU facial image data to help catch dangerous criminals. They will also encourage Europol and the UK's National Crime Agency to cooperate over criminal threats and exchanging information about terrorism and other serious crimes. Migration The two sides have agreed to further work on finding solutions to tackle illegal migration, including on returns and a joint commitment to tackle Channel crossings. They will also begin talks on making it easier for people to get visas to work in the UK and the EU and recognising professional qualifications. Analysis sharing on visa abuse by third country nationals will also be considered. Electricity The UK and the EU said they should explore the UK's participation in the EU's internal electricity market, including in its trading platforms."
    },
    {
        "title": "UK-EU deal tips Britain down path towards Swiss-style arrangement",
        "description": "There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed.",
        "url": "https://news.sky.com/story/uk-eu-deal-tips-britain-down-path-towards-swiss-style-arrangement-13371123",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-starmer-von-der-leyen_6921796.png?20250519203748",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-05-19 17:24:00",
        "Headline": "If you're someone who believe Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There's a trick to announcing trade agreements like the one unveiled by the prime minister on Monday: pluck out a big-sounding number and release it to the public with zero context in an effort to make this sound very impressive indeed. That's what Donald Trump did last week when he was in Saudi Arabia and it's what Sir Keir Starmer did on Monday, promising the agreement with the EU should generate a whopping £9bn in gross domestic product (GDP) for the UK. Naturally, when you squint a little closer, that figure gets considerably less impressive than it first seems. After all, by 2040 - the year the government was referring to - £9bn will equate to roughly 0.2 percent of GDP, only a tiny fraction of the negative impact most economists have estimated Brexit will have on the economy (the OBR puts it at -4 percent). Whether those negative estimates are any more reliable than the one the prime minister came up with on Monday is a debate for another day, but anyway, this is one of those cases where the numbers are perhaps somewhat less meaningful than the politics. For one thing, even that seemingly small 0.2 percent of GDP is actually bigger than the calculated impact of the India trade deal unveiled earlier this month (and almost certainly bigger than any other trade deal signed since Brexit). That's because a small percentage of a big number is still a relatively big number, and Britain trades more with its neighbours than any other country in the world. \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'\n                 \n                  Easing trade and signing a defence pact would be manifesto promises delivered - and Starmer could use a win\n                 Read more from Sky News:What's in UK-EU Brexit reset trade deal?King writes to Biden after ex-president reveals cancer diagnosis Anyway, more consequential than any numbers is the fact that this government has committed to something its predecessors refused to countenance: aligning certain regulations (most notably food standards) with the European Union.  Previous Conservative governments all shied away from doing so - for fear, they said, of undermining their ability to seek free trade deals with other countries that would insist on greater access to their food markets. Countries like the US and India. That Starmer has managed to seal agreements with those two countries while still agreeing to align food standards with the EU is certainly a diplomatic coup. But it carries with it certain profound consequences. For one thing, it more or less rules out the prospects of Britain ever sealing a proper comprehensive trade deal with the US (as opposed to the rather limited agreements it has actually signed). It will push Britain over a regulatory Rubicon that was, up until now, seen as politically untenable. If you are one of those people who believe that, like it or not, Britain is fated to edge gradually closer to Europe, ending up decades hence with what one might describe as a \"Swiss-style deal\" with Europe, then Monday's events will have given you no reason to challenge your assumption. What, after all, is a Swiss-style deal but a constellation of complex bilateral agreements with Europe that fall short of single market or customs union membership, while locking the parties into a sort of uncomfortable regulatory convergence? No one in government will ever describe it this way, of course. But while Monday's agreement doesn't amount to much in statistical terms, it nonetheless tips Britain down a path towards a Swiss-style arrangement - with all that goes with it. That certainly is a big deal."
    },
    {
        "title": "Starmer's UK-EU deal: What does it mean for you?",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>   ",
        "url": "https://news.sky.com/story/starmers-uk-eu-deal-what-does-it-mean-for-you-13370951",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/2372505190464574407_6921264.png?20250519094344",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-19 10:39:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  Sir Keir Starmer has signed a landmark post-Brexit deal with the European Union.  The agreement has been lauded by the prime minister as \"a new era in our relationship... moving on from stale old debates\" and \"following through on what the British public voted for last year\". His opponents are far from pleased, however, with both Reform and the Conservatives arguing that this sees the UK move back towards the EU and against the will of the people as voted for in 2016. Reform leader Nigel Farage has labelled the deal 'a surrender' to the EU by Sir Keir. But what is actually in the deal? What does it mean, and who stands to benefit the most from it? Niall Paterson and Sky News political correspondent Tamara Cohen unpack the seismic deal announced in London. The pair look at the benefits for the UK in the deal. They also analyse how damaging some of the prime minister's concessions could be for the Labour Party, and how Reform could capitalise on this. Producers: Gabriel Radus, Soila ApparicioEditor: Philly Beaumont"
    },
    {
        "title": "Brexit reset deal: A TBC agreement with a lot still to be worked out with EU",
        "description": "Sir Keir Starmer used the opulent surroundings of London's Lancaster House to declare with certainty that this is a \"landmark deal\" that will grow the British economy and put money in people's pockets.",
        "url": "https://news.sky.com/story/brexit-reset-deal-a-tbc-agreement-with-a-lot-still-to-be-worked-out-with-eu-13371202",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-keir-starmer-european-commission_6921865.jpg?20250519220453",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-05-19 19:48:00",
        "Headline": "It may not be the end of the Brexit wrangling - as Sir Keir Starmer hopes - but the start of a new phase in which costs, caps and quotas are discussed regularly, and seized on by his political opponents.",
        "Content": "\n          Political correspondent\n              @tamcohen\n Sir Keir Starmer used the opulent surroundings of London's Lancaster House to declare with certainty that this is a \"landmark deal\" that will grow the British economy and put money in people's pockets. It is evidence, the prime minister said, of Britain back on the world stage. European Commission president Ursula von der Leyen and European Council president Antonio Costa addressed him as \"dear Keir\". Times have changed. Politics latest: Minister claims UK-EU deal could add £90bn to British economy Symbolically - nearly a decade after Brexit and all the battles and feuds which followed - it is a big moment to see a prime minister warming up relations with the EU. But when you read the nine-page Cooperation Agreement, it is very clear this is just the starter, not the full meal; the opening scene rather than the final curtain. In other words, most of what the government says are negotiated wins are in fact TBC. The deal covers agri-food; fishing, defence, energy and passport checks. The government claims it will add nearly £9bn (around 0.3% of GDP) to the British economy by 2040. A security and defence partnership has been struck; trumpeted as a way UK defence firms can access the EU's £150bn procurement fund. The text only says the UK and EU \"should swiftly explore the possibilities\", of doing so. Starmer said it would \"open the door\" for UK firms to benefit, but the UK is not inside the door yet. \n                  EU still suffering 'wounds of Brexit', bloc's foreign affairs chief tells Sky News\n                 \n                  UK-EU trade deal: What is in the Brexit reset agreement?\n                 \n                  UK-EU deal tips Britain down path towards Swiss-style arrangement\n                 On trade, the UK government sees the big wins economically - but there are costs and trade-offs. The food deal - or to give it its full name the sanitary and phytosanitary (SPS) agreement - would eliminate some of the barriers to trade erected during Brexit. Paperwork has undoubtedly held up exports, and some products, such as sausages, other cold meats and shellfish, cannot be sold to the EU. The idea is this red tape would be swept away - which has been welcomed by retailers, supermarkets and food processors, who say it will cut prices at the tills. But this comes with conditions - admin costs; and the need to align with EU rules and standards now and into the future. Read more:UK-EU deal tips Britain down path towards Swiss-style arrangement  Those rules are set by member states, not the UK, and overseen by the European Court of Justice. All of the red lines of the past. Brexiteers are calling it a \"betrayal\" and the UK going back to being a \"rule taker\". The specifics would need legislation to go through parliament, so more votes loom. The biggest trade-off is on fishing, a key sticking point in the negotiations from countries such as France. This deal enables EU member states to fish in our water for another 12 years beyond the current deal - until 2038. The government points out that the food deal is indefinite, and the fishing rights have a time limit. But what was agreed was three times longer, it is claimed, than the four years the government had hoped for. Nigel Farage said it would \"destroy the fishing industry\". All deals involve trade-offs but what has it bought in return?  The suggestion that holidaymakers could avoid \"huge queues\" at airports through an agreement for British travellers to use e-Gates at European airports. The agreement states that there will be \"no legal barriers to eGate use for British nationals travelling to and from member states\" - but nothing firmer. It's up to member states to implement. A youth mobility scheme - which the government has now branded a \"youth experience scheme\", will happen, despite months of ministers denying one was on the cards. The terms must be mutually agreed, and the final numbers, how the cap will apply and the time limits are yet to be worked out. Starmer is gambling that - based on polling showing most Brexit voters feel the original deal negotiated by Boris Johnson has failed - voters will accept the trade-offs. He said it was time to move away from the \"stale\" arguments of the past and move on. It's notable that while Conservative leader Kemi Badenoch has slammed Starmer's deal as a \"sell out\", she concedes it needs to be looked at again. 👉 Listen to Sky News Daily on your podcast app 👈 Given the threat from Reform, the prime minister has been careful to steer very clear of free movement and any concession on student fees. But those questions will come back as the details are hammered out. Whether on food prices or airports, the negotiations could continue for weeks, months or years. There may be many more EU summits for this and subsequent governments. It may not be the end of the Brexit wrangling - as the prime minister hopes - but the start of a new phase in which costs, caps and quotas are discussed regularly, and seized on by his political opponents. The gains are some way off, given that the Office for Budget Responsibility estimated the hit of Brexit to the economy (4%) to be far larger. This is a significant move closer to the EU at a time when the Ukraine war and Donald Trump's diplomacy are shaking up the old order. But for a big concession, whether this can be sold to voters as a good deal is a question for further down the line."
    },
    {
        "title": "Does the great EU reset work?",
        "description": " <a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>    ",
        "url": "https://news.sky.com/story/will-the-great-eu-reset-work-13370782",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-19 04:54:00",
        "Headline": "No subtitle found",
        "Content": " 👉Listen to Politics at Sam and Anne's on your podcast app👈  Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics.  It's EU summit day - so what will Keir Starmer agree? It's been described as an historic summit and will be a reset of relations since Brexit. It's expected that the EU and the UK will sign a security and defence partnership. But so far nothing is set in stone. Plus, how sincere is Vladimir Putin's interest in a ceasefire?"
    },
    {
        "title": "Sir Keir Starmer refuses to say whether 'genocide' is taking place in Gaza following UN warning",
        "description": "Sir Keir Starmer has refused to say whether Israel is committing genocide in Gaza following warnings from a top UN official.",
        "url": "https://news.sky.com/story/sir-keir-starmer-refuses-to-say-whether-genocide-is-taking-place-in-gaza-following-un-warning-13370978",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-khan-younis-gaza_6921514.jpg?20250519145414",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-05-19 12:29:00",
        "Headline": "The prime minister says the current situation in Gaza - where Israel has agreed to allow in a limited supply of aid - is \"unacceptable\" and \"intolerable\".",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Sir Keir Starmer has refused to say whether Israel is committing genocide in Gaza following warnings from a top UN official. Tom Fletcher, head of the UN Office for the Coordination of Humanitarian Affairs, warned the body's security council last week that it must \"act now\" to \"prevent genocide\" - a claim that Israel has vehemently denied. He also accused Israel of \"deliberately and unashamedly\" imposing inhumane conditions on Palestinians by blocking aid from entering Gaza more than 10 weeks ago. Politics latest: Starmer says EU deal a 'win-win'  On Monday, following pressure from some of its allies, Israel agreed to allow limited deliveries to resume. The decision means 20 aid trucks carrying mostly food will enter Gaza following a three-month blockade that prompted multiple warnings of starvation and famine in the Palestinian territory. Under the Genocide Convention, genocide refers to acts committed with the \"intent to destroy, in whole or in part, a national, ethnical, racial or religious group\". \n                  First aid trucks enter Gaza since early March - as UN says it is a 'drop in the ocean'\n                 \n                  Gaza at mercy of what comes next as Israel ramps up brutal offensive\n                 \n                  British surgeon working in Gaza says it is now 'a slaughterhouse' amid Israeli bombardment\n                 It can include killing members of the group, causing serious bodily or mental harm, and inflicting conditions that bring about its physical destruction. Israel has repeatedly denied accusations of genocide, with Prime Minister Benjamin Netanyahu branding a recent UN report on the issue biased and antisemitic. \"Instead of focusing on the crimes against humanity and war crimes committed by the Hamas terrorist organisation... the United Nations once again chooses to attack the state of Israel with false accusations,\" he said in a statement. Asked by Sky News' political editor Beth Rigby whether he believed a genocide was taking place in Gaza, Sir Keir Starmer did not directly answer. Instead the prime minister said there was a \"really serious, unacceptable, intolerable situation\" unfolding in the territory.  Sir Keir's words were echoed by European Commission President Ursula von der Leyen, who was speaking alongside the PM at a news conference in London to mark the new UK-EU trade deal. She also said the humanitarian situation in Gaza was \"unacceptable\" as she urged for the blockade on Gaza to be \"lifted now\". In a video statement posted to social media on Monday, Mr Netanyahu said he was allowing limited aid into Gaza because Israel's \"greatest friends in the world\" - whom he did not specify - had threatened to withdraw support for his country. He said a \"starvation crisis\" would jeopardise Israel's new offensive against Hamas in Gaza, and a \"basic\" amount of food would be allowed in. At the same time, Israel has ramped up its offensive in Gaza after Mr Netanyahu announced plans to seize all of the territory and hold it indefinitely. Read more:How Israel has escalated Gaza bombing campaignGaza at mercy of what comes next as Israel ramps up brutal offensive Israeli officials have said the plan - which would move Gaza's civilian population southward - will help it achieve its aim of defeating Hamas after the group's attack on 7 October 2023 which saw 1,200 people killed and about 250 taken hostage. Israel also believes the offensive will prevent Hamas from looting and distributing humanitarian aid, which it says strengthens the group's rule in Gaza. The UN has rejected the plan - which it said would mean aid is distributed in hubs - saying it was \"in contravention of globally-established humanitarian principles\" and raised the chance of aid \"not getting through to the most vulnerable people\". On Monday, the Israeli military issued an evacuation order for residents of Gaza's second-largest city, Khan Younis, and nearby towns, warning that the entire area \"will be considered a dangerous combat zone\". Gaza's health ministry says more than 53,000 people have died in Israel's 19-month campaign, although it does not distinguish between civilians and militants. It reported 464 people had died in Israeli military strikes in the week to Sunday."
    },
    {
        "title": "Iranian ambassador summoned to Foreign Office after three men charged under National Security Act",
        "description": "The UK government has summoned Iran's ambassador in response to three Iranian nationals being charged under the National Security Act.",
        "url": "https://news.sky.com/story/iranian-ambassador-summoned-to-foreign-office-after-three-men-charged-under-national-security-act-13370987",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-foreign-office-fcdo_6827718.png?20250213145408",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-19 12:42:00",
        "Headline": "The UK government said \"Iran must be held accountable for its actions\" after three Iranian nationals were charged with spying offences.",
        "Content": "The UK government has summoned Iran's ambassador in response to three Iranian nationals being charged under the National Security Act. The three men were charged with spying offences at Westminster Magistrates' Court over the weekend. Mostafa Sepahvand, 39, Farhad Javadi Manesh, 44, and Shapoor Qalehali Khani Noori, 55, are alleged to have targeted journalists working for Iran International, an independent media organisation based in London. Iran's ambassador to the UK, Seyed Ali Mousavi, has now been summoned to the Foreign Office, the government said on Monday. \"The UK government is clear that protecting national security remains our top priority and Iran must be held accountable for its actions,\" a statement read. \"The summons follows this weekend's announcement which stated that three Iranian nationals had been charged with engaging in conduct likely to assist a foreign intelligence service.\" Iranian news agency, ISNA, reported on Sunday that Iran had summoned the UK ambassador in Tehran in protest over what it called the \"unlawful baseless arrest of Iranian nationals\". Sepahvand, Manesh and Noori are accused of \"engaging in conduct likely to assist a foreign intelligence service\" between August 2024 and February 2025, following an investigation by counter-terror police. They are alleged to have arrived in the UK by \"irregular means\", including small boats and a lorry, before claiming asylum. Sepahvand is also charged with engaging in surveillance, reconnaissance and open-source research, intending to commit acts, namely serious violence against a person in the UK. Manesh and Noori are further charged with engaging in surveillance and reconnaissance, with the intention that acts, namely serious violence against a person in the UK, would be committed by others. 'Extremely serious' Commander Dominic Murphy, from the Metropolitan Police's Counter Terrorism Command, described the charges as \"extremely serious\". \"Since the men were arrested two weeks ago, detectives have been working around the clock and we have worked closely with colleagues in the Crown Prosecution Service to reach this point,\" he said on the weekend. \"Now that these men have been charged, I would urge people not to speculate about this case, so that the criminal justice process can run its course.\" Read more from Sky News:What is in the Brexit reset agreement?Gary Lineker departs from BBCMessages of support pour in for Joe Biden The trio were arrested on 3 May, the same day five other Iranian nationals were also arrested, in a separate, unrelated probe into an alleged plot reportedly targeting the Israeli embassy. Four of those five were released from custody on Saturday, while the fifth was released on bail with conditions. Sepahvand, Manesh and Noori are due to appear at the Old Bailey on 6 June."
    },
    {
        "title": "UK and EU agree Brexit reset trade deal as Sir Keir Starmer declares 'Britain is back'",
        "description": "The UK and EU have agreed a new post-Brexit reset trade deal after months of negotiations.",
        "url": "https://news.sky.com/story/uk-and-eu-agree-new-trade-deal-13370825",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-eu-flag-parliament_6810976.jpg?20250126093028",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-05-19 07:19:00",
        "Headline": "Talks are continuing on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period.",
        "Content": "\n          Political reporter\n              @alixculbertson\n  The UK and EU have agreed a new post-Brexit reset trade deal after months of negotiations. Sir Keir Starmer declared \"Britain is back on the world stage\", while European Commission President Ursula von der Leyen said it was a \"historic moment\". The talks were the first since Boris Johnson agreed the initial Brexit deal in January 2020, when the UK left the EU. Politics latest: Details of UK-EU deal emerge Some of the main points include eGate access for British passport holders in Europe, no health certificates every time pets travel to Europe and the removal of red tape from most food and drink imports and exports. Negotiations went \"down to the wire\", with a breakthrough at about 10.30pm on Sunday ahead of a Monday 10am deadline, as UK fishing rights were, yet again, a major sticking point. Sky News understands the EU wanted permanent access to UK waters for fishing, but they have agreed a deal which extends the current rules on fishing for 12 years. There will be no change to the current access for UK fishing communities, with no reduction in British quotas or increase in the amount the EU is allowed to catch, which is set annually. Fishing rights were a major part of the Brexit \"leave\" campaign, although the industry only accounts for 0.4% of GDP. Read more: What is in the Brexit reset agreement? eGates and pet passports Under the new deal, British passport holders will be able to use eGates in Europe following years of lengthy passport control queues. The prime minister called on EU members \"to help make this a reality without delay\". Pet passports will also be brought back so cats, dogs and ferrets coming from the UK will no longer need expensive health certificates from vets in both the UK and Europe to travel with their owners to the EU. Most routine checks and the need for certificates for food and drinks have been removed, which the government said will reduce the burden on businesses and reduce lorry queues at the border. Sir Keir said British burgers and sausages will be allowed into the UK again. Read more:People do feel like strangers in Britain, poll findsBritain may have to resort to anti-subversion laws Defence partnership A new security and defence partnership was agreed so the UK defence industry can participate in the EU's plan for a £150bn defence fund called Security Action for Europe (SAFE). What will concern Brexiteers is a line in the official document saying the UK and the EU \"note the importance\" of judicial cooperation in civil and commercial law, including family matters. The Leave campaign had said one of the benefits of Brexit would be judicial independence from the EU. Talks are continuing on a youth mobility scheme to allow people aged 18-30 in the UK and the EU to move freely between countries for a limited period to work, study and travel. This would also include au pairs. The UK and the EU will also work towards reviving Erasmus, the student exchange programme that was scrapped when Brexit happened. These two points have been controversial as the government is on a drive to cut net migration. The two sides have agreed to further work on finding solutions to tackle illegal migration, including on returns and a joint commitment to tackle Channel crossings.  'Not been easy' Sir Keir promised in his 2024 election manifesto that he would sign a new trade and security deal with the EU, and has embarked on a charm offensive across Europe since winning power. Chancellor Rachel Reeves told a meeting of business leaders it had \"not been easy\" to reach a deal but said it would \"make it easier\" for UK businesses. EU relations minister Nick Thomas-Symonds said it was a \"historic day\". \"Good for jobs, good for bills, good for borders,\" he posted on X. \"And more... Britain back on the world stage, with a government in the service of working people.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Conservative leader Kemi Badenoch called the deal \"very concerning\" and said that 12 years EU access for fishing is three times longer than the government wanted. \"We're becoming a rule-taker from Brussels once again,\" she said. \"And with no details on any cap or time limits on youth mobility, fears of free movement returning will only increase.\" Reform UK leader and Brexiteer Nigel Farage described the deal as a \"surrender\" and said the 12-year fishing deal \"will be the end of the fishing industry\". Business Secretary Jonathan Reynolds told Sky News that details were still being worked out just three hours before the deadline. With just over an hour to go before the 10am deadline, the EU ambassadors' committee approved the deal ahead of a summit with EU leaders in London on Monday."
    },
    {
        "title": "Risto Bergman: Telecoms worker who created AI-generated images of child sex abuse is sentenced",
        "description": "A telecoms worker who created AI-generated images of child sex abuse has been sentenced.",
        "url": "https://news.sky.com/story/risto-bergman-telecoms-worker-who-created-ai-generated-images-of-child-sex-abuse-is-sentenced-13371043",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-man-computer-screen_6921660.jpg?20250519183036",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-19 15:04:00",
        "Headline": "The 42-year-old, who is originally from Finland, used a legitimate artificial intelligence app to make indecent images of young girls being abused.",
        "Content": "A telecoms worker who created AI-generated images of child sex abuse has been sentenced. Risto Bergman, 42, who is originally from Finland, used a legitimate artificial intelligence app to make indecent images of young girls being abused. Scotland's Crown Office and Procurator Fiscal Service (COPFS) said the images were \"so realistic\" that they could be taken for authentic photographs. Bergman was said to have used sexually descriptive search terms while using the app. COPFS said AI then generated the \"distressing images\" by drawing upon a \"digital library\" of hundreds of pictures of real child abuse which had been previously shared online by paedophiles. Images discovered on a computer storage unit found in Bergman's Paisley flat included some described as category A - depicting the most extreme type of child sex abuse. Bergman, who has since moved from Renfrewshire to Argyll and Bute, last month pleaded guilty to making indecent photographs or pseudo-photographs of children. \n                  AIs can make collective decisions and influence each other, says new study\n                 \n                  AI tool used to test feelings about Botox will be rolled out by government\n                 \n                  Could AI translate animal sounds into words? Tech experts hope so\n                 He returned to Paisley Sheriff Court on Monday, where he was handed an 18-month Community Payback Order (CPO). His name was also added to the sex offenders' register. Read more from Sky News:AIs 'can make collective decisions and influence each other'How I got caught up in AI-powered scam David Bernard, procurator fiscal for north Strathclyde, said Bergman had created illegal material that both exploited children and perpetuated abuse. He said: \"This is by no means a victimless crime. Bergman's depraved actions effectively encouraged those who abuse children to continue their activities. \"Artificial intelligence apps draw upon online images of real children being subjected to sexual abuse. Behind every AI-generated 'pseudo-photograph' of abuse are real-life child victims. \"Bergman made himself a participant in that process.\""
    },
    {
        "title": "'Significant' personal data exposed in cyber attack on Legal Aid Agency",
        "description": "A \"significant amount of personal data\" of people who applied to the Legal Aid Agency - including criminal records - was accessed and downloaded by hackers, the Ministry of Justice (MoJ) has said.",
        "url": "https://news.sky.com/story/cyber-attack-on-legal-aid-agency-exposed-significant-data-including-criminal-records-13370828",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-ministry-of-justice_6921272.jpg?20250519095711",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-05-19 07:24:00",
        "Headline": "The group that carried out the cyber attack says it accessed 2.1 million pieces of data, but this figure has yet to be verified by the Ministry of Justice. ",
        "Content": "A \"significant amount of personal data\" of people who applied to the Legal Aid Agency - including criminal records - was accessed and downloaded by hackers, the Ministry of Justice (MoJ) has said. The group that carried out the cyber attack says it accessed 2.1 million pieces of data, but the MoJ has not verified that figure, it is understood. The government became aware of the incident on 23 April, but realised on Friday it was more extensive than first thought. An MoJ source put the breach down to the \"neglect and mismanagement\" of the previous government, saying vulnerabilities in the Legal Aid Agency systems have been known for many years. The Legal Aid Agency (LAA), is an executive agency, sponsored by the MoJ, which is responsible for administering legal aid funding - around £2.3bn in 2023/24. The data accessed affected those who applied for legal aid in the last 15 years, and may include contact details and addresses of legal aid applicants, their dates of birth, national insurance numbers, criminal history, employment status and financial data such as contribution amounts, debts and payments. The MoJ has urged anyone who applied for legal aid since 2010 to update any passwords that could have been exposed, and be alert to unknown messages and phone calls. \n                  Cryptocurrency platform Coinbase warns of up to $400m hit from cyber attack \n                 \n                  Thousands of UK companies 'could have M&S-style hackers waiting in their systems'\n                 \n                  Co-op updates on recovery after cyber attack forced empty shelves\n                 The organisation's digital services, which are used by legal aid providers to log their work and get paid, have been taken offline. 'We needed to take radical action' Legal Aid Agency chief executive Jane Harbottle has apologised for the breach and acknowledged the news would be \"shocking and upsetting\". \"Since the discovery of the attack, my team has been working around the clock with the National Cyber Security Centre to bolster the security of our systems so we can safely continue the vital work of the agency,\" she said. \"However, it has become clear that, to safeguard the service and its users, we needed to take radical action. That is why we've taken the decision to take the online service down,\" she said. Ms Harbottle said contingency plans are in place for those who need legal support and advice.  The Law Society, an organisation representing solicitors across the UK, blamed the attack on Legal Aid's \"antiquated IT system\". \"The incident once again demonstrates the need for sustained investment to bring the LAA's antiquated IT system up to date and ensure the public have continued trust in the justice system,\" said a Law Society spokesperson. The Ministry of Justice (MoJ) said it is working with the National Crime Agency and National Cyber Security Centre to investigate the data breach. The National Crime Agency said it was aware of the incident and was working closely with the MoJ to \"better understand the incident and support the department\". It comes after retailers Co-op, Harrods and Marks & Spencer were hit by cyber attacks, although there is no suggestion that they are connected to the incident at the LAA."
    },
    {
        "title": "Pop star says Combs threatened to kill her if she spoke about violence as Cassie's ex-best friend gives evidence",
        "description": "A former pop star has told a court Sean \"Diddy\" Combs was \"frequently\" violent with his ex-partner Cassie Ventura, and that he threatened her life if she spoke out about it.",
        "url": "https://news.sky.com/story/pop-star-says-combs-threatened-to-kill-her-if-she-spoke-about-violence-as-cassies-ex-best-friend-gives-evidence-13371265",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-dawn-richard-sean-combs_6921929.jpg?20250519232909",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-05-19 22:12:00",
        "Headline": "During the sixth day of the Sean \"Diddy\" Combs sex-trafficking trial, the court heard of multiple alleged attacks on Cassie Ventura, drugs \"in a Louis Vuitton pouch\" and the names of multiple celebrities were dropped during evidence.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n A former pop star has told a court Sean \"Diddy\" Combs was \"frequently\" violent with his ex-partner Cassie Ventura, and that he threatened her life if she spoke out about it. Dawn Richard told the jury in Manhattan federal court that Combs made the threat after she allegedly witnessed him trying to hit Cassie with an egg skillet. She said the Bad Boy Records founder told her and another woman who saw the alleged attack that \"we could go missing\" if they revealed details of what they saw. Richard, who was a former member of girl group Danity Kane and electric soul trio Dirty Money, said Combs would \"punch [Cassie], choke her, slap her in the mouth, kick her, and punch her in the stomach\". She said of the beatings: \"When [Cassie] had these moments of trying to stick up for herself, [Combs] would hurt her for it.\" Richard also said one alleged incident took place in a West Hollywood restaurant with celebrities including Usher, Big Daddy Kane, Jimmy Iovine and Ne-yo also present. Combs, 55, faces five criminal counts: one count of racketeering conspiracy; two counts of sex trafficking by force, fraud or coercion; and two counts of transportation to engage in prostitution. He denies the allegations against him. \n                  New York helicopter crash tour company to close immediately, says FAA\n                 \n                  Private plane crash in New York kills ex-college football star Karenna Groff and family\n                 \n                  Brother pays tribute to relatives killed in Hudson River helicopter crash - as cause remains unclear\n                 Beginning her evidence on Friday, Richard told the jury Combs would store his drugs in a Louis Vuitton pouch and said she often\" saw him use \"Ketamine, cocaine, molly [also known as Ecstasy]\". Sean 'Diddy' Combs trial: Day 6 - As it happened During cross-examination it was suggested her story had changed over time, but Richard said she was doing her best to recall \"traumatic\" events from more than a decade ago. She admitted she had contacted Diddy after parting ways with his management and agreed that, despite being \"scared\" of him, she asked to come back to work for him. Defence lawyer Nicole Westmoreland suggested Richard was testifying because she was angry that Combs had ended Danity Kane and Diddy - Dirty Money. Ms Westmoreland asked: \"You felt that Mr Combs ruined your career not once but twice?\" \"Yes,\" Richard replied. Following Richard's stint in the stand, Cassie's ex-best friend Kerry Morgan gave evidence. Morgan and Cassie had been friends for more than 17 years after meeting as young models. 'I was dizzy, I vomited' Morgan, who said Combs was prone to \"mood swings\" and could be \"very aggressive\", described two occasions she allegedly saw Combs beat Cassie. She told the court about hearing Cassie's \"guttural, terrifying\" screams before allegedly seeing Combs dragging her by her hair from the master bedroom. Morgan also described when Combs \"choked her\" leaving \"finger marks\" on her throat, and threw a wooden hanger at her head, leaving her with concussion. She said: \"I was dizzy, I vomited a few times. I went to an urgent care facility. I hired a lawyer about the assault. I was planning on filing a lawsuit, but I did not.\" She told the court she received a $30,000 settlement from Combs over the alleged assault, organised by Cassie. Morgan said she and Cassie ceased to be friends after the incident, explaining: \"The reason I stopped speaking to her was because she was not supportive of me after that incident. I draw my line at physical abuse.\" Morgan said Cassie told her she could not leave Combs because she was reliant on him for \"her job, her car, her apartment\". Combs 'jealous' of Michael B Jordan During Cassie's cross-examination by the defence, the court was told that Cassie was jealous of Combs's ex, Kim Porter, while Combs was jealous of actor Michael B Jordan, whom Cassie had a brief relationship with in 2015. While Morgan said she couldn't confirm whether Cassie was in a relationship with the Creed star, she confirmed: \"What I remember was that she was speaking to Michael B Jordan and they hung out together and [Combs] was jealous of it.\" Morgan confirmed she had not wanted to appear in court, having \"moved on\" with her life, and had been subpoenaed to give testimony. Last on the stand was Combs's former personal assistant, David James, who described working 20-hour days for Combs at Bad Boy Records, for six or seven days, for up to three weeks at a time. James, who had also been subpoenaed, said Cassie told him she couldn't leave Combs's \"crazy\" world because \"he controls my career, pays my allowance, and pays my rent\". Combs, previously known as Puff Daddy and P Diddy, founded Bad Boy Records, and is credited with helping turn artists including Mary J Blige, Faith Evans, Notorious B.I.G. and Usher into household names in the 1990s and 2000s. Combs has been jailed since September and faces at least 15 years or possibly life in prison if convicted."
    },
    {
        "title": "'I recognise the error and upset caused' - Gary Lineker releases statement as BBC departure confirmed",
        "description": "Gary Lineker has confirmed he is leaving the BBC after this season's Match Of The Day and will no longer present its World Cup coverage.",
        "url": "https://news.sky.com/story/gary-lineker-to-leave-bbc-next-week-and-will-no-longer-present-2026-world-cup-coverage-13370788",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-gary-lineker-match-of-the-day_6748739.jpg?20241115073300",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-19 05:13:00",
        "Headline": "The 64-year-old presenter sometimes expresses frank views online, which have raised questions about the BBC's impartiality.",
        "Content": " Gary Lineker has confirmed he is leaving the BBC after this season's Match Of The Day and will no longer present its World Cup coverage. It comes after the 64-year-old \"apologised unreservedly\" for sharing a social media post illustrated with a rat - which has been used to represent Jewish people in antisemitic propaganda, including Nazi Germany. Read more: A history of Gary Lineker's most controversial posts In a statement on Monday, Lineker said: \"Football has been at the heart of my life for as long as I can remember - both on the pitch and in the studio. \"I care deeply about the game, and about the work I've done with the BBC over many years. As I've said, I would never consciously repost anything antisemitic - it goes against everything I stand for. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" Analysis: BBC can breathe easier after Lineker leaves Lineker said he deleted the post when he learned about the rat's symbolism, adding he would \"never knowingly share anything antisemitic\". In a separate video posted to Instagram, the pundit added: \"I've stood up for minorities and humanitarian issues and against all forms of racism all of my life, including, of course, antisemitism, which I absolutely abhor. \"There's no place for it and never should be.\" He went on to thank the \"brilliant, talented\" people he has worked with and described his relationship with the BBC as \"long and wonderful\". He added: \"But it's the right time for the organisation and myself to go our separate ways.\" Lineker's last appearance on the BBC will be on Sunday 25 May, the final day of the season. Gary Lineker signed a five-year deal with the BBC in 2020, under which he agreed to adhere to their impartiality rules. The rules were then updated after his return to Match Of The Day in 2023.\n\n The latest regulations say high-profile BBC presenters should be able to express their views on political issues as long as they stop short of campaigning. It does not clarify what would constitute political campaigning for the big-name presenters. The guidelines also stress the importance of \"high standards of civility in public discourse\", which includes treating others with respect, even in the face of abuse and not using offensive or aggressive language. The policy only applies to presenters outside of its news coverage. News presenters are still subject to stricter impartiality guidelines. 'A defining voice in football coverage' Also confirming Lineker's exit, BBC director general Tim Davie said: \"Gary has acknowledged the mistake he made. Accordingly, we have agreed he will step back from further presenting after this season. \"Gary has been a defining voice in football coverage for the BBC for over two decades. His passion and knowledge have shaped our sports journalism and earned him the respect of sports fans across the UK and beyond. \"We want to thank him for the contribution he has made.\" Alex Kay-Jelski, the BBC's director of sport, said in an email sent to staff that it had been a \"difficult\" and \"emotional\" week. He went on to say: \"It is sad to be saying goodbye to such a brilliant broadcaster and I also want to thank Gary for his years of service. As ever, if you have questions, you know where I am. \"Let's finish the season strongly with Gary's final show, enjoy an incredible summer of sport and look forward with excitement to what lies ahead.\" Lineker announced in November he would step down from Match Of The Day this year, but was set to return to front the World Cup in 2026, as well as FA Cup coverage. The former England star was temporarily suspended from the BBC in March 2023 after an impartiality row over comments he made criticising the then Conservative government's asylum policy. He will be replaced on Match Of The Day by Gabby Logan, Kelly Cates and Mark Chapman, who will share the presenting role from the next Premier League season. Read more from Sky News:What is in the Brexit reset agreement?Politicians send messages of support to Joe Biden Lineker has hosted Match Of The Day since 1999 and has been the BBC's highest-paid on-air talent for seven consecutive years. He joined the programme having started as a BBC Radio Five Live presenter, also working on the broadcaster's former flagship sports show Grandstand during his early years in broadcasting. The Leicester-born presenter is also the co-founder of podcast producing company Goalhanger, which makes the popular The Rest Is History series and its spin-offs about politics, football, entertainment and money. His parting ways with the BBC also includes the licensing deal for Goalhanger podcast titles on BBC Sounds, which ends this year, the PA news agency reported."
    },
    {
        "title": "BBC can breathe easier that fallout from Lineker's social media won't land at its door",
        "description": "Did having a social conscience force Gary Lineker off the BBC? Or was becoming increasingly vocal politically just too problematic?",
        "url": "https://news.sky.com/story/bbc-can-breathe-easier-that-fallout-from-linekers-social-media-wont-land-at-its-door-13371074",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gary-lineker-bbc_6921487.jpg?20250519141316",
        "type": "Entertainment",
        "Author": "Rob Harris",
        "Date Published": "2025-05-19 15:39:00",
        "Headline": "The former England captain is leaving the corporation after he accidentally shared a social media post which carried an antisemitic image.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Did having a social conscience force Gary Lineker off the BBC? Or was becoming increasingly vocal politically just too problematic? The former England captain was given an exemption, as a freelancer working outside of news and current affairs, from impartiality rules the BBC's staff have to abide by - despite being the broadcaster's highest earner at £1.35m. That meant he was even handed BBC primetime coverage recently, in which he critiqued the BBC's coverage of the Middle East conflict, disputing the news side's decision-making. Silence on Gaza, he claimed, equates to complicity. And Lineker has sought to show empathy with those suffering in Gaza and the mounting Palestinian death toll from IDF strikes, which Israel says are targeted at Hamas. He has, however, faced accusations of inconsistency by being silent on other conflicts in Sudan and Yemen. And also for showing little public concern for hostages taken by Hamas during the terror of 7 October - including Emily Damari, a fan of one of his former clubs, Tottenham Hotspur.  Highly-selective commentaries have been shared, often from fringe groups. And then came last week's rat emoji, which appeared on an anti-Zionist post shared on Instagram, which Lineker reposted and said he later deleted when he learned about the rat's symbolism. Images of rats have in the past been used to represent Jewish people in antisemitic propaganda, including in Nazi Germany. The incident produced an unprecedented apology from the ex-footballer, who said he was unaware of connotations offensive to Jewish people. Read more:Lineker releases statement as BBC departure confirmedThe BBC's impartiality guidelines explainedA history of Gary Lineker's most controversial posts  As BBC Director General Tim Davie said: \"The BBC's reputation is held by everyone, and when someone makes a mistake, it costs us.\" The lack of public response from the BBC to Lineker's apology made his future seem increasingly untenable. Now, three decades broadcasting on the BBC will end under a cloud of controversy rather than celebration. Lineker is even freer to give opinions - particularly through his podcast empire - and many do want to listen to him and welcome his status being used to highlight the plight of the besieged. But the BBC can breathe easier knowing the fallout from social media posts won't land at the corporation's door."
    },
    {
        "title": "A history of Gary Lineker's most controversial posts - from Rwanda and Brexit to Gaza",
        "description": "Gary Lineker, the BBC's highest-paid on-air presenter, is to leave the corporation&#160;in a matter of days.",
        "url": "https://news.sky.com/story/a-history-of-gary-linekers-most-controversial-posts-from-rwanda-to-brexit-to-gaza-12829271",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-gary-lineker-etihad-stadium_6392234.jpg?20231213194203",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-19 08:11:00",
        "Headline": "Gary Lineker has hit headlines numerous times throughout his career at the BBC for breaking the corporation's impartiality rules.",
        "Content": "Gary Lineker, the BBC's highest-paid on-air presenter, is to leave the corporation in a matter of days. The Match Of The Day host will step away from the broadcaster at the end of this month, with his last appearance expected on 25 May, the last day of the Premier League season. His exit comes after he \"apologised unreservedly\" for sharing a social media post that featured a rat - used in Nazi propaganda to dehumanise Jewish people - and said he would \"never knowingly share anything antisemitic\". It was the latest controversial post by the 64-year-old, who has found himself at the centre of several rows over his social media usage, most of which involve him sharing his political views, which go against the BBC's rules on impartiality. In a statement on Monday, Lineker said: \"I care deeply about the game, and about the work I've done with the BBC over many years. As I've said, I would never consciously repost anything antisemitic - it goes against everything I stand for. \"However, I recognise the error and upset that I caused, and reiterate how sorry I am. Stepping back now feels like the responsible course of action.\" Here is a round-up of the pundit's most contentious comments as he prepares to leave the BBC.  Gaza documentary  Although not via social media, earlier this year, Lineker was one of 500 media personalities who condemned the BBC for pulling the documentary Gaza: How To Survive A Warzone after it emerged the child narrator, Abdullah, is the son of Ayman Alyazouri, who had worked as Hamas's deputy minister of agriculture. In an open letter addressed to BBC director general Tim Davie, chairman Samir Shah and outgoing chief content officer Charlotte Moore, Lineker joined hundreds of TV and film professionals and journalists who called the decision to remove the documentary \"politically motivated censorship\". The presenter later said the BBC had \"capitulated\", adding that he did not see Abdullah as an issue, and maintaining that the corporation should not have admitted to \"a number of serious failings in their commissioning and editorial processes\". The BBC admitted the documentary's failings were \"a dagger to the heart\" of the corporation's impartiality. Tory migrant policy In March 2023, Lineker called a Conservative government policy on migration \"immeasurably cruel\" and compared the language around it to 1930s Germany. Hitting out at a video of former home secretary Suella Braverman, where she unveiled the Illegal Migration Bill and claimed the UK was being \"overwhelmed\" by migrants, Lineker wrote on social media: \"There is no huge influx. \"We take far fewer refugees than other major European countries. \"This is just an immeasurably cruel policy directed at the most vulnerable people in language that is not dissimilar to that used by Germany in the '30s.\" His comments sent politicians, pundits and social media platform X into a spin. As a result, Lineker was removed from his duties as Match Of The Day presenter after claims he had breached their impartiality guidelines. He later returned to the presenting role after the row prompted a boycott by his fellow football pundits and commentators, hitting TV and radio coverage across the BBC. Lineker has been consistently vocal on the issue of migration. In 2020 the former England footballer welcomed refugee Rasheed Baluch into his Surrey home. Mr Baluch, who was from Pakistan, stayed with the presenter for weeks, and spoke out in the pundit's defence in 2023, describing him as a \"very sympathetic, caring and human loving man\".  '4 chaps Shapps' Criticising former defence secretary Grant Shapps in December 2023, Lineker posted photos of the politician - who lost his seat in last year's general election - along with different names he has been accused of using in the past. It was in response to Mr Shapps defending the government's Rwanda scheme. The politician said Lineker should stick to football and stop \"meddling\" in other matters. Lineker replied on social media, saying: \"A tad rich coming from someone who can't even stick to one name. 4 chaps Shapps.\" Chair of the BBC Mr Shah said at the time the post breached the corporation's guidelines. Brexit and Tories Lineker was a vocal opponent of Brexit and in 2018 backed the campaign for another EU referendum, saying Brexit felt like it was \"going very wrong indeed\". At the time, a BBC source told Sky News that Lineker's position as a freelance broadcaster, and a presenter who does not front news or politics programmes, meant he was clear of the corporation's rules on impartiality. As well as voicing his Brexit opinions, Lineker bemoaned \"the absolute state of our politics\", saying \"imagine how hopeless you'd have to be to still be behind the Tory party in the polls\". BBC cricket correspondent Jonathan Agnew hit back, criticising Lineker for speaking out on politics. He posted on X: \"Gary. You are the face of BBC Sport. Please observe BBC editorial guidelines and keep your political views, whatever they are and whatever the subject, to yourself. I'd be sacked if I followed your example. Thanks.\" Lineker made a barbed reply: \"Jonathan, I'm the face of my own Twitter account. I'll continue to tweet what I like and if folk disagree with me then so be it.\" Gary Lineker signed a five-year deal with the BBC in 2020, under which he agreed to adhere to their impartiality rules. The rules were then updated after his return to Match Of The Day in 2023.\n\n The latest regulations say high-profile BBC presenters should be able to express their views on political issues as long as they stop short of campaigning. It does not clarify what would constitute political campaigning for the big-name presenters. The guidelines also stress the importance of \"high standards of civility in public discourse\", which includes treating others with respect, even in the face of abuse and not using offensive or aggressive language. The policy only applies to presenters outside of its news coverage. News presenters are still subject to stricter impartiality guidelines. Russian donors In February 2022, Lineker tweeted about the Conservative Party taking money from \"Russian donors\". Retweeting a story about the then foreign secretary Liz Truss urging football teams to boycott the Champions League final in Russia, he added: \"And her party will hand back their donations from Russian donors?\" The BBC's Executive Complaints Unit (ECU) upheld a complaint and said Lineker's post \"did not meet the BBC's editorial standards on impartiality\". The ECU said Lineker was \"one of the BBC's highest profile stars\" and said while not being required to uphold the same high standards of impartiality as its journalists, he had an \"additional responsibility\" because of his profile. \"We expect these individuals to avoid taking sides on party political issues or political controversies and to take care when addressing public policy matters,\" the ruling said. Row over sewage A senior BBC journalist questioned Lineker's commitment to the BBC's impartiality rules after the presenter posted on social media about sewage in August 2022. At the time, Lineker wrote on social media: \"As a politician how could you ever, under any circumstances, bring yourself to vote for pumping sewage into our seas? Unfathomable!\" BBC journalist Neil Henderson asked Lineker whether he had a contract allowing him to breach BBC impartiality, writing: \"The BBC lives or dies by its impartiality. If you can't abide it, get off it.\" He subsequently apologised to the former footballer and deleted the tweets. Under the BBC's social media rules, criticising colleagues is off-limits. Read more:Who are Match Of The Day's new presenters? Qatar World Cup Lineker opened the BBC's coverage of the 2022 Qatar World Cup with a scathing critique of the host country's record on human rights and treatment of migrant workers. The segment analysed the decision to award the tournament to Qatar amid corruption allegations and brought in pundits to discuss workers' rights and discrimination against LGBT people. Former BBC journalist Emily Maitlis - who was once found to have breached impartiality guidelines herself - compared that incident to the response to his other social media posts around the same time. She said: \"Curious that Gary Lineker was free to raise questions about Qatar's human rights record - with the blessing of the BBC - over the World Cup, but cannot raise questions of human rights in this country if it involves criticism of government policy...\" In advance of the tournament, Lineker criticised then foreign secretary James Cleverly after he suggested LGBT football fans should be \"respectful\" of Qatar, where homosexuality is illegal, if they visited for the World Cup. Responding to the comments, Lineker said: \"Whatever you do, don't do anything gay. Is that the message?\" The time he didn't speak out Reflecting on his comments about the Qatar World Cup, Lineker said he and the BBC should have spoken out more during the World Cup in Russia in 2018. At the time there were calls for Russia to be stripped of the World Cup or boycotted in 2014 after it annexed Crimea and was blamed by the West for supplying arms to pro-Russian separatists suspected of shooting down Malaysia Airlines flight MH17 over eastern Ukraine. \"I think we were all going how great it was, and this and that and the other, and that's how sportwashing works,\" Lineker said during a BBC Radio 4 interview. \"We've seen what Putin's done subsequently, but he'd done it before. \"I think looking back now in hindsight, I think we should probably have spoken out more.\""
    },
    {
        "title": "The Who drummer sacked from band for second time in a month",
        "description": "The Who's drummer Zak Starkey has been sacked by the band, marking the second time he has left in the past month.",
        "url": "https://news.sky.com/story/the-who-drummer-zak-starkey-sacked-weeks-after-rejoining-the-band-13370873",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-zak-starkey-the-who_6889019.jpg?20250417134449",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-19 09:01:00",
        "Headline": "Starkey, who joined the band in 1996, says he has been \"fired\" for a second time and asked to make a statement saying he quit. It comes after reports of a row on stage.",
        "Content": "The Who's drummer Zak Starkey has been sacked by the band, marking the second time he has left in the past month. The band's guitarist Pete Townshend made a statement on Instagram on Sunday, saying: \"After many years of great work on drums from Zak the time has come for a change. \"A poignant time. Zak has lots of new projects in hand and I wish him the best.\" The announcement comes weeks before the iconic British rock group's farewell tour. In response, Starkey, who had been a band member since 1996, said in an Instagram post he would \"never have quit\" and had experienced \"weeks of mayhem\". \"I was fired two weeks after reinstatement and asked to make a statement saying I had quit to follow my other musical endeavours,\" he wrote. \"Not true. I love The Who and would never have quit and let down so many amazing people who stood up for me through all this madness.\" Reports surfaced in April that the band had taken the \"collective decision\" to sack Starkey after a row over their Teenage Cancer Trust shows in March. A review of one gig, published in the Metro, suggested frontman Roger Daltrey, who launched the annual gig series for the charity in 2000, had been \"frustrated\" with the drumming during some tracks. According to the review, Daltrey at one point paused a song and said: \"To sing that song I do need to hear the key, and I can't. All I've got is drums going boom, boom, boom. I can't sing to that. I'm sorry guys.\" At the time, the 59-year-old drummer said he was \"surprised and saddened\" by news of his sacking. Three days after the reports came out, a statement on the band's official social media pages titled \"News Flash! Who Backs Zak,\" said he was \"not being asked to step down from The Who\". Read more:Inside Diddy's star-studded partiesAustria wins Eurovision In it, Townshend said: \"There have been some communication issues, personal and private on all sides, that needed to be dealt with, and these have been aired happily. \"Roger and I would like Zak to tighten up his latest evolved drumming style to accommodate our non-orchestral line-up and he has readily agreed.\" Later in the lengthy statement, he said regarding the gigs: \"Zak made a few mistakes and he has apologised.\" At that point, Starkey - who is the son of The Beatles drummer Ringo Starr - reposted Townshend's statement, with the message: \"V grateful to be a part of the Who family Thanks Roger and Pete xx\". Starkey also drums for supergroup Mantra Of The Cosmos - along with fellow musicians Shaun Ryder and Bez from Happy Mondays, and Andy Bell of Ride and Oasis - and has previously played with Oasis, Lightning Seeds and Johnny Marr."
    }
]