[
    {
        "title": "Lammy defends failing to reveal another prisoner had been mistakenly released",
        "description": "David Lammy has said he did not know all the details of a prisoner's mistaken release when repeatedly asked about it.",
        "url": "https://news.sky.com/story/lammy-defends-not-revealing-another-prisoner-had-been-mistakenly-released-13465137",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gartree-hmp-david-lammy_7073886.jpg?20251106153735",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-06 15:27:00",
        "Headline": "The justice secretary has raised more questions after trying to clarify what he knew about the mistaken release of an Algerian registered sex offender.",
        "Content": " David Lammy has said he did not know all the details of a prisoner's mistaken release when repeatedly asked about it. The justice secretary and deputy prime minister was heavily criticised for not revealing on Wednesday that registered Algerian sex offender Brahim Kaddour-Cherif had been released in error last week. The Conservatives used Mr Lammy's appearance at Prime Minister's Questions to ask - five times - if another prisoner had been released after migrant sex offender Hadush Kebatu was released by mistake on 24 October instead of being taken to an immigration removal centre. Politics latest: Lammy responds to prisoner release error - but raises more questions than he answers  Mr Lammy gave an irate reply but refused to say he knew anything. A day later, Mr Lammy has defended his decision not to reveal that he knew about the incident, saying he did not know the full details and did not want to mislead the public. \n                  Starmer says Lammy 'setting out facts to best of his knowledge' on prisoner releases\n                 \n                  What we know so far about the prisoners freed by mistake\n                 \n                  Wandsworth manhunt latest: Search is on for two prisoners freed by mistake\n                 \"I did not have all of the details,\" he said. \"That detail was actually released just later after I had finished at Prime Minister's Questions. \"I took the judgment that it is important when updating the House and the country about serious matters like this, that you have all of the details. \"I was not equipped with all of the detail, and the danger is that you end up misleading the House and the general public. \"So that is the judgment I took. I think it's the right judgment.\"  Timeline confusion The justice secretary said he first found out about Kaddour-Cherif's release on Wednesday morning, and spent the hours before PMQs in the Ministry of Justice, \"learning from officials\" and preparing for his first time filling in for Sir Keir Starmer. However, questions have been raised about the timeline because Mr Lammy said Kaddour-Cherif was released \"before I introduced those checks\". On 27 October, he said \"the strongest release checks that have ever been in place\" were being introduced in reaction to Kebatu's accidental release. \"They will apply to every release from custody and are effective immediately,\" he added. But Kaddour-Cherif was released on 29 October, two days later. Prison authorities then did not alert the Metropolitan Police until Monday, and the prisoner is still at large. Another prisoner, Billy Smith, was also released by mistake on Tuesday but handed himself in on Thursday after it was made public a couple of hours after PMQs. Sky News has asked the Ministry of Justice for clarification on the timeline."
    },
    {
        "title": "'Iconic, wise' Shirley Valentine actress Pauline Collins dies",
        "description": "Shirley Valentine actress Pauline Collins has died \"peacefully\", aged 85, surrounded by her family.",
        "url": "https://news.sky.com/story/shirley-valentine-actress-pauline-collins-dies-13465238",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pauline-collins-collins_7074139.jpg?20251106183126",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-06 17:26:00",
        "Headline": "The actress's family thanked her carers, saying \"she could not have had a more peaceful goodbye\". ",
        "Content": "Shirley Valentine actress Pauline Collins has died \"peacefully\", aged 85, surrounded by her family. The actress, who starred in the first series of sitcom The Liver Birds, and became a household name in Upstairs Downstairs, had Parkinson's disease for several years. Her later role in the 1989 film Shirley Valentine, playing the lead character of the bored Liverpudlian housewife, earned her an Oscar nomination. 'Iconic, strong-willed' Her family said in a statement: \"Pauline was so many things to so many people, playing a variety of roles in her life. A bright, sparky, witty presence on stage and screen. Her illustrious career saw her play politicians, mothers and queens. \"She will always be remembered as the iconic, strong-willed, vivacious and wise Shirley Valentine - a role that she made all her own. \"We were familiar with all those parts of her because her magic was contained in each one of them. \n                  Public 'at risk' as more inmates sent to open prisons - with another manhunt under way \n                 \n                  Andrew Mountbatten Windsor summoned by US Congress\n                 \n                  Congress letter to Andrew: Read in full\n                 \"More than anything, though, she was our loving mum, our wonderful grandma and great-grandma. Warm, funny, generous, thoughtful, wise, she was always there for us. \"And she was John (Alderton)'s life-long love. A partner, work collaborator, and wife of 56 years. \"We particularly want to thank her carers: angels who looked after her with dignity, compassion, and most of all love. \"She could not have had a more peaceful goodbye. We hope you will remember her at the height of her powers; so joyful and full of energy; and give us the space and privacy to contemplate a life without her.\" She married fellow actor John Alderton in 1969. 'Nation's sweetheart' He described her as a \"remarkable star\". He said he worked with her more than any other actor in TV series, films and West End stage shows, and had \"watched her genius at close quarters\". He added: \"What I saw was not only her brilliant range of diverse characters but her magic of bringing out the best in all of the people she worked with. She wanted everyone to be special and she did this by never saying 'Look at me'. \"It's no wonder that she was voted the nation's sweetheart in the 1970s. \"She will always be remembered for Shirley Valentine, not only for her Oscar nomination or the film itself, but for clean-sweeping all seven awards when she portrayed her on Broadway in the stage play, in which she played every character herself. \"But her greatest performance was as my wife and mother to our beautiful children.\" Read more: Acting has been taken over by 'posh boys', says one of Britain's most celebrated actors Helen Garner's 'unsparing' diary collection becomes first to win prestigious Baillie Gifford non-fiction prize Born in Exmouth in 1940, Collins was raised near Liverpool and began her career as a teacher. But after taking up acting part-time, she landed her first television role as a nurse in the series Emergency Ward 10. Collins also won great acclaim for her role in 1997 film Paradise Road, which tells the story of a group of women in a Japanese prisoner of war camp who defy their captors by founding an orchestra. The film also starred Glenn Close, Cate Blanchett and Frances McDormand. In 2001, Collins was made an OBE for her services to drama."
    },
    {
        "title": "Eleven arrested during night of protests as Aston Villa played Maccabi Tel Aviv ",
        "description": "A total of 11 arrests were made during a night of protests as Aston Villa played Maccabi Tel Aviv in Birmingham.",
        "url": "https://news.sky.com/story/six-arrested-ahead-of-the-maccabi-tel-aviv-game-13465320",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maccabi-tel-aviv-aston-villa_7074234.jpg?20251106200106",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-06 19:02:00",
        "Headline": "More than 700 police officers were on duty for the Europa League clash amid concerns over potential disorder.",
        "Content": "A total of 11 arrests were made during a night of protests as Aston Villa played Maccabi Tel Aviv in Birmingham. They were held on a multitude of offences, including: • Shouting racist abuse during a road rage incident at Villa Park • Refusing to remove a face covering • Failing to leave despite being issued with a dispersal order • Shouting abuse towards pro-Israel demonstrators • Shouting abuse towards pro-Palestine demonstrators \n                  Maccabi boss hits out at 'blatant falsehoods' peddled about their fans - but admits work to do on racism\n                 \n                  More than 700 police officers will be deployed for Aston Villa's match against Maccabi Tel Aviv\n                 \n                  Border Force officer charged after 25kg of heroin found at Birmingham Airport\n                 • Shouting racist abuse at a police officer • Possessing Class B drugs • Trying to throw fireworks into the ground Those arrested were all men or boys - ranging in age from 17 to 67. Hundreds of extra officers were on duty for the event. The lead-up to the Europa League match was dominated by controversy and security concerns, leading to a ban on away supporters and large pro-Palestinian protests. Birmingham's Safety Advisory Group announced last month that visiting fans would be barred from attending tonight's game following public safety concerns. The government said it would \"work around the clock\" to ensure both sides could attend - but Maccabi later announced it would decline any away tickets for the clash even if the ban was reversed. The ban was recommended by West Midlands Police, feeding into the decision by the local Safety Advisory Group, led by Birmingham City Council.  Before the match, around 200 protesters including members of the Palestine Solidarity Campaign gathered near Villa Park's Trinity Road stand to demand Israel is excluded from international football. Meanwhile, around 40 protesters, one carrying an Israeli flag, and others carrying posters saying \"keep antisemitism out of football\" gathered on a basketball court on Witton Lane, close to the Doug Ellis Stand, to hear various speakers oppose the ban on Maccabi fans. Five flatbed vehicles were also driven past the ground carrying electronic billboards showing messages opposing antisemitism. Read more:Why were Maccabi Tel Aviv fans banned  'An ancient hate' The Revd Tim Gutmann, founder of Christian Action Against Antisemitism, told the crowd his protest was against \"an ancient hate and an ancient evil that hasn't stopped, and has again risen in our time\". Holding up a placard saying \"Never Again Is Now\", he added: \"As a Christian it's important for me to be here to show that we stand with our fight and stop the hate. \"These are huge moments for a nation. We cannot have no-go zones for Israeli football fans. We can't have no-go zones for Jewish people.\" Another of the messages, beside a Star of David, read \"Ban hatred not fans\" - while another carried a quote from Thierry Henry saying football is not about goals but bringing people together. West Midlands Police had classified the Europa League match \"high risk\" and said the ban on the Maccabi fans was necessary due to \"current intelligence and previous incidents\". That was a reference to Maccabi's match at Ajax last November when their fans were attacked by locals, leading to five convictions. No Maccabi fans were prosecuted. They were seen tearing down Palestinian flags and chanting anti-Arab abuse. Sir Keir Starmer had been among those criticising the supporters' Aston Villa game ban."
    },
    {
        "title": "Elon Musk's $1 trillion pay package approved by Tesla",
        "description": "Elon Musk could be on track for a $1trn (&#163;761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years.",
        "url": "https://news.sky.com/story/elon-musks-1-trillion-pay-package-approved-by-tesla-13464835",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "Home",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-06 09:46:00",
        "Headline": "Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Elon Musk could be on track for a $1trn (£761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years. The world's richest man has the potential to become a trillionaire after the controversial plans were approved by 75% of the company's shareholders. However, it won't be easy. As part of the agreement, Musk will need to deliver 20 million Tesla vehicles over the next decade - more than double the number churned out over the past 12 years. He will be tasked with dramatically increasing the company's valuation and operating profits.  Another requirement is for Tesla to roll out one million AI-powered robots - despite the fact it hasn't released a single one so far. Musk will also need to come up with a succession plan on who will replace him as the chief executive of Tesla. As each step is successfully completed, he will receive more company shares and his ownership stake will rise - potentially from 13% now to almost 29%. \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 \n                  How the world's richest man is boosting the British right\n                 And even if Musk falls short of some of these targets, he could end up earning a lot of money. Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet. That title belongs to John D. Rockefeller, the railroad titan who had wealth of $630bn (£480bn) back in 1913 - when adjusted for inflation.  Why? Now is the moment Tesla wants to innovate, develop into robotics, self-driving and embrace the growth of artificial intelligence (AI). It's seeking a visionary leader to spearhead this move. And a lot of Tesla's market value is tied up in this ambition. Tesla's board of directors, who oversee the management of the business, are adamant that only Musk can make the lofty ambitions a reality. Some believe there's no one else like Musk. More shares in the company are \"critical to keep Musk at the helm to lead Tesla through the most critical time in the company's history\", said financial services firm Wedbush. \"We believe this was the smart move by the board to lay out these incentives/pay package at this key time as the biggest asset for Tesla is Musk ... and with the AI revolution, this is a crucial time for Tesla ahead with autonomous and robotics front and centre.\" Read more money news:Bank of England holds interest rateM&S reveals cost of cyber attack   Opposition Not everyone is in favour of the pay package. Major investor advice firm Institutional Shareholder Services (ISS) warned the 10-year pay agreement reduces the board's ability \"to meaningfully adjust future pay levels in the event of unforeseen events or changes in either the performance or strategic focus of the company over the next decade\".  In a note, ISS said: \"The high value of each tranche could also potentially undermine Musk's desire to achieve all goals and create significant value for shareholders\", and that the goals \"lack precision\".  Mr Musk has described ISS and another major adviser, Glass Lewis, as \"corporate terrorists\". There was speculation he would walk away from the business if the package was not agreed on. "
    },
    {
        "title": "Anti-black discrimination 'baked' into Met Police, report finds, as Stephen Lawrence's mother says 'change must take place now'",
        "description": "A review of anti-black racism within the Metropolitan Police has found that discrimination is \"baked\" into its HR systems.",
        "url": "https://news.sky.com/story/anti-black-discrimination-baked-into-met-police-report-finds-as-stephen-lawrences-mother-says-change-must-take-place-now-13465110",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-met-police-new-scotland-yard_7073859.jpg?20251106152255",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-06 14:32:00",
        "Headline": "The Met's systems, leadership, governance and culture are producing racial harm, the internal review concluded.",
        "Content": "A review of anti-black racism within the Metropolitan Police has found that discrimination is \"baked\" into its HR systems. The Met's systems, leadership, governance and culture are producing racial harm, the investigation concluded. Shereen Daniels, the review's author, said discrimination is \"baked\" into the \"institutional design\" of the force. \"Plans that ignore this will always return to the same logic, manage perception, avoid power, thus continuing the cycle,\" she added. The internal review said darker-skinned staff are \"labelled confrontational\" while lighter-skinned staff may receive quicker empathy and leniency. The review draws on more than 40 years of evidence showing how racism has shaped the Met's relationship with black communities and affected black officers and staff. Scotland Yard said it welcomed the report in full and recognised the scale of the challenges set out. Metropolitan Police commissioner Sir Mark Rowley described the report as \"powerful\", adding that it \"calls out that further systemic, structural, cultural change is needed\". Read more:How the world's richest man is boosting the British rightCollins Word of the Year 2025 revealed - do you recognise it? He said: \"London is a unique global city, and the Met will only truly deliver policing by consent when it is inclusive and anti-racist.\" He said the level of trust that black Londoners have in the Met has increased by 10% in two years, but still trails behind others, adding that \"we remain committed to listening, learning, and acting on their concerns\". Sir Mark also pointed to initiatives such as New Met for London and the London Race Action Plan, which he said were helping the Met Police to make progress. The study, 30 Patterns Of Harm: A Structural Review Of Systemic Racism Within The London Metropolitan Police Service, was commissioned from the consultancy HR Rewired. The latest examination of the force comes after Louise Casey's 2023 review, commissioned after the murder of Sarah Everard, found the Met \"institutionally racist, misogynistic and homophobic\". Reviews spanning decades have criticised the Met for being discriminatory, including the MacPherson report (1999) that called it \"institutionally racist\" after officers' mishandling of the Stephen Lawrence case. Mr Lawrence's mother welcomed the new report, but said it contained \"nothing that I did not already know\". Baroness Doreen Lawrence, whose 18-year-old son was killed in a racist attack in southeast London in 1993, said: \"Racism was the reason why Stephen was killed and racism was the reason why the police have failed to find all of his killers. \"Racism must be acknowledged, accepted and confronted in the Met. \"In the three decades since my son's murder there has never been an honest acceptance of racism and how it has affected how our communities are treated. \"The police must stop telling us that change is coming whilst we continue to suffer. That change must take place now.\" Ms Daniels said: \"Systemic racism is not a matter of perception. For almost 50 years, reviews of the Metropolitan Police have documented the harm experienced by black Londoners, officers and staff.\" She said that \"true accountability begins with specificity\", noting that \"anti-blackness is the clearest indicator of organisational dysfunction\". Ms Daniels added: \"The same systems that sustain racial harm against black people also enable other forms of harm. Confronting this is not an act of exclusion but a necessary foundation for safety, fairness and justice for everyone.\" She said that the challenge facing the Met is to \"build the leadership discipline to face what the report has revealed and act on its findings in a way that protects the public rather than the institution\"."
    },
    {
        "title": "Southport killer's parents 'sorry' for failing to stop 'monster' son - as victims' families say they should be held to account",
        "description": "The parents of the three girls murdered by Axel Rudakubana have condemned his mother and father for their failures to prevent the Southport attack - saying they should be held to account.",
        "url": "https://news.sky.com/story/southport-killers-parents-sorry-for-failing-to-stop-monster-son-as-victims-families-say-they-should-be-held-to-account-13465148",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-elsie-dot-stancombe_6643010.jpg?20251020192108",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-06 15:32:00",
        "Headline": "Alphonse Rudakubana and his wife Laetitia Muzayire both broke down in tears as they were challenged about why they did not report their son to the authorities ahead of the attack on 29 July last year.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n The parents of the three girls murdered by Axel Rudakubana have condemned his mother and father for their failures to prevent the Southport attack - saying they should be held to account. Alphonse Rudakubana and his wife Laetitia Muzayire both broke down in tears at a public inquiry as they were challenged about why they did not report their son to authorities. Latest updates from the inquiry in Liverpool Axel Rudakubana was 17 when he killed Elsie Dot Stancombe, seven, Bebe King, six, and Alice da Silva Aguiar, nine, in a knife attack on a Taylor Swift-themed dance class on 29 July last year. His father told how a week earlier, Rudakubana had burst into his bedroom carrying a knife before he stopped his son taking a taxi to the Range High School in Formby, Lancashire, on the last day of term. Mr Rudakubana knew his son had a \"small arsenal\" of weapons, including a bow and arrow and a sledgehammer, and believed he would carry out an arson attack at the school he was expelled from for carrying knives in 2019. The inquiry heard Rudakubana threatened his father, saying \"next time, if you stop me, there will be consequences\". \n                  'I'm desperately sorry': Axel Rudakubana's father accepts 'share of the responsibility' after Southport attack\n                 \n                  Southport inquiry: Axel Rudakubana’s brother feared he would kill their father before attack\n                 \n                  More capacity for mental health referrals needed, warns senior counter-terrorism officer\n                 His father said he was \"ashamed\" that he did not call police, but he did not have the \"courage\" at the time. He said he was not worried when Rudakubana left home on 29 July last year, even though the last time he had been out alone he was caught with a knife on a bus in March 2022 and told police he wanted to stab someone. But when he received a WhatsApp message from a member of his church at 1pm about the attack, he immediately feared his son was involved. Father feels 'so ashamed' Mr Rudakubana said his son had turned into \"a monster\", and told the families of his victims: \"When I cry for him, I remember them, I cry for them.\" \"I'm so ashamed I lost the courage to save the little angels and I'm so, so sorry,\" he said. His wife said she had been \"naive\" and said: \"I grieve deeply for my own son, but most of all for the innocent lives lost and the lives that have been devastated. \"There are many things Alphonse and I wish we had done differently, anything that might have prevented this horrific event of 29 July 2024. \"For our failure, we are profoundly sorry.\" What have the victims' parents said? In a statement released after the end of the evidence stage of the first phase of the inquiry, Elsie's mother and father Jenni and David Stancombe, said Rudakubana's parents \"should be held to account\". \"We knew early on that their lack of parenting played a part in all of this, but these statements reveal a failure of parenting on a whole new level,\" they said. \"We believe they should be held to account for what they allowed to happen. They knew how dangerous he was, yet they stayed silent. \"They didn't report their concerns, they didn't act, and in doing so, they failed not only as parents but as members of our society.\" Bebe's parents Lauren and Ben King described the evidence of the actions of Mr Rudakubana and his wife as \"deeply disturbing and shameful\". \"Where was that responsibility from his parents? They were absent. They turned away from their duties,\" they said in the statement released by their lawyers. \"And that was not a one-off mistake, it was a pattern, repeated over days, weeks, months, and years. \"Time after time, they had opportunities to intervene, to stop this, to protect others. If they had acted with any real sense of duty, Bebe, Elsie and Alice would still be here. It is that simple.\" Alex and Sergio Aguiar, Alice's mother and father, said the parents of their daughter's killer failed in their \"fundamental and moral duty\" to guide their child. Read more:Rudakubana was 'building up to something'Rudakubana judged as posing no risk to othersThe missed chances to stop Rudakubana \"Your failure to take responsibility, to act, and to intervene when there were clear signs of danger, directly contributed to the devastating loss of our daughter's life,\" they said. \"This tragedy was not inevitable. It was the result of neglect - neglect by those who should have known better, and by a system that repeatedly ignored warning signs.\" Rudakubana's parents could only be seen by the lawyers and chairman Sir Adrian Fulford at the inquiry at Liverpool Town Hall, with reporting restrictions in place to protect their identities. Sir Adrian said he hopes to produce his report on phase one of the inquiry by next spring."
    },
    {
        "title": "Russian drones: The tiny, kamikaze killing machines being raced rather than used to hunt targets",
        "description": "They're a weapon synonymous with Russia's war in Ukraine, and here the sky is full of them: Drones.",
        "url": "https://news.sky.com/story/the-tiny-kamikaze-killing-machines-being-raced-rather-than-used-to-hunt-targets-13465167",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-drone-racing-samara-russia_7073942.jpg?20251106160737",
        "type": "Home",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-06 15:54:00",
        "Headline": "The Kremlin has been quick when it comes to recognising drone racing's potential to boost Russia's military capabilities.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  They're a weapon synonymous with Russia's war in Ukraine, and here the sky is full of them: Drones. Tiny, kamikaze killing machines are zipping through the air in front of me. But I'm not on the battlefield. I'm on a football pitch. And instead of being used to hunt targets, the drones are being raced. I've come to a Russian sports festival in Samara. Drone racing is one of the main events. It's being held after dark in the city's impressive football stadium, which was built for the 2018 World Cup. The drones, and the various on-course obstacles, are lit up in luminous colours for the spectators to follow. Pilots navigate via on-board cameras - the feed of which is projected on the big screen above. \n                  As Russia marks Stalin's political repression, some fear the country's dark history could repeat itself\n                 \n                  Ukrainian troops 'start surrendering' in key city but Kyiv says situation 'dynamic'\n                 \n                  Ukraine will work on ceasefire plan within next 10 days, Volodymyr Zelenskyy says\n                 Irina, 14, is part of the victorious women's team. The schoolgirl only took up the sport two years ago and says she practices two hours every day. When I asked why she liked it, she replied in broken English: \"This has adrenaline and you can be fast.\" The Kremlin has certainly been quick when it comes to recognising the sport's potential to boost Russia's military capabilities. In June, Vladimir Putin announced a new drone flying championship for children as young as seven, dubbed Pilots of the Future, that will begin next year. But here in Samara, race organisers insist the sport is not a recruitment ground. \"Many people have a stereotype that as soon as they start working with drones, flying and learning to pilot them, and receive some kind of certificate proving their skills, they'll be taken away to be drone pilots,\" Ilya Galaev, president of the Russian Drone Racing Federation, said. \"But in reality, of course, that's not true. Everything is voluntary.\" The war wasn't voluntary for everyone competing here, though. Across town at the ice rink, we meet Mikhail, who was mobilised to fight in 2022. He's now competing in a para ice hockey tournament. All players have a physical disability. Like most others here, he lost a leg on the battlefield. \"In August 2023, I was wounded, I stepped on a mine. But I immediately realised that I won't give up and will move on,\" he said. \"For me, it was a kind of motivation to show other people that I didn't become any worse than others who live a full life.\" Read more from Sky News:Pirates firing machine guns board tanker off Somalia coastSudan's RSF agrees to humanitarian ceasefire proposal Para ice hockey is fast-paced. The players move around on specially designed sledges, seemingly unencumbered by their traumatic injuries. Russia doesn't publish the number of its wounded, but it's no coincidence how the sport has become a lot more prominent since the war began. 'Special Military Operations' Many of the teams competing here, like Gvardia from Moscow region, were only formed in the past three years, in response to the injuries soldiers were returning home with. \"Our team consists only of Special Military Operation participants who got injured,\" Gvardia's founder Mikhail Trifonov said. \"I visited hospitals, talked with the guys. And I still visit. I suggest they take up sport. \"It's an integral part of the rehabilitation process, because after receiving such an injury, such a trauma, psychologically one thinks 'what's next'? \"But here you're part of a team, you're with your fellow soldiers.\" The tournament says a lot about how the war is presented in Russia. Far from hiding veterans' traumas, the Kremlin is showcasing them, portraying its wounded as the pinnacle of society. Enlistment inspiration The teams here are competing for the Heroes of Our Time Cup, and in the entrance hall to the ice rink, there are military recruitment leaflets urging people to sign up. The authorities clearly hope the event will inspire others to enlist. It also says a lot about what three and a half years of war have done to Russia. Wherever you go now, the consequences of the conflict are never far away."
    },
    {
        "title": "Mexico's President Claudia Sheinbaum presses charges after groping incident",
        "description": "Mexico's President Claudia Sheinbaum has said the harassment she suffered when a drunk man groped her in the street is an assault on all women.",
        "url": "https://news.sky.com/story/mexicos-president-claudia-sheinbaum-presses-charges-after-groping-incident-13464974",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-claudia-sheinbaum-mexico_7073899.jpg?20251106154605",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-06 12:17:00",
        "Headline": "A video shows a man coming up to her when she is speaking to supporters. He approaches her from behind, leans in to kiss her and appears to put his hands on her.",
        "Content": "Mexico's President Claudia Sheinbaum has said the harassment she suffered when a drunk man groped her in the street is an assault on all women. A video posted on social media shows a man coming up to her when she is speaking to supporters near the National Palace in the capital, Mexico City. He approaches her from behind, leans in to kiss her and appears to put his hands on her. Ms Sheinbaum used her daily press briefing on Wednesday to say she had pressed charges against the man. Mexico City mayor Clara Brugada had announced overnight that the man had been arrested. When Ms Sheinbaum was elected, she said that it wasn't just her coming to power - it was all women. \"If this is done to the president, what is going to happen to all of the young women in our country?\" she said on Wednesday. Ms Sheinbaum also called on states to scrutinise their laws and procedures to make it easier for women to report such assaults. She said Mexicans needed to hear a \"loud and clear, no, women's personal space must not be violated\". The incident immediately raised questions about the president's security, but Ms Sheinbaum dismissed any suggestion she would increase it or alter how she interacts with people. Read more from Sky News:Earth's lungs are collapsing - is net zero dead?At least 114 dead after Philippines typhoon Ms Sheinbaum also said on Wednesday that she had similar experiences of harassment when she was 12 years old and using public transport to travel to school, noting she understands it is a widespread issue. \"I decided to press charges because this is something that I experienced as a woman, but that we as women experience in our country,\" she said. Andrea Gonzalez Martinez, 27, who works for Mexican lender Nacional Monte de Piedad, said she has been harassed on public transport, with a man following her home in one case. \"It happens regularly, it happens on public transportation,\" she said. \"It's something you experience every day in Mexico.\" A World Health Organization report this year revealed that one in three women in the Americas has experienced physical or sexual violence from a partner or by a third party. In the first seven months of this year, cases of femicide in Mexico decreased by almost 40% compared to the same period in 2024, and intentional injuries against women dropped by 11%, according to figures from the Federal Security Secretariat. From 2019 to 2024, only 20% to 30% of women experiencing violence in Mexico, Argentina, Brazil, Chile, Ecuador, Honduras, Peru and Uruguay used state services specifically designed for them, according to a report by the Economic Commission for Latin America and the Caribbean (ECLAC) on femicide in the region."
    },
    {
        "title": "Congress letter to Andrew: Read in full",
        "description": "Andrew Mountbatten Windsor has been summoned by Congress to answer questions about his friendship with Jeffrey Epstein. ",
        "url": "https://news.sky.com/story/congress-requests-andrew-explain-jeffrey-epstein-friendship-read-letter-in-full-13465258",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jeffrey-epstein-andrew_7068344.jpg?20251101040628",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-06 17:37:00",
        "Headline": "Democratic members of US Congress have formally written to Andrew Mountbatten Windsor to summon him to the Capitol and speak about his links to paedophile financier Jeffrey Epstein",
        "Content": "Andrew Mountbatten Windsor has been summoned by Congress to answer questions about his friendship with Jeffrey Epstein.  Democratic members of the Committee on Oversight and Government Reform say they are investigating the late financier's \"sex trafficking operations\". Andrew's friendship with the paedophile has come under intense scrutiny in recent years and has led to him being stripped of his titles and made to leave his accommodation at Royal Lodge on the Windsor estate. The memoir of Virginia Giuffre, one of Epstein's victims, was posthumously published last month and in it she alleged she had sex with Andrew three times while she was a teenager. Andrew paid a settlement to Ms Giuffre in 2022 and has always denied wrongdoing. He has previously resisted calls to be summoned to the US. Here is the letter in full:  We write to seek your cooperation in the Committee on Oversight and Government Reform's (Committee) investigation into Jeffrey Epstein's sex trafficking operations. The Committee is seeking to uncover the identities of Mr. Epstein's co-conspirators and enablers and to understand the full extent of his criminal operations. \n                  King formally strips Andrew of prince title and HRH style\n                 \n                  Andrew Mountbatten Windsor summoned by US Congress\n                 \n                  Prince William to attend Earthshot Prize and COP30 in Brazil - with his team hoping to refocus attention away from Andrew\n                 Well-documented allegations against you, along with your long-standing friendship with Mr. Epstein, indicate that you may possess knowledge of his activities relevant to our investigation. In the interest of justice for the victims of Jeffrey Epstein, we request that you cooperate with the Committee's investigation by sitting for a transcribed interview with the Committee. It has been publicly reported that your friendship with Mr. Epstein began in 1999 and that you remained close through and after his 2008 conviction for procuring minors for prostitution. It has also been reported that you traveled with Mr. Epstein to his New York residence, the Queen's residence at Balmoral, and to Mr. Epstein's private island in the U.S. Virgin Islands, where you have been accused of abusing minors. This close relationship with Mr. Epstein, coupled with the recently revealed 2011 email exchange in which you wrote to him \"we are in this together,\" further confirms our suspicion that you may have valuable information about the crimes committed by Mr. Epstein and his co-conspirators. As you are well aware, Virginia Roberts Giuffre made several allegations that you abused her when she was just 17 years old. In her 2021 lawsuit, Ms. Giuffre alleged that she was forcibly \"lent out\" to you for sexual purposes on three separate occasions. In addition to these allegations, flight logs document several instances in which you were a passenger on Mr. Epstein's plane between 1999 and 2006, while his criminal activities were ongoing. In response to a subpoena issued to the Epstein estate, the Committee has identified financial records containing notations such as \"massage for Andrew\" that raise serious questions regarding the nature of your relationship with Mr. Epstein and related financial transactions. In her posthumous memoir, Ms. Giuffre expressed a fear of retaliation if she made allegations against you, and writes that the settlement agreement you executed with her restricted her to one-year gag order designed to protect the Crown's reputation. Recent reporting confirms those fears, as law enforcement authorities in the United Kingdom have launched an investigation into allegations that you asked your personal protection officer to \"dig up dirt\" for a smear campaign against Ms. Giuffre in 2011. This fear of retaliation has been a persistent obstacle to many of those who were victimized in their fight for justice. In addition to Mr. Epstein's crimes, we are investigating any such efforts to silence, intimidate, or threaten victims, and are interested in any avenues that may further shed light on these activities. Given these recent events and the appalling allegations that have come to light from Ms. Giuffre's memoir and other reliable sources, the Committee requests that you make yourself available for a transcribed interview with the Committee and provide insight into the crimes of Jeffrey Epstein's co-conspirators. Due to the urgency and gravity of this matter, we ask that you provide a response to the Committee's interest by November 20, 2025. The Committee on Oversight and Government Reform is the principal oversight committee of the House of Representatives and has broad authority to investigate \"any matter\" at \"any time\" under House Rule X. If you have any questions about this request, please contact Committee Democratic staff at (202) 225-5051. Thank you for your prompt attention to this request. The letter is signed by 16 Democratic members of the Committee on Oversight and Government Reform."
    },
    {
        "title": "Starmer says Lammy 'setting out facts to best of his knowledge' on prisoner releases",
        "description": "Sir Keir Starmer has said David Lammy \"set out the facts\" on mistaken prisoner releases \"to the best of his knowledge\" amid questions over what the justice secretary knew and when.",
        "url": "https://news.sky.com/story/starmer-says-lammy-setting-out-facts-to-best-of-his-knowledge-on-prisoner-releases-13465446",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-prison-release_7074290.jpg?20251106205615",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-06 21:02:00",
        "Headline": "The Tories have accused the justice secretary of having \"no clue\" about his own department following confusion over the timeline of what he knew about the fiasco. ",
        "Content": " Sir Keir Starmer has said David Lammy \"set out the facts\" on mistaken prisoner releases \"to the best of his knowledge\" amid questions over what the justice secretary knew and when. Speaking for the first time since it emerged two prisoners were wrongly freed from HMP Wandsworth, the prime minister also said the situation was \"intolerable\" and that he was \"angry and frustrated\". The Met Police announced on Wednesday afternoon that registered sex offender Brahim Kaddour-Cherif, an Algerian national, had been released in error on 29 October. He is still at large. A few hours later it was revealed another prisoner, 35-year-old William \"Billy\" Smith, had been wrongly released on Monday - the same day he was convicted for multiple fraud offences and handed a 45-month jail term. He has since handed himself in.  Asked how the public can have confidence in the justice system, Sir Keir said: \"Let me just say how angry and frustrated I am that these mistakes have been made in releasing people. They're intolerable, and they shouldn't be made. \"A lot of it comes from the burden and the strain on the system because of the failures of the last government. But I recognise it's our job to step up and to fix this.\" \n                  Lammy defends failing to reveal another prisoner had been mistakenly released\n                 \n                  What we know so far about the prisoners freed by mistake\n                 \n                  Wandsworth manhunt latest: Search is on for two prisoners freed by mistake\n                 Sir Keir went on to defend Mr Lammy's handing of the saga, which comes a week on from the mistaken release of Ethiopian sex offender Hadush Kebatu, who has since been deported. Mr Lammy declared on 27 October that stronger prison checks in light of the Kebatu fiasco would come into force immediately. But on Thursday, he said those checks were not in place when Kaddour-Cherif was released two days later. Asked whether he was being truthful last week or on Thursday, Sir Keir said: \"David Lammy can speak for himself on that. \"I'm absolutely clear that he's setting out the facts, to the best of his knowledge and that's the right thing for him to do. \"But whatever the checks, it's intolerable. So, we have to make sure that whatever changes are needed are made.\" Government sources have said the mistakes that triggered the release of Kaddour-Cherif happened at the end of September, before the new regime was put in place. Meanwhile on Thursday night, the Ministry of Justice (MoJ) announced the rollout of \"cutting-edge technology to more prisons\" in order to reduce human error and modernise \"the archaic processes that have led to mistakes\". \"These measures will build on the tough new checks that were brought in last month, and ensure governor oversight of all releases,\" the MoJ said. Mr Lammy, who is also the deputy prime minister, is facing further criticism for failing to reveal that he knew of Kaddour-Cherif's release during PMQs on Wednesday, when he was filing in for Sir Keir who is at the COP summit in Brazil. He was asked repeatedly by Tory leader Kemi Badenoch whether any more asylum seekers had been wrongly released since Kebatu and refused to answer the question. The news broke at the end of PMQs. On Thursday, Mr Lammy said he did not have all the details in the morning and did not want to mislead the public.  He told broadcasters: \"I took the judgment that it is important when updating the House and the country about serious matters like this, that you have all of the details. \"I was not equipped with all of the detail, and the danger is that you end up misleading the House and the general public. \"So that is the judgment I took. I think it's the right judgment.\" But shadow justice secretary Robert Jenrick said: \"David Lammy has either lied or has absolutely no clue what's going on in his department. \"How can the public have confidence in the justice secretary when he can't establish a timeline of events or answer basic questions?\" Kaddour-Cherif was serving a sentence at HMP Wandsworth for trespass with intent to steal, but had previously been convicted for indecent exposure. It is understood he is not an asylum seeker but is in the process of being deported after he overstayed his visa."
    },
    {
        "title": "'Significant hooliganism' within Maccabi Tel Aviv fan base is reason for Aston Villa match ban",
        "description": "Police have revealed to Sky News they advised banning Maccabi Tel Aviv fans from Aston Villa due to \"significant levels of hooliganism\" in the fan base jeopardising safety around the match - rather than threats to visiting Israelis.",
        "url": "https://news.sky.com/story/significant-hooliganism-within-maccabi-tel-aviv-fan-base-is-reason-for-aston-villa-match-ban-13465257",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maccabi-tel-aviv-football_7073185.jpg?20251105204123",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-11-06 17:36:00",
        "Headline": "No subtitle found",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Police have revealed to Sky News they advised banning Maccabi Tel Aviv fans from Aston Villa due to \"significant levels of hooliganism\" in the fan base jeopardising safety around the match - rather than threats to visiting Israelis. This is the first time a West Midlands Police chief has publicly explained the intelligence behind the decision that was angrily opposed by Prime Minister Sir Keir Starmer. The revelation to us comes after MPs on the Home Affairs Committee this week asked for police to explain the decision. The ban was recommended by West Midlands Police, feeding into the decision by the local Safety Advisory Group, led by Birmingham City Council. Excluding Israeli fans was portrayed by the government as antisemitic by turning part of Birmingham into a no-go zone for Thursday night's Europa League match. \"We are simply trying to make decisions based on community safety, driven by the intelligence that was available to us and our assessment of the risk that was coming from admitting travelling fans,\" Chief Superintendent Tom Joyce told Sky News.  \"I'm aware there's a lot of commentary around the threat to the [Maccabi] fans being the reason for the decision. To be clear, that was not the primary driver. That was a consideration. \n                  Public 'at risk' as more inmates sent to open prisons - with another manhunt under way \n                 \n                  Andrew Mountbatten Windsor summoned by US Congress\n                 \n                  Congress letter to Andrew: Read in full\n                 \"We have intelligence and information that says that there is a section of Maccabi fans, not all Maccabi fans, but a section who engage in quite significant levels of hooliganism. \"What is probably quite unique in these circumstances is where as often hooligans will clash with other hooligans and it will be contained within the football fan base. \"We've had examples where a section of Maccabi fans were targeting people not involved in football matches, and certainly we had an incident in Amsterdam last year which has informed some of our decision-making. \"So it is exclusively a decision we made on the basis of the behaviour of a sub-section of Maccabi fans, but all the reaction that could occur obviously formed part of that as well.\"  Maccabi's match at Ajax last year saw attacks on Israeli fans condemned as antisemitic, leading to five people being convicted. But there was also violence from supporters of the Israeli league champions, with anti-Arab chants. Maccabi chief executive Jack Angelides on Wednesday said in a Sky News interview there were \"blatant falsehoods\" spread about the Amsterdam incident and complained about a lack of clarity over the ban from West Midlands Police. \"We are absolutely not saying that in Amsterdam that the only fans causing trouble were the Maccabi fans,\" said Chief Superintendent Joyce. \"But what we were very clearly told is that they played a part in causing trouble particularly a day before the match. \"That absolutely resulted in following day there being attacks on Maccabi fans. \"So it wasn't all one way, but... escalating violence as a consequence is what we were trying to prevent here in Birmingham.\"  More than 700 police officers were deployed for the match from around 10 forces across the country, with pro-Palestinian protests demanding a ban on Israeli teams from European football over the war in Gaza. Ahead of the game, anti-Israeli signs appeared on lampposts, including ones saying \"Zionists not welcome\" - a reference to those backing the existence of the Jewish state of Israel. Asked about the phrase, Chief Superintendent Joyce said: \"Our understanding is that they don't quite contravene hate crime, but they're acceptable as a matter of judgement. \"We've taken legal advice on whether it crosses the threshold to be a hate crime and our understanding is that it does not. And as with many of these things, there is often a question of degree at which something becomes lawful to unlawful and it's a fine judgement.\""
    },
    {
        "title": "Anti-black discrimination 'baked' into Met Police, report finds, as Stephen Lawrence's mother says 'change must take place now'",
        "description": "A review of anti-black racism within the Metropolitan Police has found that discrimination is \"baked\" into its HR systems.",
        "url": "https://news.sky.com/story/anti-black-discrimination-baked-into-met-police-report-finds-as-stephen-lawrences-mother-says-change-must-take-place-now-13465110",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-met-police-new-scotland-yard_7073859.jpg?20251106152255",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-06 14:32:00",
        "Headline": "The Met's systems, leadership, governance and culture are producing racial harm, the internal review concluded.",
        "Content": "A review of anti-black racism within the Metropolitan Police has found that discrimination is \"baked\" into its HR systems. The Met's systems, leadership, governance and culture are producing racial harm, the investigation concluded. Shereen Daniels, the review's author, said discrimination is \"baked\" into the \"institutional design\" of the force. \"Plans that ignore this will always return to the same logic, manage perception, avoid power, thus continuing the cycle,\" she added. The internal review said darker-skinned staff are \"labelled confrontational\" while lighter-skinned staff may receive quicker empathy and leniency. The review draws on more than 40 years of evidence showing how racism has shaped the Met's relationship with black communities and affected black officers and staff. Scotland Yard said it welcomed the report in full and recognised the scale of the challenges set out. Metropolitan Police commissioner Sir Mark Rowley described the report as \"powerful\", adding that it \"calls out that further systemic, structural, cultural change is needed\". Read more:How the world's richest man is boosting the British rightCollins Word of the Year 2025 revealed - do you recognise it? He said: \"London is a unique global city, and the Met will only truly deliver policing by consent when it is inclusive and anti-racist.\" He said the level of trust that black Londoners have in the Met has increased by 10% in two years, but still trails behind others, adding that \"we remain committed to listening, learning, and acting on their concerns\". Sir Mark also pointed to initiatives such as New Met for London and the London Race Action Plan, which he said were helping the Met Police to make progress. The study, 30 Patterns Of Harm: A Structural Review Of Systemic Racism Within The London Metropolitan Police Service, was commissioned from the consultancy HR Rewired. The latest examination of the force comes after Louise Casey's 2023 review, commissioned after the murder of Sarah Everard, found the Met \"institutionally racist, misogynistic and homophobic\". Reviews spanning decades have criticised the Met for being discriminatory, including the MacPherson report (1999) that called it \"institutionally racist\" after officers' mishandling of the Stephen Lawrence case. Mr Lawrence's mother welcomed the new report, but said it contained \"nothing that I did not already know\". Baroness Doreen Lawrence, whose 18-year-old son was killed in a racist attack in southeast London in 1993, said: \"Racism was the reason why Stephen was killed and racism was the reason why the police have failed to find all of his killers. \"Racism must be acknowledged, accepted and confronted in the Met. \"In the three decades since my son's murder there has never been an honest acceptance of racism and how it has affected how our communities are treated. \"The police must stop telling us that change is coming whilst we continue to suffer. That change must take place now.\" Ms Daniels said: \"Systemic racism is not a matter of perception. For almost 50 years, reviews of the Metropolitan Police have documented the harm experienced by black Londoners, officers and staff.\" She said that \"true accountability begins with specificity\", noting that \"anti-blackness is the clearest indicator of organisational dysfunction\". Ms Daniels added: \"The same systems that sustain racial harm against black people also enable other forms of harm. Confronting this is not an act of exclusion but a necessary foundation for safety, fairness and justice for everyone.\" She said that the challenge facing the Met is to \"build the leadership discipline to face what the report has revealed and act on its findings in a way that protects the public rather than the institution\"."
    },
    {
        "title": "One of two prisoners mistakenly released hands himself in",
        "description": "One of the two prisoners mistakenly freed from HMP Wandsworth has handed himself in.",
        "url": "https://news.sky.com/story/one-of-two-prisoners-mistakenly-released-hands-himself-in-sky-news-understands-13464924",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-william-smith-surrey-police_7072988.png?20251106121154",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-06 11:06:00",
        "Headline": "Billy Smith was spotted waving and smiling as he voluntarily made his return to HMP Wandsworth, but the search for another prisoner, sex offender Brahim Kaddour-Cherif, continues.",
        "Content": " One of the two prisoners mistakenly freed from HMP Wandsworth has handed himself in. William \"Billy\" Smith, 35, was wrongly freed from the prison earlier this week but, after a three-day manhunt, Surrey Police have confirmed he handed himself in on Thursday. Meanwhile, the search for sex offender Brahim Kaddour-Cherif continues. He was also mistakenly released from HMP Wandsworth on 29 October. Smith was sentenced to 45 months for multiple fraud offences at Croydon Crown Court on Monday, but was mistakenly released later the same day. Sky News understands that his release came about because of a court error, telling the prison his custodial sentence was a suspended one instead. A correction was initially sent to the wrong person, and by the time it got to the right place, he had left. Surrey Police said: \"We are cancelling our appeal to help find wanted 35-year-old William Smith who was released in error from HMP Wandsworth on Monday, November 3. Smith handed himself in to HMP Wandsworth today.\" \n                  Public 'at risk' as more inmates sent to open prisons - with another manhunt under way \n                 \n                  Andrew Mountbatten Windsor summoned by US Congress\n                 \n                  Congress letter to Andrew: Read in full\n                 Smith seen waving and smiling He was filmed returning to the prison by ITV News. Footage showed Smith waving and smiling as he approached the prison's entrance, where he then spoke to staff. Justice Secretary David Lammy, who came under fire while standing in for Sir Keir Starmer at PMQs, posted a response on X: \"William Smith is back in custody. The spike in mistaken releases is unacceptable. \"We're modernising prison systems - replacing paper with digital tools to cut errors. We're working with police to recapture Brahim Kaddour-Cherif.\" Justice minister Alex Davies-Jones said prison chiefs were being summoned for a meeting on Thursday and a team of digital experts had been tasked with overhauling the \"archaic\" paper-based system of prisoner records. The Prison Governors' Association (PGA) described releases in error as \"neither rare nor hidden\", but said the scale of them was \"deeply concerning\". In total, 262 prisoners were released in error in the year leading up to March 2025.  Hunt for second prisoner The Metropolitan Police has continued to appeal to the public over the whereabouts of Kaddour-Cherif, 24, who the force believes is still in London just over a week after his release. \"He is believed to be in London and has links to Tower Hamlets and Westminster. If you see him, please call 999 immediately,\" the Met said on social media. Read more from Sky News:Nearly 40,000 freed early to tackle overcrowdingHow many prisoners are released by mistake? The Algerian national was in the process of being deported after he overstayed his visa. It is understood he is not an asylum seeker. He was serving a sentence at Wandsworth for trespass with intent to steal, but had previously also been convicted for indecent exposure. His release came just five days after the high-profile release of migrant sex offender Hadush Kebatu from HMP Chelmsford in Essex."
    },
    {
        "title": "Eleven arrested during night of protests as Aston Villa played Maccabi Tel Aviv ",
        "description": "A total of 11 arrests were made during a night of protests as Aston Villa played Maccabi Tel Aviv in Birmingham.",
        "url": "https://news.sky.com/story/six-arrested-ahead-of-the-maccabi-tel-aviv-game-13465320",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maccabi-tel-aviv-aston-villa_7074234.jpg?20251106200106",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-06 19:02:00",
        "Headline": "More than 700 police officers were on duty for the Europa League clash amid concerns over potential disorder.",
        "Content": "A total of 11 arrests were made during a night of protests as Aston Villa played Maccabi Tel Aviv in Birmingham. They were held on a multitude of offences, including: • Shouting racist abuse during a road rage incident at Villa Park • Refusing to remove a face covering • Failing to leave despite being issued with a dispersal order • Shouting abuse towards pro-Israel demonstrators • Shouting abuse towards pro-Palestine demonstrators \n                  Maccabi boss hits out at 'blatant falsehoods' peddled about their fans - but admits work to do on racism\n                 \n                  More than 700 police officers will be deployed for Aston Villa's match against Maccabi Tel Aviv\n                 \n                  Border Force officer charged after 25kg of heroin found at Birmingham Airport\n                 • Shouting racist abuse at a police officer • Possessing Class B drugs • Trying to throw fireworks into the ground Those arrested were all men or boys - ranging in age from 17 to 67. Hundreds of extra officers were on duty for the event. The lead-up to the Europa League match was dominated by controversy and security concerns, leading to a ban on away supporters and large pro-Palestinian protests. Birmingham's Safety Advisory Group announced last month that visiting fans would be barred from attending tonight's game following public safety concerns. The government said it would \"work around the clock\" to ensure both sides could attend - but Maccabi later announced it would decline any away tickets for the clash even if the ban was reversed. The ban was recommended by West Midlands Police, feeding into the decision by the local Safety Advisory Group, led by Birmingham City Council.  Before the match, around 200 protesters including members of the Palestine Solidarity Campaign gathered near Villa Park's Trinity Road stand to demand Israel is excluded from international football. Meanwhile, around 40 protesters, one carrying an Israeli flag, and others carrying posters saying \"keep antisemitism out of football\" gathered on a basketball court on Witton Lane, close to the Doug Ellis Stand, to hear various speakers oppose the ban on Maccabi fans. Five flatbed vehicles were also driven past the ground carrying electronic billboards showing messages opposing antisemitism. Read more:Why were Maccabi Tel Aviv fans banned  'An ancient hate' The Revd Tim Gutmann, founder of Christian Action Against Antisemitism, told the crowd his protest was against \"an ancient hate and an ancient evil that hasn't stopped, and has again risen in our time\". Holding up a placard saying \"Never Again Is Now\", he added: \"As a Christian it's important for me to be here to show that we stand with our fight and stop the hate. \"These are huge moments for a nation. We cannot have no-go zones for Israeli football fans. We can't have no-go zones for Jewish people.\" Another of the messages, beside a Star of David, read \"Ban hatred not fans\" - while another carried a quote from Thierry Henry saying football is not about goals but bringing people together. West Midlands Police had classified the Europa League match \"high risk\" and said the ban on the Maccabi fans was necessary due to \"current intelligence and previous incidents\". That was a reference to Maccabi's match at Ajax last November when their fans were attacked by locals, leading to five convictions. No Maccabi fans were prosecuted. They were seen tearing down Palestinian flags and chanting anti-Arab abuse. Sir Keir Starmer had been among those criticising the supporters' Aston Villa game ban."
    },
    {
        "title": "Mildest Bonfire Night on record as UK experiences 'humid' conditions",
        "description": "This year's Bonfire Night was the mildest ever recorded.",
        "url": "https://news.sky.com/story/mildest-bonfire-night-on-record-as-uk-experiences-humid-conditions-13464955",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bonfire-lewes-fireworks_7073912.jpg?20251106155132",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-06 12:02:00",
        "Headline": "A \"warm sector\" which brought cloudy skies and humid conditions meant temperatures did not plummet very much at all.",
        "Content": "This year's Bonfire Night was the mildest ever recorded. Temperatures for the annual 5 November fireworks only dropped to 14.4C (57.9F), which was recorded in Teddington, southwest London. Statisticians have to go back to 5 November 1938 to see the next mildest, which was a slightly cooler 13.9C at Gordon Castle in Scotland. Find your local weather forecast here  Sky News weather producer Jo Robinson said a \"southerly flow\" had allowed temperatures to climb well above average by day and by night recently. \"We've also mostly been within a warm sector,\" she said, \"with rather cloudy skies, humid conditions, and some rain.\" Read more:Joy of jumping in puddles out of reach for millions of childrenSchool attendance affected by mental health 'for half of young people' She said daytime temperatures had widely reached the mid-teens this week with a high of 18.6C (65.5F) at Chivenor in Devon on Wednesday. \"Average daytime highs for this time of the year are more like 12C in the South and 10C in the North,\" Robinson added. Traditionally, Autumn starts in September and finishes in November, during which time the temperatures get cooler, the days get shorter and quite often the weather gets stormier. The Met Office has warned on Thursday that the warm weather looks unlikely to continue. \"Looking ahead, model ensembles suggest a gradual decline in temperatures, with the most noticeable cooling in eastern areas,\" it said."
    },
    {
        "title": "COP30: A fired up Prince William is a secret weapon only the UK can deploy",
        "description": "It was always going to be fascinating to watch how far Prince William was prepared to go as he addressed world leaders.",
        "url": "https://news.sky.com/story/cop30-a-fired-up-prince-william-is-a-secret-weapon-only-the-uk-can-deploy-13465305",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-william-belem_7074174.jpg?20251106195936",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-11-06 18:44:00",
        "Headline": "The Royal Family have shown consistent leadership on environmental commitments, over several decades. William is now picking up the baton and wanting it to be part of his legacy too.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n It was always going to be fascinating to watch how far Prince William was prepared to go as he addressed world leaders. Heading to the COP30 leaders summit in Belem, Brazil, he wouldn't have been naïve about the pessimism around this UN climate conference. So his speech was his opportunity to issue a unique kind of rallying call, that we should be \"the generation that turned the tide - not for applause, but for the quiet gratitude of those yet to be born\". He was following in his father's footsteps, the King in the past delivering several keynote speeches at COP, receiving varying levels praise and also criticism for being too political.   Acknowledging the King's work in his speech, William enjoys in some ways a greater degree of freedom in what he says, not least because there is now wider global recognition of the issues at stake than when his father started speaking out, but also because of the wider sense of goodwill towards William as a man. He may appear to have a softer approach, but he is no less fired up by the need to act now.  Read more:Earth's lungs are collapsing - is net zero dead? 2025 set to be among hottest years on record At a time when others are turning away from their environmental commitments the one thing you can say is the Royal Family have shown consistent leadership on this, over several decades; William now picking up the baton and wanting it to be part of his legacy too. His reference to the floods in South Wales, while addressing an audience at the gateway to the Amazon, emphasises the desire of his team to capitalise on his international profile and promote his global leadership credentials. His message is one underpinned by a sense of optimism that there are solutions but that shouldn't distract from his cold hard conviction that doing nothing simply isn't an option. A healthy dose of cynicism about the purpose of the Royal Family is obviously always acceptable, especially after the tumultuous few weeks the institution has faced and the issues raised by his uncle Andrew. But with William one of the most globally recognisable faces at that leaders summit, he is a secret weapon only the UK can deploy, just look at the fact Keir Starmer was glued to his side. The UK government aware that William's soft power, popularity and relatability, is essential for those who still need convincing that now is the time to act."
    },
    {
        "title": "Sudan's paramilitary forces agree to US-led proposal for humanitarian ceasefire",
        "description": "Sudan's paramilitary Rapid Support Forces (RSF) say they have agreed to a US-led proposal for a humanitarian ceasefire.",
        "url": "https://news.sky.com/story/sudan8217s-rsf-agrees-to-us-proposal-for-humanitarian-ceasefire-13465131",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-rsf-darfur_7048447.jpg?20251011155616",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-06 15:16:00",
        "Headline": "The war began in 2023 after a clash between paramilitary forces and the army.",
        "Content": " Sudan's paramilitary Rapid Support Forces (RSF) say they have agreed to a US-led proposal for a humanitarian ceasefire. The war began in April 2023 after the Sudanese army and RSF, then partners, clashed over plans to integrate. The agreement to a truce follows reports of mass killings during the fall of Al Fashir, a city which was recently captured by the RSF. Al Fashir, which was under siege for more than 18 months, had been the army's last holdout in the region of Darfur, making its capture a key milestone in the war. That gave RSF de facto control of more than a quarter of the territory. Thousands of people who fled the city as it fell to the RSF were targeted in killing fields around it by the group, after the military's top brass secured their own safe passage. More than 60,000 people were still missing and humanitarians fear that Al Fashir's remaining 200,000 residents were being held hostage by RSF fighters. The US, Saudi Arabia, the United Arab Emirates and Egypt - known as the Quad - have been working on ways to end the war. In September, they had called for a three-month humanitarian truce in Sudan, to be followed by a permanent ceasefire. The RSF have said they are \"looking forward\" to starting talks on a \"cessation of hostilities\".  'Fundamental principles guiding political process' They said in a statement the RSF \"looks forward to implementing the agreement and immediately commencing discussions on the arrangements for a cessation of hostilities and the fundamental principles guiding the political process in Sudan.\" The Sudanese army did not immediately respond to the announcement. White House press secretary Karoline Leavitt had said on Tuesday: \"The United States has actively engaged in efforts to bring about a peaceful resolution to the terrible conflict in Sudan.\" Read more:Genocide unfolding in Darfur - Sudan governmentTens of thousands killed in two days, analysts believe  Previously, the RSF and the Sudanese army had agreed to various ceasefire proposals during their two-and-a-half-year-old war, but none have succeeded. The army-led Security and Defence Council met earlier this week but did not give a definitive answer to the proposal. Influential leaders and allies within the army expressed their disapproval. Millions displaced According to witnesses, the RSF killed and abducted civilians during and after its capture of Al Fashir. Its leader had called on fighters to protect civilians and said violations would be prosecuted. The devastating conflict has killed tens of thousands of people and sparked hunger across the country, while also displacing millions of people."
    },
    {
        "title": "Pirates firing machine guns and rocket-propelled grenades board tanker off Somalia coast",
        "description": "Pirates firing machine guns and rocket-propelled grenades have boarded a tanker off the coast of Somalia.",
        "url": "https://news.sky.com/story/pirates-firing-machine-guns-and-grenades-board-tanker-off-somalia-coast-say-reports-13464796",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eyl-somalia-pirates_7073573.jpg?20251106110842",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-06 08:43:00",
        "Headline": "Greek shipping company Latsco Marine Management has confirmed its tanker, Hellas Aphrodite, was targeted 560 nautical miles southeast of Eyl, Somalia, in the Indian Ocean.",
        "Content": "Pirates firing machine guns and rocket-propelled grenades have boarded a tanker off the coast of Somalia. Greek shipping company Latsco Marine Management confirmed its vessel, Hellas Aphrodite, had been attacked in the early hours of Thursday. The tanker, which was carrying fuel, was en route from India to South Africa when a \"security incident\" took place, the firm said. \"All 24 crew are safe and accounted for and we remain in close contact with them,\" it added in a statement. The crew members took shelter in the ship's \"citadel\", or fortified safe room, and remain there, an official from maritime security company Diaplous said. The United Kingdom Maritime Trade Operations (UKMTO) agency issued an alert to warn ships in the area. It located the vessel 560 nautical miles southeast of Eyl, Somalia, in the Indian Ocean. Eyl became famous in the mid-2000s as the centre of a string of piracy attacks. \n                  Hunting for ISIS: Inside the caves at heart of expanding terror network\n                 \n                  'I don't regret anything,' smiling ISIS militant on death row tells Sky News\n                 \n                  Trump says US airstrikes have 'killed many' ISIS terrorists in Somalia\n                 \"The Master of a vessel has reported being approached by one small craft on its stern. The small craft fired small arms and RPGs [rocket-propelled grenades] towards the vessel,\" UKMTO said in a statement. EU forces move in on tanker The European Union's Operation Atalanta, a counter-piracy mission around the Horn of Africa, said one of its assets was \"close to the incident\" and \"ready to take the appropriate actions\". That EU force has responded to other recent pirate attacks in the area and had issued a recent alert that a pirate group was operating off Somalia and assaults were \"almost certain\" to happen. Private security firm Ambrey has claimed that Somali pirates were operating from an Iranian fishing boat they had seized and had opened fire on the tanker. Read more from Sky News:The secrets behind the return of ISISSomalia is 'safer' than NuneatonISIS militants on death row in Somalia Pirate gangs resume attacks Thursday's attack comes after another vessel, the Cayman Islands-flagged Stolt Sagaland, found itself targeted in a suspected pirate attack that included both its armed security force and the attackers shooting at each other, the EU force said. The vessel's operator Stolt-Nielsen confirmed there was an attempted attack, early on 3 November, which was unsuccessful. Somali pirate gangs have been relatively inactive in recent years. In May 2024, suspected pirates boarded the Liberian-flagged vessel Basilisk. EU naval forces later rescued the 17 crew members. Meanwhile, the last hijacking took place in December 2023, when the Maltese-flagged Ruen was taken by assailants to the Somali coast before Indian naval forces freed the crew and arrested the attackers. Hellas Aphrodite was en route from Sikka, India, to Durban, South Africa. The Malta-flagged tanker is described as an oil/chemical tanker, 183m long and 32m wide, which was built in 2016, according to vesselfinder.com."
    },
    {
        "title": "2025 set to be among hottest years on record, UN scientists warn",
        "description": "This year will likely be the second or third warmest ever on record globally, as an \"unprecedented streak\" of high temperatures persists, UN scientists have warned.",
        "url": "https://news.sky.com/story/2025-set-to-be-among-hottest-years-on-record-un-scientists-warn-13464947",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-global-warming-climate-change_7073826.jpg?20251106143529",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-06 11:49:00",
        "Headline": "The World Meteorological Organisation warns global average temperatures will be near the highest on record, stretching back 176 years, as leaders including Sir Keir Starmer gather in Brazil ahead of the COP30 climate summit.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  This year will likely be the second or third warmest ever on record globally, as an \"unprecedented streak\" of high temperatures persists, UN scientists have warned. It comes as climate talks between world leaders get under way in Brazil. Prime Minister Sir Keir Starmer and Prince William addressed other nations in the Amazonian city of Belem, including Brazil's president Luiz Inacio Lula da Silva and officials from Jamaica, which is still reeling from the devastating Hurricane Melissa. Global average surface temperatures in January to August 2025 were 1.42C above pre-industrial times, before humans started burning fossil fuels at scale, the UN's World Meteorological Organisation has said. The level is closing in on the target set in the landmark Paris Agreement, struck at COP21 in 2015, which aimed to limit global warming to \"well below\" 2C and ideally 1.5C. That means just 10 years later, it is already looking \"virtually impossible\" to stick to the Paris goal without at least temporarily overshooting it, the WMO said. Under this heat, the UK experienced its hottest summer on record, two million people in Pakistan were evacuated from deadly floods and parts of the Amazon rainforest are so dry that once rare wildfires now spread easily. \n                  COP30: A fired up Prince William is a secret weapon only the UK can deploy\n                 \n                  Prince William hails 'world's true action heroes' at Earthshot awards - and gets praise himself from Kylie\n                 \n                  Humans have 'possibly' impacted climate change, Richard Tice admits, after calling the idea 'garbage'\n                 Hilde Heine, president of the coral atoll country of the Marshall Islands in the Pacific, said the \"widespread mortality of coral reefs [is] now seemingly inevitable\" and the Amazon is \"likely not far behind in suffering a similar fate\". WMO chief Celeste Saulo stressed it would be \"still entirely possible and essential\" to bring temperatures down to the 1.5C goal again. That 1.5C limit is \"not just a figure\" but a \"lifeline for Pacific communities and climate-vulnerable nations\" grappling with rising and warming seas, said Shiva Gounden, head of Pacific at Greenpeace Australia Pacific. \"The legal, moral, and political responsibility for climate action has never been stronger, and the ambition leaders take to Belem will define its success.\" Read more from Sky News:Earth's lungs are collapsing - is net zero dead?Few places explain world's refugee crisis as well as this Who's staying away? The leaders are in town over the course of two days, before the COP30 climate summit begins on Monday. But only about 60 are due to attend, compared with more than double the number in some previous years. The heads of the world's three largest drivers of climate change, China, the US and India, are all staying at home. Although many missing leaders will still send officials to the negotiations, diplomats here in Belem are worried that governments are distracted by cost-of-living woes and boosting defence. They also fear US President Donald Trump will seek to water down any deals from afar by threatening countries that agree to anything too ambitious. Leaders 'denying reality' Mariana Menezes, a Brazilian mother caught up in the devastating floods in Rio Grande do Sul last year, said: \"We see world leaders denying reality and making plans to expand fossil fuels. \"These people, who once enjoyed full lives with unforgettable summers and long walks outdoors in their youth, are condemning future generations to lives of pollution and disasters.\" The WMO's annual State of the Climate reports found that the past 11 years - from the Paris Agreement year of 2015 to 2025 - have each been in the top 11 warmest on record. And the past three years have been the three warmest years in the record, stretching back 176 years. In his speech, Sir Keir admitted that the \"consensus is gone\" on climate change - that cross-party unity on the science has splintered at home and globally. He made an economic case for net zero, saying the green transition would create jobs and lower household bills. But despite attacks on climate policies from the Conservatives and Reform, Britons are still concerned about and believe in climate change, and are still buying in to green technology like electric vehicles and heat pumps, Sky News has found."
    },
    {
        "title": "Russian drones: The tiny, kamikaze killing machines being raced rather than used to hunt targets",
        "description": "They're a weapon synonymous with Russia's war in Ukraine, and here the sky is full of them: Drones.",
        "url": "https://news.sky.com/story/the-tiny-kamikaze-killing-machines-being-raced-rather-than-used-to-hunt-targets-13465167",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-drone-racing-samara-russia_7073942.jpg?20251106160737",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-11-06 15:54:00",
        "Headline": "The Kremlin has been quick when it comes to recognising drone racing's potential to boost Russia's military capabilities.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  They're a weapon synonymous with Russia's war in Ukraine, and here the sky is full of them: Drones. Tiny, kamikaze killing machines are zipping through the air in front of me. But I'm not on the battlefield. I'm on a football pitch. And instead of being used to hunt targets, the drones are being raced. I've come to a Russian sports festival in Samara. Drone racing is one of the main events. It's being held after dark in the city's impressive football stadium, which was built for the 2018 World Cup. The drones, and the various on-course obstacles, are lit up in luminous colours for the spectators to follow. Pilots navigate via on-board cameras - the feed of which is projected on the big screen above. \n                  As Russia marks Stalin's political repression, some fear the country's dark history could repeat itself\n                 \n                  Ukrainian troops 'start surrendering' in key city but Kyiv says situation 'dynamic'\n                 \n                  Ukraine will work on ceasefire plan within next 10 days, Volodymyr Zelenskyy says\n                 Irina, 14, is part of the victorious women's team. The schoolgirl only took up the sport two years ago and says she practices two hours every day. When I asked why she liked it, she replied in broken English: \"This has adrenaline and you can be fast.\" The Kremlin has certainly been quick when it comes to recognising the sport's potential to boost Russia's military capabilities. In June, Vladimir Putin announced a new drone flying championship for children as young as seven, dubbed Pilots of the Future, that will begin next year. But here in Samara, race organisers insist the sport is not a recruitment ground. \"Many people have a stereotype that as soon as they start working with drones, flying and learning to pilot them, and receive some kind of certificate proving their skills, they'll be taken away to be drone pilots,\" Ilya Galaev, president of the Russian Drone Racing Federation, said. \"But in reality, of course, that's not true. Everything is voluntary.\" The war wasn't voluntary for everyone competing here, though. Across town at the ice rink, we meet Mikhail, who was mobilised to fight in 2022. He's now competing in a para ice hockey tournament. All players have a physical disability. Like most others here, he lost a leg on the battlefield. \"In August 2023, I was wounded, I stepped on a mine. But I immediately realised that I won't give up and will move on,\" he said. \"For me, it was a kind of motivation to show other people that I didn't become any worse than others who live a full life.\" Read more from Sky News:Pirates firing machine guns board tanker off Somalia coastSudan's RSF agrees to humanitarian ceasefire proposal Para ice hockey is fast-paced. The players move around on specially designed sledges, seemingly unencumbered by their traumatic injuries. Russia doesn't publish the number of its wounded, but it's no coincidence how the sport has become a lot more prominent since the war began. 'Special Military Operations' Many of the teams competing here, like Gvardia from Moscow region, were only formed in the past three years, in response to the injuries soldiers were returning home with. \"Our team consists only of Special Military Operation participants who got injured,\" Gvardia's founder Mikhail Trifonov said. \"I visited hospitals, talked with the guys. And I still visit. I suggest they take up sport. \"It's an integral part of the rehabilitation process, because after receiving such an injury, such a trauma, psychologically one thinks 'what's next'? \"But here you're part of a team, you're with your fellow soldiers.\" The tournament says a lot about how the war is presented in Russia. Far from hiding veterans' traumas, the Kremlin is showcasing them, portraying its wounded as the pinnacle of society. Enlistment inspiration The teams here are competing for the Heroes of Our Time Cup, and in the entrance hall to the ice rink, there are military recruitment leaflets urging people to sign up. The authorities clearly hope the event will inspire others to enlist. It also says a lot about what three and a half years of war have done to Russia. Wherever you go now, the consequences of the conflict are never far away."
    },
    {
        "title": "US soldiers given food bank advice and could go without pay amid government shutdown",
        "description": "US soldiers in Germany may not receive their November pay and have been given food bank advice as a government shutdown entered a record 37th day.",
        "url": "https://news.sky.com/story/us-soldiers-given-food-bank-advice-and-could-go-without-pay-amid-government-shutdown-13464784",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-grafenwoehr-bavaria_7073483.jpg?20251106090146",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-06 08:21:00",
        "Headline": "Troops received last-minute funding for October - but Scott Bessent, the US treasury secretary, has warned that by November \"our troops and service members who are willing to risk their lives aren't going to be able to get paid\".",
        "Content": "US soldiers in Germany may not receive their November pay and have been given food bank advice as a government shutdown entered a record 37th day. Around 37,000 US soldiers stationed in the country face uncertainty over November salary payments. The Pentagon has warned US troops may not receive mid-month wages despite last-minute funding for October. US treasury secretary Scott Bessent told CBS News: \"I think we'll be able to pay them beginning in November, but by 15 November our troops and service members who are willing to risk their lives aren't going to be able to get paid.\" The US army also published guidance on its website directing soldiers in Germany to emergency social benefits, loans, and food sharing organisations including Tafel Deutschland - the umbrella organisation of more than 970 food banks in the country - as well as the app Too Good To Go. Some of the information was later removed from the web page of the garrison in Bavaria, but some of the listings for services for those affected by the shutdown remained on a separate document. Read more: What impact is the shutdown having? 👉 Follow Trump100 on your podcast app 👈 Cuts to flights The US federal government shutdown became the longest in history on Wednesday - with Sean Duffy, the transportation secretary, announcing he was ordering a 10% cut in flights at 40 major US airports from Friday. Tens of thousands of flights have been delayed because of widespread air traffic control shortages, with the shutdown forcing 13,000 air traffic controllers and 50,000 Transportation Security Administration agents to work without pay. Airlines have said at least 3.2 million travellers have already been impacted by air traffic control shortages. \"Our job is to make sure we make the hard decisions to continue to keep the airspace safe,\" said Mr Duffy. \"When we see pressures building in these 40 markets, we just can't ignore it,\" said Bryan Bedford, head of the Federal Aviation Administration. \"We can take action today to prevent things from deteriorating so the system is extremely safe today, will be extremely safe tomorrow.\" The government did not name the 40 sites affected, but the cuts are expected to hit the busiest airports, including those serving New York City, Washington DC, Chicago, Atlanta, Los Angeles and Dallas. This would reduce as many as 1,800 flights and more than 268,000 airline seats, according to aviation analytics firm Cirium. Read more from Sky News:JD Vance's reaction to a big 24 hours in US politics is tellingTesla shareholders may be about to do something never seen Shutdown longest in history The shutdown, which started on 1 October, has been triggered by politicians failing to pass new funding bills as a stand-off between the Democrats and Republicans over healthcare spending continues. It has now eclipsed the 35-day federal closure in late 2018 and early 2019 during Donald Trump's first term - disrupting the lives of millions of Americans as all non-essential parts of government are frozen. Republicans hold a 53-47 majority in the Senate. But 60 votes are needed to pass any funding bill. The Trump administration has sought to ramp up the pressure on Democrats to end the shutdown and has increasingly raised the spectre of dramatic aviation disruptions to force them to vote to reopen the government. However, Democrats contend Republicans are to blame for refusing to negotiate over key health care subsidies."
    },
    {
        "title": "At least 114 dead after Philippines typhoon, as state of emergency declared and more than 100 still missing",
        "description": "The Philippines has declared a state of emergency after a typhoon left at least 114 dead and 127 missing.",
        "url": "https://news.sky.com/story/at-least-114-dead-after-philippines-typhoon-as-state-of-emergency-declared-and-more-than-100-still-missing-13464723",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-typhoon-kalmaegi-cebu_7073360.jpg?20251106043434",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-06 04:20:00",
        "Headline": "Typhoon Kalmaegi made landfall on Tuesday, striking the country's central provinces. It is the deadliest natural disaster to hit the Philippines this year.",
        "Content": "The Philippines has declared a state of emergency after a typhoon left at least 114 dead and 127 missing. Philippine President Ferdinand Marcos Jr issued the \"state of national calamity\" declaration after a meeting with disaster officials on Thursday. It comes after Typhoon Kalmaegi made landfall on Tuesday, striking the country's central provinces. It is the deadliest natural disaster to hit the Philippines this year. After reaching the country, the storm hit with sustained winds of 87mph and gusts of up to 121mph. Authorities in Vietnam, meanwhile, are bracing for Kalmaegi's approach. Forecasters warned that Ho Chi Minh City faces a heightened risk of severe flooding, as high tides would coincide with the expected heavy rainfall from the typhoon. So far, the deaths recorded were mainly as a result of flooding in flash floods. The country's civil defence office said that at least 71 people died in Cebu. Cebu, a province of more than 2.4 million people, was still recovering from a 6.9 magnitude earthquake on 30 September, which left at least 79 people dead. A state of calamity was previously declared there to allow authorities to disburse emergency funds more rapidly.  The province's governor Pamela Baricuatro told the Associated Press on Thursday: \"We did everything we can for the typhoon but, you know, there are really some unexpected things like flash floods.\" Almost two million people were affected by the tropical cyclone, with more than 560,000 displaced and almost 450,000 evacuated to emergency shelters. Six people who died as a result of the typhoon were killed when a Philippine air force helicopter crashed in the southern province of Agusan del Sur on Tuesday. Read more from Sky News:What's the difference between a cyclone, typhoon and hurricane?Elon Musk is boosting the British right - and this shows how The crew was on its way to provide humanitarian aid to provinces affected, the military said, without giving the cause of the crash. The Philippines is one of the world's most disaster-prone countries. It is affected by around 20 typhoons and storms each year, is also often hit by earthquakes, and has more than a dozen active volcanoes."
    },
    {
        "title": "Nancy Pelosi, the first woman in Speaker's office, to stand down after 40 years in US Congress",
        "description": "Nancy Pelosi, the first woman in the Speaker's office, has announced her retirement from American politics after a nearly 40-year career.",
        "url": "https://news.sky.com/story/nancy-pelosi-the-first-woman-in-speakers-office-to-stand-down-after-40-years-in-us-congress-13465107",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-nancy-pelosi-iran_6951948.jpg?20250627150534",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-06 14:16:00",
        "Headline": "The veteran Democrat politician, who was an architect of the Affordable Care Act, will not seek re-election to Congress.",
        "Content": "Nancy Pelosi, the first woman in the Speaker's office, has announced her retirement from American politics after a nearly 40-year career. The 85-year-old, who has represented San Francisco since 1987, revealed her decision two days after Californian voters overwhelmingly approved \"Proposition 50\", a state redistricting effort aimed at flipping five House seats to Democrats in the midterm elections next year. \"I will not be seeking re-election to Congress,\" Pelosi said in a video address to voters. \"With a grateful heart, I look forward to my final year of service as your proud representative. \"My message to the city I love is this: San Francisco, know your power,\" she said. \"We have made history. We have made progress. We have always led the way.\" \"And now we must continue to do so by remaining full participants in our democracy and fighting for the American ideals we hold dear.\" Mrs Pelosi served as the 52nd Speaker of the House of Representatives from 2007 to 2011, and again from 2019 to 2023, and was the first woman elected to the role. She was also the first woman to lead a major political party in either chamber of Congress, heading the House Democrats from 2003 to 2023. During her second tenure as Speaker, the House twice impeached Donald Trump - in December 2019, and January 2021 - though the Senate acquitted him both times. And in February 2020, during President Trump's State of the Union address, she famously tore up her official copy of it, arguing \"it was such a dirty speech\". An architect of the Affordable Care Act, Mrs Pelosi has also been credited with quietly persuading Joe Biden to withdraw from the 2024 presidential race. US correspondent Nancy Pelosi was a central figure during two of the most turbulent political periods – the Trump presidency and President Biden’s departure from the 2024 election. During the Trump era, she emerged as the Democratic Party’s most visible counterweight to the administration. She led the House through two impeachments and became was prime target for those who stormed the Capitol Building on January 6th 2021. In 2024, her behind-the-scenes influence was decisive as Democrats confronted Joe Biden’s declining political position. While careful in her public statements, her subtle signalling to leaders and donors accelerated his departure from the race. From a wider perspective, her retirement marks the end of one of the most influential congressional careers in modern US politics. As the first woman Speaker of the House, she shaped legislative priorities for two decades and her departure signals a generational shift within the Democratic Party. Now her political contemporaries have paid tribute. Former President Joe Biden said America \"will always be grateful\" to her. He posted on X: \"I often said Nancy Pelosi was the best Speaker of the House in American history - it's why I awarded her the Presidential Medal of Freedom. \"When I was President, we worked together to grow our economy, create millions of jobs, and make historic investments in our nation's future.\" California's Democrat Governor Gavin Newsom, said she \"inspired generations\" and \"set the standard for what public service should be\". While party colleague, Senator Adam Schiff, who also represents California, called her \"the greatest Speaker in American history\" and highlighted her \"tenacity, intellect, strategic acumen and fierce advocacy\". And Representative Don Beyer of Virginia, another Democrat, said she was \"a major figure in American history\", a \"barrier breaker\", and \"one of our most brilliant and accomplished leaders\".  First elected in 1987, she came into politics later in life, and has long resisted calls to step aside, turning questions about her future into spirited rebuttals. But she's faced new challenges in recent years and her decision to step down is not fully unexpected. Read more:JD Vance's telling reaction to a big 24 hours in US politicsWhat Zohran Mamdani's win means for Trump Last year she fractured her hip when she fell during a European trip, and was rushed to a military hospital for surgery. And in 2022, her husband Paul Pelosi was gravely injured by a home intruder who beat him over the head with a hammer and demanded to know \"Where is Nancy?\" 👉 Tap here to follow Trump100 wherever you get your podcasts👈 Nonetheless, she's maintained a rigorous political schedule of public events and party fundraisers. Now eyes will turn to the question of her successor, both at home in San Francisco, and in the US Congress where she plays a behind-the-scenes leadership role. She's already faced a potential primary challenge from Saikat Chakrabarti, a left-wing newcomer who played a part in the rise of Alexandria Ocasio-Cortez - another rising star in the progressive firmament."
    },
    {
        "title": "Elon Musk's $1 trillion pay package approved by Tesla",
        "description": "Elon Musk could be on track for a $1trn (&#163;761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years.",
        "url": "https://news.sky.com/story/elon-musks-1-trillion-pay-package-approved-by-tesla-13464835",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "US",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-06 09:46:00",
        "Headline": "Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Elon Musk could be on track for a $1trn (£761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years. The world's richest man has the potential to become a trillionaire after the controversial plans were approved by 75% of the company's shareholders. However, it won't be easy. As part of the agreement, Musk will need to deliver 20 million Tesla vehicles over the next decade - more than double the number churned out over the past 12 years. He will be tasked with dramatically increasing the company's valuation and operating profits.  Another requirement is for Tesla to roll out one million AI-powered robots - despite the fact it hasn't released a single one so far. Musk will also need to come up with a succession plan on who will replace him as the chief executive of Tesla. As each step is successfully completed, he will receive more company shares and his ownership stake will rise - potentially from 13% now to almost 29%. \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 \n                  How the world's richest man is boosting the British right\n                 And even if Musk falls short of some of these targets, he could end up earning a lot of money. Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet. That title belongs to John D. Rockefeller, the railroad titan who had wealth of $630bn (£480bn) back in 1913 - when adjusted for inflation.  Why? Now is the moment Tesla wants to innovate, develop into robotics, self-driving and embrace the growth of artificial intelligence (AI). It's seeking a visionary leader to spearhead this move. And a lot of Tesla's market value is tied up in this ambition. Tesla's board of directors, who oversee the management of the business, are adamant that only Musk can make the lofty ambitions a reality. Some believe there's no one else like Musk. More shares in the company are \"critical to keep Musk at the helm to lead Tesla through the most critical time in the company's history\", said financial services firm Wedbush. \"We believe this was the smart move by the board to lay out these incentives/pay package at this key time as the biggest asset for Tesla is Musk ... and with the AI revolution, this is a crucial time for Tesla ahead with autonomous and robotics front and centre.\" Read more money news:Bank of England holds interest rateM&S reveals cost of cyber attack   Opposition Not everyone is in favour of the pay package. Major investor advice firm Institutional Shareholder Services (ISS) warned the 10-year pay agreement reduces the board's ability \"to meaningfully adjust future pay levels in the event of unforeseen events or changes in either the performance or strategic focus of the company over the next decade\".  In a note, ISS said: \"The high value of each tranche could also potentially undermine Musk's desire to achieve all goals and create significant value for shareholders\", and that the goals \"lack precision\".  Mr Musk has described ISS and another major adviser, Glass Lewis, as \"corporate terrorists\". There was speculation he would walk away from the business if the package was not agreed on. "
    },
    {
        "title": "Arsenal fan Mamdani can't expect any easy wins - even the home games",
        "description": "As an image makeover, I suppose it was instant.",
        "url": "https://news.sky.com/story/arsenal-fan-mamdani-cant-expect-any-easy-wins-even-the-home-games-13464708",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-zohran-mamdani-arsenal_7073348.jpg?20251106020838",
        "type": "US",
        "Author": "James Matthews",
        "Date Published": "2025-11-06 00:06:00",
        "Headline": "Like his beloved Arsenal, Zohran Mamdani is on a winning streak. But he will have to fight hard for future victories, including within his own party.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n  As an image makeover, I suppose it was instant. I swear we saw a vision of Zohran Mamdani watching Sky Sports News transfer deadline day coverage, top on, texting the group chat about late medicals and beating his chest, still, about Thierry Henry to Barcelona. Yes, New York's new mayor is an Arsenal supporter. He told me as much when I introduced myself from Sky News. He said in his youth he'd been a viewer of Sky's transfer deadline day, when fans watch live coverage of their club's transfer activity. In a \"morning after\" news conference, it was pleasant chat - evidence of the everyman anti-politician who'd sold personality with the politics. If it's a game they all play, some do it better than others. But then there was my question to him. What message did his victory send to his own Democratic Party, members of which have been cool on his left-wing politics? Also, what did it mean to Donald Trump? He bit on the Trump part of the question but dodged the other bit that alluded to a reluctant Democratic old guard. It is a pressing issue for a party clutching for a strategy to beat Trump, and yet pushing away the left-wing Mamdani, one of their own, who found the formula in New York.  Democrats have a big square to circle Clearly, it isn't a party discussion to be aired publicly, which means there's no coherent strategy. Privately, however, it's a circle they must surely square: how to harness the strategy and success of a leftist agenda that landed in New York, and make it work across America. Mamdani's victory will build influence on the left of the movement - and its tangible success to counter a party establishment dismissing its progressive wing as toxic to the brand. Mamdani held his victory news conference in the shadow of the \"Unisphere\", a representation of the Earth in Flushing, Queens. Read more from Sky News:Trump100: The night Democrats fought backUS plane crash leaves at least 11 deadFrom rapper to New York mayor, who is Mamdani? The caption encouraged by his handlers was, presumably, something to do with the \"world at his feet\". \"World of difficulty\" would be an alternative that might not find an argument. For the Arsenal supporter at the heart of US politics, there is no easy win - even in the home games."
    },
    {
        "title": "Meta told to stop using PG-13 film-style ratings over Instagram content",
        "description": "The Motion Picture Association (MPA) in the US has sent Meta a cease-and-desist letter over its use of \"PG-13\" when referring to content moderation on Instagram.",
        "url": "https://news.sky.com/story/meta-told-to-stop-using-pg-13-film-style-ratings-over-instagram-content-13464940",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-meta-instagram_7073644.jpg?20251106114734",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-06 11:40:00",
        "Headline": "The MPA's film ratings are decided on by parents who watch the films and then evaluate them to come up with a rating.",
        "Content": "\n          Science and technology reporter\n       The Motion Picture Association (MPA) in the US has sent Meta a cease-and-desist letter over its use of \"PG-13\" when referring to content moderation on Instagram. In October, the social media giant announced that teenagers using its platform would now only see content that abides by a PG-13 cinema rating. Now, it has been told to \"immediately and permanently\" stop using the rating, with the MPA accusing Meta of being \"highly misleading\". The MPA's film ratings, which range from G (suitable for all ages) to NC-17 (18+), are decided on by parents who watch the films and then evaluate them to come up with a rating. \"Meta's attempts to restrict teen content literally cannot be 'guided by' or 'aligned with' the MPA's PG-13 movie rating because Meta does not follow this curated process,\" said the association's letter, seen by Sky News. \"Instead, Meta's content restrictions appear to rely heavily on artificial intelligence or other automated technology measures.\" The MPA is a US trade body that describes itself on its website as the \"leading advocate of the global film, television, and streaming industry\". \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 \n                  Mark Zuckerberg sues Meta - but he's not who you think\n                 Naresh Kilaru, a lawyer for the MPA, said in the 28 October letter to Meta: \"The MPA has worked for decades to earn the public's trust in its rating system.\" \"Any dissatisfaction with Meta's automated classification will inevitably cause the public to question the integrity of the MPA's rating system,\" Mr Kilaru said. Read more from Sky News:How the world's richest man is boosting the British rightTech giants warn Reeves of IPO 'flight risk' over budget  The letter to Jennifer Newstead, Meta's chief legal officer, asked Meta to immediately disassociate Instagram's Teen Accounts and AI tools from the MPA rating system and to refrain from any use of the PG-13 mark. It asked for a resolution by 3 November. On 6 November, however, Sky News checked and was still presented with a message on Instagram saying: \"Instagram Teen Accounts will be guided by 13+ movie ratings.\" Meta told Sky News that parents say they want to \"better understand\" what their teenagers are seeing on Instagram. \"To make things simpler for them, we updated our teen content policies to be closer to PG-13 movie standards - which parents already know,\" said a Meta spokesperson. \"We know social media isn't the same as movies, but we made this change to support parents, and we hope to work with the MPA to continue bringing families this clarity.\""
    },
    {
        "title": "US soldiers given food bank advice and could go without pay amid government shutdown",
        "description": "US soldiers in Germany may not receive their November pay and have been given food bank advice as a government shutdown entered a record 37th day.",
        "url": "https://news.sky.com/story/us-soldiers-given-food-bank-advice-and-could-go-without-pay-amid-government-shutdown-13464784",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-grafenwoehr-bavaria_7073483.jpg?20251106090146",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-06 08:21:00",
        "Headline": "Troops received last-minute funding for October - but Scott Bessent, the US treasury secretary, has warned that by November \"our troops and service members who are willing to risk their lives aren't going to be able to get paid\".",
        "Content": "US soldiers in Germany may not receive their November pay and have been given food bank advice as a government shutdown entered a record 37th day. Around 37,000 US soldiers stationed in the country face uncertainty over November salary payments. The Pentagon has warned US troops may not receive mid-month wages despite last-minute funding for October. US treasury secretary Scott Bessent told CBS News: \"I think we'll be able to pay them beginning in November, but by 15 November our troops and service members who are willing to risk their lives aren't going to be able to get paid.\" The US army also published guidance on its website directing soldiers in Germany to emergency social benefits, loans, and food sharing organisations including Tafel Deutschland - the umbrella organisation of more than 970 food banks in the country - as well as the app Too Good To Go. Some of the information was later removed from the web page of the garrison in Bavaria, but some of the listings for services for those affected by the shutdown remained on a separate document. Read more: What impact is the shutdown having? 👉 Follow Trump100 on your podcast app 👈 Cuts to flights The US federal government shutdown became the longest in history on Wednesday - with Sean Duffy, the transportation secretary, announcing he was ordering a 10% cut in flights at 40 major US airports from Friday. Tens of thousands of flights have been delayed because of widespread air traffic control shortages, with the shutdown forcing 13,000 air traffic controllers and 50,000 Transportation Security Administration agents to work without pay. Airlines have said at least 3.2 million travellers have already been impacted by air traffic control shortages. \"Our job is to make sure we make the hard decisions to continue to keep the airspace safe,\" said Mr Duffy. \"When we see pressures building in these 40 markets, we just can't ignore it,\" said Bryan Bedford, head of the Federal Aviation Administration. \"We can take action today to prevent things from deteriorating so the system is extremely safe today, will be extremely safe tomorrow.\" The government did not name the 40 sites affected, but the cuts are expected to hit the busiest airports, including those serving New York City, Washington DC, Chicago, Atlanta, Los Angeles and Dallas. This would reduce as many as 1,800 flights and more than 268,000 airline seats, according to aviation analytics firm Cirium. Read more from Sky News:JD Vance's reaction to a big 24 hours in US politics is tellingTesla shareholders may be about to do something never seen Shutdown longest in history The shutdown, which started on 1 October, has been triggered by politicians failing to pass new funding bills as a stand-off between the Democrats and Republicans over healthcare spending continues. It has now eclipsed the 35-day federal closure in late 2018 and early 2019 during Donald Trump's first term - disrupting the lives of millions of Americans as all non-essential parts of government are frozen. Republicans hold a 53-47 majority in the Senate. But 60 votes are needed to pass any funding bill. The Trump administration has sought to ramp up the pressure on Democrats to end the shutdown and has increasingly raised the spectre of dramatic aviation disruptions to force them to vote to reopen the government. However, Democrats contend Republicans are to blame for refusing to negotiate over key health care subsidies."
    },
    {
        "title": "Sudan's paramilitary forces agree to US-led proposal for humanitarian ceasefire",
        "description": "Sudan's paramilitary Rapid Support Forces (RSF) say they have agreed to a US-led proposal for a humanitarian ceasefire.",
        "url": "https://news.sky.com/story/sudan8217s-rsf-agrees-to-us-proposal-for-humanitarian-ceasefire-13465131",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sudan-rsf-darfur_7048447.jpg?20251011155616",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-06 15:16:00",
        "Headline": "The war began in 2023 after a clash between paramilitary forces and the army.",
        "Content": " Sudan's paramilitary Rapid Support Forces (RSF) say they have agreed to a US-led proposal for a humanitarian ceasefire. The war began in April 2023 after the Sudanese army and RSF, then partners, clashed over plans to integrate. The agreement to a truce follows reports of mass killings during the fall of Al Fashir, a city which was recently captured by the RSF. Al Fashir, which was under siege for more than 18 months, had been the army's last holdout in the region of Darfur, making its capture a key milestone in the war. That gave RSF de facto control of more than a quarter of the territory. Thousands of people who fled the city as it fell to the RSF were targeted in killing fields around it by the group, after the military's top brass secured their own safe passage. More than 60,000 people were still missing and humanitarians fear that Al Fashir's remaining 200,000 residents were being held hostage by RSF fighters. The US, Saudi Arabia, the United Arab Emirates and Egypt - known as the Quad - have been working on ways to end the war. In September, they had called for a three-month humanitarian truce in Sudan, to be followed by a permanent ceasefire. The RSF have said they are \"looking forward\" to starting talks on a \"cessation of hostilities\".  'Fundamental principles guiding political process' They said in a statement the RSF \"looks forward to implementing the agreement and immediately commencing discussions on the arrangements for a cessation of hostilities and the fundamental principles guiding the political process in Sudan.\" The Sudanese army did not immediately respond to the announcement. White House press secretary Karoline Leavitt had said on Tuesday: \"The United States has actively engaged in efforts to bring about a peaceful resolution to the terrible conflict in Sudan.\" Read more:Genocide unfolding in Darfur - Sudan governmentTens of thousands killed in two days, analysts believe  Previously, the RSF and the Sudanese army had agreed to various ceasefire proposals during their two-and-a-half-year-old war, but none have succeeded. The army-led Security and Defence Council met earlier this week but did not give a definitive answer to the proposal. Influential leaders and allies within the army expressed their disapproval. Millions displaced According to witnesses, the RSF killed and abducted civilians during and after its capture of Al Fashir. Its leader had called on fighters to protect civilians and said violations would be prosecuted. The devastating conflict has killed tens of thousands of people and sparked hunger across the country, while also displacing millions of people."
    },
    {
        "title": "Elon Musk's $1 trillion pay package approved by Tesla",
        "description": "Elon Musk could be on track for a $1trn (&#163;761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years.",
        "url": "https://news.sky.com/story/elon-musks-1-trillion-pay-package-approved-by-tesla-13464835",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-06 09:46:00",
        "Headline": "Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Elon Musk could be on track for a $1trn (£761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years. The world's richest man has the potential to become a trillionaire after the controversial plans were approved by 75% of the company's shareholders. However, it won't be easy. As part of the agreement, Musk will need to deliver 20 million Tesla vehicles over the next decade - more than double the number churned out over the past 12 years. He will be tasked with dramatically increasing the company's valuation and operating profits.  Another requirement is for Tesla to roll out one million AI-powered robots - despite the fact it hasn't released a single one so far. Musk will also need to come up with a succession plan on who will replace him as the chief executive of Tesla. As each step is successfully completed, he will receive more company shares and his ownership stake will rise - potentially from 13% now to almost 29%. \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 \n                  How the world's richest man is boosting the British right\n                 And even if Musk falls short of some of these targets, he could end up earning a lot of money. Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet. That title belongs to John D. Rockefeller, the railroad titan who had wealth of $630bn (£480bn) back in 1913 - when adjusted for inflation.  Why? Now is the moment Tesla wants to innovate, develop into robotics, self-driving and embrace the growth of artificial intelligence (AI). It's seeking a visionary leader to spearhead this move. And a lot of Tesla's market value is tied up in this ambition. Tesla's board of directors, who oversee the management of the business, are adamant that only Musk can make the lofty ambitions a reality. Some believe there's no one else like Musk. More shares in the company are \"critical to keep Musk at the helm to lead Tesla through the most critical time in the company's history\", said financial services firm Wedbush. \"We believe this was the smart move by the board to lay out these incentives/pay package at this key time as the biggest asset for Tesla is Musk ... and with the AI revolution, this is a crucial time for Tesla ahead with autonomous and robotics front and centre.\" Read more money news:Bank of England holds interest rateM&S reveals cost of cyber attack   Opposition Not everyone is in favour of the pay package. Major investor advice firm Institutional Shareholder Services (ISS) warned the 10-year pay agreement reduces the board's ability \"to meaningfully adjust future pay levels in the event of unforeseen events or changes in either the performance or strategic focus of the company over the next decade\".  In a note, ISS said: \"The high value of each tranche could also potentially undermine Musk's desire to achieve all goals and create significant value for shareholders\", and that the goals \"lack precision\".  Mr Musk has described ISS and another major adviser, Glass Lewis, as \"corporate terrorists\". There was speculation he would walk away from the business if the package was not agreed on. "
    },
    {
        "title": "Were it not for the upcoming budget, interest rates could have been cut",
        "description": "Perhaps it's not surprising that, the day after Guy Fawkes night, the Bank of England held off from lighting any economic fireworks at Threadneedle Street on Thursday.",
        "url": "https://news.sky.com/story/were-it-not-for-the-upcoming-budget-interest-rates-could-have-been-cut-13464976",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-economy-bank_6965901.png?20251106133243",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-11-06 12:20:00",
        "Headline": "Food inflation, cyberattacks, and global trade factors are among the factors being considered by the rate-setters at the Bank of England.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Perhaps it's not surprising that, the day after Guy Fawkes night, the Bank of England held off from lighting any economic fireworks at Threadneedle Street on Thursday. No interest rate cut. No dramatic change to the economic forecast. Money blog: Good news for mortgage holders could be on way After all, the budget is coming up in only a few weeks and it threatens to be a very big one indeed, chock full of tax rises and spending cuts that could cast a pall over economic growth. As it usually does when something like that is looming, the Bank chose to pull its head back, turtle-like, into its shell. But there's no escaping the fact that rather a lot is going on beneath the surface, both at the Bank and the economy itself. We are, for one thing, reckoning with the consequences of a trade war ignited by Donald Trump, which is already having a far-reaching impact on the flows of goods around the planet. Global and cyber factors  Consignments that once upon a time would pass from China to the US are now being diverted to other countries with lower tariffs, and there are few countries in the world with lower tariffs, particularly on China, than the UK. \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  Bank of England governor to join Reeves on key China visit\n                 \n                  Brexit has 'weighed' on economy and UK 'must rebuild relations' with EU - Bank of England governor\n                 This flood of cheap Chinese imports is becoming a notable economic factor, the Bank said in the Monetary Policy Report (MPR) published alongside its decision on Thursday. Nor is that the only thing going on beneath the surface. For the first time ever, the Bank has had to reckon with a cyberattack having a bearing on its GDP forecasts, with the Jaguar Land Rover shutdown markedly affecting GDP in recent months. Food inflation is proving stubbornly high - and not just any food inflation. The Bank's MPR recounts that \"inflation among four components - butter, beef and veal, chocolate and coffee - which make up only 10% of the food CPI basket, is currently contributing nearly two percentage points to overall food inflation\". Then there are the bigger macroeconomic forces it is trying to gauge. How worried should it be, for instance, that with inflation at 3.8%, households are increasingly coming to expect that high inflation will persist rather than coming down? How much do those inflation expectations trigger higher wage settlements and, in turn, higher inflation further down the line? Reasons to cut On the flip side, the economy is hardly motoring right now. The Bank expects insipid growth of 1.2% next year. This is a long, long way from the government's stated ambition to have the strongest growth in the G7. And growth is, in part at least, weaker because of higher interest rates. On balance, it's hard not to escape the conclusion that were we not a few weeks away from a budget, the Bank would have cut rates. But as things stand, that rate cut, heavily hinted at on Thursday, might have to wait until December or, maybe, February."
    },
    {
        "title": "Bank of England says it expects inflation has peaked as it holds interest rate",
        "description": "The Bank of England has voted to leave interest rates on hold at 4%, but a knife-edge split on its Monetary Policy Committee suggests a cut may be coming very soon.",
        "url": "https://news.sky.com/story/interest-rates-held-after-knife-edge-vote-13464939",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-andrew-bailey-bank-of-england_7056636.jpg?20251020170630",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-11-06 11:39:00",
        "Headline": "Governor Andrew Bailey says rates are \"on a gradual path downwards\".",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n The Bank of England has voted to leave interest rates on hold at 4%, but a knife-edge split on its Monetary Policy Committee suggests a cut may be coming very soon. The nine members of the Bank's MPC voted 5-4 in favour of leaving borrowing costs unchanged, in the face of higher-than-usual inflation in recent months. Money blog: Good news for mortgage holders could be on wayThe Bank's chief mandate is to keep inflation - the rate at which prices have changed over the past year - as close as possible to 2% and, all else equal, higher interest rates tend to bring down prices.However, consumer price index inflation was at 3.8% in September, higher than anywhere else in the G7 group of industrialised nations.   However, unveiling a new set of economic forecasts today, the Bank said it expects inflation has now peaked, and will drop in the coming months, settling a little bit above 2% in two years' time. The Bank's decision comes only three weeks ahead of the budget, which will lead some to suspect that it held off a rate cut so it could reassess the state of the economy post-budget. The chancellor has signalled that she is likely to raise taxes and trim back her spending plans - something that could further dampen economic growth. \n                  Were it not for the upcoming budget, interest rates could have been cut\n                 \n                  Watch live: Final interest rate decision before budget revealed by Bank of England\n                 \n                  Reeves kicks off hunt for £314,000-a-year-bank watchdog chief\n                 The governor, Andrew Bailey, said: \"We held interest rates at 4% today. We still think rates are on a gradual path downwards but we need to be sure that inflation is on track to return to our 2% target before we cut them again.\" The Bank said that, so far at least, tariffs had contributed to slightly lower than expected inflation. It said it expected gross domestic product growth of 1.2% next year and 1.6% the year after. This is all predicated on the presumption that the Bank brings its interest rates down from 4% to 3.5% next year. The fact that four MPC members voted for a cut in rates - and the hint from the governor that more cuts are coming - will contribute to speculation that the Bank may cut rates as soon as next month, shortly before Christmas."
    },
    {
        "title": "Tech giants warn Reeves of IPO 'flight risk' over budget",
        "description": "Executives from some of Britain's most valuable technology start-ups have delivered a bombshell warning to Rachel Reeves that tax-raising measures in this month's budget could force them to cancel plans to list their companies on the London Stock Exchange.",
        "url": "https://news.sky.com/story/tech-giants-warn-reeves-of-ipo-flight-risk-over-budget-13464757",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-revolut-bank-card_6557722.png?20240518084401",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-06 06:58:00",
        "Headline": "Bosses of companies including Revolut, Oaknorth, Zilch and ClearScore have told Rachel Reeves that new fiscal measures could force them to cancel UK listing plans in a letter seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Executives from some of Britain's most valuable technology start-ups have delivered a bombshell warning to Rachel Reeves that tax-raising measures in this month's budget could force them to cancel plans to list their companies on the London Stock Exchange. Sky News has obtained a letter sent this week by companies including Revolut, Funding Circle, OakNorth, Clearscore and Quantexa urging the chancellor not to impose an exit tax on wealthy individuals or take other decisions \"which will result in reduced confidence or hesitant investment in the UK\". In total, the signatories to the letter run companies collectively valued at well over $100bn. Money blog: Tesco no longer cheapest traditional supermarket Many of them are among the most prized listing candidates for the UK equity markets at a time when a brief flurry of newly floated candidates has done little to allay concerns about London's international attractiveness against rival financial centres such as New York and Amsterdam. They said, though, that Ms Reeves must consider \"how any potential changes to the fiscal environment could stand to make the UK less attractive to existing and potential founder - which will result in reduced investment in UK start-ups and reduced innovation; will hinder efforts at driving growth; and may also delay or result in cancellation of companies' plans to IPO [list their shares publicly] in the UK\". Their letter, which was sent under the aegis of the trade body Innovate Finance's Unicorn Council for UK FinTech, called on the chancellor to demonstrate support for Britain's fintech industry and the wider economy by reversing changes to capital gains tax and inheritance tax rules. \n                  Monzo hires new CEO as it prepares to click on mega-float\n                 \n                  Santander warns car finance redress scheme a threat to UK jobs, growth and economy\n                 \n                  Bank tax could hurt households and business lending, UK's biggest mortgage provider says\n                 \"Recent changes... have made the UK less attractive to entrepreneurs seeking to start a new business, and to the highly skilled talent that will help drive these startups. It cited the reduction in the lifetime limit for Business Asset Disposal Relief from £10m to £1m as a factor in weakening the UK's \"ability to attract and retain founders\". \"Founders need to see a stable and favourable taxation environment in order to take the risk of building a business in the UK,\" the bosses wrote. Their warning is especially acute for the Treasury because it comes from a group of entrepreneurs who have been assiduously courted by Ms Reeves in recent months. The chancellor has hosted a series of roundtable events with companies including Clearscore, Oaknorth and Revolut as she tries to position London as the most compelling stock exchange in the world to list fast-growing technology businesses. Earlier this week, she hosted a reception in Downing Street, which the Treasury said was to celebrate the recent performance of the UK equity market. \"I am not immune to the narrative that has surrounded UK equity markets, and I too want to see more listings, both joining and staying on our equity markets,\" Ms Reeves told guests.\"The performance of our markets this year has been much stronger than you would think if you read the financial press.\"In fact, the FTSE 100 and FTSE all share are close to record highs.\" Revolut, which is expected to be valued at about $75bn in an ongoing share sale, has been engaged in a protracted effort to secure a full UK banking licence, with the Treasury recently reported to have sought to intervene with regulators on the company's behalf. Francesca Carlesi, Revolut's UK CEO and co-chair of the Unicorn Council, is among the signatories to the letter to Ms Reeves. Others include Vishal Marria, founder and CEO of financial crime detection company Quantexa, which could seek a listing at a valuation of well over $3bn as early as next year. Rishi Khosla, the Oaknorth founder; Philip Belamant, Zilch co-founder and CEO, and co-chair of the Unicorn Council; Charles McManus, ClearBank co-founder; ClearScore boss Justin Basini; Louise Hill, GoHenry's founder and executive chair; Funcing Circle CEO Lisa Jacobs; Francesca Simoneschi, co-founder and CEO of TrueLayer; and ThoughtMachine boss Paul Taylor also signed the letter. Ms Reeves, who will deliver her second budget as chancellor on November 26, made a speech this week in which she braced Britons for steep tax hikes. In recent weeks, industries including banking and gambling have intensified their lobbying efforts in a bid to avoid being hit by punitive tax hikes. An increase in the basic rate of income tax is now anticipated as the chancellor seeks to plug a fiscal gap worth tens of billions of pounds."
    },
    {
        "title": "Schwimmer urges Reeves to unleash £100bn UK stock market boom",
        "description": "The boss of the London Stock Exchange's parent company is to urge Rachel Reeves to take fresh steps in the budget to incentivise as much as &#163;100bn of additional investment by UK pension funds into the domestic stock market.",
        "url": "https://news.sky.com/story/schwimmer-urges-reeves-to-unleash-163100bn-uk-stock-market-boom-13464859",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-stock-exchange-london_6631680.jpg?20240719092126",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-06 10:12:00",
        "Headline": "The letter from LSEG boss David Schwimmer aimed at incentivising pension funds to invest in UK equities has been signed by hundreds of companies including Mitchells & Butlers, Bakkavor and Kier, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The boss of the London Stock Exchange's parent company is to urge Rachel Reeves to take fresh steps in the budget to incentivise as much as £100bn of additional investment by UK pension funds into the domestic stock market. Sky News has learnt that a letter from David Schwimmer, the LSEG chief executive, has amassed more than 250 signatures from companies including pubs group Mitchells & Butlers, construction firm Kier and fresh food producer Bakkavor. City sources said it was expected to be sent to the chancellor later on Thursday before being published by the end of the week. Other companies which have agreed to sign the letter are understood to include Henry Boot, Peel Hunt, Integrafin and veterinary group CVS. Mr Schwimmer's letter is understood to call on Ms Reeves to incentivise a greater allocation from UK defined contribution pension funds to UK equities following a steep decline over the last decade. A recent report by the thinktank New Financial suggested that allocating a minimum 25% of pension schemes' default fund assets to UK investments across different asset classes could funnel between £50bn and £100bn into the UK market. This, the report said, would still leave DC funds' domestic allocation in line with their international peers and historical norms. \n                  How markets reacted to uncertainty over Rachel Reeves's future\n                 \n                  Stricken currency firm Argentex in talks about emergency sale\n                 \n                  How market turmoil has affected mortgages, savings, holidays and fuel\n                 The letter comes in the wake of a series of reforms initiated under the last government and taken forward by Ms Reeves in an attempt to bolster the UK stock market. Last November, she unveiled what she described as \"the biggest pension reform in decades\" by outlining plans for the merger of scores of local authority retirement funds in an effort to save costs and fuel economic growth. An LSEG spokesperson declined to comment."
    },
    {
        "title": "Best and worst hotel chains ranked by cost and customer score",
        "description": "If you're booking a wintery weekend away, be it a city break, Christmas market town, or escape to the countryside, you may want to reconsider your go-to hotel chain.",
        "url": "https://news.sky.com/story/best-and-worst-hotel-chains-ranked-by-cost-and-customer-score-13464788",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-hotel-holiday-travel_7073461.jpg?20251106082953",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-06 08:26:00",
        "Headline": "A new survey from Which? of more than 6,000 people has ranked the best and worst hotel chains - with some surprising results.",
        "Content": "If you're booking a wintery weekend away, be it a city break, Christmas market town, or escape to the countryside, you may want to reconsider your go-to hotel chain. A Which? survey of more than 6,000 people has ranked the best and worst hotels with some surprising results. A pub hotel group has come top of the table and beaten the likes of Marriott and Hilton, while J D Wetherspoon replaced Premier Inn as a value for money brand deserving of Which? special recognition. \"A night away should be a real treat but with hotel prices climbing, finding a hotel chain that consistently offers comfort, good customer service and a charming location at a fair price has become harder,\" says Rory Boland, editor of Which? Travel. Guests were asked to score their stays in small and large chains out of five stars in terms of cleanliness, customer service, breakfast quality, bed comfort and value for money. Coaching Inn Group topped the large chain table with a customer score of 81%, despite not offering the cheapest average room price at £128. The chain scored a full five stars for customer service and for the description matching reality. \n                  Dubai-owned dnata puts Travel Republic in departure lounge\n                 \n                  Bonuses to rise for Ryanair staff spotting oversized baggage\n                 \n                  Airlines furious after another technical glitch cancels flights\n                 Intercontinental was only just pipped to the post, scoring 80%, brought down by its value for money rating of two stars due to a more than £300 average stay. If you're cash-strapped, J D Wetherspoon scored 76% with an average price of £70 per night - a £230 saving if you're willing to sacrifice 4% quality. At the other end of the scale came Britannia, which came last for the twelfth time in a row. Scoring 44%, it received just 1/5 stars for the quality of bedrooms and bathrooms. When it comes to small chains, Andrew Brownsword's 12 hotels topped the leaderboard. Rooms cost £272 a night on average, but their locations include manor houses and castles. In joint-first place was Brend Hotels, located in the West Country, at a slightly cheaper £244 per night. Ibis Budget, Days Inn, Britannia, MacDonald, Malmaison and Qhotels did not respond to a request for comment. A spokesperson for Premier Inn said: \"We're pleased that the 2,746 Which? members who answered for Premier Inn as part of this summer survey awarded us five stars for bed comfort and that they also rated our customer service and cleanliness highly.\" They said the chain was \"continually investing in our guest experience\" including new beds and updated menus. \"We are always looking to improve and welcome comments and feedback - indeed we actively seek them through our own customer surveys. We will certainly pay special attention to address anything that feedback suggests we need to.\""
    },
    {
        "title": "Starmer says Lammy 'setting out facts to best of his knowledge' on prisoner releases",
        "description": "Sir Keir Starmer has said David Lammy \"set out the facts\" on mistaken prisoner releases \"to the best of his knowledge\" amid questions over what the justice secretary knew and when.",
        "url": "https://news.sky.com/story/starmer-says-lammy-setting-out-facts-to-best-of-his-knowledge-on-prisoner-releases-13465446",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-starmer-prison-release_7074290.jpg?20251106205615",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-06 21:02:00",
        "Headline": "The Tories have accused the justice secretary of having \"no clue\" about his own department following confusion over the timeline of what he knew about the fiasco. ",
        "Content": " Sir Keir Starmer has said David Lammy \"set out the facts\" on mistaken prisoner releases \"to the best of his knowledge\" amid questions over what the justice secretary knew and when. Speaking for the first time since it emerged two prisoners were wrongly freed from HMP Wandsworth, the prime minister also said the situation was \"intolerable\" and that he was \"angry and frustrated\". The Met Police announced on Wednesday afternoon that registered sex offender Brahim Kaddour-Cherif, an Algerian national, had been released in error on 29 October. He is still at large. A few hours later it was revealed another prisoner, 35-year-old William \"Billy\" Smith, had been wrongly released on Monday - the same day he was convicted for multiple fraud offences and handed a 45-month jail term. He has since handed himself in.  Asked how the public can have confidence in the justice system, Sir Keir said: \"Let me just say how angry and frustrated I am that these mistakes have been made in releasing people. They're intolerable, and they shouldn't be made. \"A lot of it comes from the burden and the strain on the system because of the failures of the last government. But I recognise it's our job to step up and to fix this.\" \n                  Lammy defends failing to reveal another prisoner had been mistakenly released\n                 \n                  What we know so far about the prisoners freed by mistake\n                 \n                  Wandsworth manhunt latest: Search is on for two prisoners freed by mistake\n                 Sir Keir went on to defend Mr Lammy's handing of the saga, which comes a week on from the mistaken release of Ethiopian sex offender Hadush Kebatu, who has since been deported. Mr Lammy declared on 27 October that stronger prison checks in light of the Kebatu fiasco would come into force immediately. But on Thursday, he said those checks were not in place when Kaddour-Cherif was released two days later. Asked whether he was being truthful last week or on Thursday, Sir Keir said: \"David Lammy can speak for himself on that. \"I'm absolutely clear that he's setting out the facts, to the best of his knowledge and that's the right thing for him to do. \"But whatever the checks, it's intolerable. So, we have to make sure that whatever changes are needed are made.\" Government sources have said the mistakes that triggered the release of Kaddour-Cherif happened at the end of September, before the new regime was put in place. Meanwhile on Thursday night, the Ministry of Justice (MoJ) announced the rollout of \"cutting-edge technology to more prisons\" in order to reduce human error and modernise \"the archaic processes that have led to mistakes\". \"These measures will build on the tough new checks that were brought in last month, and ensure governor oversight of all releases,\" the MoJ said. Mr Lammy, who is also the deputy prime minister, is facing further criticism for failing to reveal that he knew of Kaddour-Cherif's release during PMQs on Wednesday, when he was filing in for Sir Keir who is at the COP summit in Brazil. He was asked repeatedly by Tory leader Kemi Badenoch whether any more asylum seekers had been wrongly released since Kebatu and refused to answer the question. The news broke at the end of PMQs. On Thursday, Mr Lammy said he did not have all the details in the morning and did not want to mislead the public.  He told broadcasters: \"I took the judgment that it is important when updating the House and the country about serious matters like this, that you have all of the details. \"I was not equipped with all of the detail, and the danger is that you end up misleading the House and the general public. \"So that is the judgment I took. I think it's the right judgment.\" But shadow justice secretary Robert Jenrick said: \"David Lammy has either lied or has absolutely no clue what's going on in his department. \"How can the public have confidence in the justice secretary when he can't establish a timeline of events or answer basic questions?\" Kaddour-Cherif was serving a sentence at HMP Wandsworth for trespass with intent to steal, but had previously been convicted for indecent exposure. It is understood he is not an asylum seeker but is in the process of being deported after he overstayed his visa."
    },
    {
        "title": "Labour's dilemma: The two-child benefit cap",
        "description": "The two-child benefit cap: To scrap or not to scrap?",
        "url": "https://news.sky.com/story/labours-dilemma-the-two-child-benefit-cap-13464798",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-labour-budget_7073478.jpg?20251106085103",
        "type": "Politics",
        "Author": "Mhari Aurora",
        "Date Published": "2025-11-06 08:44:00",
        "Headline": "The current two-child benefit cap means that low-income families with children do not receive additional means-tested benefits for any third or subsequent children. ",
        "Content": "\n          Political correspondent\n              @MhariAurora\n  The two-child benefit cap: To scrap or not to scrap? There is an ongoing row in the Labour Party about welfare spending and how to cut it while maintaining protections for the most vulnerable. Those on the left are suspicious of anything that may look or smell like balancing the books on the backs of the poorest in society. Those on the other side point to an unsustainable welfare bill that has been allowed to balloon under the Conservatives and looks set to continue under Labour. Rachel Reeves will have to weigh up finding between £3bn and £4bn to scrap the cap, or face the wrath of Labour MPs on small majorities who believe they were elected to deliver on 'Labour values' like lifting this very cap. But perhaps there is a compromise the chancellor could opt for, which may placate the left of her party while needing less cash. For example, according to the Institute for Fiscal Studies, lifting the cap from two to three children would cost £2.6bn; or a tapered system, where parents got the full amount for the first two kids and then half the amount for any subsequent children, would cost around £1.8bn. But Labour big beast David Blunkett - the only senior Labour figure against lifting the cap - wants to see a more nuanced approach. Blunkett believes the cap ought to remain, but he wants there to be exemptions for disabled children and parents who have been widowed, and he would prefer the government to focus on anti-child poverty measures and improving pathways to work for parents, all paid for by a tax on gambling - something former prime minister Gordon Brown has been agitating for. Read more:What is the two-child benefit cap?What tax rises could Rachel Reeves announce? At a time when the government perpetually reminds us of how little money it has and how much strain public finances are under due to austerity, finding several billion to scrap a policy that is broadly popular with the public may seem like an unwise move. According to the latest polling from YouGov, 59% of the public are in favour of keeping the cap in place, and only 26% thought it should be abolished. But politically, the chancellor is aware of the strength of feeling within her party about reducing child poverty as soon as possible, and her colleague, the Education Secretary Bridget Phillipson, has stressed the party has a \"moral mission\" to tackle child poverty.  Irrespective of what Reeves chooses, her political woes do not end there. Taxes are set to go up in the budget later this month, and Reeves has refused to rule out breaking her manifesto promise of not raising taxes on working people. This combined with persistently disappointing voter intention polling for Labour, could spell deep dissatisfaction among the public. A decision to lift the two-child benefit cap may boost morale among Labour MPs, but if it's not enough to prevent the loss of hundreds of political foot soldiers in May's local elections, Reeves and Sir Keir Starmer will need to find more red meat to throw to their party before too long."
    },
    {
        "title": "Highest ever number of referrals to anti-extremism Prevent programme",
        "description": "The highest number of people on record were referred to the UK's anti-extremism scheme in the year to March - with a 37% rise in right-wing extremism concerns, the latest data shows.",
        "url": "https://news.sky.com/story/highest-ever-number-of-referrals-to-anti-extremism-prevent-programme-13464855",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-police-devon-fire_7067205.jpg?20251030175538",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-06 10:01:00",
        "Headline": "There was a 26% increase in people being referred to the UK's counter-terrorism programme.",
        "Content": "The highest number of people on record were referred to the UK's anti-extremism scheme in the year to March - with a 37% rise in right-wing extremism concerns, the latest data shows. A total of 8,778 individuals were referred to the programme, the highest since records began in 2015. That is a 27% increase from the previous year's 6,922 referrals. Prevent is the UK's counter-terrorism programme that aims to stop people from becoming terrorists or supporting terrorism. There was an increase in people referred for \"extreme right-wing\" concerns, as they accounted for 21% (1,798) - a 37% rise from 1,314 (19%) the year before. That was higher than those related to \"Islamist extremism\", which accounted for 10% (879) compared with 13% (913) the previous year. The data shows the number of referrals for individuals with no ideology was by far the greatest share of all referrals (4,917), but these cases were less likely to be adopted by the panel - multi-agency groups that assess those who may be at risk of radicalisation. \n                  Prevent scheme needs to 'rapidly' adapt to online world, review finds after failures in Southport case\n                 \n                  How Prevent is tackling young extremism 20 years after the 7/7 bombings\n                 \n                  Nicholas Prosper: Teenager who murdered mother and siblings jailed for at least 49 years\n                 Only 10% of 1,908 \"no ideology\" referrals were adopted compared with 34% (612) of \"extreme right wing\" and 27% (126) of those with a \"fascination with extreme violence or mass casualty attacks (where no other ideology)\". There were a total of 142 referrals to Prevent per million people across England and Wales. When it came to regions, the West Midlands received the highest number of referrals per million people (176), while southeast England had the highest proportion of referrals (16% - 1,398). The east of England had the lowest number of referrals per million people (93), accounting for 7% of all referrals. Like every other year, the education sector made up the highest share of referrals, with 3,129 (36%). However, this was a slight decrease from last year, when education made up 40% of referrals. The second-highest share was from police forces (2,631; 30%), an increase of 37% compared with the previous year (1,921; 28%). Data journalist \"Prevent has got to adapt, just as radicalisation is adapting,\" Lord Anderson, the interim independent Prevent commissioner, told Sky News. Lord David highlighted the decrease in referrals of those with a “fully developed” ideology compared to a rise in those whose extremism is drawn “from a bit of this and a bit of that”. Most referrals for last year were for people with no specific ideology but those with an \"extremist right-wing\" or \"Islamist extremist\" ideology are more likely to be adopted as cases. People with right-wing idologies were most likely to have their case taken up, with one in three referrals adopted by the panel. However, those with no specific ideology but a fascination with extreme violence may still be \"very dangerous\", Lord David warned. They require mentors who are younger, have a better understanding of the online world, and have expertise in mental health and neurodiversity conditions, which affect one in three people referred to the programme, he said. Referrals from local authorities had the largest percentage increase (54% from 582 to 895). By contrast, referrals from the community and from friends and family were the only groups to show decreases, falling by 25% and 7% respectively. Details on ethnicity were published for the first time. Where referrals had ethnicity specified, 65% (2,747) were recorded as white, 19% (789) Asian, 8% (320) black and 8% (338) as other. The data also shows a third (2,995) of Prevent referrals had at least one mental health or neurodiversity condition. Autistic Spectrum Disorder (ASD) was the most common condition recorded."
    },
    {
        "title": "Lammy defends failing to reveal another prisoner had been mistakenly released",
        "description": "David Lammy has said he did not know all the details of a prisoner's mistaken release when repeatedly asked about it.",
        "url": "https://news.sky.com/story/lammy-defends-not-revealing-another-prisoner-had-been-mistakenly-released-13465137",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gartree-hmp-david-lammy_7073886.jpg?20251106153735",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-06 15:27:00",
        "Headline": "The justice secretary has raised more questions after trying to clarify what he knew about the mistaken release of an Algerian registered sex offender.",
        "Content": " David Lammy has said he did not know all the details of a prisoner's mistaken release when repeatedly asked about it. The justice secretary and deputy prime minister was heavily criticised for not revealing on Wednesday that registered Algerian sex offender Brahim Kaddour-Cherif had been released in error last week. The Conservatives used Mr Lammy's appearance at Prime Minister's Questions to ask - five times - if another prisoner had been released after migrant sex offender Hadush Kebatu was released by mistake on 24 October instead of being taken to an immigration removal centre. Politics latest: Lammy responds to prisoner release error - but raises more questions than he answers  Mr Lammy gave an irate reply but refused to say he knew anything. A day later, Mr Lammy has defended his decision not to reveal that he knew about the incident, saying he did not know the full details and did not want to mislead the public. \n                  Starmer says Lammy 'setting out facts to best of his knowledge' on prisoner releases\n                 \n                  What we know so far about the prisoners freed by mistake\n                 \n                  Wandsworth manhunt latest: Search is on for two prisoners freed by mistake\n                 \"I did not have all of the details,\" he said. \"That detail was actually released just later after I had finished at Prime Minister's Questions. \"I took the judgment that it is important when updating the House and the country about serious matters like this, that you have all of the details. \"I was not equipped with all of the detail, and the danger is that you end up misleading the House and the general public. \"So that is the judgment I took. I think it's the right judgment.\"  Timeline confusion The justice secretary said he first found out about Kaddour-Cherif's release on Wednesday morning, and spent the hours before PMQs in the Ministry of Justice, \"learning from officials\" and preparing for his first time filling in for Sir Keir Starmer. However, questions have been raised about the timeline because Mr Lammy said Kaddour-Cherif was released \"before I introduced those checks\". On 27 October, he said \"the strongest release checks that have ever been in place\" were being introduced in reaction to Kebatu's accidental release. \"They will apply to every release from custody and are effective immediately,\" he added. But Kaddour-Cherif was released on 29 October, two days later. Prison authorities then did not alert the Metropolitan Police until Monday, and the prisoner is still at large. Another prisoner, Billy Smith, was also released by mistake on Tuesday but handed himself in on Thursday after it was made public a couple of hours after PMQs. Sky News has asked the Ministry of Justice for clarification on the timeline."
    },
    {
        "title": "Elon Musk's $1 trillion pay package approved by Tesla",
        "description": "Elon Musk could be on track for a $1trn (&#163;761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years.",
        "url": "https://news.sky.com/story/elon-musks-1-trillion-pay-package-approved-by-tesla-13464835",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-elon-musk-tesla_6982741.jpg?20251023110145",
        "type": "Technology",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-11-06 09:46:00",
        "Headline": "Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Elon Musk could be on track for a $1trn (£761bn) pay package - if Tesla meets a series of extremely ambitious targets over the next 10 years. The world's richest man has the potential to become a trillionaire after the controversial plans were approved by 75% of the company's shareholders. However, it won't be easy. As part of the agreement, Musk will need to deliver 20 million Tesla vehicles over the next decade - more than double the number churned out over the past 12 years. He will be tasked with dramatically increasing the company's valuation and operating profits.  Another requirement is for Tesla to roll out one million AI-powered robots - despite the fact it hasn't released a single one so far. Musk will also need to come up with a succession plan on who will replace him as the chief executive of Tesla. As each step is successfully completed, he will receive more company shares and his ownership stake will rise - potentially from 13% now to almost 29%. \n                  Wrongly freed prisoners, Elon Musk and words of the year\n                 \n                  Elon Musk: Why some are starting to question if the world's richest man is still value for money\n                 \n                  How the world's richest man is boosting the British right\n                 And even if Musk falls short of some of these targets, he could end up earning a lot of money. Figures from Forbes magazine suggest the 54-year-old already has a net worth of $493bn (£375bn) - and while that means he has more money than anyone else on the planet, he isn't the richest person in history... yet. That title belongs to John D. Rockefeller, the railroad titan who had wealth of $630bn (£480bn) back in 1913 - when adjusted for inflation.  Why? Now is the moment Tesla wants to innovate, develop into robotics, self-driving and embrace the growth of artificial intelligence (AI). It's seeking a visionary leader to spearhead this move. And a lot of Tesla's market value is tied up in this ambition. Tesla's board of directors, who oversee the management of the business, are adamant that only Musk can make the lofty ambitions a reality. Some believe there's no one else like Musk. More shares in the company are \"critical to keep Musk at the helm to lead Tesla through the most critical time in the company's history\", said financial services firm Wedbush. \"We believe this was the smart move by the board to lay out these incentives/pay package at this key time as the biggest asset for Tesla is Musk ... and with the AI revolution, this is a crucial time for Tesla ahead with autonomous and robotics front and centre.\" Read more money news:Bank of England holds interest rateM&S reveals cost of cyber attack   Opposition Not everyone is in favour of the pay package. Major investor advice firm Institutional Shareholder Services (ISS) warned the 10-year pay agreement reduces the board's ability \"to meaningfully adjust future pay levels in the event of unforeseen events or changes in either the performance or strategic focus of the company over the next decade\".  In a note, ISS said: \"The high value of each tranche could also potentially undermine Musk's desire to achieve all goals and create significant value for shareholders\", and that the goals \"lack precision\".  Mr Musk has described ISS and another major adviser, Glass Lewis, as \"corporate terrorists\". There was speculation he would walk away from the business if the package was not agreed on. "
    },
    {
        "title": "2025 set to be among hottest years on record, UN scientists warn",
        "description": "This year will likely be the second or third warmest ever on record globally, as an \"unprecedented streak\" of high temperatures persists, UN scientists have warned.",
        "url": "https://news.sky.com/story/2025-set-to-be-among-hottest-years-on-record-un-scientists-warn-13464947",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-global-warming-climate-change_7073826.jpg?20251106143529",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-06 11:49:00",
        "Headline": "The World Meteorological Organisation warns global average temperatures will be near the highest on record, stretching back 176 years, as leaders including Sir Keir Starmer gather in Brazil ahead of the COP30 climate summit.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  This year will likely be the second or third warmest ever on record globally, as an \"unprecedented streak\" of high temperatures persists, UN scientists have warned. It comes as climate talks between world leaders get under way in Brazil. Prime Minister Sir Keir Starmer and Prince William addressed other nations in the Amazonian city of Belem, including Brazil's president Luiz Inacio Lula da Silva and officials from Jamaica, which is still reeling from the devastating Hurricane Melissa. Global average surface temperatures in January to August 2025 were 1.42C above pre-industrial times, before humans started burning fossil fuels at scale, the UN's World Meteorological Organisation has said. The level is closing in on the target set in the landmark Paris Agreement, struck at COP21 in 2015, which aimed to limit global warming to \"well below\" 2C and ideally 1.5C. That means just 10 years later, it is already looking \"virtually impossible\" to stick to the Paris goal without at least temporarily overshooting it, the WMO said. Under this heat, the UK experienced its hottest summer on record, two million people in Pakistan were evacuated from deadly floods and parts of the Amazon rainforest are so dry that once rare wildfires now spread easily. \n                  COP30: A fired up Prince William is a secret weapon only the UK can deploy\n                 \n                  Prince William hails 'world's true action heroes' at Earthshot awards - and gets praise himself from Kylie\n                 \n                  Humans have 'possibly' impacted climate change, Richard Tice admits, after calling the idea 'garbage'\n                 Hilde Heine, president of the coral atoll country of the Marshall Islands in the Pacific, said the \"widespread mortality of coral reefs [is] now seemingly inevitable\" and the Amazon is \"likely not far behind in suffering a similar fate\". WMO chief Celeste Saulo stressed it would be \"still entirely possible and essential\" to bring temperatures down to the 1.5C goal again. That 1.5C limit is \"not just a figure\" but a \"lifeline for Pacific communities and climate-vulnerable nations\" grappling with rising and warming seas, said Shiva Gounden, head of Pacific at Greenpeace Australia Pacific. \"The legal, moral, and political responsibility for climate action has never been stronger, and the ambition leaders take to Belem will define its success.\" Read more from Sky News:Earth's lungs are collapsing - is net zero dead?Few places explain world's refugee crisis as well as this Who's staying away? The leaders are in town over the course of two days, before the COP30 climate summit begins on Monday. But only about 60 are due to attend, compared with more than double the number in some previous years. The heads of the world's three largest drivers of climate change, China, the US and India, are all staying at home. Although many missing leaders will still send officials to the negotiations, diplomats here in Belem are worried that governments are distracted by cost-of-living woes and boosting defence. They also fear US President Donald Trump will seek to water down any deals from afar by threatening countries that agree to anything too ambitious. Leaders 'denying reality' Mariana Menezes, a Brazilian mother caught up in the devastating floods in Rio Grande do Sul last year, said: \"We see world leaders denying reality and making plans to expand fossil fuels. \"These people, who once enjoyed full lives with unforgettable summers and long walks outdoors in their youth, are condemning future generations to lives of pollution and disasters.\" The WMO's annual State of the Climate reports found that the past 11 years - from the Paris Agreement year of 2015 to 2025 - have each been in the top 11 warmest on record. And the past three years have been the three warmest years in the record, stretching back 176 years. In his speech, Sir Keir admitted that the \"consensus is gone\" on climate change - that cross-party unity on the science has splintered at home and globally. He made an economic case for net zero, saying the green transition would create jobs and lower household bills. But despite attacks on climate policies from the Conservatives and Reform, Britons are still concerned about and believe in climate change, and are still buying in to green technology like electric vehicles and heat pumps, Sky News has found."
    },
    {
        "title": "Meta told to stop using PG-13 film-style ratings over Instagram content",
        "description": "The Motion Picture Association (MPA) in the US has sent Meta a cease-and-desist letter over its use of \"PG-13\" when referring to content moderation on Instagram.",
        "url": "https://news.sky.com/story/meta-told-to-stop-using-pg-13-film-style-ratings-over-instagram-content-13464940",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-meta-instagram_7073644.jpg?20251106114734",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-06 11:40:00",
        "Headline": "The MPA's film ratings are decided on by parents who watch the films and then evaluate them to come up with a rating.",
        "Content": "\n          Science and technology reporter\n       The Motion Picture Association (MPA) in the US has sent Meta a cease-and-desist letter over its use of \"PG-13\" when referring to content moderation on Instagram. In October, the social media giant announced that teenagers using its platform would now only see content that abides by a PG-13 cinema rating. Now, it has been told to \"immediately and permanently\" stop using the rating, with the MPA accusing Meta of being \"highly misleading\". The MPA's film ratings, which range from G (suitable for all ages) to NC-17 (18+), are decided on by parents who watch the films and then evaluate them to come up with a rating. \"Meta's attempts to restrict teen content literally cannot be 'guided by' or 'aligned with' the MPA's PG-13 movie rating because Meta does not follow this curated process,\" said the association's letter, seen by Sky News. \"Instead, Meta's content restrictions appear to rely heavily on artificial intelligence or other automated technology measures.\" The MPA is a US trade body that describes itself on its website as the \"leading advocate of the global film, television, and streaming industry\". \n                  Microsoft, Alphabet and Meta results overshadowed by growing fears of AI bubble\n                 \n                  Meta announces new smart glasses with a bold claim. I've tried them - and am unconvinced\n                 \n                  Mark Zuckerberg sues Meta - but he's not who you think\n                 Naresh Kilaru, a lawyer for the MPA, said in the 28 October letter to Meta: \"The MPA has worked for decades to earn the public's trust in its rating system.\" \"Any dissatisfaction with Meta's automated classification will inevitably cause the public to question the integrity of the MPA's rating system,\" Mr Kilaru said. Read more from Sky News:How the world's richest man is boosting the British rightTech giants warn Reeves of IPO 'flight risk' over budget  The letter to Jennifer Newstead, Meta's chief legal officer, asked Meta to immediately disassociate Instagram's Teen Accounts and AI tools from the MPA rating system and to refrain from any use of the PG-13 mark. It asked for a resolution by 3 November. On 6 November, however, Sky News checked and was still presented with a message on Instagram saying: \"Instagram Teen Accounts will be guided by 13+ movie ratings.\" Meta told Sky News that parents say they want to \"better understand\" what their teenagers are seeing on Instagram. \"To make things simpler for them, we updated our teen content policies to be closer to PG-13 movie standards - which parents already know,\" said a Meta spokesperson. \"We know social media isn't the same as movies, but we made this change to support parents, and we hope to work with the MPA to continue bringing families this clarity.\""
    },
    {
        "title": "Prince William hails 'world's true action heroes' at Earthshot awards - and gets praise himself from Kylie",
        "description": "Prince William has praised environmental innovators as the \"world's true action heroes\", describing them as the role models we need \"in these uncertain times\" at his Earthshot awards in Rio.",
        "url": "https://news.sky.com/story/prince-william-hails-worlds-true-action-heroes-at-earthshot-awards-and-gets-praise-himself-from-kylie-13464709",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-william-kylie-minogue_7073334.jpg?20251106004542",
        "type": "Technology",
        "Author": "Rhiannon Mills, Royal correspondent, in Rio",
        "Date Published": "2025-11-06 00:26:00",
        "Headline": "The future king is in Brazil not just for his own annual ceremony, joined by pop star Kylie Minogue, but also for COP30.",
        "Content": "By Rhiannon Mills, Royal correspondent, in Rio   Prince William has praised environmental innovators as the \"world's true action heroes\", describing them as the role models we need \"in these uncertain times\" at his Earthshot awards in Rio. Joined on stage by four young people from Brazil at his annual ceremony, William explained his motivation to set up the prize, saying of the finalists: \"Their stories are the inspiration that gives us courage.\" \"And there's a great deal we can learn from their determination and their vision for scale,\" he added. \"As well as their unyielding belief that we can create a better world. It's no exaggeration to say that they are the world's true action heroes.\"  For the fifth year of his environmental prize, which sees five innovators or entrepreneurs awarded £1m each, he was joined by singers Kylie Minogue and Shawn Mendes performing at the ceremony. Speaking to Sky News ahead of her performance, Kylie hailed the awards as an \"incredible initiative\". \"I'm really excited to see everyone,\" she told Sky News. \"There's amazing people doing incredible things, so it's good to be here.\" 'When we unite, we are unstoppable' While the awards have been his focus for the first three days of his trip to Brazil, he will travel to Belem tomorrow for COP30, the UN's climate conference. Acknowledging the sense of pessimism around the climate debate, exacerbated by recent global turbulence he said: \"I understand some might feel discouraged in these uncertain times. \"I understand there is still so much to be done. But this is no time for complacency, and the optimism I felt in 2020 remains ardent today.\" In a call to action, he added: \"The issues that continue to face our world are a threat to all of us, but when we unite, our momentum is unstoppable.\" He then called on the young people, part of the Mini COP programme, to tell the audience their hopes for the future. Read more from Sky News:Why is COP30 so controversial? re.green: A Brazilian start-up restoring forests with the help of artificial intelligence.  Friendship: A Bangladeshi non-profit organisation that assists vulnerable communities across the country in preparing for natural disasters. Bogota: Colombia's capital was awarded for its clean air policies. Lagos Fashion Week: Promotes sustainable, craft-based clothing-makers. United Nations High Seas Treaty: Seeks to protect marine environments outside of national jurisdictions. Earlier in the day, the prince had spoken at another Earthshot event about how he does everything he can to reassure his own children that the planet will be looked after. The spectacular show, also featuring some of Brazil's biggest stars, was designed to hook in a global and multigenerational audience. Fortunately for Prince William and his team, it also hasn't been overshadowed this week by any significant new developments or revelations about his uncle Andrew, who only a week ago was stripped of his remaining honours and titles, and it was announced he would also be moving out of his home Royal Lodge on the Windsor estate."
    },
    {
        "title": "Tech giants warn Reeves of IPO 'flight risk' over budget",
        "description": "Executives from some of Britain's most valuable technology start-ups have delivered a bombshell warning to Rachel Reeves that tax-raising measures in this month's budget could force them to cancel plans to list their companies on the London Stock Exchange.",
        "url": "https://news.sky.com/story/tech-giants-warn-reeves-of-ipo-flight-risk-over-budget-13464757",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-revolut-bank-card_6557722.png?20240518084401",
        "type": "Technology",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-06 06:58:00",
        "Headline": "Bosses of companies including Revolut, Oaknorth, Zilch and ClearScore have told Rachel Reeves that new fiscal measures could force them to cancel UK listing plans in a letter seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Executives from some of Britain's most valuable technology start-ups have delivered a bombshell warning to Rachel Reeves that tax-raising measures in this month's budget could force them to cancel plans to list their companies on the London Stock Exchange. Sky News has obtained a letter sent this week by companies including Revolut, Funding Circle, OakNorth, Clearscore and Quantexa urging the chancellor not to impose an exit tax on wealthy individuals or take other decisions \"which will result in reduced confidence or hesitant investment in the UK\". In total, the signatories to the letter run companies collectively valued at well over $100bn. Money blog: Tesco no longer cheapest traditional supermarket Many of them are among the most prized listing candidates for the UK equity markets at a time when a brief flurry of newly floated candidates has done little to allay concerns about London's international attractiveness against rival financial centres such as New York and Amsterdam. They said, though, that Ms Reeves must consider \"how any potential changes to the fiscal environment could stand to make the UK less attractive to existing and potential founder - which will result in reduced investment in UK start-ups and reduced innovation; will hinder efforts at driving growth; and may also delay or result in cancellation of companies' plans to IPO [list their shares publicly] in the UK\". Their letter, which was sent under the aegis of the trade body Innovate Finance's Unicorn Council for UK FinTech, called on the chancellor to demonstrate support for Britain's fintech industry and the wider economy by reversing changes to capital gains tax and inheritance tax rules. \n                  Monzo hires new CEO as it prepares to click on mega-float\n                 \n                  Santander warns car finance redress scheme a threat to UK jobs, growth and economy\n                 \n                  Bank tax could hurt households and business lending, UK's biggest mortgage provider says\n                 \"Recent changes... have made the UK less attractive to entrepreneurs seeking to start a new business, and to the highly skilled talent that will help drive these startups. It cited the reduction in the lifetime limit for Business Asset Disposal Relief from £10m to £1m as a factor in weakening the UK's \"ability to attract and retain founders\". \"Founders need to see a stable and favourable taxation environment in order to take the risk of building a business in the UK,\" the bosses wrote. Their warning is especially acute for the Treasury because it comes from a group of entrepreneurs who have been assiduously courted by Ms Reeves in recent months. The chancellor has hosted a series of roundtable events with companies including Clearscore, Oaknorth and Revolut as she tries to position London as the most compelling stock exchange in the world to list fast-growing technology businesses. Earlier this week, she hosted a reception in Downing Street, which the Treasury said was to celebrate the recent performance of the UK equity market. \"I am not immune to the narrative that has surrounded UK equity markets, and I too want to see more listings, both joining and staying on our equity markets,\" Ms Reeves told guests.\"The performance of our markets this year has been much stronger than you would think if you read the financial press.\"In fact, the FTSE 100 and FTSE all share are close to record highs.\" Revolut, which is expected to be valued at about $75bn in an ongoing share sale, has been engaged in a protracted effort to secure a full UK banking licence, with the Treasury recently reported to have sought to intervene with regulators on the company's behalf. Francesca Carlesi, Revolut's UK CEO and co-chair of the Unicorn Council, is among the signatories to the letter to Ms Reeves. Others include Vishal Marria, founder and CEO of financial crime detection company Quantexa, which could seek a listing at a valuation of well over $3bn as early as next year. Rishi Khosla, the Oaknorth founder; Philip Belamant, Zilch co-founder and CEO, and co-chair of the Unicorn Council; Charles McManus, ClearBank co-founder; ClearScore boss Justin Basini; Louise Hill, GoHenry's founder and executive chair; Funcing Circle CEO Lisa Jacobs; Francesca Simoneschi, co-founder and CEO of TrueLayer; and ThoughtMachine boss Paul Taylor also signed the letter. Ms Reeves, who will deliver her second budget as chancellor on November 26, made a speech this week in which she braced Britons for steep tax hikes. In recent weeks, industries including banking and gambling have intensified their lobbying efforts in a bid to avoid being hit by punitive tax hikes. An increase in the basic rate of income tax is now anticipated as the chancellor seeks to plug a fiscal gap worth tens of billions of pounds."
    },
    {
        "title": "'Iconic, wise' Shirley Valentine actress Pauline Collins dies",
        "description": "Shirley Valentine actress Pauline Collins has died \"peacefully\", aged 85, surrounded by her family.",
        "url": "https://news.sky.com/story/shirley-valentine-actress-pauline-collins-dies-13465238",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pauline-collins-collins_7074139.jpg?20251106183126",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-06 17:26:00",
        "Headline": "The actress's family thanked her carers, saying \"she could not have had a more peaceful goodbye\". ",
        "Content": "Shirley Valentine actress Pauline Collins has died \"peacefully\", aged 85, surrounded by her family. The actress, who starred in the first series of sitcom The Liver Birds, and became a household name in Upstairs Downstairs, had Parkinson's disease for several years. Her later role in the 1989 film Shirley Valentine, playing the lead character of the bored Liverpudlian housewife, earned her an Oscar nomination. 'Iconic, strong-willed' Her family said in a statement: \"Pauline was so many things to so many people, playing a variety of roles in her life. A bright, sparky, witty presence on stage and screen. Her illustrious career saw her play politicians, mothers and queens. \"She will always be remembered as the iconic, strong-willed, vivacious and wise Shirley Valentine - a role that she made all her own. \"We were familiar with all those parts of her because her magic was contained in each one of them. \n                  Public 'at risk' as more inmates sent to open prisons - with another manhunt under way \n                 \n                  Andrew Mountbatten Windsor summoned by US Congress\n                 \n                  Congress letter to Andrew: Read in full\n                 \"More than anything, though, she was our loving mum, our wonderful grandma and great-grandma. Warm, funny, generous, thoughtful, wise, she was always there for us. \"And she was John (Alderton)'s life-long love. A partner, work collaborator, and wife of 56 years. \"We particularly want to thank her carers: angels who looked after her with dignity, compassion, and most of all love. \"She could not have had a more peaceful goodbye. We hope you will remember her at the height of her powers; so joyful and full of energy; and give us the space and privacy to contemplate a life without her.\" She married fellow actor John Alderton in 1969. 'Nation's sweetheart' He described her as a \"remarkable star\". He said he worked with her more than any other actor in TV series, films and West End stage shows, and had \"watched her genius at close quarters\". He added: \"What I saw was not only her brilliant range of diverse characters but her magic of bringing out the best in all of the people she worked with. She wanted everyone to be special and she did this by never saying 'Look at me'. \"It's no wonder that she was voted the nation's sweetheart in the 1970s. \"She will always be remembered for Shirley Valentine, not only for her Oscar nomination or the film itself, but for clean-sweeping all seven awards when she portrayed her on Broadway in the stage play, in which she played every character herself. \"But her greatest performance was as my wife and mother to our beautiful children.\" Read more: Acting has been taken over by 'posh boys', says one of Britain's most celebrated actors Helen Garner's 'unsparing' diary collection becomes first to win prestigious Baillie Gifford non-fiction prize Born in Exmouth in 1940, Collins was raised near Liverpool and began her career as a teacher. But after taking up acting part-time, she landed her first television role as a nurse in the series Emergency Ward 10. Collins also won great acclaim for her role in 1997 film Paradise Road, which tells the story of a group of women in a Japanese prisoner of war camp who defy their captors by founding an orchestra. The film also starred Glenn Close, Cate Blanchett and Frances McDormand. In 2001, Collins was made an OBE for her services to drama."
    },
    {
        "title": "Prince William hails 'world's true action heroes' at Earthshot awards - and gets praise himself from Kylie",
        "description": "Prince William has praised environmental innovators as the \"world's true action heroes\", describing them as the role models we need \"in these uncertain times\" at his Earthshot awards in Rio.",
        "url": "https://news.sky.com/story/prince-william-hails-worlds-true-action-heroes-at-earthshot-awards-and-gets-praise-himself-from-kylie-13464709",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-william-kylie-minogue_7073334.jpg?20251106004542",
        "type": "Entertainment",
        "Author": "Rhiannon Mills, Royal correspondent, in Rio",
        "Date Published": "2025-11-06 00:26:00",
        "Headline": "The future king is in Brazil not just for his own annual ceremony, joined by pop star Kylie Minogue, but also for COP30.",
        "Content": "By Rhiannon Mills, Royal correspondent, in Rio   Prince William has praised environmental innovators as the \"world's true action heroes\", describing them as the role models we need \"in these uncertain times\" at his Earthshot awards in Rio. Joined on stage by four young people from Brazil at his annual ceremony, William explained his motivation to set up the prize, saying of the finalists: \"Their stories are the inspiration that gives us courage.\" \"And there's a great deal we can learn from their determination and their vision for scale,\" he added. \"As well as their unyielding belief that we can create a better world. It's no exaggeration to say that they are the world's true action heroes.\"  For the fifth year of his environmental prize, which sees five innovators or entrepreneurs awarded £1m each, he was joined by singers Kylie Minogue and Shawn Mendes performing at the ceremony. Speaking to Sky News ahead of her performance, Kylie hailed the awards as an \"incredible initiative\". \"I'm really excited to see everyone,\" she told Sky News. \"There's amazing people doing incredible things, so it's good to be here.\" 'When we unite, we are unstoppable' While the awards have been his focus for the first three days of his trip to Brazil, he will travel to Belem tomorrow for COP30, the UN's climate conference. Acknowledging the sense of pessimism around the climate debate, exacerbated by recent global turbulence he said: \"I understand some might feel discouraged in these uncertain times. \"I understand there is still so much to be done. But this is no time for complacency, and the optimism I felt in 2020 remains ardent today.\" In a call to action, he added: \"The issues that continue to face our world are a threat to all of us, but when we unite, our momentum is unstoppable.\" He then called on the young people, part of the Mini COP programme, to tell the audience their hopes for the future. Read more from Sky News:Why is COP30 so controversial? re.green: A Brazilian start-up restoring forests with the help of artificial intelligence.  Friendship: A Bangladeshi non-profit organisation that assists vulnerable communities across the country in preparing for natural disasters. Bogota: Colombia's capital was awarded for its clean air policies. Lagos Fashion Week: Promotes sustainable, craft-based clothing-makers. United Nations High Seas Treaty: Seeks to protect marine environments outside of national jurisdictions. Earlier in the day, the prince had spoken at another Earthshot event about how he does everything he can to reassure his own children that the planet will be looked after. The spectacular show, also featuring some of Brazil's biggest stars, was designed to hook in a global and multigenerational audience. Fortunately for Prince William and his team, it also hasn't been overshadowed this week by any significant new developments or revelations about his uncle Andrew, who only a week ago was stripped of his remaining honours and titles, and it was announced he would also be moving out of his home Royal Lodge on the Windsor estate."
    }
]