[
    {
        "title": "Pakistan warns Kashmir row could lead to 'all-out war' with India",
        "description": "Pakistan's defence minister has told Sky News that a row over a mass shooting in Kashmir could lead to an \"all-out war\" between his country and India.",
        "url": "https://news.sky.com/story/pakistan-warns-kashmir-row-could-lead-to-all-out-war-with-india-13355033",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-indian-soldiers-paramilitary-soldiers_6895917.jpg?20250424212307",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-24 17:53:00",
        "Headline": "Defence minister Khawaja Asif told Sky News his country would \"respond in kind\" to any attack by New Delhi. It comes amid heightened tensions between the two nuclear-armed countries following a shooting that left 26 tourists dead. ",
        "Content": " Pakistan's defence minister has told Sky News that a row over a mass shooting in Kashmir could lead to an \"all-out war\" between his country and India. Speaking to The World with Yalda Hakim, Khawaja Asif said the world should be \"worried\" about the prospect of a full-scale conflict involving the two nations, which both have nuclear weapons. But he also said he hoped the dispute could be resolved via negotiations. It comes after 26 tourists were shot dead by gunmen at a beauty spot in Indian-controlled Kashmir on Tuesday – an attack that the government in New Delhi has blamed on Pakistan. But Mr Asif denied the claim, suggesting India had \"staged\" the shooting in a \"false flag\" operation. He warned his military was \"prepared for any eventuality\" amid escalating tensions and diplomatic measures from both sides. He said: \"We will measure our response to whatever is initiated by India. It would be a measured response. \"If there is an all-out attack or something like that, then obviously there will be an all-out war.\" When asked by Yalda Hakim if the world should be worried, he replied: \"Yes, I think so. The clash between two nuclear powers is always worrisome... \"If things get wrong, there could be a tragic outcome of this confrontation.\" Read more from Sky News:Student killed in stabbing at French schoolFootballer jailed for causing death of cyclistOasis fans 'lost £2m to ticket scams' Both India and Pakistan claim Kashmir as their own, but instead control different sections of the territory. The dispute over the land has claimed the lives of tens of thousands of people over the past three decades, although outbreaks of sporadic violence had eased in recent years – until this week's shooting reignited tensions.  Indian Prime Minister Narendra Modi has vowed to pursue those responsible for the attack \"to the ends of the Earth\". But when asked by Yalda Hakim if he blamed India for the attack, Mr Asif replied: \"Yeah, yeah, yeah. Absolutely. Absolutely, they create these situations.\" However, he added: \"We should be solving our problems through negotiations.\" When asked if US President Donald Trump should get involved to help resolve the looming crisis, Mr Asif said: \"Definitely he leads the world power, the sole world power and he has been talking to different parties in different flashpoints all over the world. \"And this is also a flashpoint which has two nuclear powers that are drawn with each other. I think the attention of this situation and if the world power can intervene and there's some sort of sanity can be brought to this situation, it will be good.\" He added: \"Otherwise, if there is an initiative by India, we'll respond in kind. We will not have any option, have absolutely no option.\""
    },
    {
        "title": "A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters",
        "description": "Events in Ukraine over the last 24 hours have been utterly barbaric. Bad even by the standards of this horrendous war.&#160;&#160;",
        "url": "https://news.sky.com/story/a-barbaric-24-hours-in-the-horrendous-russia-ukraine-war-leaves-donald-trumps-peace-plan-in-tatters-13355016",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ukraine-russia_6895139.jpg?20250424062044",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-04-24 16:46:00",
        "Headline": "The plight of Ukraine and its people has been thrown into ever-sharper focus by a week of murderous Russian air attacks, which have killed civilians, while hopes for a US-led peace, and Donald Trump staying engaged in efforts to achieve one, appear to be diminishing.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Events in Ukraine over the last 24 hours have been utterly barbaric. Bad even by the standards of this horrendous war.   Multiple Iranian drones and North Korean missiles laden with explosives brought carnage to swathes of the country, killing yet more civilians. This was Russia's answer to President Donald Trump's peace plan and ultimatum. Normally, strangely reluctant to criticise Russia, even Trump was moved to implore Vladimir Putin to \"STOP\". Ukraine latest - Trump unhappy with Putin But in truth, throughout Trump's Ukraine peace process - if it can be called that - most of America's pressure has been on Ukraine. The peace plan that has emerged from direct US talks, which were mainly with Russia, is one-sided, and to Ukraine and its European partners, it is a surrender plan which is impossible for Ukraine to accept. Even Russia's supporter in this war, China, has problems with it, in particular with America's proposal that Russia is rewarded for its invasion with sovereignty of Crimea. \n                  Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too\n                 \n                  Day 95: Is Trump really 'close' to securing a deal for Ukraine?  \n                 \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 Far from heading towards a peace deal, we are now, it seems, careering towards a crunch point that could see America give up on Ukraine completely, possibly blaming Kyiv for failure and renewing relations with Moscow. Might will be proven right, and Vladimir Putin will be emboldened to do it all over again in a few years, possibly against other countries too. That is the fear in chancelleries across Europe. There are two key questions now.  Does Trump mean he will walk away from trying to broker peace or supporting Ukraine entirely? And if he does, can Ukraine carry on without US help? European nations have said they will carry on supporting Ukraine. They see its survival and victory as essential for their own security. They already give Ukraine €40bn in financial and military help. Ukraine would need another €20bn or so to fill the US gap - not that tall an order. And they are beefing up their defence industries to do more to give Ukraine what it needs to fight Russia. Ukraine's defence increasingly depends on a homegrown drone industry, which doesn't rely on American backing. But Ukraine does need US intelligence, aerial defence support and satellite coverage provided by Starlink. Were they to lose all that, they could be in trouble. What exactly Trump does if and, as seems increasingly likely, when his deal fails, he is not making clear. But what seems certain is America is caring less and less for Ukraine's plight under this president. Read more:Student killed in school stabbingIndia and Pakistan tensions rise after attackYoung people on the reality of knife crimeOasis fans 'lost £2m to ticket scams' That poses some urgent and pressing questions for Europe. Its leaders have always said they will support Ukraine \"whatever it takes, as long as it takes\". Do they have the political will and unity to do that, even without America by their side?"
    },
    {
        "title": "Rain, kisses and lifting a football curse: When Pope Francis came to Knock",
        "description": "It was a dank miserable day when the Aer Lingus flight - callsign Shepherd 1 - splashed down at Ireland West Airport in Knock, Co Mayo. Pretty typical for August in these parts, they say.&#160;",
        "url": "https://news.sky.com/story/rain-kisses-and-lifting-a-football-curse-when-pope-francis-came-to-knock-13355011",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-knock_6895750.jpg?20250424182951",
        "type": "Home",
        "Author": "Stephen Murphy",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "The funeral of Pope Francis will be watched keenly in the west of Ireland this weekend. The sadness felt by the people of Knock will be a measure of the fondness for their famous visitor, a man who was both pope and pilgrim.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n  It was a dank miserable day when the Aer Lingus flight - callsign Shepherd 1 - splashed down at Ireland West Airport in Knock, Co Mayo. Pretty typical for August in these parts, they say.  But when Pope Francis carefully descended the slippery stairs on 26 August 2018, he received a greeting that cut through the chill. \"I seized my opportunity and I gave him a kiss on both cheeks,\" admitted Mary McCarthy, laughing at the egregious breach of protocol. \"We'd been briefed to greet him naturally, but I don't think he was too upset. I've a picture to prove that he was okay about it. He got an Irish welcome, maybe with an Italian twist.\" Ms McCarthy, her husband John and their four children had the honour of greeting Francis, as he had requested a local family to meet him ahead of dignitaries. \"He was just like us,\" says Ms McCarthy. \"Very joyful to be in the west of Ireland.\" Read more: How Pope Francis broke with tradition - even in death Diplomats were further perturbed when a Mayo Gaelic football jersey was thrust into the hands of the Holy Father. The county has famously failed to win the All-Ireland Championship since 1951, when the returning victorious team apparently overtook a funeral cortege, and were cursed by an angry priest. Mayo's long quest to lift the Sam Maguire trophy is part of Irish lore. \"Mayo for Sam!\" then US president Joe Biden would shout when he visited these parts five years later. In 2018, \"Mayo for Psalm\" was emblazoned on t-shirts at Knock, as the Pope - a keen football fan - simply scribbled \"Francis\" on the jersey with a marker. But divine intervention has yet to appear. Mayo have lost two more finals since Pope Francis endorsed the shirt. \"Maybe this is the year,\" Ms McCarthy hopes. \"Maybe the Holy Father is going to do it all the way from heaven. I think he'll be a saint of some sort, and I'll definitely be praying to him for a win.\" It was the second day of Francis's flying visit to Ireland, the first by a pontiff since John Paul II in 1979. He too had come to Knock, the site of Ireland's most famous shrine. Around a million people a year visit the chapel where an apparition appeared to locals in 1879. Eyewitness: What it was like seeing the open coffin of Pope Francis Here, Francis paused in silent prayer, before meeting with parishioners including Terry and Maureen Campbell, and their daughter Karen. \"It was just a magical moment,\" recalls Ms Campbell. \"Just waiting for him to come around and meet Karen, it was such a great privilege, a great honour.\" \"Karen couldn't believe it was the Pope, when it was all over she couldn't believe she had actually met the Pope,\" says Mr Campbell. It's a difficult time for the couple as their daughter, who had Down's syndrome and other complications, died three years ago at the age of 44. \"When he did pass away, the first thing I said to Maureen was 'he's with Karen'. Because Karen to me was a saint. Just even talking about it…I get full up, you know,\" says Mr Campbell. Although Francis felt obliged to address the thorny issue of historic clerical abuse in his address at Knock - begging for forgiveness - in his unscripted moments in Co Mayo, he appeared content and jovial. Fr Richard Gibbons, the parish priest and rector of Knock Shrine, remembers that. \"I welcomed him here personally and told him a little bit about the apparition, and then he asked a few questions about it. He was in a very happy kind of mood. He was joyful, in great form and he rose the spirits of everybody who was here.\" The funeral of Francis will be watched keenly in the west of Ireland this weekend. The sadness felt by the people of Knock will be a measure of the fondness for their famous visitor; a man who was both pope and pilgrim. You can watch full coverage of the Pope's funeral live on Sky News on Saturday"
    },
    {
        "title": "Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too",
        "description": "First he took the US on a collision course with China. Then he came for the rest of the world.",
        "url": "https://news.sky.com/story/trump-has-shifted-the-priorities-of-the-worlds-economic-policymakers-but-their-views-of-the-us-have-changed-too-13355162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-imf-meeting-rachel-reeves-with-others_6896028.jpg?20250425030742",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "Countries across the world are eager for Donald Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n First he took the US on a collision course with China. Then he came for the rest of the world. He crashed into the financial markets and now Donald Trump has been gently tapping on the brakes all week. The world's economic policymakers have been on quite the journey over the past few months. Many of them will have felt a little queasy as they got off the plane in Washington DC for the International Monetary Fund's (IMF) annual spring meetings. This was their opportunity to talk. To strategise, strengthen alliances and figure out their next move. Rachel Reeves was in the mix. While all the focus has been on a US-UK trade deal - and she is due to meet her US counterpart on Friday - the chancellor was also here to meet her G7 and G20 allies. Countries across the world are eager for Mr Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner. \n                  A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters\n                 \n                  Day 95: Is Trump really 'close' to securing a deal for Ukraine?  \n                 \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 That much was obvious from a conversation with Paschal Donohoe, Ireland's finance minister and president of the Eurogroup. He told Sky News that Ireland, a highly US-orientated economy, was diversifying. That being said, he was \"more optimistic than some\" that a high level of trade integration would prevail well into the future. \"What I think is very possible is the structure of that globalisation could begin to change,\" he said.  That changing structure might include a rejection of China's decades-long model of export-led growth. Since joining the World Trade Organisation in 2001, China has been pumping out cheap goods into the world economy, making far more than it consumes at home. Poor countries across the world have taken a similar approach to development but the US Treasury secretary said on the sidelines of the IMF on Wednesday that it was \"absurd\" for multilateral institutions to continue treating China like a developing economy. He called for a \"rebalancing\". Read more from Sky News: Student killed and three injured in stabbing at French schoolWho will be at the Pope's funeral - and who won't be There is a recognition among world leaders that some of Mr Trump's grievances are reasonable. They believe his approach is the wrong one but in interviews they are now talking about the negative consequences of trade imbalances and globalisation - the impact on communities and the undercutting of wages. That wasn't the case just a few months ago. 👉 Follow Trump 100 on your podcast app 👈 Ms Reeves took it one step further. On Wednesday, the Treasury announced plans to tackle the dumping of cheap goods into the UK - no doubt aimed at China. She announced a review of the customs' treatment of low-value imports. Currently goods valued at £135 escape the duty. The US has already taken action. In an interview with Sky News, she said she was acting in the \"national interest\" but she is also looking for common ground with the Americans, as she seeks a deal that secures a reduction in tariffs. Speaking to US media on Thursday, she reiterated her shared concerns: \"I absolutely understand the concerns the United States have about imbalances in trade in the global economy, particularly when it comes to China that runs large, persistent trade surpluses with countries around the world, including the US and indeed including the United Kingdom.\" The IMF too. While the Fund sharply downgrades global growth forecasts, it shied away from openly criticising the US president.  Kristalina Georgieva, the IMF's managing director, spoke of an erosion of trust between countries, and \"concerns about the uneven distribution of gains from economic integration, its impact on the international division of labour, supply chain security, and global imbalances\". So, Mr Trump has got policymakers to shift their priorities. At the very least, he has brought a long-simmering issue to the boil. The world is thinking differently about China now. The US is also showing signs that it's thinking differently. After a bruising showdown with the bond markets, Mr Trump has rowed back on his liberation day tariffs. The administration has softened its language, saying it wants reform and to work with institutions. The president said tariffs could come down substantially on China. However, a lot of damage has already been done - not only his erratic tariffs policy, but also his attack on institutions, including the US Federal Reserve. The world is now thinking differently about the US too, as are the markets. Investors normally dive into US assets - government debt and the dollar - during times of turmoil, but Mr Trump's pronouncement has caused traders to do the opposite. There are signs that the world is losing faith in the US' ultimate safe haven status."
    },
    {
        "title": "Public failed by water regulators and government as bills rise, spending watchdog says",
        "description": "Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said.",
        "url": "https://news.sky.com/story/public-failed-by-water-regulators-and-government-as-bills-rise-spending-watchdog-says-13354889",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-sewage-spills-thames_6505233.jpg?20240330143917",
        "type": "Home",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "As trust in the water industry reaches a record low, bills are rising at a rate last seen 20 years ago.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said. Public trust in the water sector has reached a record low, according to a report from the National Audit Office (NAO) on the privatised industry. Not since monitoring began in 2011 has consumer trust been at such a level, it said. At the same time, households face double-digit bill hikes over the next five years. The last time bills rose at this rate was just before the global financial crash, between 2004-05 and 2005-06. Regulation failure All three water regulators - Ofwat, the Environment Agency and Drinking Water Inspectorate - and the government department for environment, food and rural affairs (Defra) have played a role in the failure, the NAO said, adding they do not know enough about the condition or age of water infrastructure and the level of funding needed to maintain it. \n                  'Disgraceful' amount of sewage still being dumped in English rivers, says environment secretary\n                 \n                  Three quarters of a million pieces of rubbish found on UK beaches\n                 \n                  An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most\n                 Since the utilities were privatised in 1989, the average rate of replacement for water assets is 125 years, the watchdog said. If the current pace is maintained, it will take 700 years to replace the existing water mains. Water firms have grappled with leaky pipes and record sewage outflows into UK waterways in recent years, with enforcement action under way against all wastewater companies. Despite there being three regulators tasked with water, there is no one responsible for proactively inspecting wastewater to prevent environmental harm, the report found. Instead, regulation is reactive, fining firms when harm has already occurred. Financial penalties and rewards, however, have not worked as water company performance hasn't been \"consistent or significantly improved\" in recent years, the report said. 'Gaps, inconsistencies, tension' The NAO called for this to change and for a body to be tasked with the whole process and assets. At present, the Drinking Water Inspectorate monitors water coming into a house, but there is no entity looking at water leaving a property. Similarly no body is tasked with cybersecurity for wastewater businesses. As well as there being gaps, \"inconsistent\" watchdog responsibilities cause \"tension\" and overlap, the report found. The Environment Agency has no obligation to balance customer affordability with its duty to the environment when it assesses plans, the NAO said.  Company and investment criticism Regulators have also been blamed for failing to drive enough funding into the water sector. From having spoken to investors through numerous meetings, the NAO learnt that confidence had declined, which has made it more expensive to invest in companies providing water. Even investors found Ofwat's five-yearly price review process \"complex and difficult\", the report said. Financial resilience of the industry has \"weakened\" with Ofwat having signalled concerns about the financial resilience of 10 of the 16 major water companies. Most notably, the UK's largest provider, Thames Water, faced an uncertain future and potential nationalisation before securing an emergency £3bn loan, adding to its already massive £16bn debt pile. Read more from Sky News:Hundreds of jobs at risk as The Original Factory Shop launches survival planGovernment to decide on 'postcode pricing' plan for electricity bills by summer Water businesses have been overspending, with only some extra spending linked to high inflation in recent years, leading to rising bills, the NAO said. Over the next 25 years, companies plan to spend £290bn on infrastructure and investment, while Ofwat estimates a further £52bn will be needed to deliver up to 30 water supply projects, including nine reservoirs. What else is going on? From today, a new government law comes into effect which could see water bosses who cover up illegal sewage spills imprisoned for up to two years. Such measures are necessary, Defra said, as some water companies have obstructed investigations and failed to hand over evidence on illegal sewage discharges, preventing crackdowns. Meanwhile, the Independent Water Commission (IWC), led by former Bank of England deputy governor Sir Jon Cunliffe, is carrying out the largest review of the industry since privatisation. What the regulators and government say?  In response to the report, Ofwat said: \"The NAO's report is an important contribution to the debate about the future of the water industry. \"We agree with the NAO's recommendations for Ofwat and we continue to progress our work in these areas, and to contribute to the IWC's wider review of the regulatory framework. We also look forward to the IWC's recommendations and to working with government and other regulators to better deliver for customers and the environment.\" An Environment Agency spokesperson said: \"We have worked closely with the National Audit Office in producing this report and welcome its substantial contribution to the debate on the future of water regulation. \"We recognise the significant challenges facing the water industry. That is why we will be working with Defra and other water regulators to implement the report's recommendations and update our frameworks to reflect its findings.\" A Defra spokesperson said: \"The government has taken urgent action to fix the water industry - but change will not happen overnight. \"We have put water companies under tough special measures through our landmark Water Act, with new powers to ban the payment of bonuses to polluting water bosses and bring tougher criminal charges against them if they break the law.\" Water UK, which represents the water firms, has been contacted for comment."
    },
    {
        "title": "Chris Eubank Jr vs Conor Benn: From fight time to who's on the undercard - here's everything you need to know",
        "description": "Chris Eubank Jr and Conor Benn will be battling it out in an eagerly-awaited middleweight bout this weekend.",
        "url": "https://news.sky.com/story/chris-eubank-jr-vs-conor-benn-from-fight-time-to-whos-on-the-undercard-heres-everything-you-need-to-know-13354979",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-eubank-jr-conor-benn_6895665.jpg?20250424170848",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "The two British boxers will finally fight years after their initial bout was called off, continuing in the footsteps of their fathers.",
        "Content": "Chris Eubank Jr and Conor Benn will be battling it out in an eagerly-awaited middleweight bout this weekend. The British boxers are not just settling their own dispute - they are continuing a family rivalry going back decades. But what exactly is the story between Eubank Jr and Benn and who's on the undercard? Here's everything you need to know ahead of the fight. When is Eubank Jr vs Benn? Eubank Jr and Benn will finally take to the ring as the main event on Saturday 26 April. Their fight will be the third at the Tottenham Hotspur Stadium, after Oleksandr Usyk's victory over Anthony Joshua in September 2021 and Tyson Fury's win against Derek Chisora in December 2022. The two fighters are expected to make their ring walks from 9.45pm UK time, but coverage on Sky Sports Box Office will start from 5pm. \n                  Mansfield Town footballer Lucas Akins jailed for causing death of cyclist in car crash\n                 \n                  UK weather: Large parts of country set to be warm and sunny early next week\n                 \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 What to know about the fight Eubank Jr, 35, is the more experienced of the pair, going into the fight with a record of 34-3 (25 KOs). Benn, 28, has won all 23 of his professional fights, 14 by KO. They will fight at a middleweight limit of 11st 6lbs, with the inclusion of a hydration clause meaning neither are able to add more than 10lbs in weight between Friday's weigh-in and Saturday's fight night. Eubank Jr fought at 11st 5lb when he beat Kamil Szeremeta in October, while Benn is jumping up two weights from welterweight having come in at 10st 10lbs for his win over Peter Dobson in February 2024. The stakes are high While there are no titles up for grabs, Turki Alalshikh, chairman of Saudi Arabia's General Entertainment Authority, told Sky Sports that a shot at pound-for-pound great and super-middleweight king Canelo Alvarez would be on the line in Saturday's fight. And the World Boxing Council (WBC) has said it would back the winner on Saturday to take Alvarez on. \"It is a major event that has all the elements a fan can expect,\" WBC president Mauricio Sulaiman said of Eubank vs Benn. \"The rivalry between the parents which became a rivalry between the kids. Heated press conferences, social media… When the bell rings, it is going to be something for the memory of everyone and hopefully the fight comes up to the expectations.\" The ongoing Eubank and Benn feud The fighters' fathers fought twice in 1990 and 1993, with Eubank Sr clinching a ninth-round TKO victory against Nigel Benn in the pair's first bout before the two fought to a draw three years later. But the sons have built a rivalry of their own over the past few years, despite not being able to bring it to the ring until now. They were meant to fight on 8 October 2022 at the O2 Arena, but Benn failed two voluntary drug tests that resulted in the contest being cancelled just 48 hours before it was scheduled to take place. Benn tested positive for the banned substance clomifene in two Voluntary Anti-Doping Association (VADA) tests, before having his licence removed by the British Boxing Board of Control. Read more:Woman who faked being a man to get into Magic Circle finally allowed inNandy to sign off appointment of Kogan as top football referee Benn's suspension was lifted in a ruling by the National Anti-Doping Panel (NADP) in July 2023, with the 28-year-old making his return to the ring that September in a unanimous decision win over Rodolfo Orozco in Orlando. He went on to beat Peter Dobson by unanimous decision in Nevada in February 2024, before his suspension was reintroduced in May following an appeal from UKAD and the BBBoC. His provisional suspension was eventually lifted in November 2024 after the NADP said it was \"not comfortably satisfied\" he had committed a doping offence. Since the fight was delayed, the pair have had frequent spats in the media, the most high-profile of which came in February during a face-off at a press conference in Manchester. Eubank Jr slapped Benn with an egg, leading the two fighters to be held back by security while Nigel Benn, the father of Conor, appeared to grab Eubank Jr by the throat. The stunt was seemingly in relation to the WBC's claim in early 2023 that a \"highly-elevated consumption of eggs\" was a \"reasonable explanation\" for Benn's failed test. Eubank Jr subsequently posted on X: \"Apparently egg contamination was the reason for his two failed drugs tests. So I contaminated him with an egg.\" Who is on the undercard? Former WBO cruiserweight champion Chris Billam-Smith will take on Brandon Glanton in a bid to reignite another world title charge after losing out to Gilberto Ramirez in their unification clash last November. British light-heavyweight rivals Anthony Yarde and Lyndon Arthur will meet for a third time after boasting one victory apiece, Liam Smith takes on Aaron McKenna in his first fight since being stopped by Eubank Jr in their September 2023 rematch, and Viddal Riley and Cheavon Clarke face off on a defining night for their respective careers as rising cruiserweight contenders. Here's the full card: Main event: Chris Eubank Jr vs Conor Benn - middleweight Anthony Yarde vs Lyndon Arthur 3 - light-heavyweight Liam Smith vs Aaron McKenna - middleweight Chris Billam-Smith vs Brandon Glanton - cruiserweight Viddal Riley vs Cheavon Clarke - cruiserweight What have the fighters said? Benn didn't hold back earlier this week as he told Sky Sports: \"I hate what he [Eubank Jr] stands for. I hate who he is as a man, what he's chasing. \"Just him as a man personally for reasons that aren't public, personal reasons, between me and Chris that he's fully aware of as to why I really dislike him. \"A fight's a fight. Obviously there is interest with the history of our dads, us being our fathers' sons, the apple doesn't fall far from the tree. \"But I think there's a big personality clash, the controversy, the adversity, it sells. It doesn't change the outcome of April 26 and what I'm going to do to him.\" He said his goal was to retire the 35-year-old. Speaking during a face-off in London on Wednesday, his competitor was more focused on what would happen in the ring. \"I don't do shenanigans. I do what I believe is right and I do what I want to do,\" Eubank Jr noted. \"I'm just being me. \"This fight isn't about size or weight. It's about skill. It's about dedication. It's about expertise. All those areas I excel in,\" Eubank said. \"I'm a complete fighter, I've been doing this for so long now I've forgotten more things than he knows and that will show on the night. \"Everything will go how I want it to go. \"I will be like a matador in the ring and Conor Benn will be the bull.\""
    },
    {
        "title": "Tech firms face fines up to £60,000 for failing to remove knife crime content",
        "description": "Social media companies will be fined up to &#163;60,000 each time a post relating to knife crime is not removed from their sites in a bid to stop children viewing \"sickening\" content.",
        "url": "https://news.sky.com/story/tech-firms-face-fines-up-to-16360000-for-failing-to-remove-knife-crime-content-13355131",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "The government is extending measures to fine individual tech executives whose platforms fail to remove knife content - but campaigners say more still needs to be done amid soaring knife crime rates.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Social media companies will be fined up to £60,000 each time a post relating to knife crime is not removed from their sites in a bid to stop children viewing \"sickening\" content. The new sanction expands on previously announced plans to fine individual tech executives up to £10,000 if their platforms fail to remove material advertising or glorifying knives following 48 hours of a police warning. It means tech platforms and their executives could collectively face up to £70,000 in penalties for every post relating to knife crime they fail to remove, with the new laws applying to online search engines as well as social media platforms and marketplaces. Crime and policing minister Dame Diana Johnson said the content that young people scroll through every day online \"is sickening\" adding: \"That is why we are now going further than ever to hold to account the tech companies who are not doing enough to safeguard young people from content which incites violence, particularly in young boys.\" The sanctions for tech platforms will be introduced via an amendment to the Crime and Policing Bill. It is separate to the Online Safety Bill, which aims to protect children from online harm, which some campaigners and parents have criticised for not going far enough. The Home Office said today's announcement follows \"significant consultation\" with the Coalition to Tackle Knife Crime, launched by Sir Keir Starmer in September as part of his bid to half knife offences in a decade. \n                  Student killed and three injured in stabbing at French school\n                 \n                  Murder arrest after woman stabbed to death in Enfield - as victim named\n                 \n                  'Children can't go to the shop without fear of being stabbed': Young people in Birmingham drill recording studio on reality of knife crime\n                 Patrick Green, chief executive of The Ben Kinsella Trust, a knife prevention charity which is part of the coalition, welcomed the measure, telling Sky News social media companies have \"proved themselves to be incapable of self-regulation\". \"There's been a real reluctance of social media companies to take action sufficiently quickly. It's shameful, we shouldn't need legislation,\" he said.  The Ben Kinsella Trust is named after teenager Ben Kinsella who was fatally stabbed in 2008 on the way home from the pub after celebrating his GCSEs. Months earlier, Ben had written to then prime minister Gordon Brown to urge his government to tackle knife crime. Knife crime rates soar However, the problem has soared since then. In the year to March 2024, there were 53 teenage victims aged 13-19 in England and Wales, according to the Office for National Statistics. That is a 140% increase on the 22 teenage victims a decade earlier. Overall, police recorded 54,587 knife-related offences in 2024, up 2% on the previous year and more than double the 26,000 offences recorded in 2014. Mr Green told Sky News that while knife crime has been happening \"long before social media took hold\", online content glamorising the possession of a knife is hindering efforts to reduce it. \"There will be pictures of these knives [on social media] with 'follow me' luring young people onto places where these knives are sold. It's never been easier for a child to buy a knife.\" 'One part of a larger problem' However, while welcoming today's announcement he said social media was \"one part of a larger problem\", adding that \"provisions of youth services have been decimated\" and \"much more needs to be done\". The government's plan to halve knife crime in a decade includes banning zombie-style knives and ninja swords, with a nationwide surrender scheme launching in July, and stronger laws for online retailers selling knives. Ministers also want to increase prison sentences for selling weapons to under-18s and introduce a new offence for possessing a weapon with intent for violence, with a prison sentence of up to four years. Read more:Young people in Birmingham drill recording studio on reality of knife crimeWhat are the UK's knife crime laws - and how could they be tightened? Government 'can't police the internet' Last month, Conservative MP Ben Obese-Jecty suggested violent videos viewed online should be used as evidence to prosecute under the new law. He was speaking during a debate he secured on knife crime, in which he criticised a wider culture which \"valorises\" criminality and gangs in music and the media. On the measures announced today, the Huntingdon MP told Sky News that while \"any measures to help reduce instances of knife crime are hugely welcome\", he was doubtful that the sanctions could be effectively enforced. \"The sheer scale of content on social media that glorifies or incites violence is staggering, let alone content returned by search engines,\" he said. \"The government can't possibly hope to realistically police the internet. \"The government must tackle the culture that promotes and encourages the use of knives and ensure that there are robust consequences to doing so, not simply pretend they will have online content removed.\""
    },
    {
        "title": "VE Day 2025: What are the four-day celebrations to mark 80th anniversary?",
        "description": "Street parties, concerts and a military flypast are just some of the ways the country is set to mark the 80th anniversary of Victory in Europe (VE) Day.",
        "url": "https://news.sky.com/story/ve-day-2025-what-are-the-four-day-celebrations-to-mark-80th-anniversary-13344461",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ve-day-anniversary_6887945.png?20250416095616",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "To mark the historic moment the Second World War ended in Europe in 1945, tonnes of events have been planned around the UK. Here is everything you need to know.",
        "Content": "Street parties, concerts and a military flypast are just some of the ways the country is set to mark the 80th anniversary of Victory in Europe (VE) Day. Victory in Europe Day - to give it its full name - marks the end of the Second World War in Europe on 8 May 1945, when the Allies accepted the surrender of Nazi Germany. Four days of celebrations have been organised by the government for this year's anniversary, which will run from Monday 5 May to Thursday 8 May. Planned events include a military procession and flypast in central London and 2,500 beacons being lit across the UK. Britons have also been urged to gather together in streets, gardens, town halls, clubs and pubs, similar to how people marked the end of nearly six years of war 80 years ago. Here is everything you need to know about the celebrations and how to get involved. Military procession and flypast VE Day celebrations will begin outside Parliament Square in central London at midday. Here, an actor will recite extracts from the iconic Winston Churchill VE Day speech. A young person will pass the Commonwealth War Graves Torch for Peace to a 100-year-old Second World War veteran who served in the Normandy campaign. The Household Cavalry Mounted Regiment and The King's Troop, Royal Horse Artillery will then lead the procession from Parliament Square, down Whitehall. They will travel past the Cenotaph, which will be draped in Union Jack flags, continue up to Trafalgar Square, under Admiralty Arch and down the Mall towards the Queen Victoria Memorial outside Buckingham Palace. They will be followed by a procession group featuring marching members of the Royal Navy, the Royal Marines, the British Army and the Royal Air Force. Cadets and other uniformed youth groups will also take part. The King and Queen, along with other members of the royal family and the prime minister, will join Second World War veterans to watch the military procession. People will then be invited to fill the Mall - before a flypast of the Red Arrows and 23 current and historic military aircraft takes place. The flypast will include a Voyager transport aircraft, a P8 Poseidon surveillance aircraft, Typhoon and F-35 fighter jets and will culminate with the red, white, and blue smoke of the Royal Air Force's Red Arrows. Historic Second World War-era aircraft from the Royal Air Force Battle of Britain Memorial Flight will also take part. Watch VE Day coverage live on Sky News from 10am, with Sarah-Jane Mee hosting a special programme from Canada Gate at Buckingham Palace. She will be joined by Royal correspondent Rhiannon Mills and Sky News Royal events commentator Alastair Bruce. Street parties Various street parties, barbecues and community events will be held on the Bank Holiday Monday to mark VE Day. After the procession and flypast, the King and Queen will host a tea party for veterans and members of the Second World War generation at Buckingham Palace. HMS Belfast, the most significant surviving Second World War warship, will host an afternoon tea street party and an evening party in London, with talks from keynote speakers. Elsewhere around the country, highlights on 5 May include an open-air music festival in Witton Park, Blackburn, complete with fairground rides, inflatables, stalls and food, a VE Day picnic in the Shropshire town of Caven Arms and a performance of wartime music by the Wrentham Brass Band in Norfolk. In the South and South East of England, the Fort Amherst Heritage Trust in Chatham is hosting tours of the Napoleonic fort with music, food and drink, while Winston Churchill's family home, Chartwell in Kent, will have family activities and live music. In the Welsh village of Myddfai, nestled in the Brecon Beacons, there will be a street party, with attendees invited to bring food, dress in 1940s-style clothing and sing along to wartime songs. Click here for a full list of local events An installation of 30,000 ceramic poppies will return to the Tower of London on 6 May for the VE Day anniversary. The ornaments - which will be viewed by the Queen when they go on display - were originally made in 2014 as part of the Blood Swept Lands and Seas of Red installation, which marked 100 years since Britain's involvement in the First World War. The latest installation, overseen by designer Tom Piper, will feature tens of thousands of the original ceramic poppies on loan from the Imperial War Museum, as a way to \"mark and reflect on the sacrifices made by so many during the Second World War\". A small part of the poppy installation will be visible to the public for free, with the main installation located inside the grounds of the Tower. It will remain in place until 11 November to mark Armistice Day. Historic landmarks across the UK will also be lit up on the evening of the 6 May, which you can watch on Sky News with live helicopter shots capturing the scenes. In the evening of 7 May, an anniversary concert will take place in Westminster Hall at the Palace of Westminster. It will mark 80 years since a newsflash told the nation that the next day would be known as Victory Day. The Parliament Choir will perform pieces of classic music from across Europe and America, with the addition of special guests. Events planned to mark VE Day itself will kick off with a service in Westminster Abbey, with 1,800 people invited to attend including the King and Queen, veterans, politicians and charities. In the afternoon, the Royal British Legion, a UK-based charity that supports veterans, will host a private tea party for Second World War veterans and their families. It will take place at the National Memorial Arboretum in Staffordshire and aims to include veterans who live in the North of England and cannot travel to events in London. The tea party is expected to attract a large crowd, if not the largest group of Second World War veterans at a VE Day event, and you can watch live coverage of it on Sky News. In County Fermanagh, Northern Ireland, there will be a parade of 80 pipers and drummers along Church Street in Enniskillen. Pubs will also be allowed to stay open for an extra two hours on 8 May, meaning people will be able to raise a glass until 1am to mark the end of the four-day celebration. Concerts and film premiere The government's VE Day programme of events will conclude with a concert at Horse Guards Parade between 8pm and 10pm on 8 May. The concert will feature \"stars of the stage and screen\" as well as performances from military musicians, readings and poignant moments that will tell the story of VE Day and the nation's reaction to the end of the Second World War. More than 12,500 people are expected to attend the event, including the King and Queen, as well as 2,500 young people made up of Duke of Edinburgh ambassadors, Commonwealth scholars and representatives from youth groups. Meanwhile, from 7.30pm at the Royal Albert Hall, the Armed Forces charity SSAFA will host VE Day 80: The Party. This will feature The RAF Squadronaires, part of the central band of the Royal Air Force, who will perform 1940s songs, and the Royal Philharmonic Concert Orchestra, who will perform the nation's best-loved classical anthems. A new short film by the National Theatre will also be released on 8 May. The Next Morning, written by stage and screenwriter James Graham, will feature award-winning actors Julian Glover, Sian Phillips, and Joseph Mydell and will take viewers through a series of stories exploring intergenerational perspectives on the end of the war. Bringing the day to an end, 2,500 beacons will be lit across the UK. The fires will be ignited around 9pm, including on the River Thames at London's Tower Bridge, in Folkstone, Kent, Bridport in Dorset, Fairhaven Lake and Gardens in Lancashire and Cowes on the Isle of Wight. Community events around the country will continue into the weekend, although these have not been officially organised by the government. On the Friday night, there will be a 1940s style dance in Wouldham, Rochester, with a hog roast, a 1940s wartime band and authentic Second World War jeep. On 10 May in Enniskillen, Northern Ireland, there will be a community concert by the band, bugles, pipes and drums of The Royal Irish Regiment at St Macartin's Cathedral. In Glasgow on 10 May, there will be a church service at the Veterans Memorial Garden on Baldwin Avenue, followed by a veterans parade. This will finish at the Lincoln Inn where there will be a buffet, music and raffle. In the Yorkshire village of Catton, there will be a vintage-themed day featuring Second World War memorabilia and vehicles. A similar event is also set to take place in Keelby village hall, in Lincolnshire."
    },
    {
        "title": "Prince William mobbed by selfie-hunters outside youth centre",
        "description": "The Prince of Wales was mobbed by passers-by after visiting a youth centre in south London on Thursday. ",
        "url": "https://news.sky.com/story/prince-william-mobbed-by-selfie-hunters-outside-youth-centre-13355096",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-william-mentivity_6895920.jpg?20250424212807",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-24 21:17:00",
        "Headline": "The royal found himself surrounded after paying a visit to Mentivity in Walworth, south London, where he played video games and chatted with a group of young people.",
        "Content": "The Prince of Wales was mobbed by passers-by after visiting a youth centre in south London on Thursday.  The royal was hugged by well-wishers and posed for a series of selfies after visiting Mentivity in Walworth. The youth club, hailed as \"fantastic\" by the prince, aims to mentor and inspire young people to \"achieve their full potential\". During the visit, Prince William played video games with its members – losing a virtual football match but winning a Mario Kart race – and chatted with its founders and Rik Salmon, an executive from Spotify, which is working with Mentivity. Mr Salmon revealed afterwards that the royal had told him he used the music streaming platform to find new music and that it helped him to calm down. Meanwhile, Zia Adeniyi, 10, who raced the prince in Mario Kart, said: \"He said he didn't know how to play it and he kept asking me the controls and then he beat me.\" Oluwaseyi Soyebo-Idowu, 50, who posed for a photo with the royal outside the venue, said: \"I'm very excited... it was very nice to meet him. He was so humble, bringing himself down to ordinary level.\" The prince was met by a large crowd outside the venue, after word spread in the local area about his visit, with people surrounding him as he walked the short distance to his waiting car."
    },
    {
        "title": "Kashmir tourist attack stokes long-held tensions between India and Pakistan amid fears of military escalation",
        "description": "It's a crime scene that could have global consequences.",
        "url": "https://news.sky.com/story/kashmir-tourist-attack-stokes-long-held-tensions-between-india-and-pakistan-amid-fears-of-military-escalation-13355075",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kashmiri-indian_6895875.jpg?20250424204644",
        "type": "Home",
        "Author": "Neville Lazarus",
        "Date Published": "2025-04-24 19:22:00",
        "Headline": "The nuclear-armed neighbours both claim the scenic Himalayan territory of Kashmir as their own and have fought over it before, so Tuesday's attack that killed 26 tourists is a potential flashpoint for further conflict.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  It's a crime scene that could have global consequences. Two nuclear-armed neighbours with decades of hostility and mistrust are threatening each other again after a militant gun attack in disputed Kashmir. India and Pakistan have fought several wars and skirmishes since their independence from Britain in 1947. The latest flashpoint is Tuesday's murder of tourists who were enjoying holidays in a meadow in Pahalgam, known as mini-Switzerland. A group of militants opened fire, killing 26 men and injuring dozens more. India has accused Pakistan of harbouring, arming and sheltering militant organisations whose members infiltrate the almost 500-mile border in Kashmir and attack the state. Pakistan denies the accusation and says it only supports Kashmiris' right to self-determination. \n                  Pakistan warns Kashmir row could lead to 'all-out war' with India\n                 \n                  India and Pakistan tensions ramp up after Kashmir killings\n                 \n                  India closes Pakistan border and expels diplomats over Kashmir 'terror attack' \n                 Leaders of both countries have turned up the heat, with Indian Prime Minister Narendra Modi telling a rally in the east Indian state of Bihar that his government will \"identify, track and punish every terrorist and their backers. We will pursue them to the ends of the earth\". \"Terrorism will not go unpunished. Every effort will be made to ensure that justice is done.\"  New Delhi's diplomatic response included revoking visas, expelling military advisers, closing a border crossing and suspending the Indus Water Treaty. Pakistan Prime Minister Shehbaz Sharif reacted at a meeting on Thursday of the country's national security committee, passing reciprocal measures and warning that the suspension of the treaty would be considered an act of war. 'Unacceptable at any cost' Pakistan's foreign minister Ishaq Dar said \"any such unilateral action is unacceptable at any cost\". In 2019, a suicide bomber in a vehicle killed 40 paramilitary soldiers in a military convoy. India blamed Pakistan for giving shelter to Islamist terrorists and conducted limited airstrikes across the border. A tense stand-off between the two nuclear-armed neighbours has lasted since. Later that year, Mr Modi's government suspended the special status of Jammu and Kashmir, the only Muslim majority state in India and brought it directly under the control of New Delhi. The Kargil War in May 1999 led to a stand-off often described as a nuclear flashpoint. Pakistan's military covertly occupied Indian posts across the line of control (LoC). After the war began, Pakistan asked US President Bill Clinton to help de-escalate the conflict. The result was the Washington Accord, under which Prime Minister Nawaz Sharif agreed to withdraw Pakistani troops and restore the LoC. But the United Jihad Council, an umbrella organisation of extremist groups, rejected the deal and decided to continue fighting the Indian state. 2008 Mumbai terror attack left 166 dead The 2008 Mumbai terror attack was evidence of this, when 166 people were killed by 10 terrorists belonging to Lashkar-e-Taiba (LeT), a group alleged to have close ties to Pakistan's spy agency, the Inter-Service Intelligence (ISI). The killings went on for four days at iconic places across the city. The only gunman who was caught, Ajmal Kasab, said the attackers were members of the terror group before he was executed in 2012. For decades, Kashmir has been caught up in the vortex of violence, conflict, killings and kidnappings. Pakistan says Kashmir remains an unresolved dispute, and they will continue to support the right of self-determination of its people. Read more:Pakistan warns of 'all-out war'India and Pakistan tensions rise Pakistan's 'jugular vein' Last week, the all-powerful Pakistan army chief General Asim Munir said Kashmir was their \"jugular vein\" and Islamabad \"will not leave our Kashmiri brothers in their heroic struggle\". Kashmir is the crown over which the two nuclear-armed neighbours have fought wars and are in a perpetual state of tension. The mistrust between the two countries has grown over the years, and there is little diplomatic manoeuvring to bridge that gap. And, after the Pahalgaum attack, there is every chance of an escalation that could be devastating to its people."
    },
    {
        "title": "Mansfield Town footballer Lucas Akins jailed for causing death of cyclist in car crash",
        "description": "A professional footballer has been jailed for causing the death of a cyclist in a car crash.",
        "url": "https://news.sky.com/story/mansfield-town-footballer-lucas-akins-jailed-for-causing-death-of-cyclist-in-car-crash-13354401",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yorkshire-huddersfield_6895630.jpg?20250424162754",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-24 17:00:00",
        "Headline": "Lucas Akins started a League One game for Mansfield Town just hours after pleading guilty to causing the death of Adrian Daniel by careless or inconsiderate driving.",
        "Content": "A professional footballer has been jailed for causing the death of a cyclist in a car crash. Mansfield Town forward Lucas Akins crashed into Adrian Daniel in his Mercedes G350 in Huddersfield on 17 March 2022, while taking his daughter to a piano lesson. Leeds Crown Court heard that Mr Daniel, 33, suffered catastrophic head injuries and died 10 days later. Akins, 36, played in Mansfield's 0-0 draw with Wigan on 4 March, hours after pleading guilty at Leeds Crown Court to death by careless or inconsiderate driving. The footballer has continued to play for Mansfield since the incident. Judge Alex Menary said on Thursday that he had considered imposing a suspended sentence, but had concluded that only an immediate sentence of 14 months' imprisonment was appropriate. A spokesperson for Mansfield Town FC said it \"acknowledges\" the court's decision and offered the club's \"sincere and deepest condolences to the family of Adrian Daniel at this difficult time\". \n                  Jamie Vardy to leave Leicester City at the end of the season\n                 \n                  Nandy to sign off appointment of Kogan as top football referee\n                 \n                  Chelsea fans condemn 'unethical' ticket resale site - which club chairman invests in\n                 \"The club is considering its position with regards to Lucas and will be making no further comment at this stage,\" the spokesperson added. 'Like hell' Prosecuting, Carmel Pearson said it was a \"difficult junction to emerge from\" but that the defendant \"did not stop at the give-way sign\". Savanna Daniel, Mr Daniel's wife, told the court it had been \"like hell and a nightmare [she is] not waking up from\". \"There was no reason for Adrian to be killed that way,\" she said, adding it was \"too simple a collision to have taken a life\". Mrs Daniel said she did not want Akins's children growing up without their father as she did not want \"any more lives to be destroyed from this\", but she criticised the defendant for failing to plead guilty at an earlier stage. Tim Pole, representing Akins, said he was \"fundamentally a decent, honest and hard-working individual\". \"I want to publicly apologise on his behalf,\" he said. Mr Pole added that Akins understood Mrs Daniel's \"frustration and anger\" over the time it took him to plead guilty. Handing down his sentence, the judge accepted that Akins's remorse was genuine but by not admitting to the offence at an earlier stage, he had prolonged Mrs Daniel's \"heartache and grief\". After the sentencing, Mrs Daniel said \"three years of hell\" had come to a close, in a statement via West Yorkshire Police. She said Akins had made a \"farce\" of the justice system and that his failure to plead guilty sooner \"makes a mockery of any remorse that Akins offers for his actions\". Akins, who has played for Mansfield Town since 2022 and was previously with clubs including Huddersfield Town, Tranmere Rovers and Burton Albion, was also suspended from driving for 12 months."
    },
    {
        "title": "UK weather: Large parts of country set to be warm and sunny early next week",
        "description": "Much of the UK will bask in warm, sunny conditions at the start of next week, with inland temperatures up to 10C higher than average, but it's a mixed picture before then.",
        "url": "https://news.sky.com/story/uk-weather-large-parts-of-country-set-to-be-warm-and-sunny-early-next-week-13354898",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yorkshire-weather-spring_6895553.jpg?20250424143235",
        "type": "UK",
        "Author": "Jo Robinson",
        "Date Published": "2025-04-24 13:55:00",
        "Headline": "There'll be more rain over the next few days, mainly in the West, but it looks like high pressure will settle things down from Sunday.",
        "Content": "\n          Weather producer\n              @SkyJoRobinson\n Much of the UK will bask in warm, sunny conditions at the start of next week, with inland temperatures up to 10C higher than average, but it's a mixed picture before then. The first half of spring brought warmth and sunshine for many, but the last 10 days have been more changeable. Some areas of Ireland, Northern Ireland, southwest Wales, and southwest England have seen much-needed rainfall, whereas parts of northern Britain have observed very little. See the latest weather forecast where you are Tyne and Wear in northeast England has recorded just 7% of its average April rainfall, whereas Cornwall in the southwest of the country has already seen 156%. And the Milford Haven rain gauge in Wales has seen over twice its average April rainfall. There'll be more rain over the next few days, mainly in the West, but it looks like high pressure will settle things down from Sunday. \n                  Second homes to be taxed double by most councils - a 'naked cash grab' or not far enough?\n                 \n                  Cornwall: Men found guilty of £100m cocaine fishing boat plot\n                 \n                  Claire Chick: Paul Antony Butler appears in court charged with murdering Plymouth University lecturer\n                 Temperatures will rise too, becoming widely above average on Monday and Tuesday. Highs of 22C (72F) to 24C (75F) can be expected. The highest temperature of the year so far is 24C (75F), seen at Northolt in northwest London on Saturday 12 April. The settled conditions will bring plenty of sunshine, with UV levels expected to be around moderate. Tree pollen levels will be high in the South, low to moderate in the North. What happens from next Wednesday onwards is unclear. A thundery breakdown is possible from the South, or wet and windy conditions may move in from the North West. Other computer models suggest high pressure will hold on, with the fine weather continuing and potentially higher temperatures. The last time that 25C (77C) was reached in April was during the COVID-19 lockdown in 2020. The highest temperature ever recorded in April was 29.4C (85F), seen at Camden Square in London on 16 April 1949. All this means that it will be quite warm for the London Marathon, which will take place this Sunday. Temperatures will be around 11-12C (52-54F) at the start, potentially peaking at a warm 22C (70F). That's a little off the highest temperature ever recorded for the race, which stands at 24.2C (76F) seen at St James's Park in 2018. But it will be a lot higher than the 12.6C (55F) seen last year. Read more on Sky News:Tesco apologises to 'humiliated' customerChildren growing up around knife crimeShoplifting hits record high It'll be dry for runners and spectators, with sunny spells and light winds. Competitors in the Manchester Marathon on Sunday will face similar conditions to London's runners; it should be dry with sunny spells. The temperature first thing will be around 9C (48F), but it'll warm up with a high of about 19C (66F)."
    },
    {
        "title": "Public failed by water regulators and government as bills rise, spending watchdog says",
        "description": "Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said.",
        "url": "https://news.sky.com/story/public-failed-by-water-regulators-and-government-as-bills-rise-spending-watchdog-says-13354889",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-sewage-spills-thames_6505233.jpg?20240330143917",
        "type": "UK",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "As trust in the water industry reaches a record low, bills are rising at a rate last seen 20 years ago.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said. Public trust in the water sector has reached a record low, according to a report from the National Audit Office (NAO) on the privatised industry. Not since monitoring began in 2011 has consumer trust been at such a level, it said. At the same time, households face double-digit bill hikes over the next five years. The last time bills rose at this rate was just before the global financial crash, between 2004-05 and 2005-06. Regulation failure All three water regulators - Ofwat, the Environment Agency and Drinking Water Inspectorate - and the government department for environment, food and rural affairs (Defra) have played a role in the failure, the NAO said, adding they do not know enough about the condition or age of water infrastructure and the level of funding needed to maintain it. \n                  'Disgraceful' amount of sewage still being dumped in English rivers, says environment secretary\n                 \n                  Three quarters of a million pieces of rubbish found on UK beaches\n                 \n                  An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most\n                 Since the utilities were privatised in 1989, the average rate of replacement for water assets is 125 years, the watchdog said. If the current pace is maintained, it will take 700 years to replace the existing water mains. Water firms have grappled with leaky pipes and record sewage outflows into UK waterways in recent years, with enforcement action under way against all wastewater companies. Despite there being three regulators tasked with water, there is no one responsible for proactively inspecting wastewater to prevent environmental harm, the report found. Instead, regulation is reactive, fining firms when harm has already occurred. Financial penalties and rewards, however, have not worked as water company performance hasn't been \"consistent or significantly improved\" in recent years, the report said. 'Gaps, inconsistencies, tension' The NAO called for this to change and for a body to be tasked with the whole process and assets. At present, the Drinking Water Inspectorate monitors water coming into a house, but there is no entity looking at water leaving a property. Similarly no body is tasked with cybersecurity for wastewater businesses. As well as there being gaps, \"inconsistent\" watchdog responsibilities cause \"tension\" and overlap, the report found. The Environment Agency has no obligation to balance customer affordability with its duty to the environment when it assesses plans, the NAO said.  Company and investment criticism Regulators have also been blamed for failing to drive enough funding into the water sector. From having spoken to investors through numerous meetings, the NAO learnt that confidence had declined, which has made it more expensive to invest in companies providing water. Even investors found Ofwat's five-yearly price review process \"complex and difficult\", the report said. Financial resilience of the industry has \"weakened\" with Ofwat having signalled concerns about the financial resilience of 10 of the 16 major water companies. Most notably, the UK's largest provider, Thames Water, faced an uncertain future and potential nationalisation before securing an emergency £3bn loan, adding to its already massive £16bn debt pile. Read more from Sky News:Hundreds of jobs at risk as The Original Factory Shop launches survival planGovernment to decide on 'postcode pricing' plan for electricity bills by summer Water businesses have been overspending, with only some extra spending linked to high inflation in recent years, leading to rising bills, the NAO said. Over the next 25 years, companies plan to spend £290bn on infrastructure and investment, while Ofwat estimates a further £52bn will be needed to deliver up to 30 water supply projects, including nine reservoirs. What else is going on? From today, a new government law comes into effect which could see water bosses who cover up illegal sewage spills imprisoned for up to two years. Such measures are necessary, Defra said, as some water companies have obstructed investigations and failed to hand over evidence on illegal sewage discharges, preventing crackdowns. Meanwhile, the Independent Water Commission (IWC), led by former Bank of England deputy governor Sir Jon Cunliffe, is carrying out the largest review of the industry since privatisation. What the regulators and government say?  In response to the report, Ofwat said: \"The NAO's report is an important contribution to the debate about the future of the water industry. \"We agree with the NAO's recommendations for Ofwat and we continue to progress our work in these areas, and to contribute to the IWC's wider review of the regulatory framework. We also look forward to the IWC's recommendations and to working with government and other regulators to better deliver for customers and the environment.\" An Environment Agency spokesperson said: \"We have worked closely with the National Audit Office in producing this report and welcome its substantial contribution to the debate on the future of water regulation. \"We recognise the significant challenges facing the water industry. That is why we will be working with Defra and other water regulators to implement the report's recommendations and update our frameworks to reflect its findings.\" A Defra spokesperson said: \"The government has taken urgent action to fix the water industry - but change will not happen overnight. \"We have put water companies under tough special measures through our landmark Water Act, with new powers to ban the payment of bonuses to polluting water bosses and bring tougher criminal charges against them if they break the law.\" Water UK, which represents the water firms, has been contacted for comment."
    },
    {
        "title": "Rise in school suspensions and exclusion",
        "description": "England's schools are under fresh scrutiny after government data revealed a sizeable increase in both suspensions and permanent exclusions.",
        "url": "https://news.sky.com/story/rise-in-school-suspensions-and-exclusion-13354990",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pupil-school-classroom_6895688.jpg?20250424173928",
        "type": "UK",
        "Author": "Anjum Peerbacos",
        "Date Published": "2025-04-24 17:50:00",
        "Headline": "Almost 300,000 pupils were ordered to temporarily stay away from classrooms during the  2023/24 spring term, a 12% increase on the year before, the Department for Education has revealed.",
        "Content": "\n          Education reporter\n       England's schools are under fresh scrutiny after government data revealed a sizeable increase in both suspensions and permanent exclusions. According to the Department for Education, almost 300,000 pupils were suspended during the spring term of 2023/24, an increase of 12% recorded in spring 2022/23. Suspensions have nearly doubled since spring 2019, surging 93% from 153,465 back then. Meanwhile, permanent exclusions were also higher and went from 3,039 to 3,107, a 2% rise. At Lewis Hamilton's charity Mission 44, chief executive Jason Arthur said: \"We are continuing to see the number of children losing learning due to suspensions and exclusions grow year on year - especially for vulnerable learners who face disadvantage or discrimination.\" The reasons for both the suspensions and permanent exclusions were \"persistent disruptive behaviour\" but many voices from the education sector say the figures tell a deeper story about post‑pandemic pressures. Mr Arthur said: \"Persistent disruptive behaviour continues to be the most common reason – yet taking children out of the classroom often only addresses the symptom and not the underlying causes of poor behaviour.\" Read more from Sky News:Student killed in stabbing at French schoolIndia and Pakistan tensions rise after attackOasis fans 'lost £2m to ticket scams' Campaigners and unions have also reacted with concern. Head of the Association of School and College Leaders Pepe Di'Iasio warned: \"Young people only have one chance at a good education … missing classroom time damages their future.\" He urged ministers to back \"early intervention strategies\" rather than rely on exclusions as a quick fix. Paul Whiteman, from the National Association of Head Teachers, echoed the plea, highlighting how poverty, the cost of living crisis and lingering pandemic fallout were fuelling bad behaviour. He stressed that schools \"need funded, specialist help\" to tackle the root causes. Charity director Steve Haines said: \"Over 295,000 suspensions is a stark warning: our schools aren't set up to support all students. Disadvantaged youngsters are four times more likely to be suspended.\" The Education Minister Stephen Morgan acknowledged the \"broken system,\" vowing that the government's \"Plan for Change\" will roll out mental‑health professionals in every school, boost SEND support and expand free breakfast clubs – measures he says will curb the \"underlying causes of poor behaviour\"."
    },
    {
        "title": "VE Day 2025: What are the four-day celebrations to mark 80th anniversary?",
        "description": "Street parties, concerts and a military flypast are just some of the ways the country is set to mark the 80th anniversary of Victory in Europe (VE) Day.",
        "url": "https://news.sky.com/story/ve-day-2025-what-are-the-four-day-celebrations-to-mark-80th-anniversary-13344461",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ve-day-anniversary_6887945.png?20250416095616",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "To mark the historic moment the Second World War ended in Europe in 1945, tonnes of events have been planned around the UK. Here is everything you need to know.",
        "Content": "Street parties, concerts and a military flypast are just some of the ways the country is set to mark the 80th anniversary of Victory in Europe (VE) Day. Victory in Europe Day - to give it its full name - marks the end of the Second World War in Europe on 8 May 1945, when the Allies accepted the surrender of Nazi Germany. Four days of celebrations have been organised by the government for this year's anniversary, which will run from Monday 5 May to Thursday 8 May. Planned events include a military procession and flypast in central London and 2,500 beacons being lit across the UK. Britons have also been urged to gather together in streets, gardens, town halls, clubs and pubs, similar to how people marked the end of nearly six years of war 80 years ago. Here is everything you need to know about the celebrations and how to get involved. Military procession and flypast VE Day celebrations will begin outside Parliament Square in central London at midday. Here, an actor will recite extracts from the iconic Winston Churchill VE Day speech. A young person will pass the Commonwealth War Graves Torch for Peace to a 100-year-old Second World War veteran who served in the Normandy campaign. The Household Cavalry Mounted Regiment and The King's Troop, Royal Horse Artillery will then lead the procession from Parliament Square, down Whitehall. They will travel past the Cenotaph, which will be draped in Union Jack flags, continue up to Trafalgar Square, under Admiralty Arch and down the Mall towards the Queen Victoria Memorial outside Buckingham Palace. They will be followed by a procession group featuring marching members of the Royal Navy, the Royal Marines, the British Army and the Royal Air Force. Cadets and other uniformed youth groups will also take part. The King and Queen, along with other members of the royal family and the prime minister, will join Second World War veterans to watch the military procession. People will then be invited to fill the Mall - before a flypast of the Red Arrows and 23 current and historic military aircraft takes place. The flypast will include a Voyager transport aircraft, a P8 Poseidon surveillance aircraft, Typhoon and F-35 fighter jets and will culminate with the red, white, and blue smoke of the Royal Air Force's Red Arrows. Historic Second World War-era aircraft from the Royal Air Force Battle of Britain Memorial Flight will also take part. Watch VE Day coverage live on Sky News from 10am, with Sarah-Jane Mee hosting a special programme from Canada Gate at Buckingham Palace. She will be joined by Royal correspondent Rhiannon Mills and Sky News Royal events commentator Alastair Bruce. Street parties Various street parties, barbecues and community events will be held on the Bank Holiday Monday to mark VE Day. After the procession and flypast, the King and Queen will host a tea party for veterans and members of the Second World War generation at Buckingham Palace. HMS Belfast, the most significant surviving Second World War warship, will host an afternoon tea street party and an evening party in London, with talks from keynote speakers. Elsewhere around the country, highlights on 5 May include an open-air music festival in Witton Park, Blackburn, complete with fairground rides, inflatables, stalls and food, a VE Day picnic in the Shropshire town of Caven Arms and a performance of wartime music by the Wrentham Brass Band in Norfolk. In the South and South East of England, the Fort Amherst Heritage Trust in Chatham is hosting tours of the Napoleonic fort with music, food and drink, while Winston Churchill's family home, Chartwell in Kent, will have family activities and live music. In the Welsh village of Myddfai, nestled in the Brecon Beacons, there will be a street party, with attendees invited to bring food, dress in 1940s-style clothing and sing along to wartime songs. Click here for a full list of local events An installation of 30,000 ceramic poppies will return to the Tower of London on 6 May for the VE Day anniversary. The ornaments - which will be viewed by the Queen when they go on display - were originally made in 2014 as part of the Blood Swept Lands and Seas of Red installation, which marked 100 years since Britain's involvement in the First World War. The latest installation, overseen by designer Tom Piper, will feature tens of thousands of the original ceramic poppies on loan from the Imperial War Museum, as a way to \"mark and reflect on the sacrifices made by so many during the Second World War\". A small part of the poppy installation will be visible to the public for free, with the main installation located inside the grounds of the Tower. It will remain in place until 11 November to mark Armistice Day. Historic landmarks across the UK will also be lit up on the evening of the 6 May, which you can watch on Sky News with live helicopter shots capturing the scenes. In the evening of 7 May, an anniversary concert will take place in Westminster Hall at the Palace of Westminster. It will mark 80 years since a newsflash told the nation that the next day would be known as Victory Day. The Parliament Choir will perform pieces of classic music from across Europe and America, with the addition of special guests. Events planned to mark VE Day itself will kick off with a service in Westminster Abbey, with 1,800 people invited to attend including the King and Queen, veterans, politicians and charities. In the afternoon, the Royal British Legion, a UK-based charity that supports veterans, will host a private tea party for Second World War veterans and their families. It will take place at the National Memorial Arboretum in Staffordshire and aims to include veterans who live in the North of England and cannot travel to events in London. The tea party is expected to attract a large crowd, if not the largest group of Second World War veterans at a VE Day event, and you can watch live coverage of it on Sky News. In County Fermanagh, Northern Ireland, there will be a parade of 80 pipers and drummers along Church Street in Enniskillen. Pubs will also be allowed to stay open for an extra two hours on 8 May, meaning people will be able to raise a glass until 1am to mark the end of the four-day celebration. Concerts and film premiere The government's VE Day programme of events will conclude with a concert at Horse Guards Parade between 8pm and 10pm on 8 May. The concert will feature \"stars of the stage and screen\" as well as performances from military musicians, readings and poignant moments that will tell the story of VE Day and the nation's reaction to the end of the Second World War. More than 12,500 people are expected to attend the event, including the King and Queen, as well as 2,500 young people made up of Duke of Edinburgh ambassadors, Commonwealth scholars and representatives from youth groups. Meanwhile, from 7.30pm at the Royal Albert Hall, the Armed Forces charity SSAFA will host VE Day 80: The Party. This will feature The RAF Squadronaires, part of the central band of the Royal Air Force, who will perform 1940s songs, and the Royal Philharmonic Concert Orchestra, who will perform the nation's best-loved classical anthems. A new short film by the National Theatre will also be released on 8 May. The Next Morning, written by stage and screenwriter James Graham, will feature award-winning actors Julian Glover, Sian Phillips, and Joseph Mydell and will take viewers through a series of stories exploring intergenerational perspectives on the end of the war. Bringing the day to an end, 2,500 beacons will be lit across the UK. The fires will be ignited around 9pm, including on the River Thames at London's Tower Bridge, in Folkstone, Kent, Bridport in Dorset, Fairhaven Lake and Gardens in Lancashire and Cowes on the Isle of Wight. Community events around the country will continue into the weekend, although these have not been officially organised by the government. On the Friday night, there will be a 1940s style dance in Wouldham, Rochester, with a hog roast, a 1940s wartime band and authentic Second World War jeep. On 10 May in Enniskillen, Northern Ireland, there will be a community concert by the band, bugles, pipes and drums of The Royal Irish Regiment at St Macartin's Cathedral. In Glasgow on 10 May, there will be a church service at the Veterans Memorial Garden on Baldwin Avenue, followed by a veterans parade. This will finish at the Lincoln Inn where there will be a buffet, music and raffle. In the Yorkshire village of Catton, there will be a vintage-themed day featuring Second World War memorabilia and vehicles. A similar event is also set to take place in Keelby village hall, in Lincolnshire."
    },
    {
        "title": "Chris Eubank Jr vs Conor Benn: From fight time to who's on the undercard - here's everything you need to know",
        "description": "Chris Eubank Jr and Conor Benn will be battling it out in an eagerly-awaited middleweight bout this weekend.",
        "url": "https://news.sky.com/story/chris-eubank-jr-vs-conor-benn-from-fight-time-to-whos-on-the-undercard-heres-everything-you-need-to-know-13354979",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-chris-eubank-jr-conor-benn_6895665.jpg?20250424170848",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "The two British boxers will finally fight years after their initial bout was called off, continuing in the footsteps of their fathers.",
        "Content": "Chris Eubank Jr and Conor Benn will be battling it out in an eagerly-awaited middleweight bout this weekend. The British boxers are not just settling their own dispute - they are continuing a family rivalry going back decades. But what exactly is the story between Eubank Jr and Benn and who's on the undercard? Here's everything you need to know ahead of the fight. When is Eubank Jr vs Benn? Eubank Jr and Benn will finally take to the ring as the main event on Saturday 26 April. Their fight will be the third at the Tottenham Hotspur Stadium, after Oleksandr Usyk's victory over Anthony Joshua in September 2021 and Tyson Fury's win against Derek Chisora in December 2022. The two fighters are expected to make their ring walks from 9.45pm UK time, but coverage on Sky Sports Box Office will start from 5pm. \n                  Mansfield Town footballer Lucas Akins jailed for causing death of cyclist in car crash\n                 \n                  UK weather: Large parts of country set to be warm and sunny early next week\n                 \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 What to know about the fight Eubank Jr, 35, is the more experienced of the pair, going into the fight with a record of 34-3 (25 KOs). Benn, 28, has won all 23 of his professional fights, 14 by KO. They will fight at a middleweight limit of 11st 6lbs, with the inclusion of a hydration clause meaning neither are able to add more than 10lbs in weight between Friday's weigh-in and Saturday's fight night. Eubank Jr fought at 11st 5lb when he beat Kamil Szeremeta in October, while Benn is jumping up two weights from welterweight having come in at 10st 10lbs for his win over Peter Dobson in February 2024. The stakes are high While there are no titles up for grabs, Turki Alalshikh, chairman of Saudi Arabia's General Entertainment Authority, told Sky Sports that a shot at pound-for-pound great and super-middleweight king Canelo Alvarez would be on the line in Saturday's fight. And the World Boxing Council (WBC) has said it would back the winner on Saturday to take Alvarez on. \"It is a major event that has all the elements a fan can expect,\" WBC president Mauricio Sulaiman said of Eubank vs Benn. \"The rivalry between the parents which became a rivalry between the kids. Heated press conferences, social media… When the bell rings, it is going to be something for the memory of everyone and hopefully the fight comes up to the expectations.\" The ongoing Eubank and Benn feud The fighters' fathers fought twice in 1990 and 1993, with Eubank Sr clinching a ninth-round TKO victory against Nigel Benn in the pair's first bout before the two fought to a draw three years later. But the sons have built a rivalry of their own over the past few years, despite not being able to bring it to the ring until now. They were meant to fight on 8 October 2022 at the O2 Arena, but Benn failed two voluntary drug tests that resulted in the contest being cancelled just 48 hours before it was scheduled to take place. Benn tested positive for the banned substance clomifene in two Voluntary Anti-Doping Association (VADA) tests, before having his licence removed by the British Boxing Board of Control. Read more:Woman who faked being a man to get into Magic Circle finally allowed inNandy to sign off appointment of Kogan as top football referee Benn's suspension was lifted in a ruling by the National Anti-Doping Panel (NADP) in July 2023, with the 28-year-old making his return to the ring that September in a unanimous decision win over Rodolfo Orozco in Orlando. He went on to beat Peter Dobson by unanimous decision in Nevada in February 2024, before his suspension was reintroduced in May following an appeal from UKAD and the BBBoC. His provisional suspension was eventually lifted in November 2024 after the NADP said it was \"not comfortably satisfied\" he had committed a doping offence. Since the fight was delayed, the pair have had frequent spats in the media, the most high-profile of which came in February during a face-off at a press conference in Manchester. Eubank Jr slapped Benn with an egg, leading the two fighters to be held back by security while Nigel Benn, the father of Conor, appeared to grab Eubank Jr by the throat. The stunt was seemingly in relation to the WBC's claim in early 2023 that a \"highly-elevated consumption of eggs\" was a \"reasonable explanation\" for Benn's failed test. Eubank Jr subsequently posted on X: \"Apparently egg contamination was the reason for his two failed drugs tests. So I contaminated him with an egg.\" Who is on the undercard? Former WBO cruiserweight champion Chris Billam-Smith will take on Brandon Glanton in a bid to reignite another world title charge after losing out to Gilberto Ramirez in their unification clash last November. British light-heavyweight rivals Anthony Yarde and Lyndon Arthur will meet for a third time after boasting one victory apiece, Liam Smith takes on Aaron McKenna in his first fight since being stopped by Eubank Jr in their September 2023 rematch, and Viddal Riley and Cheavon Clarke face off on a defining night for their respective careers as rising cruiserweight contenders. Here's the full card: Main event: Chris Eubank Jr vs Conor Benn - middleweight Anthony Yarde vs Lyndon Arthur 3 - light-heavyweight Liam Smith vs Aaron McKenna - middleweight Chris Billam-Smith vs Brandon Glanton - cruiserweight Viddal Riley vs Cheavon Clarke - cruiserweight What have the fighters said? Benn didn't hold back earlier this week as he told Sky Sports: \"I hate what he [Eubank Jr] stands for. I hate who he is as a man, what he's chasing. \"Just him as a man personally for reasons that aren't public, personal reasons, between me and Chris that he's fully aware of as to why I really dislike him. \"A fight's a fight. Obviously there is interest with the history of our dads, us being our fathers' sons, the apple doesn't fall far from the tree. \"But I think there's a big personality clash, the controversy, the adversity, it sells. It doesn't change the outcome of April 26 and what I'm going to do to him.\" He said his goal was to retire the 35-year-old. Speaking during a face-off in London on Wednesday, his competitor was more focused on what would happen in the ring. \"I don't do shenanigans. I do what I believe is right and I do what I want to do,\" Eubank Jr noted. \"I'm just being me. \"This fight isn't about size or weight. It's about skill. It's about dedication. It's about expertise. All those areas I excel in,\" Eubank said. \"I'm a complete fighter, I've been doing this for so long now I've forgotten more things than he knows and that will show on the night. \"Everything will go how I want it to go. \"I will be like a matador in the ring and Conor Benn will be the bull.\""
    },
    {
        "title": "Tech firms face fines up to £60,000 for failing to remove knife crime content",
        "description": "Social media companies will be fined up to &#163;60,000 each time a post relating to knife crime is not removed from their sites in a bid to stop children viewing \"sickening\" content.",
        "url": "https://news.sky.com/story/tech-firms-face-fines-up-to-16360000-for-failing-to-remove-knife-crime-content-13355131",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "The government is extending measures to fine individual tech executives whose platforms fail to remove knife content - but campaigners say more still needs to be done amid soaring knife crime rates.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Social media companies will be fined up to £60,000 each time a post relating to knife crime is not removed from their sites in a bid to stop children viewing \"sickening\" content. The new sanction expands on previously announced plans to fine individual tech executives up to £10,000 if their platforms fail to remove material advertising or glorifying knives following 48 hours of a police warning. It means tech platforms and their executives could collectively face up to £70,000 in penalties for every post relating to knife crime they fail to remove, with the new laws applying to online search engines as well as social media platforms and marketplaces. Crime and policing minister Dame Diana Johnson said the content that young people scroll through every day online \"is sickening\" adding: \"That is why we are now going further than ever to hold to account the tech companies who are not doing enough to safeguard young people from content which incites violence, particularly in young boys.\" The sanctions for tech platforms will be introduced via an amendment to the Crime and Policing Bill. It is separate to the Online Safety Bill, which aims to protect children from online harm, which some campaigners and parents have criticised for not going far enough. The Home Office said today's announcement follows \"significant consultation\" with the Coalition to Tackle Knife Crime, launched by Sir Keir Starmer in September as part of his bid to half knife offences in a decade. \n                  Student killed and three injured in stabbing at French school\n                 \n                  Murder arrest after woman stabbed to death in Enfield - as victim named\n                 \n                  'Children can't go to the shop without fear of being stabbed': Young people in Birmingham drill recording studio on reality of knife crime\n                 Patrick Green, chief executive of The Ben Kinsella Trust, a knife prevention charity which is part of the coalition, welcomed the measure, telling Sky News social media companies have \"proved themselves to be incapable of self-regulation\". \"There's been a real reluctance of social media companies to take action sufficiently quickly. It's shameful, we shouldn't need legislation,\" he said.  The Ben Kinsella Trust is named after teenager Ben Kinsella who was fatally stabbed in 2008 on the way home from the pub after celebrating his GCSEs. Months earlier, Ben had written to then prime minister Gordon Brown to urge his government to tackle knife crime. Knife crime rates soar However, the problem has soared since then. In the year to March 2024, there were 53 teenage victims aged 13-19 in England and Wales, according to the Office for National Statistics. That is a 140% increase on the 22 teenage victims a decade earlier. Overall, police recorded 54,587 knife-related offences in 2024, up 2% on the previous year and more than double the 26,000 offences recorded in 2014. Mr Green told Sky News that while knife crime has been happening \"long before social media took hold\", online content glamorising the possession of a knife is hindering efforts to reduce it. \"There will be pictures of these knives [on social media] with 'follow me' luring young people onto places where these knives are sold. It's never been easier for a child to buy a knife.\" 'One part of a larger problem' However, while welcoming today's announcement he said social media was \"one part of a larger problem\", adding that \"provisions of youth services have been decimated\" and \"much more needs to be done\". The government's plan to halve knife crime in a decade includes banning zombie-style knives and ninja swords, with a nationwide surrender scheme launching in July, and stronger laws for online retailers selling knives. Ministers also want to increase prison sentences for selling weapons to under-18s and introduce a new offence for possessing a weapon with intent for violence, with a prison sentence of up to four years. Read more:Young people in Birmingham drill recording studio on reality of knife crimeWhat are the UK's knife crime laws - and how could they be tightened? Government 'can't police the internet' Last month, Conservative MP Ben Obese-Jecty suggested violent videos viewed online should be used as evidence to prosecute under the new law. He was speaking during a debate he secured on knife crime, in which he criticised a wider culture which \"valorises\" criminality and gangs in music and the media. On the measures announced today, the Huntingdon MP told Sky News that while \"any measures to help reduce instances of knife crime are hugely welcome\", he was doubtful that the sanctions could be effectively enforced. \"The sheer scale of content on social media that glorifies or incites violence is staggering, let alone content returned by search engines,\" he said. \"The government can't possibly hope to realistically police the internet. \"The government must tackle the culture that promotes and encourages the use of knives and ensure that there are robust consequences to doing so, not simply pretend they will have online content removed.\""
    },
    {
        "title": "Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too",
        "description": "First he took the US on a collision course with China. Then he came for the rest of the world.",
        "url": "https://news.sky.com/story/trump-has-shifted-the-priorities-of-the-worlds-economic-policymakers-but-their-views-of-the-us-have-changed-too-13355162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-imf-meeting-rachel-reeves-with-others_6896028.jpg?20250425030742",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "Countries across the world are eager for Donald Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n First he took the US on a collision course with China. Then he came for the rest of the world. He crashed into the financial markets and now Donald Trump has been gently tapping on the brakes all week. The world's economic policymakers have been on quite the journey over the past few months. Many of them will have felt a little queasy as they got off the plane in Washington DC for the International Monetary Fund's (IMF) annual spring meetings. This was their opportunity to talk. To strategise, strengthen alliances and figure out their next move. Rachel Reeves was in the mix. While all the focus has been on a US-UK trade deal - and she is due to meet her US counterpart on Friday - the chancellor was also here to meet her G7 and G20 allies. Countries across the world are eager for Mr Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner. \n                  A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters\n                 \n                  Day 95: Is Trump really 'close' to securing a deal for Ukraine?  \n                 \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 That much was obvious from a conversation with Paschal Donohoe, Ireland's finance minister and president of the Eurogroup. He told Sky News that Ireland, a highly US-orientated economy, was diversifying. That being said, he was \"more optimistic than some\" that a high level of trade integration would prevail well into the future. \"What I think is very possible is the structure of that globalisation could begin to change,\" he said.  That changing structure might include a rejection of China's decades-long model of export-led growth. Since joining the World Trade Organisation in 2001, China has been pumping out cheap goods into the world economy, making far more than it consumes at home. Poor countries across the world have taken a similar approach to development but the US Treasury secretary said on the sidelines of the IMF on Wednesday that it was \"absurd\" for multilateral institutions to continue treating China like a developing economy. He called for a \"rebalancing\". Read more from Sky News: Student killed and three injured in stabbing at French schoolWho will be at the Pope's funeral - and who won't be There is a recognition among world leaders that some of Mr Trump's grievances are reasonable. They believe his approach is the wrong one but in interviews they are now talking about the negative consequences of trade imbalances and globalisation - the impact on communities and the undercutting of wages. That wasn't the case just a few months ago. 👉 Follow Trump 100 on your podcast app 👈 Ms Reeves took it one step further. On Wednesday, the Treasury announced plans to tackle the dumping of cheap goods into the UK - no doubt aimed at China. She announced a review of the customs' treatment of low-value imports. Currently goods valued at £135 escape the duty. The US has already taken action. In an interview with Sky News, she said she was acting in the \"national interest\" but she is also looking for common ground with the Americans, as she seeks a deal that secures a reduction in tariffs. Speaking to US media on Thursday, she reiterated her shared concerns: \"I absolutely understand the concerns the United States have about imbalances in trade in the global economy, particularly when it comes to China that runs large, persistent trade surpluses with countries around the world, including the US and indeed including the United Kingdom.\" The IMF too. While the Fund sharply downgrades global growth forecasts, it shied away from openly criticising the US president.  Kristalina Georgieva, the IMF's managing director, spoke of an erosion of trust between countries, and \"concerns about the uneven distribution of gains from economic integration, its impact on the international division of labour, supply chain security, and global imbalances\". So, Mr Trump has got policymakers to shift their priorities. At the very least, he has brought a long-simmering issue to the boil. The world is thinking differently about China now. The US is also showing signs that it's thinking differently. After a bruising showdown with the bond markets, Mr Trump has rowed back on his liberation day tariffs. The administration has softened its language, saying it wants reform and to work with institutions. The president said tariffs could come down substantially on China. However, a lot of damage has already been done - not only his erratic tariffs policy, but also his attack on institutions, including the US Federal Reserve. The world is now thinking differently about the US too, as are the markets. Investors normally dive into US assets - government debt and the dollar - during times of turmoil, but Mr Trump's pronouncement has caused traders to do the opposite. There are signs that the world is losing faith in the US' ultimate safe haven status."
    },
    {
        "title": "Jamie Vardy to leave Leicester City at the end of the season",
        "description": "Jamie Vardy has said he will be leaving Leicester City this summer after 13 seasons with the club.",
        "url": "https://news.sky.com/story/jamie-vardy-to-leave-leicester-city-at-the-end-of-the-season-13354956",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-jamie-vardy-leicester_6895624.jpg?20250424162518",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-24 15:25:00",
        "Headline": "The striker has scored 198 goals in 496 appearances for the Foxes since his £1m move from non-League Fleetwood in 2012.",
        "Content": "Jamie Vardy has said he will be leaving Leicester City this summer after 13 seasons with the club. The 38-year-old striker played a pivotal role in their 2015/2016 Premier League title-winning season under manager Claudio Ranieri, scoring 24 goals. He also lifted the FA Cup in 2021 with Brendan Rodgers in charge. The club described Vardy, who has scored 198 goals in 496 appearances for the Foxes, as \"our greatest-ever player\". Vardy has no plans to retire from football and said he was \"gutted\" to be leaving in a parting message to Leicester fans. \"I've had 13 unbelievable years at this club with lots of success, some downs but a majority, all highs, but it's finally time to call it a day, which I'm devastated about but I think the timing is right,\" Vardy said. He went on: \"I just want to sincerely thank you all for taking me in as one of your own. Leicester will always, always have a massive place in my heart and I'll make sure that I will be following for the years to come and what I hope will be even more successful for the club. \n                  Mansfield Town footballer Lucas Akins jailed for causing death of cyclist in car crash\n                 \n                  Nandy to sign off appointment of Kogan as top football referee\n                 \n                  Chelsea fans condemn 'unethical' ticket resale site - which club chairman invests in\n                 \"But as for now, this is my goodbye but you will see me again soon, I promise. Thank you.\" Vardy's rise from the fifth tier of English football to its pinnacle has been impressive. He joined Leicester as a 25-year-old from non-League Fleetwood for £1m in May 2012. He previously played for Stocksbridge Park Steels and FC Halifax Town. Vardy leaves the Foxes just days after the club's most recent relegation was confirmed. After Leicester were relegated from the Premier League, he described the 2024/25 season as \"such a s**tshow\". He apologised to the fans and said: \"Collectively, as players and as a club, we failed.\" Paying tribute to Vardy's career at Leicester, the club's chairman Aiyawatt Srivaddhanaprabha said: \"Jamie is unique. He is a special player and an even more special person. \"He holds a place in the hearts of everyone connected to Leicester City, and he certainly has my deepest respect and affection.\" Read more from Sky News:Student killed and three injured in French schoolIndia and Pakistan tensions ramp upOasis fans lost more than £2m to ticket scams Ranieri in Rome On the day Vardy announced he was leaving Leicester, the man who led him to the 5000/1 Premier League title, Ranieri, was in Rome paying tribute to the late Pope Francis. Ranieri was seen in St Peter's Basilica with players from his current side Roma. The group lined up in front of where the Pope's body lay and paid their respects."
    },
    {
        "title": "A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters",
        "description": "Events in Ukraine over the last 24 hours have been utterly barbaric. Bad even by the standards of this horrendous war.&#160;&#160;",
        "url": "https://news.sky.com/story/a-barbaric-24-hours-in-the-horrendous-russia-ukraine-war-leaves-donald-trumps-peace-plan-in-tatters-13355016",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ukraine-russia_6895139.jpg?20250424062044",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-04-24 16:46:00",
        "Headline": "The plight of Ukraine and its people has been thrown into ever-sharper focus by a week of murderous Russian air attacks, which have killed civilians, while hopes for a US-led peace, and Donald Trump staying engaged in efforts to achieve one, appear to be diminishing.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Events in Ukraine over the last 24 hours have been utterly barbaric. Bad even by the standards of this horrendous war.   Multiple Iranian drones and North Korean missiles laden with explosives brought carnage to swathes of the country, killing yet more civilians. This was Russia's answer to President Donald Trump's peace plan and ultimatum. Normally, strangely reluctant to criticise Russia, even Trump was moved to implore Vladimir Putin to \"STOP\". Ukraine latest - Trump unhappy with Putin But in truth, throughout Trump's Ukraine peace process - if it can be called that - most of America's pressure has been on Ukraine. The peace plan that has emerged from direct US talks, which were mainly with Russia, is one-sided, and to Ukraine and its European partners, it is a surrender plan which is impossible for Ukraine to accept. Even Russia's supporter in this war, China, has problems with it, in particular with America's proposal that Russia is rewarded for its invasion with sovereignty of Crimea. \n                  Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too\n                 \n                  Day 95: Is Trump really 'close' to securing a deal for Ukraine?  \n                 \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 Far from heading towards a peace deal, we are now, it seems, careering towards a crunch point that could see America give up on Ukraine completely, possibly blaming Kyiv for failure and renewing relations with Moscow. Might will be proven right, and Vladimir Putin will be emboldened to do it all over again in a few years, possibly against other countries too. That is the fear in chancelleries across Europe. There are two key questions now.  Does Trump mean he will walk away from trying to broker peace or supporting Ukraine entirely? And if he does, can Ukraine carry on without US help? European nations have said they will carry on supporting Ukraine. They see its survival and victory as essential for their own security. They already give Ukraine €40bn in financial and military help. Ukraine would need another €20bn or so to fill the US gap - not that tall an order. And they are beefing up their defence industries to do more to give Ukraine what it needs to fight Russia. Ukraine's defence increasingly depends on a homegrown drone industry, which doesn't rely on American backing. But Ukraine does need US intelligence, aerial defence support and satellite coverage provided by Starlink. Were they to lose all that, they could be in trouble. What exactly Trump does if and, as seems increasingly likely, when his deal fails, he is not making clear. But what seems certain is America is caring less and less for Ukraine's plight under this president. Read more:Student killed in school stabbingIndia and Pakistan tensions rise after attackYoung people on the reality of knife crimeOasis fans 'lost £2m to ticket scams' That poses some urgent and pressing questions for Europe. Its leaders have always said they will support Ukraine \"whatever it takes, as long as it takes\". Do they have the political will and unity to do that, even without America by their side?"
    },
    {
        "title": "Pakistan warns Kashmir row could lead to 'all-out war' with India",
        "description": "Pakistan's defence minister has told Sky News that a row over a mass shooting in Kashmir could lead to an \"all-out war\" between his country and India.",
        "url": "https://news.sky.com/story/pakistan-warns-kashmir-row-could-lead-to-all-out-war-with-india-13355033",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-indian-soldiers-paramilitary-soldiers_6895917.jpg?20250424212307",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-24 17:53:00",
        "Headline": "Defence minister Khawaja Asif told Sky News his country would \"respond in kind\" to any attack by New Delhi. It comes amid heightened tensions between the two nuclear-armed countries following a shooting that left 26 tourists dead. ",
        "Content": " Pakistan's defence minister has told Sky News that a row over a mass shooting in Kashmir could lead to an \"all-out war\" between his country and India. Speaking to The World with Yalda Hakim, Khawaja Asif said the world should be \"worried\" about the prospect of a full-scale conflict involving the two nations, which both have nuclear weapons. But he also said he hoped the dispute could be resolved via negotiations. It comes after 26 tourists were shot dead by gunmen at a beauty spot in Indian-controlled Kashmir on Tuesday – an attack that the government in New Delhi has blamed on Pakistan. But Mr Asif denied the claim, suggesting India had \"staged\" the shooting in a \"false flag\" operation. He warned his military was \"prepared for any eventuality\" amid escalating tensions and diplomatic measures from both sides. He said: \"We will measure our response to whatever is initiated by India. It would be a measured response. \"If there is an all-out attack or something like that, then obviously there will be an all-out war.\" When asked by Yalda Hakim if the world should be worried, he replied: \"Yes, I think so. The clash between two nuclear powers is always worrisome... \"If things get wrong, there could be a tragic outcome of this confrontation.\" Read more from Sky News:Student killed in stabbing at French schoolFootballer jailed for causing death of cyclistOasis fans 'lost £2m to ticket scams' Both India and Pakistan claim Kashmir as their own, but instead control different sections of the territory. The dispute over the land has claimed the lives of tens of thousands of people over the past three decades, although outbreaks of sporadic violence had eased in recent years – until this week's shooting reignited tensions.  Indian Prime Minister Narendra Modi has vowed to pursue those responsible for the attack \"to the ends of the Earth\". But when asked by Yalda Hakim if he blamed India for the attack, Mr Asif replied: \"Yeah, yeah, yeah. Absolutely. Absolutely, they create these situations.\" However, he added: \"We should be solving our problems through negotiations.\" When asked if US President Donald Trump should get involved to help resolve the looming crisis, Mr Asif said: \"Definitely he leads the world power, the sole world power and he has been talking to different parties in different flashpoints all over the world. \"And this is also a flashpoint which has two nuclear powers that are drawn with each other. I think the attention of this situation and if the world power can intervene and there's some sort of sanity can be brought to this situation, it will be good.\" He added: \"Otherwise, if there is an initiative by India, we'll respond in kind. We will not have any option, have absolutely no option.\""
    },
    {
        "title": "Rain, kisses and lifting a football curse: When Pope Francis came to Knock",
        "description": "It was a dank miserable day when the Aer Lingus flight - callsign Shepherd 1 - splashed down at Ireland West Airport in Knock, Co Mayo. Pretty typical for August in these parts, they say.&#160;",
        "url": "https://news.sky.com/story/rain-kisses-and-lifting-a-football-curse-when-pope-francis-came-to-knock-13355011",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-knock_6895750.jpg?20250424182951",
        "type": "World",
        "Author": "Stephen Murphy",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "The funeral of Pope Francis will be watched keenly in the west of Ireland this weekend. The sadness felt by the people of Knock will be a measure of the fondness for their famous visitor, a man who was both pope and pilgrim.",
        "Content": "\n          Ireland correspondent\n              @SMurphyTV\n  It was a dank miserable day when the Aer Lingus flight - callsign Shepherd 1 - splashed down at Ireland West Airport in Knock, Co Mayo. Pretty typical for August in these parts, they say.  But when Pope Francis carefully descended the slippery stairs on 26 August 2018, he received a greeting that cut through the chill. \"I seized my opportunity and I gave him a kiss on both cheeks,\" admitted Mary McCarthy, laughing at the egregious breach of protocol. \"We'd been briefed to greet him naturally, but I don't think he was too upset. I've a picture to prove that he was okay about it. He got an Irish welcome, maybe with an Italian twist.\" Ms McCarthy, her husband John and their four children had the honour of greeting Francis, as he had requested a local family to meet him ahead of dignitaries. \"He was just like us,\" says Ms McCarthy. \"Very joyful to be in the west of Ireland.\" Read more: How Pope Francis broke with tradition - even in death Diplomats were further perturbed when a Mayo Gaelic football jersey was thrust into the hands of the Holy Father. The county has famously failed to win the All-Ireland Championship since 1951, when the returning victorious team apparently overtook a funeral cortege, and were cursed by an angry priest. Mayo's long quest to lift the Sam Maguire trophy is part of Irish lore. \"Mayo for Sam!\" then US president Joe Biden would shout when he visited these parts five years later. In 2018, \"Mayo for Psalm\" was emblazoned on t-shirts at Knock, as the Pope - a keen football fan - simply scribbled \"Francis\" on the jersey with a marker. But divine intervention has yet to appear. Mayo have lost two more finals since Pope Francis endorsed the shirt. \"Maybe this is the year,\" Ms McCarthy hopes. \"Maybe the Holy Father is going to do it all the way from heaven. I think he'll be a saint of some sort, and I'll definitely be praying to him for a win.\" It was the second day of Francis's flying visit to Ireland, the first by a pontiff since John Paul II in 1979. He too had come to Knock, the site of Ireland's most famous shrine. Around a million people a year visit the chapel where an apparition appeared to locals in 1879. Eyewitness: What it was like seeing the open coffin of Pope Francis Here, Francis paused in silent prayer, before meeting with parishioners including Terry and Maureen Campbell, and their daughter Karen. \"It was just a magical moment,\" recalls Ms Campbell. \"Just waiting for him to come around and meet Karen, it was such a great privilege, a great honour.\" \"Karen couldn't believe it was the Pope, when it was all over she couldn't believe she had actually met the Pope,\" says Mr Campbell. It's a difficult time for the couple as their daughter, who had Down's syndrome and other complications, died three years ago at the age of 44. \"When he did pass away, the first thing I said to Maureen was 'he's with Karen'. Because Karen to me was a saint. Just even talking about it…I get full up, you know,\" says Mr Campbell. Although Francis felt obliged to address the thorny issue of historic clerical abuse in his address at Knock - begging for forgiveness - in his unscripted moments in Co Mayo, he appeared content and jovial. Fr Richard Gibbons, the parish priest and rector of Knock Shrine, remembers that. \"I welcomed him here personally and told him a little bit about the apparition, and then he asked a few questions about it. He was in a very happy kind of mood. He was joyful, in great form and he rose the spirits of everybody who was here.\" The funeral of Francis will be watched keenly in the west of Ireland this weekend. The sadness felt by the people of Knock will be a measure of the fondness for their famous visitor; a man who was both pope and pilgrim. You can watch full coverage of the Pope's funeral live on Sky News on Saturday"
    },
    {
        "title": "India and Pakistan tensions ramp up after Kashmir killings",
        "description": "India and Pakistan have cancelled visas for their citizens to each other's countries as tensions ramp up between the nuclear-armed neighbours following an attack in Kashmir that killed 26 people.",
        "url": "https://news.sky.com/story/india-revokes-all-visas-issued-to-pakistani-nationals-after-deadly-kashmir-attack-13354741",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-india-pakistan-kashmir_6895349.jpg?20250424112520",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-24 10:08:00",
        "Headline": "The latest tit-for-tat measures between India and Pakistan could once again raise the spectre of conflict breaking out between the nuclear-armed neighbours.",
        "Content": " India and Pakistan have cancelled visas for their citizens to each other's countries as tensions ramp up between the nuclear-armed neighbours following an attack in Kashmir that killed 26 people. The victims were mostly Indian tourists who had been visiting Pahalgam, a popular tourist destination in the Indian-held part of the territory, which both nations claim as their own. In response to Tuesday's attack, India closed a border crossing, suspended a water-sharing treaty and downgraded diplomatic ties with Pakistan - which it blames for the assault. The Indian government did not publicly produce any evidence connecting the attack to its neighbour, but said it had \"cross-border\" links to Pakistan. Pakistan has denied the accusations and a previously unknown militant group calling itself Kashmir Resistance has claimed responsibility. On Thursday, India's foreign ministry said all visas issued to Pakistani nationals would be revoked, effective from Sunday. It also advised Indian citizens not to travel to Pakistan and announced other measures including cutting the number of diplomatic staff and closing the only functional land border crossing between the nations. \n                  Kashmir tourist attack stokes long-held tensions between India and Pakistan amid fears of military escalation\n                 \n                  Pakistan warns Kashmir row could lead to 'all-out war' with India\n                 \n                  India closes Pakistan border and expels diplomats over Kashmir 'terror attack' \n                 Pakistan's measures In return, Pakistan said it was closing its airspace to all Indian-owned and operated airlines and suspending all trade with India - including to and from any third country. As a result of the airspace closure, Air India announced that flights to the UK, as well as to North America, Europe and the Middle East, would be forced to take an alternative longer route. Similarly, Pakistan also announced the cancellation of all visas under the SAARC Visa Exemption Scheme - which allows some people to have a \"Special Travel\" document exempting them from visas.  'Act of war' The moves are just the latest escalation of tensions between the two, as Pakistan warned that any suspension of water supplies by India would be viewed as an \"act of war\". Both Pakistan and India saw protesters turn out on the streets, calling on their respective governments to go further. Pakistan's Prime Minister Shehbaz Sharif chaired a meeting of the National Security Committee to respond to India's measures. He warned that any attempt to disrupt the Indus Waters Treaty would be met with \"full force\" from Pakistan. The landmark treaty has so far survived two wars between the countries, in 1965 and 1971, as well as a major border skirmish in 1999. It allows for a water-sharing system that is a lifeline for both countries - in particular for Pakistan's agriculture. 'Ends of the Earth' It comes after Indian Prime Minister Narendra Modi promised to pursue those responsible for the attack \"to the ends of the Earth\". Speaking on Thursday in the eastern state of Bihar, he said: \"I say to the whole world, India will identify, track, and punish every terrorist and their backers. \"We will pursue them to the ends of the Earth.\" Police in Indian Kashmir published notices on Thursday naming three suspected militants it claimed were \"involved in\" the attack. Two of the three suspects were Pakistani nationals, according to the notice. A contested Kashmir India and Pakistan each administer a part of Kashmir, but both claim the territory in its entirety. The region has a long, volatile and complex history. Recent years have seen India claim that violence in the area has calmed - despite a bloody rebellion against New Delhi raging for decades. India claims the militancy in Kashmir is Pakistan-backed terrorism. Pakistan denies this. In a statement on Thursday, the country said it supported the self-determination of the Kashmiri people. Many Muslim Kashmiris, in a Muslim-majority territory, consider the militants part of a home-grown struggle for freedom. Diplomatic relations between the two were already weak before the latest escalation as Pakistan had expelled India's envoy after India revoked the semi-autonomous status of Kashmir in 2019. This deepened tensions in the region but things have largely remained stable after the two countries renewed a previous ceasefire agreement in 2021. Read more from Sky News:Trump wants to emulate Putin, ex-adviser saysIstanbul hit by 6.2 magnitude earthquakeChinese space mission blasts off Tens of thousands of people have been killed in Kashmir since the uprising began in 1989, but violence has tapered off in recent years and tourism has surged in the scenic region. Until the most recent episode, tourists have largely not been the targets of such attacks."
    },
    {
        "title": "Kashmir tourist attack stokes long-held tensions between India and Pakistan amid fears of military escalation",
        "description": "It's a crime scene that could have global consequences.",
        "url": "https://news.sky.com/story/kashmir-tourist-attack-stokes-long-held-tensions-between-india-and-pakistan-amid-fears-of-military-escalation-13355075",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-kashmiri-indian_6895875.jpg?20250424204644",
        "type": "World",
        "Author": "Neville Lazarus",
        "Date Published": "2025-04-24 19:22:00",
        "Headline": "The nuclear-armed neighbours both claim the scenic Himalayan territory of Kashmir as their own and have fought over it before, so Tuesday's attack that killed 26 tourists is a potential flashpoint for further conflict.",
        "Content": "\n          India reporter and producer\n              @nevilleskynews\n  It's a crime scene that could have global consequences. Two nuclear-armed neighbours with decades of hostility and mistrust are threatening each other again after a militant gun attack in disputed Kashmir. India and Pakistan have fought several wars and skirmishes since their independence from Britain in 1947. The latest flashpoint is Tuesday's murder of tourists who were enjoying holidays in a meadow in Pahalgam, known as mini-Switzerland. A group of militants opened fire, killing 26 men and injuring dozens more. India has accused Pakistan of harbouring, arming and sheltering militant organisations whose members infiltrate the almost 500-mile border in Kashmir and attack the state. Pakistan denies the accusation and says it only supports Kashmiris' right to self-determination. \n                  Pakistan warns Kashmir row could lead to 'all-out war' with India\n                 \n                  India and Pakistan tensions ramp up after Kashmir killings\n                 \n                  India closes Pakistan border and expels diplomats over Kashmir 'terror attack' \n                 Leaders of both countries have turned up the heat, with Indian Prime Minister Narendra Modi telling a rally in the east Indian state of Bihar that his government will \"identify, track and punish every terrorist and their backers. We will pursue them to the ends of the earth\". \"Terrorism will not go unpunished. Every effort will be made to ensure that justice is done.\"  New Delhi's diplomatic response included revoking visas, expelling military advisers, closing a border crossing and suspending the Indus Water Treaty. Pakistan Prime Minister Shehbaz Sharif reacted at a meeting on Thursday of the country's national security committee, passing reciprocal measures and warning that the suspension of the treaty would be considered an act of war. 'Unacceptable at any cost' Pakistan's foreign minister Ishaq Dar said \"any such unilateral action is unacceptable at any cost\". In 2019, a suicide bomber in a vehicle killed 40 paramilitary soldiers in a military convoy. India blamed Pakistan for giving shelter to Islamist terrorists and conducted limited airstrikes across the border. A tense stand-off between the two nuclear-armed neighbours has lasted since. Later that year, Mr Modi's government suspended the special status of Jammu and Kashmir, the only Muslim majority state in India and brought it directly under the control of New Delhi. The Kargil War in May 1999 led to a stand-off often described as a nuclear flashpoint. Pakistan's military covertly occupied Indian posts across the line of control (LoC). After the war began, Pakistan asked US President Bill Clinton to help de-escalate the conflict. The result was the Washington Accord, under which Prime Minister Nawaz Sharif agreed to withdraw Pakistani troops and restore the LoC. But the United Jihad Council, an umbrella organisation of extremist groups, rejected the deal and decided to continue fighting the Indian state. 2008 Mumbai terror attack left 166 dead The 2008 Mumbai terror attack was evidence of this, when 166 people were killed by 10 terrorists belonging to Lashkar-e-Taiba (LeT), a group alleged to have close ties to Pakistan's spy agency, the Inter-Service Intelligence (ISI). The killings went on for four days at iconic places across the city. The only gunman who was caught, Ajmal Kasab, said the attackers were members of the terror group before he was executed in 2012. For decades, Kashmir has been caught up in the vortex of violence, conflict, killings and kidnappings. Pakistan says Kashmir remains an unresolved dispute, and they will continue to support the right of self-determination of its people. Read more:Pakistan warns of 'all-out war'India and Pakistan tensions rise Pakistan's 'jugular vein' Last week, the all-powerful Pakistan army chief General Asim Munir said Kashmir was their \"jugular vein\" and Islamabad \"will not leave our Kashmiri brothers in their heroic struggle\". Kashmir is the crown over which the two nuclear-armed neighbours have fought wars and are in a perpetual state of tension. The mistrust between the two countries has grown over the years, and there is little diplomatic manoeuvring to bridge that gap. And, after the Pahalgaum attack, there is every chance of an escalation that could be devastating to its people."
    },
    {
        "title": "Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too",
        "description": "First he took the US on a collision course with China. Then he came for the rest of the world.",
        "url": "https://news.sky.com/story/trump-has-shifted-the-priorities-of-the-worlds-economic-policymakers-but-their-views-of-the-us-have-changed-too-13355162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-imf-meeting-rachel-reeves-with-others_6896028.jpg?20250425030742",
        "type": "World",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "Countries across the world are eager for Donald Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n First he took the US on a collision course with China. Then he came for the rest of the world. He crashed into the financial markets and now Donald Trump has been gently tapping on the brakes all week. The world's economic policymakers have been on quite the journey over the past few months. Many of them will have felt a little queasy as they got off the plane in Washington DC for the International Monetary Fund's (IMF) annual spring meetings. This was their opportunity to talk. To strategise, strengthen alliances and figure out their next move. Rachel Reeves was in the mix. While all the focus has been on a US-UK trade deal - and she is due to meet her US counterpart on Friday - the chancellor was also here to meet her G7 and G20 allies. Countries across the world are eager for Mr Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner. \n                  A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters\n                 \n                  Day 95: Is Trump really 'close' to securing a deal for Ukraine?  \n                 \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 That much was obvious from a conversation with Paschal Donohoe, Ireland's finance minister and president of the Eurogroup. He told Sky News that Ireland, a highly US-orientated economy, was diversifying. That being said, he was \"more optimistic than some\" that a high level of trade integration would prevail well into the future. \"What I think is very possible is the structure of that globalisation could begin to change,\" he said.  That changing structure might include a rejection of China's decades-long model of export-led growth. Since joining the World Trade Organisation in 2001, China has been pumping out cheap goods into the world economy, making far more than it consumes at home. Poor countries across the world have taken a similar approach to development but the US Treasury secretary said on the sidelines of the IMF on Wednesday that it was \"absurd\" for multilateral institutions to continue treating China like a developing economy. He called for a \"rebalancing\". Read more from Sky News: Student killed and three injured in stabbing at French schoolWho will be at the Pope's funeral - and who won't be There is a recognition among world leaders that some of Mr Trump's grievances are reasonable. They believe his approach is the wrong one but in interviews they are now talking about the negative consequences of trade imbalances and globalisation - the impact on communities and the undercutting of wages. That wasn't the case just a few months ago. 👉 Follow Trump 100 on your podcast app 👈 Ms Reeves took it one step further. On Wednesday, the Treasury announced plans to tackle the dumping of cheap goods into the UK - no doubt aimed at China. She announced a review of the customs' treatment of low-value imports. Currently goods valued at £135 escape the duty. The US has already taken action. In an interview with Sky News, she said she was acting in the \"national interest\" but she is also looking for common ground with the Americans, as she seeks a deal that secures a reduction in tariffs. Speaking to US media on Thursday, she reiterated her shared concerns: \"I absolutely understand the concerns the United States have about imbalances in trade in the global economy, particularly when it comes to China that runs large, persistent trade surpluses with countries around the world, including the US and indeed including the United Kingdom.\" The IMF too. While the Fund sharply downgrades global growth forecasts, it shied away from openly criticising the US president.  Kristalina Georgieva, the IMF's managing director, spoke of an erosion of trust between countries, and \"concerns about the uneven distribution of gains from economic integration, its impact on the international division of labour, supply chain security, and global imbalances\". So, Mr Trump has got policymakers to shift their priorities. At the very least, he has brought a long-simmering issue to the boil. The world is thinking differently about China now. The US is also showing signs that it's thinking differently. After a bruising showdown with the bond markets, Mr Trump has rowed back on his liberation day tariffs. The administration has softened its language, saying it wants reform and to work with institutions. The president said tariffs could come down substantially on China. However, a lot of damage has already been done - not only his erratic tariffs policy, but also his attack on institutions, including the US Federal Reserve. The world is now thinking differently about the US too, as are the markets. Investors normally dive into US assets - government debt and the dollar - during times of turmoil, but Mr Trump's pronouncement has caused traders to do the opposite. There are signs that the world is losing faith in the US' ultimate safe haven status."
    },
    {
        "title": "Student killed and three injured in stabbing at French school",
        "description": "A student has been killed and three others were injured in a stabbing at a French private school.",
        "url": "https://news.sky.com/story/student-dies-after-stabbing-attack-at-french-school-13354837",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-france-stabbing-school_6895497.jpg?20250424134651",
        "type": "World",
        "Author": "Daniel Binns, news reporter",
        "Date Published": "2025-04-24 12:12:00",
        "Headline": "The attacker, reported to be a 15-year-old student, was overpowered by teachers at the scene in Nantes, police said. Two of the injured are reported to be in a critical condition.",
        "Content": "By Daniel Binns, news reporter  A student has been killed and three others were injured in a stabbing at a French private school. A 15-year-old boy, said to be a fellow pupil, was arrested in connection with the attack after being overpowered by teachers at the scene before officers arrived, police said. The suspect reportedly entered the grounds of Notre-Dame-de-Toutes-Aides, in Nantes, western France, armed with at least one knife at around 12.30pm local time (11.30am UK time) on Thursday. He then went to the second floor of the high school, where he attacked a teenage girl. She later died of her injuries, French television network BFMTV reported. The suspect then went down to the first floor, where he attacked at least three other students before being overpowered, radio station Europe 1 said. Local newspaper Ouest France said the attacker had been dressed all in black, and wore a helmet and balaclava. Two knives, including a hunting knife, were reportedly recovered from the scene. Students at the school revealed they had received an email from the suspect earlier in the day outlining unspecified grievances. One of them, who did not want to be named, told BFMTV: \"It's absolutely shocking. This is usually a very calm high school, and there have never been any problems of this type, even minor ones.\" Two of the injured students were said to be in a critical condition. A police spokesman said there was no indication of a terrorist motive. Read more from Sky News:India and Pakistan tensions rise after attackYoung people on the reality of knife crimeOasis fans 'lost £2m to ticket scams' The suspect was not previously known to the police or security services, a source told Le Monde newspaper. Education minister Elisabeth Borne said on social media that she was heading to the school with interior minister Bruno Retailleau to show ''solidarity with victims and the school community\". An official at the school, which is part of a complex that also features a primary and middle school, declined to comment."
    },
    {
        "title": "IDF admits responsibility for deadly attack on UN building last month",
        "description": "The Israeli military has admitted its troops were behind the deadly shelling of a UN guest house in Gaza last month, after previously denying responsibility.",
        "url": "https://news.sky.com/story/idf-admits-responsibility-for-deadly-attack-on-un-building-last-month-13354985",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-dandf-aid-attack-dab_6895684.jpg?20250424172945",
        "type": "World",
        "Author": "Ben van der Merwe, digital investigations journalist",
        "Date Published": "2025-04-24 16:19:00",
        "Headline": "The IDF says its troops did not know the building was a UN facility, but the UN has said the attack was \"not an accident\".",
        "Content": "By Ben van der Merwe, digital investigations journalist  The Israeli military has admitted its troops were behind the deadly shelling of a UN guest house in Gaza last month, after previously denying responsibility. On 19 March, the building in Deir al Balah belonging to the UN's Office for Project Services (UNOPS) was attacked, killing a Bulgarian UN staff member and injuring six other international workers. The picture below shows the damage sustained by the building, with a large hole in one wall. The UN said the building was fired on by an Israeli tank, an allegation that the Israeli military previously denied. In a statement today, 24 April, the Israel Defence Forces (IDF) admitted that one of its tanks had struck the building and said it had passed preliminary findings to UN representatives. \"The building was struck due to assessed enemy presence and was not identified by the forces as a UN facility,\" the statement says. \"We express our deep sorrow for the loss and send our condolences to the family.\" At the time of the attack, however, UNOPS chief Jorge Moreira da Silva said that Israel knew the location of the building and who was working there. \"This was not an accident,\" he said. Sky News understands that the IDF had been previously informed that the building belonged to the UN, and that this is being investigated by the IDF. The admission of responsibility comes as Israel is under increasing pressure over the deaths of aid workers in Gaza. Sky News reported last month that attacks on aid workers had risen to the highest level in almost a year.  Israel has faced particular criticism over its troops' killing of 15 unarmed aid workers on 23 March, and the subsequent decision to bury their bodies in a mass grave. The IDF said that its investigation into the attack on the UN guest house is still ongoing, and that the full results would be presented to the UN. The UN has been approached for comment. The IDF declined to comment when approached by Sky News. You can watch our full report into the killings on 23 March here:  The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "China's rocket launch is building on space programme with staggering ambition",
        "description": "Seeing a rocket launch to space is not just something you watch but something you feel.",
        "url": "https://news.sky.com/story/chinas-rocket-launch-is-building-on-space-programme-with-staggering-ambition-13354969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shenzhou-20-crew-china_6895785.jpg?20250424190110",
        "type": "World",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-04-24 15:38:00",
        "Headline": "China wants to be the next country to put a man on the moon and the first country to return samples from Mars, both feats the US is also actively pursuing.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Seeing a rocket launch to space is not just something you watch but something you feel. Even from some distance away, the impact is immense, you can feel the reverberations in your chest and you cannot hear the person next to you. It's hard not to be impressed.  For the hundreds of people who had gathered to watch the Shenzhou-20 crew launch in Jiuquan, on the edge of the Gobi Desert in northwestern China, they were not just impressed but gleeful too. There was a deafening hush as the countdown began, followed by screams of joy as it disappeared into the atmosphere. Such is the sense of pride that China is showing the world what it can do. Rocket launch as it happened This launch might be relatively routine in space terms - three taikonauts (the Chinese term for astronaut) headed to China's space station as part of a scheduled six-month rotation. But it is all building on a space programme with staggering ambition, proceeding at a rapid pace. It is quite a journey to get to the Jiuquan Satellite Launch Centre. We travelled three and a half hours by bus from the nearest town, mile upon mile of flat dusty desert, just the occasional settlement and military base on the way. When there, the base is a huge facility, a fully functioning complex in the middle of the desert for space staff who live and work there, complete with a school, restaurants and even a gift shop. We were bused around by our handlers from the Chinese government, closely managed throughout, and it was hard to break away from the schedule to interview people. But it was easy to get a sense of just how proud people felt. Read more:Despite tariffs, China's Silicon Valley is ready to make its mark on the world 'China is number one' At the \"farewell\" ceremony, where the three-man crew waved goodbye to the crowds, you could just feel it. People waved flowers and flags and sang national songs. \"China is number one,\" screamed one man. \"I'm so proud to have been born in China,\" enthused another woman. Indeed it feels that space is a nationalistic endeavour, that their successes are also China's. Escalating superpower race for results They won't say it out loud here, but everyone knows the context: an escalating standoff with America, a superpower race for results. China wants to be the next country to put a man on the moon and the first country to return samples from Mars, both feats the US is also actively pursuing. All space programmes have other motives China does have reason to feel confident. It has made huge gains in recent years, including the completion of its own space station, landing a rover on Mars and being the only nation to have returned samples from the far side of the moon. While everyone we ask here insists there is no competition and all this is being done purely for the benefit of science and mankind, all space programmes have other quieter motives. Dominance in space gives countries the edge in terms of military capabilities, communications and intelligence. Indeed, just outside the base, a sign warns the public that \"to keep secrets is glorious\" and \"if you sell secrets you could be executed\". World is watching China's surging progress China almost certainly views the space race in these terms, particularly as a system that always views things through a long-term lens and in a world that's increasingly polarised. While the US is still the most powerful country in space, China is closing the gap and the world is watching its surging progress."
    },
    {
        "title": "Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too",
        "description": "First he took the US on a collision course with China. Then he came for the rest of the world.",
        "url": "https://news.sky.com/story/trump-has-shifted-the-priorities-of-the-worlds-economic-policymakers-but-their-views-of-the-us-have-changed-too-13355162",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-imf-meeting-rachel-reeves-with-others_6896028.jpg?20250425030742",
        "type": "US",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-04-24 23:01:00",
        "Headline": "Countries across the world are eager for Donald Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n First he took the US on a collision course with China. Then he came for the rest of the world. He crashed into the financial markets and now Donald Trump has been gently tapping on the brakes all week. The world's economic policymakers have been on quite the journey over the past few months. Many of them will have felt a little queasy as they got off the plane in Washington DC for the International Monetary Fund's (IMF) annual spring meetings. This was their opportunity to talk. To strategise, strengthen alliances and figure out their next move. Rachel Reeves was in the mix. While all the focus has been on a US-UK trade deal - and she is due to meet her US counterpart on Friday - the chancellor was also here to meet her G7 and G20 allies. Countries across the world are eager for Mr Trump to reduce his tariffs but they are also looking to each other, reflecting on how the world might look in the future and whether the US is a reliable long-term partner. \n                  A 'barbaric' 24 hours in the 'horrendous' Russia-Ukraine war leaves Donald Trump's peace plan in tatters\n                 \n                  Day 95: Is Trump really 'close' to securing a deal for Ukraine?  \n                 \n                  Trump wants to emulate Putin and govern US in 'a similar fashion', his former national security adviser says\n                 That much was obvious from a conversation with Paschal Donohoe, Ireland's finance minister and president of the Eurogroup. He told Sky News that Ireland, a highly US-orientated economy, was diversifying. That being said, he was \"more optimistic than some\" that a high level of trade integration would prevail well into the future. \"What I think is very possible is the structure of that globalisation could begin to change,\" he said.  That changing structure might include a rejection of China's decades-long model of export-led growth. Since joining the World Trade Organisation in 2001, China has been pumping out cheap goods into the world economy, making far more than it consumes at home. Poor countries across the world have taken a similar approach to development but the US Treasury secretary said on the sidelines of the IMF on Wednesday that it was \"absurd\" for multilateral institutions to continue treating China like a developing economy. He called for a \"rebalancing\". Read more from Sky News: Student killed and three injured in stabbing at French schoolWho will be at the Pope's funeral - and who won't be There is a recognition among world leaders that some of Mr Trump's grievances are reasonable. They believe his approach is the wrong one but in interviews they are now talking about the negative consequences of trade imbalances and globalisation - the impact on communities and the undercutting of wages. That wasn't the case just a few months ago. 👉 Follow Trump 100 on your podcast app 👈 Ms Reeves took it one step further. On Wednesday, the Treasury announced plans to tackle the dumping of cheap goods into the UK - no doubt aimed at China. She announced a review of the customs' treatment of low-value imports. Currently goods valued at £135 escape the duty. The US has already taken action. In an interview with Sky News, she said she was acting in the \"national interest\" but she is also looking for common ground with the Americans, as she seeks a deal that secures a reduction in tariffs. Speaking to US media on Thursday, she reiterated her shared concerns: \"I absolutely understand the concerns the United States have about imbalances in trade in the global economy, particularly when it comes to China that runs large, persistent trade surpluses with countries around the world, including the US and indeed including the United Kingdom.\" The IMF too. While the Fund sharply downgrades global growth forecasts, it shied away from openly criticising the US president.  Kristalina Georgieva, the IMF's managing director, spoke of an erosion of trust between countries, and \"concerns about the uneven distribution of gains from economic integration, its impact on the international division of labour, supply chain security, and global imbalances\". So, Mr Trump has got policymakers to shift their priorities. At the very least, he has brought a long-simmering issue to the boil. The world is thinking differently about China now. The US is also showing signs that it's thinking differently. After a bruising showdown with the bond markets, Mr Trump has rowed back on his liberation day tariffs. The administration has softened its language, saying it wants reform and to work with institutions. The president said tariffs could come down substantially on China. However, a lot of damage has already been done - not only his erratic tariffs policy, but also his attack on institutions, including the US Federal Reserve. The world is now thinking differently about the US too, as are the markets. Investors normally dive into US assets - government debt and the dollar - during times of turmoil, but Mr Trump's pronouncement has caused traders to do the opposite. There are signs that the world is losing faith in the US' ultimate safe haven status."
    },
    {
        "title": "Public failed by water regulators and government as bills rise, spending watchdog says",
        "description": "Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said.",
        "url": "https://news.sky.com/story/public-failed-by-water-regulators-and-government-as-bills-rise-spending-watchdog-says-13354889",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-sewage-spills-thames_6505233.jpg?20240330143917",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "As trust in the water industry reaches a record low, bills are rising at a rate last seen 20 years ago.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said. Public trust in the water sector has reached a record low, according to a report from the National Audit Office (NAO) on the privatised industry. Not since monitoring began in 2011 has consumer trust been at such a level, it said. At the same time, households face double-digit bill hikes over the next five years. The last time bills rose at this rate was just before the global financial crash, between 2004-05 and 2005-06. Regulation failure All three water regulators - Ofwat, the Environment Agency and Drinking Water Inspectorate - and the government department for environment, food and rural affairs (Defra) have played a role in the failure, the NAO said, adding they do not know enough about the condition or age of water infrastructure and the level of funding needed to maintain it. \n                  'Disgraceful' amount of sewage still being dumped in English rivers, says environment secretary\n                 \n                  Three quarters of a million pieces of rubbish found on UK beaches\n                 \n                  An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most\n                 Since the utilities were privatised in 1989, the average rate of replacement for water assets is 125 years, the watchdog said. If the current pace is maintained, it will take 700 years to replace the existing water mains. Water firms have grappled with leaky pipes and record sewage outflows into UK waterways in recent years, with enforcement action under way against all wastewater companies. Despite there being three regulators tasked with water, there is no one responsible for proactively inspecting wastewater to prevent environmental harm, the report found. Instead, regulation is reactive, fining firms when harm has already occurred. Financial penalties and rewards, however, have not worked as water company performance hasn't been \"consistent or significantly improved\" in recent years, the report said. 'Gaps, inconsistencies, tension' The NAO called for this to change and for a body to be tasked with the whole process and assets. At present, the Drinking Water Inspectorate monitors water coming into a house, but there is no entity looking at water leaving a property. Similarly no body is tasked with cybersecurity for wastewater businesses. As well as there being gaps, \"inconsistent\" watchdog responsibilities cause \"tension\" and overlap, the report found. The Environment Agency has no obligation to balance customer affordability with its duty to the environment when it assesses plans, the NAO said.  Company and investment criticism Regulators have also been blamed for failing to drive enough funding into the water sector. From having spoken to investors through numerous meetings, the NAO learnt that confidence had declined, which has made it more expensive to invest in companies providing water. Even investors found Ofwat's five-yearly price review process \"complex and difficult\", the report said. Financial resilience of the industry has \"weakened\" with Ofwat having signalled concerns about the financial resilience of 10 of the 16 major water companies. Most notably, the UK's largest provider, Thames Water, faced an uncertain future and potential nationalisation before securing an emergency £3bn loan, adding to its already massive £16bn debt pile. Read more from Sky News:Hundreds of jobs at risk as The Original Factory Shop launches survival planGovernment to decide on 'postcode pricing' plan for electricity bills by summer Water businesses have been overspending, with only some extra spending linked to high inflation in recent years, leading to rising bills, the NAO said. Over the next 25 years, companies plan to spend £290bn on infrastructure and investment, while Ofwat estimates a further £52bn will be needed to deliver up to 30 water supply projects, including nine reservoirs. What else is going on? From today, a new government law comes into effect which could see water bosses who cover up illegal sewage spills imprisoned for up to two years. Such measures are necessary, Defra said, as some water companies have obstructed investigations and failed to hand over evidence on illegal sewage discharges, preventing crackdowns. Meanwhile, the Independent Water Commission (IWC), led by former Bank of England deputy governor Sir Jon Cunliffe, is carrying out the largest review of the industry since privatisation. What the regulators and government say?  In response to the report, Ofwat said: \"The NAO's report is an important contribution to the debate about the future of the water industry. \"We agree with the NAO's recommendations for Ofwat and we continue to progress our work in these areas, and to contribute to the IWC's wider review of the regulatory framework. We also look forward to the IWC's recommendations and to working with government and other regulators to better deliver for customers and the environment.\" An Environment Agency spokesperson said: \"We have worked closely with the National Audit Office in producing this report and welcome its substantial contribution to the debate on the future of water regulation. \"We recognise the significant challenges facing the water industry. That is why we will be working with Defra and other water regulators to implement the report's recommendations and update our frameworks to reflect its findings.\" A Defra spokesperson said: \"The government has taken urgent action to fix the water industry - but change will not happen overnight. \"We have put water companies under tough special measures through our landmark Water Act, with new powers to ban the payment of bonuses to polluting water bosses and bring tougher criminal charges against them if they break the law.\" Water UK, which represents the water firms, has been contacted for comment."
    },
    {
        "title": "Hundreds of jobs at risk as The Original Factory Shop launches survival plan",
        "description": "Nearly 1,000 jobs could be under threat at The Original Factory Shop (TOFS), one of Britain's largest discount retailers, as part of a survival plan which centres on plans for swingeing rent cuts.",
        "url": "https://news.sky.com/story/hundreds-of-jobs-at-risk-as-the-original-factory-shop-launches-survival-plan-13354941",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-the-original-factory-shop_6860276.jpg?20250318101950",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-24 15:10:00",
        "Headline": "Close to 1,000 jobs and half of TOFS' stores are under threat if landlords do not agree to demands drawn up by Modella Capital, the chain's new owner, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Nearly 1,000 jobs could be under threat at The Original Factory Shop (TOFS), one of Britain's largest discount retailers, as part of a survival plan which centres on plans for swingeing rent cuts. Sky News has learnt that Modella Capital, the new owner of TOFS, has drawn up plans to renegotiate rents at 88 of the company's 178 stores. The proposals are contained in a company voluntary arrangement (CVA), a last-ditch restructuring process, which was launched on Thursday. TOFS employees are said to have been briefed on the plans. The chain sells beauty brands such as L'Oreal, the sportswear label Adidas and DIY tools made by Black & Decker. It employs about 2,000 people, with a proportion of its 176 head office and warehouse employees understood to be facing redundancy. Creditors will be asked to vote on the plans at a meeting in mid-May. \n                  Hobbycraft to axe stores and jobs in radical restructuring\n                 \n                  Predators eye bargain deal for struggling discount retailer Poundland\n                 \n                  Profits up at Tesco after job cuts - with further losses not ruled out\n                 The CVA is being handled by Interpath Advisory. Although there are no definite store closures, people familiar with the plans said half of TOFS' estate was at risk if landlords did not agree to the rent demands. It is the second such brutal restructuring to be launched by a Modella Capital-owned retailer this week. Sky News revealed on Tuesday that Hobbycraft, which the investor also owns, is also launching a CVA which would entail the closure of nine shops. Hundreds of jobs could be at risk there too if rent cuts are not acceded to. The blueprint risks becoming a controversial one for Modella and for WH Smith, which has just agreed the sale of its high street arm to the investment firm. Retail insiders believe a similar restructuring is inevitable at WH Smith, which Modella has said will be renamed in town centres as TG Jones. \"In response to the challenging retail environment of the last year, The Original Factory Shop (TOFS) has today announced a proposed Company Voluntary Arrangement (CVA) in order to protect the future of TOFS as a business and to allow it to flourish in the future,\" a statement from the company said. \"Under TOFS' plan, which will be subject to a vote by the company's creditors on May 14, TOFS will adjust its store estate (by, where possible, renegotiating the leases on a number of its stores that are loss-making), return to the deal-centric stock and purchasing strategy it is famous for, invest in online channels, and re-align its support centre and logistics operations. \"All employees have been informed of the CVA proposal. \"A redundancy consultation will begin with employees in those TOFS stores where the company is seeking to renegotiate the lease, in the event that those negotiations are not successful. \"There will also be a reduction in the number of employees in the company's Head Office and Warehouse in Burnley. \"There will be no change in the day-to-day running of the business while this plan is implemented, and management will keep all TOFS colleagues updated as the process continues. \"While these changes are necessary, TOFS remains committed to serving our loyal customers across the UK. \"Our plan aims to put the business on sustainable footing, protecting as many jobs as possible, and allowing us to return to offering the exceptional value and deals our customers expect from us.\" TOFS, which was founded in 1969, was bought by the private equity firm Duke Street in 2007. Duke Street had tried to sell the business before, having supported it through the COVID-19 pandemic with a cash injection of more than £10m."
    },
    {
        "title": "Government to decide on 'postcode pricing' plan for electricity bills by summer",
        "description": "The government will decide by the summer on controversial proposals to charge some households more for their electricity than others, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-decide-on-postcode-pricing-plan-for-electricity-bills-by-summer-13354653",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6895380.jpg?20250424120800",
        "type": "Business",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-24 07:31:00",
        "Headline": "So-called \"zonal pricing\" could see the south of England pay more for electricity bills than parts of Scotland. It comes as energy secretary Ed Miliband doubles down on the case for more clean power, while a Trump official invokes the Bible to support US energy policy.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government will decide by the summer on controversial proposals to charge some households more for their electricity than others, Sky News understands. The energy secretary Ed Miliband has been mulling over plans for \"zonal pricing\", which would see different regions of the country pay different rates, based on supply and demand levels in the local area. The idea is to attract industry to build in low-cost areas, and incentivise new electricity generation in regions where people need it most. Supporters say zonal pricing could lower everyone's bills to some extent by making the system more efficient - but some would fall more than others. Critics, including renewable energy generators, warn the plans would create a postcode lottery for bills and put investors off certain areas, risking jobs. It is not yet clear how the changes would be passed on to household bills. But it could see people in the south of England pay much more than those in parts of Scotland - though not, the government hopes, more than they do now. Ed Miliband told Sky News: \"My bottom line here is any reform we make has got to cut bills, and it's got to cut bills across the country. \n                  China's rocket launch is building on space programme with staggering ambition\n                 \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  UK vision for clean energy to collide with Trump's fossil fuel frenzy\n                 \"We're not going to have a postcode lottery... If there are bills savings to be made, we want them to be spread across the country so that all consumers benefit.\" He is expected to make his recommendation to fellow ministers in the coming weeks, before the government decides either way by the middle of this year. They are keen to resolve the issue - which was also considered under the last Tory government - before businesses start bidding for fresh renewable power contracts in summer. UK still 'vulnerable and exposed' It comes as the UK government hosts a summit on energy security in London today, lobbying other countries to leave fossil fuels behind. Read more: UK clean energy vision collides with Trump's fossil fuel frenzy Mr Miliband said the government's push to generate more clean power at home was as much about energy security as it was about fighting climate change. \"As long as energy can be weaponised against us, our countries and our citizens are vulnerable and exposed,\" he said in a speech. But he also said North Sea oil and gas would \"continue to play an important role\" in the UK energy mix, fuelling campaigners' fears it may yet allow the Rosebank oil and gas field to go ahead, despite hurdles in court and the government's own concerns.  Trump's representative invokes God US President Donald Trump's junior representative at the summit, acting assistant secretary Tommy Joyce, quoted the Bible in his address. He urged delegates to \"remember God's golden rule, and that is that we should love our neighbour as ourselves\". That means helping them out of poverty through access to affordable energy, according to Mr Joyce. About 750 million people in the world still have no access to electricity, and team Trump says American oil, gas and coal are the answer. However, a report by RMI suggests that new wind and solar are the cheapest option for new electricity in 82% of the world - though for some countries are hard to finance upfront, and they still need oil and gas for other sectors. Mr Joyce also continued Trump's ongoing attacks on climate policies, criticising what he described as \"so-called renewables\" and the \"net zero agenda\". 'Most delicate debate' Before the summit, a senior UN official said the idea that the switch to clean power compromised energy security and affordability \"is just not true\". \"We really need to dispel this notion,\" said the source, speaking on the condition of anonymity. \"If you are dependent on volatile and expensive fossil fuel imports, fossil fuels equal energy insecurity.\" A senior official from Brazil, which in November is hosting the COP30 UN climate summit, also this week said there had been a \"rather successful\" attempt by some to frame energy security and the switch to clean energy as a question of \"either/or\". \"We don't believe it is.\" He called it \"one of the most delicate debates\" of the moment."
    },
    {
        "title": "Nandy to sign off appointment of Kogan as top football referee",
        "description": "Lisa Nandy, the culture secretary, is to sign off the appointment of a chair of English football's new referee within days.",
        "url": "https://news.sky.com/story/nandy-to-sign-off-appointment-of-kogan-as-top-football-referee-13354785",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-manchester-united-man-united_6883615.jpg?20250412085041",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-24 11:26:00",
        "Headline": "David Kogan, a sports media rights veteran, is to be announced as the first chair of the Independent Football Regulator in the coming days, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Lisa Nandy, the culture secretary, is to sign off the appointment of a chair of English football's new referee within days. Sky News has learnt that David Kogan, a media industry veteran who has helped negotiate a string of television rights deals across the sport in recent decades, is to be formally approved as chair of the Independent Football Regulator (IFR). Whitehall sources said an announcement could be made by the Department for Culture, Media and Sport (DCMS) as soon as this week, although they added that the timetable could slip by a few days. Money latest: Octopus Energy responds after being forced to ditch advert Once approved, Mr Kogan is expected to face a committee of MPs for a confirmation hearing early next month, the sources added. Sky News revealed last weekend that Mr Kogan had emerged as the frontrunner for the post after an earlier shortlist of three candidates was passed over. The new regulator has the firm backing of Sir Keir Starmer, and is a key element of legislation currently passing through Parliament. \n                  Mansfield Town footballer Lucas Akins jailed for causing death of cyclist in car crash\n                 \n                  Jamie Vardy to leave Leicester City at the end of the season\n                 \n                  Chelsea fans condemn 'unethical' ticket resale site - which club chairman invests in\n                 Mr Kogan, whose boardroom roles have included a directorship at state-owned Channel 4, was initially approached during a previous recruitment process launched under the last Conservative administration. He has some links to Labour, having in the past donated money to a number of individual parliamentary candidates, chairing LabourList, the independent news site, and writing two books about the party. Mr Kogan has had extensive experience at the top of English football, having advised clients including the Premier League, English Football League, Scottish Premier League and UEFA on television rights contracts. Last year, he acted as the lead negotiator for the Women's Super League and Championship on their latest five-year broadcasting deals with Sky - the immediate parent company of Sky News - and the BBC. His current roles include advising the chief executives of CNN, the American broadcast news network, and The New York Times Company on talks with digital platforms about the growing influence of artificial intelligence on their industries. In recent months, Sky News has disclosed the identities of the shortlisted candidates for the role, with former Aston Villa FC and Liverpool FC chief executive Christian Purslow one of three candidates who made it to a supposedly final group of contenders. The others were Sanjay Bhandari, who chairs the anti-racism football charity Kick It Out, and Professor Sir Ian Kennedy, who chaired the new parliamentary watchdog established after the MPs expenses scandal. The apparent hiatus in the appointment of the IFR's £130,000-a-year chair threatened to reignite speculation that Sir Keir was seeking to diminish its powers amid a broader clampdown on Britain's economic watchdogs. Both 10 Downing Street and the Department for Culture, Media and Sport (DCMS) have sought to dismiss those suggestions, with insiders insisting that the IFR will be established largely as originally envisaged. Read more from Sky News:UK car exporter's shares slump to four-year lowAudio technology group Waves hello to £300m London flat The creation of the IFR, which will be based in Manchester, is among the principal elements of legislation now progressing through parliament, with Royal Assent expected before the summer recess. The Football Governance Bill has completed its journey through the House of Lords and will be introduced in the Commons shortly, according to the DCMS. The regulator was conceived by the Tories in the wake of the furore over the failed European Super League project, but has triggered deep unrest in parts of English football. Its creation forms part of a process that represents the most fundamental shake-up in the oversight of English football in the game's history. The establishment of the body comes with the top tier of the professional game gripped by civil war, with Abu Dhabi-owned Manchester City at the centre of a number of legal cases with the Premier League over its financial dealings. The Premier League is also keen to agree a long-delayed financial redistribution deal with the EFL before the regulator is formally launched, although there has been little progress towards that in the last year. \"We do not comment on speculation,\" a DCMS spokesperson said when asked about the impending announcement of Mr Kogan as the IFR chair. \"No appointment has been made and the recruitment process for [IFR] chair is ongoing.\""
    },
    {
        "title": "Trade war: UK car exporter's shares slump to four-year low",
        "description": "A UK-based car distributor has seen its shares hit a four-year low after reporting a fall in sales and warning of hits ahead from Donald Trump's trade war. ",
        "url": "https://news.sky.com/story/trade-war-uk-car-exporters-shares-slump-to-four-year-low-13354667",
        "image_url": "https://e3.365dm.com/22/07/1920x1080/skynews-new-cars-produced-stock_5823914.jpg?20220705070337",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-24 08:19:00",
        "Headline": "Inchcape warns investors that it expects to be hit by the trade war disruption on several fronts but insists its market leading position means it is well placed.",
        "Content": "A UK-based car distributor has seen its shares hit a four-year low after reporting a fall in sales and warning of hits ahead from Donald Trump's trade war.  Inchcape, which exports cars for manufacturers across more than 40 countries globally, saw its stock lose up to 16.9% in early trading on Wednesday after its first quarter trading update. It told investors that while it was not currently experiencing damage from the Trump administration's 25% tariffs on all US car imports, revenue fell by 5% over the three months to March to £2.1bn. Money latest: Octopus Energy responds after being forced to ditch advert Inchcape reported a resilient performance from its Americas division but struggles in its Asia-Pacific and European markets. The period was dominated by trade war fears generally as the US president's second term got under way and was marked by a surge in demand for goods in the US in a bid to beat any tariffs he threatened to impose. Inchcape blamed the revenue decline on a strong comparable period in 2024 and \"mixed market momentum\", led by that dash for shipments to the US to beat the imposition of any additional US duties. \n                  Trump has shifted the priorities of the world's economic policymakers - but their views of the US have changed too\n                 \n                  Trade war: Stock markets rally as Trump rows back on Fed and China threats\n                 \n                  'Now is our  time': Despite tariffs, China's Silicon Valley is ready to make its mark on the world\n                 They were universally imposed earlier this month, but Mr Trump has since signalled that some exemptions may soon be applied.  There are fears that a prolonged period of trade disruption could result in job losses within the UK car industry and its supply chain. Inchcape reaffirmed its 2025 guidance but said that excluded any impacts from tariffs. Its actions to mitigate the effects included a focus on costs and inventory. Read more: UK to be among those worst hit by trade war, IMF warnsUS trade deal talks may be impossible task for the chancellor  Chief executive Duncan Tait said: \"Demand is not currently being impacted by the tariff situation, although we do expect to see potential impacts on supply from our OEMs (original equipment manufacturers), the competitive environment, and market demand. \"We are taking proactive steps to support our key stakeholders, including taking a conservative approach to managing inventory levels, ensuring we remain disciplined on costs, focusing on cash generation and maintaining our strong balance sheet.\" Shares had recovered some poise by mid-morning, trading down by just over 7% following the initial slump."
    },
    {
        "title": "Pimco and KKR among suitors for £1.7bn John Lewis card provider NewDay",
        "description": "John Lewis's credit card partner has received expressions of interest in a takeover of parts or all of its business from some of the world's largest financial investors. ",
        "url": "https://news.sky.com/story/pimco-and-kkr-among-suitors-for-16317bn-john-lewis-card-provider-newday-13354925",
        "image_url": "https://e3.365dm.com/23/05/1920x1080/image_6151011.jpg?20230510124529",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-24 14:43:00",
        "Headline": " A Bain Capital-led consortium which includes Centerbridge Partners is among the suitors circling NewDay, which also owns the Argos store card business, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n John Lewis's credit card partner has received expressions of interest in a takeover of parts or all of its business from some of the world's largest financial investors.  Sky News has learnt that NewDay Group, which is owned by the private equity firms Cinven and CVC Capital Partners, is fielding interest from suitors including Pimco, the asset management giant, KKR, and a Bain Capital-led consortium which also includes Centerbridge Partners. Banking sources said the parties were among a number of groups which were expected to table formal bids for NewDay in the coming weeks. Some of the bidders, such as Pimco, are said to be interested in pursuing a deal to buy NewDay's consumer loan book rather than the company as a whole; others, meanwhile, are understood to be interested in acquiring the whole business. NewDay, which took ownership of Argos's store card business last year in a £720m deal with J Sainsbury, the supermarket giant, has been exploring a sale or stock market listing for several months. Last November, Sky News reported that NewDay's owners were lining up investment bankers at Barclays to advise on a process. NewDay is one of Britain's biggest privately held providers of consumer credit services, with about four million customers. \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 \n                  Hundreds of jobs at risk as The Original Factory Shop launches survival plan\n                 \n                  Government to decide on 'postcode pricing' plan for electricity bills by summer\n                 The company is chaired by Sir Mike Rake, the former deputy chairman of Barclays, and run by John Hourican, the former Royal Bank of Scotland and Bank of Cyprus executive. Its regulated product portfolio includes direct-to-consumer credit cards, including Bip, the UK's first digital-only credit card. The company also has a string of merchant partnerships offering digital point-of-sale credit, such as Buy Now Pay Later and instalment finance products. As part of the Argos deal, NewDay struck an agreement to create a new Argos-branded digital credit proposition, which will replace the existing card credit and store card products. Last August, it said it had seen new customer acquisition rise by 36% during the first half of the current financial year, with customer arrears now standing at pre-Covid levels. If NewDay decides to float instead of pursuing a sale, a number of other banks are expected to be hired alongside Barclays, whose appointment is said to be imminent. None of the parties contacted by Sky News on Thursday afternoon would comment."
    },
    {
        "title": "Audio technology group Waves hello to £300m London float",
        "description": "An audio technology business used by many of the world's leading musicians is plotting a &#163;300m City flotation in a boost to London's flagging stock market.",
        "url": "https://news.sky.com/story/lse-13354693",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-london-london-stock-exchange_6636524.jpg?20240722164849",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-24 09:01:00",
        "Headline": "Waves Audio, which is headquartered in Tel Aviv, is working with Panmure Liberum on a rare London listing that could take place as early as June, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An audio technology business used by many of the world's leading musicians is plotting a £300m City flotation in a boost to London's flagging stock market. Sky News has learnt that Waves Audio, which is headquartered in Israel, has hired bankers to oversee an initial public offering which could take place as soon as June. The company, which is majority-owned by founders Meir Sha'ashua and Gilad Keren, is expected to raise millions of pounds from the sale of new shares, although the details have yet to be finalised. Money latest: Octopus Energy responds after being forced to ditch advert Panmure Liberum has been appointed to work on the float. Waves Audio makes professional digital audio signal processing technology and audio effects used in recordings, mixing, mastering, post-production, broadcasting and live sound. It employs more than 200 people, and has a major international presence, including in Europe and the US. \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 \n                  Hundreds of jobs at risk as The Original Factory Shop launches survival plan\n                 \n                  Government to decide on 'postcode pricing' plan for electricity bills by summer\n                 A board is said to be being assembled to support Waves Audio's transition to being a public company. A successful float on London's main market would be a relative rarity given the depressed level of IPO activity in recent months. Data compiled by EY, the professional services firm, showed that there were just five new listings on the London market in the first quarter of the year. Scott McCubbin, EY UKI IPO leader, said this month: \"The IPO market thrives on stability, but ongoing macroeconomic and geopolitical instability continues to subdue listing activity in the UK. Following the announcement of US trade tariffs, we've seen market volatility grow to levels not seen since the COVID pandemic. \"Companies considering an IPO must now weigh the risks of listing in such turbulent conditions, alongside rising input costs. \"The ambiguity surrounding global trade policy is also likely to dampen investor appetite and could lead to delayed listings or reduced valuations in the year ahead.\" Pessimism about the outlook for flotations has been compounded by a steady trickle of companies cancelling their London listings or shifting them overseas. The UK market's biggest hope continues to be that Shein, the Chinese-founded online fashion retailer, will defy the impact of President Trump's tariffs and list in London in the coming months. A spokesman for Waves Audio declined to comment."
    },
    {
        "title": "'I really love it': Top chef picks favourite chain restaurant - and shares 'ultimate' late night cheap eat",
        "description": "Every week Money interviews chefs from around the UK, hearing about their cheap food hacks and more. Today we chat to Nima Safaei, chef-owner at Soho's 40 Dean Street.",
        "url": "https://news.sky.com/story/i-really-love-it-top-chef-picks-favourite-chain-restaurant-and-shares-ultimate-late-night-cheap-eat-13354684",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-money-blog-cheap-eats_6895149.jpg?20250424065921",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-04-24 08:46:00",
        "Headline": "Chef Nima Safaei, owner at Soho's 40 Dean Street, reveals where he goes for a cheap meal in central London, his favourite city in the world to eat and more in Cheap Eats.",
        "Content": "Every week Money interviews chefs from around the UK, hearing about their cheap food hacks and more. Today we chat to Nima Safaei, chef-owner at Soho's 40 Dean Street. I have a great cheap recipe for aglio e olio... This dish is simple proof that you don't need expensive ingredients to make something absolutely delicious. It's the ultimate late-night, low-budget, full-of-flavour dish that comes together in minutes with a handful of cupboard staples. Simple, satisfying, and always hits the spot - I've cooked it many a time after closing! Ingredients Method For a great cheap meal I go to... Tongue & Brisket on Wardour Street. Proper, no-nonsense salt beef sandwiches that are packed with flavour but don't break the bank. The salt beef on rye with mustard and pickles is just decadence personified - juicy, rich, and the perfect balance of sharpness from the pickles and heat from the mustard. Plus, it's quick, filling, and always hits the spot! \n                  'It's overrated': Top chef on expensive food item that isn't worth it\n                 \n                  'I wish they realised': Top chef reveals the one thing customers should know about their bill\n                 \n                  Chef on giving pizza to homeless and why you shouldn't throw away citrus peel\n                 Read more:The story of olive oil's 110% price riseHow to complain in a restaurant, according to chefs, etiquette expert and the King's former butlerAll the latest consumer news from the Money blog The best city in the world to eat is… Italy of course for country - but it's impossible to pick just one city. Rome has the most divine carbonara, Naples for the best slice of pizza, Bologna for a hearty ragu, Sicily for seafood. Every region has its own specialities, and do them to perfection. The ingredients are always top quality, and even the simplest meals feel special. Never skimp on olive oil... A good extra virgin olive oil transforms the simplest ingredients. Drizzle it over tomatoes, dunk bread in it or finish a dish with it - you'll taste the difference instantly. My favourite chain? I really love Honest Burger - it's my guilty pleasure! There's a site close to our restaurants, so whenever I'm craving a juicy burger I simply have to go there. Their patties are juicy, the rosemary salted chips are simply legendary and the flavours are consistent! I've cut costs by... streamlining our wine list due to increased alcohol duty, as well as keeping an eye on costs per item. We also adjust staff rotas based on bookings to avoid overstaffing and control expenses. Go for chicken thighs over chicken breast... They have more flavour, juicier and way cheaper! Simply roast them with salt, pepper and a few cloves of garlic - they'll beat any fillet. If you have stale bread, turn it into pangrattato... It's the best crunchy topping for pasta. Blitz it, fry it with garlic and olive oil, and use it like parmesan. Zero waste, huge flavour."
    },
    {
        "title": "A consumer expert's guide to appealing against private parking 'fines'",
        "description": "Following reports that Britons are facing extortionate demands due to faulty parking machines, we're resurfacing our guide to appealing against private \"fines\".",
        "url": "https://news.sky.com/story/a-consumer-experts-guide-to-appealing-against-private-parking-fines-13354771",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-money-blog-parking-fine_6793371.jpg?20250107091536",
        "type": "Business",
        "Author": "Jess Sharp",
        "Date Published": "2025-04-24 10:58:00",
        "Headline": "Here's a look at what you can do when a private firm hits you with a parking charge - and why they can't actually \"fine\" you.",
        "Content": "\n          Money live reporter\n              @JournoJess97\n Following reports that Britons are facing extortionate demands due to faulty parking machines, we're resurfacing our guide to appealing against private \"fines\". We teamed up with consumer expert Scott Dixon, AKA Complaints Resolver... Private companies cannot 'fine' you First, it's worth outlining that there is a big difference between parking infringements against councils and against private parking companies. Councils can fine you for infringements on public highways (like parking on double yellow lines or in a bus lane) and issue penalty charge notices - these must be paid, or you can appeal against it with as much evidence as possible. You risk bailiffs, clamping, your vehicle being towed away, and a court order (which could impact your credit score if you lose) if you do not pay. But never pay a council or private parking ticket if you intend to appeal, as payment is considered an admission of liability. On the other hand, private parking operators cannot clamp you and they can't fine you as such - they issue parking charge notices, which are invoices for an alleged breach of contract for parking on private land. \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 \n                  Hundreds of jobs at risk as The Original Factory Shop launches survival plan\n                 \n                  Government to decide on 'postcode pricing' plan for electricity bills by summer\n                 Dixon says: \"They look the same, and there's a reason for that. A private parking operator's business model is to extract money from you, and it's estimated that 80% of motorists pay straightaway due to the legalese jargon.\" Of course, landowners should reasonably be able to charge people to park on their land, so if you're at fault, it might be that the right thing to do is pay up. But if you think what they're charging you in their \"invoice\" is unfair, Dixon says you could appeal. Some advice online suggests you can simply ignore these \"invoices\" - Dixon doesn't recommend this, but we'll cover this in more depth shortly. Is the private company operating the car park on behalf of a business? It's always worth speaking to the business itself - if you have reasonable grounds, they may be able to cancel the \"fine\". \"Ask for proof in writing that they will cancel it so you can advise the parking operator to cease and desist harassing you,\" Dixon says. Collect evidence for appeals Evidence will be key to the success of any appeals or court action - so take photos, get witness statements, keep all correspondence and get proof of any mitigating circumstances. Other sources of evidence might be shopping receipts, dashcam footage or a mobile phone with Google location tracker. Another tool is Google Reviews - are others having a similar issue to you? \"You may find a common theme from what other users say, which can reinforce your points and case on appeal,\" says Dixon. Dixon also suggests submitting a data subject access request to the private parking operator and DVLA to access all of your personal data that's being used in the case. Appealing against private tickets A ticket might be considered unfair if you didn't actually break any rules, the machine was broken, the signage was poor or unclear, you didn't park on private land, or there were some mitigating circumstances. The starting point is exhausting the private company's own appeals process. After that, there are two parking trade associations in the UK that have a code of practice for their members to abide by. First, the British Parking Association (BPA). You can check its website to see if an operator is a member. The BPA set up the Parking on Private Land Appeals (POPLA) service. Dixon says: \"Roughly one in four parking charges are cancelled due to the operator not responding to POPLA and over 40% of appeals made to POPLA are upheld, which evidences my suspicions that private parking operators play the percentages game knowing that many motorists simply pay up even if they believe that they have done nothing wrong.\" The International Parking Community is the other trade association and operates the Independent Appeals Service. Dixon adds: \"First stage appeals are often rejected regardless of any mitigating circumstances, so you could have escalated your appeal to the second stage and it should have been upheld.\" You have 28 days to do this. If you lose the appeal, you can either pay or defend it if it goes to court. If the company is not part of a trade organisation If the operator is not part of a trade body, it can only access keeper details from the DVLA if you respond to appeal against one of its \"invoices\". If you have responded without realising and divulged keeper details, keep in mind that firms that aren't part of trade organisations may have dubious appeal policies. Instead of appealing, consider writing to them explaining why you think the parking charge notice is unfair, with evidence to reinforce your case. Read more Money blog features:'Do I ask last minute hen do dropout to pay?''Ryanair won't cover expenses after cancelled flight - who's right?' Doing nothing There is plenty of anecdotal evidence online that private firms don't always consider it worthwhile going to court for small amounts - but there is no guarantee you'll get lucky. Dixon says: \"I recommend you don't ignore these 'invoices', as these private parking operators pursue alleged debts through the courts and you risk incurring a county court judgment which can impact your ability to get loans, mortgages, mobile phone contracts and any credit for many years. \"Trivial amounts quickly escalate into hundreds of pounds when court fees, solicitor fees and debt recovery fees are added,\" Dixon says. It's important to stress there are some types of letters you could consider ignoring - and some you should definitely not. \"You can safely ignore any debt collector letters,\" says Scott, because unlike councils, private parking firms or the debt collection companies they employ cannot use bailiffs. \"These debt collectors are 'strangers to the debt' and don't own the debt or have any powers to enforce it. This means that they are third parties to the alleged debt and have as much power as I do to enforce a private parking ticket. \"The letters use legalese jargon to intimidate and coerce you into paying up with threats of escalating costs and county court judgments. It's a tried and tested business model and usually works.\" However, Dixon says, it is essential you respond to any \"letter before claim\" or \"letter before action\". \"This is the final stage before a case goes to court and needs to be completed prior to a court hearing,\" he explains. Potential 'ace card' if case goes to court The statute of limitations for bringing a case to court is six years in England and Wales and five years in Scotland from the date of the parking event. It would be a civil action - there is no guilty or not guilty, and you can't get a criminal record. You will be issued with a county court judgment if the court rules against you. You will have to pay the parking charge notice fine plus some costs, and failing to do so could impact your credit rating. A private parking operator cannot send bailiffs to your home. Bailiffs are only sent to your home to pursue court orders for non-payment of penalty charge notices issued by councils. One potential \"ace card\" that Dixon says often succeeds in this kind of court case is this... \"Ask their solicitor on the day if they have a 'right of audience'. Basically, do they have the right of audience to represent their client? \"Many solicitors are self-employed and do not have the right to represent these private parking operators. \"They just turn up on the day they are asked to. If they do not have a right of audience in court, the case should automatically be dismissed.\""
    },
    {
        "title": "Pepper spray to be used in young offender institutions as violence rises",
        "description": "Pepper spray will now be used in young offender institutions - where the rate of assaults on staff is 14 times higher than in adult prisons.",
        "url": "https://news.sky.com/story/pepper-spray-to-be-used-in-young-offender-institutions-as-violence-rises-13354706",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-wetherby-hmyoi-yoi_6479116.jpg?20240305084915",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-24 09:22:00",
        "Headline": "There are fewer young people in custody in recent years - most of whom are 16- to 18-year-old boys - but the level of violence has risen.\n",
        "Content": "Pepper spray will now be used in young offender institutions - where the rate of assaults on staff is 14 times higher than in adult prisons. Specially trained prison officers in England will be allowed to use PAVA, a synthetic pepper spray, \"as a last resort\" to help de-escalate and diffuse violent situations from this summer. They will only be allowed to use the spray in limited circumstances where there is serious violence or an imminent risk of it taking place, and ministers will review its use after 12 months. Read more: Ed Miliband reads out rare message from King Charles New figures show the rate of assaults in England's three youth offender institutions is around 14 times higher than in adult prisons. Assaults by children and young people on staff at HMYOI Feltham A, HMYOI Werrington and HMYOI Wetherby increased by nearly 25% in 2024 compared with the previous year. The Ministry of Justice hopes allowing officers to use pepper spray will keep young people in custody safe so they can focus on rehabilitation and reduce reoffending. \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 \n                  Government to decide on 'postcode pricing' plan for electricity bills by summer\n                 \n                  Tech firms face fines up to £60,000 for failing to remove knife crime content\n                 Minister for youth justice Sir Nic Dakin said: \"This government inherited a criminal justice system in crisis. \"The unacceptable levels of violence faced by our brave frontline officers in young offender institutions is yet another symptom of that. \"This is not a decision we have made lightly, but our overarching duty is to keep staff and young people in custody safe. \"This spray is a vital tool to prevent serious violence, helping staff to focus on rehabilitation as part of our plan for change.\" Pepper spray is already used on children and adults in the community, and in adult prisons. It can be used during the most serious incidents in youth offender institutions, but only by national tactical response officers, who are nationally based and have to be authorised to go into an institution by a prison gold commander. Deploying officers can take more than an hour, and because altercations often arise rapidly and with little warning, they can rarely arrive in time to respond to the violence. The number of young people in custody has fallen significantly in recent years, however, the majority in youth offender institutions are older teenage boys, aged 16 to 18 years old. More than two-thirds are there for violent offences such as murder, attempted murder and grievous bodily harm. Safety concerns have been rising, with recent incidents seeing young offenders seriously injured and staff experiencing fractures, dislocations, puncture wounds and lacerations. Staff acting as body shields A senior Ministry of Justice source told Sky News many of the boys are the same size as adults. They said a recent example includes a boy being attacked last Monday by five other boys who stamped on his head and stabbed him with a handmade weapon. \"I've got staff here that are putting their bodies in the way to defend and try and prevent injuries happening to young people, and as a result of that they're being injured themselves,\" they said. \"I think that's a prime example of where if we've got an incapacitant spray like PAVA it could be utilised effectively to defuse the situation and not only cause significant harm to my staff but also to young people.\" Like rubbing chillies in your eyes The source explained the pepper spray has the same effect as if you rub chillies in your eye while cooking, with eyes experiencing a burning sensation, closing up, and producing tears and snot - \"but it passes\". They said when they tested the spray on themselves, it took 45 minutes to an hour to pass and people have different levels of discomfort and irritation. \"It means you physically can't respond in the way you normally do, so that ability to then ask the staff to step in because that person is impacted by it is the crucial stuff,\" they added."
    },
    {
        "title": "Public failed by water regulators and government as bills rise, spending watchdog says",
        "description": "Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said.",
        "url": "https://news.sky.com/story/public-failed-by-water-regulators-and-government-as-bills-rise-spending-watchdog-says-13354889",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-sewage-spills-thames_6505233.jpg?20240330143917",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "As trust in the water industry reaches a record low, bills are rising at a rate last seen 20 years ago.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Water regulators and the government have failed to provide a trusted and resilient industry at the same time as bills rise, the state spending watchdog has said. Public trust in the water sector has reached a record low, according to a report from the National Audit Office (NAO) on the privatised industry. Not since monitoring began in 2011 has consumer trust been at such a level, it said. At the same time, households face double-digit bill hikes over the next five years. The last time bills rose at this rate was just before the global financial crash, between 2004-05 and 2005-06. Regulation failure All three water regulators - Ofwat, the Environment Agency and Drinking Water Inspectorate - and the government department for environment, food and rural affairs (Defra) have played a role in the failure, the NAO said, adding they do not know enough about the condition or age of water infrastructure and the level of funding needed to maintain it. \n                  'Disgraceful' amount of sewage still being dumped in English rivers, says environment secretary\n                 \n                  Three quarters of a million pieces of rubbish found on UK beaches\n                 \n                  An abundance of marine life - but the wildlife of the Falkland Islands is more vulnerable than most\n                 Since the utilities were privatised in 1989, the average rate of replacement for water assets is 125 years, the watchdog said. If the current pace is maintained, it will take 700 years to replace the existing water mains. Water firms have grappled with leaky pipes and record sewage outflows into UK waterways in recent years, with enforcement action under way against all wastewater companies. Despite there being three regulators tasked with water, there is no one responsible for proactively inspecting wastewater to prevent environmental harm, the report found. Instead, regulation is reactive, fining firms when harm has already occurred. Financial penalties and rewards, however, have not worked as water company performance hasn't been \"consistent or significantly improved\" in recent years, the report said. 'Gaps, inconsistencies, tension' The NAO called for this to change and for a body to be tasked with the whole process and assets. At present, the Drinking Water Inspectorate monitors water coming into a house, but there is no entity looking at water leaving a property. Similarly no body is tasked with cybersecurity for wastewater businesses. As well as there being gaps, \"inconsistent\" watchdog responsibilities cause \"tension\" and overlap, the report found. The Environment Agency has no obligation to balance customer affordability with its duty to the environment when it assesses plans, the NAO said.  Company and investment criticism Regulators have also been blamed for failing to drive enough funding into the water sector. From having spoken to investors through numerous meetings, the NAO learnt that confidence had declined, which has made it more expensive to invest in companies providing water. Even investors found Ofwat's five-yearly price review process \"complex and difficult\", the report said. Financial resilience of the industry has \"weakened\" with Ofwat having signalled concerns about the financial resilience of 10 of the 16 major water companies. Most notably, the UK's largest provider, Thames Water, faced an uncertain future and potential nationalisation before securing an emergency £3bn loan, adding to its already massive £16bn debt pile. Read more from Sky News:Hundreds of jobs at risk as The Original Factory Shop launches survival planGovernment to decide on 'postcode pricing' plan for electricity bills by summer Water businesses have been overspending, with only some extra spending linked to high inflation in recent years, leading to rising bills, the NAO said. Over the next 25 years, companies plan to spend £290bn on infrastructure and investment, while Ofwat estimates a further £52bn will be needed to deliver up to 30 water supply projects, including nine reservoirs. What else is going on? From today, a new government law comes into effect which could see water bosses who cover up illegal sewage spills imprisoned for up to two years. Such measures are necessary, Defra said, as some water companies have obstructed investigations and failed to hand over evidence on illegal sewage discharges, preventing crackdowns. Meanwhile, the Independent Water Commission (IWC), led by former Bank of England deputy governor Sir Jon Cunliffe, is carrying out the largest review of the industry since privatisation. What the regulators and government say?  In response to the report, Ofwat said: \"The NAO's report is an important contribution to the debate about the future of the water industry. \"We agree with the NAO's recommendations for Ofwat and we continue to progress our work in these areas, and to contribute to the IWC's wider review of the regulatory framework. We also look forward to the IWC's recommendations and to working with government and other regulators to better deliver for customers and the environment.\" An Environment Agency spokesperson said: \"We have worked closely with the National Audit Office in producing this report and welcome its substantial contribution to the debate on the future of water regulation. \"We recognise the significant challenges facing the water industry. That is why we will be working with Defra and other water regulators to implement the report's recommendations and update our frameworks to reflect its findings.\" A Defra spokesperson said: \"The government has taken urgent action to fix the water industry - but change will not happen overnight. \"We have put water companies under tough special measures through our landmark Water Act, with new powers to ban the payment of bonuses to polluting water bosses and bring tougher criminal charges against them if they break the law.\" Water UK, which represents the water firms, has been contacted for comment."
    },
    {
        "title": "Government to decide on 'postcode pricing' plan for electricity bills by summer",
        "description": "The government will decide by the summer on controversial proposals to charge some households more for their electricity than others, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-decide-on-postcode-pricing-plan-for-electricity-bills-by-summer-13354653",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6895380.jpg?20250424120800",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-24 07:31:00",
        "Headline": "So-called \"zonal pricing\" could see the south of England pay more for electricity bills than parts of Scotland. It comes as energy secretary Ed Miliband doubles down on the case for more clean power, while a Trump official invokes the Bible to support US energy policy.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government will decide by the summer on controversial proposals to charge some households more for their electricity than others, Sky News understands. The energy secretary Ed Miliband has been mulling over plans for \"zonal pricing\", which would see different regions of the country pay different rates, based on supply and demand levels in the local area. The idea is to attract industry to build in low-cost areas, and incentivise new electricity generation in regions where people need it most. Supporters say zonal pricing could lower everyone's bills to some extent by making the system more efficient - but some would fall more than others. Critics, including renewable energy generators, warn the plans would create a postcode lottery for bills and put investors off certain areas, risking jobs. It is not yet clear how the changes would be passed on to household bills. But it could see people in the south of England pay much more than those in parts of Scotland - though not, the government hopes, more than they do now. Ed Miliband told Sky News: \"My bottom line here is any reform we make has got to cut bills, and it's got to cut bills across the country. \n                  China's rocket launch is building on space programme with staggering ambition\n                 \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  UK vision for clean energy to collide with Trump's fossil fuel frenzy\n                 \"We're not going to have a postcode lottery... If there are bills savings to be made, we want them to be spread across the country so that all consumers benefit.\" He is expected to make his recommendation to fellow ministers in the coming weeks, before the government decides either way by the middle of this year. They are keen to resolve the issue - which was also considered under the last Tory government - before businesses start bidding for fresh renewable power contracts in summer. UK still 'vulnerable and exposed' It comes as the UK government hosts a summit on energy security in London today, lobbying other countries to leave fossil fuels behind. Read more: UK clean energy vision collides with Trump's fossil fuel frenzy Mr Miliband said the government's push to generate more clean power at home was as much about energy security as it was about fighting climate change. \"As long as energy can be weaponised against us, our countries and our citizens are vulnerable and exposed,\" he said in a speech. But he also said North Sea oil and gas would \"continue to play an important role\" in the UK energy mix, fuelling campaigners' fears it may yet allow the Rosebank oil and gas field to go ahead, despite hurdles in court and the government's own concerns.  Trump's representative invokes God US President Donald Trump's junior representative at the summit, acting assistant secretary Tommy Joyce, quoted the Bible in his address. He urged delegates to \"remember God's golden rule, and that is that we should love our neighbour as ourselves\". That means helping them out of poverty through access to affordable energy, according to Mr Joyce. About 750 million people in the world still have no access to electricity, and team Trump says American oil, gas and coal are the answer. However, a report by RMI suggests that new wind and solar are the cheapest option for new electricity in 82% of the world - though for some countries are hard to finance upfront, and they still need oil and gas for other sectors. Mr Joyce also continued Trump's ongoing attacks on climate policies, criticising what he described as \"so-called renewables\" and the \"net zero agenda\". 'Most delicate debate' Before the summit, a senior UN official said the idea that the switch to clean power compromised energy security and affordability \"is just not true\". \"We really need to dispel this notion,\" said the source, speaking on the condition of anonymity. \"If you are dependent on volatile and expensive fossil fuel imports, fossil fuels equal energy insecurity.\" A senior official from Brazil, which in November is hosting the COP30 UN climate summit, also this week said there had been a \"rather successful\" attempt by some to frame energy security and the switch to clean energy as a question of \"either/or\". \"We don't believe it is.\" He called it \"one of the most delicate debates\" of the moment."
    },
    {
        "title": "Tech firms face fines up to £60,000 for failing to remove knife crime content",
        "description": "Social media companies will be fined up to &#163;60,000 each time a post relating to knife crime is not removed from their sites in a bid to stop children viewing \"sickening\" content.",
        "url": "https://news.sky.com/story/tech-firms-face-fines-up-to-16360000-for-failing-to-remove-knife-crime-content-13355131",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-iphone-social-media_6894449.jpg?20250423111210",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-04-24 23:00:00",
        "Headline": "The government is extending measures to fine individual tech executives whose platforms fail to remove knife content - but campaigners say more still needs to be done amid soaring knife crime rates.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Social media companies will be fined up to £60,000 each time a post relating to knife crime is not removed from their sites in a bid to stop children viewing \"sickening\" content. The new sanction expands on previously announced plans to fine individual tech executives up to £10,000 if their platforms fail to remove material advertising or glorifying knives following 48 hours of a police warning. It means tech platforms and their executives could collectively face up to £70,000 in penalties for every post relating to knife crime they fail to remove, with the new laws applying to online search engines as well as social media platforms and marketplaces. Crime and policing minister Dame Diana Johnson said the content that young people scroll through every day online \"is sickening\" adding: \"That is why we are now going further than ever to hold to account the tech companies who are not doing enough to safeguard young people from content which incites violence, particularly in young boys.\" The sanctions for tech platforms will be introduced via an amendment to the Crime and Policing Bill. It is separate to the Online Safety Bill, which aims to protect children from online harm, which some campaigners and parents have criticised for not going far enough. The Home Office said today's announcement follows \"significant consultation\" with the Coalition to Tackle Knife Crime, launched by Sir Keir Starmer in September as part of his bid to half knife offences in a decade. \n                  Student killed and three injured in stabbing at French school\n                 \n                  Murder arrest after woman stabbed to death in Enfield - as victim named\n                 \n                  'Children can't go to the shop without fear of being stabbed': Young people in Birmingham drill recording studio on reality of knife crime\n                 Patrick Green, chief executive of The Ben Kinsella Trust, a knife prevention charity which is part of the coalition, welcomed the measure, telling Sky News social media companies have \"proved themselves to be incapable of self-regulation\". \"There's been a real reluctance of social media companies to take action sufficiently quickly. It's shameful, we shouldn't need legislation,\" he said.  The Ben Kinsella Trust is named after teenager Ben Kinsella who was fatally stabbed in 2008 on the way home from the pub after celebrating his GCSEs. Months earlier, Ben had written to then prime minister Gordon Brown to urge his government to tackle knife crime. Knife crime rates soar However, the problem has soared since then. In the year to March 2024, there were 53 teenage victims aged 13-19 in England and Wales, according to the Office for National Statistics. That is a 140% increase on the 22 teenage victims a decade earlier. Overall, police recorded 54,587 knife-related offences in 2024, up 2% on the previous year and more than double the 26,000 offences recorded in 2014. Mr Green told Sky News that while knife crime has been happening \"long before social media took hold\", online content glamorising the possession of a knife is hindering efforts to reduce it. \"There will be pictures of these knives [on social media] with 'follow me' luring young people onto places where these knives are sold. It's never been easier for a child to buy a knife.\" 'One part of a larger problem' However, while welcoming today's announcement he said social media was \"one part of a larger problem\", adding that \"provisions of youth services have been decimated\" and \"much more needs to be done\". The government's plan to halve knife crime in a decade includes banning zombie-style knives and ninja swords, with a nationwide surrender scheme launching in July, and stronger laws for online retailers selling knives. Ministers also want to increase prison sentences for selling weapons to under-18s and introduce a new offence for possessing a weapon with intent for violence, with a prison sentence of up to four years. Read more:Young people in Birmingham drill recording studio on reality of knife crimeWhat are the UK's knife crime laws - and how could they be tightened? Government 'can't police the internet' Last month, Conservative MP Ben Obese-Jecty suggested violent videos viewed online should be used as evidence to prosecute under the new law. He was speaking during a debate he secured on knife crime, in which he criticised a wider culture which \"valorises\" criminality and gangs in music and the media. On the measures announced today, the Huntingdon MP told Sky News that while \"any measures to help reduce instances of knife crime are hugely welcome\", he was doubtful that the sanctions could be effectively enforced. \"The sheer scale of content on social media that glorifies or incites violence is staggering, let alone content returned by search engines,\" he said. \"The government can't possibly hope to realistically police the internet. \"The government must tackle the culture that promotes and encourages the use of knives and ensure that there are robust consequences to doing so, not simply pretend they will have online content removed.\""
    },
    {
        "title": "Europe and Starmer double down on clean power as America ups the ante",
        "description": "Sir Keir Starmer was in his comfort zone on Thursday, waxing lyrical about one of his favourite \"missions\".",
        "url": "https://news.sky.com/story/europe-and-starmer-double-down-on-clean-power-as-america-ups-the-ante-13354932",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ursula-von-der-leyen_6895591.jpg?20250424153257",
        "type": "Politics",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-24 14:56:00",
        "Headline": "Donald Trump's government looks somewhat isolated in its attacks on clean power, as Europe, China and the UK double down. But the UK and China still need America.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Sir Keir Starmer was in his comfort zone on Thursday, waxing lyrical about one of his favourite \"missions\". Speaking at the government's summit on energy security, the prime minister doubled down on plans for clean energy, which he reaffirmed will boost, not harm, national security - in the face of attacks on net zero policies from the Trump administration and Reform UK. He said we are \"living through a new era of global instability\" - that hits locally. Carers, nurses and teachers are \"working harder and harder for the pound in their pocket, but feeling at the same time that they have less control of their lives\". The problem is Britain's \"overexposure\" to the \"rollercoaster of international fossil fuel markets\" - which leaves people vulnerable to price spikes and vulnerability sparked anywhere in the world. Homegrown clean energy is the answer, he said. It's the \"only way to take back control of our energy system, deliver energy security and bring down bills for the long term\". And he's not alone. Energy analysts broadly agree that more UK-generated clean power protects people from price shocks from energy imported from abroad. \n                  How to beat energy price rise by almost £180\n                 \n                  UK energy bills highest in Europe and public patience is wearing thin\n                 \n                  Energy bills for typical household to rise to £1,849 a year from April\n                 So do most of the other 55-odd governments who attended his summit in London. European Commission President Ursula von der Leyen said in her speech that \"as our energy dependence on fossil fuels goes down, our security goes up\". The glaring exception on Thursday was America. Its delegate to the summit, acting assistant secretary Tommy Joyce, told the conference that abundant energy \"raises people out of poverty and brings health, wealth, and opportunity\". Few would dispute that. But he also said climate policies had led to \"energy scarcity\" that \"harms human lives\" and attacked \"so-called renewables\" and the \"net zero agenda\". He was apparently happy to overlook the danger posed by fossil fuels, from air pollution, to price volatility, to the turbocharged LA wildfires or Hurricane Helene. And the fact that US oil and gas production reached record levels under previous president Joe Biden, even as he pursued climate policies too. Read more from Sky News:Rocket launch builds on space programme with staggering ambitionGovt to decide on 'postcode pricing' plan for electricity bills by summer America appeared isolated, as other countries at the summit simply carried on talking up the benefits of clean energy. On Wednesday, China - America's greatest rival and the world's second-largest economy after the US - pledged it would \"not slow down its climate actions\" and committed to fresh targets. It is already building more solar farms and wind turbines than anyone else and dominates clean tech supply chains - much to the ire of Team Trump, who rues the way the shift to clean energy empowers China. Going further off the beaten track, Mr Joyce also quoted the Bible, saying God's \"golden rule\" is to love your neighbour: which appears to mean selling it lots of American oil, gas and coal (no mention of US threats to seize control of neighbouring Canada or the Panama Canal). Whacky phrasing aside, it's true the world still needs lots of America's abundant fossil fuels for now. Europe is desperate for gas, with storage running low and Russian supplies drying up, and President von der Leyen also celebrated the \"strategic importance\" of US liquefied natural gas (LNG) imports. And the UK relies on America for the majority of its oil imports, and tankers full of LNG. These fossil fuels are in the mix of deals the US is currently discussing with both the EU and the UK. So, Europe is staying the course on the energy transition for now. But that comfort zone of confidence may yet be tested by these trade talks."
    },
    {
        "title": "Nigel Farage 'not sure' if Robert Jenrick is genuine and says 'time will prove' if he means what he says",
        "description": "Time will tell if Robert Jenrick is the sort of MP who gives politicians a bad name, Nigel Farage has said.",
        "url": "https://news.sky.com/story/nigel-farage-not-sure-if-robert-jenrick-is-genuine-and-says-time-will-prove-if-he-means-what-he-says-13354857",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-farage-reform-jenrick_6895510.jpg?20250424135743",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-04-24 12:53:00",
        "Headline": "The Reform UK leader branded Robert Jenrick 'Robert Generic' and questioned if he really means what he says.",
        "Content": " Time will tell if Robert Jenrick is the sort of MP who gives politicians a bad name, Nigel Farage has said. In an exclusive interview with Sky News' deputy political editor Sam Coates, the Reform UK leader suggested the shadow justice secretary would not be welcome in his party as he is not sure if he is \"genuine\". Politics latest: PM speaks at global energy security summit The comments differ from that of deputy Reform UK leader Richard Tice, who yesterday told Sky News Mr Jenrick is saying \"good things on justice\" but is \"in the wrong party\". It comes after Sam Coates obtained a leaked recording of Mr Jenrick, who came second in the Tory leadership vote, telling a student event last month he is \"determined\" for the fight from the right against Labour \"to be united\". In withering remarks to Sam Coates on Thursday, Mr Farage questioned whether Mr Jenrick really means what he says. Asked if he would welcome him into Reform UK, the Clacton MP said: \"Maybe... if we thought he was genuine, yes. \n                  Pepper spray to be used in young offender institutions as violence rises\n                 \n                  Public failed by water regulators and government as bills rise, spending watchdog says\n                 \n                  Government to decide on 'postcode pricing' plan for electricity bills by summer\n                 \"Don't forget...this is Robert 'Generic'. This is Robert the Remainer. This is the Robert the, I don't stand particularly for anything at all, who suddenly appears to be.. on this Damascene Conversion.\" Asked what he means by genuine, Mr Farage said: \"You and I both know there are people in politics who are there through conviction and there are people in politicians who are there because they want reach rank, position and all that comes with that. \"Im really still not sure about Jenrick, to be honest with you, I'm really not sure. \"It's almost like an overnight conversion, saying a whole host of things that he did differently when he was in government.\" Asked if he thinks Mr Jenrick is the sort of person who gives politicians a bad name, Mr Farage said: \"Time will prove that. At the minute, I'm sceptical. \"Look, we're all allowed, as we get older, to change our positions on things. Of course we are. But his current policy positioning just seems so far removed from everything he's ever stood for.\" In the leaked recording, Mr Jenrick can be heard saying he would try \"one way or another\" to make sure Reform UK and the Tories do not compete at another general election and hand a second term in office to Sir Keir Starmer in the process.  Mr Jenrick has since denied any suggestion that this means he is advocating a Tory-Reform UK pact. Mr Farage was clear that it would not be happening anyway, as he accused Mr Jenrick of \"shaping up\" to be the next Conservative leader. \"It's not happening, our voters came to us from the Conservatives because they felt so betrayed by the Conservatives,\" he said. \"Why would we [join forces], given what we're building here, why would we want to ally to a Conservative Party we don't agree with and, frankly, we see as a failing brand.\" Asked when he last spoke to him, he said that was yesterday, adding: \"I saw him entering the Palace of Westminster. Brand new suit on, I think he'd been to Savile Row. And I said to him, are you on Ozempic Robert? \"I mean he's clearly shaping himself up to be the next leader of the Conservative Party. He doesn't care what internal division he causes within the Parliamentary Party. But he's actually mistaken. We are not going to do a deal with a Conservative Party that gave us record tax levels since the war, mass migration, I mean I could go on.\"  However, he said that joking aside, he has not had a substantive conversation with the Tories this year. The Reform leader said his party's priority was \"to win the next election\" and the idea that Reform and Conservative supporters will agree on the same things \"isn't going to happen\". \"Most of our members think the Tory party failed despicably in the last government - and I agree with them,\" he said. Mr Farage's comments differ to his deputy Mr Tice. Reacting to the leaked recording yesterday, he told Sky News that the Conservatives should \"disappear into sort of yesteryear and that \"we are at a once in a century moment where a new party is taking over from the Conservatives\". However, he extended a compliment to Mr Jenrick, telling him: \"Robert, you're saying some good things on justice. But you're in the wrong party, chap.\""
    },
    {
        "title": "China's rocket launch is building on space programme with staggering ambition",
        "description": "Seeing a rocket launch to space is not just something you watch but something you feel.",
        "url": "https://news.sky.com/story/chinas-rocket-launch-is-building-on-space-programme-with-staggering-ambition-13354969",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-shenzhou-20-crew-china_6895785.jpg?20250424190110",
        "type": "Technology",
        "Author": "Helen-Ann Smith",
        "Date Published": "2025-04-24 15:38:00",
        "Headline": "China wants to be the next country to put a man on the moon and the first country to return samples from Mars, both feats the US is also actively pursuing.",
        "Content": "\n          Asia correspondent\n              @HelenAnnSmith0\n  Seeing a rocket launch to space is not just something you watch but something you feel. Even from some distance away, the impact is immense, you can feel the reverberations in your chest and you cannot hear the person next to you. It's hard not to be impressed.  For the hundreds of people who had gathered to watch the Shenzhou-20 crew launch in Jiuquan, on the edge of the Gobi Desert in northwestern China, they were not just impressed but gleeful too. There was a deafening hush as the countdown began, followed by screams of joy as it disappeared into the atmosphere. Such is the sense of pride that China is showing the world what it can do. Rocket launch as it happened This launch might be relatively routine in space terms - three taikonauts (the Chinese term for astronaut) headed to China's space station as part of a scheduled six-month rotation. But it is all building on a space programme with staggering ambition, proceeding at a rapid pace. It is quite a journey to get to the Jiuquan Satellite Launch Centre. We travelled three and a half hours by bus from the nearest town, mile upon mile of flat dusty desert, just the occasional settlement and military base on the way. When there, the base is a huge facility, a fully functioning complex in the middle of the desert for space staff who live and work there, complete with a school, restaurants and even a gift shop. We were bused around by our handlers from the Chinese government, closely managed throughout, and it was hard to break away from the schedule to interview people. But it was easy to get a sense of just how proud people felt. Read more:Despite tariffs, China's Silicon Valley is ready to make its mark on the world 'China is number one' At the \"farewell\" ceremony, where the three-man crew waved goodbye to the crowds, you could just feel it. People waved flowers and flags and sang national songs. \"China is number one,\" screamed one man. \"I'm so proud to have been born in China,\" enthused another woman. Indeed it feels that space is a nationalistic endeavour, that their successes are also China's. Escalating superpower race for results They won't say it out loud here, but everyone knows the context: an escalating standoff with America, a superpower race for results. China wants to be the next country to put a man on the moon and the first country to return samples from Mars, both feats the US is also actively pursuing. All space programmes have other motives China does have reason to feel confident. It has made huge gains in recent years, including the completion of its own space station, landing a rover on Mars and being the only nation to have returned samples from the far side of the moon. While everyone we ask here insists there is no competition and all this is being done purely for the benefit of science and mankind, all space programmes have other quieter motives. Dominance in space gives countries the edge in terms of military capabilities, communications and intelligence. Indeed, just outside the base, a sign warns the public that \"to keep secrets is glorious\" and \"if you sell secrets you could be executed\". World is watching China's surging progress China almost certainly views the space race in these terms, particularly as a system that always views things through a long-term lens and in a world that's increasingly polarised. While the US is still the most powerful country in space, China is closing the gap and the world is watching its surging progress."
    },
    {
        "title": "Europe and Starmer double down on clean power as America ups the ante",
        "description": "Sir Keir Starmer was in his comfort zone on Thursday, waxing lyrical about one of his favourite \"missions\".",
        "url": "https://news.sky.com/story/europe-and-starmer-double-down-on-clean-power-as-america-ups-the-ante-13354932",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ursula-von-der-leyen_6895591.jpg?20250424153257",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-24 14:56:00",
        "Headline": "Donald Trump's government looks somewhat isolated in its attacks on clean power, as Europe, China and the UK double down. But the UK and China still need America.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Sir Keir Starmer was in his comfort zone on Thursday, waxing lyrical about one of his favourite \"missions\". Speaking at the government's summit on energy security, the prime minister doubled down on plans for clean energy, which he reaffirmed will boost, not harm, national security - in the face of attacks on net zero policies from the Trump administration and Reform UK. He said we are \"living through a new era of global instability\" - that hits locally. Carers, nurses and teachers are \"working harder and harder for the pound in their pocket, but feeling at the same time that they have less control of their lives\". The problem is Britain's \"overexposure\" to the \"rollercoaster of international fossil fuel markets\" - which leaves people vulnerable to price spikes and vulnerability sparked anywhere in the world. Homegrown clean energy is the answer, he said. It's the \"only way to take back control of our energy system, deliver energy security and bring down bills for the long term\". And he's not alone. Energy analysts broadly agree that more UK-generated clean power protects people from price shocks from energy imported from abroad. \n                  How to beat energy price rise by almost £180\n                 \n                  UK energy bills highest in Europe and public patience is wearing thin\n                 \n                  Energy bills for typical household to rise to £1,849 a year from April\n                 So do most of the other 55-odd governments who attended his summit in London. European Commission President Ursula von der Leyen said in her speech that \"as our energy dependence on fossil fuels goes down, our security goes up\". The glaring exception on Thursday was America. Its delegate to the summit, acting assistant secretary Tommy Joyce, told the conference that abundant energy \"raises people out of poverty and brings health, wealth, and opportunity\". Few would dispute that. But he also said climate policies had led to \"energy scarcity\" that \"harms human lives\" and attacked \"so-called renewables\" and the \"net zero agenda\". He was apparently happy to overlook the danger posed by fossil fuels, from air pollution, to price volatility, to the turbocharged LA wildfires or Hurricane Helene. And the fact that US oil and gas production reached record levels under previous president Joe Biden, even as he pursued climate policies too. Read more from Sky News:Rocket launch builds on space programme with staggering ambitionGovt to decide on 'postcode pricing' plan for electricity bills by summer America appeared isolated, as other countries at the summit simply carried on talking up the benefits of clean energy. On Wednesday, China - America's greatest rival and the world's second-largest economy after the US - pledged it would \"not slow down its climate actions\" and committed to fresh targets. It is already building more solar farms and wind turbines than anyone else and dominates clean tech supply chains - much to the ire of Team Trump, who rues the way the shift to clean energy empowers China. Going further off the beaten track, Mr Joyce also quoted the Bible, saying God's \"golden rule\" is to love your neighbour: which appears to mean selling it lots of American oil, gas and coal (no mention of US threats to seize control of neighbouring Canada or the Panama Canal). Whacky phrasing aside, it's true the world still needs lots of America's abundant fossil fuels for now. Europe is desperate for gas, with storage running low and Russian supplies drying up, and President von der Leyen also celebrated the \"strategic importance\" of US liquefied natural gas (LNG) imports. And the UK relies on America for the majority of its oil imports, and tankers full of LNG. These fossil fuels are in the mix of deals the US is currently discussing with both the EU and the UK. So, Europe is staying the course on the energy transition for now. But that comfort zone of confidence may yet be tested by these trade talks."
    },
    {
        "title": "Government to decide on 'postcode pricing' plan for electricity bills by summer",
        "description": "The government will decide by the summer on controversial proposals to charge some households more for their electricity than others, Sky News understands.",
        "url": "https://news.sky.com/story/government-to-decide-on-postcode-pricing-plan-for-electricity-bills-by-summer-13354653",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ed-miliband-energy_6895380.jpg?20250424120800",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-04-24 07:31:00",
        "Headline": "So-called \"zonal pricing\" could see the south of England pay more for electricity bills than parts of Scotland. It comes as energy secretary Ed Miliband doubles down on the case for more clean power, while a Trump official invokes the Bible to support US energy policy.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n The government will decide by the summer on controversial proposals to charge some households more for their electricity than others, Sky News understands. The energy secretary Ed Miliband has been mulling over plans for \"zonal pricing\", which would see different regions of the country pay different rates, based on supply and demand levels in the local area. The idea is to attract industry to build in low-cost areas, and incentivise new electricity generation in regions where people need it most. Supporters say zonal pricing could lower everyone's bills to some extent by making the system more efficient - but some would fall more than others. Critics, including renewable energy generators, warn the plans would create a postcode lottery for bills and put investors off certain areas, risking jobs. It is not yet clear how the changes would be passed on to household bills. But it could see people in the south of England pay much more than those in parts of Scotland - though not, the government hopes, more than they do now. Ed Miliband told Sky News: \"My bottom line here is any reform we make has got to cut bills, and it's got to cut bills across the country. \n                  China's rocket launch is building on space programme with staggering ambition\n                 \n                  Europe and Starmer double down on clean power as America ups the ante\n                 \n                  UK vision for clean energy to collide with Trump's fossil fuel frenzy\n                 \"We're not going to have a postcode lottery... If there are bills savings to be made, we want them to be spread across the country so that all consumers benefit.\" He is expected to make his recommendation to fellow ministers in the coming weeks, before the government decides either way by the middle of this year. They are keen to resolve the issue - which was also considered under the last Tory government - before businesses start bidding for fresh renewable power contracts in summer. UK still 'vulnerable and exposed' It comes as the UK government hosts a summit on energy security in London today, lobbying other countries to leave fossil fuels behind. Read more: UK clean energy vision collides with Trump's fossil fuel frenzy Mr Miliband said the government's push to generate more clean power at home was as much about energy security as it was about fighting climate change. \"As long as energy can be weaponised against us, our countries and our citizens are vulnerable and exposed,\" he said in a speech. But he also said North Sea oil and gas would \"continue to play an important role\" in the UK energy mix, fuelling campaigners' fears it may yet allow the Rosebank oil and gas field to go ahead, despite hurdles in court and the government's own concerns.  Trump's representative invokes God US President Donald Trump's junior representative at the summit, acting assistant secretary Tommy Joyce, quoted the Bible in his address. He urged delegates to \"remember God's golden rule, and that is that we should love our neighbour as ourselves\". That means helping them out of poverty through access to affordable energy, according to Mr Joyce. About 750 million people in the world still have no access to electricity, and team Trump says American oil, gas and coal are the answer. However, a report by RMI suggests that new wind and solar are the cheapest option for new electricity in 82% of the world - though for some countries are hard to finance upfront, and they still need oil and gas for other sectors. Mr Joyce also continued Trump's ongoing attacks on climate policies, criticising what he described as \"so-called renewables\" and the \"net zero agenda\". 'Most delicate debate' Before the summit, a senior UN official said the idea that the switch to clean power compromised energy security and affordability \"is just not true\". \"We really need to dispel this notion,\" said the source, speaking on the condition of anonymity. \"If you are dependent on volatile and expensive fossil fuel imports, fossil fuels equal energy insecurity.\" A senior official from Brazil, which in November is hosting the COP30 UN climate summit, also this week said there had been a \"rather successful\" attempt by some to frame energy security and the switch to clean energy as a question of \"either/or\". \"We don't believe it is.\" He called it \"one of the most delicate debates\" of the moment."
    },
    {
        "title": "Man with life-threatening peanut allergy now eats them every day thanks to study",
        "description": "A man with a life-threatening peanut allergy is able to eat several per day thanks to a \"ground-breaking\" study.",
        "url": "https://news.sky.com/story/man-with-life-threatening-peanut-allergy-now-eats-them-every-day-thanks-to-study-13354756",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-peanuts-allergy-trial_6895316.jpg?20250424104156",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-24 10:27:00",
        "Headline": "New research shows exposure to small amounts of peanut can help keep severe allergies under control.",
        "Content": " A man with a life-threatening peanut allergy is able to eat several per day thanks to a \"ground-breaking\" study. Richard Lassiter, 44, says he has been admitted to hospital twice due to his severe nut allergy, but now eats four peanuts every morning as part of a trial which has seen him gradually increase his exposure to them. One of his reactions came during a holiday in Chile with his wife in 2018, when he had a reaction so bad he had to stay in a high dependency unit overnight and have adrenaline and oxygen. He is one of 21 people between the ages of 18 and 40 who took part in the research conducted by King's College London and Guy's and St Thomas' NHS Foundation Trust. The study was the first entirely on adults with severe allergies to test whether daily doses of peanuts taken under strict supervision can be safely tolerated. Other \"desensitisation\" studies are focused on children, the experts say, meaning adults don't get the opportunity to counter their allergies. The study, called The Grown Up Peanut Immunotherapy trial, saw participants with allergies slowly increase their daily dosage from 0.8mg peanut flour mixed in with food. \n                  Hospital patient had to wait more than 10 days for a bed - as 'unacceptable' crisis laid bare\n                 \n                  Lercanidipine: Patients urged to check blood pressure medication after labelling error\n                 \n                  Disposable vape ban 'may not curb e-cigarette use'\n                 Once they could tolerate 50-100mg of peanut protein, they were switched to eating whole peanuts, peanut butter or other peanut products. By the end of the study, which was funded by the National Institute for Health and Care Research, two thirds were able to eat the equivalent of five peanuts without reacting. Speaking to Sky's Wilfred Frost, Mr Lassiter said: \"There was definitely a sense of nerves at first. You know, you have to get your mind around the idea of eating something you've tried to avoid your whole life. \"But I think at the point that I found out about the trial, it was something I was really keen to do. I obviously had a couple of [dangerous] incidents reasonably fresh in my mind.\" He said the trial had changed his life, adding that he took the nuts like \"medicine\". \"The idea that I take four peanuts a day now after my breakfast is well-worn routine,\" he said. \"I know it's something I'll do for the rest of the rest of my life. \"I'm certainly much more confident and calm when I go out to dinner with my wife, or when we go travelling. I know that that accidental exposure to peanuts isn't going to cause a serious reaction like it has done in the past.\" Read more:New Ofcom codes to protect children online branded 'overly cautious'Pepper spray to be used in young offender institutions as violence rises He added that he knew it still wasn't safe to order a meal with a strong presence of nuts. Chief investigator Stephen Till, professor of allergy at King's College London and consultant allergist at Guy's and St Thomas', told Sky News the trial provided hope for those with nut allergies, but was definitely \"not something to do at home\". He said the next step would be to conduct larger trials and identify \"the group of adult patients who would most likely benefit from oral immunotherapy, and see whether it can lead to long-term tolerance in this age group\". Asked if such trials could potentially benefit people with other types of allergies, Prof Till said: \"Potentially, yes. The principle should be applicable to other food options, but what I would say is that different foods can behave differently in terms of the amounts that are required to cause reactions and how severe the reactions are. So to do it in other foods, you really do need to do trials for those specific foods individually.\" Public health minister Ashley Dalton said: \"This ground-breaking research offers hope to thousands living with peanut allergies. For too long, people have navigated daily life in fear of accidental exposure that could be life-threatening. \"I'm proud the UK is leading this vital work through NIHR funding. These results show how we're transforming lives through science, potentially changing care standards for adults with peanut allergies worldwide.\""
    },
    {
        "title": "'Breathing' magma cap discovered less than 4km under Yellowstone National Park",
        "description": "A \"breathing\" cap of magma is stopping one of the largest active volcanic systems in the world from exploding in the US, scientists have discovered.",
        "url": "https://news.sky.com/story/breathing-magma-cap-discovered-less-than-4km-under-yellowstone-national-park-13354687",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-yellowstone-geyser_6895251.jpg?20250424100411",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-24 08:56:00",
        "Headline": "It is thought the cap may be helping to stop the volcanic system from erupting by constantly releasing gases - and pressure - from underneath its surface.",
        "Content": "A \"breathing\" cap of magma is stopping one of the largest active volcanic systems in the world from exploding in the US, scientists have discovered. Yellowstone National Park is known to sit on top of a huge pool of active magma, which causes bubbling mud pots and steaming geysers. Now, geologists have discovered a cap of magma rich with volatiles, or dissolved gases that can cause eruptions, just 3.8km below Yellowstone's surface. It is thought this cap may be helping to stop the volcanic system from erupting by constantly releasing gases - and pressure - from underneath its surface. \"It looks like the system is efficiently venting gas through cracks and channels between mineral crystals,\" said researcher Brandon Schmandt from Rice University in Texas. He likened the system to \"steady breathing\" with bubbles rising and releasing through the rock. Researchers from Rice University, the University of New Mexico, the University of Utah and the University of Texas at Dallas published their findings in the Nature science journal. \n                  New Zealand volcano owners' conviction over deadly eruption overturned\n                 \n                  Volcano on Iceland's Reykjanes Peninsula erupts for seventh time in a year\n                 \n                  Emergency declared after volcano erupts in Iceland creating major fissure and fast moving lava flows\n                 In order to make their discovery, the team used a 53,000lb vibroseis truck, usually used for oil and gas exploration, to create tiny earthquakes and send seismic waves underground. Read more from Sky News:Ofcom sets out new rules to protect children onlineCould the local elections reshape British politics?Thousands evacuated in New Jersey Because Yellowstone is so busy and big, they had to do the experiment at night and use more than 600 seismometers to collect their data. The seismic waves reflected off layers underneath the Earth's surface and were then recorded at the surface.They revealed the cap to be at around 3.8km depth. Previously, scientists thought the top of Yellowstone's magma system could be anywhere between three to eight kilometres deep. This uncertainty meant it was hard to tell how the magma system today compares with conditions before eruptions in the past."
    },
    {
        "title": "Ofcom sets out new codes of practice to protect children online",
        "description": "Social media firms could be hit with heavy fines - or even banned from the UK - under new measures to protect children from online harm.",
        "url": "https://news.sky.com/story/ofcom-sets-out-new-codes-of-practice-to-protect-children-online-13354642",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-child-laptop-computer_6546955.jpg?20240508035046",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-04-24 06:44:00",
        "Headline": "Technology Secretary Peter Kyle calls it a \"watershed moment\" that will help tackle \"lawless, poisonous environments\" and hold social media firms to account.",
        "Content": " Social media firms could be hit with heavy fines - or even banned from the UK - under new measures to protect children from online harm. Watchdog Ofcom has published the final version of its children's codes, part of the Online Safety Act, to set out what sites must do to protect young people. It says they are a \"reset for children online\" and will mean \"safer social media feeds\". However, some campaigners believe they don't go far enough. Ofcom says the codes set out an obligation to protect children from content that is misogynistic, violent, hateful or abusive - as well as safeguarding against online bullying, self harm and dangerous challenges. Firms must do a risk assessment, and from 25 July the regulator says it will be able to impose fines - and in very serious cases \"apply for a court order to prevent the site or app from being available in the UK\". More than 27,000 children and 13,000 parents took part in research to develop the codes. Laying out more than 40 measures and covering social media, search and gaming, they include: \n                  Suicide forum first to be investigated by Ofcom under new online safety laws\n                 \n                  Religious TV channel Word Network fined £150,000 over claim miracle water product can cure cancer, says Ofcom\n                 \n                  'Loophole' in law on messaging apps leaves children vulnerable to sexual abuse, says NSPCC\n                 - Safer feeds - Algorithms must filter out harmful content - Effective age checks - Ofcom says the \"riskiest services must use highly effective age assurance\" - Fast action - All sites must have processes to review, assess and quickly tackle harmful content - Easier reporting - There must be a straightforward way for children to report or complain about content - More choice and support - Kids must be able to easily block or mute accounts, and disable comments on their posts Ofcom boss Dame Melanie Dawes said it would mean \"safer social media feeds with less harmful and dangerous content, protections from being contacted by strangers and effective age checks on adult content\". Technology Secretary Peter Kyle called it a \"watershed moment\" that would help tackle \"lawless, poisonous environments\" and hold social media firms to account. However, Ian Russell, whose 14-year-old daughter Molly took her own life after seeing harmful content, said the codes were weak and left too much control with social media firms. \"I am dismayed by the lack of ambition in today's codes. Instead of moving fast to fix things, the painful reality is that Ofcom's measures will fail to prevent more young deaths like my daughter Molly's,\" he said. \"Ofcom's risk-averse approach is a bitter pill for bereaved parents to swallow. Their overly cautious codes put the bottom line of reckless tech companies ahead of tackling preventable harm.\" Mr Russell, who now chairs the Molly Rose Foundation, urged the prime minister to personally intervene. Read more:Bill to stop children 'doom scrolling' to get backingPorn sites must have 'robust' age verification by July Hollie Dance, the mother of Archie Battersbee - who died accidentally in a \"prank or experiment\", also criticised the codes. She said they were a \"small step forward\" but ultimately did not go far enough. \"Why are we tip-toeing around these huge platforms over children's safety? The platforms routinely allege they do not allow harmful content,\" she told Sky News. \"This doesn't only gaslight Ofcom but gaslights bereaved parents too, those of us who have lost children to this harmful content. We can't take a softly-softly approach to the platforms. Children's mental health and safety should be paramount.\" A spokesperson for Meta said it had recently moved young people on Instagram to a new teens account that limits who can contact them and the content they can see. \"Teens in the UK have automatically been moved into these enhanced protections and under 16s need a parent's permission to change them,\" said the spokesperson. Meta said it also supported calls for app stores or operating systems to verify a child's age and obtain parental approval before under-16s can download any app. The Online Safety Act was passed in October 2023 and much of it is concerned with protecting children. However, its protections are only just taking effect through Ofcom's various codes of practice. Earlier this month, the watchdog said it had begun investigating a suicide forum - the first probe into an individual service provider to be launched under the act. :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Oasis fans lost more than £2m to ticket scams, major bank warns",
        "description": "Oasis fans collectively lost more than &#163;2m to ticket scams for the band's long-awaited reunion tour, a major bank has warned.",
        "url": "https://news.sky.com/story/oasis-fans-lost-more-than-1632m-to-ticket-scams-major-bank-warns-13354673",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-oasis-gallagher-noel_6668518.jpg?20240904172418",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-04-24 08:40:00",
        "Headline": "The group's long-awaited reunion shows are set to begin in a few months, with fans already facing issues of dynamic pricing.",
        "Content": "Oasis fans collectively lost more than £2m to ticket scams for the band's long-awaited reunion tour, a major bank has warned. The UK group announced the tour last year, with it set to begin in just over two months time. However, amid the rush for tickets, Lloyds Banking Group said a number of customers fell victim to ticket scams, losing £436 on average. The bank made the calculations based on fraud reports from its own customers. Would-be concertgoers trying to get their hands on the tickets already faced issues around dynamic pricing. And Oasis fans accounted for more than half of all reported ticket scams so far this year, Lloyds added. The biggest amount lost was said to be £1,700, with people aged between 35 and 44 most likely to be scammed. \n                  Oasis fans may have been misled, watchdog says as it calls for Ticketmaster changes\n                 \n                  Oasis fans say Ticketmaster cancelled orders over 'bot' claims\n                 \n                  Happy Mondays stars Shaun Ryder and Bez give thoughts on Oasis and dynamic pricing: 'We used to tout our own tickets'\n                 Edinburgh, Warrington and Manchester had the highest numbers of scam victims, with the top 10 locations overall making up a quarter of cases, the banking group said. Liz Ziegler, fraud prevention director at Lloyds, said: \"The Oasis tour is the latest target for ticket scammers, with millions of pounds of fans' money stolen before the gigs even kick off. \"If you're asked to pay via bank transfer, particularly by a seller you've found on social media, that should immediately set alarm bells ringing.\" Read more from Sky News:Eyewitness: Viewing the Pope's casketManhunt after convicted murderer flees prisonIsraeli troops shot at aid workers from 'point-blank range' Lisa Webb, a consumer law expert at Which? said: \"Scammers are always looking for new ways to part people from their hard-earned cash and unfortunately, Oasis tickets being in such high demand has created a perfect storm for criminals.\" Here are the top 10 areas where the reported scam victims lived, according to Lloyds Banking Group:"
    }
]