[
    {
        "title": "Starmer condemns 'appalling hate speech' at Glastonbury - as organiser says anti-IDF chants 'crossed a line'",
        "description": "The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\".",
        "url": "https://news.sky.com/story/glastonbury-organiser-emily-eavis-says-anti-idf-chants-crossed-a-line-and-no-place-at-festival-for-hate-speech-13390070",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 09:52:00",
        "Headline": "The prime minister has joined Glastonbury organiser Emily Eavis in responding to duo Bob Vylan's set on the West Holts stage, which police are investigating.",
        "Content": " The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\". Responding on Sunday to rap duo Bob Vylan's set the day before, Sir Keir Starmer said: \"There is no excuse for this kind of appalling hate speech.\" In the same statement, the prime minister repeated his previous argument that the Belfast rap group Kneecap should have been removed from the line-up after one member was charged with a terrorism offence. \"I said that Kneecap should not be given a platform and that goes for any other performers making threats or inciting violence. \"The BBC needs to explain how these scenes came to be broadcast.\" On Sunday, Ms Eavis, whose father Michael co-founded the festival, posted her response to Bob Vylan's performance. \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence,\" she wrote. She said that while \"as a festival, we stand against all forms of war and terrorism - we will always believe in - and actively campaign for - hope, unity, peace and love\", adding a performer's comments \"should never be seen as a tacit endorsement of their opinions and beliefs\". Eavis added: \"With almost 4,000 performances at Glastonbury 2025, there will inevitably be artists and speakers appearing on our stages whose views we do not share.\" Read morePulp revealed as mystery Glastonbury bandFestival performers criticise political interferenceLewis Capaldi plays not-so-secret set The rappers' set was streamed live on the BBC on Saturday, showing one of them shouting the slogan into the mic, with some of the crowd joining in. They also performed in front of a screen that claimed Israel's actions in Gaza amount to \"genocide\". Posting on Instagram on Sunday, drummer Bobby Vylan doubled down by repeating elements of the chant alongside a picture of himself. The Israeli embassy posted on X in the hours after the set saying it was \"deeply disturbed by the inflammatory and hateful rhetoric\". It said the slogan used \"advocates for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" In a separate post on X on Sunday, Israel's foreign ministry published graphic footage following the attack by Hamas on the Nova festival in Israel on 7 October 2023. The message directly appealed to those at Glastonbury who joined in the chants. \"On October 7th, Hamas terrorists murdered hundreds of innocent partygoers at the Nova festival. For those at the Glastonbury festival who need a reality check, let this footage serve as a reminder to what you are supporting.\" Meanwhile the Campaign Against Antisemitism (CAA) said it will be formally complaining to the BBC over its \"outrageous decision\" to broadcast the performance. Avon and Somerset Police said they are looking at whether a criminal offence was committed. \"Video evidence will be assessed by officers to determine whether any offences may have been committed that would require a criminal investigation,\" the force said in a post on social media. Culture and entertainment reporter Bob Vylan, a punk-rap duo known for their politically charged lyrics taking on racism, fascism, police brutality, toxic masculinity, inequality and more, performed on the festival’s third biggest stage, West Holts, with a capacity of about 30,000. They played to their own fans but no doubt thousands who had turned out to secure their place for the controversial Irish-language rappers Kneecap who followed. After the Bob Vylan performance was aired live, clips quickly flooded social media - shared by those supporting the band and condemning them. \"The BBC didn't cover Kneecap's set at Glastonbury Festival over Free Palestine chants, so Bob Vylan, who BBC covered, stepped in,\" posted the Celebrities4Palestine account alongside a clip on Instagram, also shared by Bob Vylan. The IDF comments on stage may well have been made regardless. Or did Kneecap's \"cancelling\" by the BBC, as some people saw it, encourage other acts to speak out even more? Police are investigating both performances. Kneecap's Naoise O Caireallain, who performs under the name Moglai Bap, at one point mentioned \"a riot outside the courts\" over his bandmate Liam Og O hAnnaidh's (Mo Chara) upcoming second appearance on a terror charge, before clarifying: \"No riots, just love and support, and support for Palestine.\" With its history of activism, Glastonbury has always championed free speech. But it seems Bob Vylan's set may have pushed things too far. It's fair to say that here at Glastonbury, for most of the 200,000 people on site this weekend, it is still all about the music. The majority did not see these sets and many are not even aware of the criticism outside Worthy Farm. Today is the final day of artist performances, with acts including Olivia Rodrigo, Rod Stewart and the Prodigy on the bill. But instead of the magic of the most famous festival in the world, both organisers and the broadcaster are now facing more questions about Bob Vylan and, to a lesser extent, Kneecap, as criticism mounts. Bob Vylan went on stage just ahead of a performance by Kneecap, the Irish rap band that the prime minister and others called to be removed from the Glastonbury and other festival line-ups over alleged on-stage endorsements of terrorist groups Hamas and Hezbollah. Ultimately, the BBC decided not to broadcast Kneecap's set live, but have since made it available to watch on catch-up on iPlayer. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of Hezbollah at a gig. His bandmate Naoise O Caireallain told Glastonbury crowds on Saturday they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for their set and told fans he was a \"free man\". Questions over why BBC broadcast chants The government's culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what steps were taken around the Bob Vylan set. Speaking to Sunday Morning With Trevor Phillips on behalf of the government, Health Secretary Wes Streeting described the chant as \"appalling\" and a \"shameless publicity stunt\". \"The fact that we saw that chant at a music festival - when there were Israelis at a similar music festival who were kidnapped, murdered, raped, and in some cases still held captive,\" he said in reference to the 7 October 2023 Hamas attack at the Nova music festival. He added that while \"there's no justification for inciting violence against Israelis… the way in which Israel's conducting this war has made it extremely difficult for Israel's allies around the world to stand by and justify\". \"I'd also say to the Israeli embassy, get your own house in order, in terms of the conduct of your own citizens and the settlers in the West Bank,\" he told Phillips. Meanwhile, Conservative leader Kemi Badenoch reposted a clip of the Bob Vylan set describing it as \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Lucy McMullin, who was in the crowd for Bob Vylan, told Sky News: \"When there's children and civilians being murdered and starved, then I think it's important that people are speaking out on these issues. \"However, inciting more death and violence is not the way to do it.\" A BBC spokesperson confirmed the Bob Vylan stream will not be made available to watch on its iPlayer. \"Some of the comments made during Bob Vylan's set were deeply offensive,\" their statement said. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. We have no plans to make the performance available on demand.\""
    },
    {
        "title": "Who are Bob Vylan - the duo who 'very much crossed the line' at Glastonbury with anti-IDF chant?",
        "description": "Musicians, especially punk acts, making headlines for their politics is nothing new.",
        "url": "https://news.sky.com/story/who-are-bob-vylan-the-rap-band-who-very-much-crossed-the-line-at-glastonbury-with-anti-idf-chant-13390138",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6953174.jpg?20250629143818",
        "type": "Home",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-29 13:25:00",
        "Headline": "Formed in Ipswich in 2017, the band rap about racism, homophobia, toxic masculinity, and far-right politics.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Musicians, especially punk acts, making headlines for their politics is nothing new. The Sex Pistols, The Clash, Rage Against The Machine - in 2025, it's Kneecap and now Bob Vylan riling politicians. But in the case of chants made by Bob Vylan on stage at Glastonbury, it is not just MPs. Festival organiser Emily Eavis has also condemned the comments despite the festival's advocacy for free speech, saying they \"very much crossed a line\". Police are investigating footage of the performance, which has since been removed by the BBC, to see if any offences were committed.  So who are Bob Vylan? The duo are Bobby Vylan, the frontman, and drummer Bobbie Vylan. They have not revealed their real names to protect their privacy. They formed in Ipswich in 2017 and their musical style is a mix of punk, rap, and hard rock. They have released three albums - We Live Here (2020), Bob Vylan Presents The Price Of Life (2022), and last year's Humble As The Sun - and their music has won them awards including best alternative act at the MOBOs in 2022, and best album at the Kerrang Awards in the same year. Their songs confront issues including racism, homophobia, toxic masculinity, and far-right politics, and the track Pretty Songs is often introduced by Bobby saying that \"violence is the only language that some people understand\". Gigs often include some crowd-surfing from the frontman, and they have collaborated with artists including Amyl And The Sniffers singer Amy Taylor, Soft Play guitarist Laurie Vincent, and rock band Kid Kapichi. In an interview with The Guardian last year, Bobby Vylan told how he attended his first pro-Palestine protest at the age of 15, escorted by a friend's mother. The duo have been outspoken on the war in Gaza and called out other acts seen as left-wing who haven't been showing the same amount of public solidarity. The Glastonbury set Before their appearance at the festival, the duo highlighted it to fans watching at home, posting on Facebook: \"Turns out we're finally at a point where the BBC trust us on live tv! Watch us live either in the field or in the comfort of your own home!\" On stage, they performed in front of a screen bearing several statements, including one which claimed Israel's actions in Gaza amount to \"genocide\". Afterwards, as controversy over the set grew, they appeared to double down with statements shared on social media. Their comments have drawn criticism from the Israeli embassy and MPs - and now Glastonbury and Emily Eavis, too. Read moreFestival performers criticise political interference Bob Vylan performed on stage ahead of Kneecap, kept on the bill despite calls for them to be axed. Michael Eavis, the festival's founder, said before the event that people who did not like the politics could \"go somewhere else\". However, Bob Vylan's comments pushed things too far, a statement posted by the festival and Emily Eavis said on Sunday morning. \"As a festival, we stand against all forms of war and terrorism,\" the statement said. \"We will always believe in - and actively campaign for - hope, unity, peace and love.\" With almost 4,000 performances over the weekend, there will be artists and speakers appearing \"whose views we do not share\", they continued, \"and a performer's presence here should never be seen as a tacit endorsement of their opinions and beliefs\". But they described the statements by Bob Vylan as \"appalling\". \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.\""
    },
    {
        "title": "Two killed after suspect shot at firefighters in Idaho, authorities say",
        "description": "Two people have been killed after a suspect shot at firefighters responding to a fire in the US state of Idaho, authorities have said.",
        "url": "https://news.sky.com/story/two-killed-after-suspect-shot-at-firefighters-in-idaho-authorities-say-13390345",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-canfield-mountain-idaho_6953447.jpg?20250630025210",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 23:51:00",
        "Headline": "Police were still \"taking sniper fire\" near the city of Coeur d'Alene on Sunday afternoon, the Kootenai County Sheriff's Office said.",
        "Content": "Two people have been killed after a suspect shot at firefighters responding to a fire in the US state of Idaho, authorities have said. Police were still \"taking sniper fire\" near the city of Coeur d'Alene on Sunday afternoon, the Kootenai County Sheriff's Office said. Crews were responding to a fire at Canfield Mountain around 1.30pm and gunshots were reported around half an hour later, the force said. Sheriff Bob Norris said officials believe the two killed were firefighters, and he did not know if anyone else was shot. \"We don't know how many suspects are up there, and we don't know how many casualties there are,\" he said. \"We are actively taking fire sniper as we speak.\" Mr Norris said the sniper appeared to be hiding in the rugged terrain and using a high-powered rifle, adding he had instructed his deputies to fire back. \"I'm hoping that somebody has a clear shot and is able to neutralise, because they're not at this point in time showing any evidence of wanting to surrender,\" the sheriff said. Governor Brad Little said \"multiple\" firefighters were attacked. \"This is a heinous direct assault on our brave firefighters,\" he said on X. \"I ask all Idahoans to pray for them and their families as we wait to learn more.\" The president of the International Association of Firefighters said a third firefighter was in surgery. In a statement on social media Edward Kelly said the firefighters \"were ambushed in a heinous act of violence\". He added: \"Two of our brothers were killed by a sniper, and a third brother remains in surgery.\" The sheriff's office in neighbouring Shoshone County said authorities were \"dealing with an active shooter situation where the shooter is still at large\". The fire was still raging, Mr Norris said. \"It's going to keep burning,\" he added. \"Can't put any resources on it right now.\" The FBI was sending technical teams and tactical support to the scene, its deputy director Dan Bongino said. \"It remains an active, and very dangerous scene,\" he said on X. Canfield Mountain is a popular hiking and biking spot on the outskirts of Coeur d'Alene, a city of around 55,000 people in northern Idaho. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "British-Israeli soldier killed while fighting in Gaza, reports say",
        "description": "A British-Israeli soldier has been killed while fighting in Gaza, Israeli media reports said.",
        "url": "https://news.sky.com/story/british-israeli-soldier-killed-while-fighting-in-gaza-reports-say-13390342",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-yisrael-natan-rosenfeld_6953438.jpg?20250629234721",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 22:31:00",
        "Headline": "The IDF soldier, who served in the 601st Combat Engineering Battalion, was killed by an explosive device on Sunday, local media reported. He was named locally as Sergeant Yisrael Natan Rosenfeld, 20, from the city of Ra'anana.",
        "Content": "A British-Israeli soldier has been killed while fighting in Gaza, Israeli media reports said. He was named locally as Sergeant Yisrael Natan Rosenfeld, 20, from the city of Ra'anana. The Foreign, Commonwealth and Development Office said it is \"looking into reports that an IDF soldier who died in combat in Gaza is a British national\". The IDF soldier, who served in the 601st Combat Engineering Battalion, was killed by an explosive device on Sunday, the Times of Israel reported. The paper said Mr Rosenfeld moved to Israel from London with his family 11 years ago. More than 860 Israeli soldiers have been killed since Israel's war against Hamas began on 7 October 2023, more than 400 of them during the fighting in Gaza. The war began when the militant group launched an attack on Israel, killing 1,200 people and taking around 250 hostage. \n                  Middle East live: Iran military chief has 'complete doubts' about Israel ceasefire; 23 killed in strikes on Gaza\n                 \n                  At least 72 killed in Israeli strikes across Gaza, health staff say\n                 \n                  UN data on Gaza deaths 'disinformation', claims head of controversial aid group\n                 Israel's offensive in Gaza has devastated the enclave and killed more than 56,000 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says more than half of the dead are women and children. Read more from Sky News:Glastonbury organiser says anti-IDF chants 'crossed a line'Trump says 'very wealthy group' has agreed to buy TikTok It came as Donald Trump called for progress in ceasefire talks in the war between Israel and Hamas. \"MAKE THE DEAL IN GAZA. GET THE HOSTAGES BACK!!!\" the US president wrote on social media on Sunday. On Friday Mr Trump raised expectations by claiming there could be an agreement within the next week."
    },
    {
        "title": "From Brazil to Westminster: How health pilot is proving a force for good for patients and the NHS",
        "description": "Jessica Ellis is a Chewie. She's not from a galaxy far, far away but here, right now, working in one of our most deprived communities. To the people she helps, she is a force for good.",
        "url": "https://news.sky.com/story/from-brazil-to-westminster-how-health-pilot-is-proving-a-force-for-good-for-patients-and-the-nhs-13390325",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jessica-ellis-jaber-dikir_6953431.png?20250629230336",
        "type": "Home",
        "Author": "Ashish Joshi",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "A community health programme which started in Brazil over 30 years ago is being trialled in England - and could result in big savings for the NHS.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  Jessica Ellis is a Chewie. She's not from a galaxy far, far away but here, right now, working in one of our most deprived communities. To the people she helps, she is a force for good. We are standing in front of a large block of council flats in Westminster, central London. The entrycom buzzes. \"Hi Mrs Dikir, how are you?\" Jessica asks. And then \"thank you\" as we're let in and make our way up five flights of stairs. Inside the flat, in the living room, Mr Jaber Dikir sits on a soft, plush armchair. It has to be comfortable because Mr Dikir spends most of his days sitting here. \"I have a heart problem, I have open heart surgery and now I have heart failure,\" Mr Dikir explains. \"I have water in my chest and that gives me big trouble to sleep, to breathe,\" he adds as he begins to wheeze. I ask Mr Jaber how Jessica has been able to help him. \"She hears you, she listens to you,\" he replies. \"She understands everything. She even called the doctor and he gave me permission to stay at home (for my blood tests). That's really appreciated. I couldn't walk properly, I couldn't go to the clinic.\" \n                  Supermarkets being told to cut shoppers' calories in obesity crackdown is not 'nanny statism', says Streeting\n                 \n                  Sunburn isn't just red skin - here's what's happening underneath the burn\n                 \n                  Weight loss and diabetes jabs linked to potentially fatal side effect\n                 Jessica is a community health and wellbeing worker (CHWWs). That's where the nickname comes from. CHWWs work in small teams, going door to door in some of the most deprived areas of the country. It's part of an NHS pilot inspired by a successful programme in Brazil. A simple but effective intervention Jessica says her role is \"to make life easier\". Mr Dakir, she tells me, is struggling with his mobility. So is organising a designated disabled bay. \"Mr Dakir is struggling to get out to his appointments, and the GP needs a blood test from him. So I was able to speak to the GP and he's been labelled as temporarily housebound so the district nursing team can come in now and take the bloods for him at home.\" A simple but effective intervention that has a huge impact on Mr Dakir and the NHS. The project is currently being used in 15 neighbourhoods around the country. In Westminster, there has been a 7% drop in A&E admissions and an 11% reduction in hospital admissions year on year. There has also been a 47% increase in the likelihood of households having vaccinations, an 82% increase in cancer screenings and a 7.3% drop in unscheduled GP consultations. Taking community care right to the patient's door Dr Melinda Creme is a local GP. Jessica acts as a conduit between Dr Creme and her patients. \"We need to look at the costs of what might happen downstream if disease is not picked up earlier, if health inequalities are not addressed sooner, and so there should be potential huge savings down the line. \"It might take five years, 10 years to make a difference and that's the issue, because obviously governments change within that time. \"But if there's a long-term lens on this, then we stand a chance of being able to afford a health service free at the point of delivery.\" This is exactly what the government wants, what the NHS wants, to bring care into the community. With this project, they are taking community care right to the patient's door. Dr Creme says the days when people would go to their GP and expect their family doctor to look after anybody and everybody about everything are gone. \"We can't possibly do that. We're not equipped to do that because the population is expanding and we cannot address all needs.\" Labour's 10-year health plan set for launch The government is expected to focus on personalised and community care in its 10-year health plan when it is published on Thursday. It will look to ease pressure on buckling emergency departments and models like this have shown early signs of good results, but they require time and investment. Projects like this can help ease the strain on services facing record pressures and tight budgets. They could be a significant part of a wider NHS plan."
    },
    {
        "title": "Paul Ince: Former Manchester United and Liverpool footballer charged with drink driving",
        "description": "Former Manchester United, Liverpool and England footballer Paul Ince has been charged with drink driving.",
        "url": "https://news.sky.com/story/paul-ince-former-manchester-united-and-liverpool-footballer-charged-with-drink-driving-13390298",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-paul-ince-ince_6953417.jpg?20250629221051",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 20:03:00",
        "Headline": "Ince had an illustrious career, including six years at Manchester United and becoming the first black player to captain England.",
        "Content": "Former Manchester United, Liverpool and England footballer Paul Ince has been charged with drink driving. Cheshire Police said officers were called around 5pm on Saturday to Chester High Road in Neston. \"The incident involved a black Range Rover which had collided with the central reservation barrier,\" said a statement. \"Officers attended the scene and arrested a 57-year-old man. \"Paul Ince, of Quarry Road, Neston, has since been charged with drink driving.\" Ince has been bailed to appear at Chester Magistrates' Court on 18 July. As well as more than 200 games for Manchester United in the early to mid 1990s, he also played for West Ham, Wolves and Inter Milan. Read more from Sky News:Girl dies and another seriously ill after tree collapseMurder investigation after pregnant woman found dead Ince became the first black footballer to captain England when he took the armband in a game against the USA in 1993 - just a year after his senior debut. He led the national side seven times in total. The London-born player moved into management with Macclesfield Town in 2006 and was most recently in charge of Championship side Reading from 2022 to 2023."
    },
    {
        "title": "European heatwave leaves Spain, Portugal, Italy and Greece in sweltering 40C heat",
        "description": "Major heatwaves across southern Europe have left Spain, Portugal, Italy, and Greece in sweltering conditions of more than 40C (104F).",
        "url": "https://news.sky.com/story/european-heatwave-leaves-spain-portugal-italy-and-greece-in-sweltering-40c-heat-13390105",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spain-weather_6953144.jpg?20250629135855",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 12:11:00",
        "Headline": "A ridge of high pressure above central and western Europe is driving the scorching conditions, says Sky News meteorologist Chris England.",
        "Content": "Major heatwaves across southern Europe have left Spain, Portugal, Italy, and Greece in sweltering conditions of more than 40C (104F). Two-thirds of Portugal was on high alert for extreme heat and risk of wildfires on Sunday, with temperatures in Lisbon expected to exceed 42C (107F). In parts of southern Spain, temperatures are well above average, with 42C also expected in Seville and other cities. The country's meteorological service says June is likely to be the hottest Spain has experienced since records began. In several Italian regions, including Lazio, Tuscany, Calabria, Puglia, and Umbria, outdoor work was banned during peak hours of sun on Sunday, with trade unions pushing for the measures to be extended and rolled out nationwide. Twenty-one out of 27 cities were under the highest possible heat alert, including Rome, Milan, and Naples. Read moreWhat's actually happening underneath your sunburn Greece has already been plagued by wildfires this summer, with one breaking out south of Athens on Thursday, and several on the island of Chios last Sunday. Near Athens, authorities deployed 130 firefighters, 12 helicopters, and 12 planes, with 40 people evacuated from the highest-risk areas. A woman was arrested on suspicion of unintentional arson after wildfires spread across brush and pastureland for three days on Chios. Scientists link increasing frequencies of extreme weather events such as heatwaves, wildfires, and storms to climate change. In France and Germany, at least three people died amid stormy conditions. A ridge of high pressure above central and western Europe is driving the scorching conditions, says Sky News meteorologist Chris England. Hotter-than-normal sea temperatures, dry land, and surface winds are also partly to blame, he added. UK heatwave also likely  The UK is halfway through a four-day amber heat health alert, with temperatures expected to peak in the mid-30s (86F) on Tuesday. Heat health alerts are not public weather warnings - but are instead designed to prepare health and social care bodies for the potential impact on their infrastructure and vulnerable groups. Heatwave thresholds are likely to be met on Monday and Tuesday, which vary between 28C (82F) in the south of England and 25C (77F) across the rest of the country."
    },
    {
        "title": "Concessions to welfare reforms to be revealed after Labour backbench rebellion forces government retreat",
        "description": "Changes to welfare reforms, forced on the government by rebel Labour MPs, are being revealed today ahead of a crucial vote.",
        "url": "https://news.sky.com/story/concessions-to-welfare-reforms-to-be-revealed-after-labour-backbench-rebellion-forces-government-retreat-13390292",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wheelchair-park_6953416.jpg?20250629220724",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "Work and Pensions Secretary Liz Kendall has said the amended legislation now aims to deliver a \"fairer, more compassionate system\", but her Conservative counterpart will not say if the Tories plan to back the bill.",
        "Content": "Changes to welfare reforms, forced on the government by rebel Labour MPs, are being revealed today ahead of a crucial vote. The original bill restricted eligibility for the personal independence payment (pip) and cut the health-related element of universal credit (UC). The government, which insisted welfare costs were becoming unsustainable, was forced into a U-turn after 126 Labour backbenchers signed an amendment that would have halted the bill at its first Commons hurdle. Explainer: What are the welfare concessions? While the amendment is expected to be withdrawn, after changes that appeased some Labour MPs, others are still unhappy and considering backing a similar amendment to be tabled today.  Here are the main changes to the UC and pip bill: • current pip claimants will keep their benefits; stricter eligibility requirements will only apply to new claims from November 2026• a review of the pip assessment, which will have input from disabled people• existing recipients of the health-related element of UC will have their incomes protected in real terms \n                  PM and ministers now admit welfare reforms went too far\n                 \n                  'Sometimes there is strength in listening': Liz Kendall defends welfare U-turn\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 Work and Pensions Secretary Liz Kendall said in a statement that the legislation now aims to deliver a \"fairer, more compassionate system\" ahead of the second reading and vote on Tuesday. \"We must build a welfare system that provides security for those who cannot work and the right support for those who can. Too often, disabled people feel trapped, worried that if they try to work, they could lose the support they depend on. \"That is why we are taking action to remove those barriers, support disabled people to live with dignity and independence, and open routes into employment for those who want to pursue it. \"This is about delivering a fairer, more compassionate system as part of our Plan for Change which supports people to thrive, whatever their circumstances.\" On Saturday, Sir Keir Starmer said fixing the UK's welfare system was a \"moral imperative\". The government claimed cuts to sickness and disability benefits would shave £5bn off the welfare bill and get more people into work. The Resolution Foundation believes the concessions could cost as much as £3bn, while the Institute for Fiscal Studies warned that the changes make tax rises more likely. Read more:Starmer's most damaging U-turn yetLiz Kendall defends welfare retreat 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Health Secretary Wes Streeting told Sky News that welfare bill changes have put Labour in a much better position ahead of tomorrow's vote. On Sunday Morning with Trevor Phillips, Mr Streeting said: \"There were things that we didn't get right, we've put right, and there'll be a debate about future amendments and things, I'm sure, as it goes through in the usual way.\" On the same programme, shadow work and pensions secretary Helen Whately repeatedly refused to say whether the Conservatives would back the bill, but would review the proposals after the minister's statement later. \"We have said that if there are more savings that actually bring the welfare bill down, if they'll get more people into work, and if they commit to using the savings to avoid tax cuts in the autumn, which looks highly unlikely at the moment, then they have our support.\" The Liberal Democrats plan to vote against the bill and have called for the government to speed up access-to-work decisions to help people enter the workforce."
    },
    {
        "title": "Donald Trump says 'very wealthy group' has agreed to buy TikTok in the US",
        "description": "Donald Trump has said the US government has found a buyer for TikTok that he will reveal \"in about two weeks\".",
        "url": "https://news.sky.com/story/donald-trump-says-very-wealthy-group-has-agreed-to-buy-tiktok-in-the-us-13390243",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-tiktok-donald-trump_6803725.jpg?20250119030007",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-29 16:38:00",
        "Headline": "The president says he will reveal the buyer soon; however, any deal is believed to need sign-off from the Chinese government.",
        "Content": "Donald Trump has said the US government has found a buyer for TikTok that he will reveal \"in about two weeks\". The president told Fox News \"it's a group of very wealthy people\", adding: \"I think I'll probably need China approval, I think President Xi will probably do it.\" TikTok was ordered last year to find a new owner for its US operation - or face a ban - after politicians said they feared sensitive data about Americans could be passed to the Chinese government. The video app's owner, Bytedance, has repeatedly denied such claims. It originally had a deadline of 19 January to find a buyer - and many users were shocked when it \"went dark\" for a number of hours when that date came round, before later being restored. However, President Trump has now extended the deadline several times. The last extension was on 19 June, when he signed an executive order pushing it back to 17 September. \n                  Khaby Lame: World's biggest TikTok star leaves US after being detained by ICE\n                 \n                  Jess and Norma: Grandmother who had millions of fans on TikTok dies aged 91\n                 \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 Mr Trump's latest comments suggest multiple people coming together to take control of the app in the US. Among those rumoured to be potential buyers include YouTube superstar Mr Beast, US search engine startup Perplexity AI, and Kevin O'Leary - an investor from Shark Tank (the US version of Dragons' Den). Bytedance said in April that it was still talking to the US government, but there were \"differences on many key issues\".It's believed the Chinese government will have to approve any agreement. President Trump's interview with Fox News also touched on the upcoming end of the pause in US tariffs on imported goods. On April 9, he granted a 90-day reprieve for countries threatened with a tariff of more than 10% to give them time to negotiate. Deals have already been struck with some countries, including the UK. Read more from Sky News:Iran could begin enriching uranium again in months - UNMajor porn sites to introduce 'robust' age verification in UK The president said he didn't think he would need to push back the 9 July deadline and that letters would be sent out imminently stating what tariff each country would face. \"We'll look at the deficit we have - or whatever it is with the country; we'll look at how the country treats us - are they good, are they not so good. Some countries, we don't care - we'll just send a high number out,\" he said. \"But we're going to be sending letters out starting pretty soon. We don't have to meet, we have all the numbers.\" The president announced the tariffs in April, arguing they were correcting an unfair trade relationship and would return lost prosperity to US industries such as car-making."
    },
    {
        "title": "Prince William: Tackling homelessness 'complex and unpredictable'",
        "description": "Prince William has acknowledged the \"complex and unpredictable\" challenge that still lies ahead for those helping him tackle homelessness, two years since he launched his ambitious Homewards project.",
        "url": "https://news.sky.com/story/prince-william-tackling-homelessness-complex-and-unpredictable-13390265",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-prince-of-wales-prince-william_6495078.jpg?20250629193626",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "Since the Homewards programme was launched in 2023, more than 100 initiatives have been launched across six locations around the UK. But the Prince of Wales admits the project faces a \"mammoth challenge\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William has acknowledged the \"complex and unpredictable\" challenge that still lies ahead for those helping him tackle homelessness, two years since he launched his ambitious Homewards project. In a letter to the local coalition groups that were formed in six locations across the UK, the Prince of Wales thanked them for joining his mission to \"demonstrate that it is possible to make homelessness rare, brief and unrepeated\". Signing off with the message \"Keep going!\" William explains how he believes the initiative has already started to \"shift the dial\" on the \"mammoth challenge\". \"There are now people who are no longer experiencing homelessness thanks to your tremendous efforts,\" he wrote. Since the five-year programme was launched in 2023, more than 100 initiatives have started across six locations around the UK, and some 300 homes - a mixture of empty accommodation, private rentals and new builds - are forecast to be delivered through Homewards' Innovative Housing Projects.  In February, William unveiled a new partnership with high street bank Lloyds Banking Group, which has made £50m available to organisations tackling homelessness. Nearly £3m has also been secured for Homewards locations from partners and coalition members. In his letter marking this anniversary, he wrote: \"After a year of convening, our second year has seen Homewards shift into delivery mode.\" \n                  Gillian Anderson warns UK homelessness 'will only get worse'\n                 \n                  People who have experienced homelessness become walking tour guides - as rough sleeping crisis gets worse\n                 \n                  £1bn funding boost for councils to tackle homelessness\n                 But acknowledging the difficult task ahead, he added: \"Creating long-term change is complex and unpredictable, but I am confident we can lead and inspire understanding, empathy and optimism that homelessness can be ended.\" The six locations where the programme is working are Newport in South Wales, Lambeth in south London, Northern Ireland, Aberdeen, Sheffield and the three neighbouring Dorset towns of Poole, Bournemouth and Christchurch. Each 'local coalition group' has been working to identify solutions to specific groups at risk of homelessness in their area, such as single people and under-25s in Aberdeen, lone parents in temporary accommodation in Lambeth and families and women facing multiple disadvantages in Newport. Liz Laurence, Homewards' programme director, said: \"We're proud to say, as we head into our third year, that Homewards is the broadest collective effort working to prevent homelessness across the UK.\" She added: \"We set out with a mission to demonstrate that together it's possible to end homelessness, and I think we are really confident about where we are. We are starting really to see a difference on the ground.\" The campaign is a major long-term focus for William, who - as a child - visited shelters with his late mother Diana, Princess of Wales, and was left with a deep and lasting impression that has inspired his work.  Read more:Analysis: Who's listening to William?Attenborough's ocean warning to WilliamPrince marks 43rd birthday Polly Neate, former chief executive of Shelter and now an independent social policy commentator, said: \"In our wider culture, as a country, we see homelessness as something that is inevitable, that we don't really understand, that we feel powerless about doing anything about. \"What Prince William and Homewards are doing, if you want to put it in a nutshell, is tackling that culture straight on and saying 'This is not inevitable. This is preventable'.\""
    },
    {
        "title": "From Brazil to Westminster: How health pilot is proving a force for good for patients and the NHS",
        "description": "Jessica Ellis is a Chewie. She's not from a galaxy far, far away but here, right now, working in one of our most deprived communities. To the people she helps, she is a force for good.",
        "url": "https://news.sky.com/story/from-brazil-to-westminster-how-health-pilot-is-proving-a-force-for-good-for-patients-and-the-nhs-13390325",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jessica-ellis-jaber-dikir_6953431.png?20250629230336",
        "type": "UK",
        "Author": "Ashish Joshi",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "A community health programme which started in Brazil over 30 years ago is being trialled in England - and could result in big savings for the NHS.",
        "Content": "\n          Health correspondent\n              @ashishskynews\n  Jessica Ellis is a Chewie. She's not from a galaxy far, far away but here, right now, working in one of our most deprived communities. To the people she helps, she is a force for good. We are standing in front of a large block of council flats in Westminster, central London. The entrycom buzzes. \"Hi Mrs Dikir, how are you?\" Jessica asks. And then \"thank you\" as we're let in and make our way up five flights of stairs. Inside the flat, in the living room, Mr Jaber Dikir sits on a soft, plush armchair. It has to be comfortable because Mr Dikir spends most of his days sitting here. \"I have a heart problem, I have open heart surgery and now I have heart failure,\" Mr Dikir explains. \"I have water in my chest and that gives me big trouble to sleep, to breathe,\" he adds as he begins to wheeze. I ask Mr Jaber how Jessica has been able to help him. \"She hears you, she listens to you,\" he replies. \"She understands everything. She even called the doctor and he gave me permission to stay at home (for my blood tests). That's really appreciated. I couldn't walk properly, I couldn't go to the clinic.\" \n                  Supermarkets being told to cut shoppers' calories in obesity crackdown is not 'nanny statism', says Streeting\n                 \n                  Sunburn isn't just red skin - here's what's happening underneath the burn\n                 \n                  Weight loss and diabetes jabs linked to potentially fatal side effect\n                 Jessica is a community health and wellbeing worker (CHWWs). That's where the nickname comes from. CHWWs work in small teams, going door to door in some of the most deprived areas of the country. It's part of an NHS pilot inspired by a successful programme in Brazil. A simple but effective intervention Jessica says her role is \"to make life easier\". Mr Dakir, she tells me, is struggling with his mobility. So is organising a designated disabled bay. \"Mr Dakir is struggling to get out to his appointments, and the GP needs a blood test from him. So I was able to speak to the GP and he's been labelled as temporarily housebound so the district nursing team can come in now and take the bloods for him at home.\" A simple but effective intervention that has a huge impact on Mr Dakir and the NHS. The project is currently being used in 15 neighbourhoods around the country. In Westminster, there has been a 7% drop in A&E admissions and an 11% reduction in hospital admissions year on year. There has also been a 47% increase in the likelihood of households having vaccinations, an 82% increase in cancer screenings and a 7.3% drop in unscheduled GP consultations. Taking community care right to the patient's door Dr Melinda Creme is a local GP. Jessica acts as a conduit between Dr Creme and her patients. \"We need to look at the costs of what might happen downstream if disease is not picked up earlier, if health inequalities are not addressed sooner, and so there should be potential huge savings down the line. \"It might take five years, 10 years to make a difference and that's the issue, because obviously governments change within that time. \"But if there's a long-term lens on this, then we stand a chance of being able to afford a health service free at the point of delivery.\" This is exactly what the government wants, what the NHS wants, to bring care into the community. With this project, they are taking community care right to the patient's door. Dr Creme says the days when people would go to their GP and expect their family doctor to look after anybody and everybody about everything are gone. \"We can't possibly do that. We're not equipped to do that because the population is expanding and we cannot address all needs.\" Labour's 10-year health plan set for launch The government is expected to focus on personalised and community care in its 10-year health plan when it is published on Thursday. It will look to ease pressure on buckling emergency departments and models like this have shown early signs of good results, but they require time and investment. Projects like this can help ease the strain on services facing record pressures and tight budgets. They could be a significant part of a wider NHS plan."
    },
    {
        "title": "British-Israeli soldier killed while fighting in Gaza, reports say",
        "description": "A British-Israeli soldier has been killed while fighting in Gaza, Israeli media reports said.",
        "url": "https://news.sky.com/story/british-israeli-soldier-killed-while-fighting-in-gaza-reports-say-13390342",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-yisrael-natan-rosenfeld_6953438.jpg?20250629234721",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-29 22:31:00",
        "Headline": "The IDF soldier, who served in the 601st Combat Engineering Battalion, was killed by an explosive device on Sunday, local media reported. He was named locally as Sergeant Yisrael Natan Rosenfeld, 20, from the city of Ra'anana.",
        "Content": "A British-Israeli soldier has been killed while fighting in Gaza, Israeli media reports said. He was named locally as Sergeant Yisrael Natan Rosenfeld, 20, from the city of Ra'anana. The Foreign, Commonwealth and Development Office said it is \"looking into reports that an IDF soldier who died in combat in Gaza is a British national\". The IDF soldier, who served in the 601st Combat Engineering Battalion, was killed by an explosive device on Sunday, the Times of Israel reported. The paper said Mr Rosenfeld moved to Israel from London with his family 11 years ago. More than 860 Israeli soldiers have been killed since Israel's war against Hamas began on 7 October 2023, more than 400 of them during the fighting in Gaza. The war began when the militant group launched an attack on Israel, killing 1,200 people and taking around 250 hostage. \n                  Middle East live: Iran military chief has 'complete doubts' about Israel ceasefire; 23 killed in strikes on Gaza\n                 \n                  At least 72 killed in Israeli strikes across Gaza, health staff say\n                 \n                  UN data on Gaza deaths 'disinformation', claims head of controversial aid group\n                 Israel's offensive in Gaza has devastated the enclave and killed more than 56,000 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says more than half of the dead are women and children. Read more from Sky News:Glastonbury organiser says anti-IDF chants 'crossed a line'Trump says 'very wealthy group' has agreed to buy TikTok It came as Donald Trump called for progress in ceasefire talks in the war between Israel and Hamas. \"MAKE THE DEAL IN GAZA. GET THE HOSTAGES BACK!!!\" the US president wrote on social media on Sunday. On Friday Mr Trump raised expectations by claiming there could be an agreement within the next week."
    },
    {
        "title": "Concessions to welfare reforms to be revealed after Labour backbench rebellion forces government retreat",
        "description": "Changes to welfare reforms, forced on the government by rebel Labour MPs, are being revealed today ahead of a crucial vote.",
        "url": "https://news.sky.com/story/concessions-to-welfare-reforms-to-be-revealed-after-labour-backbench-rebellion-forces-government-retreat-13390292",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wheelchair-park_6953416.jpg?20250629220724",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "Work and Pensions Secretary Liz Kendall has said the amended legislation now aims to deliver a \"fairer, more compassionate system\", but her Conservative counterpart will not say if the Tories plan to back the bill.",
        "Content": "Changes to welfare reforms, forced on the government by rebel Labour MPs, are being revealed today ahead of a crucial vote. The original bill restricted eligibility for the personal independence payment (pip) and cut the health-related element of universal credit (UC). The government, which insisted welfare costs were becoming unsustainable, was forced into a U-turn after 126 Labour backbenchers signed an amendment that would have halted the bill at its first Commons hurdle. Explainer: What are the welfare concessions? While the amendment is expected to be withdrawn, after changes that appeased some Labour MPs, others are still unhappy and considering backing a similar amendment to be tabled today.  Here are the main changes to the UC and pip bill: • current pip claimants will keep their benefits; stricter eligibility requirements will only apply to new claims from November 2026• a review of the pip assessment, which will have input from disabled people• existing recipients of the health-related element of UC will have their incomes protected in real terms \n                  PM and ministers now admit welfare reforms went too far\n                 \n                  'Sometimes there is strength in listening': Liz Kendall defends welfare U-turn\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 Work and Pensions Secretary Liz Kendall said in a statement that the legislation now aims to deliver a \"fairer, more compassionate system\" ahead of the second reading and vote on Tuesday. \"We must build a welfare system that provides security for those who cannot work and the right support for those who can. Too often, disabled people feel trapped, worried that if they try to work, they could lose the support they depend on. \"That is why we are taking action to remove those barriers, support disabled people to live with dignity and independence, and open routes into employment for those who want to pursue it. \"This is about delivering a fairer, more compassionate system as part of our Plan for Change which supports people to thrive, whatever their circumstances.\" On Saturday, Sir Keir Starmer said fixing the UK's welfare system was a \"moral imperative\". The government claimed cuts to sickness and disability benefits would shave £5bn off the welfare bill and get more people into work. The Resolution Foundation believes the concessions could cost as much as £3bn, while the Institute for Fiscal Studies warned that the changes make tax rises more likely. Read more:Starmer's most damaging U-turn yetLiz Kendall defends welfare retreat 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Health Secretary Wes Streeting told Sky News that welfare bill changes have put Labour in a much better position ahead of tomorrow's vote. On Sunday Morning with Trevor Phillips, Mr Streeting said: \"There were things that we didn't get right, we've put right, and there'll be a debate about future amendments and things, I'm sure, as it goes through in the usual way.\" On the same programme, shadow work and pensions secretary Helen Whately repeatedly refused to say whether the Conservatives would back the bill, but would review the proposals after the minister's statement later. \"We have said that if there are more savings that actually bring the welfare bill down, if they'll get more people into work, and if they commit to using the savings to avoid tax cuts in the autumn, which looks highly unlikely at the moment, then they have our support.\" The Liberal Democrats plan to vote against the bill and have called for the government to speed up access-to-work decisions to help people enter the workforce."
    },
    {
        "title": "Paul Ince: Former Manchester United and Liverpool footballer charged with drink driving",
        "description": "Former Manchester United, Liverpool and England footballer Paul Ince has been charged with drink driving.",
        "url": "https://news.sky.com/story/paul-ince-former-manchester-united-and-liverpool-footballer-charged-with-drink-driving-13390298",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-paul-ince-ince_6953417.jpg?20250629221051",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-29 20:03:00",
        "Headline": "Ince had an illustrious career, including six years at Manchester United and becoming the first black player to captain England.",
        "Content": "Former Manchester United, Liverpool and England footballer Paul Ince has been charged with drink driving. Cheshire Police said officers were called around 5pm on Saturday to Chester High Road in Neston. \"The incident involved a black Range Rover which had collided with the central reservation barrier,\" said a statement. \"Officers attended the scene and arrested a 57-year-old man. \"Paul Ince, of Quarry Road, Neston, has since been charged with drink driving.\" Ince has been bailed to appear at Chester Magistrates' Court on 18 July. As well as more than 200 games for Manchester United in the early to mid 1990s, he also played for West Ham, Wolves and Inter Milan. Read more from Sky News:Girl dies and another seriously ill after tree collapseMurder investigation after pregnant woman found dead Ince became the first black footballer to captain England when he took the armband in a game against the USA in 1993 - just a year after his senior debut. He led the national side seven times in total. The London-born player moved into management with Macclesfield Town in 2006 and was most recently in charge of Championship side Reading from 2022 to 2023."
    },
    {
        "title": "Prince William: Tackling homelessness 'complex and unpredictable'",
        "description": "Prince William has acknowledged the \"complex and unpredictable\" challenge that still lies ahead for those helping him tackle homelessness, two years since he launched his ambitious Homewards project.",
        "url": "https://news.sky.com/story/prince-william-tackling-homelessness-complex-and-unpredictable-13390265",
        "image_url": "https://e3.365dm.com/24/03/1920x1080/skynews-prince-of-wales-prince-william_6495078.jpg?20250629193626",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "Since the Homewards programme was launched in 2023, more than 100 initiatives have been launched across six locations around the UK. But the Prince of Wales admits the project faces a \"mammoth challenge\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William has acknowledged the \"complex and unpredictable\" challenge that still lies ahead for those helping him tackle homelessness, two years since he launched his ambitious Homewards project. In a letter to the local coalition groups that were formed in six locations across the UK, the Prince of Wales thanked them for joining his mission to \"demonstrate that it is possible to make homelessness rare, brief and unrepeated\". Signing off with the message \"Keep going!\" William explains how he believes the initiative has already started to \"shift the dial\" on the \"mammoth challenge\". \"There are now people who are no longer experiencing homelessness thanks to your tremendous efforts,\" he wrote. Since the five-year programme was launched in 2023, more than 100 initiatives have started across six locations around the UK, and some 300 homes - a mixture of empty accommodation, private rentals and new builds - are forecast to be delivered through Homewards' Innovative Housing Projects.  In February, William unveiled a new partnership with high street bank Lloyds Banking Group, which has made £50m available to organisations tackling homelessness. Nearly £3m has also been secured for Homewards locations from partners and coalition members. In his letter marking this anniversary, he wrote: \"After a year of convening, our second year has seen Homewards shift into delivery mode.\" \n                  Gillian Anderson warns UK homelessness 'will only get worse'\n                 \n                  People who have experienced homelessness become walking tour guides - as rough sleeping crisis gets worse\n                 \n                  £1bn funding boost for councils to tackle homelessness\n                 But acknowledging the difficult task ahead, he added: \"Creating long-term change is complex and unpredictable, but I am confident we can lead and inspire understanding, empathy and optimism that homelessness can be ended.\" The six locations where the programme is working are Newport in South Wales, Lambeth in south London, Northern Ireland, Aberdeen, Sheffield and the three neighbouring Dorset towns of Poole, Bournemouth and Christchurch. Each 'local coalition group' has been working to identify solutions to specific groups at risk of homelessness in their area, such as single people and under-25s in Aberdeen, lone parents in temporary accommodation in Lambeth and families and women facing multiple disadvantages in Newport. Liz Laurence, Homewards' programme director, said: \"We're proud to say, as we head into our third year, that Homewards is the broadest collective effort working to prevent homelessness across the UK.\" She added: \"We set out with a mission to demonstrate that together it's possible to end homelessness, and I think we are really confident about where we are. We are starting really to see a difference on the ground.\" The campaign is a major long-term focus for William, who - as a child - visited shelters with his late mother Diana, Princess of Wales, and was left with a deep and lasting impression that has inspired his work.  Read more:Analysis: Who's listening to William?Attenborough's ocean warning to WilliamPrince marks 43rd birthday Polly Neate, former chief executive of Shelter and now an independent social policy commentator, said: \"In our wider culture, as a country, we see homelessness as something that is inevitable, that we don't really understand, that we feel powerless about doing anything about. \"What Prince William and Homewards are doing, if you want to put it in a nutshell, is tackling that culture straight on and saying 'This is not inevitable. This is preventable'.\""
    },
    {
        "title": "Starmer condemns 'appalling hate speech' at Glastonbury - as organiser says anti-IDF chants 'crossed a line'",
        "description": "The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\".",
        "url": "https://news.sky.com/story/glastonbury-organiser-emily-eavis-says-anti-idf-chants-crossed-a-line-and-no-place-at-festival-for-hate-speech-13390070",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-29 09:52:00",
        "Headline": "The prime minister has joined Glastonbury organiser Emily Eavis in responding to duo Bob Vylan's set on the West Holts stage, which police are investigating.",
        "Content": " The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\". Responding on Sunday to rap duo Bob Vylan's set the day before, Sir Keir Starmer said: \"There is no excuse for this kind of appalling hate speech.\" In the same statement, the prime minister repeated his previous argument that the Belfast rap group Kneecap should have been removed from the line-up after one member was charged with a terrorism offence. \"I said that Kneecap should not be given a platform and that goes for any other performers making threats or inciting violence. \"The BBC needs to explain how these scenes came to be broadcast.\" On Sunday, Ms Eavis, whose father Michael co-founded the festival, posted her response to Bob Vylan's performance. \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence,\" she wrote. She said that while \"as a festival, we stand against all forms of war and terrorism - we will always believe in - and actively campaign for - hope, unity, peace and love\", adding a performer's comments \"should never be seen as a tacit endorsement of their opinions and beliefs\". Eavis added: \"With almost 4,000 performances at Glastonbury 2025, there will inevitably be artists and speakers appearing on our stages whose views we do not share.\" Read morePulp revealed as mystery Glastonbury bandFestival performers criticise political interferenceLewis Capaldi plays not-so-secret set The rappers' set was streamed live on the BBC on Saturday, showing one of them shouting the slogan into the mic, with some of the crowd joining in. They also performed in front of a screen that claimed Israel's actions in Gaza amount to \"genocide\". Posting on Instagram on Sunday, drummer Bobby Vylan doubled down by repeating elements of the chant alongside a picture of himself. The Israeli embassy posted on X in the hours after the set saying it was \"deeply disturbed by the inflammatory and hateful rhetoric\". It said the slogan used \"advocates for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" In a separate post on X on Sunday, Israel's foreign ministry published graphic footage following the attack by Hamas on the Nova festival in Israel on 7 October 2023. The message directly appealed to those at Glastonbury who joined in the chants. \"On October 7th, Hamas terrorists murdered hundreds of innocent partygoers at the Nova festival. For those at the Glastonbury festival who need a reality check, let this footage serve as a reminder to what you are supporting.\" Meanwhile the Campaign Against Antisemitism (CAA) said it will be formally complaining to the BBC over its \"outrageous decision\" to broadcast the performance. Avon and Somerset Police said they are looking at whether a criminal offence was committed. \"Video evidence will be assessed by officers to determine whether any offences may have been committed that would require a criminal investigation,\" the force said in a post on social media. Culture and entertainment reporter Bob Vylan, a punk-rap duo known for their politically charged lyrics taking on racism, fascism, police brutality, toxic masculinity, inequality and more, performed on the festival’s third biggest stage, West Holts, with a capacity of about 30,000. They played to their own fans but no doubt thousands who had turned out to secure their place for the controversial Irish-language rappers Kneecap who followed. After the Bob Vylan performance was aired live, clips quickly flooded social media - shared by those supporting the band and condemning them. \"The BBC didn't cover Kneecap's set at Glastonbury Festival over Free Palestine chants, so Bob Vylan, who BBC covered, stepped in,\" posted the Celebrities4Palestine account alongside a clip on Instagram, also shared by Bob Vylan. The IDF comments on stage may well have been made regardless. Or did Kneecap's \"cancelling\" by the BBC, as some people saw it, encourage other acts to speak out even more? Police are investigating both performances. Kneecap's Naoise O Caireallain, who performs under the name Moglai Bap, at one point mentioned \"a riot outside the courts\" over his bandmate Liam Og O hAnnaidh's (Mo Chara) upcoming second appearance on a terror charge, before clarifying: \"No riots, just love and support, and support for Palestine.\" With its history of activism, Glastonbury has always championed free speech. But it seems Bob Vylan's set may have pushed things too far. It's fair to say that here at Glastonbury, for most of the 200,000 people on site this weekend, it is still all about the music. The majority did not see these sets and many are not even aware of the criticism outside Worthy Farm. Today is the final day of artist performances, with acts including Olivia Rodrigo, Rod Stewart and the Prodigy on the bill. But instead of the magic of the most famous festival in the world, both organisers and the broadcaster are now facing more questions about Bob Vylan and, to a lesser extent, Kneecap, as criticism mounts. Bob Vylan went on stage just ahead of a performance by Kneecap, the Irish rap band that the prime minister and others called to be removed from the Glastonbury and other festival line-ups over alleged on-stage endorsements of terrorist groups Hamas and Hezbollah. Ultimately, the BBC decided not to broadcast Kneecap's set live, but have since made it available to watch on catch-up on iPlayer. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of Hezbollah at a gig. His bandmate Naoise O Caireallain told Glastonbury crowds on Saturday they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for their set and told fans he was a \"free man\". Questions over why BBC broadcast chants The government's culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what steps were taken around the Bob Vylan set. Speaking to Sunday Morning With Trevor Phillips on behalf of the government, Health Secretary Wes Streeting described the chant as \"appalling\" and a \"shameless publicity stunt\". \"The fact that we saw that chant at a music festival - when there were Israelis at a similar music festival who were kidnapped, murdered, raped, and in some cases still held captive,\" he said in reference to the 7 October 2023 Hamas attack at the Nova music festival. He added that while \"there's no justification for inciting violence against Israelis… the way in which Israel's conducting this war has made it extremely difficult for Israel's allies around the world to stand by and justify\". \"I'd also say to the Israeli embassy, get your own house in order, in terms of the conduct of your own citizens and the settlers in the West Bank,\" he told Phillips. Meanwhile, Conservative leader Kemi Badenoch reposted a clip of the Bob Vylan set describing it as \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Lucy McMullin, who was in the crowd for Bob Vylan, told Sky News: \"When there's children and civilians being murdered and starved, then I think it's important that people are speaking out on these issues. \"However, inciting more death and violence is not the way to do it.\" A BBC spokesperson confirmed the Bob Vylan stream will not be made available to watch on its iPlayer. \"Some of the comments made during Bob Vylan's set were deeply offensive,\" their statement said. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. We have no plans to make the performance available on demand.\""
    },
    {
        "title": "Who are Bob Vylan - the duo who 'very much crossed the line' at Glastonbury with anti-IDF chant?",
        "description": "Musicians, especially punk acts, making headlines for their politics is nothing new.",
        "url": "https://news.sky.com/story/who-are-bob-vylan-the-rap-band-who-very-much-crossed-the-line-at-glastonbury-with-anti-idf-chant-13390138",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6953174.jpg?20250629143818",
        "type": "UK",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-29 13:25:00",
        "Headline": "Formed in Ipswich in 2017, the band rap about racism, homophobia, toxic masculinity, and far-right politics.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Musicians, especially punk acts, making headlines for their politics is nothing new. The Sex Pistols, The Clash, Rage Against The Machine - in 2025, it's Kneecap and now Bob Vylan riling politicians. But in the case of chants made by Bob Vylan on stage at Glastonbury, it is not just MPs. Festival organiser Emily Eavis has also condemned the comments despite the festival's advocacy for free speech, saying they \"very much crossed a line\". Police are investigating footage of the performance, which has since been removed by the BBC, to see if any offences were committed.  So who are Bob Vylan? The duo are Bobby Vylan, the frontman, and drummer Bobbie Vylan. They have not revealed their real names to protect their privacy. They formed in Ipswich in 2017 and their musical style is a mix of punk, rap, and hard rock. They have released three albums - We Live Here (2020), Bob Vylan Presents The Price Of Life (2022), and last year's Humble As The Sun - and their music has won them awards including best alternative act at the MOBOs in 2022, and best album at the Kerrang Awards in the same year. Their songs confront issues including racism, homophobia, toxic masculinity, and far-right politics, and the track Pretty Songs is often introduced by Bobby saying that \"violence is the only language that some people understand\". Gigs often include some crowd-surfing from the frontman, and they have collaborated with artists including Amyl And The Sniffers singer Amy Taylor, Soft Play guitarist Laurie Vincent, and rock band Kid Kapichi. In an interview with The Guardian last year, Bobby Vylan told how he attended his first pro-Palestine protest at the age of 15, escorted by a friend's mother. The duo have been outspoken on the war in Gaza and called out other acts seen as left-wing who haven't been showing the same amount of public solidarity. The Glastonbury set Before their appearance at the festival, the duo highlighted it to fans watching at home, posting on Facebook: \"Turns out we're finally at a point where the BBC trust us on live tv! Watch us live either in the field or in the comfort of your own home!\" On stage, they performed in front of a screen bearing several statements, including one which claimed Israel's actions in Gaza amount to \"genocide\". Afterwards, as controversy over the set grew, they appeared to double down with statements shared on social media. Their comments have drawn criticism from the Israeli embassy and MPs - and now Glastonbury and Emily Eavis, too. Read moreFestival performers criticise political interference Bob Vylan performed on stage ahead of Kneecap, kept on the bill despite calls for them to be axed. Michael Eavis, the festival's founder, said before the event that people who did not like the politics could \"go somewhere else\". However, Bob Vylan's comments pushed things too far, a statement posted by the festival and Emily Eavis said on Sunday morning. \"As a festival, we stand against all forms of war and terrorism,\" the statement said. \"We will always believe in - and actively campaign for - hope, unity, peace and love.\" With almost 4,000 performances over the weekend, there will be artists and speakers appearing \"whose views we do not share\", they continued, \"and a performer's presence here should never be seen as a tacit endorsement of their opinions and beliefs\". But they described the statements by Bob Vylan as \"appalling\". \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.\""
    },
    {
        "title": "Vigil marks three years since murder of Zara Aleena - as her family 'protest the systems that failed her'",
        "description": "Under the burning sun and in silence, a group of people all in white made their way through the streets of Ilford in east London, stopping traffic as they went.",
        "url": "https://news.sky.com/story/vigil-marks-three-years-since-murder-of-zara-aleena-as-mourners-protest-the-systems-that-failed-her-13390274",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-zara-aleena-vigil_6953342.jpg?20250629181108",
        "type": "UK",
        "Author": "Emma Birchley",
        "Date Published": "2025-06-29 18:38:00",
        "Headline": "The government has pledged to halve violence against women and girls in a decade and this summer it will publish its strategy to achieve that, where so many others have failed.",
        "Content": "\n          News correspondent\n        Under the burning sun and in silence, a group of people all in white made their way through the streets of Ilford in east London, stopping traffic as they went. Together, they were completing the walk home that 35-year-old Zara Aleena never had the chance to finish. Three years ago, she was sexually assaulted and murdered in the early hours after leaving a bar. But for her aunt Farah Naz, the gathering was as much a protest as a vigil. \"It's a heavy weight we carry as a family. Three years on, it feels like yesterday and sometimes it feels like 10 years ago. \"We come together to silently protest… to protest against systems that failed Zara, to protest against a culture that accepts and facilitates violence and excuses it and we come together to stand against violence towards women and girls and to say this must stop. No more.\" Zara's killer, Jordan McSweeney, had already followed two other women that night, just nine days after being let out of prison. \n                  From Brazil to Westminster: How health pilot is proving a force for good for patients and the NHS\n                 \n                  British-Israeli soldier killed while fighting in Gaza, reports say\n                 \n                  Concessions to welfare reforms to be revealed after Labour backbench rebellion forces government retreat\n                 But he should have been back inside after breaching the conditions of his release. But failings meant he was still free. The government has pledged to halve violence against women and girls in a decade and this summer it will publish its strategy to achieve that, where so many others have failed. Read more: Murder investigation under way after pregnant woman found dead But it's a bold promise. \"Firstly, we need a huge cultural shift… the culture that accepts violence and excuses it against women and girls. We need to change that, and we need to end that now,\" said Farah. \"Secondly, we need education, we need early intervention, and we need resources so that we can shift that culture. \"And thirdly, we need policy change and practice change, and we need resources behind those policy and practice change to end violence towards women and girls.\" They'll be back to do it all again next year, with the hope that by then progress is being made to keep women like Zara safe from harm."
    },
    {
        "title": "Sarah Montgomery: Murder investigation under way after pregnant woman found dead in Co Down",
        "description": "A murder investigation has been launched after a pregnant woman was found dead in Co Down, the Police Service of Northern Ireland has said.",
        "url": "https://news.sky.com/story/co-down-murder-investigation-after-pregnant-woman-found-dead-13390114",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sarah-montgomery-victim_6953132.jpg?20250629133157",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-29 12:18:00",
        "Headline": "The 27-year-old mother-of-two was pronounced dead at the scene. A 28-year-old man has been arrested on suspicion of murder and remains in police custody.",
        "Content": "A murder investigation has been launched after a pregnant woman was found dead in Co Down, the Police Service of Northern Ireland has said. Officers received a report of an unconscious woman with a serious injury inside a house in Elmfield Walk, Donaghadee, on Saturday afternoon. Police attended the property along with ambulance staff who provided medical treatment to 27-year-old Sarah Montgomery. But the mother-of-two was pronounced dead at the scene. A 28-year-old man has been arrested on suspicion of murder and remains in police custody. Detective Chief Inspector Tom Phillips said Ms Montgomery was confirmed to have been pregnant at the time of her death. He said: \"Enquiries are at an early stage into this deeply tragic case. \"Our thoughts are also with Sarah's family during this incredibly difficult time - as they struggle to come to terms with what has happened. \"Sarah's family are being supported by specially trained officers as the investigation continues.\" Chief Inspector Yvonne McManus added: \"We understand this news will cause shock and concern within the community. Local people will see our officers in and around the area - with cordons still in place today.\" She added: \"We recognise the profound impact that violence against women and girls has on individuals, families and wider society.\" Anyone who believes they may have information that could help officers is asked to contact police."
    },
    {
        "title": "British-Israeli soldier killed while fighting in Gaza, reports say",
        "description": "A British-Israeli soldier has been killed while fighting in Gaza, Israeli media reports said.",
        "url": "https://news.sky.com/story/british-israeli-soldier-killed-while-fighting-in-gaza-reports-say-13390342",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-yisrael-natan-rosenfeld_6953438.jpg?20250629234721",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-29 22:31:00",
        "Headline": "The IDF soldier, who served in the 601st Combat Engineering Battalion, was killed by an explosive device on Sunday, local media reported. He was named locally as Sergeant Yisrael Natan Rosenfeld, 20, from the city of Ra'anana.",
        "Content": "A British-Israeli soldier has been killed while fighting in Gaza, Israeli media reports said. He was named locally as Sergeant Yisrael Natan Rosenfeld, 20, from the city of Ra'anana. The Foreign, Commonwealth and Development Office said it is \"looking into reports that an IDF soldier who died in combat in Gaza is a British national\". The IDF soldier, who served in the 601st Combat Engineering Battalion, was killed by an explosive device on Sunday, the Times of Israel reported. The paper said Mr Rosenfeld moved to Israel from London with his family 11 years ago. More than 860 Israeli soldiers have been killed since Israel's war against Hamas began on 7 October 2023, more than 400 of them during the fighting in Gaza. The war began when the militant group launched an attack on Israel, killing 1,200 people and taking around 250 hostage. \n                  Middle East live: Iran military chief has 'complete doubts' about Israel ceasefire; 23 killed in strikes on Gaza\n                 \n                  At least 72 killed in Israeli strikes across Gaza, health staff say\n                 \n                  UN data on Gaza deaths 'disinformation', claims head of controversial aid group\n                 Israel's offensive in Gaza has devastated the enclave and killed more than 56,000 people, according to the Hamas-run health ministry, which does not differentiate between civilians and combatants in its count, but says more than half of the dead are women and children. Read more from Sky News:Glastonbury organiser says anti-IDF chants 'crossed a line'Trump says 'very wealthy group' has agreed to buy TikTok It came as Donald Trump called for progress in ceasefire talks in the war between Israel and Hamas. \"MAKE THE DEAL IN GAZA. GET THE HOSTAGES BACK!!!\" the US president wrote on social media on Sunday. On Friday Mr Trump raised expectations by claiming there could be an agreement within the next week."
    },
    {
        "title": "Iran could begin enriching uranium again in months, says UN nuclear watchdog chief",
        "description": "Iran will have the capacity to begin enriching uranium again in \"a matter of months\", the UN's nuclear watchdog boss has said.",
        "url": "https://news.sky.com/story/iran-could-begin-enriching-uranium-again-in-months-says-un-nuclear-watchdog-chief-13390094",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-fordow-site-nuclear_6953096.jpg?20250629125005",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-29 11:24:00",
        "Headline": "Iranian nuclear and military sites were attacked by Israel on 13 June, with the Israelis claiming Tehran was close to developing a nuclear weapon. The US then carried out its own strikes.",
        "Content": " Iran will have the capacity to begin enriching uranium again in \"a matter of months\", the UN's nuclear watchdog boss has said. Rafael Grossi, who heads the International Atomic Energy Agency (IAEA), said that US strikes on three sites a week ago had caused \"severe damage\" but it was not \"total\". Middle East: live updates Mr Grossi told CBS News: \"The capacities they have are there. They can have, you know, in a matter of months, I would say, a few cascades of centrifuges spinning and producing enriched uranium, or less than that. \"But as I said, frankly speaking, one cannot claim that everything has disappeared and there is nothing there.\" Iran still has \"industrial and technological capabilities… so if they so wish, they will be able to start doing this again\", he added. Iranian nuclear and military sites were attacked by Israel on 13 June, with the Israelis claiming Tehran was close to developing a nuclear weapon. The US then carried out its own strikes on 22 June, hitting Iranian nuclear installations at Fordow, Natanz and Isfahan, under Operation Midnight Hammer. Iran has insisted its nuclear research is for civilian energy production purposes. US President Donald Trump said last weekend that the American deployment of 30,000lb \"bunker-busting\" bombs had \"obliterated\" Iran's nuclear programme. But that claim appeared to be contradicted by an initial assessment from the US Defence Intelligence Agency. A source said Iran's enriched uranium stocks had not been eliminated, and the country's nuclear programme, much of which is buried deep underground, may have been put back only a month or two.  Mr Trump has rejected any suggestion that the damage to the sites was not as profound as he has said. And he stated he would consider bombing Iran again if Tehran was enriching uranium to worrying levels. At a news conference on Thursday alongside US defence secretary Pete Hegseth, the chairman of the joint chiefs of staff General Dan Caine, told reporters the GBU-57 bunker buster bombs had been designed in some secrecy with exactly this sort of target in mind.  The head of the CIA has also said a \"body of credible intelligence\" indicates Iran's nuclear programme was \"severely damaged\". Director John Ratcliffe revealed that information from a \"historically reliable and accurate source\" suggests several key sites were destroyed - and will take years to rebuild. Read more from Sky News:Glastonbury organiser says anti-IDF chants 'crossed a line'Murder investigation after pregnant woman found dead Meanwhile, Iran's supreme leader Ayatollah Ali Khamenei said his country \"slapped America in the face\" by launching an attack on 23 June against a major US base in Qatar, adding the nation would never surrender. The 12-day air conflict between Israel and Iran ended with a US-brokered ceasefire. But the Iranian armed forces chief of staff, General Abdolrahim Mousavi, has said his country doubts Israel will maintain the truce. A spokesman for Iran's foreign ministry said the US strikes had caused significant damage to Tehran's nuclear facilities."
    },
    {
        "title": "Pictures reveal inside of sunken Bayesian superyacht after it was resurfaced for full examination",
        "description": "The inside of the superyacht that sank off the coast of Sicily almost a year ago has been seen for the first time after it was resurfaced.",
        "url": "https://news.sky.com/story/pictures-reveal-inside-of-bayesian-sunken-superyacht-after-it-was-resurfaced-for-full-examination-13390043",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bayesian-yacht_6953026.jpg?20250629094122",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-29 08:34:00",
        "Headline": "Images reveal what the inside of the British-flagged vessel looks like now - after it was resurfaced and placed in a manufactured steel cradle in Termini Imerese, Sicily.",
        "Content": "The inside of the superyacht that sank off the coast of Sicily almost a year ago has been seen for the first time after it was resurfaced. British billionaire Mike Lynch, 59, his daughter Hannah, 18, and five others died after the 56-metre (184ft) Bayesian sank off Porticello on 19 August 2024. Images reveal what the inside of the British-flagged vessel looks like now - after it was resurfaced and placed in a manufactured steel cradle in Termini Imerese. In one picture, a lounge area can be seen, complete with sofas and other furniture, while another shows the hatch down to the lower deck. Read moreWho was on the superyacht?Diver dies during work to recover yachtHow will the tragedy be investigated? Now the boat is back on land, a balloon-like instrument will be used to lift its 72m (236ft) mast after it was cut off with a remote-controlled tool to rest on the seabed. While salvage workers continue a \"full sweep\" of the ocean floor nearby, a full examination of the yacht will look at what could have been done to prevent the tragedy. The UK Marine Accident Investigation Branch (MAIB) will then publish a report into its investigation. The family of the Bayesian chef Recaldo Thomas, who was among those who died, says \"lessons need to be learned\". In a statement through the Thomas family lawyers Keystone Law, they said they want the investigation to \"establish the truth of what happened\" and \"bring those responsible to justice\".  Simon Graves, an MAIB investigator, said of the investigation previously: \"When the wreck is brought ashore, we'll be completing a full examination of the wreck and we'll be finding out all of the elements that might have contributed to the safety of the vessel.\" Things like the vessel's \"escape routes\" will be included in the final report, Mr Graves added. \"Once we get access to the vessel we'll be able to tell a fuller picture of activities on board and the sequence of events.\" A UK inquest will look at the deaths of Mr Lynch, Miss Lynch, Morgan Stanley banker Jonathan Bloomer, 70, and his wife Judy, 71, who were all British nationals. US lawyer Chris Morvillo and his wife Neda also died. Fifteen people, including Mr Lynch's wife Angela Bacares, were rescued."
    },
    {
        "title": "European heatwave leaves Spain, Portugal, Italy and Greece in sweltering 40C heat",
        "description": "Major heatwaves across southern Europe have left Spain, Portugal, Italy, and Greece in sweltering conditions of more than 40C (104F).",
        "url": "https://news.sky.com/story/european-heatwave-leaves-spain-portugal-italy-and-greece-in-sweltering-40c-heat-13390105",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spain-weather_6953144.jpg?20250629135855",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-29 12:11:00",
        "Headline": "A ridge of high pressure above central and western Europe is driving the scorching conditions, says Sky News meteorologist Chris England.",
        "Content": "Major heatwaves across southern Europe have left Spain, Portugal, Italy, and Greece in sweltering conditions of more than 40C (104F). Two-thirds of Portugal was on high alert for extreme heat and risk of wildfires on Sunday, with temperatures in Lisbon expected to exceed 42C (107F). In parts of southern Spain, temperatures are well above average, with 42C also expected in Seville and other cities. The country's meteorological service says June is likely to be the hottest Spain has experienced since records began. In several Italian regions, including Lazio, Tuscany, Calabria, Puglia, and Umbria, outdoor work was banned during peak hours of sun on Sunday, with trade unions pushing for the measures to be extended and rolled out nationwide. Twenty-one out of 27 cities were under the highest possible heat alert, including Rome, Milan, and Naples. Read moreWhat's actually happening underneath your sunburn Greece has already been plagued by wildfires this summer, with one breaking out south of Athens on Thursday, and several on the island of Chios last Sunday. Near Athens, authorities deployed 130 firefighters, 12 helicopters, and 12 planes, with 40 people evacuated from the highest-risk areas. A woman was arrested on suspicion of unintentional arson after wildfires spread across brush and pastureland for three days on Chios. Scientists link increasing frequencies of extreme weather events such as heatwaves, wildfires, and storms to climate change. In France and Germany, at least three people died amid stormy conditions. A ridge of high pressure above central and western Europe is driving the scorching conditions, says Sky News meteorologist Chris England. Hotter-than-normal sea temperatures, dry land, and surface winds are also partly to blame, he added. UK heatwave also likely  The UK is halfway through a four-day amber heat health alert, with temperatures expected to peak in the mid-30s (86F) on Tuesday. Heat health alerts are not public weather warnings - but are instead designed to prepare health and social care bodies for the potential impact on their infrastructure and vulnerable groups. Heatwave thresholds are likely to be met on Monday and Tuesday, which vary between 28C (82F) in the south of England and 25C (77F) across the rest of the country."
    },
    {
        "title": "Riot police clash with protesters calling for end to Serbian president's rule",
        "description": "Serbian riot police have clashed with anti-government protesters calling for snap elections and an end to the 12-year rule of President Aleksandar Vucic.",
        "url": "https://news.sky.com/story/riot-police-clash-with-protesters-calling-for-end-to-serbian-presidents-rule-13389950",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-serbia-protest-anti-govt-rally_6952907.jpg?20250629030738",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-29 00:15:00",
        "Headline": "Skirmishes between riot officers and groups of protesters lasted for several hours, with police firing tear gas to disperse crowds in several locations across Belgrade's city centre.",
        "Content": "Serbian riot police have clashed with anti-government protesters calling for snap elections and an end to the 12-year rule of President Aleksandar Vucic. The protest by tens of thousands of demonstrators was held in Belgrade on Saturday after months of persistent demonstrations led by Serbia's university students that have rattled Mr Vucic's grip on power. The crowd chanted \"We want elections!\" as they filled the capital's central Slavija Square and several streets around it. Students gave speeches. One, who didn't give her name, said: \"Elections are a clear way out of the social crisis caused by the deeds of the government, which is undoubtedly against the interests of their own people. \"Today, on June 28 2025, we declare the current authorities illegitimate.\" Tensions were high before and during the gathering. Riot police had been deployed around government buildings, parliament and nearby Pionirski Park, where hundreds of Mr Vucic's loyalists from across the country have been camping for months. \n                  British man charged over plot to smuggle US military technology to China\n                 \n                  Donald Trump forever?\n                 \n                  Serbia: Calls for investigation into claims illegal sonic weapon used against peaceful protesters\n                 As the protest ended in the evening, some demonstrators threw bottles, rocks and flares at the police who were preventing the crowd from approaching Pionirski Park and confronting Mr Vucic's backers. Skirmishes between riot officers and groups of protesters lasted for several hours, with police firing tear gas to disperse crowds in several locations across Belgrade's city centre. Police detained several dozen protesters, while six officers were reported injured in the clashes, Dragan Vasiljevic, the director of police, told a news conference late on Saturday. Responding to the violence, President Vucic said in an Instagram post: \"Serbia always wins in the end.\" Read more from Sky News:Israeli embassy 'deeply disturbed' by Glastonbury chantThousands defy ban to join Pride march in Budapest University students have been a key force behind nationwide demonstrations that started after a renovated rail station canopy collapsed, killing 16 people in November last year. Many blamed the concrete roof crash on government corruption and negligence in state infrastructure projects, leading to recurring protests. President Vucic and his right-wing Serbian Progressive Party have repeatedly refused the demand for an early parliamentary vote and accused protesters of planning to spur violence on orders from abroad, which they have not specified. A former extreme nationalist, Mr Vucic has become increasingly authoritarian since coming to power more than a decade ago. He formally says he wants Serbia to join the European Union, but critics say he has stifled democratic freedoms and strengthened ties with Russia and China. While demonstrations have shrunk in recent weeks, the large showing for Saturday's rally suggested that the resolve persists, despite relentless pressure and after nearly eight months of almost daily protests. Serbian police, who are tightly controlled by Mr Vucic's government, said 36,000 people were present at the start of Saturday's protest. An independent monitoring group that records public gatherings said a total of around 140,000 people were in attendance. Serbia's presidential and parliamentary elections are due in 2027."
    },
    {
        "title": "'No space for Bezos': Hundreds protest against billionaire's wedding on final day of Venice celebrations",
        "description": "Hundreds of people filled the streets and waterways of Venice to protest against the wedding of Jeff Bezos and Lauren Sanchez on the final day of their multimillion-dollar celebrations.",
        "url": "https://news.sky.com/story/no-space-for-bezos-hundreds-protest-against-billionaires-wedding-on-final-day-of-venice-celebrations-13389988",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-venice-bezos-wedding_6952947.jpg?20250629074649",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-29 06:32:00",
        "Headline": "Activists vowed to make the Amazon founder's nuptials a \"nightmare\" for both him, his bride and their guests.",
        "Content": "Hundreds of people filled the streets and waterways of Venice to protest against the wedding of Jeff Bezos and Lauren Sanchez on the final day of their multimillion-dollar celebrations. The Amazon founder, 61, and his bride, 55, got married in a private ceremony on the secluded Venetian island of San Giorgio on Friday. Throughout the weekend, activists came out against the wedding, which they say is adding to chronic problems of overtourism, climate change-induced flooding, and spiralling costs for locals. On Saturday, demonstrators were seen clutching placards that read: \"Kisses yes, Bezos no\", \"No Bezos, no war\", and \"118,000 Italian shops killed by Amazon\". Others gathered on the city's famous Rialto Bridge, where they draped a banner that read: \"No space for Bezos\". Read moreWhy protesters vowed to make wedding 'nightmare' The couple's nuptials, estimated to have cost between £34m and £41m, took over multiple venues throughout the city. The newlyweds stayed in the luxury Aman hotel on the Grand Canal, where rooms cost £3,400 a night, while the 200 guests took over other luxury accommodation, complete with their entourage and security teams. City officials have defended agreeing to host the wedding of the world's fourth richest man, citing its age-old tradition of welcoming popes, emperors, and ordinary visitors.  Bezos donated £850,000 (one million euros) to three environmental research organisations dedicated to preserving Venice, where the ailing infrastructure is under increasing pressure from cruise ships, extreme weather, and increasing numbers of tourists. But Venetian activist Flavio Cogo said: \"We want a free Venice, which is finally dedicated to its citizens. \"Those donations are just misery and only aimed at clearing Bezos's conscience.\"  Fellow protester Martin Vergnano said: \"We are here to continue ruining the plans of these rich people, who accumulate money by exploiting many other people… while the conditions of this city remain precarious.\" Protesters claimed they forced the relocation of the final party on Saturday from an undisclosed original location to the Arsenale, a former medieval shipyard. Bezos and Sanchez were seen blowing kisses to crowds and the press before their final celebrations. The list of VIP guests included the Kardashians, Orlando Bloom and Oprah Winfrey."
    },
    {
        "title": "Two killed after suspect shot at firefighters in Idaho, authorities say",
        "description": "Two people have been killed after a suspect shot at firefighters responding to a fire in the US state of Idaho, authorities have said.",
        "url": "https://news.sky.com/story/two-killed-after-suspect-shot-at-firefighters-in-idaho-authorities-say-13390345",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-canfield-mountain-idaho_6953447.jpg?20250630025210",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-29 23:51:00",
        "Headline": "Police were still \"taking sniper fire\" near the city of Coeur d'Alene on Sunday afternoon, the Kootenai County Sheriff's Office said.",
        "Content": "Two people have been killed after a suspect shot at firefighters responding to a fire in the US state of Idaho, authorities have said. Police were still \"taking sniper fire\" near the city of Coeur d'Alene on Sunday afternoon, the Kootenai County Sheriff's Office said. Crews were responding to a fire at Canfield Mountain around 1.30pm and gunshots were reported around half an hour later, the force said. Sheriff Bob Norris said officials believe the two killed were firefighters, and he did not know if anyone else was shot. \"We don't know how many suspects are up there, and we don't know how many casualties there are,\" he said. \"We are actively taking fire sniper as we speak.\" Mr Norris said the sniper appeared to be hiding in the rugged terrain and using a high-powered rifle, adding he had instructed his deputies to fire back. \"I'm hoping that somebody has a clear shot and is able to neutralise, because they're not at this point in time showing any evidence of wanting to surrender,\" the sheriff said. Governor Brad Little said \"multiple\" firefighters were attacked. \"This is a heinous direct assault on our brave firefighters,\" he said on X. \"I ask all Idahoans to pray for them and their families as we wait to learn more.\" The president of the International Association of Firefighters said a third firefighter was in surgery. In a statement on social media Edward Kelly said the firefighters \"were ambushed in a heinous act of violence\". He added: \"Two of our brothers were killed by a sniper, and a third brother remains in surgery.\" The sheriff's office in neighbouring Shoshone County said authorities were \"dealing with an active shooter situation where the shooter is still at large\". The fire was still raging, Mr Norris said. \"It's going to keep burning,\" he added. \"Can't put any resources on it right now.\" The FBI was sending technical teams and tactical support to the scene, its deputy director Dan Bongino said. \"It remains an active, and very dangerous scene,\" he said on X. Canfield Mountain is a popular hiking and biking spot on the outskirts of Coeur d'Alene, a city of around 55,000 people in northern Idaho. This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive Breaking News alerts on a smartphone or tablet via the Sky News App. You can also follow @SkyNews on X or subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Donald Trump says 'very wealthy group' has agreed to buy TikTok in the US",
        "description": "Donald Trump has said the US government has found a buyer for TikTok that he will reveal \"in about two weeks\".",
        "url": "https://news.sky.com/story/donald-trump-says-very-wealthy-group-has-agreed-to-buy-tiktok-in-the-us-13390243",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-tiktok-donald-trump_6803725.jpg?20250119030007",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-29 16:38:00",
        "Headline": "The president says he will reveal the buyer soon; however, any deal is believed to need sign-off from the Chinese government.",
        "Content": "Donald Trump has said the US government has found a buyer for TikTok that he will reveal \"in about two weeks\". The president told Fox News \"it's a group of very wealthy people\", adding: \"I think I'll probably need China approval, I think President Xi will probably do it.\" TikTok was ordered last year to find a new owner for its US operation - or face a ban - after politicians said they feared sensitive data about Americans could be passed to the Chinese government. The video app's owner, Bytedance, has repeatedly denied such claims. It originally had a deadline of 19 January to find a buyer - and many users were shocked when it \"went dark\" for a number of hours when that date came round, before later being restored. However, President Trump has now extended the deadline several times. The last extension was on 19 June, when he signed an executive order pushing it back to 17 September. \n                  Khaby Lame: World's biggest TikTok star leaves US after being detained by ICE\n                 \n                  Jess and Norma: Grandmother who had millions of fans on TikTok dies aged 91\n                 \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 Mr Trump's latest comments suggest multiple people coming together to take control of the app in the US. Among those rumoured to be potential buyers include YouTube superstar Mr Beast, US search engine startup Perplexity AI, and Kevin O'Leary - an investor from Shark Tank (the US version of Dragons' Den). Bytedance said in April that it was still talking to the US government, but there were \"differences on many key issues\".It's believed the Chinese government will have to approve any agreement. President Trump's interview with Fox News also touched on the upcoming end of the pause in US tariffs on imported goods. On April 9, he granted a 90-day reprieve for countries threatened with a tariff of more than 10% to give them time to negotiate. Deals have already been struck with some countries, including the UK. Read more from Sky News:Iran could begin enriching uranium again in months - UNMajor porn sites to introduce 'robust' age verification in UK The president said he didn't think he would need to push back the 9 July deadline and that letters would be sent out imminently stating what tariff each country would face. \"We'll look at the deficit we have - or whatever it is with the country; we'll look at how the country treats us - are they good, are they not so good. Some countries, we don't care - we'll just send a high number out,\" he said. \"But we're going to be sending letters out starting pretty soon. We don't have to meet, we have all the numbers.\" The president announced the tariffs in April, arguing they were correcting an unfair trade relationship and would return lost prosperity to US industries such as car-making."
    },
    {
        "title": "Iran could begin enriching uranium again in months, says UN nuclear watchdog chief",
        "description": "Iran will have the capacity to begin enriching uranium again in \"a matter of months\", the UN's nuclear watchdog boss has said.",
        "url": "https://news.sky.com/story/iran-could-begin-enriching-uranium-again-in-months-says-un-nuclear-watchdog-chief-13390094",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-fordow-site-nuclear_6953096.jpg?20250629125005",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-29 11:24:00",
        "Headline": "Iranian nuclear and military sites were attacked by Israel on 13 June, with the Israelis claiming Tehran was close to developing a nuclear weapon. The US then carried out its own strikes.",
        "Content": " Iran will have the capacity to begin enriching uranium again in \"a matter of months\", the UN's nuclear watchdog boss has said. Rafael Grossi, who heads the International Atomic Energy Agency (IAEA), said that US strikes on three sites a week ago had caused \"severe damage\" but it was not \"total\". Middle East: live updates Mr Grossi told CBS News: \"The capacities they have are there. They can have, you know, in a matter of months, I would say, a few cascades of centrifuges spinning and producing enriched uranium, or less than that. \"But as I said, frankly speaking, one cannot claim that everything has disappeared and there is nothing there.\" Iran still has \"industrial and technological capabilities… so if they so wish, they will be able to start doing this again\", he added. Iranian nuclear and military sites were attacked by Israel on 13 June, with the Israelis claiming Tehran was close to developing a nuclear weapon. The US then carried out its own strikes on 22 June, hitting Iranian nuclear installations at Fordow, Natanz and Isfahan, under Operation Midnight Hammer. Iran has insisted its nuclear research is for civilian energy production purposes. US President Donald Trump said last weekend that the American deployment of 30,000lb \"bunker-busting\" bombs had \"obliterated\" Iran's nuclear programme. But that claim appeared to be contradicted by an initial assessment from the US Defence Intelligence Agency. A source said Iran's enriched uranium stocks had not been eliminated, and the country's nuclear programme, much of which is buried deep underground, may have been put back only a month or two.  Mr Trump has rejected any suggestion that the damage to the sites was not as profound as he has said. And he stated he would consider bombing Iran again if Tehran was enriching uranium to worrying levels. At a news conference on Thursday alongside US defence secretary Pete Hegseth, the chairman of the joint chiefs of staff General Dan Caine, told reporters the GBU-57 bunker buster bombs had been designed in some secrecy with exactly this sort of target in mind.  The head of the CIA has also said a \"body of credible intelligence\" indicates Iran's nuclear programme was \"severely damaged\". Director John Ratcliffe revealed that information from a \"historically reliable and accurate source\" suggests several key sites were destroyed - and will take years to rebuild. Read more from Sky News:Glastonbury organiser says anti-IDF chants 'crossed a line'Murder investigation after pregnant woman found dead Meanwhile, Iran's supreme leader Ayatollah Ali Khamenei said his country \"slapped America in the face\" by launching an attack on 23 June against a major US base in Qatar, adding the nation would never surrender. The 12-day air conflict between Israel and Iran ended with a US-brokered ceasefire. But the Iranian armed forces chief of staff, General Abdolrahim Mousavi, has said his country doubts Israel will maintain the truce. A spokesman for Iran's foreign ministry said the US strikes had caused significant damage to Tehran's nuclear facilities."
    },
    {
        "title": "KKR leads £1.7bn race for Argos store-card owner NewDay",
        "description": "The private equity firm at the centre of a string of bidding wars for British companies is leading the &#163;1.7bn race to buy the owner of Argos's store-card operations.",
        "url": "https://news.sky.com/story/kkr-leads-16317bn-race-for-argos-store-card-owner-newday-13390134",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-argos-sainsburys_6792739.jpg?20250106115900",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-29 13:16:00",
        "Headline": "The US-based buyout firm is the frontrunner to buy the consumer credit group although other bidders remain in contention, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity firm at the centre of a string of bidding wars for British companies is leading the £1.7bn race to buy the owner of Argos's store-card operations. Sky News has learnt that KKR is the frontrunner to buy NewDay Group, which is owned by the buyout firms Cinven and CVC Capital Partners. KKR is not in exclusive talks, and other parties - said to include Pimco, the asset management giant, KKR, and a Bain Capital-led consortium - remain in contention to acquire NewDay. Some of the bidders, such as Pimco, have been interested in pursuing a deal to buy NewDay's consumer loan book rather than the company as a whole; others including KKR are understood to be interested in acquiring the whole business, but potentially with its existing shareholders remaining invested for a period of time. NewDay, which took ownership of Argos's store card business last year in a £720m deal with J Sainsbury, the supermarket giant, has been exploring a sale or stock market listing for months. Last November, Sky News reported that NewDay's owners were lining up investment bankers at Barclays to advise on a process. NewDay is one of Britain's biggest privately held providers of consumer credit services, with about four million customers. \n                  Supermarkets being told to cut shoppers' calories in obesity crackdown is not 'nanny statism', says Streeting\n                 \n                  Spanish-owned Scottish Power sparks merger talks with Ovo Energy\n                 \n                  New Look owners line up bankers to fashion high street exit\n                 Last year, it reported £213m of underlying pre-tax profit, with new customer acquisitions up 36%. It also launched a technology and lending partnership with Lloyds Banking Group, and launched the pilot of a technology partnership with Debenhams Group in the final quarter of last year. KKR has become engaged in bidding wars in recent months for Assura, the GP surgeries landlord, and testing equipment provider Spectris - both of which are listed on the London stock market. NewDay, KKR and CVC declined to comment."
    },
    {
        "title": "Concessions to welfare reforms to be revealed after Labour backbench rebellion forces government retreat",
        "description": "Changes to welfare reforms, forced on the government by rebel Labour MPs, are being revealed today ahead of a crucial vote.",
        "url": "https://news.sky.com/story/concessions-to-welfare-reforms-to-be-revealed-after-labour-backbench-rebellion-forces-government-retreat-13390292",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wheelchair-park_6953416.jpg?20250629220724",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-29 23:01:00",
        "Headline": "Work and Pensions Secretary Liz Kendall has said the amended legislation now aims to deliver a \"fairer, more compassionate system\", but her Conservative counterpart will not say if the Tories plan to back the bill.",
        "Content": "Changes to welfare reforms, forced on the government by rebel Labour MPs, are being revealed today ahead of a crucial vote. The original bill restricted eligibility for the personal independence payment (pip) and cut the health-related element of universal credit (UC). The government, which insisted welfare costs were becoming unsustainable, was forced into a U-turn after 126 Labour backbenchers signed an amendment that would have halted the bill at its first Commons hurdle. Explainer: What are the welfare concessions? While the amendment is expected to be withdrawn, after changes that appeased some Labour MPs, others are still unhappy and considering backing a similar amendment to be tabled today.  Here are the main changes to the UC and pip bill: • current pip claimants will keep their benefits; stricter eligibility requirements will only apply to new claims from November 2026• a review of the pip assessment, which will have input from disabled people• existing recipients of the health-related element of UC will have their incomes protected in real terms \n                  PM and ministers now admit welfare reforms went too far\n                 \n                  'Sometimes there is strength in listening': Liz Kendall defends welfare U-turn\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 Work and Pensions Secretary Liz Kendall said in a statement that the legislation now aims to deliver a \"fairer, more compassionate system\" ahead of the second reading and vote on Tuesday. \"We must build a welfare system that provides security for those who cannot work and the right support for those who can. Too often, disabled people feel trapped, worried that if they try to work, they could lose the support they depend on. \"That is why we are taking action to remove those barriers, support disabled people to live with dignity and independence, and open routes into employment for those who want to pursue it. \"This is about delivering a fairer, more compassionate system as part of our Plan for Change which supports people to thrive, whatever their circumstances.\" On Saturday, Sir Keir Starmer said fixing the UK's welfare system was a \"moral imperative\". The government claimed cuts to sickness and disability benefits would shave £5bn off the welfare bill and get more people into work. The Resolution Foundation believes the concessions could cost as much as £3bn, while the Institute for Fiscal Studies warned that the changes make tax rises more likely. Read more:Starmer's most damaging U-turn yetLiz Kendall defends welfare retreat 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Health Secretary Wes Streeting told Sky News that welfare bill changes have put Labour in a much better position ahead of tomorrow's vote. On Sunday Morning with Trevor Phillips, Mr Streeting said: \"There were things that we didn't get right, we've put right, and there'll be a debate about future amendments and things, I'm sure, as it goes through in the usual way.\" On the same programme, shadow work and pensions secretary Helen Whately repeatedly refused to say whether the Conservatives would back the bill, but would review the proposals after the minister's statement later. \"We have said that if there are more savings that actually bring the welfare bill down, if they'll get more people into work, and if they commit to using the savings to avoid tax cuts in the autumn, which looks highly unlikely at the moment, then they have our support.\" The Liberal Democrats plan to vote against the bill and have called for the government to speed up access-to-work decisions to help people enter the workforce."
    },
    {
        "title": "PM and ministers now admit welfare reforms went too far",
        "description": "It was only 10 days ago that embattled Welfare Secretary Liz Kendall, trying to convince MPs to back her reforms, said ministers were \"firm in our convictions\".",
        "url": "https://news.sky.com/story/pm-and-ministers-now-admit-welfare-reforms-went-too-far-13390096",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-starmer-prime-minister_6951572.jpg?20250627003942",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-06-29 11:36:00",
        "Headline": "Having rushed forward these reforms to save £5bn in the spending review, it now seems ministers are admitting the package needed more thought.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  It was only 10 days ago that embattled Welfare Secretary Liz Kendall, trying to convince MPs to back her reforms, said ministers were \"firm in our convictions\". People on Personal Independence Payments (PIP) and universal credit were too often being \"written off\", while the welfare bill was becoming unsustainable. Politics latest: Minister condemns 'appalling' anti-IDF chants at Glastonbury  After an unprecedented rebellion by Labour MPs forced the prime minister into a significant retreat, today sees an interesting shift in those convictions. Ms Kendall's colleague Wes Streeting, who was drafted onto calls with angry backbenchers, tells Sky News he didn't want disabled people in his constituency surgeries on a Friday, telling him they were worse off when that was not the intention. This is exactly what many Labour MPs and disability groups were arguing was inevitable if current claimants were stripped of their benefits. Sir Keir Starmer, in a series of Sunday newspaper interviews in which he reflects on mistakes, says he now believes there was no point ploughing ahead with something which \"doesn't necessarily achieve the desired outcome\". Read more:Supermarkets being told to cut shoppers' calories in obesity crackdownWhat are the concessions to the welfare bill - and will MPs back it? Having rushed forward these reforms to save £5bn in the spending review, it now seems ministers are admitting the package needed more thought. The welfare bill is rising sharply, and many voters broadly support the idea of tackling it. But even if the draft legislation, which will affect new benefit claimants only, is voted through (and that's still an \"if'\", with dozens of Labour MPs still weighing it up), this debacle - for many MPs at least - goes to the heart of whose side the government is on."
    },
    {
        "title": "Starmer condemns 'appalling hate speech' at Glastonbury - as organiser says anti-IDF chants 'crossed a line'",
        "description": "The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\".",
        "url": "https://news.sky.com/story/glastonbury-organiser-emily-eavis-says-anti-idf-chants-crossed-a-line-and-no-place-at-festival-for-hate-speech-13390070",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-29 09:52:00",
        "Headline": "The prime minister has joined Glastonbury organiser Emily Eavis in responding to duo Bob Vylan's set on the West Holts stage, which police are investigating.",
        "Content": " The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\". Responding on Sunday to rap duo Bob Vylan's set the day before, Sir Keir Starmer said: \"There is no excuse for this kind of appalling hate speech.\" In the same statement, the prime minister repeated his previous argument that the Belfast rap group Kneecap should have been removed from the line-up after one member was charged with a terrorism offence. \"I said that Kneecap should not be given a platform and that goes for any other performers making threats or inciting violence. \"The BBC needs to explain how these scenes came to be broadcast.\" On Sunday, Ms Eavis, whose father Michael co-founded the festival, posted her response to Bob Vylan's performance. \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence,\" she wrote. She said that while \"as a festival, we stand against all forms of war and terrorism - we will always believe in - and actively campaign for - hope, unity, peace and love\", adding a performer's comments \"should never be seen as a tacit endorsement of their opinions and beliefs\". Eavis added: \"With almost 4,000 performances at Glastonbury 2025, there will inevitably be artists and speakers appearing on our stages whose views we do not share.\" Read morePulp revealed as mystery Glastonbury bandFestival performers criticise political interferenceLewis Capaldi plays not-so-secret set The rappers' set was streamed live on the BBC on Saturday, showing one of them shouting the slogan into the mic, with some of the crowd joining in. They also performed in front of a screen that claimed Israel's actions in Gaza amount to \"genocide\". Posting on Instagram on Sunday, drummer Bobby Vylan doubled down by repeating elements of the chant alongside a picture of himself. The Israeli embassy posted on X in the hours after the set saying it was \"deeply disturbed by the inflammatory and hateful rhetoric\". It said the slogan used \"advocates for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" In a separate post on X on Sunday, Israel's foreign ministry published graphic footage following the attack by Hamas on the Nova festival in Israel on 7 October 2023. The message directly appealed to those at Glastonbury who joined in the chants. \"On October 7th, Hamas terrorists murdered hundreds of innocent partygoers at the Nova festival. For those at the Glastonbury festival who need a reality check, let this footage serve as a reminder to what you are supporting.\" Meanwhile the Campaign Against Antisemitism (CAA) said it will be formally complaining to the BBC over its \"outrageous decision\" to broadcast the performance. Avon and Somerset Police said they are looking at whether a criminal offence was committed. \"Video evidence will be assessed by officers to determine whether any offences may have been committed that would require a criminal investigation,\" the force said in a post on social media. Culture and entertainment reporter Bob Vylan, a punk-rap duo known for their politically charged lyrics taking on racism, fascism, police brutality, toxic masculinity, inequality and more, performed on the festival’s third biggest stage, West Holts, with a capacity of about 30,000. They played to their own fans but no doubt thousands who had turned out to secure their place for the controversial Irish-language rappers Kneecap who followed. After the Bob Vylan performance was aired live, clips quickly flooded social media - shared by those supporting the band and condemning them. \"The BBC didn't cover Kneecap's set at Glastonbury Festival over Free Palestine chants, so Bob Vylan, who BBC covered, stepped in,\" posted the Celebrities4Palestine account alongside a clip on Instagram, also shared by Bob Vylan. The IDF comments on stage may well have been made regardless. Or did Kneecap's \"cancelling\" by the BBC, as some people saw it, encourage other acts to speak out even more? Police are investigating both performances. Kneecap's Naoise O Caireallain, who performs under the name Moglai Bap, at one point mentioned \"a riot outside the courts\" over his bandmate Liam Og O hAnnaidh's (Mo Chara) upcoming second appearance on a terror charge, before clarifying: \"No riots, just love and support, and support for Palestine.\" With its history of activism, Glastonbury has always championed free speech. But it seems Bob Vylan's set may have pushed things too far. It's fair to say that here at Glastonbury, for most of the 200,000 people on site this weekend, it is still all about the music. The majority did not see these sets and many are not even aware of the criticism outside Worthy Farm. Today is the final day of artist performances, with acts including Olivia Rodrigo, Rod Stewart and the Prodigy on the bill. But instead of the magic of the most famous festival in the world, both organisers and the broadcaster are now facing more questions about Bob Vylan and, to a lesser extent, Kneecap, as criticism mounts. Bob Vylan went on stage just ahead of a performance by Kneecap, the Irish rap band that the prime minister and others called to be removed from the Glastonbury and other festival line-ups over alleged on-stage endorsements of terrorist groups Hamas and Hezbollah. Ultimately, the BBC decided not to broadcast Kneecap's set live, but have since made it available to watch on catch-up on iPlayer. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of Hezbollah at a gig. His bandmate Naoise O Caireallain told Glastonbury crowds on Saturday they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for their set and told fans he was a \"free man\". Questions over why BBC broadcast chants The government's culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what steps were taken around the Bob Vylan set. Speaking to Sunday Morning With Trevor Phillips on behalf of the government, Health Secretary Wes Streeting described the chant as \"appalling\" and a \"shameless publicity stunt\". \"The fact that we saw that chant at a music festival - when there were Israelis at a similar music festival who were kidnapped, murdered, raped, and in some cases still held captive,\" he said in reference to the 7 October 2023 Hamas attack at the Nova music festival. He added that while \"there's no justification for inciting violence against Israelis… the way in which Israel's conducting this war has made it extremely difficult for Israel's allies around the world to stand by and justify\". \"I'd also say to the Israeli embassy, get your own house in order, in terms of the conduct of your own citizens and the settlers in the West Bank,\" he told Phillips. Meanwhile, Conservative leader Kemi Badenoch reposted a clip of the Bob Vylan set describing it as \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Lucy McMullin, who was in the crowd for Bob Vylan, told Sky News: \"When there's children and civilians being murdered and starved, then I think it's important that people are speaking out on these issues. \"However, inciting more death and violence is not the way to do it.\" A BBC spokesperson confirmed the Bob Vylan stream will not be made available to watch on its iPlayer. \"Some of the comments made during Bob Vylan's set were deeply offensive,\" their statement said. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. We have no plans to make the performance available on demand.\""
    },
    {
        "title": "Ex-Tory minister George Freeman refers himself to standards watchdog over 'cash for questions' accusations",
        "description": "A former Tory minister has referred himself to the parliamentary watchdog following allegations he was paid by a company that helped him write questions to government.",
        "url": "https://news.sky.com/story/ex-tory-minister-george-freeman-refers-himself-to-standards-watchdog-over-cash-for-questions-accusations-13390104",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-george-freeman-science-minister_6082230.jpg?20230308161243",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-29 12:03:00",
        "Headline": "George Freeman, a former science minister, denies wrongdoing - but critics call for him to be suspended from the Tory party.",
        "Content": "A former Tory minister has referred himself to the parliamentary watchdog following allegations he was paid by a company that helped him write questions to government. George Freeman, the MP for Norfolk, is reported by The Times to have submitted queries to Labour ministers about the sector the firm operates in. Politics latest: Minister condemns 'appalling' anti-IDF chants at Glastonbury  The newspaper published what it said were leaked emails that showed exchanges in which Mr Freeman had asked the company's director what to ask about as he prepared written parliamentary questions related to space data and emissions tracking. Written parliamentary questions can be tabled by any MP and are a common way of requesting more information from a minister in a certain department. Mr Freeman, who reportedly tabled the questions to the Department for Science, Innovation and Technology and the Department for Energy Security and Net Zero, became a paid adviser with GHGSat, a monitoring service for greenhouse gas emissions, in April last year. The appointments watchdog Acoba advised him that in taking up the role, \"there are risks associated with your influence and network of contacts gained whilst in ministerial office\". \n                  Reform would win most seats in general election, in-depth poll suggests\n                 \n                  Latest polling says if an election was held tomorrow Reform UK would win a majority\n                 \n                  Kemi Badenoch: ECHR has become 'sword used to attack democratic decisions'\n                 \"In particular, this is a company that is interested in government policy and decisions relating to the civil space sector and emissions,\" the watchdog said. \"You noted you have made it clear to the company that you will not lobby government on its behalf, and this will not form part of your role.\" In a statement, Mr Freeman said he did not believe he had done \"anything wrong\" but that he was referring himself to the standards commissioner. \"As a longstanding advocate of important new technologies, companies and industries, working cross-party through APPGs and the select committee, I regularly ask experts for clarification on technical points and terminology, and deeply respect and try to assiduously follow the code of conduct for MPs and the need to act always in the public interest,\" he said. \"Throughout my 15 years in parliament (and government) I have always understood the need to be transparent in the work I have done for and with commercial clients and charities and am always willing to answer any criticism. \"I don't believe I have done anything wrong but I am immediately referring myself to the parliamentary commissioner for standards and will accept his judgment in due course.\" He added: \"I am very concerned at the unauthorised and targeted access to my emails and diary which I have raised with the police and parliamentary authorities.\" A Conservative Party spokesperson said: \"George Freeman MP has referred himself to the Parliamentary Standards Commissioner. \"It would be inappropriate for the Conservative Party to comment further whilst the commissioner's inquiries are ongoing.\" Read more:Supermarkets being told to cut shoppers' calories in obesity crackdownCarrie Johnson admitted to hospital over 'severe dehydration' The Lib Dems and Labour called on Conservative leader Kemi Badenoch to suspend him, saying the incident bore a resemblance to the cash for questions scandal that engulfed John Major's leadership in the 1990s. A Labour spokesperson said: \"Cash for questions was a hallmark of Tory sleaze in the 1990s, and three decades on the same issue has raised its head again. \"George Freeman has referred himself for investigation so now Kemi Badenoch must suspend him from the Tory whip.\" Liberal Democrat Deputy Leader Daisy Cooper added: \"This looks like the same old sleaze and scandal people have come to expect from the Conservative Party. \"Kemi Badenoch should immediately suspend the whip from George Freeman while this is investigated. \"Failure to act would confirm that even after being booted out of government, the Conservatives are still hopelessly out of touch.\""
    },
    {
        "title": "BBC and Glastonbury have got questions to answer over 'appalling' chants at festival, says Wes Streeting",
        "description": "A cabinet minister has criticised chants at Glastonbury calling for \"death to the IDF\" - but has also told the Israeli embassy to \"get your own house in order\".",
        "url": "https://news.sky.com/story/bbc-and-glastonbury-have-got-questions-to-answer-over-appalling-chants-at-festival-says-wes-streeting-13390053",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wes-streeting_6952988.jpg?20250629084647",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-29 09:02:00",
        "Headline": "The health secretary condemns \"death to the IDF\" chants at Glastonbury as \"appalling\" - but says \"the way in which Israel's conducting this war has made it extremely difficult for Israel's allies around the world to stand by and justify\".",
        "Content": " A cabinet minister has criticised chants at Glastonbury calling for \"death to the IDF\" - but has also told the Israeli embassy to \"get your own house in order\". Health Secretary Wes Streeting condemned the chants against the Israel Defence Forces - calling them \"appalling\" - but notably also criticised the embassy over the conduct of some Israeli citizens in the occupied West Bank. Glastonbury Festival has said it is \"appalled\" by the statements made by Bobby Vylan, of punk duo Bob Vylan, during their set on Saturday - saying they \"crossed a line\". Politics latest: Welfare changes have 'put us in a much better position', says minister Speaking to Sunday Morning With Trevor Phillips, Mr Streeting said he believed the BBC and Glastonbury had \"questions to answer\" over what he called a \"shameless publicity stunt\" during the set of Bob Vylan. \"I thought it was appalling, to be honest and I think the BBC and Glastonbury have got questions to answer about how we saw such a spectacle on our screens,\" he said. \"But I also think it's a pretty shameless publicity stunt, which I don't really want to give too much indulgence to for that reason.\" He said the focus should instead be on \"Israeli settler terrorists\" attacking a Christian village just weeks after setting it on fire. He added: \"I'd also say to the Israeli embassy, get your own house in order, in terms of the conduct of your own citizens and the settlers in the West Bank. \"So, you know, I think there's a serious point there by the Israeli embassy, I take seriously. I wish they'd take the violence of their own citizens towards Palestinians more seriously. \"We all condemned and continue to condemn what happened on 7 October. We all want to see the return of the hostages. And there's no justification for inciting violence against Israelis. \"But you know, the way in which Israel's conducting this war has made it extremely difficult for Israel's allies around the world to stand by and justify. In fact, we've got to do the opposite as an international community, which is to challenge and urge a change.\"  The Israeli embassy said it was \"deeply disturbed\" by the anti-IDF chants, which are being investigated by the police. Video shows one of the members of Bob Vylan shouting the slogan into the mic and some of the crowd joining in. The duo were performing ahead of a performance by Kneecap, the Irish act the prime minister believed should have been banned from the world-famous festival. \"The Embassy of Israel in the United Kingdom is deeply disturbed by the inflammatory and hateful rhetoric expressed on stage at the Glastonbury Festival,\" a statement said. It said slogans like Saturday's chant \"advocate for the dismantling of the State of Israel\".  The Conservatives also criticised the incident, with Helen Whately, the shadow work and pensions secretary, saying she was \"shocked\" by the footage. \"I was shocked to see some of the footage of that chanting of the crowd,\" she told Sunday Morning With Trevor Phillips. \"And the music artist was ramping it up. \"I mean to me, also, one of the horrible things about it is, obviously it's over a year and a half ago that innocent, festivalgoers at a festival in Israel were raped and murdered by Hamas - and then we have a music festival here in the UK where you have a chant saying death to the Israeli Armed Forces who are, you know, taking action to protect people from what Hamas did in Israel. \"I just think it's disgusting.\" She added: \"Yes, I believe in free speech, but that was incitement to violence. It was incitement to kill. That is not something that we support in this country.\" Read more from Sky News:Welfare has been Starmer's most damaging U-turn yet What are the concessions to the welfare bill - and will MPs back it? An Instagram post published by the festival on Sunday morning read: \"As a festival, we stand against all forms of war and terrorism. We will always believe in - and actively campaign for - hope, unity, peace and love. \"With almost 4,000 performances at Glastonbury 2025, there will inevitably be artists and speakers appearing on our stages whose views we do not share, and a performer's presence here should never be seen as a tacit endorsement of their opinions and beliefs. \"However, we are appalled by the statements made from the West Holts stage by Bob Vylan yesterday. \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.\""
    },
    {
        "title": "Starmer says he was 'heavily focused' on world affairs before U-turn on welfare bill",
        "description": "Sir Keir Starmer has said he was \"heavily focused\" on world affairs before he was forced to U-turn on his welfare bill after rebellion by MPs.",
        "url": "https://news.sky.com/story/starmer-says-he-was-heavily-focused-on-world-affairs-before-u-turn-on-welfare-bill-13389954",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-labour-wales-keir-starmer_6952401.jpg?20250628111914",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-29 02:02:00",
        "Headline": "The prime minister has also defended his decision to U-turn on his welfare bill following widespread opposition by his own MPs. Concessions have been made after significant rebellion over plans to cut sickness and disability benefits.",
        "Content": " Sir Keir Starmer has said he was \"heavily focused\" on world affairs before he was forced to U-turn on his welfare bill after rebellion by MPs. In a piece in The Sunday Times, Sir Keir said he was occupied with the G7 and NATO summits and the escalating tensions in the Middle East for much of the past two weeks. His \"full attention really bore down\" on the welfare bill on Thursday, he added. It comes after the government was forced to U-turn on plans to cut sickness and disability benefits after significant rebellion by Labour MPs earlier this week. The government has since offered concessions ahead of a vote in the Commons on Tuesday, including exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Sir Keir defended the U-turn by saying: \"Getting it right is more important than ploughing on with a package which doesn't necessarily achieve the desired outcome.\" He said all the decisions were his and that \"I take ownership of them\". \n                  Fixing welfare a 'moral imperative', Starmer says, after government U-turn\n                 \n                  This has been Starmer's most damaging U-turn yet - but the bigger cost is the political one\n                 \n                  Welfare concessions 'common sense', says PM - as he defends U-turn\n                 There have been reports that rebel MPs blamed Sir Keir's chief of staff Morgan McSweeney for the government's approach. Read more:This has been the PM's most damaging U-turn yetIs Starmer at the mercy of his MPs? Sir Keir said: \"My rule of leadership is, when things go well you get the plaudits; when things don't go well you carry the can. \"I take responsibility for all the decisions made by this government. I do not talk about staff and I'd much prefer it if everybody else didn't.\"  Sir Keir said on Saturday that fixing the UK's welfare system is a \"moral imperative\". Speaking at Welsh Labour's annual conference in Llandudno, North Wales, Sir Keir said: \"Everyone agrees that our welfare system is broken, failing people every day. \"Fixing it is a moral imperative, but we need to do it in a Labour way, conference, and we will.\""
    },
    {
        "title": "Donald Trump says 'very wealthy group' has agreed to buy TikTok in the US",
        "description": "Donald Trump has said the US government has found a buyer for TikTok that he will reveal \"in about two weeks\".",
        "url": "https://news.sky.com/story/donald-trump-says-very-wealthy-group-has-agreed-to-buy-tiktok-in-the-us-13390243",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-tiktok-donald-trump_6803725.jpg?20250119030007",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-29 16:38:00",
        "Headline": "The president says he will reveal the buyer soon; however, any deal is believed to need sign-off from the Chinese government.",
        "Content": "Donald Trump has said the US government has found a buyer for TikTok that he will reveal \"in about two weeks\". The president told Fox News \"it's a group of very wealthy people\", adding: \"I think I'll probably need China approval, I think President Xi will probably do it.\" TikTok was ordered last year to find a new owner for its US operation - or face a ban - after politicians said they feared sensitive data about Americans could be passed to the Chinese government. The video app's owner, Bytedance, has repeatedly denied such claims. It originally had a deadline of 19 January to find a buyer - and many users were shocked when it \"went dark\" for a number of hours when that date came round, before later being restored. However, President Trump has now extended the deadline several times. The last extension was on 19 June, when he signed an executive order pushing it back to 17 September. \n                  Khaby Lame: World's biggest TikTok star leaves US after being detained by ICE\n                 \n                  Jess and Norma: Grandmother who had millions of fans on TikTok dies aged 91\n                 \n                  TikTok's new initiative to stop teenagers' late-night doomscrolling\n                 Mr Trump's latest comments suggest multiple people coming together to take control of the app in the US. Among those rumoured to be potential buyers include YouTube superstar Mr Beast, US search engine startup Perplexity AI, and Kevin O'Leary - an investor from Shark Tank (the US version of Dragons' Den). Bytedance said in April that it was still talking to the US government, but there were \"differences on many key issues\".It's believed the Chinese government will have to approve any agreement. President Trump's interview with Fox News also touched on the upcoming end of the pause in US tariffs on imported goods. On April 9, he granted a 90-day reprieve for countries threatened with a tariff of more than 10% to give them time to negotiate. Deals have already been struck with some countries, including the UK. Read more from Sky News:Iran could begin enriching uranium again in months - UNMajor porn sites to introduce 'robust' age verification in UK The president said he didn't think he would need to push back the 9 July deadline and that letters would be sent out imminently stating what tariff each country would face. \"We'll look at the deficit we have - or whatever it is with the country; we'll look at how the country treats us - are they good, are they not so good. Some countries, we don't care - we'll just send a high number out,\" he said. \"But we're going to be sending letters out starting pretty soon. We don't have to meet, we have all the numbers.\" The president announced the tariffs in April, arguing they were correcting an unfair trade relationship and would return lost prosperity to US industries such as car-making."
    },
    {
        "title": "European heatwave leaves Spain, Portugal, Italy and Greece in sweltering 40C heat",
        "description": "Major heatwaves across southern Europe have left Spain, Portugal, Italy, and Greece in sweltering conditions of more than 40C (104F).",
        "url": "https://news.sky.com/story/european-heatwave-leaves-spain-portugal-italy-and-greece-in-sweltering-40c-heat-13390105",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spain-weather_6953144.jpg?20250629135855",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-29 12:11:00",
        "Headline": "A ridge of high pressure above central and western Europe is driving the scorching conditions, says Sky News meteorologist Chris England.",
        "Content": "Major heatwaves across southern Europe have left Spain, Portugal, Italy, and Greece in sweltering conditions of more than 40C (104F). Two-thirds of Portugal was on high alert for extreme heat and risk of wildfires on Sunday, with temperatures in Lisbon expected to exceed 42C (107F). In parts of southern Spain, temperatures are well above average, with 42C also expected in Seville and other cities. The country's meteorological service says June is likely to be the hottest Spain has experienced since records began. In several Italian regions, including Lazio, Tuscany, Calabria, Puglia, and Umbria, outdoor work was banned during peak hours of sun on Sunday, with trade unions pushing for the measures to be extended and rolled out nationwide. Twenty-one out of 27 cities were under the highest possible heat alert, including Rome, Milan, and Naples. Read moreWhat's actually happening underneath your sunburn Greece has already been plagued by wildfires this summer, with one breaking out south of Athens on Thursday, and several on the island of Chios last Sunday. Near Athens, authorities deployed 130 firefighters, 12 helicopters, and 12 planes, with 40 people evacuated from the highest-risk areas. A woman was arrested on suspicion of unintentional arson after wildfires spread across brush and pastureland for three days on Chios. Scientists link increasing frequencies of extreme weather events such as heatwaves, wildfires, and storms to climate change. In France and Germany, at least three people died amid stormy conditions. A ridge of high pressure above central and western Europe is driving the scorching conditions, says Sky News meteorologist Chris England. Hotter-than-normal sea temperatures, dry land, and surface winds are also partly to blame, he added. UK heatwave also likely  The UK is halfway through a four-day amber heat health alert, with temperatures expected to peak in the mid-30s (86F) on Tuesday. Heat health alerts are not public weather warnings - but are instead designed to prepare health and social care bodies for the potential impact on their infrastructure and vulnerable groups. Heatwave thresholds are likely to be met on Monday and Tuesday, which vary between 28C (82F) in the south of England and 25C (77F) across the rest of the country."
    },
    {
        "title": "Starmer condemns 'appalling hate speech' at Glastonbury - as organiser says anti-IDF chants 'crossed a line'",
        "description": "The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\".",
        "url": "https://news.sky.com/story/glastonbury-organiser-emily-eavis-says-anti-idf-chants-crossed-a-line-and-no-place-at-festival-for-hate-speech-13390070",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6952843.jpg?20250629125300",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-29 09:52:00",
        "Headline": "The prime minister has joined Glastonbury organiser Emily Eavis in responding to duo Bob Vylan's set on the West Holts stage, which police are investigating.",
        "Content": " The prime minister has criticised chants of \"death to the IDF\" during a Glastonbury performance on Saturday, while festival organiser Emily Eavis said they had \"very much crossed a line\". Responding on Sunday to rap duo Bob Vylan's set the day before, Sir Keir Starmer said: \"There is no excuse for this kind of appalling hate speech.\" In the same statement, the prime minister repeated his previous argument that the Belfast rap group Kneecap should have been removed from the line-up after one member was charged with a terrorism offence. \"I said that Kneecap should not be given a platform and that goes for any other performers making threats or inciting violence. \"The BBC needs to explain how these scenes came to be broadcast.\" On Sunday, Ms Eavis, whose father Michael co-founded the festival, posted her response to Bob Vylan's performance. \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the Festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence,\" she wrote. She said that while \"as a festival, we stand against all forms of war and terrorism - we will always believe in - and actively campaign for - hope, unity, peace and love\", adding a performer's comments \"should never be seen as a tacit endorsement of their opinions and beliefs\". Eavis added: \"With almost 4,000 performances at Glastonbury 2025, there will inevitably be artists and speakers appearing on our stages whose views we do not share.\" Read morePulp revealed as mystery Glastonbury bandFestival performers criticise political interferenceLewis Capaldi plays not-so-secret set The rappers' set was streamed live on the BBC on Saturday, showing one of them shouting the slogan into the mic, with some of the crowd joining in. They also performed in front of a screen that claimed Israel's actions in Gaza amount to \"genocide\". Posting on Instagram on Sunday, drummer Bobby Vylan doubled down by repeating elements of the chant alongside a picture of himself. The Israeli embassy posted on X in the hours after the set saying it was \"deeply disturbed by the inflammatory and hateful rhetoric\". It said the slogan used \"advocates for the dismantling of the State of Israel\". The post on X added: \"When such messages are delivered before tens of thousands of festivalgoers and met with applause, it raises serious concerns about the normalisation of extremist language and the glorification of violence.\" In a separate post on X on Sunday, Israel's foreign ministry published graphic footage following the attack by Hamas on the Nova festival in Israel on 7 October 2023. The message directly appealed to those at Glastonbury who joined in the chants. \"On October 7th, Hamas terrorists murdered hundreds of innocent partygoers at the Nova festival. For those at the Glastonbury festival who need a reality check, let this footage serve as a reminder to what you are supporting.\" Meanwhile the Campaign Against Antisemitism (CAA) said it will be formally complaining to the BBC over its \"outrageous decision\" to broadcast the performance. Avon and Somerset Police said they are looking at whether a criminal offence was committed. \"Video evidence will be assessed by officers to determine whether any offences may have been committed that would require a criminal investigation,\" the force said in a post on social media. Culture and entertainment reporter Bob Vylan, a punk-rap duo known for their politically charged lyrics taking on racism, fascism, police brutality, toxic masculinity, inequality and more, performed on the festival’s third biggest stage, West Holts, with a capacity of about 30,000. They played to their own fans but no doubt thousands who had turned out to secure their place for the controversial Irish-language rappers Kneecap who followed. After the Bob Vylan performance was aired live, clips quickly flooded social media - shared by those supporting the band and condemning them. \"The BBC didn't cover Kneecap's set at Glastonbury Festival over Free Palestine chants, so Bob Vylan, who BBC covered, stepped in,\" posted the Celebrities4Palestine account alongside a clip on Instagram, also shared by Bob Vylan. The IDF comments on stage may well have been made regardless. Or did Kneecap's \"cancelling\" by the BBC, as some people saw it, encourage other acts to speak out even more? Police are investigating both performances. Kneecap's Naoise O Caireallain, who performs under the name Moglai Bap, at one point mentioned \"a riot outside the courts\" over his bandmate Liam Og O hAnnaidh's (Mo Chara) upcoming second appearance on a terror charge, before clarifying: \"No riots, just love and support, and support for Palestine.\" With its history of activism, Glastonbury has always championed free speech. But it seems Bob Vylan's set may have pushed things too far. It's fair to say that here at Glastonbury, for most of the 200,000 people on site this weekend, it is still all about the music. The majority did not see these sets and many are not even aware of the criticism outside Worthy Farm. Today is the final day of artist performances, with acts including Olivia Rodrigo, Rod Stewart and the Prodigy on the bill. But instead of the magic of the most famous festival in the world, both organisers and the broadcaster are now facing more questions about Bob Vylan and, to a lesser extent, Kneecap, as criticism mounts. Bob Vylan went on stage just ahead of a performance by Kneecap, the Irish rap band that the prime minister and others called to be removed from the Glastonbury and other festival line-ups over alleged on-stage endorsements of terrorist groups Hamas and Hezbollah. Ultimately, the BBC decided not to broadcast Kneecap's set live, but have since made it available to watch on catch-up on iPlayer. One of its members, Liam Og O hAnnaidh, was charged with a terror offence in May after being accused of displaying a flag in support of Hezbollah at a gig. His bandmate Naoise O Caireallain told Glastonbury crowds on Saturday they should \"start a riot outside the courts\", before clarifying: \"No riots just love and support, and support for Palestine.\" O hAnnaidh - also known as Mo Chara - wore a Palestinian keffiyeh scarf for their set and told fans he was a \"free man\". Questions over why BBC broadcast chants The government's culture Secretary Lisa Nandy has spoken to BBC boss Tim Davie for an \"urgent explanation\" about what steps were taken around the Bob Vylan set. Speaking to Sunday Morning With Trevor Phillips on behalf of the government, Health Secretary Wes Streeting described the chant as \"appalling\" and a \"shameless publicity stunt\". \"The fact that we saw that chant at a music festival - when there were Israelis at a similar music festival who were kidnapped, murdered, raped, and in some cases still held captive,\" he said in reference to the 7 October 2023 Hamas attack at the Nova music festival. He added that while \"there's no justification for inciting violence against Israelis… the way in which Israel's conducting this war has made it extremely difficult for Israel's allies around the world to stand by and justify\". \"I'd also say to the Israeli embassy, get your own house in order, in terms of the conduct of your own citizens and the settlers in the West Bank,\" he told Phillips. Meanwhile, Conservative leader Kemi Badenoch reposted a clip of the Bob Vylan set describing it as \"grotesque\". \"Violence against Jews isn't edgy. The West is playing with fire if we allow this sort of behaviour to go unchecked,\" she said on X. Lucy McMullin, who was in the crowd for Bob Vylan, told Sky News: \"When there's children and civilians being murdered and starved, then I think it's important that people are speaking out on these issues. \"However, inciting more death and violence is not the way to do it.\" A BBC spokesperson confirmed the Bob Vylan stream will not be made available to watch on its iPlayer. \"Some of the comments made during Bob Vylan's set were deeply offensive,\" their statement said. \"During this live stream on iPlayer, which reflected what was happening on stage, a warning was issued on screen about the very strong and discriminatory language. We have no plans to make the performance available on demand.\""
    },
    {
        "title": "Who are Bob Vylan - the duo who 'very much crossed the line' at Glastonbury with anti-IDF chant?",
        "description": "Musicians, especially punk acts, making headlines for their politics is nothing new.",
        "url": "https://news.sky.com/story/who-are-bob-vylan-the-rap-band-who-very-much-crossed-the-line-at-glastonbury-with-anti-idf-chant-13390138",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-bob-vylan-glastonbury_6953174.jpg?20250629143818",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-06-29 13:25:00",
        "Headline": "Formed in Ipswich in 2017, the band rap about racism, homophobia, toxic masculinity, and far-right politics.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Musicians, especially punk acts, making headlines for their politics is nothing new. The Sex Pistols, The Clash, Rage Against The Machine - in 2025, it's Kneecap and now Bob Vylan riling politicians. But in the case of chants made by Bob Vylan on stage at Glastonbury, it is not just MPs. Festival organiser Emily Eavis has also condemned the comments despite the festival's advocacy for free speech, saying they \"very much crossed a line\". Police are investigating footage of the performance, which has since been removed by the BBC, to see if any offences were committed.  So who are Bob Vylan? The duo are Bobby Vylan, the frontman, and drummer Bobbie Vylan. They have not revealed their real names to protect their privacy. They formed in Ipswich in 2017 and their musical style is a mix of punk, rap, and hard rock. They have released three albums - We Live Here (2020), Bob Vylan Presents The Price Of Life (2022), and last year's Humble As The Sun - and their music has won them awards including best alternative act at the MOBOs in 2022, and best album at the Kerrang Awards in the same year. Their songs confront issues including racism, homophobia, toxic masculinity, and far-right politics, and the track Pretty Songs is often introduced by Bobby saying that \"violence is the only language that some people understand\". Gigs often include some crowd-surfing from the frontman, and they have collaborated with artists including Amyl And The Sniffers singer Amy Taylor, Soft Play guitarist Laurie Vincent, and rock band Kid Kapichi. In an interview with The Guardian last year, Bobby Vylan told how he attended his first pro-Palestine protest at the age of 15, escorted by a friend's mother. The duo have been outspoken on the war in Gaza and called out other acts seen as left-wing who haven't been showing the same amount of public solidarity. The Glastonbury set Before their appearance at the festival, the duo highlighted it to fans watching at home, posting on Facebook: \"Turns out we're finally at a point where the BBC trust us on live tv! Watch us live either in the field or in the comfort of your own home!\" On stage, they performed in front of a screen bearing several statements, including one which claimed Israel's actions in Gaza amount to \"genocide\". Afterwards, as controversy over the set grew, they appeared to double down with statements shared on social media. Their comments have drawn criticism from the Israeli embassy and MPs - and now Glastonbury and Emily Eavis, too. Read moreFestival performers criticise political interference Bob Vylan performed on stage ahead of Kneecap, kept on the bill despite calls for them to be axed. Michael Eavis, the festival's founder, said before the event that people who did not like the politics could \"go somewhere else\". However, Bob Vylan's comments pushed things too far, a statement posted by the festival and Emily Eavis said on Sunday morning. \"As a festival, we stand against all forms of war and terrorism,\" the statement said. \"We will always believe in - and actively campaign for - hope, unity, peace and love.\" With almost 4,000 performances over the weekend, there will be artists and speakers appearing \"whose views we do not share\", they continued, \"and a performer's presence here should never be seen as a tacit endorsement of their opinions and beliefs\". But they described the statements by Bob Vylan as \"appalling\". \"Their chants very much crossed a line and we are urgently reminding everyone involved in the production of the festival that there is no place at Glastonbury for antisemitism, hate speech or incitement to violence.\""
    },
    {
        "title": "'No space for Bezos': Hundreds protest against billionaire's wedding on final day of Venice celebrations",
        "description": "Hundreds of people filled the streets and waterways of Venice to protest against the wedding of Jeff Bezos and Lauren Sanchez on the final day of their multimillion-dollar celebrations.",
        "url": "https://news.sky.com/story/no-space-for-bezos-hundreds-protest-against-billionaires-wedding-on-final-day-of-venice-celebrations-13389988",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-venice-bezos-wedding_6952947.jpg?20250629074649",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-29 06:32:00",
        "Headline": "Activists vowed to make the Amazon founder's nuptials a \"nightmare\" for both him, his bride and their guests.",
        "Content": "Hundreds of people filled the streets and waterways of Venice to protest against the wedding of Jeff Bezos and Lauren Sanchez on the final day of their multimillion-dollar celebrations. The Amazon founder, 61, and his bride, 55, got married in a private ceremony on the secluded Venetian island of San Giorgio on Friday. Throughout the weekend, activists came out against the wedding, which they say is adding to chronic problems of overtourism, climate change-induced flooding, and spiralling costs for locals. On Saturday, demonstrators were seen clutching placards that read: \"Kisses yes, Bezos no\", \"No Bezos, no war\", and \"118,000 Italian shops killed by Amazon\". Others gathered on the city's famous Rialto Bridge, where they draped a banner that read: \"No space for Bezos\". Read moreWhy protesters vowed to make wedding 'nightmare' The couple's nuptials, estimated to have cost between £34m and £41m, took over multiple venues throughout the city. The newlyweds stayed in the luxury Aman hotel on the Grand Canal, where rooms cost £3,400 a night, while the 200 guests took over other luxury accommodation, complete with their entourage and security teams. City officials have defended agreeing to host the wedding of the world's fourth richest man, citing its age-old tradition of welcoming popes, emperors, and ordinary visitors.  Bezos donated £850,000 (one million euros) to three environmental research organisations dedicated to preserving Venice, where the ailing infrastructure is under increasing pressure from cruise ships, extreme weather, and increasing numbers of tourists. But Venetian activist Flavio Cogo said: \"We want a free Venice, which is finally dedicated to its citizens. \"Those donations are just misery and only aimed at clearing Bezos's conscience.\"  Fellow protester Martin Vergnano said: \"We are here to continue ruining the plans of these rich people, who accumulate money by exploiting many other people… while the conditions of this city remain precarious.\" Protesters claimed they forced the relocation of the final party on Saturday from an undisclosed original location to the Arsenale, a former medieval shipyard. Bezos and Sanchez were seen blowing kisses to crowds and the press before their final celebrations. The list of VIP guests included the Kardashians, Orlando Bloom and Oprah Winfrey."
    }
]