[
    {
        "title": "US Supreme Court curbs injunctions that blocked Donald Trump's birthright citizenship plan",
        "description": "Donald Trump's administration will be allowed to take steps to implement its proposal to end automatic birthright citizenship in the US following a decision by the Supreme Court.",
        "url": "https://news.sky.com/story/us-supreme-court-curbs-injunctions-that-blocked-trumps-birthright-citizenship-plan-13389428",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-birthright-citizenship_6952023.jpg?20250627161001",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-27 14:27:00",
        "Headline": "The US president welcomed the ruling by posting on Truth Social that it was a \"giant win\". However, legal challenges can continue as the ruling only focuses on whether judges had the authority to put the policy on hold across the entire country.",
        "Content": " Donald Trump's administration will be allowed to take steps to implement its proposal to end automatic birthright citizenship in the US following a decision by the Supreme Court. Under the current rules, nearly anyone born on US territory has automatic citizenship rights - commonly known as \"birthright citizenship\". But in January, on his first day back in the White House, Trump signed an executive order aimed at ending that right. A series of lawsuits followed, with district courts issuing nationwide injunctions aiming to block the order from taking effect.  The Supreme Court on Friday voted 6-3 to allow the Trump administration to narrow the scope of nationwide injunctions imposed by judges so that they apply only to states, groups and individuals that sued. This means the birthright citizenship proposal can likely move forward at least in part in the states that challenged it, as well as those that did not. The US president responded with a post on Truth Social by welcoming the ruling as a \"giant win\". At a news conference at the White House, he said: \"In recent months, we've seen a handful of radical left judges effectively try to overrule the rightful powers of the president... to dictate the law for the entire nation... this was a colossal abuse of power.\" He went on to suggest the current birthright was being abused and had originally been designed for a different era, to give the descendants of slaves the right to citizenship. \"It wasn't meant for people trying to scam the system and come into the country on a vacation. It was meant for the babies of slaves. Hundreds of thousands of people are pouring into our country under birthright citizenship,\" he said. 👉 Follow Trump100 on your podcast app 👈  In a wide-ranging news conference, he also said he would consider bombing Iran again if they continued their nuclear programme and expects the country to open itself to international inspections. He also said he was preparing fresh trade tariffs for several countries and had secured mineral rights in the Democratic Republic of Congo, which is signing a peace deal with Rwanda at the White House to end years of fighting. Friday's Supreme Court decision was focused on cases filed in Maryland, Massachusetts and Washington state. The policy remains blocked for now in one additional state, New Hampshire, as a result of a separate lawsuit that is not before the Supreme Court. Mr Trump's plan has the backing of 21 other states. Friday's ruling was decided on a 6-3 vote following a divide on ideological lines, with conservatives in the majority and liberals in dissent. Mr Trump previously helped shape the makeup of the court with the appointment of three judges, ensuring a 6-3 conservative majority, though past rulings have still not always gone in his favour. It has long been widely accepted, including by legal scholars on the left and right in the US, that the Constitution's 14th Amendment confers automatic citizenship to almost anyone born in the United States. Mr Trump wants that restricted to only those with at least one parent who is a US citizen or permanent resident. Friday's ruling does not examine the legal merits of the policy, but only whether judges had the authority to put it on hold across the entire country. Read more from Sky News:British man charged in US with hackingTrump tariffs could cost Nike $1bnMan kicks customs dog at US airport As a result of the ruling, the proposal can potentially move forward nationwide, although individuals could still file their own lawsuits at the state level. Those currently challenging the policy could also still reinstate injunctions which are less broad in scope. The US president and his allies have been harshly critical of judges who have blocked aspects of his agenda, although it is not a new phenomenon for courts to impose nationwide injunctions. His administration has battled against judges who have issued nationwide injunctions in response to a bold and aggressive use of executive power to implement a controversial agenda, including ramping up deportations, downsizing federal agencies, targeting law firms and universities and firing thousands of federal employees."
    },
    {
        "title": "Trump's 'giant win' frees him up to push on with his agenda with fewer blocks and barriers",
        "description": "As the president himself said, this was a \"giant\" of a decision - a significant moment to end a week of whiplash-inducing news.",
        "url": "https://news.sky.com/story/trumps-giant-win-frees-him-up-to-push-on-with-his-agenda-with-fewer-blocks-and-barriers-13389591",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-supreme-court-capitol-hill_6952014.jpg?20250627155837",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-06-27 22:45:00",
        "Headline": "In simple terms, this ruling, from a Supreme Court weighted towards conservative judges, frees up the president to push on with his agenda, less opposed by the courts.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  As the president himself said, this was a \"giant\" of a decision - a significant moment to end a week of whiplash-inducing news. The decision by the US Supreme Court is a big win for President Donald Trump. By a majority of 6-3, the highest court in the land has ruled that federal judges have been overreaching in their authority by blocking or freezing the executive orders issued by the president. Over the last few months, a series of presidential actions by Trump have been blocked by injunctions issued by federal district judges. The federal judges, branded \"radical leftist lunatics\" by the president, have ruled on numerous individual cases, most involving immigration. They have then applied their rulings as nationwide injunctions - thus blocking the Trump administration's policies. \"It was a grave threat to democracy frankly,\" the president said at a hastily arranged news conference in the White House briefing room. \n                  Democratic Republic of Congo and Rwanda sign US-brokered peace deal - but doubts over success linger\n                 \n                  US Supreme Court curbs injunctions that blocked Donald Trump's birthright citizenship plan\n                 \n                  Nike says Trump tariffs could cost it $1bn\n                 \"Instead of merely ruling on the immediate case before them, these judges have attempted to dictate the law for the entire nation,\" he said. In simple terms, this ruling, from a Supreme Court weighted towards conservative judges, frees up the president to push on with his agenda, less opposed by the courts. \"This is such a big day…,\" the president said. \"It gives power back to people that should have it, including Congress, including the presidency, and it only takes bad power away from judges. It takes bad power, sick power and unfair power. \"And it's really going to be... a very monumental decision.\" The country's most senior member of the Democratic Party was to the point with his reaction to the ruling. Senate minority leader Chuck Schumer called it \"an unprecedented and terrifying step toward authoritarianism, a grave danger to our democracy, and a predictable move from this extremist MAGA court\". In a statement, Schumer wrote: \"By weakening the power of district courts to check the presidency, the Court is not defending the Constitution - it's defacing it. \"This ruling hands Donald Trump yet another green light in his crusade to unravel the foundations of American democracy.\"  Federal power in the US is, constitutionally, split equally between the three branches of government - the executive branch (the presidency), the legislative branch (Congress) and the judiciary (the Supreme Court and other federal courts). They are designed to ensure a separation of power and to ensure that no single branch becomes too powerful. This ruling was prompted by a case brought over an executive order issued by President Trump on his inauguration day to end birthright citizenship - that constitutional right to be an American citizen if born here. A federal judge froze the decision, ruling it to be in defiance of the 14th Amendment of the Constitution. The Supreme Court has deferred its judgement on this particular case, instead ruling more broadly on the powers of the federal judges. The court was divided along ideological lines, with conservatives in the majority and liberals in dissent. 👉 Follow Trump100 on your podcast app 👈 In her dissent, liberal Justice Ketanji Brown Jackson wrote: \"​​As I understand the concern, in this clash over the respective powers of two coordinate branches of Government, the majority sees a power grab - but not by a presumably lawless Executive choosing to act in a manner that flouts the plain text of the Constitution. \"Instead, to the majority, the power-hungry actors are... (wait for it)... the district courts.\" Another liberal Justice, Sonia Sotomayor, described the majority ruling by her fellow justices as: \"Nothing less than an open invitation for the government to bypass the constitution.\" Conservative Justice Amy Coney Barrett, who Trump appointed during his first term, shifting the balance of left-right power in the court, led this particular ruling. Writing for the majority, she said: \"When a court concludes that the executive branch has acted unlawfully, the answer is not for the court to exceed its power, too.\" The focus now for those who deplore this decision will be to apply 'class action' - to file lawsuits on behalf of a large group of people rather than applying a single case to the whole nation. There is no question though that the president and his team will feel significantly emboldened to push through their policy agenda with fewer blocks and barriers. Read more from Sky News:Democratic Republic of Congo and Rwanda sign US-brokered peace deal'Life-changing' drug for teenager who lost mother to genetic condition The ruling ends a giddy week for the president.  Last Saturday he ordered the US military to bomb Iran's nuclear sites. Within two days he had forced both Israel and Iran to a ceasefire. By mid-week he was in The Hague for the NATO summit where the alliance members had agreed to his defence spending demands. At an Oval Office event late on Friday, where he presided over the signing of a peace agreement between the Democratic Republic of Congo and Rwanda, he also hinted at a possible ceasefire \"within a week\" in Gaza. A truly consequential week seems set to be followed by another."
    },
    {
        "title": "Welfare concessions 'common sense', says PM - as he defends U-turn",
        "description": "Sir Keir Starmer said changes to his welfare bill \"strike the right balance\" after making concessions to his backbench MPs.",
        "url": "https://news.sky.com/story/welfare-concessions-common-sense-says-pm-as-he-defends-u-turn-13389403",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-commerce_6951986.jpg?20250627153612",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-27 13:36:00",
        "Headline": "The PM has defended his climbdown on welfare after more than 100 of his own MPs were poised to vote against planned disability cuts. ",
        "Content": " Sir Keir Starmer said changes to his welfare bill \"strike the right balance\" after making concessions to his backbench MPs. The prime minister described the U-turn as \"common sense\" and said it means \"we can now get on with the job\". Politics Live: Starmer defends U-turn Sir Keir faced a significant rebellion over plans to cut sickness and disability benefits as part of a package he said would shave £5bn off the welfare bill and get more people into work. Speaking to reporters on Friday, he stood by his position that the welfare system needs reform as \"it doesn't work, and it traps people\". He added: \"We need to get it right. That's why we've been talking to colleagues and having a constructive discussion. \"We've now arrived at a package that delivers on the principles with some adjustments, and that's the right reform, and I'm really pleased now that we're able to take this forward. \"For me, getting that package adjusted in that way is the right thing to do, it means it's the right balance, it's common sense that we can now get on with it.\" The concessions include exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Analysis: Welfare bill U-turn a humiliating blow for Starmer  More money will also be front-loaded into helping people find jobs, though it is not clear how much beyond the £1bn already announced. The changes came after 127 Labour MPs signed an amendment calling for the cuts to be delayed and consulted on with disabled people. Rebels feared the reforms wouldn't actually help people find work while pushing thousands of disabled people and children into poverty, as per the government's own impact assessment.  Political correspondent It has been a painful week to watch. A U-turn in slow motion, culminating in a midnight climbdown as Number 10 agreed to concede to defiant MPs on Thursday night. The concessions are considerable. They mean, among other compromises, that existing claimants of personal independence payments (PIP) and the health aspect of Universal Credit will be protected from welfare reforms. Some MPs, like Diane Abbott and Nadia Whittome, remain unconvinced, but they were never high on the list of rebels the government expected to persuade. Ministers now hope that with the backing of MPs like Dame Meg Hillier, the chair of the Treasury Select Committee, the bill will pass the Commons. Their problems won't end there, though. Read Ali's full analysis here The discontent threatened to derail the Universal Credit and Personal Independence Payment Bill when it comes before the Commons for a vote on Tuesday, on the week that marks a year of Starmer in government. Asked what he would do about a \"hole\" in the public finances that the changes are said to leave, Sir Keir said the funding will be set out in the autumn budget \"in the usual way\". The concessions on PIP alone will protect an estimated 370,000 people currently receiving the allowance who were set to lose out following reassessment. Economists at the Institute for Fiscal Studies and the Resolution Foundation have both suggested that the changes could reduce savings intended in the original package by up to £3bn. Chancellor Rachel Reeves is also under pressure to find money to pay for the U-turn on cuts to winter fuel, which followed a drubbing at the local elections in May.  Asked about the series of U-turns, Work and Pensions Secretary Liz Kendall earlier said: \"Sometimes there's strength in listening. \"I really believe that to be the case, that you end up in the right position when you talk to all of those with knowledge and experience and actually, if you want decisions to be the right ones and to last for generations to come, I believe that's how you make the right changes.\" However, she would not guarantee the bill will pass next week. Some 83 Labour MPs would need to rebel for the government to be defeated.  Last night Dame Meg Hillier, one of the leading rebel voices, hailed the concessions as \"massive changes\" to protect vulnerable people and involve disabled people in the design of future reforms. However, not all the rebels have been satisfied with the changes, with several suggesting they would create a \"two-tier system\". Sky News is aware of at least 20 MPs who currently intend to still vote against. Many others are undecided. The concessions came after Downing Street publicly stuck to its guns while engaging in a frantic ring-around to get rebels onside, which further angered MPs.  Many have called for a reset in relations with Downing Street, as the fallout from the rebellion threatens to cause lasting damage. Conservative leader Kemi Badenoch criticised the U-turn, saying the government's failure to make \"minor savings\" on welfare showed they were unable to deal with major issues."
    },
    {
        "title": "Body found in search for woman last seen in Coventry in May - as man charged with murder",
        "description": "A body has been found in the search for a woman who was last seen in Coventry - as a man has been charged with murder.",
        "url": "https://news.sky.com/story/body-found-in-search-for-woman-last-seen-in-coventry-in-may-as-man-charged-with-murder-13389552",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-reanne-coulson_6951366.jpg?20250626163108",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-27 19:16:00",
        "Headline": "Formal identification is yet to take place, but the family of Reanne Coulson have been informed.",
        "Content": "A body has been found in the search for a woman who was last seen in Coventry - as a man has been charged with murder. Reanne Coulson, 34, went missing in May and concerns were raised by her family after she failed to make contact with them on her birthday on 17 June. Officers searching for Ms Coulson found a body in Binley Woods on Friday afternoon, West Midlands Police said. Formal identification is yet to take place, but Ms Coulson's family has been informed, officers added. Mohammed Durnion was arrested as part of the investigation into her disappearance. The 42-year-old has now been charged with murder. A second man, Adam Moore, who's 38 and from the city, has been charged with assisting an offender. Both will appear before Coventry Magistrates' Court on Saturday. Detective Superintendent Jim Munro, from the force's major crime unit, said their thoughts remain with Ms Coulson's family \"at this deeply distressing time\". \"While formal identification still needs to take place, we do believe it is Reanne. We've charged a man with murder, and another for assisting an offender, but our inquiries to establish exactly what happened and why are ongoing,\" he said. Read more from Sky News:Sword killer jailed for schoolboy murderFour arrests after RAF aircraft vandalisedAnalysis: PM's most damaging U-turn yet Ms Coulson's older brother Ashley told police he wanted to pass on his thanks to the public for their help but also asked that the family are left alone to grieve. Specialist search teams, including police dogs, have been searching Binley Woods as well as other areas of land in neighbouring Warwickshire this week. Ms Coulson was last seen leaving a food bank on Raglan Street in Coventry late in the evening of 21 May. Her twin sister Kirsten also made a direct appeal to people who were in nearby Vauxhall Street on the same night, asking them to come forward if they had information about her disappearance."
    },
    {
        "title": "Sean 'Diddy' Combs's 'private sex life' turned into 'crime scene', defence says in closing argument",
        "description": "Sean \"Diddy\" Combs is facing a \"fake trial\" in which his unusual sexual preferences have been unfairly criminalised and his \"private sex life\" turned into a \"crime scene\", his defence team has argued in the final day of closing arguments.",
        "url": "https://news.sky.com/story/sean-diddy-combss-private-sex-life-turned-into-crime-scene-defence-says-in-closing-argument-13389592",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sean-diddy-combs-diddy_6952264.jpg?20250627233425",
        "type": "Home",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "On the final day of closing arguments, the defence accused the prosecution of \"badly exaggerating\" the evidence, saying it was confusing threesomes with racketeering.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Sean \"Diddy\" Combs is facing a \"fake trial\" in which his unusual sexual preferences have been unfairly criminalised and his \"private sex life\" turned into a \"crime scene\", his defence team has argued in the final day of closing arguments. At the end of week seven in the sex-trafficking trial, Combs's lead counsel, Marc Agnifilo, told the court Combs was the victim of an overzealous prosecution, who had portrayed his \"swinger\" lifestyle as a racketeering conspiracy. Combs is charged with one count of racketeering conspiracy, two charges of sex trafficking, and two charges of transportation to engage in prostitution. He has pleaded not guilty to all charges and has strenuously denied all allegations of sexual abuse. If found guilty, he could face being put behind bars for life. Diddy trial: As it happened Frequently adopting a sarcastic tone, Agnifilo mocked the government's case against Combs, belittling the agents who seized hundreds of bottles of Astroglide lubricant and baby oil at his properties last year. Commenting that America's streets were now \"safe from Astroglide\", he went on, \"Way to go, fellas\", before adding, \"you do you\". \n                  Prosecutors give closing arguments in Sean 'Diddy' Combs trial\n                 \n                  Sean 'Diddy' Combs praises judge and chooses not to testify as trial draws to a close\n                 \n                  Diddy trial latest: Defence lawyer mocks case in closing argument - and says charges have been 'badly exaggerated'\n                 He said prosecutors had \"badly exaggerated\" the evidence against Combs, presenting \"threesomes as racketeering\", arguing that he is not guilty of racketeering conspiracy and sex trafficking. The defence also highlighted the prosecution's decision to indict Combs on a racketeering conspiracy charge alone, flagging that no alleged co-conspirators have been indicted alongside him. The defence's closing arguments lasted for just over four hours, with members of Combs's family, including six of his children and his mother, watching on in the public gallery. Agnifilo said Combs has \"taken care of people\", including Jane, a former girlfriend who testified under a pseudonym, paying for her rent and for her legal representation. The defence lawyer said: \"I don't know what Jane is doing today, but she's doing it in a house he's paying for.\" He went on: \"This isn't about crime. It's about money. This is about money.\" Presenting the trial as a zero-sum game, he described his former girlfriend of almost 11 years Cassie Ventura as the \"winner in this whole thing\", noting that she settled her civil case with Combs for $20m (£14m) in November 2023, as well as a $10m (£7.3m) from the InterContinental Hotel. Cassie and Jane both gave evidence during the trial that they were coerced repeatedly by Combs to perform in drug-fuelled, days-long sex marathons with male sex workers, while Combs watched, directed, masturbated and sometimes filmed the encounters. But the defence accused prosecutors of having invaded Combs's bedroom and his most intimate personal affairs. Agnifilo asked: \"Where's the crime scene? It's [Combs's] sex life.\" Continuing his line of sarcastic quips, he joked, \"We need a bigger roll of crime scene tape\", referencing a line from the classic movie Jaws. Agnifilio's sarcasm irked the prosecution, who later complained to the judge that he was using \"improper arguments\". Read more:Everything you need to know about the trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony The defence characterised Combs's relationship with Cassie as \"a great modern love story\", going on to describe her as a \"gangster\" for cheating on him with rapper Kid Cudi. They also characterised the \"freak offs\" as \"beautiful\", saying the videos showed \"everyone smiling\", eating and listening to music, and commenting that Combs was \"not the only man in America making homemade porn\". The defence admitted Combs was a domestic abuser, but said such behaviour did not justify the grave charges he faces. Agnifilo advised the jury to \"Call this as you see it,\" asking them to \"acquit Sean Combs of all the counts\" and \"return him to his family\", who he said has been waiting for him. Combs, who has been in a New York jail since his arrest in September last year, did not give evidence during the trial. Following the defence's closing argument, assistant US attorney Maurene Comey delivered a rebuttal summation in which she said the defence's argument that Cassie, Jane and Mia, a former employee who also testified under a pseudonym, all \"wanted sex\" was a lie, telling the court none of the women had reason to speak anything other than the truth. She also said the \"freak off\" videos tell only \"part of the story\". Comey said Combs had spent the last 20 years believing himself to be \"above the law\", seeing himself as \"untouchable\" and \"a god among men\". She said his impunity would end now in this courtroom, before urging the jury to \"find him guilty\" and \"hold him accountable\". On Monday, the judge will read the law to the jury, after which deliberations will begin. To convict Combs, the 12 jurors must vote unanimously."
    },
    {
        "title": "Democratic Republic of Congo and Rwanda sign US-brokered peace deal - but doubts over success linger",
        "description": "The Democratic Republic of Congo (DRC) and Rwanda have signed a peace deal which Donald Trump said he brokered - resulting in the US getting \"a lot\" of mineral rights in the process.",
        "url": "https://news.sky.com/story/democratic-republic-of-congo-and-rwanda-sign-us-brokered-peace-deal-but-doubts-over-success-linger-13389580",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-drc-congo-fm_6952272.jpg?20250628005534",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-27 21:22:00",
        "Headline": "US President Donald Trump has said he was able to broker a deal for \"one of the worst wars anyone's ever seen\", while also saying the US was getting \"a lot of the mineral rights from Congo\".",
        "Content": " The Democratic Republic of Congo (DRC) and Rwanda have signed a peace deal which Donald Trump said he brokered - resulting in the US getting \"a lot\" of mineral rights in the process. The deal has been touted as an important step towards ending the decades-long conflict in eastern DRC which has caused the deaths of six million people. US secretary of state Marco Rubio called it \"an important moment after 30 years of war\". The Congo-Rwanda conflict explained Earlier on Friday, President Trump said he was able to broker a deal for \"one of the worst wars anyone's ever seen\". \"I was able to get them together and sell it,\" Mr Trump said. \"And not only that, we're getting for the United States a lot of the mineral rights from Congo.\" 'Great deal of uncertainty' \n                  At least 33 die in floods in Democratic Republic of Congo\n                 \n                  What is Kindoki? This innocent man was accused of it and blamed for deaths of mother and baby sister\n                 \n                  Mystery illness kills more than 50 people in Democratic Republic of Congo\n                 The Rwanda-backed M23 rebel group, the most prominent armed group in the conflict, has suggested that the agreement won't be binding for them. It hasn't been directly involved in the planned peace deal. DRC foreign minister Therese Kayikwamba Wagner invoked the millions of victims of the conflict in signing the agreement with Rwandan foreign minister Olivier Nduhungirehe. The agreement, signed by the foreign ministers during a ceremony with Mr Rubio in Washington, pledges to implement a 2024 deal that would see Rwandan troops withdraw from eastern DRC within 90 days, according to a copy seen by Reuters. Read more from Sky News: Diddy's defence lawyer mocks case in closing argumentNike says Trump tariffs could cost it $1bn \"Some wounds will heal, but they will never fully disappear,\" Ms Wagner said. \"Those who have suffered the most are watching. They are expecting this agreement to be respected, and we cannot fail them.\" Mr Nduhungirehe noted the \"great deal of uncertainty\" because previous agreements were not put in place. \"There is no doubt that the road ahead will not be easy,\" he said. \"But with the continued support of the United States and other partners, we believe that a turning point has been reached.\""
    },
    {
        "title": "Four people arrested after aircraft vandalised at RAF Brize Norton",
        "description": "Two men and a woman have been arrested on suspicion of a terror offence after two aircraft were damaged at RAF Brize Norton in Oxfordshire, police have said.",
        "url": "https://news.sky.com/story/four-people-arrested-after-aircraft-vandalised-at-raf-brize-norton-13389313",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brize-plane_6946806.jpg?20250627113358",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-27 10:13:00",
        "Headline": "Police said the arrests on Thursday in Newbury, Berkshire, and in London, \"are in connection with an incident in the early hours of [last] Friday during which damage was caused to two aircraft at RAF Brize Norton\".",
        "Content": " Two men and a woman have been arrested on suspicion of a terror offence after two aircraft were damaged at RAF Brize Norton in Oxfordshire, police have said. A second woman has also been arrested on suspicion of assisting an offender. Counter Terrorism Policing South East said in a statement: \"A 29-year-old woman of no fixed abode, and two men; aged 36 and 24, both from London, were arrested on suspicion of the commission, preparation or instigation of acts of terrorism, contrary to Section 41 of the Terrorism Act 2000. \"A 41-year-old woman, of no fixed abode, was arrested on suspicion of assisting an offender.\" Police said the arrests on Thursday in Newbury in Berkshire, and in London, \"are in connection with an incident in the early hours of [last] Friday during which damage was caused to two aircraft at RAF Brize Norton\". The four people are currently in custody while enquiries are ongoing, police added. Palestine Action said the arrests \"further demonstrate that proscription is not about enabling prosecutions under terrorism laws - it's about cracking down on non-violent protests which disrupt the flow of arms to Israel during its genocide in Palestine\". \n                  'Absolutely staggering' security breach at RAF base - as activists break in and vandalise aircraft\n                 \n                  'Atrocity not accident': Families of pedestrians killed by drivers running red lights speak out\n                 \n                  Two men jailed for their roles in theft of £4.75m gold toilet from Blenheim Palace\n                 The group posted a video online claiming it was behind the vandalism at the Oxfordshire airbase last Friday, saying activists had damaged two military planes at the base. Palestine Action - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\". Repurposed fire extinguishers were used to spray red paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. \"Red paint, symbolising Palestinian bloodshed was also sprayed across the runway and a Palestine flag was left on the scene,\" a statement by the group said. Brize Norton is the largest RAF station, with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. A security review was launched across the \"whole defence estate\" following the breach, which was condemned as \"absolutely staggering\" by Ben Obese-Jecty, a Tory MP and former Army officer. Sir Keir Starmer condemned the \"act of vandalism\" as \"disgraceful\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" Home Secretary Yvette Cooper said on Monday that Palestine Action will be proscribed as a terrorist organisation following the breach at RAF Brize Norton. She said a draft proscription order will be laid in parliament next week, and if passed, it will make it illegal to be a member of, or invite support for, Palestine Action.  Proscription can lead to prison sentences of up to 14 years for some offences, although some breaches are punishable with fines. Read more from Sky News:What does proscription mean?Palestine Action supporters defiant as group faces banThe 'enemy within' or non-violent protesters? Saeed Taji Farouky, a member of the group, told Sky News the proscription was \"completely irrational\" and \"without precedent\". He branded it a \"knee-jerk reaction from the government\" because the group \"was able to humiliate them and show serious flaws in the defences of the RAF base\"."
    },
    {
        "title": "Sunburn isn't just red skin - here's what's happening underneath the burn",
        "description": "The government is warning that the NHS will be under even more pressure this weekend as temperatures soar, so looking after yourself in the sunshine is crucial.",
        "url": "https://news.sky.com/story/sunburn-isnt-just-red-skin-heres-whats-happening-underneath-the-burn-13389368",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sunburn-dna_6951865.jpg?20250627134017",
        "type": "Home",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "Since the early 1990s, the number of skin cancer cases in the UK has more than doubled. Last year, the number of cases was predicted to hit an all-time high of 20,800, according to Cancer Research UK.",
        "Content": "\n          Science and technology reporter\n       The government is warning that the NHS will be under even more pressure this weekend as temperatures soar, so looking after yourself in the sunshine is crucial. Read more: Amber heat health alert issued for England But how much do you know about the science behind sunburn… and how to prevent it? What is sunburn? While we all know what sunburned skin looks like - red and sore - it might not be so clear what is happening underneath the skin. \"Essentially, it's inflammation,\" said Dr Rachel Abbott, a consultant dermatologist who specialises in skin cancer for the Cardiff and Vale University health board. \"It's triggered by ultraviolet radiation, primarily UVB but also by UVA.\" \n                  Weight loss and diabetes jabs linked to potentially fatal side effect\n                 \n                  500 families in Oxford call for maternity unit to be investigated\n                 \n                  National investigation into NHS maternity services launched after families 'gaslit'\n                 Ultraviolet radiation is carcinogenic and when it is allowed to penetrate the skin, it triggers an inflammatory reaction, said Dr Abbott. Histamines - chemicals produced by the body's immune system - and prostaglandins - compounds that help the body deal with injuries and illness - are released as your body begins reacting to the damage.  Although the inflamed, red, itchy skin will fade, those carcinogens will do permanent damage to your DNA, according to Dr Abbott. \"The redness and pain can be managed symptomatically, but that DNA damage is permanent,\" she said. \"We've all got DNA repair mechanisms in our bodies. But this is why we're seeing such a massive increase in skin cancer, because [as we get older], the battle between the DNA damage and the skin cells becomes more than the immune system can cope with.\" Since the early 1990s, the number of skin cancer cases in Britain has more than doubled and last year, the number of cases was predicted to hit an all-time high of 20,800, according to Cancer Research UK. The cancer charity partially attributed the rise in cases to older groups of people knowing \"less about the dangers of tanning in their youth\", who \"may have taken advantage of the cheap package holiday boom from the 1960s\". Read more from science and tech:Major pornography sites to introduce 'robust' age verificationDoctors using unapproved AI to record patient meetingsChildren using 'nudifying' apps may not know they're breaking the law This would lead to increased sun exposure and more damaged DNA, increasing the risk of skin cancer further down the line. The 'most effective' protection (and it isn't suncream) There is currently no conclusive treatment to deal with the DNA damage caused by sunburn - although Dr Abbott said there is \"exciting\" work being done in that area. Instead, the way to stop yourself from sustaining long-term damage is to protect yourself from UV rays. \"A lot of people associate temperature with the heat of the sun, whereas actually it's the UV index that's the critical thing. And that usually peaks around midday,\" said Dr Abbott.  Contrary to what some may think (or hope), suncream should be a last resort. Shade \"is the most effective thing\", she said, but if you have to be out in the sunshine, \"obviously we recommend hats, clothing and then sunscreen\". \"It is a last resort for those areas that you can't cover up with clothing and hats, and sunglasses.\" The cancer care charity Macmillan recommends a suncream with a sun protection factor (SPF) of 50, or at least 30, and to reapply it regularly. \"There is no such thing as a safe suntan,\" advises the charity. It also recommends using around six to eight teaspoons of suncream for an adult - one teaspoon for each limb, one for your chest, one for your back and one for your head and neck."
    },
    {
        "title": "Four people arrested after aircraft vandalised at RAF Brize Norton",
        "description": "Two men and a woman have been arrested on suspicion of a terror offence after two aircraft were damaged at RAF Brize Norton in Oxfordshire, police have said.",
        "url": "https://news.sky.com/story/four-people-arrested-after-aircraft-vandalised-at-raf-brize-norton-13389313",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-brize-plane_6946806.jpg?20250627113358",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-27 10:13:00",
        "Headline": "Police said the arrests on Thursday in Newbury, Berkshire, and in London, \"are in connection with an incident in the early hours of [last] Friday during which damage was caused to two aircraft at RAF Brize Norton\".",
        "Content": " Two men and a woman have been arrested on suspicion of a terror offence after two aircraft were damaged at RAF Brize Norton in Oxfordshire, police have said. A second woman has also been arrested on suspicion of assisting an offender. Counter Terrorism Policing South East said in a statement: \"A 29-year-old woman of no fixed abode, and two men; aged 36 and 24, both from London, were arrested on suspicion of the commission, preparation or instigation of acts of terrorism, contrary to Section 41 of the Terrorism Act 2000. \"A 41-year-old woman, of no fixed abode, was arrested on suspicion of assisting an offender.\" Police said the arrests on Thursday in Newbury in Berkshire, and in London, \"are in connection with an incident in the early hours of [last] Friday during which damage was caused to two aircraft at RAF Brize Norton\". The four people are currently in custody while enquiries are ongoing, police added. Palestine Action said the arrests \"further demonstrate that proscription is not about enabling prosecutions under terrorism laws - it's about cracking down on non-violent protests which disrupt the flow of arms to Israel during its genocide in Palestine\". \n                  'Absolutely staggering' security breach at RAF base - as activists break in and vandalise aircraft\n                 \n                  'Atrocity not accident': Families of pedestrians killed by drivers running red lights speak out\n                 \n                  Two men jailed for their roles in theft of £4.75m gold toilet from Blenheim Palace\n                 The group posted a video online claiming it was behind the vandalism at the Oxfordshire airbase last Friday, saying activists had damaged two military planes at the base. Palestine Action - which focuses its campaigns on multinational arms dealers and has previously targeted corporate banks - said two activists \"broke into the largest air force base in Britain and used electric scooters to swiftly manoeuvre towards the planes\". Repurposed fire extinguishers were used to spray red paint into the turbine engines of two Airbus Voyagers, while further damage was made using crowbars. \"Red paint, symbolising Palestinian bloodshed was also sprayed across the runway and a Palestine flag was left on the scene,\" a statement by the group said. Brize Norton is the largest RAF station, with approximately 5,800 service personnel, 300 civilian staff and 1,200 contractors. A security review was launched across the \"whole defence estate\" following the breach, which was condemned as \"absolutely staggering\" by Ben Obese-Jecty, a Tory MP and former Army officer. Sir Keir Starmer condemned the \"act of vandalism\" as \"disgraceful\", adding: \"Our Armed Forces represent the very best of Britain and put their lives on the line for us every day. It is our responsibility to support those who defend us.\" Home Secretary Yvette Cooper said on Monday that Palestine Action will be proscribed as a terrorist organisation following the breach at RAF Brize Norton. She said a draft proscription order will be laid in parliament next week, and if passed, it will make it illegal to be a member of, or invite support for, Palestine Action.  Proscription can lead to prison sentences of up to 14 years for some offences, although some breaches are punishable with fines. Read more from Sky News:What does proscription mean?Palestine Action supporters defiant as group faces banThe 'enemy within' or non-violent protesters? Saeed Taji Farouky, a member of the group, told Sky News the proscription was \"completely irrational\" and \"without precedent\". He branded it a \"knee-jerk reaction from the government\" because the group \"was able to humiliate them and show serious flaws in the defences of the RAF base\"."
    },
    {
        "title": "Body found in search for woman last seen in Coventry in May - as man charged with murder",
        "description": "A body has been found in the search for a woman who was last seen in Coventry - as a man has been charged with murder.",
        "url": "https://news.sky.com/story/body-found-in-search-for-woman-last-seen-in-coventry-in-may-as-man-charged-with-murder-13389552",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-reanne-coulson_6951366.jpg?20250626163108",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-27 19:16:00",
        "Headline": "Formal identification is yet to take place, but the family of Reanne Coulson have been informed.",
        "Content": "A body has been found in the search for a woman who was last seen in Coventry - as a man has been charged with murder. Reanne Coulson, 34, went missing in May and concerns were raised by her family after she failed to make contact with them on her birthday on 17 June. Officers searching for Ms Coulson found a body in Binley Woods on Friday afternoon, West Midlands Police said. Formal identification is yet to take place, but Ms Coulson's family has been informed, officers added. Mohammed Durnion was arrested as part of the investigation into her disappearance. The 42-year-old has now been charged with murder. A second man, Adam Moore, who's 38 and from the city, has been charged with assisting an offender. Both will appear before Coventry Magistrates' Court on Saturday. Detective Superintendent Jim Munro, from the force's major crime unit, said their thoughts remain with Ms Coulson's family \"at this deeply distressing time\". \"While formal identification still needs to take place, we do believe it is Reanne. We've charged a man with murder, and another for assisting an offender, but our inquiries to establish exactly what happened and why are ongoing,\" he said. Read more from Sky News:Sword killer jailed for schoolboy murderFour arrests after RAF aircraft vandalisedAnalysis: PM's most damaging U-turn yet Ms Coulson's older brother Ashley told police he wanted to pass on his thanks to the public for their help but also asked that the family are left alone to grieve. Specialist search teams, including police dogs, have been searching Binley Woods as well as other areas of land in neighbouring Warwickshire this week. Ms Coulson was last seen leaving a food bank on Raglan Street in Coventry late in the evening of 21 May. Her twin sister Kirsten also made a direct appeal to people who were in nearby Vauxhall Street on the same night, asking them to come forward if they had information about her disappearance."
    },
    {
        "title": "Welfare concessions 'common sense', says PM - as he defends U-turn",
        "description": "Sir Keir Starmer said changes to his welfare bill \"strike the right balance\" after making concessions to his backbench MPs.",
        "url": "https://news.sky.com/story/welfare-concessions-common-sense-says-pm-as-he-defends-u-turn-13389403",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-commerce_6951986.jpg?20250627153612",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-27 13:36:00",
        "Headline": "The PM has defended his climbdown on welfare after more than 100 of his own MPs were poised to vote against planned disability cuts. ",
        "Content": " Sir Keir Starmer said changes to his welfare bill \"strike the right balance\" after making concessions to his backbench MPs. The prime minister described the U-turn as \"common sense\" and said it means \"we can now get on with the job\". Politics Live: Starmer defends U-turn Sir Keir faced a significant rebellion over plans to cut sickness and disability benefits as part of a package he said would shave £5bn off the welfare bill and get more people into work. Speaking to reporters on Friday, he stood by his position that the welfare system needs reform as \"it doesn't work, and it traps people\". He added: \"We need to get it right. That's why we've been talking to colleagues and having a constructive discussion. \"We've now arrived at a package that delivers on the principles with some adjustments, and that's the right reform, and I'm really pleased now that we're able to take this forward. \"For me, getting that package adjusted in that way is the right thing to do, it means it's the right balance, it's common sense that we can now get on with it.\" The concessions include exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Analysis: Welfare bill U-turn a humiliating blow for Starmer  More money will also be front-loaded into helping people find jobs, though it is not clear how much beyond the £1bn already announced. The changes came after 127 Labour MPs signed an amendment calling for the cuts to be delayed and consulted on with disabled people. Rebels feared the reforms wouldn't actually help people find work while pushing thousands of disabled people and children into poverty, as per the government's own impact assessment.  Political correspondent It has been a painful week to watch. A U-turn in slow motion, culminating in a midnight climbdown as Number 10 agreed to concede to defiant MPs on Thursday night. The concessions are considerable. They mean, among other compromises, that existing claimants of personal independence payments (PIP) and the health aspect of Universal Credit will be protected from welfare reforms. Some MPs, like Diane Abbott and Nadia Whittome, remain unconvinced, but they were never high on the list of rebels the government expected to persuade. Ministers now hope that with the backing of MPs like Dame Meg Hillier, the chair of the Treasury Select Committee, the bill will pass the Commons. Their problems won't end there, though. Read Ali's full analysis here The discontent threatened to derail the Universal Credit and Personal Independence Payment Bill when it comes before the Commons for a vote on Tuesday, on the week that marks a year of Starmer in government. Asked what he would do about a \"hole\" in the public finances that the changes are said to leave, Sir Keir said the funding will be set out in the autumn budget \"in the usual way\". The concessions on PIP alone will protect an estimated 370,000 people currently receiving the allowance who were set to lose out following reassessment. Economists at the Institute for Fiscal Studies and the Resolution Foundation have both suggested that the changes could reduce savings intended in the original package by up to £3bn. Chancellor Rachel Reeves is also under pressure to find money to pay for the U-turn on cuts to winter fuel, which followed a drubbing at the local elections in May.  Asked about the series of U-turns, Work and Pensions Secretary Liz Kendall earlier said: \"Sometimes there's strength in listening. \"I really believe that to be the case, that you end up in the right position when you talk to all of those with knowledge and experience and actually, if you want decisions to be the right ones and to last for generations to come, I believe that's how you make the right changes.\" However, she would not guarantee the bill will pass next week. Some 83 Labour MPs would need to rebel for the government to be defeated.  Last night Dame Meg Hillier, one of the leading rebel voices, hailed the concessions as \"massive changes\" to protect vulnerable people and involve disabled people in the design of future reforms. However, not all the rebels have been satisfied with the changes, with several suggesting they would create a \"two-tier system\". Sky News is aware of at least 20 MPs who currently intend to still vote against. Many others are undecided. The concessions came after Downing Street publicly stuck to its guns while engaging in a frantic ring-around to get rebels onside, which further angered MPs.  Many have called for a reset in relations with Downing Street, as the fallout from the rebellion threatens to cause lasting damage. Conservative leader Kemi Badenoch criticised the U-turn, saying the government's failure to make \"minor savings\" on welfare showed they were unable to deal with major issues."
    },
    {
        "title": "Sunburn isn't just red skin - here's what's happening underneath the burn",
        "description": "The government is warning that the NHS will be under even more pressure this weekend as temperatures soar, so looking after yourself in the sunshine is crucial.",
        "url": "https://news.sky.com/story/sunburn-isnt-just-red-skin-heres-whats-happening-underneath-the-burn-13389368",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sunburn-dna_6951865.jpg?20250627134017",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "Since the early 1990s, the number of skin cancer cases in the UK has more than doubled. Last year, the number of cases was predicted to hit an all-time high of 20,800, according to Cancer Research UK.",
        "Content": "\n          Science and technology reporter\n       The government is warning that the NHS will be under even more pressure this weekend as temperatures soar, so looking after yourself in the sunshine is crucial. Read more: Amber heat health alert issued for England But how much do you know about the science behind sunburn… and how to prevent it? What is sunburn? While we all know what sunburned skin looks like - red and sore - it might not be so clear what is happening underneath the skin. \"Essentially, it's inflammation,\" said Dr Rachel Abbott, a consultant dermatologist who specialises in skin cancer for the Cardiff and Vale University health board. \"It's triggered by ultraviolet radiation, primarily UVB but also by UVA.\" \n                  Weight loss and diabetes jabs linked to potentially fatal side effect\n                 \n                  500 families in Oxford call for maternity unit to be investigated\n                 \n                  National investigation into NHS maternity services launched after families 'gaslit'\n                 Ultraviolet radiation is carcinogenic and when it is allowed to penetrate the skin, it triggers an inflammatory reaction, said Dr Abbott. Histamines - chemicals produced by the body's immune system - and prostaglandins - compounds that help the body deal with injuries and illness - are released as your body begins reacting to the damage.  Although the inflamed, red, itchy skin will fade, those carcinogens will do permanent damage to your DNA, according to Dr Abbott. \"The redness and pain can be managed symptomatically, but that DNA damage is permanent,\" she said. \"We've all got DNA repair mechanisms in our bodies. But this is why we're seeing such a massive increase in skin cancer, because [as we get older], the battle between the DNA damage and the skin cells becomes more than the immune system can cope with.\" Since the early 1990s, the number of skin cancer cases in Britain has more than doubled and last year, the number of cases was predicted to hit an all-time high of 20,800, according to Cancer Research UK. The cancer charity partially attributed the rise in cases to older groups of people knowing \"less about the dangers of tanning in their youth\", who \"may have taken advantage of the cheap package holiday boom from the 1960s\". Read more from science and tech:Major pornography sites to introduce 'robust' age verificationDoctors using unapproved AI to record patient meetingsChildren using 'nudifying' apps may not know they're breaking the law This would lead to increased sun exposure and more damaged DNA, increasing the risk of skin cancer further down the line. The 'most effective' protection (and it isn't suncream) There is currently no conclusive treatment to deal with the DNA damage caused by sunburn - although Dr Abbott said there is \"exciting\" work being done in that area. Instead, the way to stop yourself from sustaining long-term damage is to protect yourself from UV rays. \"A lot of people associate temperature with the heat of the sun, whereas actually it's the UV index that's the critical thing. And that usually peaks around midday,\" said Dr Abbott.  Contrary to what some may think (or hope), suncream should be a last resort. Shade \"is the most effective thing\", she said, but if you have to be out in the sunshine, \"obviously we recommend hats, clothing and then sunscreen\". \"It is a last resort for those areas that you can't cover up with clothing and hats, and sunglasses.\" The cancer care charity Macmillan recommends a suncream with a sun protection factor (SPF) of 50, or at least 30, and to reapply it regularly. \"There is no such thing as a safe suntan,\" advises the charity. It also recommends using around six to eight teaspoons of suncream for an adult - one teaspoon for each limb, one for your chest, one for your back and one for your head and neck."
    },
    {
        "title": "This has been Starmer's most damaging U-turn yet - but the bigger cost is the political one",
        "description": "It has been a painful week to watch.",
        "url": "https://news.sky.com/story/this-week-will-haunt-the-prime-minister-after-his-most-damaging-u-turn-yet-13389532",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sir-keir-starmer-prime-minister_6952214.jpg?20250627205345",
        "type": "UK",
        "Author": "Ali Fortescue",
        "Date Published": "2025-06-27 18:03:00",
        "Headline": "Sir Keir Starmer's concessions to his backbenchers are estimated to cost £3bn of the £5bn the chancellor hoped to save from welfare reforms. The bigger cost, though, is the political one.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  It has been a painful week to watch. A U-turn in slow motion, culminating in a midnight climbdown as Number 10 agreed to concede to defiant MPs on Thursday night. The concessions are considerable. They mean, among other compromises, that existing claimants of personal independence payments (PIP) and the health aspect of Universal Credit will be protected from welfare reforms. 👉 Follow Electoral Dysfunction on your podcast app 👈 Some MPs, like Diane Abbott and Nadia Whittome, remain unconvinced, but they were never high on the list of rebels the government expected to persuade. Ministers now hope that with the backing of MPs like Dame Meg Hillier, the chair of the Treasury Select Committee, the bill will pass the Commons. Their problems won't end there, though. \n                  Prime Minister Sir Keir Starmer set to warn of 'backroom stitch up' between parties in Wales\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 \n                  Reform would win most seats in general election, in-depth poll suggests\n                 Firstly, there is the question of money. The Resolution Foundation estimates the concessions will cost £3bn of the £5bn the chancellor hoped to save from the welfare reforms. The prime minister's spokesperson says the changes will be fully funded in the budget and there will be no permanent increase in borrowing. They won't comment on any potential tax rises to plug the gap in Rachel Reeves's finances. The bigger cost, though, is the political one. A year ago, when Sir Keir Starmer strode into Downing Street with a thumping majority, few could have imagined how the last few days would play out. Read more:What will Starmer learn from chaos?PM: Concessions are 'common sense'Analysis: Starmer is in a hot mess More than 120 MPs, nearly a third of the parliamentary Labour party and more than the total number of Tory MPs, publicly prepared to rebel on a flagship policy. How did it come to this? How did the prime minister, and the people around him, not see a rebellion coming when there had been signs MPs weren't happy for weeks? Those are the questions being asked by senior Labour figures behind the scenes. Sir Keir's spokesperson says the prime minister consistently engages with colleagues, and parliamentary engagement takes many forms. But a lack of engagement with backbenchers has led to the prime minister's most damaging U-turn yet, and this week will haunt the prime minister beyond Tuesday's crunch vote."
    },
    {
        "title": "Tributes paid to 'true original' who died while skydiving ",
        "description": "Family and friends have paid tribute to a student who was among two people who died while skydiving in Devon - describing him as a \"true original\".",
        "url": "https://news.sky.com/story/adam-harrison-tributes-paid-to-true-original-who-died-while-skydiving-13389342",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chelsea-adam-adam-harrison_6951790.jpg?20250627124744",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-27 11:14:00",
        "Headline": "Adam Harrison, 30, died along with Belinda Taylor near Dunkeswell Aerodrome in Devon on Friday, 13 June.",
        "Content": "Family and friends have paid tribute to a student who was among two people who died while skydiving in Devon - describing him as a \"true original\". Adam Harrison died in the incident near Dunkeswell Aerodrome, near Honiton, in Devon on Friday, 13 June. The 30-year-old skydiving instructor, from Bournemouth, was a chiropractic student at the Health Sciences University in the town. In a statement, his family and friends said: \"From the very first moment you met Adam, you felt it - that spark. He didn't simply enter a room; he lit it up. \"With boundless energy, an infectious laugh, and a natural warmth that made everyone feel like a lifelong friend, Adam was a true original. \"He was, as so many have said, 'one of a kind', a beautiful soul whose kindness and charisma left a mark on everyone lucky enough to know him. \"Adam had a way of turning ordinary days into unforgettable adventures. Whether he was swinging through trees at Go Ape, chasing dreams in the sky as a tandem instructor, or lifting spirits at every party, he carried a joy that was impossible to ignore. He made life feel lighter - funnier, freer, more alive. \"He approached everything he loved with passion - from skydiving and snowboarding to spontaneous adventures and silly jokes. He was always chasing joy, and he brought others along for the ride. Even in life's toughest moments, Adam chose light.\" Mother-of-four Belinda Taylor, 48, from Totnes, also died in the incident, which is now the subject of an investigation. An inquest into their deaths was opened this week and heard that they both died after their parachute failed to open during a tandem skydive. The inquest was adjourned pending further investigations. Ms Taylor's partner, Scott Armstrong, paid tribute to her earlier this month, writing on Facebook: \"I miss you so much, you were my best friend. \"Thank you for everything you've done for me, from making my children feel at home to putting up with my mess... there's just so much that I don't have the words to express it. \"I feel so lost. I don't know where home is without you.\" Ms Taylor's eldest son, Connor Bowles, paid tribute to a \"selfless woman\" who was also a grandmother to two young children. In a statement, Skydive Buzz, the company that organised the fatal jump, said it was \"heartbroken\" by the deaths and was fully co-operating with the investigation. It said: \"Our deepest condolences go out to the families, friends, and everyone affected by this devastating event.\" As per standard procedure, the relevant authorities were contacted immediately, and the appropriate investigation protocols were initiated without delay. \" Read more from Sky News:Govt makes concessions to Labour rebelsJapan executes 'Twitter killer' A British Skydiving Board of Inquiry will now investigate. \"Once complete, a report - including conclusions and any recommendations - will be submitted to the coroner, the police, the Civil Aviation Authority (CAA), the British Skydiving Safety & Training Committee (STC), and other relevant bodies. \"Safety is, and always has been, our top priority. We are fully co-operating with the investigation and continue to uphold the highest possible standards in everything we do.\" The Air Accident Investigation Branch earlier said that it had been \"notified of a tragic accident in which two jumpers lost their lives\" but that it was a matter for British Skydiving. The Civil Aviation Authority confirmed it was aware of the incident but could not comment further due to the ongoing investigation. A spokesman added: \"We will work closely with the relevant authorities to understand what happened and are awaiting the report into the incident.\""
    },
    {
        "title": "Prime Minister Sir Keir Starmer set to warn of 'backroom stitch up' between parties in Wales",
        "description": "The prime minister is set to warn of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections.",
        "url": "https://news.sky.com/story/prime-minister-sir-keir-starmer-set-to-warn-of-backroom-stitch-up-between-parties-in-wales-13389548",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wales-labour-keir-starmer_6952209.jpg?20250627203019",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-27 19:10:00",
        "Headline": "Sir Keir Starmer will address Labour members in Wales ahead of next year's Senedd election, as polls suggest the party is in third place, behind Plaid Cymru and Reform UK.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n The prime minister is set to warn of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections. Sir Keir Starmer will address Welsh Labour's annual conference in Llandudno, North Wales, on Saturday. Voters will head to the polls next May to choose their representatives in Cardiff Bay and recent polls suggest Labour is in third place, behind Reform and Plaid. Labour has been the largest party at every Senedd election since devolution began in 1999. It is understood he will say such a deal would mark a \"return to the chaos and division of the last decade\". But opposition parties have hit back at the prime minister's \"imaginary coalitions\", with Plaid Cymru accusing Labour of \"scraping the barrel\".  Sir Keir is expected to tell members how the two Labour governments in Westminster and Cardiff are \"working together for the people of Wales\". \n                  Welfare concessions 'common sense', says PM - as he defends U-turn\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 \n                  What will Keir Starmer learn from the Labour welfare chaos?\n                 At next year's Senedd election, 96 members will be elected to the Welsh parliament for the first time - an increase of more than a third - under a more proportional voting system. He is anticipated to describe First Minister Eluned Morgan as a \"fierce champion\" for Wales and \"the best person\" to lead the country into the future. It comes after Ms Morgan set out the \"red Welsh way\" in a landmark speech last month, seemingly deviating from the Westminster party, and calling for more \"respect\" for devolution and a \"fair deal\" for Wales. The prime minister's pitch to the people of Wales comes as the UK government announces legal protections for military personnel, their families and for veterans as the country marks Armed Forces Day. Further details are set to be outlined in due course, but the government says they could include more travel benefits or flexible working arrangements for partners of serving personnel. After a week in which the government U-turned on controversial welfare reforms amid a mounting rebellion, the party is expected to make a number of announcements for Wales. Among those is a new £11m fund for businesses in Port Talbot and the surrounding area, which Labour says proves that it is the only party with \"a real plan to grow Welsh industry\"."
    },
    {
        "title": "Starmer warned over fears of 'toothless' Hillsborough Law replacement",
        "description": "More than 130 MPs have urged Sir Keir Starmer to deliver the Hillsborough Law as promised - amid claims it is being watered-down with a \"toothless\" replacement.",
        "url": "https://news.sky.com/story/starmer-warned-over-fears-of-toothless-hillsborough-law-replacement-13389363",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tributes-hillsborough_6887104.jpg?20250415100120",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-06-27 12:21:00",
        "Headline": "Campaigners are concerned that civil servants are trying to \"retain their impunity\" by proposing a weakened version of the Hillsborough Law.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n More than 130 MPs have urged Sir Keir Starmer to deliver the Hillsborough Law as promised - amid claims it is being watered-down with a \"toothless\" replacement. Ian Byrne, the Labour MP for Liverpool West Derby, has written to the prime minister over concerns that officials have \"carved out\" key elements of the long-awaited legislation. Politics live: Labour rebel will still vote against welfare bill despite changes The Hillsborough Law is intended to prevent future state cover-ups by putting a legal duty of candour on public servants to tell the truth, with criminal sanctions for lying. It also includes a commitment to funding so that families receive proportional legal representation in battles with official bodies. The bill had its first reading in 2017 when it was introduced by Andy Burnham and supported by Steve Rotheram who were Labour MPs at the time. In his letter, Mr Byrne said a draft government version of the law, shown to the now Great Manchester and Liverpool City Region mayors respectively and one of the campaign's lawyers in March, did not contain the key provisions. \n                  Welfare concessions 'common sense', says PM - as he defends U-turn\n                 \n                  This has been Starmer's most damaging U-turn yet - but the bigger cost is the political one\n                 \n                  Labour's welfare reform changes explained \n                 In particular, he said it did not contain a duty of candour, only an \"aspirational objective\". He said there was also \"no reference at all\" to the rebalancing of resources for legal representation for families at inquests and inquiries. As Sky News reported at the time, the government paused the process to listen to these concerns, meaning it missed its own deadline to implement the law by the most recent anniversary of the Hillsborough disaster on 15 April. However campaigners have not been shown the latest draft and say meetings with ministers and officials have indicated the Hillsborough Law is still to be replaced with weaker legislation. 'Legally nothing left' In particular, there are concerns the obligation to be truthful would be applied only to some investigations and could even be reduced to a professional duty dealt with by codes or staff handbooks rather than a criminal backstop. A government spokesperson said they are \"fully committed\" to a legal duty of candour with criminal sanctions for those who don't comply. However Elkan Abrahamson, one of the lawyers who drafted the original Hillsborough Law, told Sky News: \"It's easy to talk about commitment but until we see something in writing... we don't know what that means.\" He said that under the government's proposals there would \"legally be nothing left\" of the original bill, adding: \"My message to them is rip up your draft, go back to ours and tell us what the problem is and we will sort it with you.\" The government declined to say what its concerns are with the Hillsborough Law when asked by Sky News. It has said it wants to bring the legislation in \"at pace\" but \"having consulted with campaign groups, we know more time is needed to draft the best version of a Hillsborough Law\".  At the Labour Party conference in Liverpool in 2022 when he was still in opposition, Sir Keir said that \"one of his first\" acts as prime minister if he won the election would be \"to put the Hillsborough Law on the statute book\". The Times has reported officials have concerns that the Hillsborough Law could punish junior civil servants who turn up late for work and lie about it. But in his letter, signed by 136 cross-party MPs and 29 peers, Mr Byrne said \"that is manifestly not correct\". He added: \"We have no doubt that the attempts to replace the bill with wholly deficient and ineffective redrafts are led by those who are most likely to be affected by the Hillsborough Law: senior civil servants and public institutions who want to retain their impunity in protecting their reputations above telling the truth.\" 'Toothless replacement' He called on the prime minister to \"show leadership and strength\" in implementing the Hillsborough Law in full \"and not some toothless replacement\". \"We urge you not to pass up this opportunity to achieve generational culture change, and a step change in the integrity of public life.\" The campaign for the Hillsborough Law follows a decades-long fight for justice for the 97 football fans who were unlawfully killed after gross negligence by police at an FA Cup semi-final between Liverpool and Nottingham Forest at Hillsborough stadium in Sheffield in 1989. Shortly before kick-off, supporters were let through a gate, which caused crowding in the stand and a crush. Nobody has ever been convicted for its subsequent cover-up. The campaign for the legislation is also supported by victims of the Grenfell Tower fire and the infected blood scandal, as well as families bereaved in the COVID pandemic, nuclear test veterans and victims of the Post Office Horizon scandal."
    },
    {
        "title": "Prince William has had a lot to say this week - but is anyone listening?",
        "description": "Prince William has had a lot to say this week, attending three events about the environment as part of London Climate Action Week and giving three speeches.",
        "url": "https://news.sky.com/story/prince-william-has-had-a-lot-to-say-this-week-but-is-anyone-listening-13389500",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-william-prince-of-wales_6952143.jpg?20250627181120",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "Conflict, not the climate crisis, has been the primary focus of world leaders - a problem you could say for William and all those trying to whip up momentum ahead of COP30 in Brazil.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William has had a lot to say this week, attending three events about the environment as part of London Climate Action Week and giving three speeches. But I wouldn't be surprised if you haven't really heard what he had to say. The eyes of the world have, understandably, been elsewhere. Conflict, not the climate crisis, has been the primary focus of world leaders and continues to be - a problem you could say for William and all those trying to whip up momentum ahead of COP30 in Brazil, with only four months to go until the UN's climate conference in November. It was William and his team who specifically convened a meeting at St James's Palace on Thursday with the Brazilian ministers in charge of the summit and indigenous leaders from other parts of the world. With Ed Miliband, the secretary of state for energy security and net zero, just a few seats away, William made a call to action, saying: \"We've made bold commitments: to halt deforestation, restore ecosystems, and protect 30% of land, sea, and water by 2030. \"But these goals will remain out of reach unless we move from promises to action - grounded in respect, equity, and shared responsibility. \"Looking ahead to COP30 in Belem and beyond, we must act with greater ambition and deeper collaboration. This is a moment for courage.\" When I put it to a palace source that maybe it all feels a bit futile in the current climate, with attentions firmly elsewhere, I was told there is \"no change in course\" - the prince always has and will continue \"to use his platform to spotlight the need to restore the planet\".  In the past, we've been more used to his father being more vocal. The King's involvement in London Climate Week was more fleeting, albeit involving a handshake with a giant gorilla puppet, and a discussion with the Brazil delegation in which he hinted that he would love to attend the summit in November, saying: \"It's fitting it all in.\" Attendance by either the King or the Prince of Wales hasn't been confirmed yet, although it's looking likely William will go. He told one person this week: \"I'll be in the area\", with his Earthshot Prize being held in Rio in the days running up to the climate conference. But in the coming months, we do now know that father and son will be meeting with one key player, who has certainly voiced very different views on the severity of the climate crisis.  This week, it was confirmed that Donald Trump's full state visit to the UK will go ahead later this year, likely in September. His potentially disruptive presence when it came to the climate debate was hinted at on Tuesday, in front of Prince William, during a speech by former New York mayor Mike Bloomberg. Mr Bloomberg, a global adviser to Earthshot Prize, said: \"There's a good reason to be optimistic, lots of problems around the world, America has not been doing its share lately to make things better, I don't think. Nevertheless, I'm very optimistic about the future.\" Read more:My week with Prince William, the quiet disruptorWilliam releases photo to mark 43rd birthday The King and Prince William have worked in this environmental sphere long enough to weather the frustrations of other distractions, a lack of interest or momentum. I'll never forget in 2015 ahead of COP21, when Islamic State and Syria were dominating the news agenda, Prince Charles told me very firmly that of course there was a link between the civil war in Syria and climate change. He said there was \"very good evidence indeed that one of the major reasons for this horror in Syria was a drought that lasted for about five or six years, which meant that huge numbers of people in the end had to leave the land\". \"It's only in the last few years that the Pentagon have actually started to pay attention to this,\" he added at the time. \"I mean, it has a huge impact on what is happening.\" But as a family, they know how much their global profile and ability to get people in the room can help attract attention that others simply can't. It's easy to be sniffy about that convening power, but as one delegate at an Earthshot event put it, they have an ability to \"bring people together not around politics but purpose\". And in a currently noisy, fractured world, it feels like that is needed more than ever."
    },
    {
        "title": "UN data on Gaza deaths 'disinformation', claims head of controversial aid group",
        "description": "The chief of the Gaza Humanitarian Foundation (GHF) has called figures by the United Nations on people killed at aid hubs \"disinformation\".",
        "url": "https://news.sky.com/story/head-of-controversial-gaza-aid-group-calls-un-data-on-deaths-disinformation-13389241",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-humanitarian-foundation_6951670.jpg?20250627090513",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-27 07:18:00",
        "Headline": "The UN said at least 410 Palestinians have been killed seeking food since Israel lifted an 11-week aid blockade on 19 May, while the Hamas-run Gaza health ministry said at least 549 people have been killed.",
        "Content": " The chief of the Gaza Humanitarian Foundation (GHF) has called figures by the United Nations on people killed at aid hubs \"disinformation\". The UN said at least 410 Palestinians have been killed seeking food since Israel lifted an 11-week aid blockade on 19 May, while the Hamas-run Gaza health ministry said at least 549 people have been killed. Johnnie Moore, executive director of GHF, told Sky News there is a \"disinformation campaign\" that is \"meant to shut down our efforts\" in the Gaza Strip, fuelled by \"some figures\" coming out every day. Mr Moore, an evangelical preacher who served as a White House adviser in the first Trump administration, said his aid group has delivered more than 44 million meals to Gazans since it began operations in May. The controversial group, backed by Israel and the United States, has been rejected by the UN and other aid groups, which have refused to cooperate with the GHF. The aid agencies claim Israel is weaponising food, and the new distribution system using the GHF will be ineffective and lead to further displacement of Palestinians. They also argue the GHF will fail to meet local needs and violate humanitarian principles that prohibit a warring party from controlling humanitarian assistance. The GHF is distributing food packages, which they say can feed 5.5 people for 3.5 days, in four locations, with the majority in the far south of Gaza. Data and forensics correspondent It was really political, really punchy, and I think the heart of the matter here is that the Gaza Humanitarian Foundation is too political. The principle of aid, when applied traditionally, is that it has to be applied neutrally and that is what used to happen.  Trucks would go into Gaza, and the UN would distribute that food. Israel, for a long time, said that's not working and they blame Hamas for that. \n At a briefing by the Israeli prime minister's office yesterday, they were saying that Hamas was still looting those aid vehicles, and it was coming out with a plan to stop that. It didn't provide evidence for that.  When we asked for evidence, they said we shouldn't swallow Hamas disinformation. That's a word that's been used. That's very, very political. \n This is a different model of doing things. And that is the concern: that rather than just handing it over to a neutral body, this is too close to Israel, it's too close to the US, and is backed financially by the US. What does that actually imply? Well, if you're choosing where those sites are, it means people are going to move down there if you're not putting them in certain places.  The number of distribution sites has dwindled. It's attenuated. And so, actually, if there are only a few and if there are any in the south of Gaza, that encourages people to move there, that might fit a political goal as well as a humanitarian one.   Thousands of Palestinians walk for hours to reach the aid hubs and have to move through Israeli military zones, where witnesses say the Israel Defence Forces (IDF) regularly open fire with heavy barrages to control the crowds. Both figures from the UN and the Hamas-run Gaza health ministry say hundreds of people have been killed or wounded. In response to Mr Moore's comments, Rachael Cummings, Save the Children's team leader in Gaza, told Sky News that people \"are being forced into the decision to go to retrieve food from the American- and Israeli-backed, militarised, food distribution point\". A Gazan man said about the GHF aid sites: \"This is a trap, because the plan is to displace us, not to distribute food and drink. If they wanted to organise it, they would have done so. They deliberately made it chaotic.\" Read more: Doctors on the frontline - British surgeons on life in Gaza  \"We're not contesting at all that there have been casualties in the Gaza Strip. I mean, there's no ceasefire. This is an active conflict,\" Mr Moore said. \"I think people may not understand as clearly what it means to operate a humanitarian operation on this scale, in an environment this complex, in a piece of land as small as the Gaza Strip, and may not appreciate that almost anything that happens in the Gaza Strip is going to take place in proximity to something.\" Mr Moore said the GHF was not denying that there had been \"those incidents\", but said the GHF was able to talk to the IDF, which would conduct an investigation, while Hamas was \"intentionally harming people for he purpose of defaming what we're doing\". He said the GHF, \"an independent organisation operating with the blessing of the US government\", was \"achieving its aims\". \"We're not here to replace the UN, we're here to do the same thing: to feed Gazans,\" he said. It comes after the US State Department announced on Thursday that it had approved $30m in funding for the GHF as it called on other countries to also support the controversial group delivering aid in Gaza. Some US officials opposed giving any US funds to the foundation over concerns about violence near aid distribution sites, the GHF's inexperience and the involvement of the for-profit US logistics and private military firms, sources told Reuters news agency. Read more:Analysis: Israel's block on international journalists in Gaza should not be allowed to stand  A spokesperson from the UN office for the coordination of humanitarian affairs told Sky News that they are \"open to any practical solutions that address the crisis on the ground\" and are \"happy\" to talk to the GHF, a statement welcomed by Mr Moore. The spokeswoman added that the aid distribution in Gaza was not \"currently a dignified process and that the format doesn't follow humanitarian principles\". She said that people have to walk for miles, and that there is no scalability, with aid not reaching everyone in need. Charity Oxfam said in reaction to Mr Moore's interview that claims of enough aid getting into Gaza \"fly in the face of everything we, and other trusted humanitarian agencies, are seeing on the ground\". Halima Begum, Oxfam's CEO, said: \"It's not only wrong, it's dangerous and denies the horrifying reality we are witnessing daily. Gaza is on the brink of famine, and people are being killed as they queue for food. \"We need an immediate ceasefire. Hostages must be released, and humanitarian assistance must be allowed in, delivered by experienced organisations like the UN and Oxfam, to prevent mass starvation.\""
    },
    {
        "title": "Japan executes 'Twitter killer' who murdered and dismembered nine people",
        "description": "A man guilty of murdering nine people, most of whom had posted suicidal thoughts on social media, has been executed in Japan.",
        "url": "https://news.sky.com/story/japan-executes-twitter-killer-who-murdered-and-dismembered-nine-people-13389188",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-takahiro-shiraishi_6951573.jpg?20250627040104",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-27 03:12:00",
        "Headline": "Takahiro Shiraishi, known as the \"Twitter killer,\" was sentenced to death in 2020 for the killings in 2017 of the nine victims. His execution on Friday was the first use of capital punishment in Japan in nearly three years.",
        "Content": "A man guilty of murdering nine people, most of whom had posted suicidal thoughts on social media, has been executed in Japan. Takahiro Shiraishi, known as the \"Twitter killer\", was sentenced to death in 2020 for the 2017 killings of the nine victims, who he also dismembered in his apartment near Tokyo. His execution was the first use of capital punishment in the country in nearly three years and it was carried out as calls grow to abolish the measure in Japan since the acquittal of the world's longest-serving death-row inmate Iwao Hakamada last year. He was freed after 56 years on death row, following a retrial which heard police had falsified and planted evidence against him over the 1966 murders of his boss, wife and two children. Eight of Shiraishi's victims were women, including teenagers, who he killed after raping them. He also killed a boyfriend of one of the women to silence him. Police arrested him in 2017 after finding the bodies of eight females and one male in cold-storage cases in his apartment. Investigators said Shiraishi approached the victims via Twitter, offering to assist them with their suicidal wishes. \n                  Japanese minister resigns after saying he's never bought rice because he gets it free\n                 \n                  Hundreds arrested in Turkey during worldwide May Day demonstrations and rallies\n                 \n                  Student rescued from mountain twice in four days - after going back to find his phone\n                 Read more from Sky News: Vietnam veteran executed after almost 50 years on death row'Great progress' made in Gaza ceasefire talks, says Trump  Justice Minister Keisuke Suzuki, who authorised Shiraishi's hanging, said he made the decision after careful examination, taking into account the convict's \"extremely selfish\" motive for crimes that \"caused great shock and unrest to society\". \"It is not appropriate to abolish the death penalty while these violent crimes are still being committed,\" Mr Suzuki said. There are currently 105 death row inmates in Japan, he added."
    },
    {
        "title": "First female US ambassador to Russia to leave her role",
        "description": "The first female US ambassador to Russia is leaving her role after serving through one of the most difficult periods in relations between the two countries.",
        "url": "https://news.sky.com/story/first-female-us-ambassador-to-russia-to-leave-her-role-13389210",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-lynne-tracy_6951621.jpg?20250627073312",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-27 05:40:00",
        "Headline": "The departure of the career diplomat appointed by former president Joe Biden comes as Russia and the United States discuss a potential reset in their relationship.",
        "Content": "The first female US ambassador to Russia is leaving her role after serving through one of the most difficult periods in relations between the two countries. Lynne Tracy, who has been based in Moscow, said she is \"proud to have represented my country\" in the Russian capital \"during such a challenging time\". There is no suggestion she has been removed from her role by the Trump administration. The departure of the career diplomat appointed by former president Joe Biden comes as Russia and the United States discuss a potential reset in their ties, which sharply deteriorated after Moscow launched its full-scale war in Ukraine in February 2022. President Donald Trump has said there are potentially big investment deals to be struck, but is growing increasingly frustrated that his efforts to broker a peace deal to end the war in Ukraine have so far not resulted in a meaningful ceasefire. In a statement shared by the US embassy in Russia on Telegram, Ms Tracy said: \"As I leave Russia, I know that my colleagues at the embassy will continue to work to improve our relations and maintain ties with the Russian people. \"I have been inspired by my meetings with Russians who love their country and work every day for a better future. I would like to conclude with lines from Pushkin's poem 'To Chaadayev', which speak of the love for the Motherland that lives in each of us. Goodbye!\" The embassy said it wanted to \"express our gratitude for her contributions based on consistent diplomacy, deep respect for Russian culture, and dedicated service to the American people\". Read more from Sky News:Govt makes concessions to Labour rebelsJapan executes 'Twitter killer' In a statement earlier this month, the embassy said Ms Tracy, who arrived in Moscow in January 2023 and was greeted by protesters chanting anti-US slogans when she went to the foreign ministry to present her credentials, would leave her post soon. She was notably involved in efforts to win the release of US citizens jailed in Russia, including journalist Evan Gershkovich and former marine Paul Whelan, who were eventually freed in August 2024 as part of a big East-West prisoner swap. Ms Tracy, who took over from John Sullivan, had previously served as the second-highest official at the US Embassy in Moscow, the deputy chief of mission, from 2014 to 2017. She was the ambassador to Armenia at the time she was nominated to replace Mr Sullivan after he retired. Ms Tracy, who speaks Russian, had also worked at US diplomatic outposts including Turkmenistan, Pakistan and Kazakhstan. She majored in Soviet Studies and holds a law degree."
    },
    {
        "title": "Democratic Republic of Congo and Rwanda sign US-brokered peace deal - but doubts over success linger",
        "description": "The Democratic Republic of Congo (DRC) and Rwanda have signed a peace deal which Donald Trump said he brokered - resulting in the US getting \"a lot\" of mineral rights in the process.",
        "url": "https://news.sky.com/story/democratic-republic-of-congo-and-rwanda-sign-us-brokered-peace-deal-but-doubts-over-success-linger-13389580",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-drc-congo-fm_6952272.jpg?20250628005534",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-27 21:22:00",
        "Headline": "US President Donald Trump has said he was able to broker a deal for \"one of the worst wars anyone's ever seen\", while also saying the US was getting \"a lot of the mineral rights from Congo\".",
        "Content": " The Democratic Republic of Congo (DRC) and Rwanda have signed a peace deal which Donald Trump said he brokered - resulting in the US getting \"a lot\" of mineral rights in the process. The deal has been touted as an important step towards ending the decades-long conflict in eastern DRC which has caused the deaths of six million people. US secretary of state Marco Rubio called it \"an important moment after 30 years of war\". The Congo-Rwanda conflict explained Earlier on Friday, President Trump said he was able to broker a deal for \"one of the worst wars anyone's ever seen\". \"I was able to get them together and sell it,\" Mr Trump said. \"And not only that, we're getting for the United States a lot of the mineral rights from Congo.\" 'Great deal of uncertainty' \n                  At least 33 die in floods in Democratic Republic of Congo\n                 \n                  What is Kindoki? This innocent man was accused of it and blamed for deaths of mother and baby sister\n                 \n                  Mystery illness kills more than 50 people in Democratic Republic of Congo\n                 The Rwanda-backed M23 rebel group, the most prominent armed group in the conflict, has suggested that the agreement won't be binding for them. It hasn't been directly involved in the planned peace deal. DRC foreign minister Therese Kayikwamba Wagner invoked the millions of victims of the conflict in signing the agreement with Rwandan foreign minister Olivier Nduhungirehe. The agreement, signed by the foreign ministers during a ceremony with Mr Rubio in Washington, pledges to implement a 2024 deal that would see Rwandan troops withdraw from eastern DRC within 90 days, according to a copy seen by Reuters. Read more from Sky News: Diddy's defence lawyer mocks case in closing argumentNike says Trump tariffs could cost it $1bn \"Some wounds will heal, but they will never fully disappear,\" Ms Wagner said. \"Those who have suffered the most are watching. They are expecting this agreement to be respected, and we cannot fail them.\" Mr Nduhungirehe noted the \"great deal of uncertainty\" because previous agreements were not put in place. \"There is no doubt that the road ahead will not be easy,\" he said. \"But with the continued support of the United States and other partners, we believe that a turning point has been reached.\""
    },
    {
        "title": "Nike says Trump tariffs could cost it $1bn",
        "description": "Nike's costs will go up $1bn (&#163;728m) this year if US President Donald Trump's tariffs remain at the current level, the company has told investors.",
        "url": "https://news.sky.com/story/nike-says-trump-tariffs-could-cost-it-1bn-13389275",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-lebron-nike-paris-2024_6664193.jpg?20240823142302",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-27 08:38:00",
        "Headline": "Company says work to bring down costs is under way, including reducing supplies from China to the United States.",
        "Content": "Nike's costs will go up $1bn (£728m) this year if US President Donald Trump's tariffs remain at the current level, the company has told investors. It follows a warning from the sports brand last month that it would raise prices due to the taxes imposed on imports. Work to bring down costs is under way, including reducing supplies from China to the US. It's to reduce the amount of footwear made in China and imported to the US from 16% currently to a \"high single digit\" figure with Chinese supply being \"reallocated to other countries around the world\". Money blog: Passengers could be allowed two free bags on planes On 2 April, Mr Trump announced country-specific tariffs which hit China hardest and escalated after several rounds of retaliatory rises. After an agreement between Washington and Beijing the levy was brought down from a 145% tariff to 30% on Chinese goods. \n                  Six killed in China floods as tropical storm threatens further devastation\n                 \n                  China says British warship sailed through Taiwan Strait to 'cause trouble'\n                 \n                  China strikes cautious tone after Trump claims trade deal is 'done'\n                  Price rises for consumers will start to come into effect in the autumn. The latest warning on tariffs comes as Nike reported the worst quarterly results in more than three years. Revenues were $11.1bn (£8.1bn) - the lowest since the third quarter of 2022. It has been dealing with the after-effects of an unsuccessful move to sell direct-to-consumer with Wall Street analysts also critical of its dependence on lifestyle products and reliance on fashion trends. Nike chief executive Elliott Hill had returned from retirement last year to again take the top job at the company. The worst of the trade wars have already occurred, Mr Hill said, with \"the headwinds to moderate from here\"."
    },
    {
        "title": "Man kicks customs dog at Washington Dulles International Airport, say authorities",
        "description": "An Egyptian man has admitted federal charges after kicking a customs dog at a US airport, authorities say.",
        "url": "https://news.sky.com/story/man-kicks-customs-dog-at-washington-dulles-international-airport-say-authorities-13389287",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beagle-freddy-customs-dog_6951706.jpg?20250627102823",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-27 09:24:00",
        "Headline": "Hamad Ramadan Bayoumy Aly Marie, 70, kicked beagle Freddie after it allegedly detected 100lbs (45kg) of undeclared agricultural products in his luggage at Washington Dulles International Airport.",
        "Content": "An Egyptian man has admitted federal charges after kicking a customs dog at a US airport, authorities say. Hamad Ramadan Bayoumy Aly Marie, 70, pleaded guilty to \"harming animals used in law enforcement\" during an appearance in the US District Court of eastern Virginia on Wednesday. Five-year-old male beagle Freddie allegedly detected more than 100lbs (45kg) of undeclared agricultural products in Marie's luggage after he arrived at Washington Dulles International Airport from Cairo, Egypt, on Tuesday. When Freddie's handler started questioning the passenger, he kicked the 25lb (11kg) animal so hard that it was lifted off the ground, according to US Customs and Border Protection. A veterinarian determined that Freddie suffered contusions to his right rib area as a result of being kicked. Marie was placed in handcuffs by US Customs and Border Protection (CBP) officers, who found 55lbs (24.9kg) of beef meat, 44lbs (20kg) of rice, 15lbs (6.8kg) of eggplant, cucumbers and bellpeppers, 2lbs (0.9kg) of corn seeds, and 1lb (0.5kg) of herbs in his luggage, according to authorities. All agricultural products were seized as they are prohibited, to prevent the introduction of harmful plant pests and foreign animal diseases from entering the country. \n                  Israeli embassy staff shooting suspect 'fired repeatedly after victims hit the ground'\n                 \n                  Netanyahu launches attack on Starmer, Macron and Carney after Washington DC shooting\n                 \n                  Woman shot outside CIA headquarters after driving towards gates and refusing to stop\n                 \"Being caught deliberately smuggling well over 100lbs of undeclared and prohibited agricultural products does not give one permission to violently assault a defenceless Customs and Border Protection beagle,\" said Christine Waugh, the CBP's director for the area port of Washington DC. \"We rely heavily on our K9 partners and Freddie was just doing his job. \"Any malicious attack on one of us is an attack on all of us, and CBP will continue to work with our investigating and prosecuting partners to deal swift and severe justice to perpetrators.\" Read more from Sky News:British man charged with leading hacking schemeBrad Pitt's Los Angeles home broken into Marie was credited with time served after being taken into custody on Tuesday and was ordered to pay the veterinarian's fee of $840 (£612) for Freddie's treatment, a court filing shows. He was also told to immediately report to CBP for removal from the US, and he left the country on a flight to Egypt at 12.30pm local time on Thursday."
    },
    {
        "title": "Trump's 'giant win' frees him up to push on with his agenda with fewer blocks and barriers",
        "description": "As the president himself said, this was a \"giant\" of a decision - a significant moment to end a week of whiplash-inducing news.",
        "url": "https://news.sky.com/story/trumps-giant-win-frees-him-up-to-push-on-with-his-agenda-with-fewer-blocks-and-barriers-13389591",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-supreme-court-capitol-hill_6952014.jpg?20250627155837",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-06-27 22:45:00",
        "Headline": "In simple terms, this ruling, from a Supreme Court weighted towards conservative judges, frees up the president to push on with his agenda, less opposed by the courts.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  As the president himself said, this was a \"giant\" of a decision - a significant moment to end a week of whiplash-inducing news. The decision by the US Supreme Court is a big win for President Donald Trump. By a majority of 6-3, the highest court in the land has ruled that federal judges have been overreaching in their authority by blocking or freezing the executive orders issued by the president. Over the last few months, a series of presidential actions by Trump have been blocked by injunctions issued by federal district judges. The federal judges, branded \"radical leftist lunatics\" by the president, have ruled on numerous individual cases, most involving immigration. They have then applied their rulings as nationwide injunctions - thus blocking the Trump administration's policies. \"It was a grave threat to democracy frankly,\" the president said at a hastily arranged news conference in the White House briefing room. \n                  Democratic Republic of Congo and Rwanda sign US-brokered peace deal - but doubts over success linger\n                 \n                  US Supreme Court curbs injunctions that blocked Donald Trump's birthright citizenship plan\n                 \n                  Nike says Trump tariffs could cost it $1bn\n                 \"Instead of merely ruling on the immediate case before them, these judges have attempted to dictate the law for the entire nation,\" he said. In simple terms, this ruling, from a Supreme Court weighted towards conservative judges, frees up the president to push on with his agenda, less opposed by the courts. \"This is such a big day…,\" the president said. \"It gives power back to people that should have it, including Congress, including the presidency, and it only takes bad power away from judges. It takes bad power, sick power and unfair power. \"And it's really going to be... a very monumental decision.\" The country's most senior member of the Democratic Party was to the point with his reaction to the ruling. Senate minority leader Chuck Schumer called it \"an unprecedented and terrifying step toward authoritarianism, a grave danger to our democracy, and a predictable move from this extremist MAGA court\". In a statement, Schumer wrote: \"By weakening the power of district courts to check the presidency, the Court is not defending the Constitution - it's defacing it. \"This ruling hands Donald Trump yet another green light in his crusade to unravel the foundations of American democracy.\"  Federal power in the US is, constitutionally, split equally between the three branches of government - the executive branch (the presidency), the legislative branch (Congress) and the judiciary (the Supreme Court and other federal courts). They are designed to ensure a separation of power and to ensure that no single branch becomes too powerful. This ruling was prompted by a case brought over an executive order issued by President Trump on his inauguration day to end birthright citizenship - that constitutional right to be an American citizen if born here. A federal judge froze the decision, ruling it to be in defiance of the 14th Amendment of the Constitution. The Supreme Court has deferred its judgement on this particular case, instead ruling more broadly on the powers of the federal judges. The court was divided along ideological lines, with conservatives in the majority and liberals in dissent. 👉 Follow Trump100 on your podcast app 👈 In her dissent, liberal Justice Ketanji Brown Jackson wrote: \"​​As I understand the concern, in this clash over the respective powers of two coordinate branches of Government, the majority sees a power grab - but not by a presumably lawless Executive choosing to act in a manner that flouts the plain text of the Constitution. \"Instead, to the majority, the power-hungry actors are... (wait for it)... the district courts.\" Another liberal Justice, Sonia Sotomayor, described the majority ruling by her fellow justices as: \"Nothing less than an open invitation for the government to bypass the constitution.\" Conservative Justice Amy Coney Barrett, who Trump appointed during his first term, shifting the balance of left-right power in the court, led this particular ruling. Writing for the majority, she said: \"When a court concludes that the executive branch has acted unlawfully, the answer is not for the court to exceed its power, too.\" The focus now for those who deplore this decision will be to apply 'class action' - to file lawsuits on behalf of a large group of people rather than applying a single case to the whole nation. There is no question though that the president and his team will feel significantly emboldened to push through their policy agenda with fewer blocks and barriers. Read more from Sky News:Democratic Republic of Congo and Rwanda sign US-brokered peace deal'Life-changing' drug for teenager who lost mother to genetic condition The ruling ends a giddy week for the president.  Last Saturday he ordered the US military to bomb Iran's nuclear sites. Within two days he had forced both Israel and Iran to a ceasefire. By mid-week he was in The Hague for the NATO summit where the alliance members had agreed to his defence spending demands. At an Oval Office event late on Friday, where he presided over the signing of a peace agreement between the Democratic Republic of Congo and Rwanda, he also hinted at a possible ceasefire \"within a week\" in Gaza. A truly consequential week seems set to be followed by another."
    },
    {
        "title": "US Supreme Court curbs injunctions that blocked Donald Trump's birthright citizenship plan",
        "description": "Donald Trump's administration will be allowed to take steps to implement its proposal to end automatic birthright citizenship in the US following a decision by the Supreme Court.",
        "url": "https://news.sky.com/story/us-supreme-court-curbs-injunctions-that-blocked-trumps-birthright-citizenship-plan-13389428",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-birthright-citizenship_6952023.jpg?20250627161001",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-27 14:27:00",
        "Headline": "The US president welcomed the ruling by posting on Truth Social that it was a \"giant win\". However, legal challenges can continue as the ruling only focuses on whether judges had the authority to put the policy on hold across the entire country.",
        "Content": " Donald Trump's administration will be allowed to take steps to implement its proposal to end automatic birthright citizenship in the US following a decision by the Supreme Court. Under the current rules, nearly anyone born on US territory has automatic citizenship rights - commonly known as \"birthright citizenship\". But in January, on his first day back in the White House, Trump signed an executive order aimed at ending that right. A series of lawsuits followed, with district courts issuing nationwide injunctions aiming to block the order from taking effect.  The Supreme Court on Friday voted 6-3 to allow the Trump administration to narrow the scope of nationwide injunctions imposed by judges so that they apply only to states, groups and individuals that sued. This means the birthright citizenship proposal can likely move forward at least in part in the states that challenged it, as well as those that did not. The US president responded with a post on Truth Social by welcoming the ruling as a \"giant win\". At a news conference at the White House, he said: \"In recent months, we've seen a handful of radical left judges effectively try to overrule the rightful powers of the president... to dictate the law for the entire nation... this was a colossal abuse of power.\" He went on to suggest the current birthright was being abused and had originally been designed for a different era, to give the descendants of slaves the right to citizenship. \"It wasn't meant for people trying to scam the system and come into the country on a vacation. It was meant for the babies of slaves. Hundreds of thousands of people are pouring into our country under birthright citizenship,\" he said. 👉 Follow Trump100 on your podcast app 👈  In a wide-ranging news conference, he also said he would consider bombing Iran again if they continued their nuclear programme and expects the country to open itself to international inspections. He also said he was preparing fresh trade tariffs for several countries and had secured mineral rights in the Democratic Republic of Congo, which is signing a peace deal with Rwanda at the White House to end years of fighting. Friday's Supreme Court decision was focused on cases filed in Maryland, Massachusetts and Washington state. The policy remains blocked for now in one additional state, New Hampshire, as a result of a separate lawsuit that is not before the Supreme Court. Mr Trump's plan has the backing of 21 other states. Friday's ruling was decided on a 6-3 vote following a divide on ideological lines, with conservatives in the majority and liberals in dissent. Mr Trump previously helped shape the makeup of the court with the appointment of three judges, ensuring a 6-3 conservative majority, though past rulings have still not always gone in his favour. It has long been widely accepted, including by legal scholars on the left and right in the US, that the Constitution's 14th Amendment confers automatic citizenship to almost anyone born in the United States. Mr Trump wants that restricted to only those with at least one parent who is a US citizen or permanent resident. Friday's ruling does not examine the legal merits of the policy, but only whether judges had the authority to put it on hold across the entire country. Read more from Sky News:British man charged in US with hackingTrump tariffs could cost Nike $1bnMan kicks customs dog at US airport As a result of the ruling, the proposal can potentially move forward nationwide, although individuals could still file their own lawsuits at the state level. Those currently challenging the policy could also still reinstate injunctions which are less broad in scope. The US president and his allies have been harshly critical of judges who have blocked aspects of his agenda, although it is not a new phenomenon for courts to impose nationwide injunctions. His administration has battled against judges who have issued nationwide injunctions in response to a bold and aggressive use of executive power to implement a controversial agenda, including ramping up deportations, downsizing federal agencies, targeting law firms and universities and firing thousands of federal employees."
    },
    {
        "title": "Trump's 'giant win' frees him up to push on with his agenda with fewer blocks and barriers",
        "description": "As the president himself said, this was a \"giant\" of a decision - a significant moment to end a week of whiplash-inducing news.",
        "url": "https://news.sky.com/story/trumps-giant-win-frees-him-up-to-push-on-with-his-agenda-with-fewer-blocks-and-barriers-13389591",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-supreme-court-capitol-hill_6952014.jpg?20250627155837",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-27 22:45:00",
        "Headline": "In simple terms, this ruling, from a Supreme Court weighted towards conservative judges, frees up the president to push on with his agenda, less opposed by the courts.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  As the president himself said, this was a \"giant\" of a decision - a significant moment to end a week of whiplash-inducing news. The decision by the US Supreme Court is a big win for President Donald Trump. By a majority of 6-3, the highest court in the land has ruled that federal judges have been overreaching in their authority by blocking or freezing the executive orders issued by the president. Over the last few months, a series of presidential actions by Trump have been blocked by injunctions issued by federal district judges. The federal judges, branded \"radical leftist lunatics\" by the president, have ruled on numerous individual cases, most involving immigration. They have then applied their rulings as nationwide injunctions - thus blocking the Trump administration's policies. \"It was a grave threat to democracy frankly,\" the president said at a hastily arranged news conference in the White House briefing room. \n                  Democratic Republic of Congo and Rwanda sign US-brokered peace deal - but doubts over success linger\n                 \n                  US Supreme Court curbs injunctions that blocked Donald Trump's birthright citizenship plan\n                 \n                  Nike says Trump tariffs could cost it $1bn\n                 \"Instead of merely ruling on the immediate case before them, these judges have attempted to dictate the law for the entire nation,\" he said. In simple terms, this ruling, from a Supreme Court weighted towards conservative judges, frees up the president to push on with his agenda, less opposed by the courts. \"This is such a big day…,\" the president said. \"It gives power back to people that should have it, including Congress, including the presidency, and it only takes bad power away from judges. It takes bad power, sick power and unfair power. \"And it's really going to be... a very monumental decision.\" The country's most senior member of the Democratic Party was to the point with his reaction to the ruling. Senate minority leader Chuck Schumer called it \"an unprecedented and terrifying step toward authoritarianism, a grave danger to our democracy, and a predictable move from this extremist MAGA court\". In a statement, Schumer wrote: \"By weakening the power of district courts to check the presidency, the Court is not defending the Constitution - it's defacing it. \"This ruling hands Donald Trump yet another green light in his crusade to unravel the foundations of American democracy.\"  Federal power in the US is, constitutionally, split equally between the three branches of government - the executive branch (the presidency), the legislative branch (Congress) and the judiciary (the Supreme Court and other federal courts). They are designed to ensure a separation of power and to ensure that no single branch becomes too powerful. This ruling was prompted by a case brought over an executive order issued by President Trump on his inauguration day to end birthright citizenship - that constitutional right to be an American citizen if born here. A federal judge froze the decision, ruling it to be in defiance of the 14th Amendment of the Constitution. The Supreme Court has deferred its judgement on this particular case, instead ruling more broadly on the powers of the federal judges. The court was divided along ideological lines, with conservatives in the majority and liberals in dissent. 👉 Follow Trump100 on your podcast app 👈 In her dissent, liberal Justice Ketanji Brown Jackson wrote: \"​​As I understand the concern, in this clash over the respective powers of two coordinate branches of Government, the majority sees a power grab - but not by a presumably lawless Executive choosing to act in a manner that flouts the plain text of the Constitution. \"Instead, to the majority, the power-hungry actors are... (wait for it)... the district courts.\" Another liberal Justice, Sonia Sotomayor, described the majority ruling by her fellow justices as: \"Nothing less than an open invitation for the government to bypass the constitution.\" Conservative Justice Amy Coney Barrett, who Trump appointed during his first term, shifting the balance of left-right power in the court, led this particular ruling. Writing for the majority, she said: \"When a court concludes that the executive branch has acted unlawfully, the answer is not for the court to exceed its power, too.\" The focus now for those who deplore this decision will be to apply 'class action' - to file lawsuits on behalf of a large group of people rather than applying a single case to the whole nation. There is no question though that the president and his team will feel significantly emboldened to push through their policy agenda with fewer blocks and barriers. Read more from Sky News:Democratic Republic of Congo and Rwanda sign US-brokered peace deal'Life-changing' drug for teenager who lost mother to genetic condition The ruling ends a giddy week for the president.  Last Saturday he ordered the US military to bomb Iran's nuclear sites. Within two days he had forced both Israel and Iran to a ceasefire. By mid-week he was in The Hague for the NATO summit where the alliance members had agreed to his defence spending demands. At an Oval Office event late on Friday, where he presided over the signing of a peace agreement between the Democratic Republic of Congo and Rwanda, he also hinted at a possible ceasefire \"within a week\" in Gaza. A truly consequential week seems set to be followed by another."
    },
    {
        "title": "Sean 'Diddy' Combs's 'private sex life' turned into 'crime scene', defence says in closing argument",
        "description": "Sean \"Diddy\" Combs is facing a \"fake trial\" in which his unusual sexual preferences have been unfairly criminalised and his \"private sex life\" turned into a \"crime scene\", his defence team has argued in the final day of closing arguments.",
        "url": "https://news.sky.com/story/sean-diddy-combss-private-sex-life-turned-into-crime-scene-defence-says-in-closing-argument-13389592",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sean-diddy-combs-diddy_6952264.jpg?20250627233425",
        "type": "US",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "On the final day of closing arguments, the defence accused the prosecution of \"badly exaggerating\" the evidence, saying it was confusing threesomes with racketeering.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Sean \"Diddy\" Combs is facing a \"fake trial\" in which his unusual sexual preferences have been unfairly criminalised and his \"private sex life\" turned into a \"crime scene\", his defence team has argued in the final day of closing arguments. At the end of week seven in the sex-trafficking trial, Combs's lead counsel, Marc Agnifilo, told the court Combs was the victim of an overzealous prosecution, who had portrayed his \"swinger\" lifestyle as a racketeering conspiracy. Combs is charged with one count of racketeering conspiracy, two charges of sex trafficking, and two charges of transportation to engage in prostitution. He has pleaded not guilty to all charges and has strenuously denied all allegations of sexual abuse. If found guilty, he could face being put behind bars for life. Diddy trial: As it happened Frequently adopting a sarcastic tone, Agnifilo mocked the government's case against Combs, belittling the agents who seized hundreds of bottles of Astroglide lubricant and baby oil at his properties last year. Commenting that America's streets were now \"safe from Astroglide\", he went on, \"Way to go, fellas\", before adding, \"you do you\". \n                  Prosecutors give closing arguments in Sean 'Diddy' Combs trial\n                 \n                  Sean 'Diddy' Combs praises judge and chooses not to testify as trial draws to a close\n                 \n                  Diddy trial latest: Defence lawyer mocks case in closing argument - and says charges have been 'badly exaggerated'\n                 He said prosecutors had \"badly exaggerated\" the evidence against Combs, presenting \"threesomes as racketeering\", arguing that he is not guilty of racketeering conspiracy and sex trafficking. The defence also highlighted the prosecution's decision to indict Combs on a racketeering conspiracy charge alone, flagging that no alleged co-conspirators have been indicted alongside him. The defence's closing arguments lasted for just over four hours, with members of Combs's family, including six of his children and his mother, watching on in the public gallery. Agnifilo said Combs has \"taken care of people\", including Jane, a former girlfriend who testified under a pseudonym, paying for her rent and for her legal representation. The defence lawyer said: \"I don't know what Jane is doing today, but she's doing it in a house he's paying for.\" He went on: \"This isn't about crime. It's about money. This is about money.\" Presenting the trial as a zero-sum game, he described his former girlfriend of almost 11 years Cassie Ventura as the \"winner in this whole thing\", noting that she settled her civil case with Combs for $20m (£14m) in November 2023, as well as a $10m (£7.3m) from the InterContinental Hotel. Cassie and Jane both gave evidence during the trial that they were coerced repeatedly by Combs to perform in drug-fuelled, days-long sex marathons with male sex workers, while Combs watched, directed, masturbated and sometimes filmed the encounters. But the defence accused prosecutors of having invaded Combs's bedroom and his most intimate personal affairs. Agnifilo asked: \"Where's the crime scene? It's [Combs's] sex life.\" Continuing his line of sarcastic quips, he joked, \"We need a bigger roll of crime scene tape\", referencing a line from the classic movie Jaws. Agnifilio's sarcasm irked the prosecution, who later complained to the judge that he was using \"improper arguments\". Read more:Everything you need to know about the trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony The defence characterised Combs's relationship with Cassie as \"a great modern love story\", going on to describe her as a \"gangster\" for cheating on him with rapper Kid Cudi. They also characterised the \"freak offs\" as \"beautiful\", saying the videos showed \"everyone smiling\", eating and listening to music, and commenting that Combs was \"not the only man in America making homemade porn\". The defence admitted Combs was a domestic abuser, but said such behaviour did not justify the grave charges he faces. Agnifilo advised the jury to \"Call this as you see it,\" asking them to \"acquit Sean Combs of all the counts\" and \"return him to his family\", who he said has been waiting for him. Combs, who has been in a New York jail since his arrest in September last year, did not give evidence during the trial. Following the defence's closing argument, assistant US attorney Maurene Comey delivered a rebuttal summation in which she said the defence's argument that Cassie, Jane and Mia, a former employee who also testified under a pseudonym, all \"wanted sex\" was a lie, telling the court none of the women had reason to speak anything other than the truth. She also said the \"freak off\" videos tell only \"part of the story\". Comey said Combs had spent the last 20 years believing himself to be \"above the law\", seeing himself as \"untouchable\" and \"a god among men\". She said his impunity would end now in this courtroom, before urging the jury to \"find him guilty\" and \"hold him accountable\". On Monday, the judge will read the law to the jury, after which deliberations will begin. To convict Combs, the 12 jurors must vote unanimously."
    },
    {
        "title": "Democratic Republic of Congo and Rwanda sign US-brokered peace deal - but doubts over success linger",
        "description": "The Democratic Republic of Congo (DRC) and Rwanda have signed a peace deal which Donald Trump said he brokered - resulting in the US getting \"a lot\" of mineral rights in the process.",
        "url": "https://news.sky.com/story/democratic-republic-of-congo-and-rwanda-sign-us-brokered-peace-deal-but-doubts-over-success-linger-13389580",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-drc-congo-fm_6952272.jpg?20250628005534",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-27 21:22:00",
        "Headline": "US President Donald Trump has said he was able to broker a deal for \"one of the worst wars anyone's ever seen\", while also saying the US was getting \"a lot of the mineral rights from Congo\".",
        "Content": " The Democratic Republic of Congo (DRC) and Rwanda have signed a peace deal which Donald Trump said he brokered - resulting in the US getting \"a lot\" of mineral rights in the process. The deal has been touted as an important step towards ending the decades-long conflict in eastern DRC which has caused the deaths of six million people. US secretary of state Marco Rubio called it \"an important moment after 30 years of war\". The Congo-Rwanda conflict explained Earlier on Friday, President Trump said he was able to broker a deal for \"one of the worst wars anyone's ever seen\". \"I was able to get them together and sell it,\" Mr Trump said. \"And not only that, we're getting for the United States a lot of the mineral rights from Congo.\" 'Great deal of uncertainty' \n                  At least 33 die in floods in Democratic Republic of Congo\n                 \n                  What is Kindoki? This innocent man was accused of it and blamed for deaths of mother and baby sister\n                 \n                  Mystery illness kills more than 50 people in Democratic Republic of Congo\n                 The Rwanda-backed M23 rebel group, the most prominent armed group in the conflict, has suggested that the agreement won't be binding for them. It hasn't been directly involved in the planned peace deal. DRC foreign minister Therese Kayikwamba Wagner invoked the millions of victims of the conflict in signing the agreement with Rwandan foreign minister Olivier Nduhungirehe. The agreement, signed by the foreign ministers during a ceremony with Mr Rubio in Washington, pledges to implement a 2024 deal that would see Rwandan troops withdraw from eastern DRC within 90 days, according to a copy seen by Reuters. Read more from Sky News: Diddy's defence lawyer mocks case in closing argumentNike says Trump tariffs could cost it $1bn \"Some wounds will heal, but they will never fully disappear,\" Ms Wagner said. \"Those who have suffered the most are watching. They are expecting this agreement to be respected, and we cannot fail them.\" Mr Nduhungirehe noted the \"great deal of uncertainty\" because previous agreements were not put in place. \"There is no doubt that the road ahead will not be easy,\" he said. \"But with the continued support of the United States and other partners, we believe that a turning point has been reached.\""
    },
    {
        "title": "Man kicks customs dog at Washington Dulles International Airport, say authorities",
        "description": "An Egyptian man has admitted federal charges after kicking a customs dog at a US airport, authorities say.",
        "url": "https://news.sky.com/story/man-kicks-customs-dog-at-washington-dulles-international-airport-say-authorities-13389287",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-beagle-freddy-customs-dog_6951706.jpg?20250627102823",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-27 09:24:00",
        "Headline": "Hamad Ramadan Bayoumy Aly Marie, 70, kicked beagle Freddie after it allegedly detected 100lbs (45kg) of undeclared agricultural products in his luggage at Washington Dulles International Airport.",
        "Content": "An Egyptian man has admitted federal charges after kicking a customs dog at a US airport, authorities say. Hamad Ramadan Bayoumy Aly Marie, 70, pleaded guilty to \"harming animals used in law enforcement\" during an appearance in the US District Court of eastern Virginia on Wednesday. Five-year-old male beagle Freddie allegedly detected more than 100lbs (45kg) of undeclared agricultural products in Marie's luggage after he arrived at Washington Dulles International Airport from Cairo, Egypt, on Tuesday. When Freddie's handler started questioning the passenger, he kicked the 25lb (11kg) animal so hard that it was lifted off the ground, according to US Customs and Border Protection. A veterinarian determined that Freddie suffered contusions to his right rib area as a result of being kicked. Marie was placed in handcuffs by US Customs and Border Protection (CBP) officers, who found 55lbs (24.9kg) of beef meat, 44lbs (20kg) of rice, 15lbs (6.8kg) of eggplant, cucumbers and bellpeppers, 2lbs (0.9kg) of corn seeds, and 1lb (0.5kg) of herbs in his luggage, according to authorities. All agricultural products were seized as they are prohibited, to prevent the introduction of harmful plant pests and foreign animal diseases from entering the country. \n                  Israeli embassy staff shooting suspect 'fired repeatedly after victims hit the ground'\n                 \n                  Netanyahu launches attack on Starmer, Macron and Carney after Washington DC shooting\n                 \n                  Woman shot outside CIA headquarters after driving towards gates and refusing to stop\n                 \"Being caught deliberately smuggling well over 100lbs of undeclared and prohibited agricultural products does not give one permission to violently assault a defenceless Customs and Border Protection beagle,\" said Christine Waugh, the CBP's director for the area port of Washington DC. \"We rely heavily on our K9 partners and Freddie was just doing his job. \"Any malicious attack on one of us is an attack on all of us, and CBP will continue to work with our investigating and prosecuting partners to deal swift and severe justice to perpetrators.\" Read more from Sky News:British man charged with leading hacking schemeBrad Pitt's Los Angeles home broken into Marie was credited with time served after being taken into custody on Tuesday and was ordered to pay the veterinarian's fee of $840 (£612) for Freddie's treatment, a court filing shows. He was also told to immediately report to CBP for removal from the US, and he left the country on a flight to Egypt at 12.30pm local time on Thursday."
    },
    {
        "title": "Nike says Trump tariffs could cost it $1bn",
        "description": "Nike's costs will go up $1bn (&#163;728m) this year if US President Donald Trump's tariffs remain at the current level, the company has told investors.",
        "url": "https://news.sky.com/story/nike-says-trump-tariffs-could-cost-it-1bn-13389275",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-lebron-nike-paris-2024_6664193.jpg?20240823142302",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-27 08:38:00",
        "Headline": "Company says work to bring down costs is under way, including reducing supplies from China to the United States.",
        "Content": "Nike's costs will go up $1bn (£728m) this year if US President Donald Trump's tariffs remain at the current level, the company has told investors. It follows a warning from the sports brand last month that it would raise prices due to the taxes imposed on imports. Work to bring down costs is under way, including reducing supplies from China to the US. It's to reduce the amount of footwear made in China and imported to the US from 16% currently to a \"high single digit\" figure with Chinese supply being \"reallocated to other countries around the world\". Money blog: Passengers could be allowed two free bags on planes On 2 April, Mr Trump announced country-specific tariffs which hit China hardest and escalated after several rounds of retaliatory rises. After an agreement between Washington and Beijing the levy was brought down from a 145% tariff to 30% on Chinese goods. \n                  Six killed in China floods as tropical storm threatens further devastation\n                 \n                  China says British warship sailed through Taiwan Strait to 'cause trouble'\n                 \n                  China strikes cautious tone after Trump claims trade deal is 'done'\n                  Price rises for consumers will start to come into effect in the autumn. The latest warning on tariffs comes as Nike reported the worst quarterly results in more than three years. Revenues were $11.1bn (£8.1bn) - the lowest since the third quarter of 2022. It has been dealing with the after-effects of an unsuccessful move to sell direct-to-consumer with Wall Street analysts also critical of its dependence on lifestyle products and reliance on fashion trends. Nike chief executive Elliott Hill had returned from retirement last year to again take the top job at the company. The worst of the trade wars have already occurred, Mr Hill said, with \"the headwinds to moderate from here\"."
    },
    {
        "title": "First female US ambassador to Russia to leave her role",
        "description": "The first female US ambassador to Russia is leaving her role after serving through one of the most difficult periods in relations between the two countries.",
        "url": "https://news.sky.com/story/first-female-us-ambassador-to-russia-to-leave-her-role-13389210",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-lynne-tracy_6951621.jpg?20250627073312",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-27 05:40:00",
        "Headline": "The departure of the career diplomat appointed by former president Joe Biden comes as Russia and the United States discuss a potential reset in their relationship.",
        "Content": "The first female US ambassador to Russia is leaving her role after serving through one of the most difficult periods in relations between the two countries. Lynne Tracy, who has been based in Moscow, said she is \"proud to have represented my country\" in the Russian capital \"during such a challenging time\". There is no suggestion she has been removed from her role by the Trump administration. The departure of the career diplomat appointed by former president Joe Biden comes as Russia and the United States discuss a potential reset in their ties, which sharply deteriorated after Moscow launched its full-scale war in Ukraine in February 2022. President Donald Trump has said there are potentially big investment deals to be struck, but is growing increasingly frustrated that his efforts to broker a peace deal to end the war in Ukraine have so far not resulted in a meaningful ceasefire. In a statement shared by the US embassy in Russia on Telegram, Ms Tracy said: \"As I leave Russia, I know that my colleagues at the embassy will continue to work to improve our relations and maintain ties with the Russian people. \"I have been inspired by my meetings with Russians who love their country and work every day for a better future. I would like to conclude with lines from Pushkin's poem 'To Chaadayev', which speak of the love for the Motherland that lives in each of us. Goodbye!\" The embassy said it wanted to \"express our gratitude for her contributions based on consistent diplomacy, deep respect for Russian culture, and dedicated service to the American people\". Read more from Sky News:Govt makes concessions to Labour rebelsJapan executes 'Twitter killer' In a statement earlier this month, the embassy said Ms Tracy, who arrived in Moscow in January 2023 and was greeted by protesters chanting anti-US slogans when she went to the foreign ministry to present her credentials, would leave her post soon. She was notably involved in efforts to win the release of US citizens jailed in Russia, including journalist Evan Gershkovich and former marine Paul Whelan, who were eventually freed in August 2024 as part of a big East-West prisoner swap. Ms Tracy, who took over from John Sullivan, had previously served as the second-highest official at the US Embassy in Moscow, the deputy chief of mission, from 2014 to 2017. She was the ambassador to Armenia at the time she was nominated to replace Mr Sullivan after he retired. Ms Tracy, who speaks Russian, had also worked at US diplomatic outposts including Turkmenistan, Pakistan and Kazakhstan. She majored in Soviet Studies and holds a law degree."
    },
    {
        "title": "British man charged by US with leading hacking scheme and causing millions in damages",
        "description": "A British man has been charged in the US with allegedly leading a global hacking scheme which caused millions of pounds in damages.",
        "url": "https://news.sky.com/story/british-man-charged-by-us-with-leading-hacking-scheme-and-causing-millions-in-damages-13389185",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-cybercrime-hacker-hacking_6840137.jpg?20250226113306",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-27 01:42:00",
        "Headline": "Kai West, 25 and who is charged with operating the IntelBroker online identity was arrested in France in February. According to FBI assistant director in charge Christopher G Raia, the \"years-long\" scheme had caused victims losses of at least 25 million dollars (£18.2m) worldwide.",
        "Content": "A British man has been charged in the US with allegedly leading a global hacking scheme which caused millions of pounds in damages. Kai West, 25. who operated under the online identity IntelBroker was arrested in France in February. The US is seeking his extradition over allegations he stole and sold data. He faces up to 20 years in jail if found guilty. \"West, and his online co-conspirators, took that stolen data, and offered it for sale online for more than $2 million,\" according to an indictment by the US Attorney's Office for the Southern District of New York. West faces charges of conspiracy to commit computer intrusion and wire fraud, accessing a protected computer to obtain information and wire fraud, according to the indictment. Read more from Sky News: Truth about success of US airstrikes on Iran lies deep underground'Rare offering': Entire island with ruined castle goes on sale According to FBI assistant director in charge, Christopher G Raia, the \"years-long\" scheme had caused victims losses of at least 25 million dollars (£18.2m) worldwide. \n                  NHS trusts' data 'stolen' in cyberattack\n                 \n                  Thousands of UK companies 'could have M&S-style hackers waiting in their systems'\n                 \n                  Co-op 'very sorry' after hackers access members' data \n                 A telecommunications company, a municipal healthcare provider and an internet service provider were among more than 40 victims listed in the indictment. \"The IntelBroker alias has caused millions in damages to victims around the world,\" said US attorney Jay Clayton. \"This action reflects the FBI's commitment to pursuing cybercriminals around the world. \"New Yorkers are all too often the victims of intentional cyber schemes and our office is committed to bringing these remote actors to justice.\" Mr Clayton thanked British, French, Spanish and Dutch authorities for their assistance in the investigation."
    },
    {
        "title": "New Look owners line up bankers to fashion high street exit",
        "description": "New Look is to hire investment bankers to undertake a strategic review which is expected to trigger an auction of the high street fashion chain.",
        "url": "https://news.sky.com/story/new-look-lines-up-bankers-to-fashion-high-street-exit-13385897",
        "image_url": "https://e3.365dm.com/20/06/1920x1080/skynews-new-look-oxford-street_5005109.jpg?20200603154120",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-27 09:20:00",
        "Headline": "The clothing retailer's owners, Alcentra and Brait, and management are talking to advisers about a review of options which is likely to trigger an auction in the coming months, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n New Look is to hire investment bankers to undertake a strategic review which is expected to trigger an auction of the high street fashion chain. Sky News has learnt that New Look's owners, who are led by the investment firm Alcentra, have opened talks with banks about advising on a process to take place during the next 12 months. Money blog: Passengers could be allowed two free bags on planes under law change An appointment, which follows unsolicited approaches for the business, is expected to be made in the near future. New Look, which trades from approximately 340 stores and employs about 10,000 people across the UK, is the country's second-largest womenswear retailer in the 18 to 44-year-old age group. It has been owned by its current shareholders - Alcentra and Brait - since October 2020. In April, Sky News reported that the investors were injecting £30m of fresh equity into the business to aid its digital transformation. \n                  Full list of 33 River Island shop closures\n                 \n                  Poundland to stop paying rent at hundreds of stores in rescue deal\n                 \n                  Thousands of Poundland jobs at risk as shops to close after company sold\n                 Last year, the chain reported sales of £769m, with an improvement in gross margins and a statutory loss before tax of £21.7m - down from £88m the previous year. Like most high street retailers, it endured a torrid COVID-19 and engaged in a formal financial restructuring through a company voluntary arrangement. In the autumn of 2023, it completed a £100m refinancing deal with Blazehill Capital and Wells Fargo. A spokesperson for New Look said the company did not \"comment on rumour and speculation\". \"Management are focused on running the company and executing the strategy for long-term growth. \"The company is trading well and has supportive shareholders.\""
    },
    {
        "title": "Nike says Trump tariffs could cost it $1bn",
        "description": "Nike's costs will go up $1bn (&#163;728m) this year if US President Donald Trump's tariffs remain at the current level, the company has told investors.",
        "url": "https://news.sky.com/story/nike-says-trump-tariffs-could-cost-it-1bn-13389275",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-lebron-nike-paris-2024_6664193.jpg?20240823142302",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-27 08:38:00",
        "Headline": "Company says work to bring down costs is under way, including reducing supplies from China to the United States.",
        "Content": "Nike's costs will go up $1bn (£728m) this year if US President Donald Trump's tariffs remain at the current level, the company has told investors. It follows a warning from the sports brand last month that it would raise prices due to the taxes imposed on imports. Work to bring down costs is under way, including reducing supplies from China to the US. It's to reduce the amount of footwear made in China and imported to the US from 16% currently to a \"high single digit\" figure with Chinese supply being \"reallocated to other countries around the world\". Money blog: Passengers could be allowed two free bags on planes On 2 April, Mr Trump announced country-specific tariffs which hit China hardest and escalated after several rounds of retaliatory rises. After an agreement between Washington and Beijing the levy was brought down from a 145% tariff to 30% on Chinese goods. \n                  Six killed in China floods as tropical storm threatens further devastation\n                 \n                  China says British warship sailed through Taiwan Strait to 'cause trouble'\n                 \n                  China strikes cautious tone after Trump claims trade deal is 'done'\n                  Price rises for consumers will start to come into effect in the autumn. The latest warning on tariffs comes as Nike reported the worst quarterly results in more than three years. Revenues were $11.1bn (£8.1bn) - the lowest since the third quarter of 2022. It has been dealing with the after-effects of an unsuccessful move to sell direct-to-consumer with Wall Street analysts also critical of its dependence on lifestyle products and reliance on fashion trends. Nike chief executive Elliott Hill had returned from retirement last year to again take the top job at the company. The worst of the trade wars have already occurred, Mr Hill said, with \"the headwinds to moderate from here\"."
    },
    {
        "title": "RTL Group to buy Sky Deutschland",
        "description": "Sky Deutschland has been sold to multinational media conglomerate RTL Group for an initial &#8364;150m.",
        "url": "https://news.sky.com/story/rtl-group-to-buy-sky-deutschland-13389208",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sky-deutschland-rtl_6951583.jpg?20250627063045",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-27 05:27:00",
        "Headline": "The merged companies \"bring together two of the most powerful entertainment and sports brands in Europe\" with the largest transaction for the RTL Group since its founding. ",
        "Content": "Sky Deutschland has been sold to multinational media conglomerate RTL Group for an initial €150m. The businesses are merging to create a brand with around 11.5 million paying subscribers. RTL had approached Sky Deutschland after it won the rights to show the majority of Bundesliga German football league matches. The Sky Deutschland entity serves Germany, Austria, and Switzerland with customers in Luxembourg, Liechtenstein and the South Tyrol province of Italy with programming that includes live sports, exclusive series, films, children's content, documentaries and shows. Money blog: Lenders cut mortgage rates - but good and bad news for buyers, landlords and renters RTL Group operates broadcast, streaming, content and digital businesses with interests in 60 television channels, seven streaming services and 37 radio stations. The group also has interests in radio stations in France, Germany, Spain and Luxembourg. RTL Deutschland owns 15 TV channels and more than 10 magazines. Under the deal, Sky's premium sports rights - including Bundesliga, Premier League and Formula 1 - will be merged with RTL's entertainment and news brands. RTL will also use the Sky brand. Sky executives expect Sky Deutschland to break even this year. The purchase is the largest transaction for the RTL Group since its inception in 2000. \"It will bring together two of the most powerful entertainment and sports brands in Europe and create a unique video proposition across free TV, pay TV and streaming,\" RTL Group's chief executive Thomas Rabe said. \"Together, RTL and Sky will be in an even stronger position to invest in people, content and technology in Germany and in Europe to compete with the global tech and streaming players.\" The deal is subject to regulatory approval, which the companies expect will conclude next year. In addition to the upfront €150m, Sky can trigger additional payment at any point within five years of the deal closing if RTL Group's share price exceeds €41. RTL Group shares currently cost €31.65. That payment is capped at €70 per share or €377m. The combined business could deliver €250m worth of savings a year on marketing, content and technology within three years, the businesses said. Sky News is owned by Sky, which is owned by Comcast, the US multinational media and entertainment business."
    },
    {
        "title": "Sky News Business Podcast: Welfare reforms, bond markets and skills",
        "description": "As Prime Minister Sir Keir Starmer backs down over planned cuts to disability entitlements, Paul Kelso discusses the latest developments with Simon French, chief economist and head of research at Panmure Liberum.",
        "url": "https://news.sky.com/story/sky-news-business-podcast-welfare-reforms-bond-markets-and-skills-13389453",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-biz-podcast-podcast_6937464.jpg?20250609141833",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-27 15:01:00",
        "Headline": "No subtitle found",
        "Content": "As Prime Minister Sir Keir Starmer backs down over planned cuts to disability entitlements, Paul Kelso discusses the latest developments with Simon French, chief economist and head of research at Panmure Liberum. Paul also speaks to George Lagarias, chief economist at Forvis Mazars, about how the bond markets have reacted to the U-turn. And there is an interview with entrepreneur Simon Squibb on the drop in the number of graduate-level jobs. :: Listen and subscribe to the Sky News Business Podcast here. "
    },
    {
        "title": "Crisis-hit marketing group Next 15 approached about £200m break-up",
        "description": "A London-listed marketing conglomerate which sacked three of its top executives this week has been approached about a &#163;200m break-up.",
        "url": "https://news.sky.com/story/crisis-hit-marketing-group-next-15-approached-about-163200m-break-up-13389288",
        "image_url": "https://e3.365dm.com/24/05/1920x1080/skynews-london-skyline_6547361.jpg?20240508140121",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-27 09:25:00",
        "Headline": "AIM-listed Next 15, which has a market capitalisation of about £210m, has been approached about the sale of its \"legacy\" advertising and public relations businesses, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A London-listed marketing conglomerate which sacked three of its top executives this week has been approached about a £200m break-up. Sky News has learnt that Next 15 has been holding talks about a sale of its \"legacy\" assets, which include the financial public relations agency MHP, with an unnamed bidder. That would leave the rump of the business focused on technology and data-driven client businesses. One industry source said the prospective buyer was believed to be a private equity firm. Next 15 issued a profit warning and changed its leadership this week as it disclosed \"potential serious misconduct\" related to Mach49, a Silicon Valley advisory business it owns. \"As a consequence, Next 15 has terminated the employment of three members of the senior management at Mach49 - Linda Yates, Russ Lampert and Paul Holland. David Charpie, currently co-CEO of Mach49, will become sole CEO with immediate effect,\" it said in a stock exchange statement on Wednesday. \"Next 15, on behalf of Mach49, is in the process of reporting the matters to relevant law enforcement agencies. \n                  New Look owners line up bankers to fashion high street exit\n                 \n                  Money blog: Passengers could be allowed two bags free of charge on planes under huge law change\n                 \n                  Nike says Trump tariffs could cost it $1bn\n                 \"It is too early to know the outcome, but Next 15 will ensure that full co-operation is provided to those agencies.\" The company, which has a market value of about £210m after seeing its stock slump by nearly 75% over the last year. It also announced this week that Tim Dyson, its chief executive for over three decades, would retire and be replaced by Sam Knights, the boss of Shopper Media Group, a subsidiary of Next 15. A person close to Next 15 insisted that any potential break-up would reflect the \"simplification strategy\" to which it had publicly alluded. Next 15 declined to comment on the approach for some of its assets, which are also thought to include the creative agency Elvis and Outcast, another PR firm."
    },
    {
        "title": "Welfare concessions 'common sense', says PM - as he defends U-turn",
        "description": "Sir Keir Starmer said changes to his welfare bill \"strike the right balance\" after making concessions to his backbench MPs.",
        "url": "https://news.sky.com/story/welfare-concessions-common-sense-says-pm-as-he-defends-u-turn-13389403",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-commerce_6951986.jpg?20250627153612",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-27 13:36:00",
        "Headline": "The PM has defended his climbdown on welfare after more than 100 of his own MPs were poised to vote against planned disability cuts. ",
        "Content": " Sir Keir Starmer said changes to his welfare bill \"strike the right balance\" after making concessions to his backbench MPs. The prime minister described the U-turn as \"common sense\" and said it means \"we can now get on with the job\". Politics Live: Starmer defends U-turn Sir Keir faced a significant rebellion over plans to cut sickness and disability benefits as part of a package he said would shave £5bn off the welfare bill and get more people into work. Speaking to reporters on Friday, he stood by his position that the welfare system needs reform as \"it doesn't work, and it traps people\". He added: \"We need to get it right. That's why we've been talking to colleagues and having a constructive discussion. \"We've now arrived at a package that delivers on the principles with some adjustments, and that's the right reform, and I'm really pleased now that we're able to take this forward. \"For me, getting that package adjusted in that way is the right thing to do, it means it's the right balance, it's common sense that we can now get on with it.\" The concessions include exempting existing Personal Independence Payment claimants (PIP) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. Analysis: Welfare bill U-turn a humiliating blow for Starmer  More money will also be front-loaded into helping people find jobs, though it is not clear how much beyond the £1bn already announced. The changes came after 127 Labour MPs signed an amendment calling for the cuts to be delayed and consulted on with disabled people. Rebels feared the reforms wouldn't actually help people find work while pushing thousands of disabled people and children into poverty, as per the government's own impact assessment.  Political correspondent It has been a painful week to watch. A U-turn in slow motion, culminating in a midnight climbdown as Number 10 agreed to concede to defiant MPs on Thursday night. The concessions are considerable. They mean, among other compromises, that existing claimants of personal independence payments (PIP) and the health aspect of Universal Credit will be protected from welfare reforms. Some MPs, like Diane Abbott and Nadia Whittome, remain unconvinced, but they were never high on the list of rebels the government expected to persuade. Ministers now hope that with the backing of MPs like Dame Meg Hillier, the chair of the Treasury Select Committee, the bill will pass the Commons. Their problems won't end there, though. Read Ali's full analysis here The discontent threatened to derail the Universal Credit and Personal Independence Payment Bill when it comes before the Commons for a vote on Tuesday, on the week that marks a year of Starmer in government. Asked what he would do about a \"hole\" in the public finances that the changes are said to leave, Sir Keir said the funding will be set out in the autumn budget \"in the usual way\". The concessions on PIP alone will protect an estimated 370,000 people currently receiving the allowance who were set to lose out following reassessment. Economists at the Institute for Fiscal Studies and the Resolution Foundation have both suggested that the changes could reduce savings intended in the original package by up to £3bn. Chancellor Rachel Reeves is also under pressure to find money to pay for the U-turn on cuts to winter fuel, which followed a drubbing at the local elections in May.  Asked about the series of U-turns, Work and Pensions Secretary Liz Kendall earlier said: \"Sometimes there's strength in listening. \"I really believe that to be the case, that you end up in the right position when you talk to all of those with knowledge and experience and actually, if you want decisions to be the right ones and to last for generations to come, I believe that's how you make the right changes.\" However, she would not guarantee the bill will pass next week. Some 83 Labour MPs would need to rebel for the government to be defeated.  Last night Dame Meg Hillier, one of the leading rebel voices, hailed the concessions as \"massive changes\" to protect vulnerable people and involve disabled people in the design of future reforms. However, not all the rebels have been satisfied with the changes, with several suggesting they would create a \"two-tier system\". Sky News is aware of at least 20 MPs who currently intend to still vote against. Many others are undecided. The concessions came after Downing Street publicly stuck to its guns while engaging in a frantic ring-around to get rebels onside, which further angered MPs.  Many have called for a reset in relations with Downing Street, as the fallout from the rebellion threatens to cause lasting damage. Conservative leader Kemi Badenoch criticised the U-turn, saying the government's failure to make \"minor savings\" on welfare showed they were unable to deal with major issues."
    },
    {
        "title": "This has been Starmer's most damaging U-turn yet - but the bigger cost is the political one",
        "description": "It has been a painful week to watch.",
        "url": "https://news.sky.com/story/this-week-will-haunt-the-prime-minister-after-his-most-damaging-u-turn-yet-13389532",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sir-keir-starmer-prime-minister_6952214.jpg?20250627205345",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-06-27 18:03:00",
        "Headline": "Sir Keir Starmer's concessions to his backbenchers are estimated to cost £3bn of the £5bn the chancellor hoped to save from welfare reforms. The bigger cost, though, is the political one.",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  It has been a painful week to watch. A U-turn in slow motion, culminating in a midnight climbdown as Number 10 agreed to concede to defiant MPs on Thursday night. The concessions are considerable. They mean, among other compromises, that existing claimants of personal independence payments (PIP) and the health aspect of Universal Credit will be protected from welfare reforms. 👉 Follow Electoral Dysfunction on your podcast app 👈 Some MPs, like Diane Abbott and Nadia Whittome, remain unconvinced, but they were never high on the list of rebels the government expected to persuade. Ministers now hope that with the backing of MPs like Dame Meg Hillier, the chair of the Treasury Select Committee, the bill will pass the Commons. Their problems won't end there, though. \n                  Prime Minister Sir Keir Starmer set to warn of 'backroom stitch up' between parties in Wales\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 \n                  Reform would win most seats in general election, in-depth poll suggests\n                 Firstly, there is the question of money. The Resolution Foundation estimates the concessions will cost £3bn of the £5bn the chancellor hoped to save from the welfare reforms. The prime minister's spokesperson says the changes will be fully funded in the budget and there will be no permanent increase in borrowing. They won't comment on any potential tax rises to plug the gap in Rachel Reeves's finances. The bigger cost, though, is the political one. A year ago, when Sir Keir Starmer strode into Downing Street with a thumping majority, few could have imagined how the last few days would play out. Read more:What will Starmer learn from chaos?PM: Concessions are 'common sense'Analysis: Starmer is in a hot mess More than 120 MPs, nearly a third of the parliamentary Labour party and more than the total number of Tory MPs, publicly prepared to rebel on a flagship policy. How did it come to this? How did the prime minister, and the people around him, not see a rebellion coming when there had been signs MPs weren't happy for weeks? Those are the questions being asked by senior Labour figures behind the scenes. Sir Keir's spokesperson says the prime minister consistently engages with colleagues, and parliamentary engagement takes many forms. But a lack of engagement with backbenchers has led to the prime minister's most damaging U-turn yet, and this week will haunt the prime minister beyond Tuesday's crunch vote."
    },
    {
        "title": "'Sometimes there is strength in listening': Liz Kendall defends welfare U-turn",
        "description": "Liz Kendall has defended the government's welfare U-turn saying: \"Sometimes there is strength in listening.\"",
        "url": "https://news.sky.com/story/sometimes-there-is-strength-in-listening-liz-kendall-defends-welfare-u-turn-13389314",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-liz-kendall-downing-street_6860416.jpg?20250318121813",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-27 10:16:00",
        "Headline": "However, the work and pensions secretary, would not guarantee the bill will pass amid continued criticism from some Labour rebels.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Liz Kendall has defended the government's welfare U-turn saying: \"Sometimes there is strength in listening.\" The embattled work and pensions secretary said \"positive changes\" have come about as a result of crisis talks with senior Labour backbenchers, who were poised to vote against planned cuts to disability benefits next week. Politics latest: Welfare changes 'could cost £3.2bn per year by 2030' However, she would not guarantee the bill will pass, amid criticism from some MPs the changes don't go far enough. The welfare concessions follow a U-turn over cuts to winter fuel and the decision to launch a grooming inquiry. Asked how the government can be trusted, Ms Kendall said: \"Sometimes there's strength in listening. \"I really believe that to be the case, that you end up in the right position when you talk to all of those with knowledge and experience and actually, if you want decisions to be the right ones and to last for generations to come, I believe that's how you make the right changes.\" The concessions include exempting existing personal independence claimants (pip) from the stricter new criteria, while the universal credit health top-up will only be cut and frozen for new applications. This has led to criticism of a two-tier system, but Ms Kendall said it is \"very common in the welfare system that there are protections for existing claimants\".  She said she \"hopes\" the changes have done enough to get the bill over the line next week. The cabinet minister also said government had \"more to do\" and would \"talk to people over the coming days\", with many MPs still on the fence about whether they will back the new proposals. The concessions were hashed out last night after a frantic ring around of MPs earlier in the week failed to bring critics onside. The government had planned to tighten pip criteria for new and existing claimants, with some 370,000 people set to lose out. It was part of a package of measures aimed at shaving £5bn off the welfare bill by 2030 and getting more people into work amid record levels of economic inactivity. However, MPs were concerned that disabled people had not been consulted, while the government's own impact assessment said the changes could plunge 250,000 people into poverty, including 50,000 children.  Ministers insisted this would be offset by measures to get people back into work, but many rebel MPs said while they agreed with that in principle it wasn't clear how this will be achieved. By Thursday, 127 Labour MPs had backed an amendment calling for the changes to be paused for further consultation - meaning the bill was at risk of being defeated when it goes to a vote on Tuesday. Dame Meg Hillier, the chair of the Treasury select committee who had tabled the amendment, said last night that the government had offered a \"good deal\". Read more:Beth Rigby analysis: Welfare bill a humiliating blow for StarmerWhat are the concessions to the welfare bill - and will MPs back it? Ultimately, individual MPs will decide if they want to support it. Many MPs on the left of the party have said they won't, with the likes of Ian Byrne and Nadia Whittome saying no concessions are enough while cuts are still going ahead and the bill should be pulled. Others have told Sky News they are undecided and want to see more details first. None of the rebels have publicly said they will now support the government, but two have told Sky News they expect they will vote for the new measures. It's not clear how much the new package will save, with those details expected to by set out in the autumn budget. The prime minister's spokesperson said on Friday that the changes will be fully funded but refused to be drawn on whether that meant tax rises. He rejected the suggestion that Sir Keir is at the mercy of his backbenchers, saying he has \"listened to MPs who support principles but worried about pace of change\"."
    },
    {
        "title": "Prime Minister Sir Keir Starmer set to warn of 'backroom stitch up' between parties in Wales",
        "description": "The prime minister is set to warn of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections.",
        "url": "https://news.sky.com/story/prime-minister-sir-keir-starmer-set-to-warn-of-backroom-stitch-up-between-parties-in-wales-13389548",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-wales-labour-keir-starmer_6952209.jpg?20250627203019",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-06-27 19:10:00",
        "Headline": "Sir Keir Starmer will address Labour members in Wales ahead of next year's Senedd election, as polls suggest the party is in third place, behind Plaid Cymru and Reform UK.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n The prime minister is set to warn of a \"backroom stitch up\" between the Conservatives, Reform UK and Plaid Cymru ahead of next year's Senedd elections. Sir Keir Starmer will address Welsh Labour's annual conference in Llandudno, North Wales, on Saturday. Voters will head to the polls next May to choose their representatives in Cardiff Bay and recent polls suggest Labour is in third place, behind Reform and Plaid. Labour has been the largest party at every Senedd election since devolution began in 1999. It is understood he will say such a deal would mark a \"return to the chaos and division of the last decade\". But opposition parties have hit back at the prime minister's \"imaginary coalitions\", with Plaid Cymru accusing Labour of \"scraping the barrel\".  Sir Keir is expected to tell members how the two Labour governments in Westminster and Cardiff are \"working together for the people of Wales\". \n                  Welfare concessions 'common sense', says PM - as he defends U-turn\n                 \n                  Keir Starmer is in a hot mess - and I've never seen anything like it\n                 \n                  What will Keir Starmer learn from the Labour welfare chaos?\n                 At next year's Senedd election, 96 members will be elected to the Welsh parliament for the first time - an increase of more than a third - under a more proportional voting system. He is anticipated to describe First Minister Eluned Morgan as a \"fierce champion\" for Wales and \"the best person\" to lead the country into the future. It comes after Ms Morgan set out the \"red Welsh way\" in a landmark speech last month, seemingly deviating from the Westminster party, and calling for more \"respect\" for devolution and a \"fair deal\" for Wales. The prime minister's pitch to the people of Wales comes as the UK government announces legal protections for military personnel, their families and for veterans as the country marks Armed Forces Day. Further details are set to be outlined in due course, but the government says they could include more travel benefits or flexible working arrangements for partners of serving personnel. After a week in which the government U-turned on controversial welfare reforms amid a mounting rebellion, the party is expected to make a number of announcements for Wales. Among those is a new £11m fund for businesses in Port Talbot and the surrounding area, which Labour says proves that it is the only party with \"a real plan to grow Welsh industry\"."
    },
    {
        "title": "What are the concessions to the welfare bill - and will MPs back it?",
        "description": "Number 10 has made concessions on its welfare bill after crisis talks with Labour rebels. ",
        "url": "https://news.sky.com/story/what-are-the-concessions-to-the-welfare-bill-and-will-mps-back-it-13389219",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dwp-government_6933451.png?20250602221850",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-27 06:25:00",
        "Headline": "The changes will be put to a crunch vote on Tuesday - but some rebels still want the bill to be killled. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Number 10 has made concessions on its welfare bill after crisis talks with Labour rebels.  Sir Keir Starmer will be hoping the changes are enough to avoid a Commons defeat when the measures are put to a vote on Tuesday - but several MPs have said they are still not satisfied. Sky News looks at what was in the deal and whether it will be enough to win over critics. Politics Live: Labour rebel hails 'good deal' after No 10 makes concessions on welfare Changes to PIP  In a letter to MPs, Work and Pensions Secretary Liz Kendall confirmed all existing claimants of the personal independence payment (pip) will be exempt from the cuts to eligibility. It means the new qualifying requirements will be implemented from November 2026 for new claims only. This is a big U-turn as the changes to pip, the main disability benefit in England, had caused the most upset among MPs planning to rebel. Pip is money given to people, including some of whom are in work, who have extra care or mobility needs as a result of a disability. People who claim it are awarded points depending on their ability to do certain activities, such as washing and preparing food, which influences how much they will receive. Currently claimants need to score a minimum of eight points across a range of tasks to qualify for the daily living element (there is a mobility element that is not affected by the plans). Under the new rules people will need to score a minimum of four points in at least one activity to qualify. By limiting the changes to new claimants only, it is estimated 370,000 people who had been due to lose out will now get to keep their benefit. This will come at a cost of £1.5bn by the end of the parliament, according to the Institute for Fiscal Studies. It is not clear how that will be funded, prompting speculation of tax rises at the autumn budget. Universal Credit  The second row back involves planned changes to universal credit (UC). The government had intended to freeze the health top-up at £97 a week during this parliament. However, all current recipients of the health element, as well as any new applicants meeting the \"severe conditions criteria\", will now have their incomes protected in real terms. The government will still cut the rate to £50 for new claimants from 2026/7, while raising the standard rate of UC for jobseekers. More money for people to find work The health top-up is for people who have a limited ability to work because of a disability or long term sickness, but ministers are concerned about the rising number of claimants and want to incentivise people back into work. Ms Kendall previously said £1bn would be used for targeted support schemes to help people out of inactivity and into jobs. In her letter, she said the government \"will front load more of the additional funding generated by these reforms for back to work support for sick and disabled people\".  Will MPs back the changes? Care minister Stephen Kinnock told Sky News on Friday morning the changes are a \"really big step in the right direction\". The purpose of the bill was to shave £5bn off the welfare budget by 2030 and tackle the rising numbers of people who are economically inactive. Lots of MPs said they agreed with the principle of reform but were concerned with the impact on disabled people. Initially, over 120 Labour MPs had signed a \"reasoned amendment\" calling for the changes to be delayed while disabled people were consulted on. Dame Meg Hillier, the influential chair of the Treasury select committee who had tabled the amendment, said last night that the government had offered a \"good deal\". However, it is ultimately up to individual MPs to decide if they want to support it. Read more:Beth Rigby analysis: Welfare bill a humiliating blow for Starmer Several MPs on the left of the party have come forward to say they won't. This includes the likes of Richard Burgon, Ian Byrne and Nadia Whittome, who have expressed concerns about a two-tier system. Sky News has spoken to other MPs who privately say they won't back the bill. One rebel said a WhatsApp group has been set up to announce their intentions and he believes 50 have already stated their intention to vote against the bill. Others have told Sky News they are undecided. One rebel said she has \"no idea\" how she'll vote and is \"waiting to see the finer details and how things pan out on Monday\". Another said he expects he will no longer vote against but will make his mind up firmly when he has seen the full details."
    },
    {
        "title": "Starmer warned over fears of 'toothless' Hillsborough Law replacement",
        "description": "More than 130 MPs have urged Sir Keir Starmer to deliver the Hillsborough Law as promised - amid claims it is being watered-down with a \"toothless\" replacement.",
        "url": "https://news.sky.com/story/starmer-warned-over-fears-of-toothless-hillsborough-law-replacement-13389363",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tributes-hillsborough_6887104.jpg?20250415100120",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-06-27 12:21:00",
        "Headline": "Campaigners are concerned that civil servants are trying to \"retain their impunity\" by proposing a weakened version of the Hillsborough Law.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n More than 130 MPs have urged Sir Keir Starmer to deliver the Hillsborough Law as promised - amid claims it is being watered-down with a \"toothless\" replacement. Ian Byrne, the Labour MP for Liverpool West Derby, has written to the prime minister over concerns that officials have \"carved out\" key elements of the long-awaited legislation. Politics live: Labour rebel will still vote against welfare bill despite changes The Hillsborough Law is intended to prevent future state cover-ups by putting a legal duty of candour on public servants to tell the truth, with criminal sanctions for lying. It also includes a commitment to funding so that families receive proportional legal representation in battles with official bodies. The bill had its first reading in 2017 when it was introduced by Andy Burnham and supported by Steve Rotheram who were Labour MPs at the time. In his letter, Mr Byrne said a draft government version of the law, shown to the now Great Manchester and Liverpool City Region mayors respectively and one of the campaign's lawyers in March, did not contain the key provisions. \n                  Welfare concessions 'common sense', says PM - as he defends U-turn\n                 \n                  This has been Starmer's most damaging U-turn yet - but the bigger cost is the political one\n                 \n                  Labour's welfare reform changes explained \n                 In particular, he said it did not contain a duty of candour, only an \"aspirational objective\". He said there was also \"no reference at all\" to the rebalancing of resources for legal representation for families at inquests and inquiries. As Sky News reported at the time, the government paused the process to listen to these concerns, meaning it missed its own deadline to implement the law by the most recent anniversary of the Hillsborough disaster on 15 April. However campaigners have not been shown the latest draft and say meetings with ministers and officials have indicated the Hillsborough Law is still to be replaced with weaker legislation. 'Legally nothing left' In particular, there are concerns the obligation to be truthful would be applied only to some investigations and could even be reduced to a professional duty dealt with by codes or staff handbooks rather than a criminal backstop. A government spokesperson said they are \"fully committed\" to a legal duty of candour with criminal sanctions for those who don't comply. However Elkan Abrahamson, one of the lawyers who drafted the original Hillsborough Law, told Sky News: \"It's easy to talk about commitment but until we see something in writing... we don't know what that means.\" He said that under the government's proposals there would \"legally be nothing left\" of the original bill, adding: \"My message to them is rip up your draft, go back to ours and tell us what the problem is and we will sort it with you.\" The government declined to say what its concerns are with the Hillsborough Law when asked by Sky News. It has said it wants to bring the legislation in \"at pace\" but \"having consulted with campaign groups, we know more time is needed to draft the best version of a Hillsborough Law\".  At the Labour Party conference in Liverpool in 2022 when he was still in opposition, Sir Keir said that \"one of his first\" acts as prime minister if he won the election would be \"to put the Hillsborough Law on the statute book\". The Times has reported officials have concerns that the Hillsborough Law could punish junior civil servants who turn up late for work and lie about it. But in his letter, signed by 136 cross-party MPs and 29 peers, Mr Byrne said \"that is manifestly not correct\". He added: \"We have no doubt that the attempts to replace the bill with wholly deficient and ineffective redrafts are led by those who are most likely to be affected by the Hillsborough Law: senior civil servants and public institutions who want to retain their impunity in protecting their reputations above telling the truth.\" 'Toothless replacement' He called on the prime minister to \"show leadership and strength\" in implementing the Hillsborough Law in full \"and not some toothless replacement\". \"We urge you not to pass up this opportunity to achieve generational culture change, and a step change in the integrity of public life.\" The campaign for the Hillsborough Law follows a decades-long fight for justice for the 97 football fans who were unlawfully killed after gross negligence by police at an FA Cup semi-final between Liverpool and Nottingham Forest at Hillsborough stadium in Sheffield in 1989. Shortly before kick-off, supporters were let through a gate, which caused crowding in the stand and a crush. Nobody has ever been convicted for its subsequent cover-up. The campaign for the legislation is also supported by victims of the Grenfell Tower fire and the infected blood scandal, as well as families bereaved in the COVID pandemic, nuclear test veterans and victims of the Post Office Horizon scandal."
    },
    {
        "title": "Sunburn isn't just red skin - here's what's happening underneath the burn",
        "description": "The government is warning that the NHS will be under even more pressure this weekend as temperatures soar, so looking after yourself in the sunshine is crucial.",
        "url": "https://news.sky.com/story/sunburn-isnt-just-red-skin-heres-whats-happening-underneath-the-burn-13389368",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sunburn-dna_6951865.jpg?20250627134017",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "Since the early 1990s, the number of skin cancer cases in the UK has more than doubled. Last year, the number of cases was predicted to hit an all-time high of 20,800, according to Cancer Research UK.",
        "Content": "\n          Science and technology reporter\n       The government is warning that the NHS will be under even more pressure this weekend as temperatures soar, so looking after yourself in the sunshine is crucial. Read more: Amber heat health alert issued for England But how much do you know about the science behind sunburn… and how to prevent it? What is sunburn? While we all know what sunburned skin looks like - red and sore - it might not be so clear what is happening underneath the skin. \"Essentially, it's inflammation,\" said Dr Rachel Abbott, a consultant dermatologist who specialises in skin cancer for the Cardiff and Vale University health board. \"It's triggered by ultraviolet radiation, primarily UVB but also by UVA.\" \n                  Weight loss and diabetes jabs linked to potentially fatal side effect\n                 \n                  500 families in Oxford call for maternity unit to be investigated\n                 \n                  National investigation into NHS maternity services launched after families 'gaslit'\n                 Ultraviolet radiation is carcinogenic and when it is allowed to penetrate the skin, it triggers an inflammatory reaction, said Dr Abbott. Histamines - chemicals produced by the body's immune system - and prostaglandins - compounds that help the body deal with injuries and illness - are released as your body begins reacting to the damage.  Although the inflamed, red, itchy skin will fade, those carcinogens will do permanent damage to your DNA, according to Dr Abbott. \"The redness and pain can be managed symptomatically, but that DNA damage is permanent,\" she said. \"We've all got DNA repair mechanisms in our bodies. But this is why we're seeing such a massive increase in skin cancer, because [as we get older], the battle between the DNA damage and the skin cells becomes more than the immune system can cope with.\" Since the early 1990s, the number of skin cancer cases in Britain has more than doubled and last year, the number of cases was predicted to hit an all-time high of 20,800, according to Cancer Research UK. The cancer charity partially attributed the rise in cases to older groups of people knowing \"less about the dangers of tanning in their youth\", who \"may have taken advantage of the cheap package holiday boom from the 1960s\". Read more from science and tech:Major pornography sites to introduce 'robust' age verificationDoctors using unapproved AI to record patient meetingsChildren using 'nudifying' apps may not know they're breaking the law This would lead to increased sun exposure and more damaged DNA, increasing the risk of skin cancer further down the line. The 'most effective' protection (and it isn't suncream) There is currently no conclusive treatment to deal with the DNA damage caused by sunburn - although Dr Abbott said there is \"exciting\" work being done in that area. Instead, the way to stop yourself from sustaining long-term damage is to protect yourself from UV rays. \"A lot of people associate temperature with the heat of the sun, whereas actually it's the UV index that's the critical thing. And that usually peaks around midday,\" said Dr Abbott.  Contrary to what some may think (or hope), suncream should be a last resort. Shade \"is the most effective thing\", she said, but if you have to be out in the sunshine, \"obviously we recommend hats, clothing and then sunscreen\". \"It is a last resort for those areas that you can't cover up with clothing and hats, and sunglasses.\" The cancer care charity Macmillan recommends a suncream with a sun protection factor (SPF) of 50, or at least 30, and to reapply it regularly. \"There is no such thing as a safe suntan,\" advises the charity. It also recommends using around six to eight teaspoons of suncream for an adult - one teaspoon for each limb, one for your chest, one for your back and one for your head and neck."
    },
    {
        "title": "Prince William has had a lot to say this week - but is anyone listening?",
        "description": "Prince William has had a lot to say this week, attending three events about the environment as part of London Climate Action Week and giving three speeches.",
        "url": "https://news.sky.com/story/prince-william-has-had-a-lot-to-say-this-week-but-is-anyone-listening-13389500",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-william-prince-of-wales_6952143.jpg?20250627181120",
        "type": "Technology",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "Conflict, not the climate crisis, has been the primary focus of world leaders - a problem you could say for William and all those trying to whip up momentum ahead of COP30 in Brazil.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n Prince William has had a lot to say this week, attending three events about the environment as part of London Climate Action Week and giving three speeches. But I wouldn't be surprised if you haven't really heard what he had to say. The eyes of the world have, understandably, been elsewhere. Conflict, not the climate crisis, has been the primary focus of world leaders and continues to be - a problem you could say for William and all those trying to whip up momentum ahead of COP30 in Brazil, with only four months to go until the UN's climate conference in November. It was William and his team who specifically convened a meeting at St James's Palace on Thursday with the Brazilian ministers in charge of the summit and indigenous leaders from other parts of the world. With Ed Miliband, the secretary of state for energy security and net zero, just a few seats away, William made a call to action, saying: \"We've made bold commitments: to halt deforestation, restore ecosystems, and protect 30% of land, sea, and water by 2030. \"But these goals will remain out of reach unless we move from promises to action - grounded in respect, equity, and shared responsibility. \"Looking ahead to COP30 in Belem and beyond, we must act with greater ambition and deeper collaboration. This is a moment for courage.\" When I put it to a palace source that maybe it all feels a bit futile in the current climate, with attentions firmly elsewhere, I was told there is \"no change in course\" - the prince always has and will continue \"to use his platform to spotlight the need to restore the planet\".  In the past, we've been more used to his father being more vocal. The King's involvement in London Climate Week was more fleeting, albeit involving a handshake with a giant gorilla puppet, and a discussion with the Brazil delegation in which he hinted that he would love to attend the summit in November, saying: \"It's fitting it all in.\" Attendance by either the King or the Prince of Wales hasn't been confirmed yet, although it's looking likely William will go. He told one person this week: \"I'll be in the area\", with his Earthshot Prize being held in Rio in the days running up to the climate conference. But in the coming months, we do now know that father and son will be meeting with one key player, who has certainly voiced very different views on the severity of the climate crisis.  This week, it was confirmed that Donald Trump's full state visit to the UK will go ahead later this year, likely in September. His potentially disruptive presence when it came to the climate debate was hinted at on Tuesday, in front of Prince William, during a speech by former New York mayor Mike Bloomberg. Mr Bloomberg, a global adviser to Earthshot Prize, said: \"There's a good reason to be optimistic, lots of problems around the world, America has not been doing its share lately to make things better, I don't think. Nevertheless, I'm very optimistic about the future.\" Read more:My week with Prince William, the quiet disruptorWilliam releases photo to mark 43rd birthday The King and Prince William have worked in this environmental sphere long enough to weather the frustrations of other distractions, a lack of interest or momentum. I'll never forget in 2015 ahead of COP21, when Islamic State and Syria were dominating the news agenda, Prince Charles told me very firmly that of course there was a link between the civil war in Syria and climate change. He said there was \"very good evidence indeed that one of the major reasons for this horror in Syria was a drought that lasted for about five or six years, which meant that huge numbers of people in the end had to leave the land\". \"It's only in the last few years that the Pentagon have actually started to pay attention to this,\" he added at the time. \"I mean, it has a huge impact on what is happening.\" But as a family, they know how much their global profile and ability to get people in the room can help attract attention that others simply can't. It's easy to be sniffy about that convening power, but as one delegate at an Earthshot event put it, they have an ability to \"bring people together not around politics but purpose\". And in a currently noisy, fractured world, it feels like that is needed more than ever."
    },
    {
        "title": "Sean 'Diddy' Combs's 'private sex life' turned into 'crime scene', defence says in closing argument",
        "description": "Sean \"Diddy\" Combs is facing a \"fake trial\" in which his unusual sexual preferences have been unfairly criminalised and his \"private sex life\" turned into a \"crime scene\", his defence team has argued in the final day of closing arguments.",
        "url": "https://news.sky.com/story/sean-diddy-combss-private-sex-life-turned-into-crime-scene-defence-says-in-closing-argument-13389592",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-sean-diddy-combs-diddy_6952264.jpg?20250627233425",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-06-27 23:01:00",
        "Headline": "On the final day of closing arguments, the defence accused the prosecution of \"badly exaggerating\" the evidence, saying it was confusing threesomes with racketeering.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n  Sean \"Diddy\" Combs is facing a \"fake trial\" in which his unusual sexual preferences have been unfairly criminalised and his \"private sex life\" turned into a \"crime scene\", his defence team has argued in the final day of closing arguments. At the end of week seven in the sex-trafficking trial, Combs's lead counsel, Marc Agnifilo, told the court Combs was the victim of an overzealous prosecution, who had portrayed his \"swinger\" lifestyle as a racketeering conspiracy. Combs is charged with one count of racketeering conspiracy, two charges of sex trafficking, and two charges of transportation to engage in prostitution. He has pleaded not guilty to all charges and has strenuously denied all allegations of sexual abuse. If found guilty, he could face being put behind bars for life. Diddy trial: As it happened Frequently adopting a sarcastic tone, Agnifilo mocked the government's case against Combs, belittling the agents who seized hundreds of bottles of Astroglide lubricant and baby oil at his properties last year. Commenting that America's streets were now \"safe from Astroglide\", he went on, \"Way to go, fellas\", before adding, \"you do you\". \n                  Prosecutors give closing arguments in Sean 'Diddy' Combs trial\n                 \n                  Sean 'Diddy' Combs praises judge and chooses not to testify as trial draws to a close\n                 \n                  Diddy trial latest: Defence lawyer mocks case in closing argument - and says charges have been 'badly exaggerated'\n                 He said prosecutors had \"badly exaggerated\" the evidence against Combs, presenting \"threesomes as racketeering\", arguing that he is not guilty of racketeering conspiracy and sex trafficking. The defence also highlighted the prosecution's decision to indict Combs on a racketeering conspiracy charge alone, flagging that no alleged co-conspirators have been indicted alongside him. The defence's closing arguments lasted for just over four hours, with members of Combs's family, including six of his children and his mother, watching on in the public gallery. Agnifilo said Combs has \"taken care of people\", including Jane, a former girlfriend who testified under a pseudonym, paying for her rent and for her legal representation. The defence lawyer said: \"I don't know what Jane is doing today, but she's doing it in a house he's paying for.\" He went on: \"This isn't about crime. It's about money. This is about money.\" Presenting the trial as a zero-sum game, he described his former girlfriend of almost 11 years Cassie Ventura as the \"winner in this whole thing\", noting that she settled her civil case with Combs for $20m (£14m) in November 2023, as well as a $10m (£7.3m) from the InterContinental Hotel. Cassie and Jane both gave evidence during the trial that they were coerced repeatedly by Combs to perform in drug-fuelled, days-long sex marathons with male sex workers, while Combs watched, directed, masturbated and sometimes filmed the encounters. But the defence accused prosecutors of having invaded Combs's bedroom and his most intimate personal affairs. Agnifilo asked: \"Where's the crime scene? It's [Combs's] sex life.\" Continuing his line of sarcastic quips, he joked, \"We need a bigger roll of crime scene tape\", referencing a line from the classic movie Jaws. Agnifilio's sarcasm irked the prosecution, who later complained to the judge that he was using \"improper arguments\". Read more:Everything you need to know about the trialThe rise and fall of Sean 'Diddy' CombsWhat we learned from Cassie's testimony The defence characterised Combs's relationship with Cassie as \"a great modern love story\", going on to describe her as a \"gangster\" for cheating on him with rapper Kid Cudi. They also characterised the \"freak offs\" as \"beautiful\", saying the videos showed \"everyone smiling\", eating and listening to music, and commenting that Combs was \"not the only man in America making homemade porn\". The defence admitted Combs was a domestic abuser, but said such behaviour did not justify the grave charges he faces. Agnifilo advised the jury to \"Call this as you see it,\" asking them to \"acquit Sean Combs of all the counts\" and \"return him to his family\", who he said has been waiting for him. Combs, who has been in a New York jail since his arrest in September last year, did not give evidence during the trial. Following the defence's closing argument, assistant US attorney Maurene Comey delivered a rebuttal summation in which she said the defence's argument that Cassie, Jane and Mia, a former employee who also testified under a pseudonym, all \"wanted sex\" was a lie, telling the court none of the women had reason to speak anything other than the truth. She also said the \"freak off\" videos tell only \"part of the story\". Comey said Combs had spent the last 20 years believing himself to be \"above the law\", seeing himself as \"untouchable\" and \"a god among men\". She said his impunity would end now in this courtroom, before urging the jury to \"find him guilty\" and \"hold him accountable\". On Monday, the judge will read the law to the jury, after which deliberations will begin. To convict Combs, the 12 jurors must vote unanimously."
    },
    {
        "title": "Glastonbury performers criticise political interference in the festival after Kneecap controversy",
        "description": "Glastonbury 2025 is in full swing, with artists including Charli XCX, The 1975, Olivia Rodrigo, Neil Young, Rod Stewart, and Alanis Morissette among the stars set to entertain the masses this year.",
        "url": "https://news.sky.com/story/glastonbury-performers-criticise-political-interference-in-the-festival-after-kneecap-controversy-13389359",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-glastonbury-festival_6951991.jpg?20250627154253",
        "type": "Entertainment",
        "Author": "Gemma Peplow, culture and entertainment reporter, at the Glastonbury Festival",
        "Date Published": "2025-06-27 12:08:00",
        "Headline": "Kneecap star Liam O'Hanna appeared in court earlier this month charged with a terror offence for allegedly displaying a flag in support of the proscribed group Hezbollah at a Kneecap gig in London last November.",
        "Content": "By Gemma Peplow, culture and entertainment reporter, at the Glastonbury Festival  Glastonbury 2025 is in full swing, with artists including Charli XCX, The 1975, Olivia Rodrigo, Neil Young, Rod Stewart, and Alanis Morissette among the stars set to entertain the masses this year. But politicians who won't even be setting foot on Worthy Farm in Somerset have been making their thoughts known about this year's line-up - in particular the Irish-language rappers Kneecap, who are on the bill on Saturday. The trio made a huge Glastonbury debut last year - impressing the likes of Noel Gallagher, who turned out for a set. But the path to a bigger stage this time round has made headlines for different reasons. Outspoken on the war in Gaza, Liam O'Hanna, or Liam Og O hAnnaidh, appeared in court earlier this month charged with a terror offence, for allegedly displaying a flag in support of the proscribed group Hezbollah at a Kneecap gig in London last November. He is due back in court in August. On social media, he denied support for Hezbollah after the charge was announced, but the trio have held firm on their support for Palestinians. Removed from the bills of some festivals in the run-up to Glastonbury, there were calls from some for them to be taken off here, too - including from the prime minister. When asked by The Sun, Sir Keir Starmer said it was not \"appropriate\", and he did not think they should play. Read more from Sky NewsStar-studded guest list for Bezos weddingCheryl's stalker admits another offence In an interview with The Guardian as the festival got under way, O hAnnaidh, who performs under the stage name Mo Chara, was asked if he regretted what was depicted in a video of the alleged offence that circulated on social media. \"It's a joke,\" he replied. \"I'm a character. Shit is thrown on stage all the time. If I'm supposed to know every f****** thing that's thrown on stage, I'd be in Mensa.\" 👉 Listen to Sky News Daily on your podcast app 👈 He told the newspaper he did not know every proscribed organisation, saying he had enough to think about when he is on stage. \"I'm thinking about my next lyric, my next joke, the next drop of a beat.\" Dilemma for the BBC For the BBC, which broadcasts a lot of the main sets live, it poses a dilemma. When asked if it would be showing Kneecap's set live, a spokesperson said artists were booked by festival organisers and their own plans would ensure editorial guidelines are met. \"Whilst the BBC doesn't ban artists, our plans will ensure that our programming will meet our editorial guidelines,\" they said. \"Decisions about our output will be made in the lead up to the festival.\" Which means it's unlikely they'll be streaming Kneecap live - but some of their set at least may be made available later. To those who object to them being allowed a stage here at all, it's still allowing the band a very prominent platform. But Glastonbury has always leaned left, featuring acts unafraid to share their political views - and hosting former Labour leader Jeremy Corbyn on stage in 2017. Festival founder Michael Eavis told the Glastonbury Free Press that people have always come to the festival for these reasons - and made his views clear: \"People that don't agree with the politics of the event can go somewhere else.\" Singer and activist Billy Bragg, who organises the Left Field stage each year, said Glastonbury has always been political. \"When I first came here in 1984, it was a CND (Campaign For Nuclear Disarmament) festival, and everybody was in opposition, or every young person, was opposed to Margaret Thatcher's policies. And whatever issues - CND, the miners, gay rights, they came, it's always been that. \"So I don't know why everyone's saying this year it's a bit political. It's always been political. I suppose the prime minister saying who can and who can't play might have something to do with it.\" Bragg said he was \"proud\" of Glastonbury organisers for \"standing up to it\" and ignoring the noise.  Accusations of 'corporate control' Politics and pop have always been intertwined for older acts such as Neil Young, who headlines the Pyramid Stage on Saturday - and we know the BBC won't be showing this one live, but perhaps for different reasons. Before his headline slot was confirmed, Young, who began his career in the 1960s with the band Buffalo Springfield, said he had initially turned down the offer to perform, saying the festival was \"under corporate control\" of the broadcaster. Earlier this week, the corporation confirmed it would not show the set live \"at the artist's request\". Singer-songwriter John Fogerty, one of the founders of US blues rock band Creedence Clearwater Revival, is also on the bill this year - and said songwriters should talk about what's going on in the world around them, \"certainly if they have a point of view and they'd like to share it\". There's a balance, he added. \"I was happy to write Proud Mary, which is sort of Americana, you know, sort of love song to America, really. \"But I wrote Fortunate Son right in the middle of the Vietnam War in the late 1960s. And that has a place too. People need to feel free to write more music like that.\" With Donald Trump back in power, the US is in \"political turmoil\", Fogerty said. \"It's almost, you know, I should go sit down somewhere and write a song about this - and then you go, oh my goodness, I already did.\" For fans at Glastonbury, music as ever is the focus here - and the feeling from most is that politicians should stay out of it. \"The prime minister and pop music don't really go together,\" said Bragg. \"I don't think anybody, leader of the opposition either, should say who can and who can't play at a festival.\""
    },
    {
        "title": "Convicted killer jailed for stalking Cheryl admits another restraining order breach after turning up at her home",
        "description": "A convicted killer previously jailed for stalking Girls Aloud singer Cheryl has admitted another breach of his restraining order after turning up at her home.",
        "url": "https://news.sky.com/story/convicted-killer-jailed-for-stalking-cheryl-admits-another-restraining-order-breach-after-turning-up-at-her-home-13389274",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-daniel-bannister-stalker_6856355.jpg?20250314155436",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-27 08:49:00",
        "Headline": "Daniel Bannister, 50, pleaded guilty to the new charge at Reading Magistrates' Court on Tuesday.",
        "Content": "A convicted killer previously jailed for stalking Girls Aloud singer Cheryl has admitted another breach of his restraining order after turning up at her home. Daniel Bannister, 50, pleaded guilty to the new charge at Reading Magistrates' Court on Tuesday. Confirming his plea, he told the court he attended an address he \"reasonably believed or suspected\" was the star's home. A court previously heard Bannister \"can't stay away\" from the 41-year-old singer. He was jailed for 16 weeks in March for repeatedly turning up at Cheryl's Buckinghamshire home while under a restraining order. He had initially been jailed for four months in September last year and was handed a three-year restraining order, which he breached when he turned up at her home unannounced in December 2024. At the March hearing, Cheryl said she \"immediately panicked\" when he rang the bell at the gate and was \"terrified\" when she saw him - fearing for the safety of her eight-year-old son Bear. In 2012, Bannister killed 48-year-old Rajendra Patel in an attack at a south London YMCA shelter and pleaded guilty to manslaughter. He was remanded in custody on Friday and will appear at Reading Crown Court on 23 September. Read more from Sky NewsStar-studded guest list for Bezos' weddingBrad Pitt's home burgledProsecution accuses 'Diddy' of criminal enterprise Bear's father, former One Direction star Liam Payne, died last October in Buenos Aires, Argentina, after falling from his third-floor hotel balcony. Cheryl described his death as \"indescribably painful\", as she voiced fears about protecting their son."
    },
    {
        "title": "The 'rascal' and the radical: How Michael and Emily Eavis have shaped Glastonbury",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>",
        "url": "https://news.sky.com/story/the-rascal-and-the-radical-how-michael-and-emily-eavis-have-shaped-glastonbury-13389479",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-daily-podcast-270625_6951933.png?20250627144423",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-06-27 15:38:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈 Around 200,000 music fans have descended on Worthy Farm in Somerset for this year's Glastonbury Festival.  Days before this year's event began, its owner Michael Eavis announced he was transferring most of his financial stake in Glastonbury to his daughter Emily Eavis. So, who is the new owner of Glastonbury? Host Niall Paterson is joined by Sky's arts and entertainment editor Claire Gregory as they look back at the unlikely transformation of Michael Eavis, from dairy farmer to festival mastermind, and ask how Emily Eavis may shape Glastonbury's future. Niall also speaks to artist Joe Rush, who has known Mr Eavis since 1985. Producer: Natalie KtenaEditors: Philly Beaumont and Rosie Gillott"
    }
]