[
    {
        "title": "Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans",
        "description": "The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-to-invest-billions-at-spending-review-as-voters-yet-to-feel-benefits-of-labour-government-13381810",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-10 18:24:00",
        "Headline": "The chancellor will confirm the budgets for each government department, as well as where she will invest billions in capital. But the Tories say this will be \"a dangerous economic gamble that risks the country's financial future\".",
        "Content": " The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK. However, Rachel Reeves will admit that \"too many people\" are yet to feel the benefits of the government's work so far. In the House of Commons, she will confirm the budgets for each government department over the next three years - with boosts expected for schools, defence and the NHS. Ms Reeves will vow to spend vast sums of money across the country to \"ensure that renewal is felt in people's everyday lives, their jobs, their communities\". She is also pledging to set out \"reforms that will guarantee towns and cities outside London and the South East can benefit from new investment\". Tap here for the latest political news Ms Reeves is expected to say: \"This government is renewing Britain. But I know too many people in too many parts of the country are yet to feel it. \n                  Holiday coming up? Here's how data roaming charges compare by network\n                 \n                  Steep rise in equity release - here are pros and cons\n                 \n                  How chaotic gang of British 'geeks' launched one of most lucrative gaming franchises of all time\n                 \"This government's task - my task - and the purpose of this spending review - is to change that ... So that people can see a doctor when they need one. Know that they are secure at work. And feel safe on their local high street. \"The priorities in this spending review are the priorities of working people. To invest in our country's security, health and economy so working people all over our country are better off.\"  Watch live coverage of the spending review on Sky News from 12pm Ms Reeves will formally confirm \"the biggest-ever local transport infrastructure investment in England's city regions\" - worth £15.6bn - as well as £86bn to \"boost science and technology\", including by building the Sizewell C nuclear power station. She will also announce the extension of the £3 cap on bus fares, Sky News understands. The cap - which Labour lifted from £2 - was due to expire at the end of this year. Meanwhile, £39bn for a new Affordable Homes Programme over the next 10 years is set to be unveiled, with the government seeking to ramp up housebuilding to hit its manifesto pledge of 1.5 million new homes by the end of this parliament.  The chancellor will argue: \"The choices in this spending review are possible only because of the stability I have introduced and the choices I took in the autumn.\" One of those choices included cutting the winter fuel allowance for almost all pensioners - a decision the government has now U-turned on at a cost of £1.25bn. However, she is not expected to explain where that money will come from until the budget this autumn. Ms Reeves will tell MPs: \"I have made my choices. In place of chaos, I choose stability. In place of decline, I choose investment. In place of retreat, I choose national renewal. \"These are my choices. These are this government's choices. These are the British people's choices.\" Read more:Why the spending review is a massive dealFive things you need to know But shadow chancellor Sir Mel Stride said this will be \"the 'spend today, tax tomorrow' spending review\" - arguing that the government is \"spending money it doesn't have, with no credible plan to pay for it\". He said in a statement: \"Rachel Reeves talks about 'hard choices' - but her real choice has been to take the easy road. Spend more, borrow more, and cross her fingers. This spending review won't be a plan for the future - it will be a dangerous gamble with Britain's economic stability.\" He went on: \"Today, we'll hear slogans, spin and self-congratulation - but not the truth. Don't be fooled. Behind the spin lies a dangerous economic gamble that risks the country's financial future.\""
    },
    {
        "title": "The spending review is a massive deal for Rachel Reeves, Labour, and the country - here's what to expect",
        "description": "This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - &#163;600bn over the next three to four years.",
        "url": "https://news.sky.com/story/the-spending-review-is-a-massive-deal-for-rachel-reeves-labour-and-the-country-heres-what-to-expect-13381824",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935131.jpg?20250605145315",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-10 19:05:00",
        "Headline": "This is a huge political moment for this Labour government - and a chance for Rachel Reeves to sell this government's story of 'renewal'.",
        "Content": "\n          Political editor\n              @BethRigby\n  This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - £600bn over the next three to four years. But it is also a massive political moment as the Labour government tries to turn the corner on a difficult first year and show voters it can deliver the change it promised. It is not, say No 10 insiders, another reset - but rather a chance to show \"working people\" why they voted Labour. Look at the blitz of announcements over recent days, and this is a government trying to sell the story of renewal. Tap here for the latest political news  On Tuesday, the prime minister and his energy secretary, Ed Miliband, announced the biggest nuclear building programme for half a century - with £14.2bn being poured into Sizewell C on the Suffolk coastline to create over 10,000 jobs over the next decade and provide energy security. Last week, the chancellor announced £15bn for new rail, tram and bus networks across the West Midlands and the North. She's also expected to green-light a new rail line between Liverpool and Manchester on Wednesday, and invest capital in housebuilding. In total, there will be £113bn of additional capital investment, which the government will frame as the long-promised \"decade of renewal\" around the three pillars of security, health and the economy. But that is only one half of this spending review and only one half of the story we will hear today, because the largesse of the capital investment - which the chancellor will say is only possible because of the choices she made in the first year of government - will be matched with spending settlements for day-to-day spending across Whitehall that will draw into sharp relief the choices and priorities for this government. Security and health are two of her pillars, and it will be defence and health that will take a bigger share of the spending pot.  Frustration in the Home Office Having front-loaded day-to-day spending into the first and second years of this Labour administration, the overall pot will rise by 1.2% in real terms every year for the rest of the parliament. That is pretty modest growth and, bluntly, it means that if the defence and NHS budgets get a bigger share of the pot, there will be real terms cuts in some unprotected departments. One to watch is the Home Office, where the home secretary was the last to hold out on a settlement and seems to have had it imposed on her by the chancellor. Hers is a huge brief, spanning police - including the manifesto pledge to increase police on the beat by 13,000 - border security, immigration and homeland security. There is frustration in the Home Office that while \"security\" is one of the government's pillars, it is the Ministry of Defence that has been given the funding. If Yvette Cooper is to deliver on police numbers, what else might have to give? Watch too for a squeeze on council budgets as the chancellor uses her capital budget to invest in housebuilding, while day-to-day spending is squeezed across our councils, schools and courts.  Reeves under pressure to boost spending This is the rub. Rachel Reeves will insist at lunchtime that spending is rising by £190bn more over the course of the parliament, partly because of those tough tax rises in her first budget. But largesse in capital investment won't be able to disguise the short-term pressures on day-to-day spending from a Labour Party and a set of voters fed up with cuts and feeling like their lives aren't improving. The winter fuel reversal is the proof. The chancellor, who will not loosen her fiscal rule of funding day-to-day spending through tax receipts, has to find £1.25bn to pay the allowance to nine million pensioners this winter. She is also under pressure to lift the two-child benefits cap, with Liz Kendall, Bridget Phillipson and Sir Keir Starmer all thought to want this to happen. That will cost up to £3bn. There is pressure to change the disability cuts in order to get the welfare changes through parliament. The point is that the chancellor is under huge pressure to lift spending, not keep her foot on its throat, and that means into the autumn, the clamour for targeted tax rises will only grow. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Can Reeves sell this government's 'renewal' story? But amongst the top team, there is some guarded optimism. The political pain of the winter fuel allowance U-turn has eased the pressure on the doorstep: one very senior Labour politician told me this week that last weekend was the first time in a long time that the matter didn't come up on the doorstep and \"the first time in a long while that it felt alright\". At lunchtime, there will be pain. The headlines will scream cuts and open up talk about tax rises that will run right up to the budget in October. But it will also be a moment where this Labour government can show voters in the form of dozens of projects and thousands of jobs, that it does have a plan to rebuild. Read more:Guide to the spending reviewFive things you need to know about the spending reviewNew nuclear power station gets green light  It is a spending review that will define Labour in power for the rest of this parliament and how our country looks and feels for years to come. The political aim is to do enough - be it on hospital waiting lists, energy bills, wages, or shovels in the ground - to persuade voters at the next election to give Labour another chance. For months, MPs have been quietly grumbling that this Labour government is in power without a story to tell. On Wednesday, we'll see how well Ms Reeves can write, and sell, the next chapter."
    },
    {
        "title": "'Dark day' in Austria as 10 people are killed in school shooting ",
        "description": "Students and adults are among 10 victims who were killed after a gunman opened fire at a secondary school in the Austrian city of Graz.",
        "url": "https://news.sky.com/story/dark-day-in-austria-as-10-people-are-killed-in-school-shooting-13381921",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-austria-graz-shooting_6938709.jpg?20250610213233",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-10 21:16:00",
        "Headline": "Police have said the 21-year-old Austrian gunman was found dead in the toilets of the school after the shootings and was operating alone.",
        "Content": "Students and adults are among 10 victims who were killed after a gunman opened fire at a secondary school in the Austrian city of Graz. Interior minister Gerhard Karner said earlier that a further 12 people were injured in the shooting at the BORG Dreierschützengasse high school in Austria's second-biggest city. He gave the figure before it was confirmed that a person in hospital with life-threatening injuries had become the 10th person to die. It is not clear if this reduces the number of those injured to 11. The interior minister also said the suspect was a former pupil of the school who didn't finish his studies. Police have confirmed that the 21-year-old Austrian gunman was found dead in the toilets of the school after the shootings and was operating alone. News correspondent When 'M' - a 16-year-old student - saw mentions of a school shooting on his phone, he assumed it was yet another tragedy in the US.  But it couldn't have been closer to home. Three students in his class had been killed - his own cousin had been shot in the shoulder.  M only escaped the carnage because he was off school sick.  After the terror and panic of Tuesday morning, an eerie calm has settled over these streets. People stand in silence staring past the wire fence that guards the school - through the windows you can see the still-lit corridors; a handful of police officers standing guard outside the main entrance.  There are, no doubt, many more police inside the school - out of our view, still gathering evidence - trying to answer the question that's on everyone's minds: why?  Why did a former student take two guns - seemingly legally owned - into his former classrooms, and open fire?  It's reported a 'farewell letter' was found by authorities at the gunman's home. But can that really provide answers to such a senseless loss of young life?  M knows he will never feel secure walking through these corridors again, in a school and town he said was always quiet and safe.  Austria has one of the highest rates of gun ownership in Europe, but mass shootings have been - before Tuesday - extremely rare.  A national conversation about its gun laws and ownership loopholes must surely follow these coming days of national mourning. Authorities say the suspect had two weapons - reported to be a shotgun and a pistol - which he appeared to have owned legally. Police have said they did not have information about his possible motive. \n                  Ballymena protests: It is hard to see where the violence will end - and it could go on for weeks \n                 \n                  Ballymena protest: Fireworks, petrol bombs and glass bottles thrown at riot police as serious disorder deepens\n                 \n                  Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans\n                 Footage shared online revealed how gunshots and screaming could be heard after the suspect entered the school before opening fire. French education minister Elisabeth Borne has said that one of those who died was a \"young fellow citizen\" of France. It came as the mother of a child who survived the shooting retold the distressing moment she received a phone call from her son. \"My son called me to say he was in school and that he was being shot and that he thought he was going to die,\" she said. She only found out two hours later that he was still alive. Read more:What we know about the shooting so far Special forces were among those sent to the school, just under a mile from Graz's historic centre, after a call at 10am local time (9am UK time) on Tuesday. About an hour and half later, police wrote on X that the school had been evacuated and everyone had been taken to a safe meeting point. Police deployed in large numbers, with emergency vehicles guarding the area around the school and with at least one police helicopter flying above. Graz is located in the southeast of the country and about 300,000 people live there. A 'dark day' Austrian Chancellor Christian Stocker said there would be three days of national mourning, with the Austrian flag lowered to half-mast and a national minute of mourning at 10am on Wednesday. He said that it was \"a dark day in the history of our country\". President Alexander Van der Bellen said that \"this horror cannot be captured in words\". \"These were young people who had their whole lives ahead of them. A teacher who accompanied them on their way,\" he said. Well-wishers later lit candles and placed them in the main square in Graz city centre on Tuesday night as a tribute to the shooting victims. People were seen quietly reflecting as the city tried to come to terms with the deadly attack. The school where the attack took place had earlier posted a message on Instagram following the tragedy. The message is written in German, the official language of Austria, and translates in English to: \"It was a really terrible day that deeply impacted and affected us all. \"Let us continue to stand together as a school community and support one another. \"Your teachers and your principal.\""
    },
    {
        "title": "Foreign sec flies to Gibraltar - with hopes of securing a post-Brexit deal with Spain",
        "description": "Foreign Secretary David Lammy is in Gibraltar ahead of a potential post-Brexit deal with Spain.",
        "url": "https://news.sky.com/story/foreign-sec-flies-to-gibraltar-with-hopes-of-securing-a-post-brexit-deal-with-spain-13381942",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gibraltar-spain-uk_6938836.jpg?20250611012525",
        "type": "Home",
        "Author": "Tim Baker",
        "Date Published": "2025-06-10 23:35:00",
        "Headline": "The situation in Gibraltar has been up in the air since Brexit. It is known for its strategic location at the entrance to the Mediterranean, and is home to an RAF base. Spain claims the area belongs to them.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Foreign Secretary David Lammy is in Gibraltar ahead of a potential post-Brexit deal with Spain. Ever since the UK left the EU, the situation in the British Overseas Territory has been up in the air, with London, Madrid and Gibraltar all engaged in negotiations on a path forward. Spain disputes the UK's ownership of the territory, which is located on the south of the Iberian peninsular opposite North Africa. Known for its strategic importance at the entrance to the Mediterranean, Gibraltar is also home to an RAF base. Mr Lammy arrived in Gibraltar overnight on a ministerial plane. A government spokesperson told Sky News last night: \"The foreign secretary is in Gibraltar to meet chief minister Fabian Picardo to discuss the latest on negotiations, as all sides look to conclude an agreement as soon as possible.\" It is possible a deal could be announced in Brussels at some point in the future. Foreign secretaries visiting Gibraltar is unusual, with the last official visit appearing to have been from Dominic Raab in March 2021. Mr Picardo was in London last week to discuss negotiations with UK ministers. Local media has reported that a deal could be announced \"imminently\". Earlier on Tuesday, the EU proposed removing Gibraltar from its list of \"high risk third countries\" when it comes to money laundering. If a deal is announced on Wednesday, it would coincide with the UK government's spending review. Any agreement would be closely scrutinised by eurosceptics in Reform and the Conservative Party, who have criticised Sir Keir Starmer's EU reset deal and the handing over of the Chagos Islands to Mauritius. How to deal with border crossings A bespoke agreement on Gibraltar - which was captured by the UK in the early 18th century - was required after Brexit as Spain objected to it being included in the EU wide negotiations. Since the UK left the EU, a reciprocal agreement to not stamp passports has been in place on both sides of border for Gibraltar residents entering Spain and Spaniards travelling the other way. However, all sides have wanted to get a proper deal in place before the EU's new entry/exit system comes into place, which is now slated for October this year - despite it being delayed multiple times. In proposals made in 2021, the EU said it wanted to see Spanish authorities get extensive powers over immigration into Gibraltar from outside the Schengen free movement area, with EU institutions given the power to enforce the relevant laws in the territory. Both the UK and Gibraltar have opposed such an extensive presence, and amended proposals were made. The previous Conservative government and current Labour administration have said they would not agree to any deal that handed Gibraltar over to another state, or one that Gibraltar was not happy with. In September last year, Mr Lammy and Mr Picardo met in London. The foreign secretary said afterwards he \"reaffirmed our support to them in all eventualities and reiterated that we will only agree to terms that Gibraltar is content with\". Since Labour took power just under a year ago, negotiations have continued. 👉Listen to Politics at Sam and Anne's on your podcast app👈 In October, Mr Picardo said proposals had been made that \"guarantee the safety and security of the SchengenArea and the integrity of the single market\". Last month, EU council chief Antonia Costa said the sides were \"not very far\" from finishing a deal."
    },
    {
        "title": "Sanctioning of ministers adds to Israel's growing ostracisation over Gaza and West Bank",
        "description": "This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington.",
        "url": "https://news.sky.com/story/sanctioning-of-ministers-adds-to-israels-growing-ostracisation-over-gaza-and-west-bank-13381689",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-netanyahu-iran-nuclear-weapons_6931992.jpg?20250531154244",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-10 14:15:00",
        "Headline": "The UK government has announced sanctions against Israel's finance minister Bezalel Smotrich and national security minister Itamar Ben-Gvir.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington. It adds to the growing ostracisation of Israel over its war in Gaza and conduct in the occupied West Bank. Read more: UK government sanctions Israeli ministers Bezalel Smotrich is Israel's far-right finance minister, a Jewish settler and someone who has denied the existence of Palestinians as a people. He has most recently said \"not a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. Itamar Ben-Gvir, the country's far-right national security minister, was once convicted of supporting a Jewish terrorist organisation and advocated the expulsion of Palestinians from their lands. Their critics will say their sanctioning has been a long time coming, is largely symbolic, and will achieve little. The British government singles out Israel's conduct in the West Bank as grounds for its action against the two men. Extremist Jewish settlers have run rampant across the occupied territories under Benjamin Netanyahu's government, with 1,900 recorded acts of violence against Palestinians since January last year. The Netanyahu government has approved a record number of new Jewish settlements in the West Bank. Under international law, all settlements on occupied land are illegal. Politics latest: Sanctions 'a major step' Israel is increasingly isolated over its war in Gaza and actions on the West Bank. The International Criminal Court has issued arrest warrants for Mr Netanyahu and other senior figures over alleged war crimes. A number of countries and observers have deemed its conduct in Gaza as genocidal. Israel described the sanctions as unacceptable and outrageous. However, critics will wonder why the Israeli prime minister is not sanctioned himself for keeping two such deeply controversial figures in his government. There is, though, a good reason for keeping them. Without them, his fragile coalition would almost certainly fall from power. The price for that though is only increasing."
    },
    {
        "title": "Dozens more killed near food distribution centre in Gaza, claims Hamas-run health ministry",
        "description": "At least 36 people were killed and 208 wounded when Israeli forces fired towards crowds near a food distribution centre in Gaza on Tuesday morning, according to the Hamas-run territory's health ministry.",
        "url": "https://news.sky.com/story/dozens-more-killed-near-food-distribution-centre-in-gaza-claims-hamas-run-health-ministry-13381825",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-aid_6938770.jpg?20250610221130",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-10 19:08:00",
        "Headline": "Footage shows people shouting and screaming as they flee explosions in the distance. Dead and wounded people can be seen being carried away from the scene while thick smoke billows into the air.",
        "Content": " At least 36 people were killed and 208 wounded when Israeli forces fired towards crowds near a food distribution centre in Gaza on Tuesday morning, according to the Hamas-run territory's health ministry. Footage supplied to Sky News shows people shouting and screaming as they flee explosions in the distance. Dead and wounded people can be seen being carried away from the scene while thick smoke billows into the air. The incident is the latest in a series of reports of Palestinians being killed by Israeli gunfire near one of the distribution centres operated by a new organisation which is permitted by the IDF to hand out aid in the territory. One man seen in the footage says: \"We want to live, we want to eat. We have children and wives. We want to live in our homes. Three years of war, bodies ripped apart, all this, for some flour.\" Humanitarian aid workers and experts have warned Israel's blockade of Gaza and its military campaign has pushed the besieged enclave to the brink of famine. Around 160 people have been killed in shootings near aid sites run by the new Israel and US-backed organisation, the health ministry has said. The Gaza Humanitarian Foundation, which runs the sites, said there has been no violence in or around the distribution centres themselves. However, it has warned people to stay on designated access routes and paused delivery last week while it held talks with Israel's military on improving safety. Israel's military said in a statement its forces fired warning shots at suspects who were advancing and posed a threat to troops \"despite warnings that the area is an active combat zone\". It said it was aware of reports several people had been injured but its initial inquiry suggests the number \"does not align with the information held\" by the Israeli military. \"The warning shots were fired hundreds of metres from the aid distribution site, prior to its opening hours and toward the suspects who posed a threat to the troops,\" it said, adding that the details are under review. The government media office of Hamas said: \"In a new crime added to the bloody record of the 'Israeli' occupation, the number of victims of the 'Israeli-American aid distribution centres' since Tuesday morning rose to 36 martyrs and more than 208 injuries, bringing the total number of victims of the 'Israeli-American aid distribution centres' to 163 martyrs and 1,495 injuries, all of whom are starving civilians seeking a living under siege and starvation.\" Read more:Sanctioning of ministers adds to Israel's growing ostracisation over Gaza and West Bank Israeli government ministers sanctioned It comes as the UK government sanctioned two Israeli government ministers due to their \"repeated incitements of violence against Palestinian civilians\", the Foreign Office said. The UK imposed sanctions on Itamar Ben-Gvir and Bezalel Smotrich alongside Australia, Canada, New Zealand and Norway. They are being sanctioned in their personal capacities and are now subject to a freeze on UK assets and director disqualifications, and banned from entering the country. The sanctions were criticised by US secretary of state Marco Rubio who said on X: \"These sanctions do not advance US-led efforts to achieve a ceasefire, bring all hostages home, and end the war.\"  Greta Thunberg accuses Israel of 'illegal act' Earlier in the day Greta Thunberg accused Israel of committing \"an illegal act\" after the Gaza-bound aid boat she was on was seized by the country's military and she was deported to France."
    },
    {
        "title": "Police treating death of teenager missing for more than a month as unexplained",
        "description": "The death of a teenager who went missing more than a month ago is being treated as unexplained, police have said.",
        "url": "https://news.sky.com/story/police-treating-death-of-teenager-missing-for-more-than-a-month-as-unexplained-13381746",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-scotland-missing_6929391.jpg?20250609090341",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-10 16:02:00",
        "Headline": "Extensive inquiries are being carried out by police following the discovery of a body in the search for 19-year-old Cole Cooper, Police Scotland said.",
        "Content": "The death of a teenager who went missing more than a month ago is being treated as unexplained, police have said. Extensive inquiries are being carried out following the discovery of a body in the search for Cole Cooper, 19, Police Scotland said. The teenager was last seen by a school friend on 7 May in the village of Longcroft near Falkirk, in central Scotland, when he asked a school friend for a lift, which he was not given. He was reported missing by his family on 9 May. A body was found around 4.15pm on Friday last week in a wooded area in Banknock, Falkirk, after a major search. Formal identification is yet to take place, but Mr Cooper's family have been informed and police said dedicated officers continue to support them. Mr Cooper was last seen on CCTV on 4 May in Longcroft and officers revisited the scene on 8 June and spoke to more than 150 people. Police said establishing his movements between Sunday 4 May and Wednesday 7 May is a priority for officers. Chief Inspector Alex Hatrick said: \"Cole Cooper's disappearance and the circumstances leading up to it remain unexplained. \"We remain in regular contact with the family to ensure they are kept up to date with all aspects of the investigation. \"We will continue to support them and provide them with updates as our inquiries progress. \"Extensive inquiries are ongoing to piece together Cole's last movements and find answers for his loved ones.\" Officers are examining more than 2,000 hours of CCTV footage and are continuing door-to-door inquiries in Longcroft and Banknock. Read more from Sky News:What we know so far about school shooting in AustriaFootage shows alleged sword attacker unboxing weaponGreta Thunberg accuses Israel of 'illegal act' after deportation 'Shattered hearts' In a statement posted on the Missing Person Cole Cooper group on social media, his family said they were \"completely broken\". \"With shattered hearts, we share the devastating news that our beloved Cole, who was missing, has been found - but not in the way we hoped or prayed for,\" they said. \"Our worst fears have become reality, and we are now living a nightmare we can't wake up from.\" They added: \"Cole, you were our world - and now our world will never be the same. \"Your life was only just beginning. The world didn't get to know the light you carried, but we did - and we will carry it with us, always.\" Mr Cooper's family said they have been left with unanswered questions, but thanked those who have supported them."
    },
    {
        "title": "Court shown footage of alleged Hainault sword attacker unboxing samurai weapon",
        "description": "Police have released video footage of the alleged killer of a 14-year-old boy unboxing a samurai sword and calling the weapon \"freaking sexy\".",
        "url": "https://news.sky.com/story/court-shown-footage-of-alleged-hainault-sword-attacker-unboxing-samurai-weapon-13381667",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-marcus-monzo_6938346.jpg?20250610140156",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-10 13:18:00",
        "Headline": "Marcus Monzo, 37, denies murdering Daniel Anjorin, 14, and attempting to kill four others during a 20-minute rampage in Hainault, east London, on 30 April last year.",
        "Content": " Police have released video footage of the alleged killer of a 14-year-old boy unboxing a samurai sword and calling the weapon \"freaking sexy\". Marcus Monzo, 37, denies murdering teenager Daniel Anjorin and attempting to kill four others during a 20-minute rampage in Hainault, east London, on 30 April last year. Jurors at the Old Bailey have been shown a four-minute video clip from 4 April, which was recovered from his iPhone after his arrest. The Spanish-Brazilian national, from Newham in east London, appears to be reviewing a sword he says was \"handmade in Japan\" and \"took more than a month to reach me\". Dressed in a yellow hoodie, black shorts, toe socks and flipflops, and wearing headphones, he is standing on black mats next to a ginger cat he calls the \"Wizard\". A martial arts-style punching bag and another sword on a skateboard can be seen in the background. \"This just came through… Ninja stuff,\" he says before opening a long box containing a sword. \"So I'm sort of obliged to do some ninja stuff with the Wizard.\" Monzo also says \"freaking sexy\" and \"ooh\" as he lunges and makes different moves with the sheathed sword. The court has previously heard Monzo was a \"talented martial artist\". Prosecutors said he \"killed and skinned\" his cat before driving his grey Ford Transit van at speed into pedestrian Donato Iwule. He then struck him in the neck with the same weapon used to kill Daniel, who suffered \"essentially a near-decapitation\", the jury was earlier told. PC Yasmin Mechem-Whitfield was also repeatedly struck with the 60cm blade, before Monzo entered a nearby house and attacked a couple inside, then struck another police officer, it is alleged. Monzo has pleaded guilty to two counts of possessing an offensive weapon - a katana sword and a tanto katana sword. He denies charges of murder, attempted murder, wounding with intent, aggravated burglary and possession of a bladed article. Read more from Sky News:What we know about Austria school shooting15 police officers injured as Northern Ireland protests turn violent The jury has been told there is no issue about who carried out the attacks and that Monzo was under the influence of cannabis at the time. But prosecutors say his psychotic state was self-induced and does not meet the threshold for diminished responsibility. The trial continues."
    },
    {
        "title": "Ballymena protest: Fireworks, petrol bombs and glass bottles thrown at riot police as serious disorder deepens",
        "description": "Fireworks, petrol bombs and glass bottles have been thrown at riot police as unrest in Ballymena continued for a second night.",
        "url": "https://news.sky.com/story/ballymena-protest-fireworks-petrol-bombs-and-glass-bottles-thrown-at-riot-police-as-serious-disorder-deepens-13381896",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ballymena-ni_6938827.jpg?20250610231241",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-10 20:46:00",
        "Headline": "The violent disorder started on Monday, following a peaceful protest supporting the family of a girl who was allegedly sexually assaulted in the area over the weekend.",
        "Content": " Fireworks, petrol bombs and glass bottles have been thrown at riot police as unrest in Ballymena continued for a second night. Water cannon and plastic baton rounds were used to disperse hundreds of protesters in the Co Antrim town - with officers wearing armour and carrying shields. Several blazes were reported in the worst-affected areas, with cars set alight and house windows smashed. Police sirens continued to blare throughout the town past midnight. Clothes belonging to at least one protester caught fire during the disorder. Some properties displayed signs about the nationality of the residents inside - including one saying \"British household\". Sky correspondent Connor Gillies, who is in Ballymena, says some families have had to barricade themselves into the attics of their homes as the clashes worsen. \"The talk here in this town is that it could go on for weeks yet,\" he added. \n                  Ballymena protests: It is hard to see where the violence will end - and it could go on for weeks \n                 \n                  15 officers injured after masked rioters threw missiles as Northern Ireland protest turned violent\n                 \n                  Marian Beattie: Fresh appeal over 1973 murder of 18-year-old\n                 The violent disorder started on Monday, following a peaceful protest supporting the family of a girl who was allegedly sexually assaulted in the area over the weekend. Two 14-year-old boys were charged with attempted rape and were remanded in custody when they appeared at Coleraine Magistrates' Court on Monday. The charges were read to them by a Romanian interpreter. The Police Service of Northern Ireland said on Tuesday that it had made a third arrest in connection with the alleged rape, and is continuing to urge anyone with information to come forward. The 28-year-old man has since been unconditionally released from custody following questioning. PSNI Assistant Chief Constable Ryan Henderson described the scenes in Ballymena as \"racist thuggery\" and said the force was \"actively working to identify those responsible\" for the \"racially motivated disorder\". Mr Henderson said people from ethnic minorities have \"felt fear\" - and there will be a significant policing operation in the town in the coming days to reassure the community. At least 15 police officers were injured on Monday. A 29-year-old man was arrested during the unrest on Monday night and charged with riotous and disorderly behaviour, attempted criminal damage and resisting police. Mr Henderson said other arrests are expected following the examination of video footage. Local MP Jim Allister said tensions over immigration had been building for some time. Mr Henderson said there was no intelligence suggesting the disorder was orchestrated, but added that some at the protest were \"clearly intent on violence\" and had prepared petrol bombs and masonry to use as missiles. Read more from Sky News:Reeves to invest 'billions' at spending reviewUK sanctions Israeli minister in 'major step' Downing Street said there was \"no justification\" for the violence. Sir Keir Starmer's spokesman said: \"The disorder we saw in Ballymena is very concerning.\" He added: \"Obviously, the reports of sexual assault in the area are extremely distressing, but there is no justification for attacks on police officers while they continue to protect local communities. \"PSNI and the justice system must be allowed to carry out their jobs and our thoughts are with the victims of the assault as well as the police officers who were injured.\" Hilary Benn, secretary of state for Northern Ireland, said on X that the \"terrible scenes of civil disorder\" seen on Monday and Tuesday night \"have no place in Northern Ireland\"."
    },
    {
        "title": "Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans",
        "description": "The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-to-invest-billions-at-spending-review-as-voters-yet-to-feel-benefits-of-labour-government-13381810",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-10 18:24:00",
        "Headline": "The chancellor will confirm the budgets for each government department, as well as where she will invest billions in capital. But the Tories say this will be \"a dangerous economic gamble that risks the country's financial future\".",
        "Content": " The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK. However, Rachel Reeves will admit that \"too many people\" are yet to feel the benefits of the government's work so far. In the House of Commons, she will confirm the budgets for each government department over the next three years - with boosts expected for schools, defence and the NHS. Ms Reeves will vow to spend vast sums of money across the country to \"ensure that renewal is felt in people's everyday lives, their jobs, their communities\". She is also pledging to set out \"reforms that will guarantee towns and cities outside London and the South East can benefit from new investment\". Tap here for the latest political news Ms Reeves is expected to say: \"This government is renewing Britain. But I know too many people in too many parts of the country are yet to feel it. \n                  Holiday coming up? Here's how data roaming charges compare by network\n                 \n                  Steep rise in equity release - here are pros and cons\n                 \n                  How chaotic gang of British 'geeks' launched one of most lucrative gaming franchises of all time\n                 \"This government's task - my task - and the purpose of this spending review - is to change that ... So that people can see a doctor when they need one. Know that they are secure at work. And feel safe on their local high street. \"The priorities in this spending review are the priorities of working people. To invest in our country's security, health and economy so working people all over our country are better off.\"  Watch live coverage of the spending review on Sky News from 12pm Ms Reeves will formally confirm \"the biggest-ever local transport infrastructure investment in England's city regions\" - worth £15.6bn - as well as £86bn to \"boost science and technology\", including by building the Sizewell C nuclear power station. She will also announce the extension of the £3 cap on bus fares, Sky News understands. The cap - which Labour lifted from £2 - was due to expire at the end of this year. Meanwhile, £39bn for a new Affordable Homes Programme over the next 10 years is set to be unveiled, with the government seeking to ramp up housebuilding to hit its manifesto pledge of 1.5 million new homes by the end of this parliament.  The chancellor will argue: \"The choices in this spending review are possible only because of the stability I have introduced and the choices I took in the autumn.\" One of those choices included cutting the winter fuel allowance for almost all pensioners - a decision the government has now U-turned on at a cost of £1.25bn. However, she is not expected to explain where that money will come from until the budget this autumn. Ms Reeves will tell MPs: \"I have made my choices. In place of chaos, I choose stability. In place of decline, I choose investment. In place of retreat, I choose national renewal. \"These are my choices. These are this government's choices. These are the British people's choices.\" Read more:Why the spending review is a massive dealFive things you need to know But shadow chancellor Sir Mel Stride said this will be \"the 'spend today, tax tomorrow' spending review\" - arguing that the government is \"spending money it doesn't have, with no credible plan to pay for it\". He said in a statement: \"Rachel Reeves talks about 'hard choices' - but her real choice has been to take the easy road. Spend more, borrow more, and cross her fingers. This spending review won't be a plan for the future - it will be a dangerous gamble with Britain's economic stability.\" He went on: \"Today, we'll hear slogans, spin and self-congratulation - but not the truth. Don't be fooled. Behind the spin lies a dangerous economic gamble that risks the country's financial future.\""
    },
    {
        "title": "Foreign sec flies to Gibraltar - with hopes of securing a post-Brexit deal with Spain",
        "description": "Foreign Secretary David Lammy is in Gibraltar ahead of a potential post-Brexit deal with Spain.",
        "url": "https://news.sky.com/story/foreign-sec-flies-to-gibraltar-with-hopes-of-securing-a-post-brexit-deal-with-spain-13381942",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gibraltar-spain-uk_6938836.jpg?20250611012525",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-06-10 23:35:00",
        "Headline": "The situation in Gibraltar has been up in the air since Brexit. It is known for its strategic location at the entrance to the Mediterranean, and is home to an RAF base. Spain claims the area belongs to them.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Foreign Secretary David Lammy is in Gibraltar ahead of a potential post-Brexit deal with Spain. Ever since the UK left the EU, the situation in the British Overseas Territory has been up in the air, with London, Madrid and Gibraltar all engaged in negotiations on a path forward. Spain disputes the UK's ownership of the territory, which is located on the south of the Iberian peninsular opposite North Africa. Known for its strategic importance at the entrance to the Mediterranean, Gibraltar is also home to an RAF base. Mr Lammy arrived in Gibraltar overnight on a ministerial plane. A government spokesperson told Sky News last night: \"The foreign secretary is in Gibraltar to meet chief minister Fabian Picardo to discuss the latest on negotiations, as all sides look to conclude an agreement as soon as possible.\" It is possible a deal could be announced in Brussels at some point in the future. Foreign secretaries visiting Gibraltar is unusual, with the last official visit appearing to have been from Dominic Raab in March 2021. Mr Picardo was in London last week to discuss negotiations with UK ministers. Local media has reported that a deal could be announced \"imminently\". Earlier on Tuesday, the EU proposed removing Gibraltar from its list of \"high risk third countries\" when it comes to money laundering. If a deal is announced on Wednesday, it would coincide with the UK government's spending review. Any agreement would be closely scrutinised by eurosceptics in Reform and the Conservative Party, who have criticised Sir Keir Starmer's EU reset deal and the handing over of the Chagos Islands to Mauritius. How to deal with border crossings A bespoke agreement on Gibraltar - which was captured by the UK in the early 18th century - was required after Brexit as Spain objected to it being included in the EU wide negotiations. Since the UK left the EU, a reciprocal agreement to not stamp passports has been in place on both sides of border for Gibraltar residents entering Spain and Spaniards travelling the other way. However, all sides have wanted to get a proper deal in place before the EU's new entry/exit system comes into place, which is now slated for October this year - despite it being delayed multiple times. In proposals made in 2021, the EU said it wanted to see Spanish authorities get extensive powers over immigration into Gibraltar from outside the Schengen free movement area, with EU institutions given the power to enforce the relevant laws in the territory. Both the UK and Gibraltar have opposed such an extensive presence, and amended proposals were made. The previous Conservative government and current Labour administration have said they would not agree to any deal that handed Gibraltar over to another state, or one that Gibraltar was not happy with. In September last year, Mr Lammy and Mr Picardo met in London. The foreign secretary said afterwards he \"reaffirmed our support to them in all eventualities and reiterated that we will only agree to terms that Gibraltar is content with\". Since Labour took power just under a year ago, negotiations have continued. 👉Listen to Politics at Sam and Anne's on your podcast app👈 In October, Mr Picardo said proposals had been made that \"guarantee the safety and security of the SchengenArea and the integrity of the single market\". Last month, EU council chief Antonia Costa said the sides were \"not very far\" from finishing a deal."
    },
    {
        "title": "Sanctioning of ministers adds to Israel's growing ostracisation over Gaza and West Bank",
        "description": "This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington.",
        "url": "https://news.sky.com/story/sanctioning-of-ministers-adds-to-israels-growing-ostracisation-over-gaza-and-west-bank-13381689",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-netanyahu-iran-nuclear-weapons_6931992.jpg?20250531154244",
        "type": "UK",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-10 14:15:00",
        "Headline": "The UK government has announced sanctions against Israel's finance minister Bezalel Smotrich and national security minister Itamar Ben-Gvir.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington. It adds to the growing ostracisation of Israel over its war in Gaza and conduct in the occupied West Bank. Read more: UK government sanctions Israeli ministers Bezalel Smotrich is Israel's far-right finance minister, a Jewish settler and someone who has denied the existence of Palestinians as a people. He has most recently said \"not a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. Itamar Ben-Gvir, the country's far-right national security minister, was once convicted of supporting a Jewish terrorist organisation and advocated the expulsion of Palestinians from their lands. Their critics will say their sanctioning has been a long time coming, is largely symbolic, and will achieve little. The British government singles out Israel's conduct in the West Bank as grounds for its action against the two men. Extremist Jewish settlers have run rampant across the occupied territories under Benjamin Netanyahu's government, with 1,900 recorded acts of violence against Palestinians since January last year. The Netanyahu government has approved a record number of new Jewish settlements in the West Bank. Under international law, all settlements on occupied land are illegal. Politics latest: Sanctions 'a major step' Israel is increasingly isolated over its war in Gaza and actions on the West Bank. The International Criminal Court has issued arrest warrants for Mr Netanyahu and other senior figures over alleged war crimes. A number of countries and observers have deemed its conduct in Gaza as genocidal. Israel described the sanctions as unacceptable and outrageous. However, critics will wonder why the Israeli prime minister is not sanctioned himself for keeping two such deeply controversial figures in his government. There is, though, a good reason for keeping them. Without them, his fragile coalition would almost certainly fall from power. The price for that though is only increasing."
    },
    {
        "title": "Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts",
        "description": "President Trump's \"anti-migrant rhetoric\" may be helping the UK's tech industry, according to tech executives.",
        "url": "https://news.sky.com/story/trumps-anti-migrant-rhetoric-gives-the-uks-tech-industry-a-competitive-edge-say-experts-13381768",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ice-us-immigration_6938657.jpg?20250610205055",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-10 16:42:00",
        "Headline": "\"In the US, there's talk of there being more talent. That's changing because of some of the US politics,\" said one tech founder.",
        "Content": "\n          Science and Technology reporter\n       President Trump's \"anti-migrant rhetoric\" may be helping the UK's tech industry, according to tech executives. \"If the US continues its foreign policy, anti-migrant rhetoric, it's going to put founders off and operators off,\" said Husayn Kassai, a founder of the UK's AI Hub and the chief executive of Quench AI. \"Already you have some students that were considering moving to the US [now] considering the UK, and you have tech founders and operators, which are just as important, again increasingly considering the UK relative to the US,\" he said to Sky News during London Tech Week. His comments come amid a US political landscape in which immigrant communities across America have been surprised at the speed and ferocity with which new policies, including crackdowns and deportations, have been enacted in Mr Trump's first 100 days in office. In the last few days, some in California - the home of tech hotspot the San Francisco Bay area - have been taking direct action in protest at the Trump administration's actions. After selling his previous company Onfido for a record amount last year, Mr Kassai decided to found his new start-up in the UK because of its talent pool.  \"In the US, there's talk of there being more talent, more AI talent in particular. That's changing because of some of the US politics. \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  AI foot scanner recognises warning signs of heart failure to keep people out of hospital, researchers say\n                 \"[Also,] in places like San Francisco, there may be more AI talent but it's not accessible to early-stage startups,\" he added, saying that's because huge companies like Meta and Google are able to offer such high salaries. Talent is often the deciding factor in where companies move their operations, according to one expert whose job it is to persuade them to come to the UK. Laura Citron, chief executive of London and Partners, said she often talks to international founders thinking about where to expand globally. \"Making sure that businesses feel [...] it will be easy for them to bring international talent into the market, that will always be the most important factor.\" \"Particularly at the moment, with what's happening geopolitically, that fundamental strength of London in openness and being inclusive and welcoming has suddenly really shot up in people's importance,\" she said. The UK is the third-largest AI market in the world, according to the government, only beaten by the US and China. Yesterday, Jensen Huang, chief executive of NVIDIA predicted that within ten years, \"every industry in the UK will be a tech industry\".  The government seems to be banking on that, with investments being announced like yesterday's unveiling of a £187m AI training plan for school students and schemes to encourage infrastructure like data centres to be built around the UK. In January, the government claimed that, if AI is \"fully embraced\", it could bring £47bn to the economy every year. But although President Trump's changes to US immigration policy may push more tech workers to the UK, the US still has its draw - and cash. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department? \"When we've been looking to raise [funding], some people that I've spoken to said: 'You should go to America because they would be talking in millions',\" said Jemma Bowles, founder of endometriosis support app Endi. She is currently staying in the UK because her knowledge of the NHS makes it more practical but \"I'm not saying no to it,\" she said. \"We'll just see what happens.\" This week alone, US companies have taken over two UK tech businesses, and Mr Kassai doesn't seem surprised. \"Shareholders, investors, board members are going to find the highest bidder and the US tends to pay more,\" he said. \"There's four times as much capital invested into startup companies than there is in the whole of Europe, so naturally when it comes through a sale, the US is often able to pay a higher price.\" However, he doesn't think that will be the case forever. \"The US is going to lose its edge. Historically, it's had four times as much financial capital to invest in startups than Europe, but AI has meant that you don't need as much money to build big companies, and as a result, the US loses its advantage.\""
    },
    {
        "title": "Police treating death of teenager missing for more than a month as unexplained",
        "description": "The death of a teenager who went missing more than a month ago is being treated as unexplained, police have said.",
        "url": "https://news.sky.com/story/police-treating-death-of-teenager-missing-for-more-than-a-month-as-unexplained-13381746",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-police-scotland-missing_6929391.jpg?20250609090341",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-10 16:02:00",
        "Headline": "Extensive inquiries are being carried out by police following the discovery of a body in the search for 19-year-old Cole Cooper, Police Scotland said.",
        "Content": "The death of a teenager who went missing more than a month ago is being treated as unexplained, police have said. Extensive inquiries are being carried out following the discovery of a body in the search for Cole Cooper, 19, Police Scotland said. The teenager was last seen by a school friend on 7 May in the village of Longcroft near Falkirk, in central Scotland, when he asked a school friend for a lift, which he was not given. He was reported missing by his family on 9 May. A body was found around 4.15pm on Friday last week in a wooded area in Banknock, Falkirk, after a major search. Formal identification is yet to take place, but Mr Cooper's family have been informed and police said dedicated officers continue to support them. Mr Cooper was last seen on CCTV on 4 May in Longcroft and officers revisited the scene on 8 June and spoke to more than 150 people. Police said establishing his movements between Sunday 4 May and Wednesday 7 May is a priority for officers. Chief Inspector Alex Hatrick said: \"Cole Cooper's disappearance and the circumstances leading up to it remain unexplained. \"We remain in regular contact with the family to ensure they are kept up to date with all aspects of the investigation. \"We will continue to support them and provide them with updates as our inquiries progress. \"Extensive inquiries are ongoing to piece together Cole's last movements and find answers for his loved ones.\" Officers are examining more than 2,000 hours of CCTV footage and are continuing door-to-door inquiries in Longcroft and Banknock. Read more from Sky News:What we know so far about school shooting in AustriaFootage shows alleged sword attacker unboxing weaponGreta Thunberg accuses Israel of 'illegal act' after deportation 'Shattered hearts' In a statement posted on the Missing Person Cole Cooper group on social media, his family said they were \"completely broken\". \"With shattered hearts, we share the devastating news that our beloved Cole, who was missing, has been found - but not in the way we hoped or prayed for,\" they said. \"Our worst fears have become reality, and we are now living a nightmare we can't wake up from.\" They added: \"Cole, you were our world - and now our world will never be the same. \"Your life was only just beginning. The world didn't get to know the light you carried, but we did - and we will carry it with us, always.\" Mr Cooper's family said they have been left with unanswered questions, but thanked those who have supported them."
    },
    {
        "title": "The spending review is a massive deal for Rachel Reeves, Labour, and the country - here's what to expect",
        "description": "This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - &#163;600bn over the next three to four years.",
        "url": "https://news.sky.com/story/the-spending-review-is-a-massive-deal-for-rachel-reeves-labour-and-the-country-heres-what-to-expect-13381824",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935131.jpg?20250605145315",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-10 19:05:00",
        "Headline": "This is a huge political moment for this Labour government - and a chance for Rachel Reeves to sell this government's story of 'renewal'.",
        "Content": "\n          Political editor\n              @BethRigby\n  This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - £600bn over the next three to four years. But it is also a massive political moment as the Labour government tries to turn the corner on a difficult first year and show voters it can deliver the change it promised. It is not, say No 10 insiders, another reset - but rather a chance to show \"working people\" why they voted Labour. Look at the blitz of announcements over recent days, and this is a government trying to sell the story of renewal. Tap here for the latest political news  On Tuesday, the prime minister and his energy secretary, Ed Miliband, announced the biggest nuclear building programme for half a century - with £14.2bn being poured into Sizewell C on the Suffolk coastline to create over 10,000 jobs over the next decade and provide energy security. Last week, the chancellor announced £15bn for new rail, tram and bus networks across the West Midlands and the North. She's also expected to green-light a new rail line between Liverpool and Manchester on Wednesday, and invest capital in housebuilding. In total, there will be £113bn of additional capital investment, which the government will frame as the long-promised \"decade of renewal\" around the three pillars of security, health and the economy. But that is only one half of this spending review and only one half of the story we will hear today, because the largesse of the capital investment - which the chancellor will say is only possible because of the choices she made in the first year of government - will be matched with spending settlements for day-to-day spending across Whitehall that will draw into sharp relief the choices and priorities for this government. Security and health are two of her pillars, and it will be defence and health that will take a bigger share of the spending pot.  Frustration in the Home Office Having front-loaded day-to-day spending into the first and second years of this Labour administration, the overall pot will rise by 1.2% in real terms every year for the rest of the parliament. That is pretty modest growth and, bluntly, it means that if the defence and NHS budgets get a bigger share of the pot, there will be real terms cuts in some unprotected departments. One to watch is the Home Office, where the home secretary was the last to hold out on a settlement and seems to have had it imposed on her by the chancellor. Hers is a huge brief, spanning police - including the manifesto pledge to increase police on the beat by 13,000 - border security, immigration and homeland security. There is frustration in the Home Office that while \"security\" is one of the government's pillars, it is the Ministry of Defence that has been given the funding. If Yvette Cooper is to deliver on police numbers, what else might have to give? Watch too for a squeeze on council budgets as the chancellor uses her capital budget to invest in housebuilding, while day-to-day spending is squeezed across our councils, schools and courts.  Reeves under pressure to boost spending This is the rub. Rachel Reeves will insist at lunchtime that spending is rising by £190bn more over the course of the parliament, partly because of those tough tax rises in her first budget. But largesse in capital investment won't be able to disguise the short-term pressures on day-to-day spending from a Labour Party and a set of voters fed up with cuts and feeling like their lives aren't improving. The winter fuel reversal is the proof. The chancellor, who will not loosen her fiscal rule of funding day-to-day spending through tax receipts, has to find £1.25bn to pay the allowance to nine million pensioners this winter. She is also under pressure to lift the two-child benefits cap, with Liz Kendall, Bridget Phillipson and Sir Keir Starmer all thought to want this to happen. That will cost up to £3bn. There is pressure to change the disability cuts in order to get the welfare changes through parliament. The point is that the chancellor is under huge pressure to lift spending, not keep her foot on its throat, and that means into the autumn, the clamour for targeted tax rises will only grow. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Can Reeves sell this government's 'renewal' story? But amongst the top team, there is some guarded optimism. The political pain of the winter fuel allowance U-turn has eased the pressure on the doorstep: one very senior Labour politician told me this week that last weekend was the first time in a long time that the matter didn't come up on the doorstep and \"the first time in a long while that it felt alright\". At lunchtime, there will be pain. The headlines will scream cuts and open up talk about tax rises that will run right up to the budget in October. But it will also be a moment where this Labour government can show voters in the form of dozens of projects and thousands of jobs, that it does have a plan to rebuild. Read more:Guide to the spending reviewFive things you need to know about the spending reviewNew nuclear power station gets green light  It is a spending review that will define Labour in power for the rest of this parliament and how our country looks and feels for years to come. The political aim is to do enough - be it on hospital waiting lists, energy bills, wages, or shovels in the ground - to persuade voters at the next election to give Labour another chance. For months, MPs have been quietly grumbling that this Labour government is in power without a story to tell. On Wednesday, we'll see how well Ms Reeves can write, and sell, the next chapter."
    },
    {
        "title": "The spending review: Five things you need to know",
        "description": "Even for those of us who follow these kinds of things on a regular basis, the spending review is, frankly, a bit of a headache.",
        "url": "https://news.sky.com/story/the-five-things-you-need-to-know-about-the-spending-review-13381750",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-ed-conway_6935132.jpg?20250605145334",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-06-10 16:07:00",
        "Headline": "It's one of the biggest moments in the economic calendar - but harder to get your head around than the budget. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Even for those of us who follow these kinds of things on a regular basis, the spending review is, frankly, a bit of a headache. This is one of the biggest moments in Britain's economic calendar - bigger, in some respects, than the annual budget. After all, these reviews, which set departmental spending totals for years to come, only happen every few years, while budgets come around every 12 months (or sometimes more often). Yet trying to get your head around the spending review - in particular this year's spending review - is a far more fraught exercise than with the budget. In large part that's because the Office for Budget Responsibility (OBR), the quasi-independent body that scrutinises the government's figures, is not playing a part this time around. There will be no OBR report to cast light, or doubt, on some of the claims from the government. Added to this, the data on government spending are famously abstruse. So perhaps the best place to start when approaching the review is to take a deep breath and a step back. With that in mind, here are five things you really need to know about the 2025 spending review. 1. It's not about all spending That might seem like a strange thing to say. Why would a spending review not concern itself with all government spending? But it turns out this review doesn't even cover the majority of government spending in the coming years. To see what I mean you need to remember that you can split total government spending (£1.4trn in this fiscal year) into two main categories. First there's what you might call non-discretionary spending. Spending on welfare, on pensions, on debt interest. This is spending the government can't really change very easily on a year-to-year basis. It's somewhat uncontrolled, but since civil servants wince at that idea, they have given it a name that suggests precisely the opposite: \"annually managed expenditure\" or AME. Then there's the spending the government has a little more control over: spending in its departments, from the Ministry of Defence to the NHS to the Home Office. This is known as \"departmental spending\". This is what the spending review is about - determining what departments spend. The key thing to note here is that these days departmental spending (actually, to confuse things yet further, the Treasury calls it Departmental Expenditure Limits or DEL) is quite a bit smaller than AME (the less controlled bit with benefits, pensions and debt interest costs). In short, this spending review is actually only about a fraction - about 41p in every pound - of government spending. You can break it down further, by the way. Because departmental spending can be split into day-to-day spending (Resource DEL) and investment (capital DEL). But let's stop with the acronyms and move on to the second thing you really need to know. 2. It's a \"zero-based\" review. Apparently The broad amount the government is planning to spend on its departments was set in stone some time ago. The real task at hand in this review is not to decide the overall departmental spend but something else: how that money is divided up between departments. Consider: in this fiscal year (2025/26) the government is due to spend just over £500bn of your money on day-to-day expenditure. Of that, by far the biggest chunk is going to the NHS (£202bn), followed by education (£94bn), defence (£39bn) and a host of other departments. That much we know. In the next fiscal year, we have a headline figure for how much day-to-day spending to expect across government. What we don't have is that breakdown. How much of the total will be health, education, defence and so on? That, in a sense, is the single biggest question the review will set out to answer. Now, in previous spending reviews the real debate wasn't over those grand departmental totals, but over something else: how much would they increase by in the following years? This time around we are told by Rachel Reeves et al that it's a slightly different philosophy. This time it's a \"zero-based review\". For anyone from the world of accountancy, this will immediately sound tremendously exciting. A zero-based review starts from the position that the department will have to justify not just an annual increase (or decrease), but every single pound it spends. It is not that far off what Elon Musk was attempting to implement with the DOGE movement in US government - a line-by-line check of spending. That's tremendously ambitious. And typically zero-based reviews tend to throw out some dramatic changes. All of which is to say, in theory, unless you believed government was run with incredibly ruthless efficiency, if this really were a zero-based review, you'd expect those departmental spending numbers to yo-yo dramatically in this review. They certainly shouldn't just be moving by small margins. Is that really what Whitehall will provide us with in this review? Almost certainly not. Read more from Sky News:UK unemployment rises to highest in four yearsM&S climbs after online order breakthrough 3. It's the first multi-year review in ages What we will get, however, is a longer-range set of spending plans than government has been able to provide in a long time. I said at the start that these reviews are typically multi-year affairs, setting budgets many years in advance. However, the last multi-year review happened in the midst of COVID and you have to look back to 2015 for the previous multi year review. That certainty about future budgets matters for any government department attempting to map out its plans and, hopefully, improve public sector productivity in the coming years. So the fact that this review will set spending totals not just for next fiscal year but for the next three years is no small deal. Indeed, for investment spending (which is actually the thing the government will probably spend more time talking about), we get numbers for four successive years. And the chances are that is what the government will most want to talk about. 4. It's not \"austerity\" One of the big questions that periodically returns to haunt the government is that we are heading for a return to the austerity policies prosecuted by George Osborne after 2010. So it's worth addressing this one quickly. The spending totals implied by this spending review are nothing like those implemented by the coalition government between 2010 and 2015. You get a sense of this when you look at total public spending, not in cash or even inflation-adjusted terms (which is what the Treasury typically likes to show us), but at those figures as a percentage of GDP. Day-to-day spending dropped from 21.5% of GDP in 2009/10 to 15% of GDP in 2016/17. This was one of the sharpest falls in government spending on record. By contrast, the spending envelope for this review will see day-to-day spending increasing rather than decreasing in the coming years. The real question comes back to how that extra spending is divided between departments. Much money has already been promised for the NHS and for defence. That would seem, all else equal, to imply less money for everyone else. But overshadowing everything else is the fact that there's simply not an awful lot of money floating around. 5. It's not a big splurge either While the totals are indeed due to increase in the coming years, they are not due to increase by all that much. Indeed, compared with most multi-year spending reviews in the past, this one is surprisingly small. In each year covered by the 2000 and 2002 comprehensive spending reviews under Gordon Brown, for instance, capital investment grew by 16.3% and 10.6% respectively. This time around, it's due to increase by just 1.3%. Now, granted, that slightly understates it. Include 2025/26 (not part of this review but still a year of spending determined by this Labour government) and the annual average increase is 3.4%. Even so, the overall picture is not one of plenty, but one of moderation. While Rachel Reeves will wax lyrical about the government's growth plans, the numbers in the spending review will tell a somewhat different story. If you can get your head around them, that is."
    },
    {
        "title": "Who are the two Israeli ministers who have been sanctioned by the UK?",
        "description": "The UK government has sanctioned two prominent Israeli ministers for \"inciting violence against Palestinians in the West Bank\".",
        "url": "https://news.sky.com/story/who-are-the-two-israeli-ministers-who-have-been-sanctioned-by-the-uk-13381732",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-itamar-ben-gvir-bezalel-smotrich_6938504.jpg?20250610172154",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-10 15:33:00",
        "Headline": "Britain has been joined by Canada, Australia, New Zealand and Norway in sanctioning Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich.",
        "Content": " The UK government has sanctioned two prominent Israeli ministers for \"inciting violence against Palestinians in the West Bank\". Britain has been joined by Canada, Australia, New Zealand and Norway in imposing sanctions on Itamar Ben-Gvir and Bezalel Smotrich - who are opposed to Palestinian statehood and are on the far right of Israeli politics. The ministers are being sanctioned in their personal capacities and are now subject to a freeze on UK assets and director disqualifications, as well as a ban on entering the country. Here we take a look at who they are and why they have been sanctioned. Itamar Ben-Gvir  Mr Ben-Gvir is Israel's security minister and the leader of the Jewish Power (Otzma Yehudit) party - one of the members of Prime Minister Benjamin Netanyahu's ruling coalition. The 49-year-old has previously been convicted of supporting a Jewish terrorist organisation and has supported the removal of Palestinians from their lands - including calling for Gaza's people to be resettled from the territory. The minister has also called for the al Aqsa mosque in Jerusalem to be replaced with a synagogue. The mosque - the third-holiest site in Islam - is built atop the Temple Mount - the holiest site in Judaism, and which was once home to two Jewish temples. Follow live: UK politics updates Bezalel Smotrich Mr Smotrich is Israel's finance minister and leader of the National Religious Party-Religious Zionism - which is another part of Mr Netanyahu's coalition. He is in charge of Israel's administration of the West Bank - the occupation of which is illegal under international law. He has also approved an expansion of settlements in the West Bank, and called for aid not to be let into Gaza. Mr Smotrich has recently said not \"a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. What has the UK and its allies said? In a joint statement with foreign ministers from the four other countries who have announced sanctions, UK Foreign Secretary David Lammy said the two senior Israelis had incited \"serious abuses of Palestinian human rights\". The statement added: \"These actions are not acceptable. This is why we have taken action now - to hold those responsible to account.\" Meanwhile, a Number 10 spokesman said the sanctions have been applied in the \"personal capacities\" of the two ministers and \"not their ministries and departments\". Read more:Who was on board seized Gaza aid boat?'Only people I've ever seen in Gaza with weapons are the IDF' What has Israel said? Mr Smotrich, speaking at the inauguration of a new settlement in the Hebron Hills in the West Bank, spoke of \"contempt\" for Britain's move. \"Britain has already tried once to prevent us from settling the cradle of our homeland, and we cannot do it again. We are determined, God willing, to continue building.\" Israel's foreign minister Gideon Sa'ar said it was \"outrageous\" that the UK had sanctioned the two ministers. He also said he had spoken with Mr Netanyahu and that an Israeli response would be decided at a \"special government meeting early next week\". Under what powers were the sanctions imposed? The countries have used the Global Human Rights Sanctions Regulations 2020 to designate the ministers \"involved persons\". What can't they do? The ministers have had any UK assets frozen, and are banned from the UK. The same conditions apply in the other countries to have imposed sanctions."
    },
    {
        "title": "Dozens more killed near food distribution centre in Gaza, claims Hamas-run health ministry",
        "description": "At least 36 people were killed and 208 wounded when Israeli forces fired towards crowds near a food distribution centre in Gaza on Tuesday morning, according to the Hamas-run territory's health ministry.",
        "url": "https://news.sky.com/story/dozens-more-killed-near-food-distribution-centre-in-gaza-claims-hamas-run-health-ministry-13381825",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-gaza-aid_6938770.jpg?20250610221130",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-10 19:08:00",
        "Headline": "Footage shows people shouting and screaming as they flee explosions in the distance. Dead and wounded people can be seen being carried away from the scene while thick smoke billows into the air.",
        "Content": " At least 36 people were killed and 208 wounded when Israeli forces fired towards crowds near a food distribution centre in Gaza on Tuesday morning, according to the Hamas-run territory's health ministry. Footage supplied to Sky News shows people shouting and screaming as they flee explosions in the distance. Dead and wounded people can be seen being carried away from the scene while thick smoke billows into the air. The incident is the latest in a series of reports of Palestinians being killed by Israeli gunfire near one of the distribution centres operated by a new organisation which is permitted by the IDF to hand out aid in the territory. One man seen in the footage says: \"We want to live, we want to eat. We have children and wives. We want to live in our homes. Three years of war, bodies ripped apart, all this, for some flour.\" Humanitarian aid workers and experts have warned Israel's blockade of Gaza and its military campaign has pushed the besieged enclave to the brink of famine. Around 160 people have been killed in shootings near aid sites run by the new Israel and US-backed organisation, the health ministry has said. The Gaza Humanitarian Foundation, which runs the sites, said there has been no violence in or around the distribution centres themselves. However, it has warned people to stay on designated access routes and paused delivery last week while it held talks with Israel's military on improving safety. Israel's military said in a statement its forces fired warning shots at suspects who were advancing and posed a threat to troops \"despite warnings that the area is an active combat zone\". It said it was aware of reports several people had been injured but its initial inquiry suggests the number \"does not align with the information held\" by the Israeli military. \"The warning shots were fired hundreds of metres from the aid distribution site, prior to its opening hours and toward the suspects who posed a threat to the troops,\" it said, adding that the details are under review. The government media office of Hamas said: \"In a new crime added to the bloody record of the 'Israeli' occupation, the number of victims of the 'Israeli-American aid distribution centres' since Tuesday morning rose to 36 martyrs and more than 208 injuries, bringing the total number of victims of the 'Israeli-American aid distribution centres' to 163 martyrs and 1,495 injuries, all of whom are starving civilians seeking a living under siege and starvation.\" Read more:Sanctioning of ministers adds to Israel's growing ostracisation over Gaza and West Bank Israeli government ministers sanctioned It comes as the UK government sanctioned two Israeli government ministers due to their \"repeated incitements of violence against Palestinian civilians\", the Foreign Office said. The UK imposed sanctions on Itamar Ben-Gvir and Bezalel Smotrich alongside Australia, Canada, New Zealand and Norway. They are being sanctioned in their personal capacities and are now subject to a freeze on UK assets and director disqualifications, and banned from entering the country. The sanctions were criticised by US secretary of state Marco Rubio who said on X: \"These sanctions do not advance US-led efforts to achieve a ceasefire, bring all hostages home, and end the war.\"  Greta Thunberg accuses Israel of 'illegal act' Earlier in the day Greta Thunberg accused Israel of committing \"an illegal act\" after the Gaza-bound aid boat she was on was seized by the country's military and she was deported to France."
    },
    {
        "title": "'Dark day' in Austria as 10 people are killed in school shooting ",
        "description": "Students and adults are among 10 victims who were killed after a gunman opened fire at a secondary school in the Austrian city of Graz.",
        "url": "https://news.sky.com/story/dark-day-in-austria-as-10-people-are-killed-in-school-shooting-13381921",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-austria-graz-shooting_6938709.jpg?20250610213233",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-10 21:16:00",
        "Headline": "Police have said the 21-year-old Austrian gunman was found dead in the toilets of the school after the shootings and was operating alone.",
        "Content": "Students and adults are among 10 victims who were killed after a gunman opened fire at a secondary school in the Austrian city of Graz. Interior minister Gerhard Karner said earlier that a further 12 people were injured in the shooting at the BORG Dreierschützengasse high school in Austria's second-biggest city. He gave the figure before it was confirmed that a person in hospital with life-threatening injuries had become the 10th person to die. It is not clear if this reduces the number of those injured to 11. The interior minister also said the suspect was a former pupil of the school who didn't finish his studies. Police have confirmed that the 21-year-old Austrian gunman was found dead in the toilets of the school after the shootings and was operating alone. News correspondent When 'M' - a 16-year-old student - saw mentions of a school shooting on his phone, he assumed it was yet another tragedy in the US.  But it couldn't have been closer to home. Three students in his class had been killed - his own cousin had been shot in the shoulder.  M only escaped the carnage because he was off school sick.  After the terror and panic of Tuesday morning, an eerie calm has settled over these streets. People stand in silence staring past the wire fence that guards the school - through the windows you can see the still-lit corridors; a handful of police officers standing guard outside the main entrance.  There are, no doubt, many more police inside the school - out of our view, still gathering evidence - trying to answer the question that's on everyone's minds: why?  Why did a former student take two guns - seemingly legally owned - into his former classrooms, and open fire?  It's reported a 'farewell letter' was found by authorities at the gunman's home. But can that really provide answers to such a senseless loss of young life?  M knows he will never feel secure walking through these corridors again, in a school and town he said was always quiet and safe.  Austria has one of the highest rates of gun ownership in Europe, but mass shootings have been - before Tuesday - extremely rare.  A national conversation about its gun laws and ownership loopholes must surely follow these coming days of national mourning. Authorities say the suspect had two weapons - reported to be a shotgun and a pistol - which he appeared to have owned legally. Police have said they did not have information about his possible motive. \n                  Ballymena protests: It is hard to see where the violence will end - and it could go on for weeks \n                 \n                  Ballymena protest: Fireworks, petrol bombs and glass bottles thrown at riot police as serious disorder deepens\n                 \n                  Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans\n                 Footage shared online revealed how gunshots and screaming could be heard after the suspect entered the school before opening fire. French education minister Elisabeth Borne has said that one of those who died was a \"young fellow citizen\" of France. It came as the mother of a child who survived the shooting retold the distressing moment she received a phone call from her son. \"My son called me to say he was in school and that he was being shot and that he thought he was going to die,\" she said. She only found out two hours later that he was still alive. Read more:What we know about the shooting so far Special forces were among those sent to the school, just under a mile from Graz's historic centre, after a call at 10am local time (9am UK time) on Tuesday. About an hour and half later, police wrote on X that the school had been evacuated and everyone had been taken to a safe meeting point. Police deployed in large numbers, with emergency vehicles guarding the area around the school and with at least one police helicopter flying above. Graz is located in the southeast of the country and about 300,000 people live there. A 'dark day' Austrian Chancellor Christian Stocker said there would be three days of national mourning, with the Austrian flag lowered to half-mast and a national minute of mourning at 10am on Wednesday. He said that it was \"a dark day in the history of our country\". President Alexander Van der Bellen said that \"this horror cannot be captured in words\". \"These were young people who had their whole lives ahead of them. A teacher who accompanied them on their way,\" he said. Well-wishers later lit candles and placed them in the main square in Graz city centre on Tuesday night as a tribute to the shooting victims. People were seen quietly reflecting as the city tried to come to terms with the deadly attack. The school where the attack took place had earlier posted a message on Instagram following the tragedy. The message is written in German, the official language of Austria, and translates in English to: \"It was a really terrible day that deeply impacted and affected us all. \"Let us continue to stand together as a school community and support one another. \"Your teachers and your principal.\""
    },
    {
        "title": "What we know so far about school shooting in Austria",
        "description": "Students and adults are among 10 victims who have died in a school shooting in Austria. ",
        "url": "https://news.sky.com/story/what-we-know-so-far-about-school-shooting-in-austria-13381583",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-scene-graz-austria_6938134.jpg?20250610134342",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-10 10:43:00",
        "Headline": "At least 10 people have been killed after a shooting at a secondary school in Graz, one of Austria's largest cities.",
        "Content": " Students and adults are among 10 victims who have died in a school shooting in Austria.  The country's interior minister Gerhard Karner said earlier that a further 12 people were injured in the shooting at the secondary school in Graz, Austria's second-biggest city. However Mr Karner gave the figure before it was confirmed that a person in hospital with life-threatening injuries had become the 10th person to die. It is not clear if this reduces the number of those injured to 11. Mayor Elke Kahr has described the attack as a \"terrible tragedy\", the Austria Press Agency (APA) reported. Austria school shooting: Follow live updates Here is what we know so far. What happened? The shooting took place on 10 June at BORG Dreierschutzengasse, a secondary school in the northwest of Graz, close to the main central train station, Austrian police said. Officials said 10 victims were killed, with six of them females and three of them males. Local media has reported that the 10th victim, who was confirmed dead on Monday evening, was also female. The gunman also died - bringing the total number of fatalities to 11. French education minister Elisabeth Borne has confirmed that one of those who died in the school shooting was a \"young fellow citizen\" of France. She did not gave any further details about the victim. Special forces were sent to the school at 10am local time after reports of shots being heard. By 11.30am, police said the school had been evacuated and everyone had been taken to a safe meeting point. Gunfire and screaming could be heard in footage posted on X purporting to be from the scene. An injured person being carried to a helicopter by paramedics was also caught on video, while pictures showed armed officers at the scene. At least 158 paramedics were on site responding to the shooting, and 31 crisis intervention staff. The Austrian Red Cross told Sky News it had initiated its so-called 'MANV system', a protocol for dealing with a mass casualty incident. Injured students were being cared for in the nearby Helmut List Halle events venue. 'My son called me to say he was going to die' The mother of a child who survived the shooting retold the distressing moment she received a phone call from her son. She said she found out hours after the incident that he was alive. \"My son called me to say he was in school and that he was being shot and that he thought he was going to die,\" she said. \"I've only found out now, two hours later, that he's still alive.\"  What we know about the suspect Austrian police confirmed the perpetrator is dead, but have not yet revealed his identity. In an update, Styrian State Police director Gerald Ortner said he was 21 years old and lived in Graz. Officers believe he killed himself in the school's toilet.  Mr Ortner said police did not have any prior information about the suspect, but said that he owned two guns, that he used in the shooting. Interior minister Mr Karner added that the gunman was a former pupil of BORG Dreierschutzengasse who didn't finish school. He said any other details about the suspect was \"still speculation\". A 'national tragedy' Austrian Chancellor Christian Stocker called the shooting a \"national tragedy\". In a later news conference, he said it is a \"dark day in the history of our country\". \"There are no words to express the pain, the mourning, that all Austria is feeling right now,\" he added. He sent his condolences to those who were injured and the relatives, friends and staff who had to \"live through this terrible, horrible event\". He announced there will be three days of mourning and Austrian ministers are expected to pass a resolution for a national mourning today. The Austrian flag will also be flown at half-mast and a minute of silence will be held on Wednesday. Austrian President Alexander Van der Bellen added: \"This horror cannot be put into words.\" He said what happened in Graz \"strikes at the heart of our country\"."
    },
    {
        "title": "UK government sanctions Israeli ministers for 'inciting settler violence' against Palestinians",
        "description": "The UK government has sanctioned two Israeli government ministers due to their \"repeated incitements of violence against Palestinian civilians\", the Foreign Office has said.",
        "url": "https://news.sky.com/story/uk-government-sanctions-israeli-ministers-over-comments-made-on-gaza-13381489",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-itamar-ben-gvir-bezalel-smotrich_6938349.jpg?20250610140700",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-10 13:00:00",
        "Headline": "The ministers are now subject to a freeze on UK assets and director disqualifications, as well as a ban on entering the country.",
        "Content": " The UK government has sanctioned two Israeli government ministers due to their \"repeated incitements of violence against Palestinian civilians\", the Foreign Office has said. The two ministers are Itamar Ben-Gvir and Bezalel Smotrich, and the UK is imposing sanctions alongside Australia, Canada, New Zealand and Norway. The ministers are being sanctioned in their personal capacities and are now subject to a freeze on UK assets and director disqualifications, as well as a ban on entering the country. Politics latest: Sanctions 'a major step' The Foreign Office says they are \"responsible for, engaging in, inciting, promoting and/or supporting activity which amounts to a serious abuse of the right of individuals not to be subjected to cruel, inhuman or degrading treatment or punishment, in particular acts of aggression and violence against Palestinian individuals in the West Bank\". Foreign Secretary David Lammy told broadcasters the two ministers have been \"inciting violence\" and \"encouraging egregious abuses of human rights\" for \"months\", which he has raised repeatedly with the Israeli government. He added: \"We stand for a two-state solution, and the settler violence that we've seen in the West Bank particularly is entirely unacceptable and must stop.\" Israel's foreign minister, Gideon Sa'ar, condemned the decision as \"outrageous\", and said he had discussed the move with Benjamin Netanyahu, Israel's prime minister, earlier on Tuesday. \"We will hold a special government meeting early next week to decide on our response to this unacceptable decision,\" he added. US secretary of state Marco Rubio also condemned the sanctions, saying they \"do not advance US-led efforts to achieve a ceasefire, bring all hostages home, and end the war\". He continued: \"We reject any notion of equivalence: Hamas is a terrorist organization that committed unspeakable atrocities, continues to hold innocent civilians hostage, and prevents the people of Gaza from living in peace. We remind our partners not to forget who the real enemy is. \"The United States urges the reversal of the sanctions and stands shoulder-to-shoulder with Israel.\" Who are the sanctioned Israeli ministers? Mr Ben-Gvir is the far-right national security minister in the Netanyahu government, and is the leader of the Jewish Power party in the Knesset (parliament). Our international affairs editor Dominic Waghorn explains that he was \"once convicted of being a member of a Jewish terrorist organisation and advocated the expulsion of Palestinians from their lands\". Mr Smotrich is the finance minister and a Jewish settler who has denied the existence of Palestinians as a people. He leads the National Religious Party - Religious Zionism party in the Knesset. Dominic Waghorn reports that he has most recently said \"not a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. Allies call for 'meaningful action' to stop settler violence In a joint statement, the foreign ministers of the UK, Australia, Canada, New Zealand, and Norway said the pair \"have incited extremist violence and serious abuses of Palestinian human rights\", adding: \"Extremist rhetoric advocating the forced displacement of Palestinians and the creation of new Israeli settlements is appalling and dangerous.\" \"The Israeli government must uphold its obligations under international law, and we call on it to take meaningful action to end extremist, violent and expansionist rhetoric,\" they added. The foreign ministers emphasised that today's measures \"do not deviate from our unwavering support for Israel's security, and we continue to condemn the horrific terror attacks of 7 October by Hamas\", but rather are \"targeted towards individuals who in our view undermine Israel's own security and its standing in the world\". \"We continue to want a strong friendship with the people of Israel based on our shared ties, values and commitment to their security and future,\" they said. The UK shadow foreign secretary, Dame Priti Patel, said the government must \"leverage its influence at every opportunity to ensure the remaining hostages are released, that aid continues to reach those who need it, and a sustainable end to the conflict is achieved\". She added that the party has \"always been committed to supporting a two-state solution - delivered in the right way, and at the right time - and will work with the government to support efforts to achieve this, where those efforts are effective\". Read more:Greta Thunberg accuses Israel of 'an illegal act'Ministers share 'same frustrations' over Gaza war as protestersGet inside The Wargame podcast UK had previously prepared sanctions Last October, former foreign secretary Lord David Cameron told Sky News he'd planned to sanction them while in government, but \"ran out of time\" when the surprise election was called for July. Cameron, who returned to frontline politics under Rishi Sunak, said Mr Smotrich and Mr Ben-Gvir had made \"abhorrent\" comments.  He said: \"I was looking at the things we could do to say to the Israelis we back your right to self-defence… but at the same time, we do want you to try and obey… humanitarian law. \"And these two ministers are people who have tried, they've encouraged you, to stop aid getting into Gaza and encouraged the extreme settlers in the West Bank to carry out illegal acts. \"So it seemed to me it was worth looking at whether we could sanction these two individual ministers.\""
    },
    {
        "title": "Sanctioning of ministers adds to Israel's growing ostracisation over Gaza and West Bank",
        "description": "This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington.",
        "url": "https://news.sky.com/story/sanctioning-of-ministers-adds-to-israels-growing-ostracisation-over-gaza-and-west-bank-13381689",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-netanyahu-iran-nuclear-weapons_6931992.jpg?20250531154244",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-10 14:15:00",
        "Headline": "The UK government has announced sanctions against Israel's finance minister Bezalel Smotrich and national security minister Itamar Ben-Gvir.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington. It adds to the growing ostracisation of Israel over its war in Gaza and conduct in the occupied West Bank. Read more: UK government sanctions Israeli ministers Bezalel Smotrich is Israel's far-right finance minister, a Jewish settler and someone who has denied the existence of Palestinians as a people. He has most recently said \"not a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. Itamar Ben-Gvir, the country's far-right national security minister, was once convicted of supporting a Jewish terrorist organisation and advocated the expulsion of Palestinians from their lands. Their critics will say their sanctioning has been a long time coming, is largely symbolic, and will achieve little. The British government singles out Israel's conduct in the West Bank as grounds for its action against the two men. Extremist Jewish settlers have run rampant across the occupied territories under Benjamin Netanyahu's government, with 1,900 recorded acts of violence against Palestinians since January last year. The Netanyahu government has approved a record number of new Jewish settlements in the West Bank. Under international law, all settlements on occupied land are illegal. Politics latest: Sanctions 'a major step' Israel is increasingly isolated over its war in Gaza and actions on the West Bank. The International Criminal Court has issued arrest warrants for Mr Netanyahu and other senior figures over alleged war crimes. A number of countries and observers have deemed its conduct in Gaza as genocidal. Israel described the sanctions as unacceptable and outrageous. However, critics will wonder why the Israeli prime minister is not sanctioned himself for keeping two such deeply controversial figures in his government. There is, though, a good reason for keeping them. Without them, his fragile coalition would almost certainly fall from power. The price for that though is only increasing."
    },
    {
        "title": "Who are the two Israeli ministers who have been sanctioned by the UK?",
        "description": "The UK government has sanctioned two prominent Israeli ministers for \"inciting violence against Palestinians in the West Bank\".",
        "url": "https://news.sky.com/story/who-are-the-two-israeli-ministers-who-have-been-sanctioned-by-the-uk-13381732",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-itamar-ben-gvir-bezalel-smotrich_6938504.jpg?20250610172154",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-10 15:33:00",
        "Headline": "Britain has been joined by Canada, Australia, New Zealand and Norway in sanctioning Israeli ministers Itamar Ben-Gvir and Bezalel Smotrich.",
        "Content": " The UK government has sanctioned two prominent Israeli ministers for \"inciting violence against Palestinians in the West Bank\". Britain has been joined by Canada, Australia, New Zealand and Norway in imposing sanctions on Itamar Ben-Gvir and Bezalel Smotrich - who are opposed to Palestinian statehood and are on the far right of Israeli politics. The ministers are being sanctioned in their personal capacities and are now subject to a freeze on UK assets and director disqualifications, as well as a ban on entering the country. Here we take a look at who they are and why they have been sanctioned. Itamar Ben-Gvir  Mr Ben-Gvir is Israel's security minister and the leader of the Jewish Power (Otzma Yehudit) party - one of the members of Prime Minister Benjamin Netanyahu's ruling coalition. The 49-year-old has previously been convicted of supporting a Jewish terrorist organisation and has supported the removal of Palestinians from their lands - including calling for Gaza's people to be resettled from the territory. The minister has also called for the al Aqsa mosque in Jerusalem to be replaced with a synagogue. The mosque - the third-holiest site in Islam - is built atop the Temple Mount - the holiest site in Judaism, and which was once home to two Jewish temples. Follow live: UK politics updates Bezalel Smotrich Mr Smotrich is Israel's finance minister and leader of the National Religious Party-Religious Zionism - which is another part of Mr Netanyahu's coalition. He is in charge of Israel's administration of the West Bank - the occupation of which is illegal under international law. He has also approved an expansion of settlements in the West Bank, and called for aid not to be let into Gaza. Mr Smotrich has recently said not \"a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. What has the UK and its allies said? In a joint statement with foreign ministers from the four other countries who have announced sanctions, UK Foreign Secretary David Lammy said the two senior Israelis had incited \"serious abuses of Palestinian human rights\". The statement added: \"These actions are not acceptable. This is why we have taken action now - to hold those responsible to account.\" Meanwhile, a Number 10 spokesman said the sanctions have been applied in the \"personal capacities\" of the two ministers and \"not their ministries and departments\". Read more:Who was on board seized Gaza aid boat?'Only people I've ever seen in Gaza with weapons are the IDF' What has Israel said? Mr Smotrich, speaking at the inauguration of a new settlement in the Hebron Hills in the West Bank, spoke of \"contempt\" for Britain's move. \"Britain has already tried once to prevent us from settling the cradle of our homeland, and we cannot do it again. We are determined, God willing, to continue building.\" Israel's foreign minister Gideon Sa'ar said it was \"outrageous\" that the UK had sanctioned the two ministers. He also said he had spoken with Mr Netanyahu and that an Israeli response would be decided at a \"special government meeting early next week\". Under what powers were the sanctions imposed? The countries have used the Global Human Rights Sanctions Regulations 2020 to designate the ministers \"involved persons\". What can't they do? The ministers have had any UK assets frozen, and are banned from the UK. The same conditions apply in the other countries to have imposed sanctions."
    },
    {
        "title": "Greta Thunberg accuses Israel of 'an illegal act' after deportation to France following seizure of Gaza aid boat",
        "description": "Greta Thunberg has accused Israel of committing \"an illegal act\" after the Gaza-bound aid boat she was on was seized by the country's military.",
        "url": "https://news.sky.com/story/israel-releases-photo-of-greta-thunberg-being-deported-after-gaza-aid-boat-seized-13381514",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-greta-thunberg-israel_6938037.jpg?20250610090456",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-10 07:56:00",
        "Headline": "In a post on X, the Israeli foreign ministry shares an image of the climate activist on a plane and says she is flying to Sweden via France.",
        "Content": " Greta Thunberg has accused Israel of committing \"an illegal act\" after the Gaza-bound aid boat she was on was seized by the country's military. The 22-year-old climate campaigner was one of a dozen people aboard the British-flagged yacht Madleen, which set sail from Sicily, Italy, on 1 May on a mission aiming to break Israel's sea blockade of Gaza. Speaking to a reporter at Paris-Charles de Gaulle Airport following her deportation from Israel, she described the situation as \"chaotic and uncertain\". Ms Thunberg said Israel was guilty of \"an illegal act by kidnapping us on international waters and against our will and bringing us to Israel, keeping us in the bottom of the boat, not letting us getting out, and so on\". But she said the plight of those on board was not the real story, which was the \"genocide going on in Gaza and a systematic starvation following the siege and blockade\".  The Israelis, she said, are preventing \"food, medicine, water that are desperately needed\" getting into Gaza. Israel published video of those on the boat being offered sandwiches, but when asked about it, she dismissed it as a \"PR stunt\". Israel's foreign ministry confirmed it had seized the vessel and brought it to shore on Monday, saying the passengers were \"undergoing medical examinations to ensure they are in good health\". In a post on X on Tuesday, the ministry shared a photo of Thunberg on a plane and said she was flying to Sweden via France. Adalah, a legal rights group in Israel representing the 12 Madleen passengers, said Thunberg, two other activists and a journalist had agreed to be deported and leave Israel. Read more:Who were the passengers on the Madleen yacht? Other activists who refused deportation were being held in detention, Adalah added, and their case was set to be heard by Israeli authorities. The pro-Palestinian Freedom Flotilla Coalition (FFC) - which was operating the yacht - said at around 1am that the group were \"expected to be moved to the Ramleh detention facility unless they agree to leave immediately\". The rights group added: \"We continue to demand the immediate release of all volunteers and the return of the stolen aid. Their detention is unlawful and a violation of international law.\" Read more from Sky News:The Wargame podcast: What if Russia attacked the UK?UK unemployment rises to highest in four years Three paramedics killed in Gaza City - Hamas It comes after Hamas said in a statement that three paramedics were killed in an Israeli attack in al-Tuffah, Gaza City. The militant group called it a \"war crime\" and said: \"Targeting those who aid victims represents an unprecedented level of brutality and criminality, and reveals the occupation's efforts to stifle all means of survival and rescue in Gaza.\" It also comes as local health authorities said Israeli gunfire killed at least 17 Palestinians and wounded dozens of others at an aid distribution site of the US-backed Gaza Humanitarian Foundation (GHF) in central Gaza. The Israeli military said they are looking into the incident. Last week, it warned Palestinians not to approach routes leading to GHF sites between 6pm and 6am local time, describing these roads as closed military zones. Around 130 people have been killed in a number of shootings near aid sites run by the GHF."
    },
    {
        "title": "Birth rates are plummeting worldwide - but it's not because people don't want kids anymore",
        "description": "Two in five people over 50 say they have not had as many children as they wanted - with economic issues, health concerns and fears about the state of the world among the main barriers.",
        "url": "https://news.sky.com/story/global-birth-rates-crisis-people-do-still-want-to-have-children-but-many-cant-heres-why-13381290",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-birth-rates-global_6937816.jpg?20250609215245",
        "type": "World",
        "Author": "Daniel Dunford",
        "Date Published": "2025-06-10 03:18:00",
        "Headline": "\"Lack of choice, not desire\" is reason for global fertility crisis, say UN in a new report, after a massive new global survey. The Sky News data and forensics team breaks down the key details.",
        "Content": "\n          Senior data journalist\n              @danieljdunford\n  Two in five people over 50 say they have not had as many children as they wanted - with economic issues, health concerns and fears about the state of the world among the main barriers. More than half said financial factors such as affordable housing, childcare options and job security were things that had limited, or would limit, their ability to grow their families. One in four said health issues were holding them back, while a fifth of respondents mentioned fears about global issues including climate change, wars and pandemics. The findings come from a new survey of over 14,000 people by the United Nations Population Fund (UNFPA) - spanning 14 countries on five continents that are home to a third of the world's population. Birth rates have been declining across almost all regions of the world, while life expectancy continues to grow. There are concerns, from politicians and commentators like Elon Musk, that future generations of working age people will find it more difficult to economically support people of pension age as the ratio of workers to pensioners shifts. \"Vast numbers of people are unable to create the families they want,\" said Dr Natalia Kanem, executive director of the UNFPA. \"The issue is lack of choice, not desire, with major consequences for individuals and societies. That is the real fertility crisis, and the answer lies in responding to what people say they need: paid family leave, affordable fertility care, and supportive partners.\" Differences around the world The survey was carried out in four European countries, four in Asia, three across Africa and three from the Americas. The countries were picked to try and represent \"a wide variety of countries with different cultural contexts, fertility rates and policy approaches\", according to the report's editor Dr Rebecca Zerzan. It includes, for example, the country with the lowest fertility rate in the world - South Korea. It also includes country with a birth rate among the highest in the world, which also happens to be the most populous country in its continent - Nigeria. The others, in order of population size, are India, the US, Indonesia, Brazil, Mexico, Germany, Thailand, South Africa, Italy, Morocco, Sweden and Hungary. In many cases there were significant differences in responses depending on which country people were reporting from. For example in Nigeria, a third of men (although only 21% of women) reported that they wanted to have four or more children. The numbers were similar in South Africa. However in South Korea, Thailand, Italy, Germany and Hungary, no more than 5% agreed. Fertility issues were twice as likely in the US (16% of respondents) as in neighbouring Mexico (8%). In South Korea, three in five respondents reported financial limitations as an obstacle. But in Sweden, where both men and women are entitled to 480 days of paid parental leave per child (which can also be transferred to grandparents), fewer than one in five said the same. How paternity leave in the UK compares to other countries Birth rates in Sweden are still among the lowest in the world, however. Dr Zerzan told Sky News that this shows that no one factor alone contributes to people feeling empowered to have children at the right time. \"A third of people in Sweden say they think raising a child will take up too much time and energy. And a higher number of people there, compared with other countries, are also concerned about climate change and bringing a child in to an uncertain world.\" Unintended pregnancies vs not as many children as wanted A curious finding from the survey is that, while there has been much discussion around declining fertility rates, almost a third of people said they or their partner had experienced an unintended pregnancy. Globally, as people who become pregnant unintentionally often do so more than once, half of all pregnancies are unintended. In Morocco and South Africa, around half of people had experience of an unintended pregnancy. In the same two countries, more than half of people had experience of being unable to have a child at their preferred time. Overall, one in eight people had experienced both an unintended pregnancy and barriers to a desired child. \"Everywhere we look, people are struggling to freely realise their reproductive aspirations,\" explains the report. People who had more children than they wanted, and people who had fewer, were present in countries with high and low fertility rates. \"That indicates that barriers to achieving one's ideal family are ubiquitous.\" What can be done to help? The report says that the crisis does require political interventions, but warns against policies that often amount to short-term fixes, or those designed to coerce people to either use or not use contraception. \"Whether the policies are coercive or not, there are real risks to treating fertility rates as a faucet to be turned on or off. Many of the countries that are today seeking to increase fertility have, within the last 40 years, sought to decrease birth rates. \"For example, China, Japan, the Republic of Korea, Thailand and Türkiye all reported in 1986 an intention to lower their national fertility rates through policy interventions, deeming their respective fertility rates at that time as 'too high'. By 2015, however, all five countries had switched to policies designed to boost fertility. \"Today all five have total fertility rates below two children per woman.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling, we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "'This is our city': Furious immigrants vow to 'defend' LA against Trump crackdown",
        "description": "The pop of flash bangs and the drawing of rubber bullet launchers by police sent protesters scattering down streets in downtown LA during a fourth day of demonstrations against Donald Trump's immigration policy.",
        "url": "https://news.sky.com/story/this-is-our-city-furious-immigrants-vow-to-defend-la-against-trump-crackdown-13381495",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-los-angeles-california_6938025.png?20250610084829",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2025-06-10 06:57:00",
        "Headline": "Donald Trump has ordered the deployment of another 2,000 National Guard troops and 700 Marines to Los Angeles. The move escalates a military presence that local officials and California governor Gavin Newsom say they do not want.",
        "Content": "\n          US correspondent\n              @marthakelner\n  The pop of flash bangs and the drawing of rubber bullet launchers by police sent protesters scattering down streets in downtown LA during a fourth day of demonstrations against Donald Trump's immigration policy. Dozens of National Guard - America's reserve force - carrying shields and long guns, created a perimeter around a federal building as protesters angrily shouted at them. \"National Guard out of LA,\" they chanted, followed by a chorus of \"shame, shame, shame\". The arrival of National Guard troops on the streets, with a total of 4,000 now deployed by President Trump against the wishes of California governor Gavin Newsom, seems to have escalated tensions. Los Angeles mayor Karen Bass described her city as a \"test case\" for Trump usurping the authority of local governments. The news that 700 marines were also being mobilised, ready to deploy, was viewed by Democratic politicians as not just a gross overreaction to the situation but a cynical political ploy by the White House to stoke trouble. Trump says they are needed to restore law and order. As it happened: 700 marines to be deployed in LA Crowd control explosions were being deployed from the rooftops of the federal buildings towards protesters in a plaza below in a bid to disperse the crowd. Many of those gathering are first and second-generation immigrants, mostly from Central and South America. They are furious about the raids that took place last week. Dozens of immigrants were rounded up in LA's garment district, an area packed with clothing wholesalers. Read more:What we know about the LA immigration raids and protestsDowntown LA is a scene of pandemonium and lawlessness  Bryanna Ordonez, 17, was protesting with friends. Her dad was among the 44 people arrested in the raids. He'd lived here - illegally - for more than 10 years. \"My father got deported on 6 June,\" she said, holding back tears. \"I'm here protesting for him and two of my uncles that were deported. \"Our parents worked so hard to get us here today just to be taken from us because they wanted us to have a better life. It's so unfair.\" Giovanni Garcia is from South Central LA. His mother emigrated from Mexico 26 years ago, but she only received her Green Card last year. \"Everyone says LA is an immigrant city, and it is,\" says Giovanni. \"You go to Chinese restaurants, they have Hispanic workers in the back. \"You know, you go to the clothing companies, they have Hispanics working. Like, this is our city, and we have to stand here and defend it.\" 👉 Follow Trump100 on your podcast app 👈 As dusk fell, the crowds thinned on the streets. A remaining hardcore of demonstrators were backed into a corner of downtown LA known as Little Tokyo. As night fell, an hours-long standoff between police and protesters took place next to a pagoda and with the backdrop of a giant mural of LA Dodgers baseball star Shohei Ohtani, before, eventually, a number of them were arrested. LA is a city known for sporting prowess, multiculturalism and a long history of resistance movements - the immigration protests of 2025 now among them."
    },
    {
        "title": "Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts",
        "description": "President Trump's \"anti-migrant rhetoric\" may be helping the UK's tech industry, according to tech executives.",
        "url": "https://news.sky.com/story/trumps-anti-migrant-rhetoric-gives-the-uks-tech-industry-a-competitive-edge-say-experts-13381768",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ice-us-immigration_6938657.jpg?20250610205055",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-10 16:42:00",
        "Headline": "\"In the US, there's talk of there being more talent. That's changing because of some of the US politics,\" said one tech founder.",
        "Content": "\n          Science and Technology reporter\n       President Trump's \"anti-migrant rhetoric\" may be helping the UK's tech industry, according to tech executives. \"If the US continues its foreign policy, anti-migrant rhetoric, it's going to put founders off and operators off,\" said Husayn Kassai, a founder of the UK's AI Hub and the chief executive of Quench AI. \"Already you have some students that were considering moving to the US [now] considering the UK, and you have tech founders and operators, which are just as important, again increasingly considering the UK relative to the US,\" he said to Sky News during London Tech Week. His comments come amid a US political landscape in which immigrant communities across America have been surprised at the speed and ferocity with which new policies, including crackdowns and deportations, have been enacted in Mr Trump's first 100 days in office. In the last few days, some in California - the home of tech hotspot the San Francisco Bay area - have been taking direct action in protest at the Trump administration's actions. After selling his previous company Onfido for a record amount last year, Mr Kassai decided to found his new start-up in the UK because of its talent pool.  \"In the US, there's talk of there being more talent, more AI talent in particular. That's changing because of some of the US politics. \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  AI foot scanner recognises warning signs of heart failure to keep people out of hospital, researchers say\n                 \"[Also,] in places like San Francisco, there may be more AI talent but it's not accessible to early-stage startups,\" he added, saying that's because huge companies like Meta and Google are able to offer such high salaries. Talent is often the deciding factor in where companies move their operations, according to one expert whose job it is to persuade them to come to the UK. Laura Citron, chief executive of London and Partners, said she often talks to international founders thinking about where to expand globally. \"Making sure that businesses feel [...] it will be easy for them to bring international talent into the market, that will always be the most important factor.\" \"Particularly at the moment, with what's happening geopolitically, that fundamental strength of London in openness and being inclusive and welcoming has suddenly really shot up in people's importance,\" she said. The UK is the third-largest AI market in the world, according to the government, only beaten by the US and China. Yesterday, Jensen Huang, chief executive of NVIDIA predicted that within ten years, \"every industry in the UK will be a tech industry\".  The government seems to be banking on that, with investments being announced like yesterday's unveiling of a £187m AI training plan for school students and schemes to encourage infrastructure like data centres to be built around the UK. In January, the government claimed that, if AI is \"fully embraced\", it could bring £47bn to the economy every year. But although President Trump's changes to US immigration policy may push more tech workers to the UK, the US still has its draw - and cash. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department? \"When we've been looking to raise [funding], some people that I've spoken to said: 'You should go to America because they would be talking in millions',\" said Jemma Bowles, founder of endometriosis support app Endi. She is currently staying in the UK because her knowledge of the NHS makes it more practical but \"I'm not saying no to it,\" she said. \"We'll just see what happens.\" This week alone, US companies have taken over two UK tech businesses, and Mr Kassai doesn't seem surprised. \"Shareholders, investors, board members are going to find the highest bidder and the US tends to pay more,\" he said. \"There's four times as much capital invested into startup companies than there is in the whole of Europe, so naturally when it comes through a sale, the US is often able to pay a higher price.\" However, he doesn't think that will be the case forever. \"The US is going to lose its edge. Historically, it's had four times as much financial capital to invest in startups than Europe, but AI has meant that you don't need as much money to build big companies, and as a result, the US loses its advantage.\""
    },
    {
        "title": "The spending review: Five things you need to know",
        "description": "Even for those of us who follow these kinds of things on a regular basis, the spending review is, frankly, a bit of a headache.",
        "url": "https://news.sky.com/story/the-five-things-you-need-to-know-about-the-spending-review-13381750",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-ed-conway_6935132.jpg?20250605145334",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-06-10 16:07:00",
        "Headline": "It's one of the biggest moments in the economic calendar - but harder to get your head around than the budget. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Even for those of us who follow these kinds of things on a regular basis, the spending review is, frankly, a bit of a headache. This is one of the biggest moments in Britain's economic calendar - bigger, in some respects, than the annual budget. After all, these reviews, which set departmental spending totals for years to come, only happen every few years, while budgets come around every 12 months (or sometimes more often). Yet trying to get your head around the spending review - in particular this year's spending review - is a far more fraught exercise than with the budget. In large part that's because the Office for Budget Responsibility (OBR), the quasi-independent body that scrutinises the government's figures, is not playing a part this time around. There will be no OBR report to cast light, or doubt, on some of the claims from the government. Added to this, the data on government spending are famously abstruse. So perhaps the best place to start when approaching the review is to take a deep breath and a step back. With that in mind, here are five things you really need to know about the 2025 spending review. 1. It's not about all spending That might seem like a strange thing to say. Why would a spending review not concern itself with all government spending? But it turns out this review doesn't even cover the majority of government spending in the coming years. To see what I mean you need to remember that you can split total government spending (£1.4trn in this fiscal year) into two main categories. First there's what you might call non-discretionary spending. Spending on welfare, on pensions, on debt interest. This is spending the government can't really change very easily on a year-to-year basis. It's somewhat uncontrolled, but since civil servants wince at that idea, they have given it a name that suggests precisely the opposite: \"annually managed expenditure\" or AME. Then there's the spending the government has a little more control over: spending in its departments, from the Ministry of Defence to the NHS to the Home Office. This is known as \"departmental spending\". This is what the spending review is about - determining what departments spend. The key thing to note here is that these days departmental spending (actually, to confuse things yet further, the Treasury calls it Departmental Expenditure Limits or DEL) is quite a bit smaller than AME (the less controlled bit with benefits, pensions and debt interest costs). In short, this spending review is actually only about a fraction - about 41p in every pound - of government spending. You can break it down further, by the way. Because departmental spending can be split into day-to-day spending (Resource DEL) and investment (capital DEL). But let's stop with the acronyms and move on to the second thing you really need to know. 2. It's a \"zero-based\" review. Apparently The broad amount the government is planning to spend on its departments was set in stone some time ago. The real task at hand in this review is not to decide the overall departmental spend but something else: how that money is divided up between departments. Consider: in this fiscal year (2025/26) the government is due to spend just over £500bn of your money on day-to-day expenditure. Of that, by far the biggest chunk is going to the NHS (£202bn), followed by education (£94bn), defence (£39bn) and a host of other departments. That much we know. In the next fiscal year, we have a headline figure for how much day-to-day spending to expect across government. What we don't have is that breakdown. How much of the total will be health, education, defence and so on? That, in a sense, is the single biggest question the review will set out to answer. Now, in previous spending reviews the real debate wasn't over those grand departmental totals, but over something else: how much would they increase by in the following years? This time around we are told by Rachel Reeves et al that it's a slightly different philosophy. This time it's a \"zero-based review\". For anyone from the world of accountancy, this will immediately sound tremendously exciting. A zero-based review starts from the position that the department will have to justify not just an annual increase (or decrease), but every single pound it spends. It is not that far off what Elon Musk was attempting to implement with the DOGE movement in US government - a line-by-line check of spending. That's tremendously ambitious. And typically zero-based reviews tend to throw out some dramatic changes. All of which is to say, in theory, unless you believed government was run with incredibly ruthless efficiency, if this really were a zero-based review, you'd expect those departmental spending numbers to yo-yo dramatically in this review. They certainly shouldn't just be moving by small margins. Is that really what Whitehall will provide us with in this review? Almost certainly not. Read more from Sky News:UK unemployment rises to highest in four yearsM&S climbs after online order breakthrough 3. It's the first multi-year review in ages What we will get, however, is a longer-range set of spending plans than government has been able to provide in a long time. I said at the start that these reviews are typically multi-year affairs, setting budgets many years in advance. However, the last multi-year review happened in the midst of COVID and you have to look back to 2015 for the previous multi year review. That certainty about future budgets matters for any government department attempting to map out its plans and, hopefully, improve public sector productivity in the coming years. So the fact that this review will set spending totals not just for next fiscal year but for the next three years is no small deal. Indeed, for investment spending (which is actually the thing the government will probably spend more time talking about), we get numbers for four successive years. And the chances are that is what the government will most want to talk about. 4. It's not \"austerity\" One of the big questions that periodically returns to haunt the government is that we are heading for a return to the austerity policies prosecuted by George Osborne after 2010. So it's worth addressing this one quickly. The spending totals implied by this spending review are nothing like those implemented by the coalition government between 2010 and 2015. You get a sense of this when you look at total public spending, not in cash or even inflation-adjusted terms (which is what the Treasury typically likes to show us), but at those figures as a percentage of GDP. Day-to-day spending dropped from 21.5% of GDP in 2009/10 to 15% of GDP in 2016/17. This was one of the sharpest falls in government spending on record. By contrast, the spending envelope for this review will see day-to-day spending increasing rather than decreasing in the coming years. The real question comes back to how that extra spending is divided between departments. Much money has already been promised for the NHS and for defence. That would seem, all else equal, to imply less money for everyone else. But overshadowing everything else is the fact that there's simply not an awful lot of money floating around. 5. It's not a big splurge either While the totals are indeed due to increase in the coming years, they are not due to increase by all that much. Indeed, compared with most multi-year spending reviews in the past, this one is surprisingly small. In each year covered by the 2000 and 2002 comprehensive spending reviews under Gordon Brown, for instance, capital investment grew by 16.3% and 10.6% respectively. This time around, it's due to increase by just 1.3%. Now, granted, that slightly understates it. Include 2025/26 (not part of this review but still a year of spending determined by this Labour government) and the annual average increase is 3.4%. Even so, the overall picture is not one of plenty, but one of moderation. While Rachel Reeves will wax lyrical about the government's growth plans, the numbers in the spending review will tell a somewhat different story. If you can get your head around them, that is."
    },
    {
        "title": "Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans",
        "description": "The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-to-invest-billions-at-spending-review-as-voters-yet-to-feel-benefits-of-labour-government-13381810",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-10 18:24:00",
        "Headline": "The chancellor will confirm the budgets for each government department, as well as where she will invest billions in capital. But the Tories say this will be \"a dangerous economic gamble that risks the country's financial future\".",
        "Content": " The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK. However, Rachel Reeves will admit that \"too many people\" are yet to feel the benefits of the government's work so far. In the House of Commons, she will confirm the budgets for each government department over the next three years - with boosts expected for schools, defence and the NHS. Ms Reeves will vow to spend vast sums of money across the country to \"ensure that renewal is felt in people's everyday lives, their jobs, their communities\". She is also pledging to set out \"reforms that will guarantee towns and cities outside London and the South East can benefit from new investment\". Tap here for the latest political news Ms Reeves is expected to say: \"This government is renewing Britain. But I know too many people in too many parts of the country are yet to feel it. \n                  Holiday coming up? Here's how data roaming charges compare by network\n                 \n                  Steep rise in equity release - here are pros and cons\n                 \n                  How chaotic gang of British 'geeks' launched one of most lucrative gaming franchises of all time\n                 \"This government's task - my task - and the purpose of this spending review - is to change that ... So that people can see a doctor when they need one. Know that they are secure at work. And feel safe on their local high street. \"The priorities in this spending review are the priorities of working people. To invest in our country's security, health and economy so working people all over our country are better off.\"  Watch live coverage of the spending review on Sky News from 12pm Ms Reeves will formally confirm \"the biggest-ever local transport infrastructure investment in England's city regions\" - worth £15.6bn - as well as £86bn to \"boost science and technology\", including by building the Sizewell C nuclear power station. She will also announce the extension of the £3 cap on bus fares, Sky News understands. The cap - which Labour lifted from £2 - was due to expire at the end of this year. Meanwhile, £39bn for a new Affordable Homes Programme over the next 10 years is set to be unveiled, with the government seeking to ramp up housebuilding to hit its manifesto pledge of 1.5 million new homes by the end of this parliament.  The chancellor will argue: \"The choices in this spending review are possible only because of the stability I have introduced and the choices I took in the autumn.\" One of those choices included cutting the winter fuel allowance for almost all pensioners - a decision the government has now U-turned on at a cost of £1.25bn. However, she is not expected to explain where that money will come from until the budget this autumn. Ms Reeves will tell MPs: \"I have made my choices. In place of chaos, I choose stability. In place of decline, I choose investment. In place of retreat, I choose national renewal. \"These are my choices. These are this government's choices. These are the British people's choices.\" Read more:Why the spending review is a massive dealFive things you need to know But shadow chancellor Sir Mel Stride said this will be \"the 'spend today, tax tomorrow' spending review\" - arguing that the government is \"spending money it doesn't have, with no credible plan to pay for it\". He said in a statement: \"Rachel Reeves talks about 'hard choices' - but her real choice has been to take the easy road. Spend more, borrow more, and cross her fingers. This spending review won't be a plan for the future - it will be a dangerous gamble with Britain's economic stability.\" He went on: \"Today, we'll hear slogans, spin and self-congratulation - but not the truth. Don't be fooled. Behind the spin lies a dangerous economic gamble that risks the country's financial future.\""
    },
    {
        "title": "The spending review is a massive deal for Rachel Reeves, Labour, and the country - here's what to expect",
        "description": "This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - &#163;600bn over the next three to four years.",
        "url": "https://news.sky.com/story/the-spending-review-is-a-massive-deal-for-rachel-reeves-labour-and-the-country-heres-what-to-expect-13381824",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935131.jpg?20250605145315",
        "type": "Business",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-10 19:05:00",
        "Headline": "This is a huge political moment for this Labour government - and a chance for Rachel Reeves to sell this government's story of 'renewal'.",
        "Content": "\n          Political editor\n              @BethRigby\n  This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - £600bn over the next three to four years. But it is also a massive political moment as the Labour government tries to turn the corner on a difficult first year and show voters it can deliver the change it promised. It is not, say No 10 insiders, another reset - but rather a chance to show \"working people\" why they voted Labour. Look at the blitz of announcements over recent days, and this is a government trying to sell the story of renewal. Tap here for the latest political news  On Tuesday, the prime minister and his energy secretary, Ed Miliband, announced the biggest nuclear building programme for half a century - with £14.2bn being poured into Sizewell C on the Suffolk coastline to create over 10,000 jobs over the next decade and provide energy security. Last week, the chancellor announced £15bn for new rail, tram and bus networks across the West Midlands and the North. She's also expected to green-light a new rail line between Liverpool and Manchester on Wednesday, and invest capital in housebuilding. In total, there will be £113bn of additional capital investment, which the government will frame as the long-promised \"decade of renewal\" around the three pillars of security, health and the economy. But that is only one half of this spending review and only one half of the story we will hear today, because the largesse of the capital investment - which the chancellor will say is only possible because of the choices she made in the first year of government - will be matched with spending settlements for day-to-day spending across Whitehall that will draw into sharp relief the choices and priorities for this government. Security and health are two of her pillars, and it will be defence and health that will take a bigger share of the spending pot.  Frustration in the Home Office Having front-loaded day-to-day spending into the first and second years of this Labour administration, the overall pot will rise by 1.2% in real terms every year for the rest of the parliament. That is pretty modest growth and, bluntly, it means that if the defence and NHS budgets get a bigger share of the pot, there will be real terms cuts in some unprotected departments. One to watch is the Home Office, where the home secretary was the last to hold out on a settlement and seems to have had it imposed on her by the chancellor. Hers is a huge brief, spanning police - including the manifesto pledge to increase police on the beat by 13,000 - border security, immigration and homeland security. There is frustration in the Home Office that while \"security\" is one of the government's pillars, it is the Ministry of Defence that has been given the funding. If Yvette Cooper is to deliver on police numbers, what else might have to give? Watch too for a squeeze on council budgets as the chancellor uses her capital budget to invest in housebuilding, while day-to-day spending is squeezed across our councils, schools and courts.  Reeves under pressure to boost spending This is the rub. Rachel Reeves will insist at lunchtime that spending is rising by £190bn more over the course of the parliament, partly because of those tough tax rises in her first budget. But largesse in capital investment won't be able to disguise the short-term pressures on day-to-day spending from a Labour Party and a set of voters fed up with cuts and feeling like their lives aren't improving. The winter fuel reversal is the proof. The chancellor, who will not loosen her fiscal rule of funding day-to-day spending through tax receipts, has to find £1.25bn to pay the allowance to nine million pensioners this winter. She is also under pressure to lift the two-child benefits cap, with Liz Kendall, Bridget Phillipson and Sir Keir Starmer all thought to want this to happen. That will cost up to £3bn. There is pressure to change the disability cuts in order to get the welfare changes through parliament. The point is that the chancellor is under huge pressure to lift spending, not keep her foot on its throat, and that means into the autumn, the clamour for targeted tax rises will only grow. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Can Reeves sell this government's 'renewal' story? But amongst the top team, there is some guarded optimism. The political pain of the winter fuel allowance U-turn has eased the pressure on the doorstep: one very senior Labour politician told me this week that last weekend was the first time in a long time that the matter didn't come up on the doorstep and \"the first time in a long while that it felt alright\". At lunchtime, there will be pain. The headlines will scream cuts and open up talk about tax rises that will run right up to the budget in October. But it will also be a moment where this Labour government can show voters in the form of dozens of projects and thousands of jobs, that it does have a plan to rebuild. Read more:Guide to the spending reviewFive things you need to know about the spending reviewNew nuclear power station gets green light  It is a spending review that will define Labour in power for the rest of this parliament and how our country looks and feels for years to come. The political aim is to do enough - be it on hospital waiting lists, energy bills, wages, or shovels in the ground - to persuade voters at the next election to give Labour another chance. For months, MPs have been quietly grumbling that this Labour government is in power without a story to tell. On Wednesday, we'll see how well Ms Reeves can write, and sell, the next chapter."
    },
    {
        "title": "Jobless rate above predicted peak as budget tax hikes kick in",
        "description": "The UK's jobless rate ticked up to 4.6% in April while payrolled employment has fallen sharply since,  according to official figures covering the period when budget tax hikes on businesses came into effect.",
        "url": "https://news.sky.com/story/jobless-rate-above-predicted-peak-as-budget-tax-hikes-kick-in-13381453",
        "image_url": "https://e3.365dm.com/20/09/1920x1080/skynews-job-centre-plus-unemplyment_5097284.jpg?20200915121144",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-06-10 04:29:00",
        "Headline": "The ONS data piles more pressure on Chancellor Rachel Reeves, just a day after she confirmed her winter fuel U-turn would cost £1.25bn.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's jobless rate ticked up to 4.6% in April while payrolled employment has fallen sharply since,  according to official figures covering the period when budget tax hikes on businesses came into effect. The Office for National Statistics (ONS) said the new unemployment rate covering the three months to April was the highest since July 2021. It had previously stood at 4.5% - a total of more than 1.6 million people. At 4.6%, it is above the peak level predicted for this year, just in March, by the Office for Budget Responsibility. Money latest: My insurance firm charged me £700 after my dog died - is this right? Figures from the taxman also highlighted by the ONS showed the number of people in payrolled employment during May fell by 109,000 - double April's revised figure of 55,000 and the biggest monthly drop in five years. The ONS Labour Force Survey data was the first to cover April's rises in employer national insurance contributions and the national living wage - hikes to costs for businesses which lobby groups had warned would result in job losses, price rises and lower wage settlements. \n                  Liz Truss was 'right' to be radical, but the numbers need to 'add up', shadow chancellor Sir Mel Stride tells Sky News\n                 \n                  IMF upgrades UK economic growth forecast - but issues tariffs warning\n                 \n                  UK economy grows more than expected, according to official figures\n                 The ONS figures showed average weekly earnings, excluding the effects of bonuses, over the three months to April were weaker, from a downwardly revised 5.5% to 5.2% year on year.  Liz McKeown, ONS director of economic statistics, said: \"There continues to be weakening in the labour market, with the number of people on payroll falling notably. \"Feedback from our vacancies survey suggests some firms may be holding back from recruiting new workers or replacing people when they move on.\" The ONS data piles more pressure on Chancellor Rachel Reeves, just a day after she confirmed her winter fuel U-turn would cost £1.25bn. She has consistently defenced her budget, arguing the taxes on business were a one-off necessary evil to account for a £22bn \"black hole\" in the public finances inherited from the last government.  Employment minister Alison McGovern said in response to the data: \"Six months after we launched Get Britain Working, we are already seeing the benefits with economic activity at a record high, with 500,000 more people in employment since we entered office and real wages growing more since July than in the decade after 2010. \"People all over the country are benefiting from increased training opportunities and the newly launched Jobs and Careers Service will allow us to test new and innovative approaches to personalise employment support.\" Despite the wage figure easing, that 5.2% level remains comfortably ahead of the 3.5% rate of the pace of price growth - inflation. Read more from Sky News:Paternity pay in UK 'among lowest in developed world'Government commits £14.2bn to new nuclear power station The curb to consumer spending power will be welcomed by the Bank of England as its rate-setters continue to fret that strong wage growth represents an inflation risk ahead. The ONS figures did little to boost financial market expectations of a further rate cut next month. LSEG data showed 90% of market participants believed there would be no no change - with just one further cut this year being fully priced in."
    },
    {
        "title": "Hong Kong giant CKI demands to rejoin auction of stricken Thames Water",
        "description": "The Hong Kong-based investor CK Infrastructure Holdings (CKI) is demanding to be readmitted to the auction of ailing Thames Water, days after its preferred bidder walked away and pushed it closer to the abyss of nationalisation.",
        "url": "https://news.sky.com/story/hong-kong-giant-cki-demands-to-rejoin-auction-of-stricken-thames-water-13381554",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-thames-water-maintenance_6777659.jpg?20250610124827",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-10 09:32:00",
        "Headline": "CK Infrastructure, which already owns Northumbrian Water, wrote to Thames Water's chairman on Monday demanding to be allowed to rejoin the ailing utility's financial rescue process, Sky News can exclusively reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The Hong Kong-based investor CK Infrastructure Holdings (CKI) is demanding to be readmitted to the auction of ailing Thames Water, days after its preferred bidder walked away and pushed it closer to the abyss of nationalisation. Sky News can exclusively reveal CKI wrote to Sir Adrian Montague, the chairman of Thames Water, on Monday, seeking access to due diligence materials and insisting it could be ready to table a formal bid to take control of the company within six weeks. In the letter, which was signed by Andy Hunter, CKI's deputy managing director, the owner of Northumbrian Water said it was keen to rejoin the Thames Water board's equity-raise process, roughly three months after submitting a multibillion pound proposal to take control. Money latest: My insurance firm charged me £700 after my dog died - is this right? Britain's biggest water utility has been plunged back into crisis by a decision last week by KKR, the private equity firm, to abandon its status as preferred bidder. Sky News revealed that the decision was made after talks between KKR and Downing Street officials amid concerns about the political risk of bailing out a company which supplies essential services to more than 15 million people. Since then, Thames Water's biggest group of creditors - accounting for approximately £13bn of its vast debt-pile - has submitted what it described as a £17bn proposal to recapitalise the company. This, the bondholders said, would comprise £3bn of new equity and more than £2bn of debt funding. Existing shareholders would be completely wiped out, while there would also be several billion pounds of debt writedowns aimed at restoring financial resilience and improving services,  The bondholders are reported to be seeking immunity from prosecution for Thames Water's environmental failings, while they also want an agreement that Ofwat, the industry regulator, would drastically reduce the level of financial penalties facing the company. Last month, Thames Water was fined a record £123m over sewage leaks and the payment of dividends, with Ofwat lambasting the company over its performance and governance. Sir Adrian has run into yet more difficulties in recent days, with MPs on a key Commons select committee questioning evidence he had given to it and calling on Thames Water to claw back hundreds of thousands of pounds paid to a number of senior executives as retention payments in recent months. Under new laws, Thames Water is among half a dozen water companies which have been barred from paying bonuses this year because of their poor environmental records.  CKI owns large swathes of British infrastructure, including Northumbrian Water, Northern Gas Networks, UK Power Networks and Eversholt, the rolling-stock leasing company which has been put up for sale. Its expertise in running major companies of the scale of Thames Water would resolve a headache for ministers anxious to avoid placing the group into a special administration regime (SAR), which would incur a multibillion pound bill for taxpayers. Ministers are also said to be wary about the lack of experience in the bondholder group at running a major water company, although Sky News revealed last week that the business veteran Mike McTighe had been lined up to spearhead their interest. \"This is a proven operator versus a group of financial engineers,\" said one person close to CKI. However, a takeover of Thames Water by CKI could yet face stiff political opposition. In April, a cross-party group of politicians wrote to Pat McFadden, the Cabinet Office minister, expressing concerns about CKI's links to Beijing. Iain Duncan Smith, the former Conservative Party leader and a strident critic of Chinese investment in the UK, posted on social media last week that a CKI takeover of Thames Water \"should be avoided at all costs\". Read more from Sky News:Unemployment rate highest in four yearsPaternity pay in UK 'among lowest in developed world'Government commits £14.2bn to new nuclear power station CKI had already expressed frustration at being eliminated from the Thames Water process in April, with The Times reporting that it had written to Ofwat to express its dismay. In recent weeks, the government has described Thames Water as \"stable\", but said it was ready to step in and take control of the company if required to. The company effectively faces a deadline of late July to finalise a rescue deal because of a referral of its five-year regulatory settlement to the Competition and Markets Authority. The Hong Kong-based company declined to comment on Tuesday."
    },
    {
        "title": "Poundland-owner closes in on sale of struggling discount chain ",
        "description": "Poundland's parent company is preparing to hand over tens of millions of pounds to help fund a takeover of the struggling British discount chain.",
        "url": "https://news.sky.com/story/poundland-owner-closes-in-on-sale-of-struggling-discount-chain-13381587",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-poundland-pound_6802760.jpg?20250118095137",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-10 10:45:00",
        "Headline": "Pepco Group is expected to hand over tens of millions of pounds as part of a deal with Gordon Brothers after a further deterioration in trading, Sky News understands. ",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Poundland's parent company is preparing to hand over tens of millions of pounds to help fund a takeover of the struggling British discount chain. Sky News has learnt that Warsaw-listed Pepco Group is expected to contribute a substantial eight-figure sum to finance Poundland's ongoing operations as part of a deal with Gordon Brothers which could be finalised as soon as this week. Sources close to the process insisted on Tuesday that a deal had yet to be formally agreed and that it was not yet certain to take place, with other outcomes still possible. Money latest: My insurance firm charged me £700 after my dog died - is this right? The Sunday Times tipped Gordon Brothers as a frontrunner to buy Poundland last month. If a transaction between Pepco and Gordon Brothers, the former owner of Laura Ashley, is struck, it will pave the way for substantial job losses triggered by the likely closure of well over 100 Poundland stores across the country. That figure could ultimately reach between 150 and 200 shops, putting thousands of jobs at risk. \n                  The spending review: Five things you need to know\n                 \n                  Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans\n                 \n                  The spending review is a massive deal for Rachel Reeves, Labour, and the country - here's what to expect\n                 Steep rent cuts are also expected to be negotiated with Poundland landlords, the Telegraph reported at the weekend. Gordon Brothers is said to have seen off competition from Hilco Capital to emerge as the frontrunner to secure a deal in recent days. At least one other party is thought to have been interested in bidding in recent weeks, while other suitors - including the new owner of WH Smith's high street chain, Modella Capital - were eliminated earlier in the process. One person close to the situation said it was conceivable that an agreement to sell Poundland to Gordon Brothers could be announced as early as Wednesday morning, with a formal restructuring plan potentially following shortly afterwards. Poundland employs roughly 16,000 people across an estate of over 800 shops in the UK and Ireland. Tax hikes announced by Rachel Reeves, the chancellor, in last autumn's budget have increased the financial pressure on high street retailers. In recent months, chains including Lakeland and The Original Factory Shop have changed hands amid challenging circumstances. Last weekend, Sky News revealed that River Island, the family-owned clothing retailer, was also working with advisers on a restructuring plan, with store closures and job losses possible. Pepco said last month that underlying earnings at Poundland could be wiped out in the current financial year, underlining the scale of the challenge facing a new owner. Read more from Sky News:Unemployment rate highest in four yearsPaternity pay in UK 'among lowest in developed world'Government commits £14.2bn to new nuclear power station In a statement issued to Sky News, a Pepco spokesperson said: \"The focus of the Group and advisers is currently on a potential sale of Poundland. \"This is an ongoing process, and no final decisions have been taken.\" Neither Gordon Brothers nor Teneo, which is handling the sale process, could be reached for comment."
    },
    {
        "title": "M&S resumes limited online sales after ransomware attack",
        "description": "Marks & Spencer (M&S) has resumed some online clothes orders six weeks after a damaging cyberattack that the retailer has warned will cost it hundreds of millions of pounds.",
        "url": "https://news.sky.com/story/ms-resumes-limited-online-sales-after-ransomware-attack-13381515",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-marks-and-spencer-m-and-s_6915979.jpg?20250514112929",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-10 07:53:00",
        "Headline": "The company says that customers will be able to access more products online in the coming weeks as its systems get back in gear.",
        "Content": "Marks & Spencer (M&S) has resumed some online clothes orders six weeks after a damaging cyberattack that the retailer has warned will cost it hundreds of millions of pounds. \"Select fashion ranges\" are available again for the first time in 46 days for customers across Britain. M&S said that people in Northern Ireland were still missing out as its online operations get back in gear. Money latest: My insurance firm charged me £700 after my dog died - is this right? Ransomware hackers broke into its systems in April by tricking employees at a third-party contractor, skirting its digital defences, according to the company.  \"We are bringing back online shopping this week,\" said John Lyttle, managing director of fashion, home and beauty. \"A selection of our best-selling fashion ranges will be available for home delivery to England, Scotland and Wales. \n                  M&S website goes down - hours after financial impact of ransomware attack revealed\n                 \n                  What should M&S customers do after criminals stole personal data in huge attack?\n                 \n                  M&S says customers' personal data taken by hackers\n                 \"More of our fashion, home and beauty products will be added every day and we will resume deliveries to Northern Ireland and Click and Collect in the coming weeks.\" Read more from Sky News:Unemployment rate highest in four yearsPaternity pay in UK 'among lowest in developed world'Government commits £14.2bn to new nuclear power station M&S stopped taking clothing and home orders through its website and app on 25 April. Three days earlier, it said it was managing a \"cyber incident\", with problems for its contactless pay and click and collect services over the Easter holiday weekend. Last month, M&S said it expected online disruption to continue into July and forecast the attack would cost it £300m. However, it expected insurance would cover some of those losses. The company has refused to say if it has paid any ransom to the hackers."
    },
    {
        "title": "KPMG to launch election process for next global chair",
        "description": "KPMG, one of the world's big four accountancy firms, is preparing to kick off a process to select its next global chairman amid growing speculation that its UK chief intends to stand for the role.",
        "url": "https://news.sky.com/story/kpmg-to-launch-election-process-for-next-global-chair-13381543",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-kpmg-auditor_6318789.jpg?20231012081952",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-10 09:10:00",
        "Headline": "Jon Holt, who has run KPMG in the UK since 2021, is being tipped by colleagues to stand for the top global job at the professional services firm next year, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n KPMG, one of the world's big four accountancy firms, is preparing to kick off a process to select its next global chairman amid growing speculation that its UK chief intends to stand for the role. Sky News has learnt that Jon Holt, who has been chief executive of the professional services giant's UK arm since 2021, is being widely touted by colleagues as a contender to replace Bill Thomas as chair of KPMG Global next year. The formal election process will not get under way until the first half of 2026, according to insiders. Money latest: My insurance firm charged me £700 after my dog died - is this right? Under Mr Holt's stewardship, KPMG's financial performance and governance have been stabilised following a torrid period in which it was hit by multiple fines for audit failings. The most notorious of these related to Carillion, the collapsed construction giant. KPMG has not yet disclosed details of the process of electing Mr Thomas's successor, although the incumbent was chosen by KPMG's global council, which includes representation from all member firms. Previous chairs of KPMG's global network, including the Brit Sir Mike Rake, have combined the role with leading their domestic firm, although it was unclear whether such a dual role would still be seen as viable. In a statement issued to Sky News, a KPMG International spokesperson said: \"Bill Thomas's term as KPMG Global chairman and CEO runs to September 30 2026. \"KPMG has an established process for electing a new global chairman and we expect to announce succession plans in spring 2026.\" Read more from Sky News:Unemployment rate highest in four yearsPaternity pay in UK 'among lowest in developed world'Government commits £14.2bn to new nuclear power station A spokesman for KPMG UK declined to comment on whether Mr Holt would put himself forward for the role. Mr Holt could not be reached for comment."
    },
    {
        "title": "Wood Group races to finalise Sidara deal by end of June",
        "description": "Wood Group, the troubled London-listed oil services company, is racing to finalise a cut-price takeover by a Gulf-based rival by the end of the month.",
        "url": "https://news.sky.com/story/wood-group-races-to-finalise-sidara-deal-by-end-of-june-13381526",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-beryl-bravo-oil-production_6362376.jpg?20231116133556",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-10 08:24:00",
        "Headline": "The troubled Aberdeen-based oil services group will this week request a further extension to a Takeover Panel deadline for its UAE-based suitor to make a firm offer, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Wood Group, the troubled London-listed oil services company, is racing to finalise a cut-price takeover by a Gulf-based rival by the end of the month. Sky News has learnt that Wood and Sidara, its UAE-based suitor, are to request an extension to a 'put up or shut up' deadline on Thursday for the latter to make a firm offer. The joint request to the Takeover Panel, which is expected to be granted, is likely to involve a shorter extension than the maximum 28 days allowed under City rules, reflecting the companies' confidence that a deal will be agreed. Money latest: My insurance firm charged me £700 after my dog died - is this right? Wood and Sidara are aiming to get a binding transaction agreed by 30 June, when a waiver of Wood's lending covenants is due to expire, according to industry insiders. A public statement is likely to be made on Thursday. Sidara tabled a 35p-a-share offer for Wood in April which valued the Aberdeen-based target at just over £242m. \n                  The spending review: Five things you need to know\n                 \n                  Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans\n                 \n                  The spending review is a massive deal for Rachel Reeves, Labour, and the country - here's what to expect\n                 It came less than a year after it proposed a deal worth about £1.5bn, after which Wood's shares collapsed in the wake of revelations about its past financial results and corporate governance. Read more from Sky News:Unemployment rate highest in four yearsPaternity pay in UK 'among lowest in developed world'Government commits £14.2bn to new nuclear power station The company's shares have been suspended since the beginning of last month. Wood was also the subject of an earlier takeover approach from Apollo Global Management, the private equity firm. A spokesman for Wood declined to comment."
    },
    {
        "title": "Paternity pay in UK is one of the lowest in the developed world, MPs say",
        "description": "The UK has one of the \"worst statutory leave offers for fathers and other parents in the developed world\", the chairwoman of the Women and Equalities Committee has warned.",
        "url": "https://news.sky.com/story/paternity-pay-in-uk-is-one-of-the-lowest-in-the-developed-world-mps-say-13381438",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-paternity-leave-father_6937865.jpg?20250610031856",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-06-10 01:58:00",
        "Headline": "Sarah Owen, chairwoman of the Women and Equalities Committee, said the UK's parental leave system was in \"urgent need of an overhaul to fit with the reality of working parents' lives\".",
        "Content": "The UK has one of the \"worst statutory leave offers for fathers and other parents in the developed world\", the chairwoman of the Women and Equalities Committee has warned. Sarah Owen said the UK's parental leave system was in \"urgent need of an overhaul to fit with the reality of working parents' lives\". \"The UK's parental leave system has fallen far behind most comparable countries,\" she added. Her comments come as a new report by her House of Commons committee found that a maximum of two weeks' paternity leave is \"completely out of step with how most couples want to share their parenting responsibilities\" and \"entrenches outdated gender stereotypes about caring\". Explainer: How paternity leave in the UK compares to other countries The UK's rate of parental pay is \"completely out of kilter with the cost of living, has not kept pace with inflation and is far below rates in most comparable countries\", the report states.  The Women and Equalities Committee has urged the government to consider raising paternity pay to the level of maternity pay during the first six weeks, which equals 90% of someone's average earnings. \n                  Ballymena protests: It is hard to see where the violence will end - and it could go on for weeks \n                 \n                  Ballymena protest: Fireworks, petrol bombs and glass bottles thrown at riot police as serious disorder deepens\n                 \n                  Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans\n                 It also called on the government to either amend the Employment Rights Bill to legislate for a day one right to paid leave or commit to \"considering this vital change within its review\" in consultation with employers. The report stated that working parents \"will be let down by a review that leads only to tinkering around the edges of the system\". In its report, the committee also recommended a phased introduction of increases to statutory pay across the system to improve the rates for all working parents up to 80% or more of average earnings or the real living wage. Read more from Sky News:Analysis: Problems with U-turn on winter fuel paymentsGovt commits £14.2bn to new nuclear power station Additionally, it urged the government to consider options for providing statutory paid leave for all self-employed working fathers as part of its review of the parental leave system, as the lack of provision for self-employed fathers was \"deeply unfair\". The report suggests considering the introduction of a paternity allowance for self-employed fathers and other parents, similar to the maternity allowance. The upcoming review into the parental leave system must examine the function and necessity of eligibility rules, with a view to \"simplifying or removing the employment status, time in service and earnings criteria\", the committee added."
    },
    {
        "title": "The spending review is a massive deal for Rachel Reeves, Labour, and the country - here's what to expect",
        "description": "This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - &#163;600bn over the next three to four years.",
        "url": "https://news.sky.com/story/the-spending-review-is-a-massive-deal-for-rachel-reeves-labour-and-the-country-heres-what-to-expect-13381824",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-beth-rigby_6935131.jpg?20250605145315",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-10 19:05:00",
        "Headline": "This is a huge political moment for this Labour government - and a chance for Rachel Reeves to sell this government's story of 'renewal'.",
        "Content": "\n          Political editor\n              @BethRigby\n  This spending review is a massive deal. It's a massive deal because of the sums of money and capital the government is about to allocate - £600bn over the next three to four years. But it is also a massive political moment as the Labour government tries to turn the corner on a difficult first year and show voters it can deliver the change it promised. It is not, say No 10 insiders, another reset - but rather a chance to show \"working people\" why they voted Labour. Look at the blitz of announcements over recent days, and this is a government trying to sell the story of renewal. Tap here for the latest political news  On Tuesday, the prime minister and his energy secretary, Ed Miliband, announced the biggest nuclear building programme for half a century - with £14.2bn being poured into Sizewell C on the Suffolk coastline to create over 10,000 jobs over the next decade and provide energy security. Last week, the chancellor announced £15bn for new rail, tram and bus networks across the West Midlands and the North. She's also expected to green-light a new rail line between Liverpool and Manchester on Wednesday, and invest capital in housebuilding. In total, there will be £113bn of additional capital investment, which the government will frame as the long-promised \"decade of renewal\" around the three pillars of security, health and the economy. But that is only one half of this spending review and only one half of the story we will hear today, because the largesse of the capital investment - which the chancellor will say is only possible because of the choices she made in the first year of government - will be matched with spending settlements for day-to-day spending across Whitehall that will draw into sharp relief the choices and priorities for this government. Security and health are two of her pillars, and it will be defence and health that will take a bigger share of the spending pot.  Frustration in the Home Office Having front-loaded day-to-day spending into the first and second years of this Labour administration, the overall pot will rise by 1.2% in real terms every year for the rest of the parliament. That is pretty modest growth and, bluntly, it means that if the defence and NHS budgets get a bigger share of the pot, there will be real terms cuts in some unprotected departments. One to watch is the Home Office, where the home secretary was the last to hold out on a settlement and seems to have had it imposed on her by the chancellor. Hers is a huge brief, spanning police - including the manifesto pledge to increase police on the beat by 13,000 - border security, immigration and homeland security. There is frustration in the Home Office that while \"security\" is one of the government's pillars, it is the Ministry of Defence that has been given the funding. If Yvette Cooper is to deliver on police numbers, what else might have to give? Watch too for a squeeze on council budgets as the chancellor uses her capital budget to invest in housebuilding, while day-to-day spending is squeezed across our councils, schools and courts.  Reeves under pressure to boost spending This is the rub. Rachel Reeves will insist at lunchtime that spending is rising by £190bn more over the course of the parliament, partly because of those tough tax rises in her first budget. But largesse in capital investment won't be able to disguise the short-term pressures on day-to-day spending from a Labour Party and a set of voters fed up with cuts and feeling like their lives aren't improving. The winter fuel reversal is the proof. The chancellor, who will not loosen her fiscal rule of funding day-to-day spending through tax receipts, has to find £1.25bn to pay the allowance to nine million pensioners this winter. She is also under pressure to lift the two-child benefits cap, with Liz Kendall, Bridget Phillipson and Sir Keir Starmer all thought to want this to happen. That will cost up to £3bn. There is pressure to change the disability cuts in order to get the welfare changes through parliament. The point is that the chancellor is under huge pressure to lift spending, not keep her foot on its throat, and that means into the autumn, the clamour for targeted tax rises will only grow. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Can Reeves sell this government's 'renewal' story? But amongst the top team, there is some guarded optimism. The political pain of the winter fuel allowance U-turn has eased the pressure on the doorstep: one very senior Labour politician told me this week that last weekend was the first time in a long time that the matter didn't come up on the doorstep and \"the first time in a long while that it felt alright\". At lunchtime, there will be pain. The headlines will scream cuts and open up talk about tax rises that will run right up to the budget in October. But it will also be a moment where this Labour government can show voters in the form of dozens of projects and thousands of jobs, that it does have a plan to rebuild. Read more:Guide to the spending reviewFive things you need to know about the spending reviewNew nuclear power station gets green light  It is a spending review that will define Labour in power for the rest of this parliament and how our country looks and feels for years to come. The political aim is to do enough - be it on hospital waiting lists, energy bills, wages, or shovels in the ground - to persuade voters at the next election to give Labour another chance. For months, MPs have been quietly grumbling that this Labour government is in power without a story to tell. On Wednesday, we'll see how well Ms Reeves can write, and sell, the next chapter."
    },
    {
        "title": "Spending review: More cash for schools, NHS and defence expected as chancellor unveils plans",
        "description": "The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK.",
        "url": "https://news.sky.com/story/chancellor-rachel-reeves-to-invest-billions-at-spending-review-as-voters-yet-to-feel-benefits-of-labour-government-13381810",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-notes-banknotes_6938843.jpg?20250611021632",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-10 18:24:00",
        "Headline": "The chancellor will confirm the budgets for each government department, as well as where she will invest billions in capital. But the Tories say this will be \"a dangerous economic gamble that risks the country's financial future\".",
        "Content": " The chancellor will unveil the spending review at lunchtime - with plans to invest billions of pounds across the UK. However, Rachel Reeves will admit that \"too many people\" are yet to feel the benefits of the government's work so far. In the House of Commons, she will confirm the budgets for each government department over the next three years - with boosts expected for schools, defence and the NHS. Ms Reeves will vow to spend vast sums of money across the country to \"ensure that renewal is felt in people's everyday lives, their jobs, their communities\". She is also pledging to set out \"reforms that will guarantee towns and cities outside London and the South East can benefit from new investment\". Tap here for the latest political news Ms Reeves is expected to say: \"This government is renewing Britain. But I know too many people in too many parts of the country are yet to feel it. \n                  Holiday coming up? Here's how data roaming charges compare by network\n                 \n                  Steep rise in equity release - here are pros and cons\n                 \n                  How chaotic gang of British 'geeks' launched one of most lucrative gaming franchises of all time\n                 \"This government's task - my task - and the purpose of this spending review - is to change that ... So that people can see a doctor when they need one. Know that they are secure at work. And feel safe on their local high street. \"The priorities in this spending review are the priorities of working people. To invest in our country's security, health and economy so working people all over our country are better off.\"  Watch live coverage of the spending review on Sky News from 12pm Ms Reeves will formally confirm \"the biggest-ever local transport infrastructure investment in England's city regions\" - worth £15.6bn - as well as £86bn to \"boost science and technology\", including by building the Sizewell C nuclear power station. She will also announce the extension of the £3 cap on bus fares, Sky News understands. The cap - which Labour lifted from £2 - was due to expire at the end of this year. Meanwhile, £39bn for a new Affordable Homes Programme over the next 10 years is set to be unveiled, with the government seeking to ramp up housebuilding to hit its manifesto pledge of 1.5 million new homes by the end of this parliament.  The chancellor will argue: \"The choices in this spending review are possible only because of the stability I have introduced and the choices I took in the autumn.\" One of those choices included cutting the winter fuel allowance for almost all pensioners - a decision the government has now U-turned on at a cost of £1.25bn. However, she is not expected to explain where that money will come from until the budget this autumn. Ms Reeves will tell MPs: \"I have made my choices. In place of chaos, I choose stability. In place of decline, I choose investment. In place of retreat, I choose national renewal. \"These are my choices. These are this government's choices. These are the British people's choices.\" Read more:Why the spending review is a massive dealFive things you need to know But shadow chancellor Sir Mel Stride said this will be \"the 'spend today, tax tomorrow' spending review\" - arguing that the government is \"spending money it doesn't have, with no credible plan to pay for it\". He said in a statement: \"Rachel Reeves talks about 'hard choices' - but her real choice has been to take the easy road. Spend more, borrow more, and cross her fingers. This spending review won't be a plan for the future - it will be a dangerous gamble with Britain's economic stability.\" He went on: \"Today, we'll hear slogans, spin and self-congratulation - but not the truth. Don't be fooled. Behind the spin lies a dangerous economic gamble that risks the country's financial future.\""
    },
    {
        "title": "The spending review: Five things you need to know",
        "description": "Even for those of us who follow these kinds of things on a regular basis, the spending review is, frankly, a bit of a headache.",
        "url": "https://news.sky.com/story/the-five-things-you-need-to-know-about-the-spending-review-13381750",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-spending-review-ed-conway_6935132.jpg?20250605145334",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-06-10 16:07:00",
        "Headline": "It's one of the biggest moments in the economic calendar - but harder to get your head around than the budget. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n Even for those of us who follow these kinds of things on a regular basis, the spending review is, frankly, a bit of a headache. This is one of the biggest moments in Britain's economic calendar - bigger, in some respects, than the annual budget. After all, these reviews, which set departmental spending totals for years to come, only happen every few years, while budgets come around every 12 months (or sometimes more often). Yet trying to get your head around the spending review - in particular this year's spending review - is a far more fraught exercise than with the budget. In large part that's because the Office for Budget Responsibility (OBR), the quasi-independent body that scrutinises the government's figures, is not playing a part this time around. There will be no OBR report to cast light, or doubt, on some of the claims from the government. Added to this, the data on government spending are famously abstruse. So perhaps the best place to start when approaching the review is to take a deep breath and a step back. With that in mind, here are five things you really need to know about the 2025 spending review. 1. It's not about all spending That might seem like a strange thing to say. Why would a spending review not concern itself with all government spending? But it turns out this review doesn't even cover the majority of government spending in the coming years. To see what I mean you need to remember that you can split total government spending (£1.4trn in this fiscal year) into two main categories. First there's what you might call non-discretionary spending. Spending on welfare, on pensions, on debt interest. This is spending the government can't really change very easily on a year-to-year basis. It's somewhat uncontrolled, but since civil servants wince at that idea, they have given it a name that suggests precisely the opposite: \"annually managed expenditure\" or AME. Then there's the spending the government has a little more control over: spending in its departments, from the Ministry of Defence to the NHS to the Home Office. This is known as \"departmental spending\". This is what the spending review is about - determining what departments spend. The key thing to note here is that these days departmental spending (actually, to confuse things yet further, the Treasury calls it Departmental Expenditure Limits or DEL) is quite a bit smaller than AME (the less controlled bit with benefits, pensions and debt interest costs). In short, this spending review is actually only about a fraction - about 41p in every pound - of government spending. You can break it down further, by the way. Because departmental spending can be split into day-to-day spending (Resource DEL) and investment (capital DEL). But let's stop with the acronyms and move on to the second thing you really need to know. 2. It's a \"zero-based\" review. Apparently The broad amount the government is planning to spend on its departments was set in stone some time ago. The real task at hand in this review is not to decide the overall departmental spend but something else: how that money is divided up between departments. Consider: in this fiscal year (2025/26) the government is due to spend just over £500bn of your money on day-to-day expenditure. Of that, by far the biggest chunk is going to the NHS (£202bn), followed by education (£94bn), defence (£39bn) and a host of other departments. That much we know. In the next fiscal year, we have a headline figure for how much day-to-day spending to expect across government. What we don't have is that breakdown. How much of the total will be health, education, defence and so on? That, in a sense, is the single biggest question the review will set out to answer. Now, in previous spending reviews the real debate wasn't over those grand departmental totals, but over something else: how much would they increase by in the following years? This time around we are told by Rachel Reeves et al that it's a slightly different philosophy. This time it's a \"zero-based review\". For anyone from the world of accountancy, this will immediately sound tremendously exciting. A zero-based review starts from the position that the department will have to justify not just an annual increase (or decrease), but every single pound it spends. It is not that far off what Elon Musk was attempting to implement with the DOGE movement in US government - a line-by-line check of spending. That's tremendously ambitious. And typically zero-based reviews tend to throw out some dramatic changes. All of which is to say, in theory, unless you believed government was run with incredibly ruthless efficiency, if this really were a zero-based review, you'd expect those departmental spending numbers to yo-yo dramatically in this review. They certainly shouldn't just be moving by small margins. Is that really what Whitehall will provide us with in this review? Almost certainly not. Read more from Sky News:UK unemployment rises to highest in four yearsM&S climbs after online order breakthrough 3. It's the first multi-year review in ages What we will get, however, is a longer-range set of spending plans than government has been able to provide in a long time. I said at the start that these reviews are typically multi-year affairs, setting budgets many years in advance. However, the last multi-year review happened in the midst of COVID and you have to look back to 2015 for the previous multi year review. That certainty about future budgets matters for any government department attempting to map out its plans and, hopefully, improve public sector productivity in the coming years. So the fact that this review will set spending totals not just for next fiscal year but for the next three years is no small deal. Indeed, for investment spending (which is actually the thing the government will probably spend more time talking about), we get numbers for four successive years. And the chances are that is what the government will most want to talk about. 4. It's not \"austerity\" One of the big questions that periodically returns to haunt the government is that we are heading for a return to the austerity policies prosecuted by George Osborne after 2010. So it's worth addressing this one quickly. The spending totals implied by this spending review are nothing like those implemented by the coalition government between 2010 and 2015. You get a sense of this when you look at total public spending, not in cash or even inflation-adjusted terms (which is what the Treasury typically likes to show us), but at those figures as a percentage of GDP. Day-to-day spending dropped from 21.5% of GDP in 2009/10 to 15% of GDP in 2016/17. This was one of the sharpest falls in government spending on record. By contrast, the spending envelope for this review will see day-to-day spending increasing rather than decreasing in the coming years. The real question comes back to how that extra spending is divided between departments. Much money has already been promised for the NHS and for defence. That would seem, all else equal, to imply less money for everyone else. But overshadowing everything else is the fact that there's simply not an awful lot of money floating around. 5. It's not a big splurge either While the totals are indeed due to increase in the coming years, they are not due to increase by all that much. Indeed, compared with most multi-year spending reviews in the past, this one is surprisingly small. In each year covered by the 2000 and 2002 comprehensive spending reviews under Gordon Brown, for instance, capital investment grew by 16.3% and 10.6% respectively. This time around, it's due to increase by just 1.3%. Now, granted, that slightly understates it. Include 2025/26 (not part of this review but still a year of spending determined by this Labour government) and the annual average increase is 3.4%. Even so, the overall picture is not one of plenty, but one of moderation. While Rachel Reeves will wax lyrical about the government's growth plans, the numbers in the spending review will tell a somewhat different story. If you can get your head around them, that is."
    },
    {
        "title": "UK government sanctions Israeli ministers for 'inciting settler violence' against Palestinians",
        "description": "The UK government has sanctioned two Israeli government ministers due to their \"repeated incitements of violence against Palestinian civilians\", the Foreign Office has said.",
        "url": "https://news.sky.com/story/uk-government-sanctions-israeli-ministers-over-comments-made-on-gaza-13381489",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-itamar-ben-gvir-bezalel-smotrich_6938349.jpg?20250610140700",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-10 13:00:00",
        "Headline": "The ministers are now subject to a freeze on UK assets and director disqualifications, as well as a ban on entering the country.",
        "Content": " The UK government has sanctioned two Israeli government ministers due to their \"repeated incitements of violence against Palestinian civilians\", the Foreign Office has said. The two ministers are Itamar Ben-Gvir and Bezalel Smotrich, and the UK is imposing sanctions alongside Australia, Canada, New Zealand and Norway. The ministers are being sanctioned in their personal capacities and are now subject to a freeze on UK assets and director disqualifications, as well as a ban on entering the country. Politics latest: Sanctions 'a major step' The Foreign Office says they are \"responsible for, engaging in, inciting, promoting and/or supporting activity which amounts to a serious abuse of the right of individuals not to be subjected to cruel, inhuman or degrading treatment or punishment, in particular acts of aggression and violence against Palestinian individuals in the West Bank\". Foreign Secretary David Lammy told broadcasters the two ministers have been \"inciting violence\" and \"encouraging egregious abuses of human rights\" for \"months\", which he has raised repeatedly with the Israeli government. He added: \"We stand for a two-state solution, and the settler violence that we've seen in the West Bank particularly is entirely unacceptable and must stop.\" Israel's foreign minister, Gideon Sa'ar, condemned the decision as \"outrageous\", and said he had discussed the move with Benjamin Netanyahu, Israel's prime minister, earlier on Tuesday. \"We will hold a special government meeting early next week to decide on our response to this unacceptable decision,\" he added. US secretary of state Marco Rubio also condemned the sanctions, saying they \"do not advance US-led efforts to achieve a ceasefire, bring all hostages home, and end the war\". He continued: \"We reject any notion of equivalence: Hamas is a terrorist organization that committed unspeakable atrocities, continues to hold innocent civilians hostage, and prevents the people of Gaza from living in peace. We remind our partners not to forget who the real enemy is. \"The United States urges the reversal of the sanctions and stands shoulder-to-shoulder with Israel.\" Who are the sanctioned Israeli ministers? Mr Ben-Gvir is the far-right national security minister in the Netanyahu government, and is the leader of the Jewish Power party in the Knesset (parliament). Our international affairs editor Dominic Waghorn explains that he was \"once convicted of being a member of a Jewish terrorist organisation and advocated the expulsion of Palestinians from their lands\". Mr Smotrich is the finance minister and a Jewish settler who has denied the existence of Palestinians as a people. He leads the National Religious Party - Religious Zionism party in the Knesset. Dominic Waghorn reports that he has most recently said \"not a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. Allies call for 'meaningful action' to stop settler violence In a joint statement, the foreign ministers of the UK, Australia, Canada, New Zealand, and Norway said the pair \"have incited extremist violence and serious abuses of Palestinian human rights\", adding: \"Extremist rhetoric advocating the forced displacement of Palestinians and the creation of new Israeli settlements is appalling and dangerous.\" \"The Israeli government must uphold its obligations under international law, and we call on it to take meaningful action to end extremist, violent and expansionist rhetoric,\" they added. The foreign ministers emphasised that today's measures \"do not deviate from our unwavering support for Israel's security, and we continue to condemn the horrific terror attacks of 7 October by Hamas\", but rather are \"targeted towards individuals who in our view undermine Israel's own security and its standing in the world\". \"We continue to want a strong friendship with the people of Israel based on our shared ties, values and commitment to their security and future,\" they said. The UK shadow foreign secretary, Dame Priti Patel, said the government must \"leverage its influence at every opportunity to ensure the remaining hostages are released, that aid continues to reach those who need it, and a sustainable end to the conflict is achieved\". She added that the party has \"always been committed to supporting a two-state solution - delivered in the right way, and at the right time - and will work with the government to support efforts to achieve this, where those efforts are effective\". Read more:Greta Thunberg accuses Israel of 'an illegal act'Ministers share 'same frustrations' over Gaza war as protestersGet inside The Wargame podcast UK had previously prepared sanctions Last October, former foreign secretary Lord David Cameron told Sky News he'd planned to sanction them while in government, but \"ran out of time\" when the surprise election was called for July. Cameron, who returned to frontline politics under Rishi Sunak, said Mr Smotrich and Mr Ben-Gvir had made \"abhorrent\" comments.  He said: \"I was looking at the things we could do to say to the Israelis we back your right to self-defence… but at the same time, we do want you to try and obey… humanitarian law. \"And these two ministers are people who have tried, they've encouraged you, to stop aid getting into Gaza and encouraged the extreme settlers in the West Bank to carry out illegal acts. \"So it seemed to me it was worth looking at whether we could sanction these two individual ministers.\""
    },
    {
        "title": "Sanctioning of ministers adds to Israel's growing ostracisation over Gaza and West Bank",
        "description": "This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington.",
        "url": "https://news.sky.com/story/sanctioning-of-ministers-adds-to-israels-growing-ostracisation-over-gaza-and-west-bank-13381689",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-netanyahu-iran-nuclear-weapons_6931992.jpg?20250531154244",
        "type": "Politics",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-06-10 14:15:00",
        "Headline": "The UK government has announced sanctions against Israel's finance minister Bezalel Smotrich and national security minister Itamar Ben-Gvir.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  This is a major step from Britain and a number of other countries against Israel, and one that puts them at odds with Washington. It adds to the growing ostracisation of Israel over its war in Gaza and conduct in the occupied West Bank. Read more: UK government sanctions Israeli ministers Bezalel Smotrich is Israel's far-right finance minister, a Jewish settler and someone who has denied the existence of Palestinians as a people. He has most recently said \"not a grain of wheat\" should be allowed to enter Gaza, saying it will be \"entirely destroyed\" and its people should be encouraged to leave in great numbers to go to other countries. Itamar Ben-Gvir, the country's far-right national security minister, was once convicted of supporting a Jewish terrorist organisation and advocated the expulsion of Palestinians from their lands. Their critics will say their sanctioning has been a long time coming, is largely symbolic, and will achieve little. The British government singles out Israel's conduct in the West Bank as grounds for its action against the two men. Extremist Jewish settlers have run rampant across the occupied territories under Benjamin Netanyahu's government, with 1,900 recorded acts of violence against Palestinians since January last year. The Netanyahu government has approved a record number of new Jewish settlements in the West Bank. Under international law, all settlements on occupied land are illegal. Politics latest: Sanctions 'a major step' Israel is increasingly isolated over its war in Gaza and actions on the West Bank. The International Criminal Court has issued arrest warrants for Mr Netanyahu and other senior figures over alleged war crimes. A number of countries and observers have deemed its conduct in Gaza as genocidal. Israel described the sanctions as unacceptable and outrageous. However, critics will wonder why the Israeli prime minister is not sanctioned himself for keeping two such deeply controversial figures in his government. There is, though, a good reason for keeping them. Without them, his fragile coalition would almost certainly fall from power. The price for that though is only increasing."
    },
    {
        "title": "Sizewell C: Govt commits £14.2bn to new nuclear power station",
        "description": "Fifteen years after the Sizewell C nuclear power station was proposed, the government will announce a &#163;14.2bn commitment to the Suffolk site.",
        "url": "https://news.sky.com/story/sizewell-c-govt-commits-163142bn-to-new-nuclear-power-station-13381423",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-sizewell-c-cgi_5954167.jpg?20250610083114",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-10 01:21:00",
        "Headline": "The nuclear power site was chosen in 2010, and construction started last year, but will not start to operate until at least 2033.",
        "Content": "Fifteen years after the Sizewell C nuclear power station was proposed, the government will announce a £14.2bn commitment to the Suffolk site. Chancellor Rachel Reeves is set to confirm the funding at the GMB union conference ahead of the spending review on Wednesday, which will set departmental budgets until 2029. Energy Secretary Ed Miliband will call it a \"golden age\" of nuclear to boost the UK's energy security. The funding will go towards creating 10,000 jobs, the government will say, including 1,500 apprenticeships, and will support thousands more jobs across the UK. On Monday, it was revealed Britain's nuclear power sector grew by a quarter in 2024 to £20bn compared with three years ago, underpinned by a record workforce which has increased by a third, according to research by the Nuclear Power Association. About 87,000 people now work in the industry, with the rise largely driven by new nuclear power projects at Sizewell C and Hinkley Point C in Somerset. Sizewell C was initially proposed by French energy company EDF and China General Nuclear Power Group, but in 2022 the Conservative government bought the Chinese company out and the state now owns 83.5% of the project with EDF. \n                  What is Sizewell C – and why is it so controversial?\n                 \n                  Why the UK has warmed up to nuclear power again\n                 \n                  Meltdown? Labour goes nuclear\n                 The green light for construction to begin was given in January 2024 under the Conservative government, and at last autumn's budget, Ms Reeves announced a £2.7bn commitment to Sizewell C and said a final commitment would be announced in the 2025 spending review. Construction is expected to take between nine and 12 years and when it is complete, it will provide around six million homes with nuclear energy. A total of £330m of contracts have been signed with local companies, with 70% of all contracts expected to go to 3,500 British suppliers. Ms Reeves said: \"Today we are once again investing in Britain's renewal, with the biggest nuclear building programme in a generation. This landmark decision is our Plan for Change in action. \"We are creating thousands of jobs, kickstarting economic growth and putting more money in people's pockets.\" Read more: All you need to know about Sizewell C - and why it's so controversial HS2 all over again? Campaign group Stop Sizewell C called it \"HS2 mark 2\" after the high-speed train line that has faced high costs, delays and parts of it being axed. They questioned how much money the government will ultimately invest in the nuclear power station as they said no information has been provided about the expected total costs. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department?  Alison Downes, from Stop Sizewell C, said: \"Where is the benefit for voters in ploughing more money into Sizewell C that could be spent on other priorities, and when the project will add to consumer bills and is guaranteed to be late and overspent just like Hinkley C? \"Ministers have still not come clean about Sizewell C's cost and, given negotiations with private investors are incomplete, they have signed away all leverage and will be forced to offer generous deals that undermine value for money. Starmer and Reeves have just signed up to HS2 mark 2.\" Or vital step towards domestic clean energy? But the funding was called a \"vital step toward delivering the secure, domestic clean energy\" the UK needs by \"pro-growth\" campaign group Britain Remade. Sam Richards, CEO of the Conservative thinktank, added: \"The government must go much further.\" He called for less red tape to speed up the planning process and to show a \"real commitment\" to building nuclear power stations."
    },
    {
        "title": "Meltdown? Labour goes nuclear",
        "description": null,
        "url": "https://news.sky.com/story/meltdown-labour-goes-nuclear-13381461",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-politics-at-sam-and-annes_6856408.png?20250314163649",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-06-10 05:19:00",
        "Headline": "No subtitle found",
        "Content": "Sky News' Sam Coates and Politico's Anne McElvoy serve up their essential guide to the day in British politics. Negotiations for the spending review are complete - with reports Chancellor Rachel Reeves has refused to meet Home Secretary Yvette Cooper's demand for extra police funding. We won't have heard the end of this. Reform UK hold (another!) news conference, and the government announces its intentions to go nuclear - \"ushering in a new golden age of nuclear [power]\"."
    },
    {
        "title": "Trump's 'anti-migrant rhetoric' gives the UK's tech industry a competitive edge, say experts",
        "description": "President Trump's \"anti-migrant rhetoric\" may be helping the UK's tech industry, according to tech executives.",
        "url": "https://news.sky.com/story/trumps-anti-migrant-rhetoric-gives-the-uks-tech-industry-a-competitive-edge-say-experts-13381768",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ice-us-immigration_6938657.jpg?20250610205055",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-06-10 16:42:00",
        "Headline": "\"In the US, there's talk of there being more talent. That's changing because of some of the US politics,\" said one tech founder.",
        "Content": "\n          Science and Technology reporter\n       President Trump's \"anti-migrant rhetoric\" may be helping the UK's tech industry, according to tech executives. \"If the US continues its foreign policy, anti-migrant rhetoric, it's going to put founders off and operators off,\" said Husayn Kassai, a founder of the UK's AI Hub and the chief executive of Quench AI. \"Already you have some students that were considering moving to the US [now] considering the UK, and you have tech founders and operators, which are just as important, again increasingly considering the UK relative to the US,\" he said to Sky News during London Tech Week. His comments come amid a US political landscape in which immigrant communities across America have been surprised at the speed and ferocity with which new policies, including crackdowns and deportations, have been enacted in Mr Trump's first 100 days in office. In the last few days, some in California - the home of tech hotspot the San Francisco Bay area - have been taking direct action in protest at the Trump administration's actions. After selling his previous company Onfido for a record amount last year, Mr Kassai decided to found his new start-up in the UK because of its talent pool.  \"In the US, there's talk of there being more talent, more AI talent in particular. That's changing because of some of the US politics. \n                  UK tech firms agree takeovers as Starmer backs AI future\n                 \n                  Can we trust ChatGPT despite it 'hallucinating' answers?\n                 \n                  AI foot scanner recognises warning signs of heart failure to keep people out of hospital, researchers say\n                 \"[Also,] in places like San Francisco, there may be more AI talent but it's not accessible to early-stage startups,\" he added, saying that's because huge companies like Meta and Google are able to offer such high salaries. Talent is often the deciding factor in where companies move their operations, according to one expert whose job it is to persuade them to come to the UK. Laura Citron, chief executive of London and Partners, said she often talks to international founders thinking about where to expand globally. \"Making sure that businesses feel [...] it will be easy for them to bring international talent into the market, that will always be the most important factor.\" \"Particularly at the moment, with what's happening geopolitically, that fundamental strength of London in openness and being inclusive and welcoming has suddenly really shot up in people's importance,\" she said. The UK is the third-largest AI market in the world, according to the government, only beaten by the US and China. Yesterday, Jensen Huang, chief executive of NVIDIA predicted that within ten years, \"every industry in the UK will be a tech industry\".  The government seems to be banking on that, with investments being announced like yesterday's unveiling of a £187m AI training plan for school students and schemes to encourage infrastructure like data centres to be built around the UK. In January, the government claimed that, if AI is \"fully embraced\", it could bring £47bn to the economy every year. But although President Trump's changes to US immigration policy may push more tech workers to the UK, the US still has its draw - and cash. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department? \"When we've been looking to raise [funding], some people that I've spoken to said: 'You should go to America because they would be talking in millions',\" said Jemma Bowles, founder of endometriosis support app Endi. She is currently staying in the UK because her knowledge of the NHS makes it more practical but \"I'm not saying no to it,\" she said. \"We'll just see what happens.\" This week alone, US companies have taken over two UK tech businesses, and Mr Kassai doesn't seem surprised. \"Shareholders, investors, board members are going to find the highest bidder and the US tends to pay more,\" he said. \"There's four times as much capital invested into startup companies than there is in the whole of Europe, so naturally when it comes through a sale, the US is often able to pay a higher price.\" However, he doesn't think that will be the case forever. \"The US is going to lose its edge. Historically, it's had four times as much financial capital to invest in startups than Europe, but AI has meant that you don't need as much money to build big companies, and as a result, the US loses its advantage.\""
    },
    {
        "title": "Sizewell C: Govt commits £14.2bn to new nuclear power station",
        "description": "Fifteen years after the Sizewell C nuclear power station was proposed, the government will announce a &#163;14.2bn commitment to the Suffolk site.",
        "url": "https://news.sky.com/story/sizewell-c-govt-commits-163142bn-to-new-nuclear-power-station-13381423",
        "image_url": "https://e3.365dm.com/22/11/1920x1080/skynews-sizewell-c-cgi_5954167.jpg?20250610083114",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-10 01:21:00",
        "Headline": "The nuclear power site was chosen in 2010, and construction started last year, but will not start to operate until at least 2033.",
        "Content": "Fifteen years after the Sizewell C nuclear power station was proposed, the government will announce a £14.2bn commitment to the Suffolk site. Chancellor Rachel Reeves is set to confirm the funding at the GMB union conference ahead of the spending review on Wednesday, which will set departmental budgets until 2029. Energy Secretary Ed Miliband will call it a \"golden age\" of nuclear to boost the UK's energy security. The funding will go towards creating 10,000 jobs, the government will say, including 1,500 apprenticeships, and will support thousands more jobs across the UK. On Monday, it was revealed Britain's nuclear power sector grew by a quarter in 2024 to £20bn compared with three years ago, underpinned by a record workforce which has increased by a third, according to research by the Nuclear Power Association. About 87,000 people now work in the industry, with the rise largely driven by new nuclear power projects at Sizewell C and Hinkley Point C in Somerset. Sizewell C was initially proposed by French energy company EDF and China General Nuclear Power Group, but in 2022 the Conservative government bought the Chinese company out and the state now owns 83.5% of the project with EDF. \n                  What is Sizewell C – and why is it so controversial?\n                 \n                  Why the UK has warmed up to nuclear power again\n                 \n                  Meltdown? Labour goes nuclear\n                 The green light for construction to begin was given in January 2024 under the Conservative government, and at last autumn's budget, Ms Reeves announced a £2.7bn commitment to Sizewell C and said a final commitment would be announced in the 2025 spending review. Construction is expected to take between nine and 12 years and when it is complete, it will provide around six million homes with nuclear energy. A total of £330m of contracts have been signed with local companies, with 70% of all contracts expected to go to 3,500 British suppliers. Ms Reeves said: \"Today we are once again investing in Britain's renewal, with the biggest nuclear building programme in a generation. This landmark decision is our Plan for Change in action. \"We are creating thousands of jobs, kickstarting economic growth and putting more money in people's pockets.\" Read more: All you need to know about Sizewell C - and why it's so controversial HS2 all over again? Campaign group Stop Sizewell C called it \"HS2 mark 2\" after the high-speed train line that has faced high costs, delays and parts of it being axed. They questioned how much money the government will ultimately invest in the nuclear power station as they said no information has been provided about the expected total costs. Read more:UK to become 'AI maker not taker', says PMHow much cash will Reeves give each department?  Alison Downes, from Stop Sizewell C, said: \"Where is the benefit for voters in ploughing more money into Sizewell C that could be spent on other priorities, and when the project will add to consumer bills and is guaranteed to be late and overspent just like Hinkley C? \"Ministers have still not come clean about Sizewell C's cost and, given negotiations with private investors are incomplete, they have signed away all leverage and will be forced to offer generous deals that undermine value for money. Starmer and Reeves have just signed up to HS2 mark 2.\" Or vital step towards domestic clean energy? But the funding was called a \"vital step toward delivering the secure, domestic clean energy\" the UK needs by \"pro-growth\" campaign group Britain Remade. Sam Richards, CEO of the Conservative thinktank, added: \"The government must go much further.\" He called for less red tape to speed up the planning process and to show a \"real commitment\" to building nuclear power stations."
    },
    {
        "title": "What is Sizewell C – and why is it so controversial?",
        "description": "The UK is one step closer to a new nuclear power plant after the government announced a further &#163;14.2bn in funding.",
        "url": "https://news.sky.com/story/what-is-sizewell-c-8211-and-why-is-it-so-controversial-13381498",
        "image_url": "https://e3.365dm.com/22/03/1920x1080/skynews-sizewell-suffolk-nuclear_5720851.jpg?20220327150303",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-06-10 07:12:00",
        "Headline": "The nuclear power facility near the town of Leiston on the Suffolk coast is due to be up and running by the mid-2030s. It is expected to cost £20bn, with the government committing to £17.8bn in funding so far.",
        "Content": "The UK is one step closer to a new nuclear power plant after the government announced a further £14.2bn in funding. Sizewell C, near the town of Leiston on the Suffolk coast, is due to be up and running by the mid-2030s. While the government claims the new facility represents a \"golden age of clean energy\" and says it will create thousands of jobs - those against it warn of the catastrophic consequences of a nuclear accident and damage to the local environment. Here we look at what is due to be built at the Sizewell site - and why the project is so controversial. What is Sizewell C? The new site will house two nuclear reactors - generating up to 3.2 gigawatts of electricity, which is enough to power six million homes. The government says it could meet 7% of the country's total energy needs for up to 60 years. It was initially proposed by the French energy company EDF and China's General Nuclear Power Group, but the previous government bought the Chinese company out of its 20% stake in 2022. Together, the UK government and EDF now own 83.5% of the site. It is located near Sizewell beach - next to Sizewell A, a decommissioned nuclear site that opened in 1967, and Sizewell B, which is still running - and was the last nuclear site to open in the UK in 1995. Previous funding announcements mean the state has now invested a total of £17.8bn, with a final funding model due to be released this summer after private investors are secured to bridge the gap to the total £20bn cost. Taxpayer money is expected to contribute £700m. How long has it been in the making? The project dates back to 2008, when then Labour Prime Minister Gordon Brown declared the UK needed to boost its nuclear capacity. There are four nuclear sites running in the UK - at Heysham, Hartlepool, Torness, and Sizewell B. In 2010, the Conservative-Liberal Democrat coalition earmarked Sizewell as a potential new site. EDF began consulting with locals in the area in 2012, finally submitting its development consent order in May 2020. It was granted in July 2022 despite the Planning Inspectorate's recommendations it should be blocked over environmental concerns. It also fought off a judicial review at the Court of Appeal brought by protest group Together Against Sizewell C. Construction by EDF is due to start in the next year - and is set to take between nine and 12 years. Why are people against it? Two campaign groups - Together Against Sizewell C and Stop Sizewell C - have spearheaded efforts to block the site. Locally, they say construction will damage 150 hectares of land nearby, which is home to two different nature reserves and thousands of birds, animals, and plant species. The appeal also cited concerns it would compromise local water supplies and may run over budget or fail to even get off the ground like the now-scrapped HS2 trainline. More generally, nuclear power is very controversial. Read more: Government announces £14.2bn Sizewell funding While it does not produce carbon emissions like traditional fossil fuels, any nuclear activity is exceedingly high-risk. Nuclear fission is the process by which uranium atoms are broken down into smaller particles to produce heat, which is then boiled to create steam that powers turbines to create electricity. The International Atomic Energy Agency says all its regulated sites are the \"safest and most secure facilities in the world\" and subject to strict independent safety measures. But high-profile nuclear accidents, although incredibly rare, have leaked deadly radiation into the atmosphere, killing people and likely poisoning others for generations to come. These include the explosion at the Chernobyl plant in Ukraine in 1986 and the partial meltdown of one of the reactors at the Fukushima nuclear plant in Japan following a tsunami in 2011. Nuclear fission also produces huge amounts of radioactive waste, which has to be safely stored for hundreds of years and anti-nuclear campaigners worry about the safety of these storage sites. What are the arguments for it? The government wants to use nuclear energy to help meet its target of net zero greenhouse gas emissions by 2050. Chief executive of the Nuclear Industry Association Tom Greatrex has described Sizewell C as a \"huge step forward\" both for net zero - and energy security. The Ukraine war compromised global gas and oil supplies, much of which came from Russia, sending prices rocketing. Since then, Ukraine's Western allies have made efforts to become more autonomous with energy production. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Britain's nuclear sector grew by a quarter to £20bn in the three years to 2024, with another site at Hinkley Point in Somerset currently under construction. Some countries, like France, where EDF is based, already rely heavily on nuclear power. Sizewell C will also create 10,000 new jobs and 1,500 apprenticeships, boosting the local and UK economy. Around £330m has been tendered to local companies in contracts, with 70% of all those commissioned going to 3,500 British suppliers. Mr Greatex said: \"Sizewell C will provide reliable low-carbon power for more than 80 years, cutting gas use, creating thousands of high-quality skilled jobs, and long-term investment and opportunity up and down the country.\""
    },
    {
        "title": "Why the UK has warmed up to nuclear power again",
        "description": "For years nuclear was a dirty word. Now, the tide is turning.",
        "url": "https://news.sky.com/story/why-the-uk-has-warmed-up-to-nuclear-power-again-13381480",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-ed-miliband_6938120.jpg?20250610104259",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-06-10 06:21:00",
        "Headline": "The UK government has stumped up billions for Sizewell C - and given a vote of confidence for new, modern reactors from Rolls-Royce. The attempted nuclear revival is no coincidence, nor is it unique to the UK.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  For years nuclear was a dirty word. Now, the tide is turning. For the past 20 years or so, global nuclear power has stagnated amid concerns about its environmental damage and its safety after the Chernobyl and Fukushima disasters. Another nail in its coffin appeared to be its appalling record of delays and spiralling costs, while wind and solar plummeted in price and soared in supply. But leaders are warming up to nuclear power again, driven by a few key trends.  Read more: Govt commits £14.2bn to new nuclear power station  \n                  What is Sizewell C – and why is it so controversial?\n                 \n                  Meltdown? Labour goes nuclear\n                 \n                  Sizewell C: Govt commits £14.2bn to new nuclear power station\n                 First and foremost, they are anxious to keep pace with booming demand for low-carbon energy, driven by an explosion of data centres and the switch to electric cars and heat pumps. Datacentres for AI and cloud computing not only have a voracious appetite for energy, but as they operate 24/7, they need a steady, reliable stream. Enter: nuclear, which can provide this most of the time. The 'flat pack' power plant Secondly, a new type of nuclear power plant may finally be on the horizon. The much vaunted small modular reactors (SMRs) promise to be much faster and cheaper to build than something like Hinkley Point, because the parts can be built in a factory and assembled on site - the flat pack furniture of nuclear power. They have long been celebrated but have failed to scale up. So far they exist only in Russia and China. Nevertheless, industry and political leaders in other countries are confident their own SMR designs are almost ready to go, and the government on Tuesday said it wants Rolls-Royce to get the UK's first SMRs online \"in the 2030s\". That's most likely another 10 years from now, so a mid-term solution, with much more clean power is needed in the meantime. It also announced £14bn for Sizewell C, continuing plans for a nuclear revival started by the Tories. Beyond the UK, leaders in the US, Canada, South Korea and France and even Japan - which suffered the 2011 Fukushima disaster - and Germany - which famously detests nuclear - are warming up to it again. And so are businesses - last year Google became the first company to sign an agreement to buy nuclear energy from Kairos Power's SMRs to power its data centres. Just last week Meta did the same with Constellation Energy. As for traditional big plants, some are now being built on time and on budget, such as Barakah in the UAE. The South Korean company behind it is in talks to build the same type in the UK. Safety concerns switch from disaster to climate Thirdly, countries are trying to get off fossil fuels to fend off worse climate change. Nuclear power is very low carbon, and it is also safer than many fear. Death rates from air pollution and accidents are lower from nuclear power than from any energy form other than solar power, research by data scientists at Oxford University's Our World in Data project suggest. Nuclear power also has the lowest greenhouse gas emissions of any energy form over its lifespan, and cancer rates from accidents can be mitigated by robust responses, the scientists said. The undeniable price tag That's not to say nuclear does no damage, and the government's announcement on Tuesday glossed over what it will do with the radioactive waste. Sizewell C has been very unpopular with some local campaign groups that protest its local damage to trees, birds and coastline, and they recently launched a fresh legal challenge to additional flood barriers. Traditional large reactors like Sizewell have also been eye-wateringly expensive and slow to build, and must be routinely taken offline for maintenance. Critics argue that solar and wind power, backed up by batteries, are faster, cheaper and safer. Others want the money to be spent on reducing demand for power in the first place by insulating homes. But societies and leaders are slowly becoming less concerned about nuclear disasters and other environmental impacts, and much more worried about climate change and reliable energy supplies - as crystallised by the 2022 energy crisis and recent mass power outage in Spain and Portugal."
    }
]