[
    {
        "title": "Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash",
        "description": "Sir Keir Starmer is vowing to fight any challenge to his leadership rather than stand aside, amid claims of plotting by MPs being compared to TV's The Traitors.",
        "url": "https://news.sky.com/story/starmer-vows-to-fight-any-plot-to-oust-him-as-labour-mps-fear-budget-backlash-13468869",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-prime_7079697.jpg?20251111230605",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-11-11 22:52:00",
        "Headline": "Whispers in Westminster hint at a plot brewing behind-closed-doors to oust the prime minister. A tale of loyalty, deception, and banishments? Sounds somewhat familiar…",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Sir Keir Starmer is vowing to fight any challenge to his leadership rather than stand aside, amid claims of plotting by MPs being compared to TV's The Traitors. Number 10 is going on the attack ahead of a difficult budget this month, with fears it could prove so unpopular that Labour MPs may move against Sir Keir. But Sky News political editor Beth Rigby reports the prime minister \"has no intention of giving way\", with allies warning any challenge would lead to a \"drawn-out leadership election, spook the markets, and create more chaos that further damages the Labour brand\". One senior figure told Rigby any move against Sir Keir would be more likely to arrive after next May's elections, rather than the budget. They said many Labour MPs could probably get behind measures like tax rises for wealthier workers, pensioners and landlords, as well as scrapping the two-child benefit cap, if that's what the chancellor announces on 26 November. But there are a series of potentially damaging elections in May, including in London and for the Senedd in Wales, as Labour face a challenge from Reform UK on the right and parties like the Greens and Plaid Cymru on the left. Rigby said there is a \"settled view among some very senior figures in the party that Starmer lacks the charisma and communication skills to take on Nigel Farage and win over the public, particularly if or when he breaks a bunch of manifesto pledges\". Sir Keir and Rachel Reeves have refused to rule out breaking their manifesto promises not to raise income tax, national insurance, or VAT at the budget. The Number 10 operation to ward off a challenge comes after Sky News deputy political editor Sam Coates likened the febrile mood in the Labour high command to the TV hit The Traitors. Speaking on the Politics At Sam And Anne's podcast, he said: \"A minister got in touch at the start of the weekend to say they believe that there's some quite substantial plotting going on. \"They say there was at least one cabinet minister telling colleagues that Keir Starmer, and I quote, is finished.\" Chief political correspondent When Boris Johnson was facing mutiny from Conservative MPs, his allies launched \"Operation Save Big Dog\".\n When Margaret Thatcher was about to be ousted by her rebellious MPs in 1990, she declared: \"I fight on, I fight to win.\"\n And Harold Wilson, constantly paranoid about plots, famously quipped in 1969: \"I know what's going on. I'm going on.\" Boris Johnson was ousted less than six months after \"Operation Save Big Dog\", Margaret Thatcher resigned the following morning after saying \"I fight on\", and Harold Wilson lost a general election to Edward Heath a year after vowing that he would go on. Just saying. Read more:What tax rises will Reeves announce? Coates said the cabinet minister \"absolutely and totally denies they are up to anything nefarious whatsoever\". \"I actually do think that this is all in the style of The Traitors, because I'm not sure that there is hard and fast evidence of plotting - there might be some hints from some quarters,\" he added. \"But what seems to be completely logical is that if you're a bit worried in Number 10, you're trying to pitch roll and ward off people who are maybe thinking about the need to position themselves by starting to get out rumours of plots and hoping that the political system turns against them for disloyalty.\" Cloak-and-dagger Reports emerged on Tuesday night in The Times, The Guardian, and from the BBC of a \"bunker mode\" in Number 10, \"regime change\", and \"plotting\" to replace Sir Keir. Responding to the reports, Health Secretary Wes Streeting denied he was seeking to oust the prime minister. A spokesperson for Mr Streeting told Sky News: \"These claims are categorically untrue. \"Wes's focus has entirely been on cutting waiting lists for the first time in 15 years, recruiting 2,500 more GPs and rebuilding the NHS that saved his life.\" However, there is clearly a co-coordinated campaign by allies of the increasingly unpopular Sir Keir to try to prevent a leadership challenge by a cabinet minister or stalking horse. Sir Keir's biographer Tom Baldwin questioned the logic of those briefing from within the corridors of power. \"I'm at a loss to understand why anyone would think this sort of briefing will help Keir Starmer, the government, or even their own cause,\" he said on social media. \"Some people just can't resist, I guess, but it's all a bit nuts.\" What next? It comes ahead of Prime Minister's Questions this lunchtime, handing Tory leader Kemi Badenoch the chance to make it an awkward afternoon for Sir Keir. The health secretary will start his day on Sky News' Morning With Ridge And Frost and will then speak at an NHS providers' conference. Watch and follow live coverage across Sky News - including in the Politics Hub."
    },
    {
        "title": "Dozens of protesters storm COP30 venue in Brazil",
        "description": "Dozens of protesters have forced their way into the COP30 climate summit venue and clashed with security guards at the entrance.",
        "url": "https://news.sky.com/story/protesters-armed-with-batons-storm-cop30-venue-in-brazil-13468866",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cop30-brazil_7079710.jpg?20251111233807",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 22:40:00",
        "Headline": "COP30 comes at a precarious time for climate action. It's been met with controversy over its location in a Brazilian city on the outskirts of the Amazon rainforest.",
        "Content": " Dozens of protesters have forced their way into the COP30 climate summit venue and clashed with security guards at the entrance. Shouting angrily, crowds demanded access to the compound where thousands of delegates from nations around the world are attending this year's UN convention in Belem, Brazil. Some waved flags with slogans calling for land rights or carried signs, saying \"our land is not for sale\". An indigenous leader from the Tupinamba community, found near the lower reaches of the Tapajos River in Brazil, told Reuters they were upset about ongoing development in the Amazon rainforest. Security guards pushed the protesters back and used tables to barricade the entrance. A Reuters witness saw one security guard being rushed away in a wheelchair while clutching his stomach. Another guard with a fresh cut above his eye told the news agency he had been hit in the head by a heavy drumstick thrown from the crowd. Security confiscated several batons. The protesters dispersed shortly after the clash. Security guards later allowed delegates to exit the venue, having earlier asked them to move back inside until the area was clear. A UN spokesperson said two security staff were injured during the clashes. Read more from Sky News:Sally Kirkland dies aged 84UK stops some intel sharing with US COP30, which started on 10 November and ends on 21 November, comes at a precarious time for climate action. The conference has been met with controversy over its location in Belem, on the outskirts of the Amazon. Brazil's President Luiz Inacio Lula da Silva has highlighted indigenous communities as key players in COP30 negotiations. Dozens of indigenous leaders arrived earlier this week by boat to take part in the talks and demand more say in how forests are managed."
    },
    {
        "title": "Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster",
        "description": "Culture Secretary Lisa Nandy has defended the BBC as a crisis initiated by an edit of a Donald Trump speech engulfs the corporation.",
        "url": "https://news.sky.com/story/culture-secretary-defends-bbc-after-leak-reveals-staffs-anger-at-tory-linked-board-member-13468765",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bbc-broadcasting-house_7079672.jpg?20251111223320",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 19:13:00",
        "Headline": "Lisa Nandy has defended the BBC, saying \"some in the House\" have suggested the corporation is institutionally biased, but that she disagrees as it is a \"light on the hill for people here and across the world\".",
        "Content": "Culture Secretary Lisa Nandy has defended the BBC as a crisis initiated by an edit of a Donald Trump speech engulfs the corporation. The organisation apologised on Monday after two of its top figures, including director-general Tim Davie, resigned amid concerns about impartiality - notably the editing of a Panorama documentary from October 2024. It aired the week before the US presidential election and showed an edited speech made by Mr Trump before the 2021 Capitol riot, in which he appeared to tell supporters he was going to walk there with them to \"fight like hell\". Ms Nandy has defended the BBC, saying \"some in the House\" have suggested the BBC is institutionally biased, but that she disagrees as the BBC is a \"light on the hill for people here and across the world\". \"All of us in this House should value it, uphold it and fiercely defend it,\" she added. The culture secretary said that she has been in \"regular contact\" with BBC chair Samir Shah, ensuring that where its standards were not met, \"firm, swift and transparent action follows\". \"I welcome the steps that have already been set out and I will keep the House updated as the BBC leadership grips these issues,\" she added, saying she agreed with Mr Shah that the national broadcaster has a responsibility to \"uphold the highest standards\". \n                  BBC staff seemed fed up of Tim Davie's 'nothing to see' approach\n                 \n                  Who is Sir Robbie Gibb and why are there calls to get him off BBC board?\n                 \n                  Donald Trump and his long history of lawsuits against the media\n                 Ms Nandy said a review of the BBC's Royal Charter will begin \"imminently\" and a public consultation will be launched, with more details in the \"coming weeks\". Meanwhile, Mr Trump threatened to sue the BBC for $1bn, and a letter dated 9 November from Florida lawyer Alejandro Brito outlines three demands upon the organisation to avoid being sued, with a deadline of 10pm UK time on Friday to respond. He demanded that the BBC issue a \"full and fair retraction\" of the documentary, apologise immediately, and \"appropriately compensate\" Mr Trump.  Shadow culture secretary Nigel Huddleston has demanded an apology from the BBC to Trump and to the British public. He told the House of Commons on Tuesday that the corporation is \"in a sorry mess... of its own making\" and \"needs saving from itself\". Mr Huddleston stressed that his party wants the BBC to succeed and praises its successes, but emphasised that this \"requires institutional change and far more than a few moves at the top\". The problems of the corporation relate to its failure to honour its charter obligation to impartiality, he said. In an all-staff call on Tuesday morning, the outgoing BBC director-general Mr Davie said the corporation had \"made some mistakes that have cost us\" but added he was \"proud\" and that the organisation needed to \"fight\" for its journalism. He also admitted: \"I think we did make a mistake, and there was an editorial breach, and I think some responsibility had to be taken.\"  Mr Davie, who has worked for the BBC for 20 years and been in charge for the past five, is not stepping down immediately. He said in his departure note to staff that he is \"working through exact timings with the board to allow for an orderly transition to a successor over the coming months\". There are several potential candidates who could replace him and take on the highest-profile role in British broadcasting, which effectively serves as both the corporation's chief executive and its editor-in-chief across television, radio and online. In a Q&A with Mr Davie after the all-staff call, staff were frustrated by having their questions vetted, Sky News arts and entertainment correspondent Katie Spencer reports. Some of the questions were about the controversial appointment of Sir Robbie Gibb, the former Tory director of communications for prime minister Theresa May, to the BBC board. But when these questions were getting through the vetting process, staff tried to ask questions in the reply boxes, which were public. The anonymous comments included questions like \"How can we claim to be unbiased if Gibb is on the board?\" and \"Why is Robbie Gibb still on the board?\". Read more:The man behind the leaked BBC memoTrump's legal threat letter in fullWho is Sir Robbie Gibb and why are there calls to get him off BBC board? \"I find Robbie Gibb's continued presence at the BBC to be incredibly demoralising. It feels as if he is fighting against and undermining the work we're trying to do,\" another comment read. The leaders of the Lib Dems and SNP have both called for Sir Robbie's removal. But Ms Nandy told the Commons that the government is \"unable\" to remove Sir Robbie, as \"the charter sets a strict legal threshold that must be met before dismissal of a board member\"."
    },
    {
        "title": "Snapchat groomer jailed for sexually assaulting and raping young girls",
        "description": "A senior NHS manager, described by a judge as \"devious, scheming and manipulative\", has been jailed for 28 years for raping and sexually assaulting girls he groomed on Snapchat.",
        "url": "https://news.sky.com/story/devious-scheming-and-manipulative-nhs-manager-jailed-for-28-years-after-grooming-girls-on-snapchat-13468709",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-paul-lipscombe-snapchat_7079499.jpg?20251111181810",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 17:27:00",
        "Headline": "Leicester Crown Court heard Paul Lipscombe, 51, created multiple Snapchat profiles to groom girls before assaulting them. He also sold AI-generated child abuse videos on a website.",
        "Content": " A senior NHS manager, described by a judge as \"devious, scheming and manipulative\", has been jailed for 28 years for raping and sexually assaulting girls he groomed on Snapchat. Paul Lipscombe, 51, from Rothley in Leicestershire, admitted 34 offences against six girls - aged between 12 and 15 - between September 2023 and April 2024 after targeting them via the social media app. Leicester Crown Court heard that police became aware of his offending after a 15-year-old girl, who was reported missing, told officers that she had been raped. Prosecutor Frida Hussain KC told Judge Keith Raynor on Monday that Lipscombe was initially arrested on suspicion of kidnapping the missing girl when officers pulled over his car in Birstall, near Leicester, in April 2024. Ms Hussain told the court the girl went missing from her home late at night and was picked up by Lipscombe nearby, before he took her to a hotel. Police later found the child at a rented address. \"He accused other people of serious crimes simply in order to mask his own crimes,\" Ms Hussain added. Follow-up searches at the hotel, his car and home uncovered evidence that the youngster had been sexually assaulted. Police recovered items including soft toys, restraints, vodka, his phone and another mobile which had been wiped. \n                  Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash\n                 \n                  Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 Devious, scheming and manipulative Passing sentence on Tuesday, Judge Raynor told Lipscombe he was \"intelligent, confident, resourceful and well-organised\" and the victims had been \"truly vulnerable\". \"The evidence shows you to have been devious, scheming and manipulative. You were bold in your offending and you took very high risks. The sexual abuse of young girls was an obsession in life for you,\" he said. Leicester Crown Court heard that when Lipscombe initially contacted the girls, he told them he was in his late 20s or early 30s. Five of the six girls had met with him and been raped or sexually assaulted. A significant number of indecent images of children were discovered on his devices and online storage accounts. He had also set up a website where people could buy illegal videos of child abuse created through AI technology. The court was told Lipscombe had been targeting girls using several Snapchat accounts, including two fake names, Dom Woodmore and George. In February, Paul Lipscombe pleaded guilty to 34 offences, including two counts of rape of a child under 13; 21 counts of sexual activity with a child; three counts of sexual assault of a child under 13; and causing or inciting a child to engage in sexual activity. He also admitted six counts of making indecent photographs of children and distributing indecent photographs of children. Lipscombe was sentenced on Tuesday to 28 years and one month, and to remain on licence for three years after his release. He has been placed on the sex offenders register for life. Read more from Sky News:Bin lorry crashes into buildingLammy: Three prisoners still at largeConwoman with £5bn Bitcoin jailed Could be other victims, say police Detective Constable Lauren Speight, from the Child Abuse Investigation Unit (CAIU), said: \"Our investigation into the offending carried out by this man is continuing. \"We suspect he may have been in contact with other girls and could well have committed sexual offences against others. We would urge anyone who has been in contact with him to contact us.\" The married NHS executive worked with the University Hospitals Coventry and Warwickshire NHS Trust as a performance and informatics specialist. In a statement, the trust said Lipscombe was initially suspended when he was arrested, then later dismissed in June 2024. It added there was \"nothing has been identified at this stage to indicate this individual's criminal activity was committed as part of their role\"."
    },
    {
        "title": "Hundreds of Russian troops roll into key frontline Ukrainian city 'Mad Max-style', video appears to show",
        "description": "Hundreds of Russian troops have pushed deeper into eastern Ukrainian cities 'Mad Max-style', video released by the Russians appears to show.",
        "url": "https://news.sky.com/story/hundreds-of-russian-troops-roll-into-key-frontline-ukrainian-city-mad-max-style-video-appears-to-show-13468646",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pokrovsk-ukraine-map_7079386.jpg?20251111163612",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 15:29:00",
        "Headline": "The fight to gain hold of the key eastern city of Pokrovsk, a strategic point on a large road and rail artery in the Donetsk region, has been raging for well over a year.",
        "Content": " Hundreds of Russian troops have pushed deeper into eastern Ukrainian cities 'Mad Max-style', video released by the Russians appears to show. The troops were seen rolling through the fog on motorbikes, with some on the roofs of battered cars and vans, apparently into the city of Pokrovsk, as Russia said its forces had also pressed further into Kupiansk on Tuesday. Ukraine has acknowledged the presence of the troops on its territory, although Reuters news agency says that when the video was shot is yet to be verified. The fight to gain hold of Pokrovsk, a strategic point on a large road and rail artery in the Donetsk region, has been raging for well over a year, in Vladimir Putin's push to gain control of the whole of Ukraine's industrial east. The Donbas region comprises the neighbouring regions of Luhansk and Donetsk. Ukraine's military said around 300 Russian soldiers were now inside Pokrovsk and that Moscow had intensified efforts to get more troops in over the past few days - using dense fog for cover from drones. It said Ukrainian forces were fighting Russian groups in the city. Moscow says taking Pokrovsk, dubbed \"the gateway to Donetsk\" by Russian media, would give it a platform to push north towards the two largest remaining Ukrainian-controlled cities in the Donetsk region - Kramatorsk and Sloviansk. Posting on X on Tuesday, Ukraine's President Volodymyr Zelenskyy said: \"The front: our main focus right now is on the Pokrovsk direction and the Zaporizhzhia region, where the Russians are increasing the number and scale of assaults. \"The situation there remains difficult, in part because of weather conditions that favor the attacks. But we continue to destroy the occupier, and I thank every one of our units, every warrior involved in defending Ukraine's positions.\" Moscow and Kyiv have given different accounts of the battle for Pokrovsk. Moscow has for days said the city is surrounded, while Kyiv has denied Moscow controls the city and said on Monday that it was still able to supply neighbouring Myrnohrad. Moscow has been threatening Pokrovsk for more than a year, attempting to surround it and threaten supply lines, rather than use the deadly frontal assaults it used to take the city of Bakhmut in 2023. Russian war bloggers published a video on Tuesday showing what they said were Russian forces entering Pokrovsk along a road enveloped in fog, in what some Telegram users said looked like scenes from the Mad Max action film series, many of which are set in a post-apocalyptic landscape. The date of the footage has not been independently verified. Read more:At least 12 killed after suicide bombing in PakistanThailand-Cambodia peace deal in trouble Russia said it had taken 256 buildings and that Moscow's forces were actively advancing to the northwest and east of Pokrovsk as well as around the railway station. Russia has executed a pincer movement around the city and was close to closing it, open-source battlefield maps from both sides show, though Kyiv has counter-attacked around the town of Dobropillia. Ukraine's top military commander, Oleksandr Syrskyi, said in an interview with the New York Post that Russia was concentrating some 150,000 troops in a push to capture Pokrovsk, with mechanised groups and marine brigades forming part of this drive. Russia said its forces had taken full control of the eastern part of Kupiansk in Ukraine's Kharkiv region. A Russian commander, who gave his call sign as Hunter, said his troops had taken control of an oil depot on the eastern edge of Kupiansk. In a video statement issued by Russia's defence ministry, he said his forces had also taken control of a series of train stops along the railway to Kupiansk Vuzlovyi, a settlement around 6km (4 miles) south of the centre of Kupiansk itself. Russia also said its troops had taken control of the settlement of Novouspenivske in the southeastern Zaporizhzhia region. Ukraine withdrew from some villages, including Novouspenivske, due to intense attacks involving more than 400 artillery strikes per day, RBC-Ukraine news agency cited a military spokesperson as saying. Russia's military says it now controls more than 19% of Ukraine, or some 116,000 square km (44,800 square miles), up from 18% nearly three years ago, according to Ukrainian maps tracking frontline changes."
    },
    {
        "title": "Counterterrorism review calls for Shamima Begum and other British-linked people in Syria to be repatriated",
        "description": "Shamima Begum, the former east London schoolgirl who joined Islamic State, and other British-linked people who are detained in camps in Syria should be repatriated, a major review of UK counterterrorism policy has said.",
        "url": "https://news.sky.com/story/counterterrorism-review-calls-for-shamima-begum-and-other-british-linked-people-in-syria-to-be-repatriated-13468688",
        "image_url": "https://e3.365dm.com/20/06/1920x1080/skynews-shamima-begum-is_5011071.jpg?20251111173020",
        "type": "Home",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-11 16:47:00",
        "Headline": "The review warns that the current policy of leaving such women, men and children in limbo is \"unsustainable\" and risks turning the detention camps in northeastern Syria into \"Britain's Guantanamo\".",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n Shamima Begum, the former east London schoolgirl who joined Islamic State, and other British-linked people who are detained in camps in Syria should be repatriated, a major review of UK counterterrorism policy has said. The report, by an independent commission, said the current policy of leaving such women, men and children in limbo was \"unsustainable\" and risked turning the detention camps in northeastern Syria into \"Britain's Guantanamo\". This is a reference to the notorious American detention facility in Guantanamo Bay, Cuba, that was used to imprison al Qaeda suspects indefinitely. The Independent Commission on UK Counterterrorism warned that conditions at the Syrian camps, including Al Hol and Al Roj, \"constitute inhuman and degrading treatment\". It said forcing British-linked people to live in such facilities instead of allowing them to return home was \"inconsistent\" with the UK's international human rights obligations. The exact number of British citizens, as well as individuals like Begum, who had her citizenship revoked because she joined Islamic State (IS), stranded in the camps is not clear. But estimates put the total figure at between 50 and 70, the majority of them women, and between 12 to 30 children, half of whom are under the age of 10. There is a particular obligation of the British state to protect children from harm. \"The government should facilitate the voluntary repatriation for British nationals, including those deprived of British nationality,\" the commission said. \"It should appoint a special envoy to oversee repatriation and inform returnees of the likelihood of prosecution.\" The report said that the UK was an \"outlier\" in its policy towards UK-linked citizens who joined Islamic State and are detained in camps. Termed \"strategic distance\", the British approach involved stripping people of their citizenship, limiting consular assistance and helping to fund the Kurdish guards who man the detention camps to ensure they remain stranded. By contrast, the US, Canada and several European states have brought their citizens who joined Islamic State home. \"Pressure from the US government, which has called for all states to take back their nationals, the change in the Syrian regime, and as other states repatriate, the prospect of what was referred to as 'Europe's Guantanamo' becoming 'Britain's Guantanamo', may force the government to begin returns,\" the commission said. The report cited research that found the balance of risk favoured repatriating British-linked people rather than leaving them stranded in Syria and open to potential further radicalisation. \"As escapes from camps are likely to lead to some returns to the UK, an organised programme of return, rehabilitation and integration is the best long-term option for managing risk,\" the commission said. It listed tools that could be used to manage returns and limit the risk to public safety, including preventing returnees from travelling, putting them under investigation and enrolling them in deradicalisation programmes. Shamima Begum, now 26, is the most high-profile detainee in the Al Roj refugee camp. She lost an appeal against the removal of her British citizenship last year. Begum travelled to Syria in 2015, aged 15, with two schoolfriends. She married an Islamic State fighter soon after her arrival. They had three children, but none survived. She has been stranded in the camp since 2019. Read more:Ex-IS brides and their children desperate to go homeBritish girl returns to UK from IS detention camp in Syria As well as recommendations on what to do about British-linked citizens detained in Syria, the report focused on how to improve counterterrorism measures in the UK. Most significantly, it found that the UK's Prevent counter-terrorism strategy \"is no longer keeping the country safe\" and needs a \"radical overhaul\"."
    },
    {
        "title": "New law could help tackle AI-generated child abuse at source, says watchdog",
        "description": "Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law.",
        "url": "https://news.sky.com/story/new-law-could-help-tackle-ai-generated-child-abuse-at-source-says-watchdog-13468757",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ai-csam-iwf_7079537.jpg?20251111192512",
        "type": "Home",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-11 19:22:00",
        "Headline": "The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images.",
        "Content": "\n          Science and technology reporter\n       Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law. Organisations like the Internet Watch Foundation (IWF), as well as AI developers themselves, will be able to test the ability of AI models to create such content without breaking the law. That would mean they could tackle the problem at the source, rather than having to wait for illegal content to appear before they deal with it, according to Kerry Smith, chief executive of the IWF. The IWF deals with child abuse images online, removing hundreds of thousands every year. Ms Smith called the proposed law a \"vital step to make sure AI products are safe before they are released\". How would the law work? The changes are due to be tabled today as an amendment to the Crime and Policing Bill. The government said designated bodies could include AI developers and child protection organisations, and it will bring in a group of experts to ensure testing is carried out \"safely and securely\". The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images. \"These new laws will ensure AI systems can be made safe at the source, preventing vulnerabilities that could put children at risk,\" said Technology Secretary Liz Kendall. \"By empowering trusted organisations to scrutinise their AI models, we are ensuring child safety is designed into AI systems, not bolted on as an afterthought.\"  AI abuse material on the rise The announcement came as new data was published by the IWF showing reports of AI-generated child sexual abuse material have more than doubled in the past year. According to the data, the severity of material has intensified over that time. The most serious category A content - images involving penetrative sexual activity, sexual activity with an animal, or sadism - has risen from 2,621 to 3,086 items, accounting for 56% of all illegal material, compared with 41% last year. Read more from Sky News:Protesters storm COP30UK stops some intel sharing with US The data showed girls have been most commonly targeted, accounting for 94% of illegal AI images in 2025. The NSPCC called for the new laws to go further and make this kind of testing compulsory for AI companies. \"It's encouraging to see new legislation that pushes the AI industry to take greater responsibility for scrutinising their models and preventing the creation of child sexual abuse material on their platforms,\" said Rani Govender, policy manager for child safety online at the charity. \"But to make a real difference for children, this cannot be optional. \"Government must ensure that there is a mandatory duty for AI developers to use this provision so that safeguarding against child sexual abuse is an essential part of product design.\""
    },
    {
        "title": "Police want to identify two people after woman racially abused and assaulted at Bond Street station",
        "description": "Police have released a photo after a woman was racially abused and assaulted while with her family in central London last month.",
        "url": "https://news.sky.com/story/police-want-to-identify-two-people-after-woman-racially-abused-and-assaulted-at-bond-street-station-13468393",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bond-street-racial-abuse_7078798.png?20251111072334",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 08:13:00",
        "Headline": "The man allegedly sprayed a substance he said was pepper spray - but the victims reported no ill effects.",
        "Content": "Police have released a photo after a woman was racially abused and assaulted while with her family in central London last month. The victim was entering Bond Street Tube station with her sister and two young children, one of whom was in a pushchair. British Transport Police (BTP) said the man and woman pictured in the image were walking in front of the family when the woman \"collided with the pushchair\". The man then allegedly shouted racial abuse at the victim and her family and the woman grabbed her hair. When she tried to defend herself, BTP said the man pulled out a small bottle he claimed was pepper spray and sprayed it in the direction of the victim and her family. \"The woman shouted abuse and made lewd gestures at them before both parties left the area,\" the force added. Police said the incident happened around 7.30pm on Saturday 11 October. Read more from Sky News:Pressure grows to release 15 penguins at London aquariumLearner driver has failed their theory test 128 times They are still trying to identify what substance was sprayed, but the victims of the incident reported no ill effects. Anyone who recognises the people in the photo is asked to contact the BTP."
    },
    {
        "title": "Bin lorry crashes into building, leaving one dead and two injured",
        "description": "A man has died and two others have been left seriously injured after a bin lorry crashed into a building in Herefordshire.",
        "url": "https://news.sky.com/story/bin-lorry-crashes-into-building-leaving-one-dead-and-two-injured-13468691",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-emma-louise-bin-crash_7079335.jpg?20251111154416",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 16:47:00",
        "Headline": "Residents have been urged to avoid the area after emergency services responded to incident in Herefordshire.",
        "Content": "A man has died and two others have been left seriously injured after a bin lorry crashed into a building in Herefordshire. The man, in his 60s, was a passenger in the vehicle, which also carried the driver and another passenger. The driver and the second passenger were seriously injured and airlifted to hospital. The incident occurred at around 6.40am in Leominster, according to West Mercia Police. Superintendent Helen Wain said: “A cordon remains in place while the fire service and local authorities continue to work to make the building safe. \"Roads surrounding the building are closed and are expected to remain closed for some time. “On behalf of all agencies, our thoughts and condolences are with those involved and the families affected by the incident.\" The building, initially thought to have been a house, was empty at the time and no one else was injured. The West Midlands Ambulance Service said it received multiple 999 calls at around 6.45am reporting that a refuse lorry had collided with a property. Read more from Sky News:91 prisoners freed in error over past seven monthsEpping hotel to house asylum seekers after legal challenge fails When ambulance staff arrived, they found a “significant” road traffic collision. Three passengers were trapped in the bin lorry. “Due to structural damage to the building, all three emergency service teams worked rapidly together to safely extricate the patients,” a spokesperson said. “Sadly, one male passenger was confirmed deceased at the scene.” The driver and the remaining passenger were airlifted to Queen Elizabeth Hospital Birmingham for further emergency care. Herefordshire Council thanked the emergency services for their “swift response,” adding: “We are working with our partners to assess the situation. Further updates will be issued when more facts are known.”"
    },
    {
        "title": "Universal credit claimants soar by over a million in a year, new figures show",
        "description": "The number of universal credit (UC) claimants has soared to 8.3 million people - up from 7.2 million at the same time last year, new government figures show.",
        "url": "https://news.sky.com/story/universal-credit-claimants-soar-by-over-a-million-in-a-year-new-figures-show-13468726",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jobcentre-benefits_7079487.jpg?20251111181141",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-11 18:00:00",
        "Headline": "Nearly half of all universal credit claimants are not required to work, the latest statistics show.",
        "Content": "The number of universal credit (UC) claimants has soared to 8.3 million people - up from 7.2 million at the same time last year, new government figures show. That is a 1.1 million increase in the space of a year, and is the largest annual rise in total claimants since early in the COVID pandemic - the 12 months to April 2021. UC is a payment to help with living costs and is available for people in work who are on low incomes, as well as those who are out of work or cannot work. Tap here for the latest news from Westminster There has also been a sharp rise in the number of people claiming UC who have \"no work requirements\". Four million people were in this category in October, up from 2.9 million people a year ago, statistics from the Department for Work and Pensions show. Claimants in the \"no work requirements\" bracket are people in full-time education, over the state pension age, with a child aged under one, and who are considered to have no prospect of work - they make up 48.7% of all claimants. \n                  Sickness bill costs £85bn year, says new report, which warns of 'economic crisis'\n                 \n                  214,000 parents missing out on child benefit and potentially thousands\n                 \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 Other claimants must do certain work-related activities to receive the UC benefit, such as attending interviews to plan for their return to work or be actively searching for work. The number of people in the searching for work category stood at 1.6 million in October, and the number of working people on UC stood at 2.2 million last month - both unchanged year-on-year. The government has previously said it \"inherited a broken welfare system and spiralling, unsustainable benefits bill\" from the Conservatives, and is working on reforms including tightening rules on who can claim UC. The new data on the huge increase in UC claimants comes on the day it was announced that the unemployment rate has risen to 5% in the three months to September - the highest rate since the pandemic in 2020.  Following a commitment to publish a breakdown of UC claimants by immigration status, which was first done in July, the DWP has published updated figures showing that the majority were British and Irish nationals and those who live or work in the UK without any immigration restrictions. They accounted for 84.3% of all UC claimants in October, up from 82.9% in October 2024 - and of these, 99.9% were UK citizens and around a third (32%) were in employment. 9.2% of claimants have EU Settled Status in the UK, which is down from 10.4% a year ago. And 2.6% were people who had indefinite leave to remain in the UK, up from 2.2% the previous year. Refugees accounted for 1.5% of UC claimants, which is unchanged from the same point last year. A DWP spokesperson said: \"The number of people receiving universal credit has been increasing as we have invited tens of thousands of people each month to move from legacy benefits as they become phased out. \"We're determined to get more people off welfare and into work. That's why we are stepping up our plan to Get Britain Working with the most ambitious employment reforms in a generation. This includes modernising jobcentres and providing tailored support through the Connect to Work programme. \"Every eligible young person who has been on universal credit for 18 months without earning or learning will also be offered guaranteed paid work through our Youth Guarantee.\""
    },
    {
        "title": "Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash",
        "description": "Sir Keir Starmer is vowing to fight any challenge to his leadership rather than stand aside, amid claims of plotting by MPs being compared to TV's The Traitors.",
        "url": "https://news.sky.com/story/starmer-vows-to-fight-any-plot-to-oust-him-as-labour-mps-fear-budget-backlash-13468869",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-prime_7079697.jpg?20251111230605",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-11-11 22:52:00",
        "Headline": "Whispers in Westminster hint at a plot brewing behind-closed-doors to oust the prime minister. A tale of loyalty, deception, and banishments? Sounds somewhat familiar…",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Sir Keir Starmer is vowing to fight any challenge to his leadership rather than stand aside, amid claims of plotting by MPs being compared to TV's The Traitors. Number 10 is going on the attack ahead of a difficult budget this month, with fears it could prove so unpopular that Labour MPs may move against Sir Keir. But Sky News political editor Beth Rigby reports the prime minister \"has no intention of giving way\", with allies warning any challenge would lead to a \"drawn-out leadership election, spook the markets, and create more chaos that further damages the Labour brand\". One senior figure told Rigby any move against Sir Keir would be more likely to arrive after next May's elections, rather than the budget. They said many Labour MPs could probably get behind measures like tax rises for wealthier workers, pensioners and landlords, as well as scrapping the two-child benefit cap, if that's what the chancellor announces on 26 November. But there are a series of potentially damaging elections in May, including in London and for the Senedd in Wales, as Labour face a challenge from Reform UK on the right and parties like the Greens and Plaid Cymru on the left. Rigby said there is a \"settled view among some very senior figures in the party that Starmer lacks the charisma and communication skills to take on Nigel Farage and win over the public, particularly if or when he breaks a bunch of manifesto pledges\". Sir Keir and Rachel Reeves have refused to rule out breaking their manifesto promises not to raise income tax, national insurance, or VAT at the budget. The Number 10 operation to ward off a challenge comes after Sky News deputy political editor Sam Coates likened the febrile mood in the Labour high command to the TV hit The Traitors. Speaking on the Politics At Sam And Anne's podcast, he said: \"A minister got in touch at the start of the weekend to say they believe that there's some quite substantial plotting going on. \"They say there was at least one cabinet minister telling colleagues that Keir Starmer, and I quote, is finished.\" Chief political correspondent When Boris Johnson was facing mutiny from Conservative MPs, his allies launched \"Operation Save Big Dog\".\n When Margaret Thatcher was about to be ousted by her rebellious MPs in 1990, she declared: \"I fight on, I fight to win.\"\n And Harold Wilson, constantly paranoid about plots, famously quipped in 1969: \"I know what's going on. I'm going on.\" Boris Johnson was ousted less than six months after \"Operation Save Big Dog\", Margaret Thatcher resigned the following morning after saying \"I fight on\", and Harold Wilson lost a general election to Edward Heath a year after vowing that he would go on. Just saying. Read more:What tax rises will Reeves announce? Coates said the cabinet minister \"absolutely and totally denies they are up to anything nefarious whatsoever\". \"I actually do think that this is all in the style of The Traitors, because I'm not sure that there is hard and fast evidence of plotting - there might be some hints from some quarters,\" he added. \"But what seems to be completely logical is that if you're a bit worried in Number 10, you're trying to pitch roll and ward off people who are maybe thinking about the need to position themselves by starting to get out rumours of plots and hoping that the political system turns against them for disloyalty.\" Cloak-and-dagger Reports emerged on Tuesday night in The Times, The Guardian, and from the BBC of a \"bunker mode\" in Number 10, \"regime change\", and \"plotting\" to replace Sir Keir. Responding to the reports, Health Secretary Wes Streeting denied he was seeking to oust the prime minister. A spokesperson for Mr Streeting told Sky News: \"These claims are categorically untrue. \"Wes's focus has entirely been on cutting waiting lists for the first time in 15 years, recruiting 2,500 more GPs and rebuilding the NHS that saved his life.\" However, there is clearly a co-coordinated campaign by allies of the increasingly unpopular Sir Keir to try to prevent a leadership challenge by a cabinet minister or stalking horse. Sir Keir's biographer Tom Baldwin questioned the logic of those briefing from within the corridors of power. \"I'm at a loss to understand why anyone would think this sort of briefing will help Keir Starmer, the government, or even their own cause,\" he said on social media. \"Some people just can't resist, I guess, but it's all a bit nuts.\" What next? It comes ahead of Prime Minister's Questions this lunchtime, handing Tory leader Kemi Badenoch the chance to make it an awkward afternoon for Sir Keir. The health secretary will start his day on Sky News' Morning With Ridge And Frost and will then speak at an NHS providers' conference. Watch and follow live coverage across Sky News - including in the Politics Hub."
    },
    {
        "title": "Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster",
        "description": "Culture Secretary Lisa Nandy has defended the BBC as a crisis initiated by an edit of a Donald Trump speech engulfs the corporation.",
        "url": "https://news.sky.com/story/culture-secretary-defends-bbc-after-leak-reveals-staffs-anger-at-tory-linked-board-member-13468765",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bbc-broadcasting-house_7079672.jpg?20251111223320",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-11 19:13:00",
        "Headline": "Lisa Nandy has defended the BBC, saying \"some in the House\" have suggested the corporation is institutionally biased, but that she disagrees as it is a \"light on the hill for people here and across the world\".",
        "Content": "Culture Secretary Lisa Nandy has defended the BBC as a crisis initiated by an edit of a Donald Trump speech engulfs the corporation. The organisation apologised on Monday after two of its top figures, including director-general Tim Davie, resigned amid concerns about impartiality - notably the editing of a Panorama documentary from October 2024. It aired the week before the US presidential election and showed an edited speech made by Mr Trump before the 2021 Capitol riot, in which he appeared to tell supporters he was going to walk there with them to \"fight like hell\". Ms Nandy has defended the BBC, saying \"some in the House\" have suggested the BBC is institutionally biased, but that she disagrees as the BBC is a \"light on the hill for people here and across the world\". \"All of us in this House should value it, uphold it and fiercely defend it,\" she added. The culture secretary said that she has been in \"regular contact\" with BBC chair Samir Shah, ensuring that where its standards were not met, \"firm, swift and transparent action follows\". \"I welcome the steps that have already been set out and I will keep the House updated as the BBC leadership grips these issues,\" she added, saying she agreed with Mr Shah that the national broadcaster has a responsibility to \"uphold the highest standards\". \n                  BBC staff seemed fed up of Tim Davie's 'nothing to see' approach\n                 \n                  Who is Sir Robbie Gibb and why are there calls to get him off BBC board?\n                 \n                  Donald Trump and his long history of lawsuits against the media\n                 Ms Nandy said a review of the BBC's Royal Charter will begin \"imminently\" and a public consultation will be launched, with more details in the \"coming weeks\". Meanwhile, Mr Trump threatened to sue the BBC for $1bn, and a letter dated 9 November from Florida lawyer Alejandro Brito outlines three demands upon the organisation to avoid being sued, with a deadline of 10pm UK time on Friday to respond. He demanded that the BBC issue a \"full and fair retraction\" of the documentary, apologise immediately, and \"appropriately compensate\" Mr Trump.  Shadow culture secretary Nigel Huddleston has demanded an apology from the BBC to Trump and to the British public. He told the House of Commons on Tuesday that the corporation is \"in a sorry mess... of its own making\" and \"needs saving from itself\". Mr Huddleston stressed that his party wants the BBC to succeed and praises its successes, but emphasised that this \"requires institutional change and far more than a few moves at the top\". The problems of the corporation relate to its failure to honour its charter obligation to impartiality, he said. In an all-staff call on Tuesday morning, the outgoing BBC director-general Mr Davie said the corporation had \"made some mistakes that have cost us\" but added he was \"proud\" and that the organisation needed to \"fight\" for its journalism. He also admitted: \"I think we did make a mistake, and there was an editorial breach, and I think some responsibility had to be taken.\"  Mr Davie, who has worked for the BBC for 20 years and been in charge for the past five, is not stepping down immediately. He said in his departure note to staff that he is \"working through exact timings with the board to allow for an orderly transition to a successor over the coming months\". There are several potential candidates who could replace him and take on the highest-profile role in British broadcasting, which effectively serves as both the corporation's chief executive and its editor-in-chief across television, radio and online. In a Q&A with Mr Davie after the all-staff call, staff were frustrated by having their questions vetted, Sky News arts and entertainment correspondent Katie Spencer reports. Some of the questions were about the controversial appointment of Sir Robbie Gibb, the former Tory director of communications for prime minister Theresa May, to the BBC board. But when these questions were getting through the vetting process, staff tried to ask questions in the reply boxes, which were public. The anonymous comments included questions like \"How can we claim to be unbiased if Gibb is on the board?\" and \"Why is Robbie Gibb still on the board?\". Read more:The man behind the leaked BBC memoTrump's legal threat letter in fullWho is Sir Robbie Gibb and why are there calls to get him off BBC board? \"I find Robbie Gibb's continued presence at the BBC to be incredibly demoralising. It feels as if he is fighting against and undermining the work we're trying to do,\" another comment read. The leaders of the Lib Dems and SNP have both called for Sir Robbie's removal. But Ms Nandy told the Commons that the government is \"unable\" to remove Sir Robbie, as \"the charter sets a strict legal threshold that must be met before dismissal of a board member\"."
    },
    {
        "title": "New law could help tackle AI-generated child abuse at source, says watchdog",
        "description": "Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law.",
        "url": "https://news.sky.com/story/new-law-could-help-tackle-ai-generated-child-abuse-at-source-says-watchdog-13468757",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ai-csam-iwf_7079537.jpg?20251111192512",
        "type": "UK",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-11 19:22:00",
        "Headline": "The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images.",
        "Content": "\n          Science and technology reporter\n       Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law. Organisations like the Internet Watch Foundation (IWF), as well as AI developers themselves, will be able to test the ability of AI models to create such content without breaking the law. That would mean they could tackle the problem at the source, rather than having to wait for illegal content to appear before they deal with it, according to Kerry Smith, chief executive of the IWF. The IWF deals with child abuse images online, removing hundreds of thousands every year. Ms Smith called the proposed law a \"vital step to make sure AI products are safe before they are released\". How would the law work? The changes are due to be tabled today as an amendment to the Crime and Policing Bill. The government said designated bodies could include AI developers and child protection organisations, and it will bring in a group of experts to ensure testing is carried out \"safely and securely\". The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images. \"These new laws will ensure AI systems can be made safe at the source, preventing vulnerabilities that could put children at risk,\" said Technology Secretary Liz Kendall. \"By empowering trusted organisations to scrutinise their AI models, we are ensuring child safety is designed into AI systems, not bolted on as an afterthought.\"  AI abuse material on the rise The announcement came as new data was published by the IWF showing reports of AI-generated child sexual abuse material have more than doubled in the past year. According to the data, the severity of material has intensified over that time. The most serious category A content - images involving penetrative sexual activity, sexual activity with an animal, or sadism - has risen from 2,621 to 3,086 items, accounting for 56% of all illegal material, compared with 41% last year. Read more from Sky News:Protesters storm COP30UK stops some intel sharing with US The data showed girls have been most commonly targeted, accounting for 94% of illegal AI images in 2025. The NSPCC called for the new laws to go further and make this kind of testing compulsory for AI companies. \"It's encouraging to see new legislation that pushes the AI industry to take greater responsibility for scrutinising their models and preventing the creation of child sexual abuse material on their platforms,\" said Rani Govender, policy manager for child safety online at the charity. \"But to make a real difference for children, this cannot be optional. \"Government must ensure that there is a mandatory duty for AI developers to use this provision so that safeguarding against child sexual abuse is an essential part of product design.\""
    },
    {
        "title": "Snapchat groomer jailed for sexually assaulting and raping young girls",
        "description": "A senior NHS manager, described by a judge as \"devious, scheming and manipulative\", has been jailed for 28 years for raping and sexually assaulting girls he groomed on Snapchat.",
        "url": "https://news.sky.com/story/devious-scheming-and-manipulative-nhs-manager-jailed-for-28-years-after-grooming-girls-on-snapchat-13468709",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-paul-lipscombe-snapchat_7079499.jpg?20251111181810",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-11 17:27:00",
        "Headline": "Leicester Crown Court heard Paul Lipscombe, 51, created multiple Snapchat profiles to groom girls before assaulting them. He also sold AI-generated child abuse videos on a website.",
        "Content": " A senior NHS manager, described by a judge as \"devious, scheming and manipulative\", has been jailed for 28 years for raping and sexually assaulting girls he groomed on Snapchat. Paul Lipscombe, 51, from Rothley in Leicestershire, admitted 34 offences against six girls - aged between 12 and 15 - between September 2023 and April 2024 after targeting them via the social media app. Leicester Crown Court heard that police became aware of his offending after a 15-year-old girl, who was reported missing, told officers that she had been raped. Prosecutor Frida Hussain KC told Judge Keith Raynor on Monday that Lipscombe was initially arrested on suspicion of kidnapping the missing girl when officers pulled over his car in Birstall, near Leicester, in April 2024. Ms Hussain told the court the girl went missing from her home late at night and was picked up by Lipscombe nearby, before he took her to a hotel. Police later found the child at a rented address. \"He accused other people of serious crimes simply in order to mask his own crimes,\" Ms Hussain added. Follow-up searches at the hotel, his car and home uncovered evidence that the youngster had been sexually assaulted. Police recovered items including soft toys, restraints, vodka, his phone and another mobile which had been wiped. \n                  Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash\n                 \n                  Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 Devious, scheming and manipulative Passing sentence on Tuesday, Judge Raynor told Lipscombe he was \"intelligent, confident, resourceful and well-organised\" and the victims had been \"truly vulnerable\". \"The evidence shows you to have been devious, scheming and manipulative. You were bold in your offending and you took very high risks. The sexual abuse of young girls was an obsession in life for you,\" he said. Leicester Crown Court heard that when Lipscombe initially contacted the girls, he told them he was in his late 20s or early 30s. Five of the six girls had met with him and been raped or sexually assaulted. A significant number of indecent images of children were discovered on his devices and online storage accounts. He had also set up a website where people could buy illegal videos of child abuse created through AI technology. The court was told Lipscombe had been targeting girls using several Snapchat accounts, including two fake names, Dom Woodmore and George. In February, Paul Lipscombe pleaded guilty to 34 offences, including two counts of rape of a child under 13; 21 counts of sexual activity with a child; three counts of sexual assault of a child under 13; and causing or inciting a child to engage in sexual activity. He also admitted six counts of making indecent photographs of children and distributing indecent photographs of children. Lipscombe was sentenced on Tuesday to 28 years and one month, and to remain on licence for three years after his release. He has been placed on the sex offenders register for life. Read more from Sky News:Bin lorry crashes into buildingLammy: Three prisoners still at largeConwoman with £5bn Bitcoin jailed Could be other victims, say police Detective Constable Lauren Speight, from the Child Abuse Investigation Unit (CAIU), said: \"Our investigation into the offending carried out by this man is continuing. \"We suspect he may have been in contact with other girls and could well have committed sexual offences against others. We would urge anyone who has been in contact with him to contact us.\" The married NHS executive worked with the University Hospitals Coventry and Warwickshire NHS Trust as a performance and informatics specialist. In a statement, the trust said Lipscombe was initially suspended when he was arrested, then later dismissed in June 2024. It added there was \"nothing has been identified at this stage to indicate this individual's criminal activity was committed as part of their role\"."
    },
    {
        "title": "91 prisoners freed in error over past seven months",
        "description": "A total of 91 prisoners were freed by mistake between the start of April and the end of October, the latest Ministry of Justice (MoJ) figures show.",
        "url": "https://news.sky.com/story/91-prisoners-freed-in-error-in-past-seven-months-13468609",
        "image_url": "https://e3.365dm.com/22/10/1920x1080/skynews-prison-wakefield_5929131.jpg?20221013033041",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-11 14:10:00",
        "Headline": "Justice Secretary David Lammy has been under pressure following a series of high-profile prisoners being accidentally freed. They include Algerian sex offender Brahim Kaddour-Cherif, whose recapture was partly down to Sky News.",
        "Content": " A total of 91 prisoners were freed by mistake between the start of April and the end of October, the latest Ministry of Justice (MoJ) figures show. The figures come as ministers face mounting pressure over a series of high-profile manhunts, with Justice Secretary David Lammy issuing an \"unequivocal apology\" and telling the Commons on Tuesday that the \"release process requires a radical overhaul\". He also confirmed there are three prisoners, mistakenly freed from custody, who remain at large and prison chiefs are investigating \"a further potential release in error on 3 November\" who may still be at large. Follow latest updates Of the three confirmed cases, two were released in August and December last year and a third in June this year. One is a foreign national. Algerian sex offender Brahim Kaddour-Cherif, 24, was arrested on Friday after a police search following his release from HMP Wandsworth in south London last week, which Scotland Yard said officers only found out about on Tuesday. His recapture was partly down to investigative work by Sky's national correspondent, Tom Parmenter, who tracked Kaddour-Cherif down to Finsbury Park in north London before he handed himself in to police.  Convicted fraudster Billy Smith, 35, handed himself back in on Thursday after being accidentally freed from the same jail on Monday. Hadush Kebatu, the small-boat sex offender, was arrested last month on the third day of a manhunt after he was mistakenly freed from prison. The now-deported Ethiopian migrants sexual assaults on a girl and a woman were at the heart of protests in Epping and had been serving a 12-month sentence at HMP Chelmsford since September.  On Friday, stronger security checks were announced for prisons and an independent investigation was launched into releases in error following the blunder in Kebatu's case. The number of these types of prison release errors has risen recently, with 262 instances between March 2024 and March 2025 - a 128% increase on 115 in the previous 12 months. Of the 262 cases, 87 involved prisoners whose main offence was violence against the person, and three whose main offence was a sexual offence. Revealing the latest figures to the Commons, Mr Lammy admitted \"prisons throughout the country are underfunded, they're understaffed, and they're operating under relentless strain\" but that releases were \"a complex issue\".  The justice secretary added: \"I'm clear that we have a mountain to climb in response\". He announced a \"new justice performance board\" which will review processes within prisons and criminal courts. Prison release errors can include misplaced warrants for imprisonment or remand, sentence miscalculations or can be as a result of mistakes by courts or other authorities, the Ministry of Justice said. Read more from Sky News:Prison 'system close to breaking point'Mistaken prison releases not uncommon Mr Lammy also suggested that mistakes within the prison system were down to cuts under the previous Conservative governments. He said frontline prison officers were cut by a quarter between 2010 and 2017, adding that \"mistakes happen in those circumstances\". But shadow justice secretary Robert Jenrick was scathing, describing Mr Lammy as presiding over \"a complete and utter farce\", adding that he is \"so clueless, he's literally lost track of how many prisoners he's lost\". \"The public are being endangered as this circus rumbles on week after week, with no end in sight. When will he put a stop to it?\" he asked."
    },
    {
        "title": "Footballer Raheem Sterling suffers another break-in, while at home with family",
        "description": "Burglars have again broken into the home of former England footballer Raheem Sterling.",
        "url": "https://news.sky.com/story/footballer-raheem-sterling-suffers-another-break-in-while-at-home-with-family-13468661",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-raheem-sterling-arsenal_7079361.jpg?20251111163825",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-11 16:02:00",
        "Headline": "The 30-year-old Chelsea star's luxury Berkshire home was targeted by intruders, who broke in at around 6.30pm on Saturday.",
        "Content": "Burglars have again broken into the home of former England footballer Raheem Sterling. The 30-year-old Chelsea star was at home with his family when intruders got into the Berkshire property at around 6.30pm on Saturday. But they were disturbed and fled before they could take anything. It is the third time in just seven years that Sterling's home has been targeted, after incidents at properties in Surrey and Cheshire. \"Whilst the ultimate violation of privacy and safety, we are thankful to be able to confirm that he and his loved ones are all safe,\" his representative said. \"We ask that the privacy of Raheem and his loved ones be respected at this challenging time.\" Sterling's previous home in Surrey was also targeted by burglars in 2022, who stole jewellery and watches said to be worth £300,000. \n                  Transfer Deadline Day: Raheem Sterling completes Arsenal switch as England forwards make moves\n                 \n                  Three men wanted over burglary at Raheem Sterling's home\n                 \n                  Raheem Sterling: Trial date set for man accused of burglary at England footballer's home\n                 The break-in happened in Oxshott, Leatherhead, and was reported to police on 3 December 2022. Sterling, who was said to be \"shaken\" and \"concerned for the wellbeing of his children\", returned home from the World Cup in Qatar after the burglary. Read more from Sky News:Epping hotel can still house asylym seekers91 prisoners freed in error over past seven months The family were not at the property at the time of that incident. Sterling's previous home in Goostrey, Cheshire, was also targeted by thieves in 2018, but they fled when the alarm system was activated."
    },
    {
        "title": "Axel Tuanzebe: Details of former Manchester United player's £1m lawsuit against club obtained by Sky News",
        "description": "Manchester United have been accused of harming the career of a former player by failing to treat an injury \"promptly\" and \"appropriately\", leaving him with more serious long-term problems, according to a &#163;1m lawsuit obtained by Sky News.",
        "url": "https://news.sky.com/story/axel-tuanzebe-details-of-former-manchester-united-players-1631m-lawsuit-against-club-obtained-by-sky-news-13468703",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-axel-tuanzebe-manchester-united_7079418.jpg?20251111170334",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-11-11 17:05:00",
        "Headline": "Sky News has obtained legal documents lodged at London's High Court which allege that the Burnley defender can no longer play \"without restriction or impediment\" over United's handling of a spinal injury.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n Manchester United have been accused of harming the career of a former player by failing to treat an injury \"promptly\" and \"appropriately\", leaving him with more serious long-term problems, according to a £1m lawsuit obtained by Sky News. While defender Axel Tuanzebe is still in the Premier League at Burnley, he blames United for no longer being able to play \"without restriction or impediment\" - impacting his career and earnings. The landmark case has been brought by the footballer claiming clinical negligence - shining an unprecedented spotlight on the inner workings of a leading club's medical care and alleged handling of an injury. The lawsuit lodged at the High Court in London shows the 27-year-old Congolese player \"expects to recover damages in excess of £1,000,000\". An academy graduate at United, he left the club in 2023 after 17 years. United declined to comment. The case centres on stress fractures at the back of the spine, which the British Association of Spine Surgeons says footballers are vulnerable to. It's alleged Tuanzebe sustained a left-sided pars fracture in January 2020, which became chronic by July 2022 when he also developed a right-sided pars fracture. The lawsuit says: \"Appropriate treatment plans would, on the balance of probabilities, have resulted in the claimant avoiding the pain and discomfort set out below and would have resulted in him being able to play professional football at elite level without restriction or impediment. \"As it is, although he continues to play at an elite level, this has impacted his career and earnings.\" The details of the injury have never previously been reported. Injury origins The case centres on how MRI scans in early 2020 were interpreted following a hamstring injury suffered in a League Cup match in December 2019 against Colchester. A suspected pars fracture was detected - referencing spinal stress fractures in the lower back, which athletes can suffer from repeated movements. The lawsuit says: \"It is the claimant's case that the defendant [United] negligently failed to properly investigate the claimant's pars fractures, failed to rest the claimant and failed to refer him to a specialist sports spinal surgeon. \"As a result, the claimant's symptoms significantly progressed to bilateral grade 4 fractures, and he developed a left-sided chronic spinal fracture. \"Had the claimant been appropriately rested, his left-sided pars fracture would not have developed into a chronic condition and the right-sided fracture would have been avoided altogether.\" The fractures, which developed by July 2022, caused Tuanzebe \"significant pain and discomfort since their development and deterioration.\" Return to playing The lawsuit claims that in January 2020, United \"failed to refer him to a specialist sports spinal surgeon\" who would have apparently advised at least 12 weeks of rest to allow the fracture to heal. But Tuanzebe was back playing by March 2020 for United in the Premier League 2 development competition and returned to first-team action in October in the Champions League against French side Paris Saint-Germain. Then United-manager Ole Gunnar Solskjaer hailed \"a tremendous defender, a great leader\", adding: \"He's going to be a top player for us and he's got the character and the attitude that a Man United player should have.\" New pain In December 2020, Tuanzebe told United he was suffering hamstring pain after sprinting. Despite concerns at the start of the year, the lower spine \"was not imaged on this occasion\", the lawsuit says. The lawsuit says: \"By allowing the claimant to train and play as normal from February to March 2020 and thereafter, he suffered more serious symptoms than he would have if he had been diagnosed promptly and treated appropriately with rest.\" It claims an \"appropriate treatment plan\" was only put in place three years later - in April 2023. The lawsuit says: \"Appropriate treatment plans would, on the balance of probabilities, have resulted in the claimant avoiding the pain and discomfort set out below and would have resulted in him being able to play professional football at elite level without restriction or impediment. \"As it is, although he continues to play at an elite level, this has impacted his career and earnings.\" On loan in Italy It was while on loan at Napoli in January 2022 that left-sided lower back pain led to the Italian club sending Tuanzebe for scans. United were informed by Tuanzebe of difficulties getting out of bed and into his car. But Dr Steve McNally, United senior club doctor and head of sports medicine and science, who left the club after 16 years in December 2022 to take a role with the PGMOL, is alleged to have \"indicated no urgency\" for him to return home for an examination. Dr McNally is alleged to have told Tuanzebe it was \"most likely\" he had \"disc irritation or change in posture mechanics rather than a stress problem\" and that it \"usually resolves with physio\" rather than being serious. The lawsuit highlights the period from January 2020 to January 2022 - claiming United \"failed to properly assess, record or attempt to treat the claimant's fracture in the acute phase\" when further regular medical examinations were required and appropriate rest from training and playing was needed. Examinations continued into the following month, February 2022. Read more from Sky News:'Goddess of Wealth' conwoman jailed over £5bn Bitcoin hoardPrincess of Wales lays Armistice Day wreath The lawsuit says while a stress fracture was excluded by Dr McNally following a CT scan, there could be an \"inflamed facet joint between the vertebrae\". But Napoli's club doctor said an analysis of a CT scan showed a potential stress fracture, described as \"chronic incomplete lysis of the isthmus of L5 with intact superior cortical profile\". Dr McNally is alleged to have responded by saying that it was already visible on a CT scan from 2017, so \"don't think that would cause your current pain\". Based on a referral by United, Tuanzebe was recommended pain relief injections in March 2022. Despite reporting pain in June 2022, Tuanzebe went on United's pre-season tour to Thailand the following month, but then asked to return to England for treatment. After further MRI and CT scans, a stress fracture of the spine was reported in medical reports in August 2022. He was able to return to full training by January 2023 and joined Stoke on loan until the end of the season, but ongoing discomfort limited him to five appearances. United then released Tuanzebe rather than triggering a one-year contract extension. The lawsuit says: \"By allowing the claimant to return to training and playing, including an intense strength and conditioning and running programme following 17 August 2022, this has caused him to suffer more serious symptoms than he would have if he had been diagnosed promptly and treated appropriately with rest.\" The \"particulars of claim\", which sets out the basis for the case, was filed after being signed by Tuanzebe on 27 October."
    },
    {
        "title": "Lib Dems aim to battle for hearts beyond Middle England heartland",
        "description": "Remember the Lib Dems? They won a record 72 seats at the general election but some party figures worry they have faded into obscurity since then.",
        "url": "https://news.sky.com/story/lib-dems-aim-to-battle-for-hearts-beyond-middle-england-heartland-13468772",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-davey-lib-dems-liberal-democrats_7079690.jpg?20251111225038",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-11-11 19:37:00",
        "Headline": "Two candidates are vying to be the Liberal Democrats' next president. Both want to branch out beyond the party's southern base, but they have different plans for doing so. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Remember the Lib Dems? They won a record 72 seats at the general election but some party figures worry they have faded into obscurity since then. Josh Babarinde wants to change that. The MP for Eastbourne is vying to be their next president, a role that will give him a key say in implementing strategy if he wins. Politics Live: Government to reconsider whether to give compensation to Waspi women Central to his pitch to members is being a \"megaphone president\" who can challenge Nigel Farage on the airwaves and connect with more voters. \"The plan if I win is to make sure that the Liberal Democrats are the last line of defence against the populism that's sweeping our country,\" he told Sky News. \"Reform, they're dividing our communities and they are stirring all sorts of division. The two main parties are all too often fuelling rather than fighting that and it's for the Liberal Democrat to stand against that.\" If that sounds familiar, then cast your mind back to a recent party election - Labour's deputy leadership one. Lucy Powell, in a similar strategic role, said in her victory speech that her party needed to \"wrestle back\" the political megaphone from Farage. \n                  Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 \n                  The BBC's billion dollar question\n                 But if anyone is doing that at the moment it's the Green Party, which is surging in the polls and has doubled its membership in the two months since media-savvy Zack Polanski became leader.    Mr Babarinde insists he is fully behind the Lib Dems' leadership. However, it's clear he wants to do things differently in order to cut through.  He went bungee jumping with Sir Ed Davey during the election campaign and has no plans to do that \"for political purposes or any purpose again\". \"The stunts can be a really effective means of capturing attention. We've also got to make sure that our pitch captures attention, that our policies capture attention, that our means of engaging with people captures attention.\" Battle for the youth vote  For Mr Babarinde, that starts with engaging with 12- and 13-year-olds who, by the next general election, will be voting for the first time, after Sir Keir Starmer lowered the voting age. The former youth worker said these young people \"can't be left to the online right\" and he can use his national platform as an MP to connect with them. \"We definitely need to up our social media strategy. That means TikTok, that means Instagram, that means Snapchat, and making sure that we're conveying our messages in the places where they hang out. \"But we also need to do much better when it comes to political education. All parties need to be better getting into schools, for example.\" It's not just the youth vote he is after either. He said there is \"absolutely\" more that can be done to tackle fed up Labour voters and that \"nowhere should be off limits\". \"There is lots of opportunity to speak to former Labour voters and say, look, the Liberal Democrats have listened, we have solutions. \"It's really important that we reach out to people across the whole country, beyond the Conservative heartlands. It's really important to me to diversify our party.\" On that, his opponent Prue Bray agrees. The Wokingham councillor, who has been active within the party for 30 years, wants to change the perception of the Lib Dems as a party that is \"for middle class people\". For her that is not about making headlines, but being active in communities where they don't currently have a large voter base - particularly the north of England. She told Sky News: \"After Brexit we recruited a lot of people and as that has declined in people's minds they have stopped being members, so we need to attract more people. \"People feel let down by the Conservatives and we don't want them to turn to Reform so we need to be more visible in their communities.\" Canvassing is seen by many within the party as its number one strength. A recent BBC report found that while the Lib Dems membership had halved in the past five years, those that remained were more active than their counterparts in other parties. It's one of the reasons party insiders believe they did so well at smashing the Tories' blue wall, with a targeted ground campaign. But in the words of the outgoing president Dr Mark Pack, who has held the role for the past six years, \"how someone best fills the roles very much depends on the circumstances of the time\". For him, that was picking up the pieces after the Lib Dems' 2019 disaster, and for his successor it will be maintaining the momentum of the 2024 success in a new era of multi-party politics when grabbing attention matters and winning seats even more so. The two contenders have the same goals when it comes to that - but different plans for achieving it. It's up to the members to decide which one they prefer. Voting has now closed, and the result will be declared on Wednesday. "
    },
    {
        "title": "Rotherham child sex abuser handed new jail sentence for rape of teenage girl",
        "description": "A man who subjected a 13-year-old girl to a \"campaign of violent rape\" in Rotherham will serve three more years in jail after he was convicted of abusing another teenager.",
        "url": "https://news.sky.com/story/rotherham-child-sex-abuser-handed-new-jail-sentence-for-rape-of-teenage-girl-13468695",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sageer-hussain-rotherham_7079417.jpg?20251111170257",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-11 16:58:00",
        "Headline": "Sageer Hussain was already serving a 19-year sentence for the rape of a 13-year-old girl, but has now been sentenced again.",
        "Content": "A man who subjected a 13-year-old girl to a \"campaign of violent rape\" in Rotherham will serve three more years in jail after he was convicted of abusing another teenager. Sageer Hussain, 40, is already serving a 19-year prison sentence after being convicted in 2016 of raping the vulnerable 13-year-old girl in the Yorkshire town. Now he has been sentenced to another three years after being convicted at Sheffield Crown Court in July of further offences against a 14-year-old girl. Sentencing him, Judge Charles Thomas said: \"The sad fact of this case is that, despite her young age at the time, you were not the first man to have abused and exploited her in this area and around this time.\" Earlier this year, the jury heard how Hussain raped the girl, now in her 30s, sometime between July 2000 and July 2002. Having led her down an alleyway in Rotherham town centre, he refused to let her leave unless she had sex with him. He committed the crime with two other people present, one woman and one man, and the victim cried throughout the ordeal.Judge Thomas said that from the age of 13, the girl would spend time in the town centre with \"Asian men and other young girls\", and would be given alcohol. He said it was \"clearly not uncommon for sexual activity to take place between the girls and the Asian men who would congregate in that area\". Officers from the National Crime Agency (NCA) contacted the victim after identifying she may have been sexually abused as a child. She told the officers what Hussain had done and he was charged in February 2024, before being convicted again in July. Hussain was initially jailed in 2016 alongside seven other men, including his brothers Arshid, Basharat and Bannaras, who were sentenced to 35, 25, and 19 years in prison respectively. Referencing the brothers, Judge Charles said the defendant had \"no good role models\" and accepted that he was only a teenager himself at the time of the offence. Read more:Rotherham abuse victim: Police did not take me seriouslyGrooming gangs probes dropped due to 'human error' Nonetheless, he said: \"You had a choice and you knew what you were doing, and you knew it was wrong.\" The victim, he said, had suffered a \"devastating effect\" to \"every aspect of her life\" as a result of the abuse. She was present for the sentencing, and Judge Thomas thanked her for how she conducted herself during the court proceedings. Hussain's new sentence will overlap with his existing one, which is now nearing the end of its custodial element. His conviction was secured through Operation Stovewood, the NCA's investigation into child sexual exploitation in Rotherham between 1997 and 2013. So far the operation has identified more than 1,100 children involved in exploitation, with 49 convictions, and custodial sentences totalling more than 1,500 years. NCA senior investigating officer Alan Hastings said: \"The victim has shown enormous strength and fortitude in reporting what Sageer Hussain did to her. \"The woman bravely told officers about Hussain's horrific crime against her, and that significantly helped our investigation. \"Officers subsequently identified corroborating evidence that enabled us to secure justice for the woman. \"Hussain, who is already serving time for raping another girl, will now remain in prison for longer. \"Reporting child sexual abuse can feel daunting, but there are specially trained officers who are waiting to help victims and seek justice for them if they feel ready. \"I encourage victims to contact police, no matter how long ago sexual abuse occurred.\""
    },
    {
        "title": "'Goddess of Wealth' conwoman jailed over £5bn Bitcoin hoard after years on the run",
        "description": "A woman caught with &#163;5bn in Bitcoin in the UK's highest ever value money laundering investigation has been jailed for 11 years and eight months - after nearly five years on the run.",
        "url": "https://news.sky.com/story/goddess-of-wealth-conwoman-jailed-over-1635bn-bitcoin-hoard-after-years-on-the-run-13467958",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-yadi-zhang-zhimin-qian_7036400.jpg?20250930165556",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-11-11 14:54:00",
        "Headline": "Zhimin Qian, who was also known as Yadi Zhang, made her entourage of staff sign strict confidentiality agreements as she stayed in rented properties and Airbnbs to avoid detection.  ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  A woman caught with £5bn in Bitcoin in the UK's highest ever value money laundering investigation has been jailed for 11 years and eight months - after nearly five years on the run. Zhimin Qian, 47, sat up in bed looking stunned when police kicked open the bedroom door of an Airbnb in a York suburb on 22 April last year. She vanished and went on the run after officers seized more than 61,000 Bitcoin in the country's biggest cryptocurrency seizure in a raid of her rented £5m home next to Hampstead Heath. Qian - who fled China after carrying out a huge fraud and arrived in the UK in 2017 on a false St Kitts and Nevis passport in the name of Yadi Zhang - pleaded guilty to two money laundering offences at Southwark Crown Court. Qian wept in the dock as she was sentenced to 11 years and eight months imprisonment. Judge Sally-Ann Hales KC told her: \"You were the architect of this offending from its inception to its conclusion. \"The scale of your money laundering is unprecedented. Your motive was one of pure greed.\" \n                  £5bn Bitcoin fraud mastermind had device containing £67m in secret pocket\n                 \n                  Bitcoin's price is at record highs. Is it sustainable?\n                 \n                  £5bn fraud mastermind's 'butler' pleads guilty to money laundering after UK's biggest ever Bitcoin seizure\n                 Police said she styled herself the \"Goddess of Wealth\" and wore imperial robes as her sales teams offered 300% returns at conferences in luxury hotels in China promoting her \"Britain Nice Life Insurance\" scheme. In a slick video played to targets, the narrator says \"Britain is a nation of glories and dreams\" over footage of the Houses of Parliament, Oxford University, Windsor Castle, Buckingham Palace and the City of London. Qian was already wanted in China over two other scams when she orchestrated the gigantic investment fraud, conning more than 128,000 victims from every province out of 40bn Yuan (around £4.6bn) between 2014 and 2017. More than 80 people have been convicted in China over the scam, but Qian converted some of the proceeds into more than 70,000 Bitcoin and fled, crossing the border into Myanmar on a moped before arriving at Heathrow Airport in September 2017. She recruited Jian Wen, who left her job in a south London Chinese takeaway, and the women moved into a £17,000-a-month rented £5m house next to Hampstead Heath, posing as the bosses on an international jewellery business. They travelled extensively across Europe, buying jewellery and spending tens of thousands of pounds on designer clothes and shoes in Harrods, while Wen bought a £25,000 E-Class Mercedes and sent her son to the £6,000-a-term Heathside preparatory school. Qian made extensive notes about what the judge called her \"grandiose\" plans to increase her social standing. She wanted to meet a royal duke, hoped the Dalai Lama would anoint her as a reincarnated Goddess, and dreamed of ruling Liberland - an unrecognised micronation on the Croation side of the Danube - as Queen. But the women came to the attention of police when they tried to buy a £24m seven-bedroom Hampstead mansion with a swimming pool, using more than £800,000 converted from Bitcoin. Officers raided their home in October 2018 and seized £300,000 in cash and cheques, along with phones and laptops, and found a hand drawn \"treasure map\" leading from Harrods to a safety deposit box containing more devices. When investigators finally accessed the cryptocurrency wallets stored on them, they thought someone had put the decimal point in the wrong place. The 61,279 Bitcoin was then worth £1.4bn and has now soared to more than £5bn, making it the biggest ever cryptocurrency seizure in Britain and, until recently, the world. Read more: How Chinese takeaway worker led police to biggest ever Bitcoin seizure Police believed Qian had left the country, but shortly before Wen was found guilty of money laundering offences in March last year, Detective Constable Joe Ryan detected activity on a cryptocurrency exchange from a wallet linked to Qian, which hadn't been used since 2019. The exchange provided details of the account holder - Seng Hok Ling, a Malaysian national with a previous conviction for fraud in Hong Kong in 2015, who was living in Matlock, Derbyshire. Working on the theory he may be in contact with Qian, detectives stepped up the manhunt, which took them all over the UK, before they identified her at a detached house in a York suburb. When police kicked open the upstairs bedroom door, there was Qian, lying under a bright red duvet and struggling to put on her top as she stared wide eyed at officers from behind her thick glasses. Detective Constable Chris Woods told colleagues: \"It's her.\" A ledger and passwords found sewn inside a purpose-made concealed pocket in the jogging bottoms she was wearing, led investigators to Bitcoin and other cryptocurrency worth around £67m. Ling had helped her stay on the run, providing false documents and money laundering services, and renting Airbnb properties, including a house in Glasgow and a remote farmhouse near Loch Tay in the Scottish Highlands. The court heard he tried to get one passport in the name of dead Hong Kong actress Dianxia Shen. A rotating entourage of cooks, drivers and security guards were employed on lucrative contracts to look after Qian, who they assumed was a rich recluse. They were made to sign strict confidentiality agreements, which barred them from using Chinese devices or apps and photographing, recording or videoing \"anyone or anything indoors or outdoors\" - with breaches resulting in dismissal and fines of up to $30,000. Metropolitan Police officers travelled to Beijing and Tianjin to speak to victims of the fraud, some of whom had lost their life savings, seen their family collapse or been left unable to pay for medical care. Chinese police officers were lined up to become the first in history to give evidence in a UK court, but Qian pleaded guilty on the first day of the trial, while Ling also admitted a money laundering charge. He was has jailed for four years and 11 months. The court heard that since being in prison Qian has had poetry published and her artwork displayed at an exhibition. Wen was jailed for six years and eight months last year, and the sentencing of Qian and Ling marks the end of what the Met's head of economic and cyber crime called \"one of the longest running and most complex economic crime investigations\" in the force's history. \"She lived, while she was on the run in the UK, a relatively reclusive lifestyle. She had that entourage of people around her, but she didn't venture out much,\" he said of Qian. \"And we have some understanding from some of her musings and some of thoughts around what she may do with the rest of her money and her wealth and her life ultimately. \"But thankfully, we were able to catch her and bring her to justice before some of those dreams were realised.\" 'Bitcoin pioneer' After the sentencing today, Qian's lawyer Roger Sahota described his client as a \"Bitcoin pioneer\" who was once the \"world's largest female Bitcoin holder\". \"She never set out to commit fraud but recognises her investment schemes were fraudulent and misled those who trusted her,\" he said. \"She is deeply sorry for the distress suffered by investors and hopes some good endures from the wealth her work created.\" The fortune is now at the centre of a High Court battle between the UK government and thousands of Chinese victims. Prosecutors have set up a compensation scheme but lawyers representing those who want to recover their investments say it should reflect the huge rise in the value of Bitcoin and not just what they put in."
    },
    {
        "title": "Dozens of protesters storm COP30 venue in Brazil",
        "description": "Dozens of protesters have forced their way into the COP30 climate summit venue and clashed with security guards at the entrance.",
        "url": "https://news.sky.com/story/protesters-armed-with-batons-storm-cop30-venue-in-brazil-13468866",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cop30-brazil_7079710.jpg?20251111233807",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 22:40:00",
        "Headline": "COP30 comes at a precarious time for climate action. It's been met with controversy over its location in a Brazilian city on the outskirts of the Amazon rainforest.",
        "Content": " Dozens of protesters have forced their way into the COP30 climate summit venue and clashed with security guards at the entrance. Shouting angrily, crowds demanded access to the compound where thousands of delegates from nations around the world are attending this year's UN convention in Belem, Brazil. Some waved flags with slogans calling for land rights or carried signs, saying \"our land is not for sale\". An indigenous leader from the Tupinamba community, found near the lower reaches of the Tapajos River in Brazil, told Reuters they were upset about ongoing development in the Amazon rainforest. Security guards pushed the protesters back and used tables to barricade the entrance. A Reuters witness saw one security guard being rushed away in a wheelchair while clutching his stomach. Another guard with a fresh cut above his eye told the news agency he had been hit in the head by a heavy drumstick thrown from the crowd. Security confiscated several batons. The protesters dispersed shortly after the clash. Security guards later allowed delegates to exit the venue, having earlier asked them to move back inside until the area was clear. A UN spokesperson said two security staff were injured during the clashes. Read more from Sky News:Sally Kirkland dies aged 84UK stops some intel sharing with US COP30, which started on 10 November and ends on 21 November, comes at a precarious time for climate action. The conference has been met with controversy over its location in Belem, on the outskirts of the Amazon. Brazil's President Luiz Inacio Lula da Silva has highlighted indigenous communities as key players in COP30 negotiations. Dozens of indigenous leaders arrived earlier this week by boat to take part in the talks and demand more say in how forests are managed."
    },
    {
        "title": "UK stops some intelligence sharing with US over boat strikes in Caribbean ",
        "description": "The UK has stopped sharing some intelligence with the US on suspected drug trafficking boats in the Caribbean following concerns over America's strikes against the vessels.",
        "url": "https://news.sky.com/story/uk-stops-some-intelligence-sharing-with-us-over-boat-strikes-in-caribbean-13468750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pete-hegseth-secretary-of-defence_7079586.jpg?20251111202525",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 19:09:00",
        "Headline": "The US has reported carrying out 14 strikes since September on vessels near the Venezuelan coast.",
        "Content": "The UK has stopped sharing some intelligence with the US on suspected drug trafficking boats in the Caribbean following concerns over America's strikes against the vessels. The US has reported carrying out 14 strikes since September on boats near the Venezuelan coast. The death toll from the US attacks in the Pacific and the Caribbean Sea has risen to more than 70, as the US escalates a military build-up in the Caribbean Sea. Downing Street did not deny reporting by CNN that the UK is withholding intelligence from the US to avoid being complicit in US military strikes it believes may breach international law. Britain, which controls several territories in the Caribbean where it bases intelligence assets, has long assisted the US in identifying vessels suspected of smuggling narcotics based on intelligence gathered in its overseas territories in the region. That information helped the US Coast Guard locate the ships, seize the drugs and detain their crews, CNN cited sources as saying. But since the Trump administration started carrying out strikes on alleged drug trafficking boats in early September, UK officials have become concerned their intelligence may be used to acquire targets for the attacks they believe may be illegal. The intelligence-sharing pause began more than a month ago, CNN reported, quoting sources as saying Britain shares UN's human rights chief Volker Turk's assessment that the strikes amount to extrajudicial killing. The reports could provide an awkward backdrop for a meeting between Foreign Secretary Yvette Cooper and her US counterpart Marco Rubio, expected on Wednesday at the G7 foreign ministerial summit in Canada. A Number 10 spokesman did not deny the move when asked about the pause in intelligence sharing. Read more:US likely jammed GPS signals off Venezuela coast, expert tells Sky News'We will treat them EXACTLY how we treated al Qaeda' - US carries out another lethal strike in Caribbean \"We don't comment on security or intelligence matters,\" the official said in response to repeated questions. \"The US is our closest partner on defence, security and intelligence, but in line with a long-standing principle, I'm just not going to comment on intelligence matters.\" He added that \"decisions on this are a matter for the US\" and that \"issues around whether or not anything is against international law is a matter for a competent international court, not for governments to determine\". A Pentagon official told CNN the department \"doesn't talk about intelligence matters\". On Monday, US secretary of war Pete Hegseth said on X that the previous day, \"two lethal kinetic strikes were conducted on two vessels operated by Designated Terrorist Organizations\". He said: \"These vessels were known by our intelligence to be associated with illicit narcotics smuggling, were carrying narcotics, and were transiting along a known narco-trafficking transit route in the Eastern Pacific. \"Both strikes were conducted in international waters and 3 male narco-terrorists were aboard each vessel. All 6 were killed. No U.S. forces were harmed.\" The United Nations human rights chief has described the US strikes on alleged drug dealers off the coast of South America as \"unacceptable\" and a violation of international human rights law. Venezuela says they are illegal, amount to murder and are aggression against the sovereign South American nation."
    },
    {
        "title": "Hundreds of Russian troops roll into key frontline Ukrainian city 'Mad Max-style', video appears to show",
        "description": "Hundreds of Russian troops have pushed deeper into eastern Ukrainian cities 'Mad Max-style', video released by the Russians appears to show.",
        "url": "https://news.sky.com/story/hundreds-of-russian-troops-roll-into-key-frontline-ukrainian-city-mad-max-style-video-appears-to-show-13468646",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pokrovsk-ukraine-map_7079386.jpg?20251111163612",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 15:29:00",
        "Headline": "The fight to gain hold of the key eastern city of Pokrovsk, a strategic point on a large road and rail artery in the Donetsk region, has been raging for well over a year.",
        "Content": " Hundreds of Russian troops have pushed deeper into eastern Ukrainian cities 'Mad Max-style', video released by the Russians appears to show. The troops were seen rolling through the fog on motorbikes, with some on the roofs of battered cars and vans, apparently into the city of Pokrovsk, as Russia said its forces had also pressed further into Kupiansk on Tuesday. Ukraine has acknowledged the presence of the troops on its territory, although Reuters news agency says that when the video was shot is yet to be verified. The fight to gain hold of Pokrovsk, a strategic point on a large road and rail artery in the Donetsk region, has been raging for well over a year, in Vladimir Putin's push to gain control of the whole of Ukraine's industrial east. The Donbas region comprises the neighbouring regions of Luhansk and Donetsk. Ukraine's military said around 300 Russian soldiers were now inside Pokrovsk and that Moscow had intensified efforts to get more troops in over the past few days - using dense fog for cover from drones. It said Ukrainian forces were fighting Russian groups in the city. Moscow says taking Pokrovsk, dubbed \"the gateway to Donetsk\" by Russian media, would give it a platform to push north towards the two largest remaining Ukrainian-controlled cities in the Donetsk region - Kramatorsk and Sloviansk. Posting on X on Tuesday, Ukraine's President Volodymyr Zelenskyy said: \"The front: our main focus right now is on the Pokrovsk direction and the Zaporizhzhia region, where the Russians are increasing the number and scale of assaults. \"The situation there remains difficult, in part because of weather conditions that favor the attacks. But we continue to destroy the occupier, and I thank every one of our units, every warrior involved in defending Ukraine's positions.\" Moscow and Kyiv have given different accounts of the battle for Pokrovsk. Moscow has for days said the city is surrounded, while Kyiv has denied Moscow controls the city and said on Monday that it was still able to supply neighbouring Myrnohrad. Moscow has been threatening Pokrovsk for more than a year, attempting to surround it and threaten supply lines, rather than use the deadly frontal assaults it used to take the city of Bakhmut in 2023. Russian war bloggers published a video on Tuesday showing what they said were Russian forces entering Pokrovsk along a road enveloped in fog, in what some Telegram users said looked like scenes from the Mad Max action film series, many of which are set in a post-apocalyptic landscape. The date of the footage has not been independently verified. Read more:At least 12 killed after suicide bombing in PakistanThailand-Cambodia peace deal in trouble Russia said it had taken 256 buildings and that Moscow's forces were actively advancing to the northwest and east of Pokrovsk as well as around the railway station. Russia has executed a pincer movement around the city and was close to closing it, open-source battlefield maps from both sides show, though Kyiv has counter-attacked around the town of Dobropillia. Ukraine's top military commander, Oleksandr Syrskyi, said in an interview with the New York Post that Russia was concentrating some 150,000 troops in a push to capture Pokrovsk, with mechanised groups and marine brigades forming part of this drive. Russia said its forces had taken full control of the eastern part of Kupiansk in Ukraine's Kharkiv region. A Russian commander, who gave his call sign as Hunter, said his troops had taken control of an oil depot on the eastern edge of Kupiansk. In a video statement issued by Russia's defence ministry, he said his forces had also taken control of a series of train stops along the railway to Kupiansk Vuzlovyi, a settlement around 6km (4 miles) south of the centre of Kupiansk itself. Russia also said its troops had taken control of the settlement of Novouspenivske in the southeastern Zaporizhzhia region. Ukraine withdrew from some villages, including Novouspenivske, due to intense attacks involving more than 400 artillery strikes per day, RBC-Ukraine news agency cited a military spokesperson as saying. Russia's military says it now controls more than 19% of Ukraine, or some 116,000 square km (44,800 square miles), up from 18% nearly three years ago, according to Ukrainian maps tracking frontline changes."
    },
    {
        "title": "At least 12 killed after suicide bombing in Pakistan",
        "description": "At least 12 people have been killed in a suicide bombing outside the gates of a court in Pakistan's capital of Islamabad, the country's interior minister has said.",
        "url": "https://news.sky.com/story/at-least-12-killed-after-suicide-bombing-in-pakistan-13468399",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-islamabad-pakistan_7078977.jpg?20251111104823",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 10:37:00",
        "Headline": "Interior minister Mohsin Naqvi said the attacker tried to enter a court \"but, failing to do so, targeted a police vehicle\".",
        "Content": " At least 12 people have been killed in a suicide bombing outside the gates of a court in Pakistan's capital of Islamabad, the country's interior minister has said. At least 27 other people were also wounded after the bomber detonated his explosives next to a police car. Interior minister Mohsin Naqvi said the attacker tried to \"enter the court premises but, failing to do so, targeted a police vehicle\". Mr Naqvi added that authorities are \"looking into all aspects\" of the attack. No group immediately claimed responsibility for the explosion, but authorities have recently struggled with a resurgent Pakistani Taliban. The explosion, which was heard from miles away, occurred at a busy time of day when the area outside the court is typically crowded with hundreds of visitors attending hearings. More than a dozen badly wounded people were screaming for help as ambulances rushed to the scene. \n                  Pakistan agrees to ceasefire with Afghanistan after days of bloodshed\n                 \n                  Border crossings between Pakistan and Afghanistan remain closed as clashes continue\n                 \n                  Car bomb kills 10 in Pakistan after militants trigger shootout with troops\n                 \"People started running in all directions,\" said Mohammad Afzal, who claimed he was at the court when he heard the blast. Pakistani security forces earlier said they foiled an attempt by militants to take cadets hostage at an army-run college overnight, when a suicide car bomber and five other attackers targeted the facility in a northwestern province. The authorities blamed the Pakistani Taliban, which is separate from but allied with Afghanistan's Taliban, but the group denied involvement in that attack on Monday evening. The assault began when a bomber attempted to storm the cadet college in Wana, a city in Khyber Pakhtunkhwa province near the Afghan border. The area had, until recent years, served as a base for the Pakistani Taliban, al Qaeda and other foreign militants. Read more from Sky News:At least eight killed in New Delhi car explosionMan accused of fatal Christmas market attack apologises to family of boy According to local police chief Alamgir Mahsud, two of the militants were quickly killed by troops while three others managed to enter the compound before being cornered in an administrative block. The army's commandos were among the forces conducting a clearance operation, and an intermittent exchange of fire went on into Tuesday, Mr Mahsud said. Pakistani Prime Minister Shehbaz Sharif denounced both attacks and said those responsible must be brought to justice swiftly. \"We will ensure the perpetrators are apprehended and held accountable,\" he said. Mr Sharif described attacks on unarmed civilians as \"reprehensible\", adding: \"We will not allow the blood of innocent Pakistanis to go to waste.\""
    },
    {
        "title": "Thailand-Cambodia peace deal in trouble",
        "description": "Thailand has paused a US-brokered ceasefire with Cambodia after a landmine explosion injured four of its soldiers. ",
        "url": "https://news.sky.com/story/trump-brokered-ceasefire-in-trouble-as-landmine-explosion-derails-thailand-cambodia-peace-deal-13468449",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-thailand-cambodia-conflict_6976528.jpg?20250729075754",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 13:30:00",
        "Headline": "At least 48 people were killed and hundreds of thousands more displaced when the two sides clashed over the summer.",
        "Content": "Thailand has paused a US-brokered ceasefire with Cambodia after a landmine explosion injured four of its soldiers.  Bangkok's government said it would explain its decision to US President Donald Trump, who was present when the deal was signed last month in Malaysia. Tensions flared between the South East Asian neighbours over the summer when the two sides clashed for five days. Both nations blame each other for the worst fighting in their recent histories, during which at least 48 people were killed and 300,000 more displaced. Thailand has indefinitely halted implementation of the agreement after a mine exploded along its Cambodian border. The Thai army said a sergeant had lost his foot, and three others received minor shrapnel injuries, when the mine exploded on Monday in Sisaket province. It accused Cambodia of laying new mines in violation of the truce agreement. Cambodia has denied responsibility. \n                  British woman stabbed to death in Cambodia over 'love triangle', police say\n                 \n                  Cambodian soldiers returned by Thailand after ceasefire deal\n                 \n                  Thailand and Cambodia agree to immediate ceasefire, Malaysian PM says\n                 Foreign Ministry spokesperson Nikorndej Balankura said on Tuesday the incident showed \"Cambodia's utter lack of sincerity\" and called for an apology. Thailand will now hold off on releasing 18 Cambodian prisoners of war currently held by its military. The explosion was caused by \"the remnants of past conflicts\", Cambodia Defence Ministry spokesperson Maly Socheata said. She urged Thai troops to avoid patrolling in old minefield areas. Read more:'There's been clashes before but this feels different'Sky News at scene of deadly Cambodian rocket attack Cambodia \"remains committed to working closely with Thailand to promote peace and stability between the two countries, especially ensuring the security and safety of civilians,\" she said. Under the terms of the truce, Thailand agreed to withdraw troops and heavy weapons from the border area, and to release Cambodian detainees. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Announcing the ceasefire last month, Mr Trump bragged that it was one of eight wars his administration had ended in eight months. The president is known to covet a Nobel Peace Prize, like his predecessor Barack Obama won, and it's been suggested his diplomatic efforts are in service of this goal. Trump bought both sides to the table after threatening to halt their respective trade talks with the US.  But experts say it was always doubtful that the uneasy peace will hold. Matthew Wheeler, Southeast Asia senior analyst for the Belgium-based International Crisis Group, said it was \"predictable\" that the truce would collapse. He said: \"It was predictable that the agreement would break down, because it was plainly concluded to placate President Trump on matters unrelated to the conflict, namely, trade and Trump's desire to be perceived as a peacemaker.\""
    },
    {
        "title": "TikTok influencer Mariame Cissé publicly executed in Mali",
        "description": "Armed men in Mali have abducted and publicly executed a TikTok influencer who posted videos in support of the West African nation's military, local authorities have said.",
        "url": "https://news.sky.com/story/armed-men-in-mali-publicly-execute-tiktok-influencer-mariame-ciss233-officials-say-13468477",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-mariam-cisse-tiktok_7078970.jpg?20251111104354",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 10:05:00",
        "Headline": "The abduction and execution in Tonka shocks the country, which has been battling armed groups since 2012.",
        "Content": "Armed men in Mali have abducted and publicly executed a TikTok influencer who posted videos in support of the West African nation's military, local authorities have said. Mariame Cissé was taken on Friday while at a weekly market in Echel, according to Yehia Tandina, the mayor of neighbouring Timbuktu. He described how the following day at dusk the same men brought her back to Independence Square in Tonka and executed her in front of a crowd. The mayor of Tonka, where the execution took place, confirmed the killing but said he did not have more information.  The village sits on the Niger River, roughly in the centre of the country. Members of the al Qaeda affiliate Jama'at Nusrat ul Islam wa al Muslimin, or JNIM, are known to operate there. No group has taken responsibility for the killing. \n                  Russian forces expand base in Mali after death of Wagner Group leader Yevgeny Prigozhin\n                 \n                  Ministry of Defence accidentally sends classified information to Kremlin ally\n                 \n                  African Cup of Nations 2022: Referee causes chaos after ending group match between Tunisia and Mali early twice\n                 Cissé, who was not a member of the military, sometimes posted images of herself in military fatigues to her more than 140,00 followers, which is thought to have drawn attention from the armed men. She received death threats several days before she was abducted, according to the Timbuktu mayor. In her last TikTok, uploaded a few days before her murder, Cissé can be seen joyfully dancing along to a song while smiling and laughing. The video has received hundreds of comments mourning her death and the TikToker continues to gain thousands of followers as news of her murder spreads. Mali has been battling armed groups since 2012, a fight that has escalated over the past decade. The military seized power in 2020 on the pretext of curtailing the insecurity. 👉 Tap here to follow The World with Richard Engel and Yalda Hakim wherever you get your podcasts 👈 Another military officer seized power in a coup the following year. Insecurity has worsened since then, according to monitoring groups. Armed groups, primarily JNIM, operate in large swathes of rural regions. The landlocked nation is currently under a two-month long fuel blockade that has been imposed by al Qaeda affiliated groups."
    },
    {
        "title": "Left-winger Catherine Connolly declared new president of Ireland",
        "description": "Ireland's new left-wing president Catherine Connolly is going to be \"cool\", according to school children who met her after her inauguration at Dublin Castle.",
        "url": "https://news.sky.com/story/left-winger-catherine-connolly-declared-new-president-of-ireland-13468578",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-catherine-connolly_7079164.jpg?20251111131244",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 13:06:00",
        "Headline": "Ms Connolly, who united the left to beat candidates supported by the two major parties Fine Gael and Fianna Fail, said in her inauguration speech that, with its history of neutrality, Ireland was \"particularly well-placed to lead and articulate alternative diplomatic solutions to war\".",
        "Content": "Ireland's new left-wing president Catherine Connolly is going to be \"cool\", according to school children who met her after her inauguration at Dublin Castle. Third and fourth year youngsters from the Irish capital's Francis Street School spoke to the 68-year-old former psychologist, barrister and independent member of the Irish parliament after they watched an Air Corps flypast during the ceremony. The victory of pro-Palestine Ms Connolly was hailed as a significant moment for the left in Ireland as opposition parties had united to back her to prevent the two major parties, Fine Gael and Fianna Fail, from winning the presidency. But her politics put her in opposition to Irish prime minister Michael Martin: she has been a long-time critic of the European Union in one of the bloc's most pro-EU member states, has attacked Ireland's increased military spending and has criticised UK prime minister Sir Keir Starmer for saying Hamas should have no place in Gaza's future after the UK recognised a Palestinian state. The reaction of the children she spoke to suggested she was going to be popular among young people. Luna Flynn said after meeting her: \"It was amazing, I think she's really good and great and I think she is going to be a great fit for our president.\" Declan McGuinness said the president \"was really cool and kind\" while another pupil, AJ Stack, referred to a popular video of Ms Connolly doing keepie-uppy with a football and said: \"Obviously its her first day so she still has to get used to it. But I think she is going to be very good in the future.\" \n                  Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash\n                 \n                  Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 Ms Connolly, who is from Galway, won 63% of the valid first preference votes during the election on 24 October. Read more:Who is Catherine Connolly, Ireland's new left-wing president? Ireland correspondent In the absence of a royal family, a presidential inauguration is pretty much the closest Ireland comes to pomp and circumstance. It only happens once every seven years, so no detail was overlooked. When we finally heard from the new president, after she had been sworn in, it was no surprise that she railed against the horror of war and genocide – topics she has always been outspoken on, although on this occasion she did not mention Israel by name. Standing in the former seat of British power in Ireland, she spoke of Ireland's experience of colonialism and how that gave her country a mandate to lead alternative solutions to war and conflict.\n  For the new holder of an ostensibly non-political office, President Connolly's maiden speech hinted that she may just push the boundaries of accepted norms over the next seven years – possibly to the discomfort of the Irish government.   During her inauguration ceremony, she repeated the Declaration of Office in Irish, read to her by Chief Justice Donal O'Donnell, before signing the declaration and being officially proclaimed president. A 21-gun salute was fired as Ms Connolly was handed the Seal of Office. In her first speech as in her new role, she said Ireland faces the \"inextricably linked\" threats of climate change and ongoing wars. \"Unfortunately, we have all become witnesses to ongoing wars and genocide,\" Ms Connolly said. \"Given our history, the normalisation of war and genocide has never been and will never be acceptable to us. \"As a sovereign independent nation with the long and cherished tradition of neutrality and an uninterrupted record of peacekeeping since 1958, Ireland is particularly well-placed to lead and articulate alternative diplomatic solutions to conflict and war. \"Indeed, our experience of colonisation and resistance of a catastrophic man-made famine and forced immigration gives us a lived understanding of dispossession, hunger and war and a mandate for Ireland to lead.\" Her predecessor, Michael D Higgins, ended his 14-year-term in office at midnight. He received a warm round of applause on his arrival at the ceremony. Former Irish presidents Mary McAleese and Mary Robinson also attended. Northern Ireland First Minister Michelle O'Neill was among members of the judiciary, politicians and guests from a cross section of society from the island of Ireland. Read more on Sky News:Tens of thousands killed in two days in Sudan city, analysts believeHundreds feared dead in days of protests after disputed Tanzanian elections The Irish president, while head of state, has limited constitutional powers and is seen as a mostly ceremonial role, with the Taoiseach (Irish prime minister) - currently centre-right Mr Martin - having far more influence and power. Ms Connolly's uniting of the majority of left-wing parties, including the largest opposition member Sinn Fein, along with the Social Democrats and Labour, was seen as a pointer to the state of Irish society and the country's politics, with celebrity candidates like Elon Musk-backed Conor McGregor and dance star Michael Flatley falling by the wayside."
    },
    {
        "title": "Over 1,000 players suspended in widening Turkish football betting investigation",
        "description": "The Turkish Football Federation has suspended over 1,000 players amid a growing investigation into betting.",
        "url": "https://news.sky.com/story/over-1000-players-suspended-in-widening-turkish-football-betting-investigation-13468553",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-eren-elmali-galatasaray_7079105.jpg?20251111123350",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-11 12:25:00",
        "Headline": "National team defender Eren Elmali is among those referred to a disciplinary committee as investigations engulf referees, club officials, and multiple leagues. ",
        "Content": "The Turkish Football Federation has suspended over 1,000 players amid a growing investigation into betting. Among them is Eren Elmali, a defender for the Turkish national side who has been a regular for Galatasaray in the Champions League this season. The 25-year-old, who joined the Istanbul-based side this year, has said he bet on a game about five years ago that did not involve his own team. He posted a statement on Instagram late on Monday to explain his involvement in the case, after he was pulled from the Turkey squad preparing to play World Cup qualifying games against Spain and Bulgaria. Elmali and his Galatasaray teammate Metehan Baltaci are among 1,024 players listed by the Turkish Football Federation on Monday as being referred to a disciplinary committee. The federation announced that Turkey's third and fourth tiers will be suspended for two weeks. However, matches in the top division, the Super League, led by reigning champion Galatasaray, as well as the second division, will proceed as scheduled. Turkish football is reeling from investigations into claims that both referees and players have been involved in betting on matches, a practice prohibited by FIFA. Read more from Sky News:Unemployment rate jumps to highest level since COVIDPolice release update on Bob Vylan Glastonbury probe Over 150 referees are accused of placing bets on matches, among them seven officials licensed for top-tier games and 15 top-level assistant referees. “Our duty is to elevate Turkish football to its rightful place and to purge it of all its filth,” Turkish federation president İbrahim Hacıosmanoglu said at a news conference two weeks ago. Turkish football has seen a resurgence in recent years, with the country set to co-host Euro 2032 with Italy, the national team reaching the Euro 2024 quarterfinals, and Istanbul chosen to host several UEFA finals."
    },
    {
        "title": "California governor Gavin Newsom accuses Donald Trump of 'abdicating responsibility' over green energy at COP30",
        "description": "A possible Democratic contender for the White House says he's at the COP summit with an \"open hand not a closed fist\" - as he vowed not to let China dominate the green space.",
        "url": "https://news.sky.com/story/california-governor-gavin-newsom-accuses-donald-trump-of-abdicating-responsibility-over-green-energy-at-cop30-13468725",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gavin-newsom-cop30_7079561.jpg?20251111195426",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-11 18:04:00",
        "Headline": "The Republican president has ignored the meeting of tens of thousands of people at the COP30 climate talks in Brazil, leaving the stage wide open for Democrats to swoop in and lob criticism from afar.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  A possible Democratic contender for the White House says he's at the COP summit with an \"open hand not a closed fist\" - as he vowed not to let China dominate the green space. California Governor Gavin Newsom has for months been teasing a bid for the next presidential election in 2028. Sky News asked him at COP30 in Brazil if he was using it to drum up support for his campaign. \"I'm here in the absence of leadership from Donald Trump, who's abdicated responsibility on a critical issue,\" he said. The Republican president has ignored the meeting of tens of thousands of people in Belem, leaving the stage wide open for Democrats to swoop in and lob criticism from afar. Mr Newsom is a longstanding political foe of US President Donald Trump - they trade insults like \"Gavin Newscum\" and \"The Nodfather\". He added the switch to green energy is about \"more than electric power\". \n                  Dozens of protesters storm COP30 venue in Brazil\n                 \n                  COP30: Climate summit kicks off with plea to work together - despite Trump-shaped hole\n                 \n                  COP30: Trump urged to involve US in the fight against climate change\n                 \"It's about economic power,\" Mr Newsom said, \"and I'm not going to cede America's economic leadership to China.\" When he took office this year, Donald Trump cancelled clean energy projects and subsidies. Meanwhile China is making eight in ten of the world's solar panels and seven in ten electric vehicles - while also producing more coal than any other country.  The US president is fighting back for the domestic oil and gas industry by trying to sell more of it abroad. But in doing so he has given China more room to dominate green markets, Democrats say. The US and China have been locked in tariff threats and trade wars this year. Read more:Trump urged to involve US in the fight against climate changeCOP30 kicks off with plea to work together - despite Trump-shaped holeWhy US may soon have a real energy emergencyWhat is COP30? 'Open hand, not a closed fist' Mr Newsom said at another event at COP30 today California was going to \"lean in\" and \"compete in this space\". \"But we can't do that without all of you... So we're here with an open hand, not a closed fist.\" Democrats have been pounding the hot and humid hallways in Amazonian Belem to tout California's \"climate leadership\". The state doesn't have any formal say in these inter-governmental negotiations. But as the fourth-largest economy in the world, it does wield influence in energy markets.  California gets two thirds of its electricity from renewables, but also still imports 300,000 barrels of oil a year, the second-biggest provider of which is the country hosting the climate summit, Brazil. Republican states were also faster to roll out renewable power than Democrats. Sky News put that to California senator Josh Becker yesterday, also here on a PR exercise for the state. Mr Becker said the fact that Republican Texas had rolled out more solar and wind than California was \"a good thing that shows that it's economically competitive\". \"It's actually cheaper. That's really why they did it,\" he said. \"Not necessarily because of climate action. And that's good news. So we're all for that.\""
    },
    {
        "title": "End to longest US government shutdown one step closer - as Democrats face backlash ",
        "description": "An end to the longest US government shutdown in history is one step closer after Senate Democrats broke with their party to strike a deal with the Republicans.",
        "url": "https://news.sky.com/story/end-to-longest-us-government-shutdown-one-step-closer-as-democrats-face-backlash-13468347",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-us-shutdown_7037800.jpg?20251001010711",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-11 00:01:00",
        "Headline": "The shutdown began on 1 October - with 670,000 federal government employees furloughed or left with no choice but to work without pay. More than 40 million Americans have also had to go without food aid.",
        "Content": " An end to the longest US government shutdown in history is one step closer after Senate Democrats broke with their party to strike a deal with the Republicans. Senators backed by 60 votes to 40 legislation to end the impasse, though it still needs approval from the House of Representatives - and sign-off by President Donald Trump. He has indicated he is happy with the agreement, though, which would restore funding for federal agencies that have gone without since 1 October. It would also prevent any further layoffs until 30 January, but does not satisfy Democrat demands regarding health care insurance for millions of Americans. Health care was at the heart of the dispute that led to the shutdown. The Democrats had refused to support a Republican budget plan unless tax credits that made medical insurance cheaper for millions of people were renewed. The willingness of eight moderate Democrats to break the Senate deadlock without that guarantee has provoked fury among many in the party. Some are now calling on Senate Minority Chuck Schumer to be replaced because he is \"no longer effective\". California Governor Gavin Newsom - regarded as a contender for the 2028 Democratic presidential nomination - said: \"Pathetic. This isn't a deal. It's surrender.\" Read more US news:Trump threatens to sue BBC for $1bnGhislaine Maxwell's emails from jail leaked  On Monday morning, Republican Senate Majority Leader John Thune had urged politicians to work together to break a stalemate that had lasted for more than 40 days. He said: \"The American people have suffered for long enough. Let's not pointlessly drag this bill out.\" The shutdown began on 1 October - with 670,000 federal government employees furloughed or left with no choice but to work without pay. SNAP, a food aid programme used by 42 million Americans, has been frozen - with thousands of flights cancelled at dozens of major airports. Mr Trump has told air traffic controllers to get back to work, threatening anyone who doesn't with \"docked\" pay. The funding package now heading to the House of Representatives only lasts through to 30 January, making it a relatively short-term solution that will require further negotiation."
    },
    {
        "title": "California governor Gavin Newsom accuses Donald Trump of 'abdicating responsibility' over green energy at COP30",
        "description": "A possible Democratic contender for the White House says he's at the COP summit with an \"open hand not a closed fist\" - as he vowed not to let China dominate the green space.",
        "url": "https://news.sky.com/story/california-governor-gavin-newsom-accuses-donald-trump-of-abdicating-responsibility-over-green-energy-at-cop30-13468725",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gavin-newsom-cop30_7079561.jpg?20251111195426",
        "type": "US",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-11 18:04:00",
        "Headline": "The Republican president has ignored the meeting of tens of thousands of people at the COP30 climate talks in Brazil, leaving the stage wide open for Democrats to swoop in and lob criticism from afar.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  A possible Democratic contender for the White House says he's at the COP summit with an \"open hand not a closed fist\" - as he vowed not to let China dominate the green space. California Governor Gavin Newsom has for months been teasing a bid for the next presidential election in 2028. Sky News asked him at COP30 in Brazil if he was using it to drum up support for his campaign. \"I'm here in the absence of leadership from Donald Trump, who's abdicated responsibility on a critical issue,\" he said. The Republican president has ignored the meeting of tens of thousands of people in Belem, leaving the stage wide open for Democrats to swoop in and lob criticism from afar. Mr Newsom is a longstanding political foe of US President Donald Trump - they trade insults like \"Gavin Newscum\" and \"The Nodfather\". He added the switch to green energy is about \"more than electric power\". \n                  Dozens of protesters storm COP30 venue in Brazil\n                 \n                  COP30: Climate summit kicks off with plea to work together - despite Trump-shaped hole\n                 \n                  COP30: Trump urged to involve US in the fight against climate change\n                 \"It's about economic power,\" Mr Newsom said, \"and I'm not going to cede America's economic leadership to China.\" When he took office this year, Donald Trump cancelled clean energy projects and subsidies. Meanwhile China is making eight in ten of the world's solar panels and seven in ten electric vehicles - while also producing more coal than any other country.  The US president is fighting back for the domestic oil and gas industry by trying to sell more of it abroad. But in doing so he has given China more room to dominate green markets, Democrats say. The US and China have been locked in tariff threats and trade wars this year. Read more:Trump urged to involve US in the fight against climate changeCOP30 kicks off with plea to work together - despite Trump-shaped holeWhy US may soon have a real energy emergencyWhat is COP30? 'Open hand, not a closed fist' Mr Newsom said at another event at COP30 today California was going to \"lean in\" and \"compete in this space\". \"But we can't do that without all of you... So we're here with an open hand, not a closed fist.\" Democrats have been pounding the hot and humid hallways in Amazonian Belem to tout California's \"climate leadership\". The state doesn't have any formal say in these inter-governmental negotiations. But as the fourth-largest economy in the world, it does wield influence in energy markets.  California gets two thirds of its electricity from renewables, but also still imports 300,000 barrels of oil a year, the second-biggest provider of which is the country hosting the climate summit, Brazil. Republican states were also faster to roll out renewable power than Democrats. Sky News put that to California senator Josh Becker yesterday, also here on a PR exercise for the state. Mr Becker said the fact that Republican Texas had rolled out more solar and wind than California was \"a good thing that shows that it's economically competitive\". \"It's actually cheaper. That's really why they did it,\" he said. \"Not necessarily because of climate action. And that's good news. So we're all for that.\""
    },
    {
        "title": "Donald Trump and his long history of lawsuits against the media",
        "description": "Donald Trump is threatening to sue the BBC for $1bn (&#163;760m) - but this is not his first legal battle with the media.",
        "url": "https://news.sky.com/story/donald-trump-and-his-long-history-of-lawsuits-against-the-media-13468501",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-donald-trump-bbc-broadcasting-house_7078402.jpg?20251110170807",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-11 10:56:00",
        "Headline": "From legal battles with ABC, CNN, and CBS, Donald Trump has had a number of high-profile legal battles with media in the US - and has now lined up a fight with the BBC.",
        "Content": "Donald Trump is threatening to sue the BBC for $1bn (£760m) - but this is not his first legal battle with the media. The US president has clashed with the broadcaster over edits made to one of his 2021 speeches in a Panorama documentary aired before last year's election. Mr Trump's legal team has accused the BBC of using \"false, defamatory, disparaging, and inflammatory statements\". BBC Chair Samir Shah has apologised for an \"error of judgment\" over the way the speech was edited, while director-general, Tim Davie, and CEO of BBC News, Deborah Turness, have both announced their resignations. But this is not the first time Mr Trump has taken on the media - and is in fact the latest in a recent spate of legal battles with the press.  Trump vs CNN If past examples are anything to go by, Mr Trump's legal threat is not an empty one. He previously filed a $475m (£360m) defamation suit against CNN, alleging it had compared him to Adolf Hitler. It came after CNN referred to Mr Trump's unfounded claims that the 2020 election was stolen from him as the \"Big Lie\" - an expression also used by Hitler in Mein Kampf. But the case was thrown out after US district judge Raag Singhal ruled that the term \"does not give rise to a plausible inference that Trump advocates the persecution and genocide of Jews\". Election campaign lawsuit His election campaign in 2020 also sued the New York Times and the Washington Post over opinion pieces alleging ties between with Russia. These cases were dismissed in 2021 and 2023, respectively. Yet, Mr Trump has had more success in recent years. ABC settlement In 2024, Trump sued American broadcaster ABC and its news host George Stephanopoulos, after the anchor falsely referred to the president being found \"liable for rape\" in an interview. In the civil case in question, he was actually found liable for sexual abuse and defamation - a verdict which Trump is appealing. Given the high bar for proving defamation against public figures, experts were sceptical that he could win the lawsuit. George Freeman, executive director of the Media Law Resource Center told CBS at the time: \"I don't know of any president who successfully sued a media company for defamation.\" Yet ABC, which is owned by Disney, agreed to settle, paying $15m (£11.4m) to Trump for his future presidential library, and a further $1m (£760,000) towards his legal fees. Battle with CBS In another lawsuit, the president demanded $20bn (£15.2bn) from CBS over an interview with his election rival Kamala Harris broadcast on 60 Minutes. His team accused the broadcaster of \"partisan and unlawful acts of election and voter interference\" with its editing of the interview, saying it intended to \"mislead the public and attempt to tip the scales\" in the contest. Read more:Tim Davie resigns as BBC director-generalTrump's lawyer threatens BBC - read the letter in full First Amendment attorney Charles Tobin of the law firm Ballard Spahr told CNN at the time: \"This is a frivolous and dangerous attempt by a politician to control the news media.\" Yet they too settled out of court, with CBS' parent company, Paramount Global, paying $16m (£12.1m) to end the legal dispute - again towards Trump's future presidential library. Trump vs Meta Meta, the parent company of Facebook and Instagram, also settled with the president to the tune of $25m (£19m). That lawsuit came after he sued over the suspension of his accounts in the wake of the 6 January riots. Why the recent spate? While Mr Trump has made several threats to media organisations in recent years, it is not the first time he has done so. According to Columbia Journalism Review, he threatened to sue a journalist at New York's Village Voice as far back as 1979, and actually sued the Chicago Tribune in 1984. That 1984 lawsuit, which came after Mr Trump took umbrage at a column by the paper's award-winning architecture columnist criticising his plans for a huge tower block in New York City, was thrown out as an opinion by a judge. 👉 Tap here to follow Trump100 wherever you get your podcasts👈  However, the number of lawsuits, and the size of his compensation demands, have increased of late. So what has changed? \"As president, Trump's leverage has increased exponentially,\" wrote media reporter Paul Farhi in Vanity Fair. \"It's no coincidence that Disney and Meta have settled since Election Day, and Paramount has come to the table.\" Now that he's turning his ire on the BBC, what will the outcome be? Mr Freeman called his threat to the broadcaster \"totally meaningless\", noting that he \"has a long record of unsuccessful libel suits\" intended to \"threaten and scare media he doesn't like\". Can the BBC rely on that assessment? With a deadline set for Friday, 10pm UK time, we may be about to find out."
    },
    {
        "title": "UK stops some intelligence sharing with US over boat strikes in Caribbean ",
        "description": "The UK has stopped sharing some intelligence with the US on suspected drug trafficking boats in the Caribbean following concerns over America's strikes against the vessels.",
        "url": "https://news.sky.com/story/uk-stops-some-intelligence-sharing-with-us-over-boat-strikes-in-caribbean-13468750",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pete-hegseth-secretary-of-defence_7079586.jpg?20251111202525",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-11 19:09:00",
        "Headline": "The US has reported carrying out 14 strikes since September on vessels near the Venezuelan coast.",
        "Content": "The UK has stopped sharing some intelligence with the US on suspected drug trafficking boats in the Caribbean following concerns over America's strikes against the vessels. The US has reported carrying out 14 strikes since September on boats near the Venezuelan coast. The death toll from the US attacks in the Pacific and the Caribbean Sea has risen to more than 70, as the US escalates a military build-up in the Caribbean Sea. Downing Street did not deny reporting by CNN that the UK is withholding intelligence from the US to avoid being complicit in US military strikes it believes may breach international law. Britain, which controls several territories in the Caribbean where it bases intelligence assets, has long assisted the US in identifying vessels suspected of smuggling narcotics based on intelligence gathered in its overseas territories in the region. That information helped the US Coast Guard locate the ships, seize the drugs and detain their crews, CNN cited sources as saying. But since the Trump administration started carrying out strikes on alleged drug trafficking boats in early September, UK officials have become concerned their intelligence may be used to acquire targets for the attacks they believe may be illegal. The intelligence-sharing pause began more than a month ago, CNN reported, quoting sources as saying Britain shares UN's human rights chief Volker Turk's assessment that the strikes amount to extrajudicial killing. The reports could provide an awkward backdrop for a meeting between Foreign Secretary Yvette Cooper and her US counterpart Marco Rubio, expected on Wednesday at the G7 foreign ministerial summit in Canada. A Number 10 spokesman did not deny the move when asked about the pause in intelligence sharing. Read more:US likely jammed GPS signals off Venezuela coast, expert tells Sky News'We will treat them EXACTLY how we treated al Qaeda' - US carries out another lethal strike in Caribbean \"We don't comment on security or intelligence matters,\" the official said in response to repeated questions. \"The US is our closest partner on defence, security and intelligence, but in line with a long-standing principle, I'm just not going to comment on intelligence matters.\" He added that \"decisions on this are a matter for the US\" and that \"issues around whether or not anything is against international law is a matter for a competent international court, not for governments to determine\". A Pentagon official told CNN the department \"doesn't talk about intelligence matters\". On Monday, US secretary of war Pete Hegseth said on X that the previous day, \"two lethal kinetic strikes were conducted on two vessels operated by Designated Terrorist Organizations\". He said: \"These vessels were known by our intelligence to be associated with illicit narcotics smuggling, were carrying narcotics, and were transiting along a known narco-trafficking transit route in the Eastern Pacific. \"Both strikes were conducted in international waters and 3 male narco-terrorists were aboard each vessel. All 6 were killed. No U.S. forces were harmed.\" The United Nations human rights chief has described the US strikes on alleged drug dealers off the coast of South America as \"unacceptable\" and a violation of international human rights law. Venezuela says they are illegal, amount to murder and are aggression against the sovereign South American nation."
    },
    {
        "title": "Sally Kirkland, famous for her Oscar-nominated roles in The Sting and Anna, dies aged 84",
        "description": "Sally Kirkland, a former model and Oscar nominated actress known for her roles in films such as Anna, The Sting and JFK has died aged 84.",
        "url": "https://news.sky.com/story/sally-kirkland-famous-for-her-oscar-nominated-roles-in-the-sting-and-anna-dies-aged-84-13468707",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sally-kirkland_7079598.jpg?20251111204219",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-11 17:14:00",
        "Headline": "The actress, who was famously comfortable with nudity, was also a fierce advocate for people with AIDS, prisoners and the homeless.",
        "Content": "Sally Kirkland, a former model and Oscar nominated actress known for her roles in films such as Anna, The Sting and JFK has died aged 84. Her representative, Michael Greene, said Kirkland died on Tuesday morning at a Palm Springs hospice. Kirkland had been unwell and struggling to cover medical bills after she fractured six bones last year and developed two life-threatening infections. She had also been diagnosed with dementia. A GoFundMePage that was set up by her friends to help pay for her ongoing treatment had raised over £45,000 ($60,000). Her biggest role was in the 1987 film Anna, as a fading Czech movie star remaking her life in the United States and mentoring a younger actor. Kirkland won a Golden Globe and earned an Oscar nomination alongside Cher in Moonstruck, Glenn Close in Fatal Attraction, Holly Hunter in Broadcast News and Meryl Streep in Ironweed. Born in New York City, Kirkland was encouraged to start modelling at age five by her mother, who was a fashion editor at Vogue and Life magazines. Kirkland went on to graduate from the American Academy of Dramatic Arts in 1961. \n                  Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster\n                 \n                  Author Dame Jilly Cooper died after fall at home, inquest finds\n                 \n                  BBC staff seemed fed up of Tim Davie's 'nothing to see' approach\n                 An early breakout for the star was appearing in Andy Warhol's 13 Most Beautiful Women in 1964. Some of her earliest roles were playing Shakespeare parts, including Helena in A Midsummer Night's Dream and Miranda in an off-Broadway production of The Tempest. She once told the Los Angeles Times: \"I don't think any actor can really call him or herself an actor unless he or she puts in time with Shakespeare.\" Kirkland was also infamous for her nude scenes, often disrobing in films and for social causes. In particular, Kirkland volunteered and advocated for people with AIDS, the homeless and prisoners."
    },
    {
        "title": "Warren Buffett says he will be 'going quiet' as he sends farewell letter as Berkshire Hathaway CEO",
        "description": "Legendary investor Warren Buffett has said he will be \"going quiet\" as he sent the last of his famous shareholder letters as chief executive.",
        "url": "https://news.sky.com/story/warren-buffett-says-he-will-be-going-quiet-as-he-sends-farewell-letter-as-berkshire-hathaway-ceo-13468485",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-warren-buffett-buffett_7078973.jpg?20251111104514",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-11-11 10:25:00",
        "Headline": "Buffett confirms he will remain a major shareholder until Berkshire Hathaway investors develop \"comfort\" with Greg Abel's leadership.",
        "Content": "Legendary investor Warren Buffett has said he will be \"going quiet\" as he sent the last of his famous shareholder letters as chief executive. The 95-year-old \"Oracle of Omaha\" also threw his weight behind incoming boss Greg Abel and said he had \"more than met\" his high expectations. Shares in Buffett's $1trn company, Berkshire Hathaway, have dipped over the past six months - despite US markets rising - as his days as chief executive tick down. But in Monday's letter to shareholders, the world's 10th richest person downplayed concerns that the halo effect dubbed the \"Buffett premium\" was ebbing away. He said Abel had \"more than met\" his expectations and it was just a case of the 63-year-old needing time to get investors' confidence. \"I can't think of a CEO, a management consultant, an academic, a member of government - you name it - that I would select over Greg to handle your savings and mine,\" Buffett wrote. \"He is a great manager, a tireless worker and an honest communicator. Wish him an extended tenure.\" Buffett revealed in May that he was stepping down at the end of 2025 and the US company's board approved Abel as his replacement. He has an extremely tough act to follow; Buffett has been at the helm for six decades after turning a failing textile firm into a behemoth that owns more than 60 companies and has stakes in many more. Buffett will stay on as chairman and confirmed on Monday he would also remain a major shareholder until investors develop \"comfort\" with Abel's leadership. However, he said the days of him holding court at the shareholders' meeting and writing the introduction to the annual report were over. \"As the British would say, I'm 'going quiet',\" Buffett wrote. Read more from Sky News:At least 12 killed after suicide bombing in PakistanEnd to longest US government shutdown one step closer With less than two months left, the investing icon admitted he moved \"slowly and read with increasing difficulty\", but said he was generally feeling good and was still at the office five days a week. He also revealed he was accelerating his charitable donations and giving another $1.3bn in Berkshire Hathaway shares to four family-run foundations. Buffett is believed to have donated more than $60bn over the years and is signed up to Bill Gates's Giving Pledge to donate 99% of his wealth - currently estimated at $148bn by Forbes. When he dies, his children will have about a decade to give away most of his remaining billions."
    },
    {
        "title": "Unemployment rate jumps to highest level since late 2020 ahead of budget",
        "description": "The UK's jobless rate has risen to a level not seen since late 2020, according to official figures released ahead of the budget.",
        "url": "https://news.sky.com/story/unemployment-rate-jumps-to-highest-level-since-late-2020-ahead-of-budget-13468366",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-jobcentre-job-centre_6757997.jpg?20241125213751",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-11-11 05:28:00",
        "Headline": "The chancellor's critics accuse her of killing jobs through her £25bn tax raid on employers in last year's budget - and urge Rachel Reeves to U-turn in two weeks' time.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The UK's jobless rate has risen to a level not seen since late 2020, according to official figures released ahead of the budget. The Office for National Statistics (ONS) reported a figure of 5% covering the three months to September - up from 4.8% reported last month. It was a larger leap than economists had predicted, and the ONS said men were worst affected by the shift. It leaves the jobless rate at its highest level since December 2020-February 2021. It had stood at 4.1% when Labour took office last year. Money latest: How private pensions are treated in divorce There was no better news for Chancellor Rachel Reeves in wider, experimental, HMRC data released by the ONS, which showed a 32,000 decline in payrolled employment during October. That suggested a pause to a more recent trend of declines slowing since sharp falls first witnessed in the spring of this year. \n                  Starmer hints two-child benefit cap will be scrapped at budget\n                 \n                  Chancellor's own goals have exacerbated budget challenges\n                 \n                  Will Rachel Reeves repeat Denis Healey's 1975 horror budget?\n                 It was April when measures introduced in Ms Reeves's first budget came into effect, with hikes in minimum pay and employer national insurance contributions hammering employment and investment sentiment in the private sector. It also coincided with peak US trade war uncertainty as Donald Trump ramped up his tariffs.  ONS director of economic statistics Liz McKeown said of the data: \"Taken together, these figures point to a weakening labour market. \"The number of people on payroll is falling, with revised tax data now showing falls in most of the last 12 months. \"Meanwhile, the unemployment rate is up in the latest quarter to a post-pandemic high. The number of job vacancies, however, remains broadly unchanged. \"Wage growth in the private sector slowed further, but we continue to see stronger public sector pay growth, reflecting some pay rises being awarded earlier than they were last year.\" The rate of private sector wage growth stood at 4.2% compared to 6.6% for the public sector. In good news, the overall slowing in the pace of wage growth and weakening jobs market should help bolster the case for an interest rate cut by the Bank of England next month, assuming inflationary pressures continue to ease after last week's rate hold. The ONS figures were released as the clock ticks down to the chancellor's second budget due on 26 November.  Ms Reeves used an event in Downing Street last week to prepare the ground for a painful series of measures that are expected to be only partly offset by some announcements to keep Labour MPs onside, as she stares down a black hole in the public finances believed to be in the region of £30bn. She has signalled a break from Labour's manifesto tax pledge not to raise income tax, national insurance or VAT, on the grounds that the world has changed since that promise was made. The chancellor's gripes include Brexit and the effects of the US trade war. Nevertheless, a spending priority would appear to be the lifting of the two-child benefit cap. That would take an estimated 350,000 children out of poverty, according to the Child Poverty Action Group. Read more:Chancellor's own goals have exacerbated budget challengesStarmer hints two-child benefit cap to be axed in budgetWill Reeves repeat Denis Healey's 1975 horror budget? Liberal Democrat Treasury spokesperson, Daisy Cooper, said of the employment data: \"Surely the writing is on the wall now for the chancellor's jobs tax. \"Everyone except Rachel Reeves seems to have woken up to the fact that forcing small businesses to pay more in tax for giving people jobs would damage job opportunities. Now the proof is staring her in the face. \"The government must reverse their damaging national insurance hike at the budget, and commit to saving the small businesses who employ millions in Britain and are at risk of collapse, if they're to have any hope of reversing today's concerning trend.\" The Conservatives accused Ms Reeves of presiding over a \"high-tax, anti-business\" agenda. Secretary of State for Work and Pensions, Pat McFadden, said: \"Over 329,000 more people have moved into work this year already, but today's figures are exactly why we're stepping up our plan to Get Britain Working. \"We've introduced the most ambitious employment reforms in a generation to modernise jobcentres, expand youth hubs and tackle ill-health through stronger partnerships with employers. \"And this week we're going further by launching an independent investigation that will bolster our drive to ensure all young people are earning or learning. \"We're backing businesses to grow and create jobs by cutting red tape, signing trade deals and securing hundreds of billions in investment, which helped make the UK the fastest growing economy in the G7 in the first half of this year.\""
    },
    {
        "title": "Former Petrofac chief seeks £40m for offshore wind group Venterra",
        "description": "The former chief executive of Petrofac, the oilfield services group which collapsed last month, is in talks to raise tens of millions of pounds for the offshore wind energy group he set up four years ago.",
        "url": "https://news.sky.com/story/former-petrofac-chief-seeks-16340m-for-offshore-wind-group-venterra-13468630",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-petrofac-wind_7079282.jpg?20251111150516",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-11 15:03:00",
        "Headline": "Venterra, which is backed by private equity firms General Atlantic and First Reserve and run by Ayman Asfari, is in talks to raise new equity amid a slowdown in renewable energy investment, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The former chief executive of Petrofac, the oilfield services group which collapsed last month, is in talks to raise tens of millions of pounds for the offshore wind energy group he set up four years ago. Sky News has learnt that Venterra Group, which was established in 2021 by Ayman Asfari, is seeking £40m from investors amid the challenging climate sweeping through swathes of the renewable energy sector. Venterra has already raised a total of £250m in equity since it was set up, including a substantial sum from Beyond Net Zero, a fund affiliated with the private equity firm General Atlantic. Lord Browne, the former BP chief executive, sits on Venterra's board as a non-executive director representing the Beyond Net Zero investment. Both the General Atlantic fund and First Reserve, another private equity investor in Venterra, both planned to invest as part of the latest fundraising. While offshore wind remains an important element of the global energy transition, the shifting investment priorities in part precipitated by Donald Trump's second term as US President have resulted in slower growth than anticipated for companies such as Venterra. A source close to the company said the failure of several auction rounds across the European renewables industry, and ongoing political uncertainty in the US and UK, had contributed to turbulence in the offshore wind market. \n                  Unemployment rate jumps to highest level since late 2020 ahead of budget\n                 \n                  Chancellor's own goals have exacerbated budget challenges\n                 \n                  Competition watchdog hit by further board departures\n                 Mr Asfari has been a prominent figure in the UK energy services sector for years, stepped down as Petrofac chief in 2023. The company agreed to pay tens of millions of pounds the previous year after failing to prevent former employees from offering or paying bribes to secure contracts in the Middle East between 2012 and 2015. Venterra did not respond to emailed enquiries from Sky News."
    },
    {
        "title": "Chancellor's own goals have exacerbated budget challenges",
        "description": "There are more people looking for fewer jobs in Britain today than there were a year ago.",
        "url": "https://news.sky.com/story/chancellors-own-goals-have-exacerbated-budget-challenges-13468526",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reeves-money-gfx-budget_6965910.png?20250716092001",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-11-11 11:38:00",
        "Headline": "Sky's Gurpreet Narwan says a further tax-raising budget risks choking off the growth Rachel Reeves so desperately needs after a series of mistakes first time round that have cost jobs among the very working people she wants to protect.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n There are more people looking for fewer jobs in Britain today than there were a year ago. That is the bleak record the chancellor will have to defend as she prepares for her budget in two weeks' time. The Treasury has not yet responded to the latest labour market figures, which contain very few silver linings. The unemployment rate hit 5%, rising faster than economists were expecting. Vacancies have fallen over the past year and, while economic inactivity has fallen over the past year, it remains high by historic standards. Money latest: New bank switch offer 'blows competition out of the water' When things take a wrong turn in the economy, governments are first in line for the blame - sometimes unfairly. In this case, however, the role of government policy is clear. Within a few months of coming to power, Rachel Reeves launched a big tax raid on businesses to support the public finances. The centrepiece was a £25bn increase in employers' national insurance contribution and an increase in the national living wage. At the time, employers in some of the most exposed sectors, like retail and hospitality, warned they would have to pass on costs to consumers and cut the size of their workforce, placing upwards pressure on inflation and unemployment. Sainsburys and M&S said prices would rise, while business surveys repeatedly pointed to a slowdown in hiring.  The Treasury was prepared to call their bluff. Some in the department thought that businesses would absorb the costs, eating into their profits before passing on costs in competitive, price sensitive sectors like retail and hospitality. That hasn't been borne out by the data. Not only has food price inflation increased but the jobs market has also suffered. Andrew Bailey, the governor of the Bank of England, last week said it was the jobs market where the main consequences were being felt.  Employers are not hiring new workers and they are not replacing those that have left. Payroll data, collated by HMRC, shows 180,000 jobs disappeared from company payrolls over the past year and 40% of them were in the retail and wholesale sectors. Read more:Starmer hints two-child benefit cap to be axed in budgetWill Reeves repeat Denis Healey's 1975 horror budget? The people doing those jobs won't be paying income tax or national insurance. A weakened tax base makes the job even more difficult for a chancellor who is looking for new ways to raise money. Then there are the 9.1 million people who are not even looking for work - the so-called economically inactive - many of them drawing on out of work benefits. The chancellor has repeatedly told us growth is the only way out of an endless cycle of tax rises or tax cuts but there is no point in talking about economic growth while jobs creation goes backwards. With more tax rises on the horizon, the challenge will be in calibrating policy so that tax rises don't harm the growth agenda. She will have to do better this time round."
    },
    {
        "title": "Competition watchdog hit by further board departures",
        "description": "The UK competition regulator has been hit by another spate of boardroom exits less than a year after its chair was forced out by ministers as part of their efforts to spur economic growth.",
        "url": "https://news.sky.com/story/competition-watchdog-hit-by-further-board-departures-13468635",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-cma-dharmash-mistry_7079320.jpg?20251111153039",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-11 15:12:00",
        "Headline": "Dharmash Mistry and Cynthia Dubin stepped down from the CMA board months after its chairman was forced out by ministers as part of their efforts to kickstart the economy, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The UK competition regulator has been hit by another spate of boardroom exits less than a year after its chair was forced out by ministers as part of their efforts to spur economic growth. Sky News has learnt that Dharmash Mistry, a technology industry veteran, and Cynthia Dubin, who has decades of experience in energy and industrials companies, both resigned from the Competition and Markets Authority (CMA) board in the last few months. Neither departure was formally announced by the watchdog, with Mr Mistry only having joined its board 18 months earlier. Their exits - which were only apparent by the omission of their names from a current list of CMA directors - came months after Marcus Bokkerink was ousted as the regulator's chairman by Rachel Reeves, the chancellor, and Jonathan Reynolds, the then business secretary. He was replaced on an interim basis by Doug Gurr, the former Amazon UK boss who is now expected to take the job for a longer-term stint. One source claimed that concerns about government interference in the CMA's work may have been a factor in at least one of the resignations - a suggestion denied on Tuesday by both the CMA and the Department for Business and Trade. Neither Mr Mistry nor Ms Dubin, who had served on the board for about six years, could be reached for comment. \n                  UK's biggest housebuilders to pay record sum after CMA investigation into sensitive information-sharing\n                 \n                  Topps Tiles' purchase of rival CTD could bring up prices and make service worse - CMA\n                 \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \"We thank Dharmash and Cynthia for their work with the CMA,\" a DBT spokesperson said, adding that it did \"not recognise\" the suggestion that either had been concerned about political interference. \"We remain committed to the CMA's independence and want to see regulators supercharge the economy with pro-business decisions that will drive prosperity and growth, and we look forward to continue to work with Sarah Cardell, Doug Gurr and the board to deliver on this ambition.\" Read more from Sky News:Unemployment rate jumps to highest level since 2020Chancellor's own goals have exacerbated budget challenges A CMA spokesperson said: \"Both former board members left due to other commitments and it is inaccurate to suggest otherwise. \"The CMA continues to take its decisions independently of government.\""
    },
    {
        "title": "Warren Buffett says he will be 'going quiet' as he sends farewell letter as Berkshire Hathaway CEO",
        "description": "Legendary investor Warren Buffett has said he will be \"going quiet\" as he sent the last of his famous shareholder letters as chief executive.",
        "url": "https://news.sky.com/story/warren-buffett-says-he-will-be-going-quiet-as-he-sends-farewell-letter-as-berkshire-hathaway-ceo-13468485",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-warren-buffett-buffett_7078973.jpg?20251111104514",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-11 10:25:00",
        "Headline": "Buffett confirms he will remain a major shareholder until Berkshire Hathaway investors develop \"comfort\" with Greg Abel's leadership.",
        "Content": "Legendary investor Warren Buffett has said he will be \"going quiet\" as he sent the last of his famous shareholder letters as chief executive. The 95-year-old \"Oracle of Omaha\" also threw his weight behind incoming boss Greg Abel and said he had \"more than met\" his high expectations. Shares in Buffett's $1trn company, Berkshire Hathaway, have dipped over the past six months - despite US markets rising - as his days as chief executive tick down. But in Monday's letter to shareholders, the world's 10th richest person downplayed concerns that the halo effect dubbed the \"Buffett premium\" was ebbing away. He said Abel had \"more than met\" his expectations and it was just a case of the 63-year-old needing time to get investors' confidence. \"I can't think of a CEO, a management consultant, an academic, a member of government - you name it - that I would select over Greg to handle your savings and mine,\" Buffett wrote. \"He is a great manager, a tireless worker and an honest communicator. Wish him an extended tenure.\" Buffett revealed in May that he was stepping down at the end of 2025 and the US company's board approved Abel as his replacement. He has an extremely tough act to follow; Buffett has been at the helm for six decades after turning a failing textile firm into a behemoth that owns more than 60 companies and has stakes in many more. Buffett will stay on as chairman and confirmed on Monday he would also remain a major shareholder until investors develop \"comfort\" with Abel's leadership. However, he said the days of him holding court at the shareholders' meeting and writing the introduction to the annual report were over. \"As the British would say, I'm 'going quiet',\" Buffett wrote. Read more from Sky News:At least 12 killed after suicide bombing in PakistanEnd to longest US government shutdown one step closer With less than two months left, the investing icon admitted he moved \"slowly and read with increasing difficulty\", but said he was generally feeling good and was still at the office five days a week. He also revealed he was accelerating his charitable donations and giving another $1.3bn in Berkshire Hathaway shares to four family-run foundations. Buffett is believed to have donated more than $60bn over the years and is signed up to Bill Gates's Giving Pledge to donate 99% of his wealth - currently estimated at $148bn by Forbes. When he dies, his children will have about a decade to give away most of his remaining billions."
    },
    {
        "title": "Sam Fender gives £25,000 Mercury Prize to support smaller venues",
        "description": "Sam Fender has donated his entire &#163;25,000 Mercury Prize winnings to support \"struggling\" grassroots venues.",
        "url": "https://news.sky.com/story/sam-fender-gives-16325000-mercury-prize-to-support-smaller-venues-13468451",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sam-fender-mercury-prize_7078910.jpg?20251111093426",
        "type": "Business",
        "Author": "Gemma Peplow",
        "Date Published": "2025-11-11 09:19:00",
        "Headline": "The singer-songwriter was named the winner of this year's Mercury Prize at a ceremony in his hometown of Newcastle, for his third album, People Watching.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sam Fender has donated his entire £25,000 Mercury Prize winnings to support \"struggling\" grassroots venues. The singer-songwriter, from North Shields, said he wanted to show support for the Music Venue Trust and smaller venues, which provided a vital platform for him when he was starting out. Fender was named the winner of this year's Mercury Prize at a ceremony in his home city of Newcastle - the first time the event had ever been held outside London - in October, for his critically acclaimed third album, People Watching. \"I wouldn't be doing what I am doing today if it wasn't for all the gigs I played around the North East, and beyond, when I was starting out,\" the 31-year-old said. \"These venues are legendary, but they are struggling.\" The Music Venue Trust, which represents hundreds of the UK's grassroots venues, says they operated on a profit margin of just 0.48% in 2024, with more than one in four reporting a loss. Fender previously helped to raise more than £100,000, which went to support 38 smaller venues across England, Scotland and Wales, through his 2024 arena tour. Other artists, including Katy Perry, Coldplay, Pulp and Enter Shikari, have also adopted the grassroots levy, adding small amounts to ticket prices to donate to the sector. Larger venues such as the Royal Albert Hall in London have also introduced the levy. Since 2023, more than 150 smaller venues have been forced to close due to rising costs and the ongoing effects of the pandemic, according to the trust. Mark Davyd, the charity's founder and chief executive, said Fender donating the Mercury Prize winnings was \"an incredible gesture\", showing that artists \"absolutely understand how vital grassroots music venues are to their careers and to their communities\". He continued: \"We are honoured to accept this donation and will ensure every penny of it makes a direct difference to the campaign to keep live music at the heart of our towns and cities.\" Read more:Kendrick Lamar leads Grammy nodsCulture workouts - the key to better health? Fender beat artists including Fontaines DC, FKA Twigs and previous winners Pulp and Wolf Alice to pick up this year's Mercury Prize. His second album, Seventeen Going Under, was also nominated in 2022, when the award was won by Little Simz. Judges said People Watching felt \"like a classic album, one that will take pride of place in record collections for years to come\"."
    },
    {
        "title": "End to longest US government shutdown one step closer - as Democrats face backlash ",
        "description": "An end to the longest US government shutdown in history is one step closer after Senate Democrats broke with their party to strike a deal with the Republicans.",
        "url": "https://news.sky.com/story/end-to-longest-us-government-shutdown-one-step-closer-as-democrats-face-backlash-13468347",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-us-shutdown_7037800.jpg?20251001010711",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-11-11 00:01:00",
        "Headline": "The shutdown began on 1 October - with 670,000 federal government employees furloughed or left with no choice but to work without pay. More than 40 million Americans have also had to go without food aid.",
        "Content": " An end to the longest US government shutdown in history is one step closer after Senate Democrats broke with their party to strike a deal with the Republicans. Senators backed by 60 votes to 40 legislation to end the impasse, though it still needs approval from the House of Representatives - and sign-off by President Donald Trump. He has indicated he is happy with the agreement, though, which would restore funding for federal agencies that have gone without since 1 October. It would also prevent any further layoffs until 30 January, but does not satisfy Democrat demands regarding health care insurance for millions of Americans. Health care was at the heart of the dispute that led to the shutdown. The Democrats had refused to support a Republican budget plan unless tax credits that made medical insurance cheaper for millions of people were renewed. The willingness of eight moderate Democrats to break the Senate deadlock without that guarantee has provoked fury among many in the party. Some are now calling on Senate Minority Chuck Schumer to be replaced because he is \"no longer effective\". California Governor Gavin Newsom - regarded as a contender for the 2028 Democratic presidential nomination - said: \"Pathetic. This isn't a deal. It's surrender.\" Read more US news:Trump threatens to sue BBC for $1bnGhislaine Maxwell's emails from jail leaked  On Monday morning, Republican Senate Majority Leader John Thune had urged politicians to work together to break a stalemate that had lasted for more than 40 days. He said: \"The American people have suffered for long enough. Let's not pointlessly drag this bill out.\" The shutdown began on 1 October - with 670,000 federal government employees furloughed or left with no choice but to work without pay. SNAP, a food aid programme used by 42 million Americans, has been frozen - with thousands of flights cancelled at dozens of major airports. Mr Trump has told air traffic controllers to get back to work, threatening anyone who doesn't with \"docked\" pay. The funding package now heading to the House of Representatives only lasts through to 30 January, making it a relatively short-term solution that will require further negotiation."
    },
    {
        "title": "Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash",
        "description": "Sir Keir Starmer is vowing to fight any challenge to his leadership rather than stand aside, amid claims of plotting by MPs being compared to TV's The Traitors.",
        "url": "https://news.sky.com/story/starmer-vows-to-fight-any-plot-to-oust-him-as-labour-mps-fear-budget-backlash-13468869",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-prime_7079697.jpg?20251111230605",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-11-11 22:52:00",
        "Headline": "Whispers in Westminster hint at a plot brewing behind-closed-doors to oust the prime minister. A tale of loyalty, deception, and banishments? Sounds somewhat familiar…",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Sir Keir Starmer is vowing to fight any challenge to his leadership rather than stand aside, amid claims of plotting by MPs being compared to TV's The Traitors. Number 10 is going on the attack ahead of a difficult budget this month, with fears it could prove so unpopular that Labour MPs may move against Sir Keir. But Sky News political editor Beth Rigby reports the prime minister \"has no intention of giving way\", with allies warning any challenge would lead to a \"drawn-out leadership election, spook the markets, and create more chaos that further damages the Labour brand\". One senior figure told Rigby any move against Sir Keir would be more likely to arrive after next May's elections, rather than the budget. They said many Labour MPs could probably get behind measures like tax rises for wealthier workers, pensioners and landlords, as well as scrapping the two-child benefit cap, if that's what the chancellor announces on 26 November. But there are a series of potentially damaging elections in May, including in London and for the Senedd in Wales, as Labour face a challenge from Reform UK on the right and parties like the Greens and Plaid Cymru on the left. Rigby said there is a \"settled view among some very senior figures in the party that Starmer lacks the charisma and communication skills to take on Nigel Farage and win over the public, particularly if or when he breaks a bunch of manifesto pledges\". Sir Keir and Rachel Reeves have refused to rule out breaking their manifesto promises not to raise income tax, national insurance, or VAT at the budget. The Number 10 operation to ward off a challenge comes after Sky News deputy political editor Sam Coates likened the febrile mood in the Labour high command to the TV hit The Traitors. Speaking on the Politics At Sam And Anne's podcast, he said: \"A minister got in touch at the start of the weekend to say they believe that there's some quite substantial plotting going on. \"They say there was at least one cabinet minister telling colleagues that Keir Starmer, and I quote, is finished.\" Chief political correspondent When Boris Johnson was facing mutiny from Conservative MPs, his allies launched \"Operation Save Big Dog\".\n When Margaret Thatcher was about to be ousted by her rebellious MPs in 1990, she declared: \"I fight on, I fight to win.\"\n And Harold Wilson, constantly paranoid about plots, famously quipped in 1969: \"I know what's going on. I'm going on.\" Boris Johnson was ousted less than six months after \"Operation Save Big Dog\", Margaret Thatcher resigned the following morning after saying \"I fight on\", and Harold Wilson lost a general election to Edward Heath a year after vowing that he would go on. Just saying. Read more:What tax rises will Reeves announce? Coates said the cabinet minister \"absolutely and totally denies they are up to anything nefarious whatsoever\". \"I actually do think that this is all in the style of The Traitors, because I'm not sure that there is hard and fast evidence of plotting - there might be some hints from some quarters,\" he added. \"But what seems to be completely logical is that if you're a bit worried in Number 10, you're trying to pitch roll and ward off people who are maybe thinking about the need to position themselves by starting to get out rumours of plots and hoping that the political system turns against them for disloyalty.\" Cloak-and-dagger Reports emerged on Tuesday night in The Times, The Guardian, and from the BBC of a \"bunker mode\" in Number 10, \"regime change\", and \"plotting\" to replace Sir Keir. Responding to the reports, Health Secretary Wes Streeting denied he was seeking to oust the prime minister. A spokesperson for Mr Streeting told Sky News: \"These claims are categorically untrue. \"Wes's focus has entirely been on cutting waiting lists for the first time in 15 years, recruiting 2,500 more GPs and rebuilding the NHS that saved his life.\" However, there is clearly a co-coordinated campaign by allies of the increasingly unpopular Sir Keir to try to prevent a leadership challenge by a cabinet minister or stalking horse. Sir Keir's biographer Tom Baldwin questioned the logic of those briefing from within the corridors of power. \"I'm at a loss to understand why anyone would think this sort of briefing will help Keir Starmer, the government, or even their own cause,\" he said on social media. \"Some people just can't resist, I guess, but it's all a bit nuts.\" What next? It comes ahead of Prime Minister's Questions this lunchtime, handing Tory leader Kemi Badenoch the chance to make it an awkward afternoon for Sir Keir. The health secretary will start his day on Sky News' Morning With Ridge And Frost and will then speak at an NHS providers' conference. Watch and follow live coverage across Sky News - including in the Politics Hub."
    },
    {
        "title": "New law could help tackle AI-generated child abuse at source, says watchdog",
        "description": "Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law.",
        "url": "https://news.sky.com/story/new-law-could-help-tackle-ai-generated-child-abuse-at-source-says-watchdog-13468757",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ai-csam-iwf_7079537.jpg?20251111192512",
        "type": "Politics",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-11 19:22:00",
        "Headline": "The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images.",
        "Content": "\n          Science and technology reporter\n       Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law. Organisations like the Internet Watch Foundation (IWF), as well as AI developers themselves, will be able to test the ability of AI models to create such content without breaking the law. That would mean they could tackle the problem at the source, rather than having to wait for illegal content to appear before they deal with it, according to Kerry Smith, chief executive of the IWF. The IWF deals with child abuse images online, removing hundreds of thousands every year. Ms Smith called the proposed law a \"vital step to make sure AI products are safe before they are released\". How would the law work? The changes are due to be tabled today as an amendment to the Crime and Policing Bill. The government said designated bodies could include AI developers and child protection organisations, and it will bring in a group of experts to ensure testing is carried out \"safely and securely\". The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images. \"These new laws will ensure AI systems can be made safe at the source, preventing vulnerabilities that could put children at risk,\" said Technology Secretary Liz Kendall. \"By empowering trusted organisations to scrutinise their AI models, we are ensuring child safety is designed into AI systems, not bolted on as an afterthought.\"  AI abuse material on the rise The announcement came as new data was published by the IWF showing reports of AI-generated child sexual abuse material have more than doubled in the past year. According to the data, the severity of material has intensified over that time. The most serious category A content - images involving penetrative sexual activity, sexual activity with an animal, or sadism - has risen from 2,621 to 3,086 items, accounting for 56% of all illegal material, compared with 41% last year. Read more from Sky News:Protesters storm COP30UK stops some intel sharing with US The data showed girls have been most commonly targeted, accounting for 94% of illegal AI images in 2025. The NSPCC called for the new laws to go further and make this kind of testing compulsory for AI companies. \"It's encouraging to see new legislation that pushes the AI industry to take greater responsibility for scrutinising their models and preventing the creation of child sexual abuse material on their platforms,\" said Rani Govender, policy manager for child safety online at the charity. \"But to make a real difference for children, this cannot be optional. \"Government must ensure that there is a mandatory duty for AI developers to use this provision so that safeguarding against child sexual abuse is an essential part of product design.\""
    },
    {
        "title": "The BBC's billion dollar question",
        "description": "<a href='https://podfollow.com/politics-at-sam-and-annes' target='_blank'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>",
        "url": "https://news.sky.com/story/the-bbcs-billion-dollar-question-13468404",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-politics-sam-coates_7021320.jpg?20250915170446",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-11 07:36:00",
        "Headline": "No subtitle found",
        "Content": "👉Listen to Politics at Sam and Anne's on your podcast app👈 With US President Donald Trump threatening to sue the BBC, how likely is the broadcaster to pay out? And how have those across the political spectrum been reacting? And with 15 days until Chancellor Rachel Reeves's budget, Matthew McGregor - the chief executive of campaign group 38 Degrees and a former digital strategist for both Labour and Barack Obama - takes issue with Sam's take from yesterday and sends in a voice note. And Sam and Anne discuss the latest twist in the Your Party saga, and it's all about money."
    },
    {
        "title": "Lib Dems aim to battle for hearts beyond Middle England heartland",
        "description": "Remember the Lib Dems? They won a record 72 seats at the general election but some party figures worry they have faded into obscurity since then.",
        "url": "https://news.sky.com/story/lib-dems-aim-to-battle-for-hearts-beyond-middle-england-heartland-13468772",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ed-davey-lib-dems-liberal-democrats_7079690.jpg?20251111225038",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-11-11 19:37:00",
        "Headline": "Two candidates are vying to be the Liberal Democrats' next president. Both want to branch out beyond the party's southern base, but they have different plans for doing so. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Remember the Lib Dems? They won a record 72 seats at the general election but some party figures worry they have faded into obscurity since then. Josh Babarinde wants to change that. The MP for Eastbourne is vying to be their next president, a role that will give him a key say in implementing strategy if he wins. Politics Live: Government to reconsider whether to give compensation to Waspi women Central to his pitch to members is being a \"megaphone president\" who can challenge Nigel Farage on the airwaves and connect with more voters. \"The plan if I win is to make sure that the Liberal Democrats are the last line of defence against the populism that's sweeping our country,\" he told Sky News. \"Reform, they're dividing our communities and they are stirring all sorts of division. The two main parties are all too often fuelling rather than fighting that and it's for the Liberal Democrat to stand against that.\" If that sounds familiar, then cast your mind back to a recent party election - Labour's deputy leadership one. Lucy Powell, in a similar strategic role, said in her victory speech that her party needed to \"wrestle back\" the political megaphone from Farage. \n                  Starmer vows to fight any plots to oust him - as Labour MPs fear major budget backlash\n                 \n                  New law could help tackle AI-generated child abuse at source, says watchdog\n                 \n                  The BBC's billion dollar question\n                 But if anyone is doing that at the moment it's the Green Party, which is surging in the polls and has doubled its membership in the two months since media-savvy Zack Polanski became leader.    Mr Babarinde insists he is fully behind the Lib Dems' leadership. However, it's clear he wants to do things differently in order to cut through.  He went bungee jumping with Sir Ed Davey during the election campaign and has no plans to do that \"for political purposes or any purpose again\". \"The stunts can be a really effective means of capturing attention. We've also got to make sure that our pitch captures attention, that our policies capture attention, that our means of engaging with people captures attention.\" Battle for the youth vote  For Mr Babarinde, that starts with engaging with 12- and 13-year-olds who, by the next general election, will be voting for the first time, after Sir Keir Starmer lowered the voting age. The former youth worker said these young people \"can't be left to the online right\" and he can use his national platform as an MP to connect with them. \"We definitely need to up our social media strategy. That means TikTok, that means Instagram, that means Snapchat, and making sure that we're conveying our messages in the places where they hang out. \"But we also need to do much better when it comes to political education. All parties need to be better getting into schools, for example.\" It's not just the youth vote he is after either. He said there is \"absolutely\" more that can be done to tackle fed up Labour voters and that \"nowhere should be off limits\". \"There is lots of opportunity to speak to former Labour voters and say, look, the Liberal Democrats have listened, we have solutions. \"It's really important that we reach out to people across the whole country, beyond the Conservative heartlands. It's really important to me to diversify our party.\" On that, his opponent Prue Bray agrees. The Wokingham councillor, who has been active within the party for 30 years, wants to change the perception of the Lib Dems as a party that is \"for middle class people\". For her that is not about making headlines, but being active in communities where they don't currently have a large voter base - particularly the north of England. She told Sky News: \"After Brexit we recruited a lot of people and as that has declined in people's minds they have stopped being members, so we need to attract more people. \"People feel let down by the Conservatives and we don't want them to turn to Reform so we need to be more visible in their communities.\" Canvassing is seen by many within the party as its number one strength. A recent BBC report found that while the Lib Dems membership had halved in the past five years, those that remained were more active than their counterparts in other parties. It's one of the reasons party insiders believe they did so well at smashing the Tories' blue wall, with a targeted ground campaign. But in the words of the outgoing president Dr Mark Pack, who has held the role for the past six years, \"how someone best fills the roles very much depends on the circumstances of the time\". For him, that was picking up the pieces after the Lib Dems' 2019 disaster, and for his successor it will be maintaining the momentum of the 2024 success in a new era of multi-party politics when grabbing attention matters and winning seats even more so. The two contenders have the same goals when it comes to that - but different plans for achieving it. It's up to the members to decide which one they prefer. Voting has now closed, and the result will be declared on Wednesday. "
    },
    {
        "title": "Universal credit claimants soar by over a million in a year, new figures show",
        "description": "The number of universal credit (UC) claimants has soared to 8.3 million people - up from 7.2 million at the same time last year, new government figures show.",
        "url": "https://news.sky.com/story/universal-credit-claimants-soar-by-over-a-million-in-a-year-new-figures-show-13468726",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-jobcentre-benefits_7079487.jpg?20251111181141",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-11 18:00:00",
        "Headline": "Nearly half of all universal credit claimants are not required to work, the latest statistics show.",
        "Content": "The number of universal credit (UC) claimants has soared to 8.3 million people - up from 7.2 million at the same time last year, new government figures show. That is a 1.1 million increase in the space of a year, and is the largest annual rise in total claimants since early in the COVID pandemic - the 12 months to April 2021. UC is a payment to help with living costs and is available for people in work who are on low incomes, as well as those who are out of work or cannot work. Tap here for the latest news from Westminster There has also been a sharp rise in the number of people claiming UC who have \"no work requirements\". Four million people were in this category in October, up from 2.9 million people a year ago, statistics from the Department for Work and Pensions show. Claimants in the \"no work requirements\" bracket are people in full-time education, over the state pension age, with a child aged under one, and who are considered to have no prospect of work - they make up 48.7% of all claimants. \n                  Sickness bill costs £85bn year, says new report, which warns of 'economic crisis'\n                 \n                  214,000 parents missing out on child benefit and potentially thousands\n                 \n                  Starmer defends suspending rebel MPs after backbench criticism\n                 Other claimants must do certain work-related activities to receive the UC benefit, such as attending interviews to plan for their return to work or be actively searching for work. The number of people in the searching for work category stood at 1.6 million in October, and the number of working people on UC stood at 2.2 million last month - both unchanged year-on-year. The government has previously said it \"inherited a broken welfare system and spiralling, unsustainable benefits bill\" from the Conservatives, and is working on reforms including tightening rules on who can claim UC. The new data on the huge increase in UC claimants comes on the day it was announced that the unemployment rate has risen to 5% in the three months to September - the highest rate since the pandemic in 2020.  Following a commitment to publish a breakdown of UC claimants by immigration status, which was first done in July, the DWP has published updated figures showing that the majority were British and Irish nationals and those who live or work in the UK without any immigration restrictions. They accounted for 84.3% of all UC claimants in October, up from 82.9% in October 2024 - and of these, 99.9% were UK citizens and around a third (32%) were in employment. 9.2% of claimants have EU Settled Status in the UK, which is down from 10.4% a year ago. And 2.6% were people who had indefinite leave to remain in the UK, up from 2.2% the previous year. Refugees accounted for 1.5% of UC claimants, which is unchanged from the same point last year. A DWP spokesperson said: \"The number of people receiving universal credit has been increasing as we have invited tens of thousands of people each month to move from legacy benefits as they become phased out. \"We're determined to get more people off welfare and into work. That's why we are stepping up our plan to Get Britain Working with the most ambitious employment reforms in a generation. This includes modernising jobcentres and providing tailored support through the Connect to Work programme. \"Every eligible young person who has been on universal credit for 18 months without earning or learning will also be offered guaranteed paid work through our Youth Guarantee.\""
    },
    {
        "title": "UK's Prevent counter-terrorism strategy 'is no longer keeping the country safe', commission warns ",
        "description": "The UK's Prevent counter-terrorism strategy \"is no longer keeping the country safe\" and needs a \"radical overhaul\", an independent commission has found.",
        "url": "https://news.sky.com/story/uks-prevent-counter-terrorism-strategy-is-no-longer-keeping-the-country-safe-commission-warns-13468349",
        "image_url": "https://e3.365dm.com/23/11/1920x1080/skynews-protest-london-palestine_6372596.jpg?20231125205647",
        "type": "Politics",
        "Author": "Deborah Haynes",
        "Date Published": "2025-11-11 00:11:00",
        "Headline": "\"Prevent needs a major overhaul and integration into a wider system to which all those susceptible of being drawn into violence can be referred,\" it said.",
        "Content": "\n          Security and Defence Editor\n              @haynesdeborah\n The UK's Prevent counter-terrorism strategy \"is no longer keeping the country safe\" and needs a \"radical overhaul\", an independent commission has found. It said 90% of people referred to the scheme are turned away because they have no obvious ideology, even though they can go on to commit violent crimes. In a wide-ranging report, the commission also recommended narrowing the definition of what constitutes terrorism to provide greater clarity. And it called for decisions by government to proscribe organisations to be reviewed every five years to ensure proportionality. That recommendation comes as the Home Office faces a legal challenge over its decision to ban the activist group Palestine Action.  'Not fit for purpose' Full details of the commission's findings - based on a three-year review into the UK's counter-terrorism measures - will be unveiled at the Royal United Services Institute (RUSI) think tank in London today. The starkest conclusions are about Prevent. \"The evidence we had shows that the present approach to Prevent is not fit for purpose,\" said Sir Declan Morgan, a former chief justice of Northern Ireland who chaired the commission. Underlining the failure of the scheme, Axel Rudakubana - the Southport murderer who stabbed three girls to death and attacked 10 other people at a Taylor Swift-themed dance class in July last year - had been referred to Prevent three times. But no evidence had been found of a fixed ideology, so his case was closed in 2021. The teenager committed the atrocity three years later.  \"The Independent Commission on Counter-Terrorism says that Britain's counter-terrorism strategy is no longer keeping the country safe,\" according to an executive summary of the report. \"It calls for a radical overhaul of Prevent to make it part of a broader initiative dealing with violence and no longer based on a flawed radicalisation model.\" A changed terror threat The commission found there is no evidence that radicalisation is a predictor of whether a person will become a terrorist. It said terrorist threats in the UK have morphed from plots by groups such as al Qaeda or Islamic State to \"self-initiated\" individuals with \"complex, mixed, unclear or unstable ideologies\". As a result, there has been a surge in referrals to the counter-terrorism scheme. \"This risks overwhelming Prevent and missing individuals being drawn into terrorism,\" the report warned. It said more than 58,000 people have been referred to Prevent since 2015, but more than 90% had no counter-terrorism concerns. The other 10% showed no evidence of criminal activity. Read more:Highest-ever number of referrals to PreventWhy is anti-terrorism programme controversial?  The commission also said the majority of referrals are children and young people, even though they only comprise 21% of the population. \"Prevent needs a major overhaul and integration into a wider system to which all those susceptible of being drawn into violence can be referred,\" it said. The commission described this as a \"single access point\" that would be the first port of call for concerns about the susceptibility of individuals to being drawn into violence. Those at risk of involvement in terrorist violence would then be passed to Prevent, while others would be dealt with by different agencies. On tightening the definition of terrorism, the commission recommended what it called a more focused statutory definition. \"Terrorism should be defined narrowly as acts intended to coerce, compel, or subvert government or public institutions, and the threshold for property damage should apply only to conduct causing serious risk to life, national security, or public safety, or involving arson, explosives, or firearms methods inherently capable of causing unpredictable harm,\" it said. Sir Declan said: \"Our narrower definition provides greater clarity while ensuring the government can tackle terrorism effectively.\""
    },
    {
        "title": "Starmer hints two-child benefit cap will be scrapped at budget",
        "description": "Sir Keir Starmer has strongly hinted the two-child benefit cap will be scrapped at the budget - after the chancellor did the same.",
        "url": "https://news.sky.com/story/starmer-hints-two-child-benefit-cap-will-be-scrapped-at-budget-13468521",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-rachel-reeves-sir-keir-starmer_6957623.jpg?20250705095908",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-11 12:10:00",
        "Headline": "Rachel Reeves also signalled she will be lifting the cap, which means families can only claim child benefits for their first two children.",
        "Content": "Sir Keir Starmer has strongly hinted the two-child benefit cap will be scrapped at the budget - after the chancellor did the same. Asked if he would be getting rid of the cap, the prime minister told ITV: \"We won't have to wait much longer, but I wouldn't be telling you that we're going to drive down child poverty if I wasn't clear that we will be taking a number of measures in order to do so.\" Politics latest: Unemployment rate jumps to highest level since late 2020 On Monday, Chancellor Rachel Reeves also signalled she will lift the cap, which currently means families cannot claim child benefits for more than their first two children. \"I don't think that it's right that a child is penalised because they are in a bigger family, through no fault of their own,\" she told the BBC. \"So we will take action on child poverty.\"  Ms Reeves also mentioned she had spoken to former Labour PM and chancellor Gordon Brown on Sunday and Monday. \n                  Chancellor's own goals have exacerbated budget challenges\n                 \n                  Unemployment rate jumps to highest level since late 2020 ahead of budget\n                 \n                  Will Rachel Reeves repeat Denis Healey's 1975 horror budget?\n                 He told Sky News on Monday morning he is \"confident\" the two-child benefit cap will change at the budget. Mr Brown, who has long campaigned to get it lifted, said: \"I am confident that the two-child rule will be addressed. \"We're waiting for Rachel Reeves's budget, which I think will mention this. \"Keir Starmer, I know is personally concerned and interested in this. \"So I'm hopeful that in the next few weeks we'll see the kind of action that we've been talking about.\"  The current Labour government has had a difficult relationship with the policy, with the PM suspending seven of his MPs two weeks after winning the election for voting against the government to lift the cap. Lifting it will cost £2.8bn, something ministers have had to grapple with as they try to plug a growing economic black hole. Ms Reeves also mentioned Mr Brown is one of her political heroes because he did so much to lift children out of poverty, and said it was the reason she went into politics."
    },
    {
        "title": "New law could help tackle AI-generated child abuse at source, says watchdog",
        "description": "Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law.",
        "url": "https://news.sky.com/story/new-law-could-help-tackle-ai-generated-child-abuse-at-source-says-watchdog-13468757",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-ai-csam-iwf_7079537.jpg?20251111192512",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-11-11 19:22:00",
        "Headline": "The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images.",
        "Content": "\n          Science and technology reporter\n       Groups tackling AI-generated child sexual abuse material could be given more powers to protect children online under a proposed new law. Organisations like the Internet Watch Foundation (IWF), as well as AI developers themselves, will be able to test the ability of AI models to create such content without breaking the law. That would mean they could tackle the problem at the source, rather than having to wait for illegal content to appear before they deal with it, according to Kerry Smith, chief executive of the IWF. The IWF deals with child abuse images online, removing hundreds of thousands every year. Ms Smith called the proposed law a \"vital step to make sure AI products are safe before they are released\". How would the law work? The changes are due to be tabled today as an amendment to the Crime and Policing Bill. The government said designated bodies could include AI developers and child protection organisations, and it will bring in a group of experts to ensure testing is carried out \"safely and securely\". The new rules would also mean AI models can be checked to make sure they don't produce extreme pornography or non-consensual intimate images. \"These new laws will ensure AI systems can be made safe at the source, preventing vulnerabilities that could put children at risk,\" said Technology Secretary Liz Kendall. \"By empowering trusted organisations to scrutinise their AI models, we are ensuring child safety is designed into AI systems, not bolted on as an afterthought.\"  AI abuse material on the rise The announcement came as new data was published by the IWF showing reports of AI-generated child sexual abuse material have more than doubled in the past year. According to the data, the severity of material has intensified over that time. The most serious category A content - images involving penetrative sexual activity, sexual activity with an animal, or sadism - has risen from 2,621 to 3,086 items, accounting for 56% of all illegal material, compared with 41% last year. Read more from Sky News:Protesters storm COP30UK stops some intel sharing with US The data showed girls have been most commonly targeted, accounting for 94% of illegal AI images in 2025. The NSPCC called for the new laws to go further and make this kind of testing compulsory for AI companies. \"It's encouraging to see new legislation that pushes the AI industry to take greater responsibility for scrutinising their models and preventing the creation of child sexual abuse material on their platforms,\" said Rani Govender, policy manager for child safety online at the charity. \"But to make a real difference for children, this cannot be optional. \"Government must ensure that there is a mandatory duty for AI developers to use this provision so that safeguarding against child sexual abuse is an essential part of product design.\""
    },
    {
        "title": "California governor Gavin Newsom accuses Donald Trump of 'abdicating responsibility' over green energy at COP30",
        "description": "A possible Democratic contender for the White House says he's at the COP summit with an \"open hand not a closed fist\" - as he vowed not to let China dominate the green space.",
        "url": "https://news.sky.com/story/california-governor-gavin-newsom-accuses-donald-trump-of-abdicating-responsibility-over-green-energy-at-cop30-13468725",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-gavin-newsom-cop30_7079561.jpg?20251111195426",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-11-11 18:04:00",
        "Headline": "The Republican president has ignored the meeting of tens of thousands of people at the COP30 climate talks in Brazil, leaving the stage wide open for Democrats to swoop in and lob criticism from afar.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  A possible Democratic contender for the White House says he's at the COP summit with an \"open hand not a closed fist\" - as he vowed not to let China dominate the green space. California Governor Gavin Newsom has for months been teasing a bid for the next presidential election in 2028. Sky News asked him at COP30 in Brazil if he was using it to drum up support for his campaign. \"I'm here in the absence of leadership from Donald Trump, who's abdicated responsibility on a critical issue,\" he said. The Republican president has ignored the meeting of tens of thousands of people in Belem, leaving the stage wide open for Democrats to swoop in and lob criticism from afar. Mr Newsom is a longstanding political foe of US President Donald Trump - they trade insults like \"Gavin Newscum\" and \"The Nodfather\". He added the switch to green energy is about \"more than electric power\". \n                  Dozens of protesters storm COP30 venue in Brazil\n                 \n                  COP30: Climate summit kicks off with plea to work together - despite Trump-shaped hole\n                 \n                  COP30: Trump urged to involve US in the fight against climate change\n                 \"It's about economic power,\" Mr Newsom said, \"and I'm not going to cede America's economic leadership to China.\" When he took office this year, Donald Trump cancelled clean energy projects and subsidies. Meanwhile China is making eight in ten of the world's solar panels and seven in ten electric vehicles - while also producing more coal than any other country.  The US president is fighting back for the domestic oil and gas industry by trying to sell more of it abroad. But in doing so he has given China more room to dominate green markets, Democrats say. The US and China have been locked in tariff threats and trade wars this year. Read more:Trump urged to involve US in the fight against climate changeCOP30 kicks off with plea to work together - despite Trump-shaped holeWhy US may soon have a real energy emergencyWhat is COP30? 'Open hand, not a closed fist' Mr Newsom said at another event at COP30 today California was going to \"lean in\" and \"compete in this space\". \"But we can't do that without all of you... So we're here with an open hand, not a closed fist.\" Democrats have been pounding the hot and humid hallways in Amazonian Belem to tout California's \"climate leadership\". The state doesn't have any formal say in these inter-governmental negotiations. But as the fourth-largest economy in the world, it does wield influence in energy markets.  California gets two thirds of its electricity from renewables, but also still imports 300,000 barrels of oil a year, the second-biggest provider of which is the country hosting the climate summit, Brazil. Republican states were also faster to roll out renewable power than Democrats. Sky News put that to California senator Josh Becker yesterday, also here on a PR exercise for the state. Mr Becker said the fact that Republican Texas had rolled out more solar and wind than California was \"a good thing that shows that it's economically competitive\". \"It's actually cheaper. That's really why they did it,\" he said. \"Not necessarily because of climate action. And that's good news. So we're all for that.\""
    },
    {
        "title": "Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster",
        "description": "Culture Secretary Lisa Nandy has defended the BBC as a crisis initiated by an edit of a Donald Trump speech engulfs the corporation.",
        "url": "https://news.sky.com/story/culture-secretary-defends-bbc-after-leak-reveals-staffs-anger-at-tory-linked-board-member-13468765",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bbc-broadcasting-house_7079672.jpg?20251111223320",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-11 19:13:00",
        "Headline": "Lisa Nandy has defended the BBC, saying \"some in the House\" have suggested the corporation is institutionally biased, but that she disagrees as it is a \"light on the hill for people here and across the world\".",
        "Content": "Culture Secretary Lisa Nandy has defended the BBC as a crisis initiated by an edit of a Donald Trump speech engulfs the corporation. The organisation apologised on Monday after two of its top figures, including director-general Tim Davie, resigned amid concerns about impartiality - notably the editing of a Panorama documentary from October 2024. It aired the week before the US presidential election and showed an edited speech made by Mr Trump before the 2021 Capitol riot, in which he appeared to tell supporters he was going to walk there with them to \"fight like hell\". Ms Nandy has defended the BBC, saying \"some in the House\" have suggested the BBC is institutionally biased, but that she disagrees as the BBC is a \"light on the hill for people here and across the world\". \"All of us in this House should value it, uphold it and fiercely defend it,\" she added. The culture secretary said that she has been in \"regular contact\" with BBC chair Samir Shah, ensuring that where its standards were not met, \"firm, swift and transparent action follows\". \"I welcome the steps that have already been set out and I will keep the House updated as the BBC leadership grips these issues,\" she added, saying she agreed with Mr Shah that the national broadcaster has a responsibility to \"uphold the highest standards\". \n                  BBC staff seemed fed up of Tim Davie's 'nothing to see' approach\n                 \n                  Who is Sir Robbie Gibb and why are there calls to get him off BBC board?\n                 \n                  Donald Trump and his long history of lawsuits against the media\n                 Ms Nandy said a review of the BBC's Royal Charter will begin \"imminently\" and a public consultation will be launched, with more details in the \"coming weeks\". Meanwhile, Mr Trump threatened to sue the BBC for $1bn, and a letter dated 9 November from Florida lawyer Alejandro Brito outlines three demands upon the organisation to avoid being sued, with a deadline of 10pm UK time on Friday to respond. He demanded that the BBC issue a \"full and fair retraction\" of the documentary, apologise immediately, and \"appropriately compensate\" Mr Trump.  Shadow culture secretary Nigel Huddleston has demanded an apology from the BBC to Trump and to the British public. He told the House of Commons on Tuesday that the corporation is \"in a sorry mess... of its own making\" and \"needs saving from itself\". Mr Huddleston stressed that his party wants the BBC to succeed and praises its successes, but emphasised that this \"requires institutional change and far more than a few moves at the top\". The problems of the corporation relate to its failure to honour its charter obligation to impartiality, he said. In an all-staff call on Tuesday morning, the outgoing BBC director-general Mr Davie said the corporation had \"made some mistakes that have cost us\" but added he was \"proud\" and that the organisation needed to \"fight\" for its journalism. He also admitted: \"I think we did make a mistake, and there was an editorial breach, and I think some responsibility had to be taken.\"  Mr Davie, who has worked for the BBC for 20 years and been in charge for the past five, is not stepping down immediately. He said in his departure note to staff that he is \"working through exact timings with the board to allow for an orderly transition to a successor over the coming months\". There are several potential candidates who could replace him and take on the highest-profile role in British broadcasting, which effectively serves as both the corporation's chief executive and its editor-in-chief across television, radio and online. In a Q&A with Mr Davie after the all-staff call, staff were frustrated by having their questions vetted, Sky News arts and entertainment correspondent Katie Spencer reports. Some of the questions were about the controversial appointment of Sir Robbie Gibb, the former Tory director of communications for prime minister Theresa May, to the BBC board. But when these questions were getting through the vetting process, staff tried to ask questions in the reply boxes, which were public. The anonymous comments included questions like \"How can we claim to be unbiased if Gibb is on the board?\" and \"Why is Robbie Gibb still on the board?\". Read more:The man behind the leaked BBC memoTrump's legal threat letter in fullWho is Sir Robbie Gibb and why are there calls to get him off BBC board? \"I find Robbie Gibb's continued presence at the BBC to be incredibly demoralising. It feels as if he is fighting against and undermining the work we're trying to do,\" another comment read. The leaders of the Lib Dems and SNP have both called for Sir Robbie's removal. But Ms Nandy told the Commons that the government is \"unable\" to remove Sir Robbie, as \"the charter sets a strict legal threshold that must be met before dismissal of a board member\"."
    },
    {
        "title": "Sally Kirkland, famous for her Oscar-nominated roles in The Sting and Anna, dies aged 84",
        "description": "Sally Kirkland, a former model and Oscar nominated actress known for her roles in films such as Anna, The Sting and JFK has died aged 84.",
        "url": "https://news.sky.com/story/sally-kirkland-famous-for-her-oscar-nominated-roles-in-the-sting-and-anna-dies-aged-84-13468707",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sally-kirkland_7079598.jpg?20251111204219",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-11 17:14:00",
        "Headline": "The actress, who was famously comfortable with nudity, was also a fierce advocate for people with AIDS, prisoners and the homeless.",
        "Content": "Sally Kirkland, a former model and Oscar nominated actress known for her roles in films such as Anna, The Sting and JFK has died aged 84. Her representative, Michael Greene, said Kirkland died on Tuesday morning at a Palm Springs hospice. Kirkland had been unwell and struggling to cover medical bills after she fractured six bones last year and developed two life-threatening infections. She had also been diagnosed with dementia. A GoFundMePage that was set up by her friends to help pay for her ongoing treatment had raised over £45,000 ($60,000). Her biggest role was in the 1987 film Anna, as a fading Czech movie star remaking her life in the United States and mentoring a younger actor. Kirkland won a Golden Globe and earned an Oscar nomination alongside Cher in Moonstruck, Glenn Close in Fatal Attraction, Holly Hunter in Broadcast News and Meryl Streep in Ironweed. Born in New York City, Kirkland was encouraged to start modelling at age five by her mother, who was a fashion editor at Vogue and Life magazines. Kirkland went on to graduate from the American Academy of Dramatic Arts in 1961. \n                  Leak reveals BBC staff anger at Tory-linked board member as Nandy defends broadcaster\n                 \n                  Author Dame Jilly Cooper died after fall at home, inquest finds\n                 \n                  BBC staff seemed fed up of Tim Davie's 'nothing to see' approach\n                 An early breakout for the star was appearing in Andy Warhol's 13 Most Beautiful Women in 1964. Some of her earliest roles were playing Shakespeare parts, including Helena in A Midsummer Night's Dream and Miranda in an off-Broadway production of The Tempest. She once told the Los Angeles Times: \"I don't think any actor can really call him or herself an actor unless he or she puts in time with Shakespeare.\" Kirkland was also infamous for her nude scenes, often disrobing in films and for social causes. In particular, Kirkland volunteered and advocated for people with AIDS, the homeless and prisoners."
    },
    {
        "title": "Author Dame Jilly Cooper died after fall at home, inquest finds",
        "description": "Dame Jilly Cooper died from a head injury after falling at her home in Gloucestershire, an inquest has found.",
        "url": "https://news.sky.com/story/author-dame-jilly-cooper-died-after-fall-at-home-inquest-finds-13468606",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-jilly-cooper-obit_7043854.jpg?20251006105254",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-11 13:57:00",
        "Headline": "The 88-year-old best-selling author died in hospital on 5 October, roughly 15 hours after her family found her after a fall at her home in Bisley, Gloucestershire. Her injuries were described as \"catastrophic\".",
        "Content": "Dame Jilly Cooper died from a head injury after falling at her home in Gloucestershire, an inquest has found. Katy Skerrett, senior coroner for Gloucestershire, said the 88-year-old author \"fell, perhaps down some stairs, sustaining a significant head injury\". Though the fall was unwitnessed, forensic evidence in the area surrounding the stairs suggested that it was where the fall occurred. South Western Ambulance Service were called at 5.35pm on 4 October and arrived at Dame Jilly's home at 5.56pm, they told the inquiry in a statement. Dame Jilly was initially alert and speaking with the crew on arrival. She did not recall the exact details of the fall, with only a \"vague recollection of falling down\", but she spoke of having a severe headache. She was transferred to Gloucestershire Royal Hospital, where an urgent CT scan found she had sustained a skull fracture, determined likely to be a terminal event. \"The medical opinion was that this head injury was unfortunately catastrophic,\" said Ms Skerrett. \"She was made comfortable, her condition sadly thereafter deteriorated, and she passed away in the emergency department with family\". Dame Jilly's long-standing GP told the inquest that she had fallen twice previously, in 2018 and in September 2024. She died in hospital at 8.30am on 5 October. Her death was found to be accidental, with Ms Skerrett saying \"there were no suspicious circumstances surrounding her fall\". Ms Skerrett extended the \"sincere condolences\" of the coroner's office to Dame Jilly's family. In a statement after her death, her children Emily Tarrant and Felix Cooper paid tribute to their mum, saying that \"her unexpected death has come as a complete shock\". \"We are so proud of everything she achieved in her life and can't begin to imagine life without her infectious smile and laughter all around us,\" they added. Read more from Sky News:91 prisoners freed in error over past seven monthsSky News joins police raid on Turkish barbershop The author's many fans included former prime minister Rishi Sunak, who said her books offered \"escapism\". She was a long-standing friend of Queen Camilla. One of Dame Jilly's most-loved characters - the showjumping womaniser Rupert Campbell-Black - was partly based on the Queen's ex-husband Andrew Parker Bowles. He was recently portrayed by actor Alex Hassell in the 2024 Disney+ adaptation of her novel Rivals. In a statement issued by Buckingham Palace after Dame Jilly's death, Camilla said: \"I join my husband, the King, in sending our thoughts and sympathies to all her family. And may her hereafter be filled with impossibly handsome men and devoted dogs.\" A new edition of Dame Jilly's book, How To Survive Christmas, which was first published in 1986, will be released on 13 November. Her funeral will be held in private, in line with her wishes, but a public service of thanksgiving will be held at Southwark Cathedral at a later date, her agent has said."
    },
    {
        "title": "BBC staff seemed fed up of Tim Davie's 'nothing to see' approach",
        "description": "As he addressed his staff, the BBC's outgoing director-general Tim Davie sounded remarkably upbeat given the events of the last few days.",
        "url": "https://news.sky.com/story/davie-told-bbc-staff-he-was-proud-nearly-a-dozen-times-in-call-but-some-think-his-departure-was-long-overdue-13468542",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bbc-tim-davie_7078904.jpg?20251111143349",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-11-11 11:57:00",
        "Headline": "Outgoing BBC director-general Tim Davie has addressed staff on a call following the announcement of his resignation. After a series of controversies, several insiders seem both weary and relieved that he's finally on his way.",
        "Content": "\n          Arts and entertainment correspondent\n        As he addressed his staff, the BBC's outgoing director-general Tim Davie sounded remarkably upbeat given the events of the last few days. Within a matter of minutes, he had said the word \"proud\" almost a dozen times. Proud of his staff, proud of what the corporation represents. Having announced his resignation on Sunday, he was keen to stress that he was still in charge at the BBC and that he would ensure a smooth transition for whoever takes over. Although he admitted it's \"been a rough few days\", quite frankly, it was a little bizarre how chipper he seemed. \"This narrative will not be given by our enemies,\" he insisted. BBC crisis latest: What happens next? You get a sense his own staff are beyond fed up with the \"nothing to see here\" approach Davie has maintained throughout his tenure. While the outgoing director-general might be hoping an inspirational quote or two might reassure those working for him, in truth, many of the insiders I've spoken to have seemed both weary and relieved that he's finally on his way. His departure is \"long overdue\", one told me.  Rumours of a coup and behind the scenes boardroom plotting have been embarrassing as the BBC tries to present a united front. In the same all-staff call, BBC chair Samir Shah was quick to say we shouldn't believe \"conspiracy theories\". He also suggested criticism of the board was \"disrespectful\", when answering a question about whether members demonstrate BBC values. If the briefing was supposed to be a chance for staff to put their questions to those in charge, it certainly wasn't that. Read more:Eight people who could replace Tim DavieThe man behind the leaked BBC memoTrump's legal threat letter in fullWho is Sir Robbie Gibb and why are there calls to get him off BBC board? I'm told that while the Q&A had a comments box for questions, any submitted had to be reviewed before everyone could see them. When questions about the rumoured plotter in chief, board member Sir Robbie Gibb, weren't getting through, staff started attempting to ask questions in the reply boxes, which were public. A friend of Mr Gibb's suggested to Deadline that the coup theory was \"absolute nonsense\". It shows BBC staff are angry, and that's understandable given the battering the organisation has taken in the last week. While the bosses are keen to stress that if everyone pulls together, the BBC can ride out the storm, it's going to take more than words to reassure frustrated staff."
    },
    {
        "title": "Police release update on Bob Vylan Glastonbury investigation",
        "description": "Police say they have interviewed a man over comments made during punk-rap duo Bob Vylan's set at Glastonbury.",
        "url": "https://news.sky.com/story/police-release-update-on-bob-vylan-glastonbury-investigation-13468467",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-bob-vylan-glastonbury_7078952.jpg?20251111102914",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-11 09:46:00",
        "Headline": "A man in his mid-30s has attended a voluntary interview, Avon and Somerset Police said, as part of their investigation into Bob Vylan's set at Glastonbury in June.",
        "Content": "Police say they have interviewed a man over comments made during punk-rap duo Bob Vylan's set at Glastonbury. A man in his mid-30s attended a voluntary interview with officers on Monday, Avon and Somerset Police said. The outspoken punk duo sparked controversy with their performance at Glastonbury in June, when frontman Bobby Vylan led a chant of \"death, death to the IDF\" on stage.   Police said they had consulted the Crown Prosecution Service and received legal advice on the investigation in October. \"It has been important for us to have a full understanding of any legal precedents, which is a complex process, and therefore over the past couple of months we have been seeking early legal advice from the Crown Prosecution Service (CPS),\" the force said in a statement. \"Following a review of the advice, a voluntary police interview was arranged to help us progress our enquiries... The matter has been recorded as a public order incident while we continue to investigate and consider all relevant legislation. \"Voluntary police interviews are commonly used in investigations where an individual agrees to attend and an arrest is not considered necessary, for example on the grounds of public safety or for the preservation of evidence. Attendees are interviewed under caution and have the same legal rights as anybody who is arrested.\" Read more:Clarkson leads tributes to former Top Gear starPageant organiser accused of calling contestant a 'dumbhead' Bob Vylan's set at Glastonbury was live-streamed by the BBC as part of its coverage of the festival, leading to fierce criticism of the corporation. The BBC's Executive Complaints Unit has since found the broadcast breached editorial standards related to harm and offence. However, the unit's findings cleared the corporation of breaching its guidelines relating to material that is likely to encourage or incite crime. Following the performance, the BBC issued an apology to viewers, especially the Jewish community, and promised to take action to \"ensure proper accountability\". It also said it would no longer live broadcast \"high risk\" performances."
    },
    {
        "title": "Sam Fender gives £25,000 Mercury Prize to support smaller venues",
        "description": "Sam Fender has donated his entire &#163;25,000 Mercury Prize winnings to support \"struggling\" grassroots venues.",
        "url": "https://news.sky.com/story/sam-fender-gives-16325000-mercury-prize-to-support-smaller-venues-13468451",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-sam-fender-mercury-prize_7078910.jpg?20251111093426",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-11-11 09:19:00",
        "Headline": "The singer-songwriter was named the winner of this year's Mercury Prize at a ceremony in his hometown of Newcastle, for his third album, People Watching.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sam Fender has donated his entire £25,000 Mercury Prize winnings to support \"struggling\" grassroots venues. The singer-songwriter, from North Shields, said he wanted to show support for the Music Venue Trust and smaller venues, which provided a vital platform for him when he was starting out. Fender was named the winner of this year's Mercury Prize at a ceremony in his home city of Newcastle - the first time the event had ever been held outside London - in October, for his critically acclaimed third album, People Watching. \"I wouldn't be doing what I am doing today if it wasn't for all the gigs I played around the North East, and beyond, when I was starting out,\" the 31-year-old said. \"These venues are legendary, but they are struggling.\" The Music Venue Trust, which represents hundreds of the UK's grassroots venues, says they operated on a profit margin of just 0.48% in 2024, with more than one in four reporting a loss. Fender previously helped to raise more than £100,000, which went to support 38 smaller venues across England, Scotland and Wales, through his 2024 arena tour. Other artists, including Katy Perry, Coldplay, Pulp and Enter Shikari, have also adopted the grassroots levy, adding small amounts to ticket prices to donate to the sector. Larger venues such as the Royal Albert Hall in London have also introduced the levy. Since 2023, more than 150 smaller venues have been forced to close due to rising costs and the ongoing effects of the pandemic, according to the trust. Mark Davyd, the charity's founder and chief executive, said Fender donating the Mercury Prize winnings was \"an incredible gesture\", showing that artists \"absolutely understand how vital grassroots music venues are to their careers and to their communities\". He continued: \"We are honoured to accept this donation and will ensure every penny of it makes a direct difference to the campaign to keep live music at the heart of our towns and cities.\" Read more:Kendrick Lamar leads Grammy nodsCulture workouts - the key to better health? Fender beat artists including Fontaines DC, FKA Twigs and previous winners Pulp and Wolf Alice to pick up this year's Mercury Prize. His second album, Seventeen Going Under, was also nominated in 2022, when the award was won by Little Simz. Judges said People Watching felt \"like a classic album, one that will take pride of place in record collections for years to come\"."
    }
]