[
    {
        "title": "Israeli security cabinet approves Netanyahu's plan to take full military control of Gaza",
        "description": "The Israeli security cabinet has approved Benjamin Netanyahu's plan to take full military control of Gaza, the prime minister's office said.",
        "url": "https://news.sky.com/story/netanyahu-faces-condemnation-over-plan-for-israel-to-take-full-military-control-of-gaza-13408401",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza_6985236.jpg?20250808000159",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-07 22:28:00",
        "Headline": "To take full control of the enclave, Israel would need to launch ground operations in the areas that have not been destroyed, where most of Gaza's two million population have sought refuge.",
        "Content": " The Israeli security cabinet has approved Benjamin Netanyahu's plan to take full military control of Gaza, the prime minister's office said. Mr Netanyahu had made clear his desire for a full military occupation of Gaza on Thursday, before a cabinet meeting that ran into the night. Asked in a Fox News interview ahead of the meeting if Israel would \"take control of all of Gaza\", he replied: \"We intend to, in order to assure our security, remove Hamas there, enable the population to be free of Gaza.\" \"We don't want to keep it. We want to have a security perimeter,\" he continued. \"We want to hand it over to Arab forces that will govern it properly without threatening us and giving Gazans a good life.\" Israel already controls around 75% of Gaza and has largely sealed its borders. To take full control, it would need to launch ground operations in the remaining areas that have not been destroyed, where most of Gaza's two million population have sought refuge.  Plan will 'put hostages and soldiers in danger' The plan has been criticised by many, including families of hostages being held by Hamas and a top Israel Defence Forces (IDF) official. Einav Zangauker, the mother of hostage Matan Zangauker, said Mr Netanyahu promised her that he would pursue a deal to free the hostages. She said in a post on X: \"Someone who talks about a comprehensive deal doesn't go and conquer the Strip and put hostages and soldiers in danger. \"Netanyahu and his partners are about to condemn [Matan] to death.\" Israel's military chief of staff, Eyal Zamir, has warned against occupying Gaza, saying it would endanger the hostages and put further strain on the IDF, according to Israeli media reports. 👉 Listen to Sky News Daily on your podcast app 👈 In an illustration of the kind of opposition Israel could face internationally, a Jordanian official aid Arabs would \"only support what Palestinians agree and decide on\". \"Security in Gaza must be done through legitimate Palestinian institutions,\" the source said. \"Arabs will not be agreeing to Netanyahu's policies nor clean his mess.\"  At least 42 more Palestinians killed by Israeli fire, say hospitals It comes after at least 42 Palestinians were killed in Israeli airstrikes and shootings across southern Gaza on Thursday, according to local hospitals. At least 13 of those people were seeking aid in an Israeli military zone where UN aid convoys are regularly overwhelmed by desperate crowds and looters. Another two were killed on roads leading to sites run by the Israel - and US-backed Gaza Humanitarian Foundation (GHF), according to Nasser Hospital, which received the bodies. The GHF said there were no violent incidents at or near its sites on Thursday. Read more:Video of hostage released by HamasAid sites are scenes of 'orchestrated killing The war in Gaza began when Hamas killed about 1,200 people - mostly civilians - in its attack on 7 October 2023 and abducted 251 others. They still hold approximately 50 of those hostages - with 20 believed to be alive - after most of the others were released in ceasefires or other deals. Israel's retaliatory offensive has killed more than 61,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "Rushanara Ali: Humiliating demise for Labour minister after a most egregious case of double standards",
        "description": "Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"do as I say, not as I do\".",
        "url": "https://news.sky.com/story/rushanara-ali-humiliating-demise-for-labour-minister-after-a-most-egregious-case-of-double-standards-13408397",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rushanara-ali-labour_6985222.jpg?20250807231518",
        "type": "Home",
        "Author": "Jon Craig",
        "Date Published": "2025-08-07 22:12:00",
        "Headline": "Labour's homelessness minister Rushanara Ali has resigned having reportedly hiked the rent on a property she owns by hundreds of pounds - something which was described by one of her tenants as \"extortion\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"do as I say, not as I do\". She was Labour's minister for homelessness, for goodness' sake, yet she ejected tenants from her near-£1m town house and then hiked the rent. Politics Hub: Minister's resignation as it happened A more egregious case of ministerial double standards it would be difficult to imagine. She had to go and was no doubt told by 10 Downing Street to go quickly. 'A heavy heart' - really? MP for the East End constituency of Bethnal Green and Stepney, Ms Ali was the very model of a modern Labour minister: A degree in PPE from Oxford University. In her resignation letter to Sir Keir Starmer, she said she is quitting \"with a heavy heart\". Really? She presumably didn't have a heavy heart when she ejected her four tenants. She'd previously spoken out against \"private renters being exploited\" and said her government would \"empower people to challenge unreasonable rent increases\". The now former minister was charging her four former tenants £3,300 a month. Yet after they moved out, she charged her new tenants £4,000 - a rent increase of more than 20%. Read more politics news:Fact-checking Farage's claimsWhy chancellor has little to cheer A fragile constituency for Labour? In an area represented by the left-wing firebrand George Galloway from 2005 to 2010, Ms Ali had a majority of under 1,700 at the election last year. Ominously for Labour, an independent candidate was second and the Greens third. No doubt Jeremy Corbyn's new party will also stand next time. In her resignation letter to the PM, Ms Ali said continuing in her ministerial role would be a distraction. Too right. A distraction Sir Keir and his increasingly unpopular government could have done without."
    },
    {
        "title": "Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite",
        "description": "What do we do about the non-doms?&#160;",
        "url": "https://news.sky.com/story/why-rachel-reeves-may-want-to-rethink-one-of-her-pivotal-policies-13408251",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6985238.jpg?20250808003624",
        "type": "Home",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 15:05:00",
        "Headline": "As the chancellor tries to shore up the public finances, there are signs her policy to grab billions from non-doms may be backfiring. And with doubts over those calculations anyway, the policy may even result in lower tax revenues.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  What do we do about the non-doms?  It's a question more than a handful of people have been asking themselves at the Treasury lately. Politics Hub: Follow latest updates It had seemed simple enough. In her first budget as chancellor, Rachel Reeves promised a crackdown on the non-dom regime, which for the past 200 years has allowed residents to declare they are permanently domiciled in another country for tax purposes. Under the scheme, non-doms, some of the richest people in the country, were not taxed on their foreign incomes. Then that all changed. Standing at the despatch box in October last year, the chancellor said: \"I have always said that if you make Britain your home, you should pay your tax here. So today, I can confirm we will abolish the non-dom tax regime and remove the outdated concept of domicile from the tax system from April 2025.\" The hope was that the move would raise £3.8bn for the public purse. However, there are signs that the non-doms are leaving in such great numbers that the policy could end up costing the UK investment, jobs and, of course, the tax that the non-doms already pay on their UK earnings. If the numbers don't add up, this tax-raising policy could morph into an act of self-harm. With the budget already under strain, a poor calculation would be costly financially. The alternative, a U-turn, could be expensive for other reasons, eroding faith in a chancellor who has already been on a turbulent ride. So, how worried should she be? The data on the number of non-doms in the country is published with a considerable lag. So, it will be a while before we know the full impact of this policy. However, there is much uncertainty about how this group will behave. While the Office for Budget Responsibility forecast that the policy could generate £3.8bn for the government over the next five years, assuming between 12 and 25% of them leave, it admitted it lacked confidence in those numbers. Worryingly for ministers, there are signs, especially in London, that the exodus could be greater. Property sales Analysis from the property company LonRes, shows there were 35.8% fewer transactions in May for properties in London's most exclusive postcodes compared with a year earlier and 33.5% fewer than the pre-pandemic average. Estate agents blame falling demand from non-dom buyers. This comes as no surprise to Magda Wierzycka, a South African billionaire businesswoman, who runs an investment fund in London. She herself is threatening to leave the UK unless the government waters down its plans. \"Non-doms are leaving, as we speak, and the problem with numbers is that the consequences will only become known in the next 12 to 18 months,\" she said. \"But I have absolutely no doubt, based on people I know who have already left, that the consequences would be quite significant. \"It's not just about the people who are leaving that everyone is focusing on. It's also about the people who are not coming, people who would have come, set up businesses, created jobs, they're not coming. They take one look at what has happened here, and they're not coming.\" Lack of options for non-doms But where will they go? Britain was unusual in offering such an attractive regime. Bar a few notable exceptions, such as Italy, most countries run residency-based tax systems, meaning people pay tax to the country in which they live. This approach meant many non-doms escaped paying tax on their foreign income altogether because they didn't live in those countries where they earned their foreign income. In any case, widespread double taxation treaties mean people are generally not taxed twice, although they may have to pay the difference. In one important sense, Magda is right. It could take a while before the consequences are fully known. There are few firm data points for us to draw conclusions from right now, but the past could be illustrative. Read more on Sky News:Reeves warned over tax risesWhat is a wealth tax?  The non-dom regime has been through repeated reform. George Osborne changed the system back in 2017 to limit it to just 15 years. Then Jeremy Hunt announced the Tories would abolish the regime altogether in one of his final budgets. Following the 2017 reforms there was an initial shock, but the numbers stabilised, falling just 5% after a few years. The data suggests there was an initial exodus of people who were probably considering leaving anyway, but those who remained - and then arrived - were intent on staying in the UK. So, should the government look through the numbers and hold its nerve? Not necessarily. Have Labour crossed a red line? Stuart Adam, a senior economist at the Institute for Fiscal Studies, said the response could be far greater this time because of some key changes under Labour. The government will no longer allow non-doms to protect money held in trusts, so 40% inheritance tax will be due on their estates. For many, that is a red line.  Mr Adam said: \"The 2017 reform deliberately built in what you might call a loophole, a way to avoid paying a lot more tax through the use of existing offshore trusts. That was a route deliberately left open to enable many people to avoid the tax. \"So it's not then surprising that they didn't up sticks and leave. Part of the reform that was announced last year was actually not having that kind of gap in the system to enable people to avoid the tax using trusts, and therefore you might expect to see a bigger response to the kind of reforms we've seen announced now, but it also means we don't have very much idea about how big a response to expect.\" With the public finances under considerable pressure, that will offer little comfort to a chancellor who is operating on the finest of margins."
    },
    {
        "title": "Jayla-Jean Mclaren: Family pay tribute to one-year-old girl after two arrested over her death",
        "description": "The family of a one-year-girl who died on the Isle of Wight have paid tribute to her after a man and woman were arrested in relation to her death.",
        "url": "https://news.sky.com/story/jayla-jean-mclaren-family-pay-tribute-to-one-year-old-girl-after-two-arrested-over-her-death-13408403",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jayla-jean-mclaren_6985237.jpg?20250808000929",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-07 22:42:00",
        "Headline": "A 31-year-old man and a 27-year-old woman were previously arrested on suspicion of causing grievous bodily harm with intent.",
        "Content": "The family of a one-year-girl who died on the Isle of Wight have paid tribute to her after a man and woman were arrested in relation to her death. Jayla-Jean Mclaren died on Sunday, two days after she was taken to hospital with serious injuries. In a statement published by the Hampshire and Isle of Wight Constabulary on Thursday, her family said: \"Mummy, daddy, and nanny will always love you. Fly high princess.\" A 31-year-old man and a 27-year-old woman, both from Newport in South Wales, were previously arrested on suspicion of causing grievous bodily harm with intent. They have since been released on conditional bail pending further inquiries, police said. \"We know emotions are understandably high in the local community following news of this devastating incident,\" Detective Superintendent Rod Kenny said. Read more from Sky News:Homelessness minister resigns after rent hike claimsTropical storm to bring potential heatwaveSuperman actor joining ICE to 'save America' \"First and foremost, our thoughts remain with all who knew and loved Jayla-Jean,\" he continued. \"I want to reassure the community that our investigation remains ongoing, and we are working tirelessly to establish the full facts surrounding Jayla-Jean's death.\" He added: \"While we understand the community concern, we urge people not to speculate on the circumstances as this will cause further distress to those who knew Jayla-Jean and could impede the ongoing police investigation. \"We will provide further updates as soon as we are able to.\""
    },
    {
        "title": "Eddie Murphy: I'll get an Oscars trophy eventually - when I'm old and have no teeth",
        "description": "Eddie Murphy has told Sky News he doesn't ever expect to win awards - but will happily accept an honorary Oscar when he's 90.",
        "url": "https://news.sky.com/story/eddie-murphy160ill-get-an-oscars-trophy-eventually-when-im-old-and-have-no-teeth-13408277",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-eddie-murphy-the-nutty-professor_6984273.jpg?20250806165834",
        "type": "Home",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-08-07 16:25:00",
        "Headline": "The Nutty Professor star teams up with Keke Palmer and Pete Davidson for a new heist comedy, The Pickup, based on two security van drivers.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Eddie Murphy has told Sky News he doesn't ever expect to win awards - but will happily accept an honorary Oscar when he's 90. Murphy is one of the biggest stars in comedy after starting out on Saturday Night Live (SNL) in 1980 and starring in a number of big franchises from Beverly Hills Cop to Shrek. Murphy says award recognition was never something that shaped the projects he chose. \"The movies are timeless, and they're special, so for years and years those movies play and the movies have commercial success. \"So you make a lot of money and people love it, so you don't even think about 'I didn't win a trophy!' The response from the people and that the movie has legs, that's the trophy. \"You know what I've earned over these years? One day, they'll give me one of those honorary Oscars. When I'm really old. And I'll say thank you so much for this wonderful honour. I'll be old like that and I'll have no teeth. I'm cool with getting my honorary Oscar when I'm 90.\" Murphy, 64, has only been nominated once - for Dreamgirls in 2007, when Alan Arkin won the best supporting actor Oscar for Little Miss Sunshine. Murphy's co-star Palmer says she considers Murphy an icon in the industry, and The Nutty Professor was a true display of his artistry. \"I feel like recognition and [being] underrated and all this stuff, it annoys me a little bit because I think impact is really the greatest thing, like how people were moved by your work, which can't really be measured by an award or really anything,\" Palmer says. \"It's very hard to make people laugh, and so when I think about it like The Nutty Professor, Eddie was doing everything, and I swear that the family members were real people. \"He didn't camp it to the point where they weren't realistic. His roles had integrity, even when he was in full costume. And I do think that's something that should change in our industry. Comedy, it should be looked at just as prestigious as when you see somebody cry, because it's that hard to make somebody laugh.\" Recalling his time on the 90s comedy, Murphy says he's still in disbelief of what they achieved in making the film with him playing seven characters - Professor Sherman Klump, Buddy Love, Lance Perkins, Young Papa Klump, Granny Klump, Ernie Klump and Mama Klump. \"You can only shoot one character a day. And the rest of the time you're shooting, I'm talking to tennis balls where the people were sitting. \"So to this day when I watch it, I'm like, wow, that's a trip. But we were able to mix all that stuff up and different voices and make it feel so that you don't even feel like when you're watching it, someone have to tell you, hey, you know, those are all one person.\" The film won best makeup at the 1997 Academy Awards. Security guards buddy comedy Palmer says their new project, The Pickup, is responsible for one of the most memorable moments of her life when she mistook Murphy's acting for real praise. \"First of all, Eddie gives me this big speech before I do the monologue, where he's like, 'this is not playing around. This is a pivotal point in the movie'. \"I'm crying in the scene, and then it comes to the end, and Eddie's [clapping] like, and I'm literally like, 'oh my gosh, thank you so much'. And he's like, 'I'm acting'. When I tell you, it was so crazy, yeah. That's like one of my most memorable moments in life.\" Davidson is excited to see how the UK puts its own stamp on SNL, the show where both he and Murphy got their start on-screen. \"It's a smart idea to have SNL over there because it's not that it's a different brand of comedy, but it is a little bit. A lot of the biggest stuff that's in the States is stuff that we stole from you guys, like The Office or literally anything Ricky Gervais does. \"This is the first time I've ever heard anything American going to the UK, so I think it's great. I think it's great to have two opposite sorts of takes on things, but both be funny. That just shows you how broad comedy can be, you know? The Pickup is out on Prime Video now."
    },
    {
        "title": "OpenAI releases long-awaited GPT-5 AI chatbot upgrade",
        "description": "GPT-5, the long-awaited upgrade to the ChatGPT AI chatbot, has been released by its maker OpenAI.",
        "url": "https://news.sky.com/story/openai-releases-long-awaited-gpt-5-ai-chatbot-upgrade-13408324",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-gpt-5_6985155.jpg?20250807213020",
        "type": "Home",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-07 18:33:00",
        "Headline": "It's been one of the most highly anticipated launches in Silicon Valley after OpenAI's first offering ChatGPT - powered by its GPT-3 model - kick-started the current AI boom in late 2022.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n GPT-5, the long-awaited upgrade to the ChatGPT AI chatbot, has been released by its maker OpenAI. It has been one of the most highly anticipated launches in Silicon Valley after OpenAI's first offering ChatGPT - powered by its GPT-3 model - kick-started the current AI boom in late 2022. \"GPT-3 sort of felt like talking to a high school student,\" said Sam Altman, OpenAI's chief executive. \"GPT-4, maybe it was like talking to a college student. But with GPT-5, now it's like talking to an expert, a PhD-level expert in anything, any area you need, on demand.\"  At the launch event, OpenAI claimed the new chatbot, which will be released to all ChatGPT users on Thursday, was more than a simple upgrade to its previous offerings. According to OpenAI, the new model exceeds the chatbot competition from the likes of Google, X and Antropic on \"benchmarks\" - standardised tests used to rank models. \n                  Tech giant OpenAI signs deal with government to boost efficiency in public services\n                 \n                  OpenAI boss Sam Altman denies sister's sexual abuse lawsuit claims\n                 \n                  Scarlett Johansson speaks out about clash with OpenAI\n                 OpenAI claims it has been designed to be easier and more natural to communicate with, better at writing prose and advanced computer code, solving academic questions from mathematics to law, assisting with healthcare-related questions, as well as being safer than its predecessors. \"It's an incredible superpower on demand,\" claimed Mr Altman. The model is also more intelligent in how it uses its own brain power - and therefore an expensive computing resource - according to OpenAI. It is a hybrid of previous chatbots and slower, more computing-intensive \"reasoning\" models like OpenAI's Deep Research. Based on a user's request, the model will decide how much \"thinking\" is required before answering, rather than requiring the user to switch between different models. Although AI enthusiasts who had been expecting GPT-5 to represent \"artificial general intelligence [AGI]\" will be disappointed. Despite this being OpenAI's stated goal, Mr Altman billed GPT-5 as a \"major upgrade\" to GPT-4 and a \"significant step along the path to AGI\". But they're clearly not there yet.  A real test of GPT-5 will be whether it sells. OpenAI is projected to spend $8bn (£6bn) this year, on top of $5bn (£3.7bn) last year, and while it is expected to make a profit this year, the business case for increasingly powerful AI models is still not clear to many investors. Given a single training run for GPT-5 is rumoured to have cost $500m (£373m), there will be an expectation the new model is significantly more useful to business users. Despite a very slick demonstration of its coding skills at the launch presentation, where it built an online language learning game in seconds, GPT-5 will have to prove its worth for professional coding. Many in the tech industry prefer Anthropic AI's Claude model to write code. OpenAI and its investors will be hoping GPT-5 changes that. AI experts will also be testing GPT-5's tendency to \"hallucinate\", an issue OpenAI claims to have improved with GPT-5. But erroneous or bizarre answers are a problem that dogs all large generative AI models. \"Shiny things are always fun to play with, and I fully expect GPT-5 to be the shiniest so far,\" said Gary Marcus, a cognitive scientist at New York University and AI commentator. \"But that doesn't mean that it is a critical step on the optimal path to AI that we can trust,\" Mr Marcus added in a post."
    },
    {
        "title": "'Restriction zones' to be introduced for domestic abusers",
        "description": "The government is seeking to introduce \"restriction zones\" to limit where convicted domestic abusers can go.",
        "url": "https://news.sky.com/story/restriction-zones-to-be-introduced-for-domestic-abusers-13408373",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-domestic-abuse-stock_6965284.jpg?20250715113748",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-07 21:05:00",
        "Headline": "The new plans would place greater limits where abusers can go, with the aim of allowing survivors to go about their daily lives without fear of seeing their former abuser.",
        "Content": "The government is seeking to introduce \"restriction zones\" to limit where convicted domestic abusers can go. Exclusion zones currently exist to stop perpetrators from going within a certain distance of where their victims live. The new plans would place greater limits where abusers can go, with the aim of allowing survivors to go about their daily lives without fear of seeing their former abuser. Sexual and violent offenders could be restricted to certain locations and tracked with technology under the new proposals. They would then face jail time for breaching the conditions. Probation officers will carry out detailed risk assessments and work with survivors to decide on banned locations for perpetrators.  Survivor Leanne said from her experience, she would have asked for restriction zones at the school where she took her two children, her local supermarket or near her family's homes. \"These are places where I was confronted, even when he had restraining orders,\" the 54-year-old said. While Leanne said she is \"loving what I'm hearing\" about the government's approach, she added: \"Would I put a lot of faith in it? Probably not, because I don't like being let down, and I've been let down by previous governments. \"So we can only have hope.\" Read more:More strangulation cases recorded by policePensioner who stalked TV actress to be sentenced Justice minister Alex Davies-Jones will announce the new measure at charity Advance in London on Friday. The victims minister will say abusers will be GPS monitored to provide real-time data about where they are going, and subject to \"virtual boundaries\". The government is overhauling the prison system to curb overcrowding, which could see violent and sexual offenders released from jail earlier, and for more criminals to serve sentences in the community. Tens of thousands of offenders would be tagged, prompting concerns from the victims' commissioner for England and Wales over the Probation Service's ability to cope with rising numbers. The government has announced £700m of funding until 2028/29 for the Probation Service to back up its reforms. It will also recruit 1,300 new probation officers by March 2026."
    },
    {
        "title": "Tropical Storm Dexter to bring potential heatwave next week",
        "description": "Remnants of Tropical Storm Dexter will bring an increase in temperatures over the weekend, with highs of 34C possible next week.",
        "url": "https://news.sky.com/story/tropical-storm-dexter-to-bring-potential-heatwave-next-week-13408278",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-weather-hyde-park-london_6985024.jpg?20250807175839",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-07 16:31:00",
        "Headline": "Temperatures of 28C are possible in the South on Sunday, reaching 30C across parts of England on Monday before getting closer to 34C on Tuesday.",
        "Content": "Remnants of Tropical Storm Dexter will bring an increase in temperatures over the weekend, with highs of 34C possible next week. A heatwave could be registered in parts of the South early next week and could spread more widely if temperatures hold. Temperatures of 28C (82F) are possible in the South on Sunday, reaching 30C (86F) across parts of England on Monday before getting closer to 34C (93F) on Tuesday. Check the weather forecast where you are Warm and muggy nights are to be expected, especially in the South. Conditions will be more unsettled in the North, with strong winds and rain at times. In its forecast the Met Office said Friday will be a brighter day for many, with sunny spells across southern and central areas and highs of 25-26C expected. Northern Scotland will be breezy with showery outbreaks of rain. Saturday will also see sunny spells for much of England and Wales, but there will be some rain in northern areas, particularly northern Scotland. A weather front moving in from the west will bring rain to Northern Ireland, parts of Scotland and possibly northern England by Sunday evening, while central and southern areas are expected to remain dry with sunny spells. Temperatures will begin to rise in the South from Sunday evening, as the remnants of Tropical Storm Dexter \"draws warm air up from the southwest across the UK\", the Met Office said. Temperatures are expected to exceed 30C across parts of central, southern and eastern England on Monday and Tuesday, the forecaster added. Read more from Sky News:What could happen when Trump and Putin meetCharity calls for clarity on commission's probe into Prince Harry claims \"We're confident that temperatures will increase markedly by the start of next week, reaching the low 30s Celsius in parts of England on Monday and perhaps the mid 30s in a few places on Tuesday,\" said Met Office deputy chief meteorologist Steven Keates. \"However, the length of this warm spell is still uncertain, and it is possible that high temperatures could persist further into next week, particularly in the south.\" \"Ex-Dexter sets the wheels in motion for an uptick in temperatures, but the weather patterns then maintaining any hot weather are rather more uncertain\"."
    },
    {
        "title": "Ex-Superman Dean Cain to join ICE 'ASAP' to 'save America'",
        "description": "Dean Cain has been branded the \"worst superman ever\" as he announced he will join the US Immigration and Customs Enforcement (ICE) \"ASAP\".",
        "url": "https://news.sky.com/story/ex-superman-dean-cain-to-join-ice-asap-to-save-america-13408113",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dean-cain-superman_6984880.jpg?20250807140456",
        "type": "Home",
        "Author": "Claire Gilbody-Dickerson",
        "Date Published": "2025-08-07 09:35:00",
        "Headline": "Cain, 59 and who was cast as Superman in the TV series Lois & Clark: The New Adventures of Superman, announced he had joined the team amid the federal agency's unprecedented immigration raids.",
        "Content": "\n          Reporter\n              @ClaireGilbodyD\n Dean Cain has been branded the \"worst superman ever\" as he announced he will join the US Immigration and Customs Enforcement (ICE) \"ASAP\". The 59-year-old, who was cast as Superman in the TV series Lois & Clark: The New Adventures of Superman, announced he had joined the team amid the federal agency's unprecedented immigration raids. He told Fox News on Wednesday his recruitment video on Instagram had gone viral and since then, \"I have spoken with some of the officials over at ICE and I will be sworn in as an ICE agent ASAP\". \"You can defend your homeland and get great benefits,\" he said in the Instagram post where he appealed for his followers to join ICE. Speaking with the Superman theme song in the background, he said \"hundreds of thousands of criminals\" had been arrested since US President Donald Trump took office. He then told his followers they would get a series of benefits if they joined ICE, including a $50,000 (£37,407) signing bonus and student loan repayment.  Read more: Farmer becomes first person to die during Trump's ICE raidsMeet the volunteers leading the fight against Trump's immigration raids \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Trump and Putin's first meeting in years does not necessarily mean a ceasefire in Ukraine\n                 \n                  OpenAI releases long-awaited GPT-5 AI chatbot upgrade\n                 \"If you want to help save America ICE is arresting the worst of the worst and removing them from America's streets,\" he said, before adding: \"I voted for that.\" ICE agents are under pressure from the White House to boost their deportation numbers in line with Mr Trump's campaign promise to crack down on illegal immigration. Cain's post on Instagram received some backlash, with one user commenting: \"Worst superman ever\". Another said: \"Shame on you Dean - that's the most un-Superman thing you could possibly advocate.\" One fan turned against him and said: \"Until I saw this I was such a fan. What a sad human being you must be.\""
    },
    {
        "title": "Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite",
        "description": "What do we do about the non-doms?&#160;",
        "url": "https://news.sky.com/story/why-rachel-reeves-may-want-to-rethink-one-of-her-pivotal-policies-13408251",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6985238.jpg?20250808003624",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 15:05:00",
        "Headline": "As the chancellor tries to shore up the public finances, there are signs her policy to grab billions from non-doms may be backfiring. And with doubts over those calculations anyway, the policy may even result in lower tax revenues.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  What do we do about the non-doms?  It's a question more than a handful of people have been asking themselves at the Treasury lately. Politics Hub: Follow latest updates It had seemed simple enough. In her first budget as chancellor, Rachel Reeves promised a crackdown on the non-dom regime, which for the past 200 years has allowed residents to declare they are permanently domiciled in another country for tax purposes. Under the scheme, non-doms, some of the richest people in the country, were not taxed on their foreign incomes. Then that all changed. Standing at the despatch box in October last year, the chancellor said: \"I have always said that if you make Britain your home, you should pay your tax here. So today, I can confirm we will abolish the non-dom tax regime and remove the outdated concept of domicile from the tax system from April 2025.\" The hope was that the move would raise £3.8bn for the public purse. However, there are signs that the non-doms are leaving in such great numbers that the policy could end up costing the UK investment, jobs and, of course, the tax that the non-doms already pay on their UK earnings. If the numbers don't add up, this tax-raising policy could morph into an act of self-harm. With the budget already under strain, a poor calculation would be costly financially. The alternative, a U-turn, could be expensive for other reasons, eroding faith in a chancellor who has already been on a turbulent ride. So, how worried should she be? The data on the number of non-doms in the country is published with a considerable lag. So, it will be a while before we know the full impact of this policy. However, there is much uncertainty about how this group will behave. While the Office for Budget Responsibility forecast that the policy could generate £3.8bn for the government over the next five years, assuming between 12 and 25% of them leave, it admitted it lacked confidence in those numbers. Worryingly for ministers, there are signs, especially in London, that the exodus could be greater. Property sales Analysis from the property company LonRes, shows there were 35.8% fewer transactions in May for properties in London's most exclusive postcodes compared with a year earlier and 33.5% fewer than the pre-pandemic average. Estate agents blame falling demand from non-dom buyers. This comes as no surprise to Magda Wierzycka, a South African billionaire businesswoman, who runs an investment fund in London. She herself is threatening to leave the UK unless the government waters down its plans. \"Non-doms are leaving, as we speak, and the problem with numbers is that the consequences will only become known in the next 12 to 18 months,\" she said. \"But I have absolutely no doubt, based on people I know who have already left, that the consequences would be quite significant. \"It's not just about the people who are leaving that everyone is focusing on. It's also about the people who are not coming, people who would have come, set up businesses, created jobs, they're not coming. They take one look at what has happened here, and they're not coming.\" Lack of options for non-doms But where will they go? Britain was unusual in offering such an attractive regime. Bar a few notable exceptions, such as Italy, most countries run residency-based tax systems, meaning people pay tax to the country in which they live. This approach meant many non-doms escaped paying tax on their foreign income altogether because they didn't live in those countries where they earned their foreign income. In any case, widespread double taxation treaties mean people are generally not taxed twice, although they may have to pay the difference. In one important sense, Magda is right. It could take a while before the consequences are fully known. There are few firm data points for us to draw conclusions from right now, but the past could be illustrative. Read more on Sky News:Reeves warned over tax risesWhat is a wealth tax?  The non-dom regime has been through repeated reform. George Osborne changed the system back in 2017 to limit it to just 15 years. Then Jeremy Hunt announced the Tories would abolish the regime altogether in one of his final budgets. Following the 2017 reforms there was an initial shock, but the numbers stabilised, falling just 5% after a few years. The data suggests there was an initial exodus of people who were probably considering leaving anyway, but those who remained - and then arrived - were intent on staying in the UK. So, should the government look through the numbers and hold its nerve? Not necessarily. Have Labour crossed a red line? Stuart Adam, a senior economist at the Institute for Fiscal Studies, said the response could be far greater this time because of some key changes under Labour. The government will no longer allow non-doms to protect money held in trusts, so 40% inheritance tax will be due on their estates. For many, that is a red line.  Mr Adam said: \"The 2017 reform deliberately built in what you might call a loophole, a way to avoid paying a lot more tax through the use of existing offshore trusts. That was a route deliberately left open to enable many people to avoid the tax. \"So it's not then surprising that they didn't up sticks and leave. Part of the reform that was announced last year was actually not having that kind of gap in the system to enable people to avoid the tax using trusts, and therefore you might expect to see a bigger response to the kind of reforms we've seen announced now, but it also means we don't have very much idea about how big a response to expect.\" With the public finances under considerable pressure, that will offer little comfort to a chancellor who is operating on the finest of margins."
    },
    {
        "title": "Homelessness minister Rushanara Ali resigns after 'extortionate' rent hike claims",
        "description": "Homelessness minister Rushanara Ali has resigned after reportedly hiking the rent on a property she owns by hundreds of pounds - something described by one of her tenants as \"extortion\". ",
        "url": "https://news.sky.com/story/labours-homelessness-minister-rushanara-ali-resigns-after-rent-hike-claims-13408249",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rushanara-ali-bethnal-green_6984791.jpg?20250807121645",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-07 19:17:00",
        "Headline": "In a letter to the prime minister, Ms Ali said that remaining in her role would be a \"distraction from the ambitious work of this government\".",
        "Content": "Homelessness minister Rushanara Ali has resigned after reportedly hiking the rent on a property she owns by hundreds of pounds - something described by one of her tenants as \"extortion\".  That was just weeks after the previous tenants' contract ended, The i Paper said. Four tenants who rented a house in east London from Ms Ali were sent an email last November saying their lease would not be renewed, and which also gave them four months' notice to leave, the newspaper reported. The property was then re-listed with a £700 rent increase within weeks, the publication added. In a letter to the prime minister, Ms Ali said that remaining in her role would be a \"distraction from the ambitious work of this government\". She added: \"Further to recent reporting, I wanted to make it clear that at all times I have followed all relevant legal requirements. \"I believe I took my responsibilities and duties seriously, and the facts demonstrate this.\" Laura Jackson, one of Ms Ali's former tenants, said she and three others collectively paid £3,300 in rent. Weeks after she and her fellow tenants had left, the self-employed restaurant owner said she saw the house re-listed with a rent of around £4,000. \"It's an absolute joke,\" she said. \"Trying to get that much money from renters is extortion.\" Ms Ali's house, rented on a fixed-term contract, was put up for sale while the tenants were living there, and was only relisted as a rental because it had not sold, according to The i Paper. The government's Renters' Rights Bill includes measures to ban landlords who end a tenancy to sell a property from re-listing it for six months. The Bill, which is nearing its end stages of scrutiny in Parliament, will also abolish fixed-term tenancies and ensure landlords give four months' notice if they want to sell their property. Chief political correspondent Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"Do as I say, not as I do\". She was Labour's minister for homelessness, for goodness' sake, yet she ejected tenants from her near-£1m town house then hiked the rent. A more egregious case of ministerial double standards it would be difficult to imagine. She had to go and was no doubt told by 10 Downing Street to go quickly. MP for the East End constituency of Bethnal Green and Stepney, Ms Ali was the very model of a modern Labour minister: a degree in PPE from Oxford University. In her resignation letter to Sir Keir Starmer, she said she is quitting \"with a heavy heart\". Really? She presumably didn't have a heavy heart when she ejected her four tenants. She'd previously spoken out against \"private renters being exploited\" and said the government would \"empower people to challenge unreasonable rent increases\". She was charging her four former tenants £3,300 a month. Yet after they moved out, she charged her new tenants £4,000, a rent increase of more than 20%. In an area represented by the left-wing firebrand George Galloway from 2005 to 2010, Ms Ali had a majority of under 1,700 at the election last year. Ominously for Labour, an independent candidate was second and the Greens third. No doubt Jeremy Corbyn's new party will also stand next time. In her resignation letter to the PM, Ms Ali said continuing in her ministerial role would be a distraction. Too right. A distraction Sir Keir and his increasingly unpopular government could have done without. Responding to her resignation, shadow housing secretary Sir James Cleverly said: \"I said that her actions were total hypocrisy and that she should go if the accusations were shown to be true.\" A Liberal Democrat spokesperson said: \"Rushanara Ali fundamentally misunderstood her role. Her job was to tackle homelessness, not to increase it.\" Read more:First migrants detained under returns deal with FranceTropical Storm Dexter to bring potential heatwave next week Previously, a spokesperson for Ms Ali said the tenants \"stayed for the entirety of their fixed term contract, and were informed they could stay beyond the expiration of the fixed term, while the property remained on the market, but this was not taken up, and they decided to leave the property\". The prime minister thanked Ms Ali for her \"diligent work\" and for helping to \"deliver this government's ambitious agenda\". Sir Keir Starmer said her work in putting in measures to repeal the Vagrancy Act would have a \"significant impact\". And he said she had been trying to encourage \"more people to engage and participate in our democracy\", something that would leave a \"lasting legacy\"."
    },
    {
        "title": "Rushanara Ali: Humiliating demise for Labour minister after a most egregious case of double standards",
        "description": "Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"do as I say, not as I do\".",
        "url": "https://news.sky.com/story/rushanara-ali-humiliating-demise-for-labour-minister-after-a-most-egregious-case-of-double-standards-13408397",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rushanara-ali-labour_6985222.jpg?20250807231518",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-08-07 22:12:00",
        "Headline": "Labour's homelessness minister Rushanara Ali has resigned having reportedly hiked the rent on a property she owns by hundreds of pounds - something which was described by one of her tenants as \"extortion\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"do as I say, not as I do\". She was Labour's minister for homelessness, for goodness' sake, yet she ejected tenants from her near-£1m town house and then hiked the rent. Politics Hub: Minister's resignation as it happened A more egregious case of ministerial double standards it would be difficult to imagine. She had to go and was no doubt told by 10 Downing Street to go quickly. 'A heavy heart' - really? MP for the East End constituency of Bethnal Green and Stepney, Ms Ali was the very model of a modern Labour minister: A degree in PPE from Oxford University. In her resignation letter to Sir Keir Starmer, she said she is quitting \"with a heavy heart\". Really? She presumably didn't have a heavy heart when she ejected her four tenants. She'd previously spoken out against \"private renters being exploited\" and said her government would \"empower people to challenge unreasonable rent increases\". The now former minister was charging her four former tenants £3,300 a month. Yet after they moved out, she charged her new tenants £4,000 - a rent increase of more than 20%. Read more politics news:Fact-checking Farage's claimsWhy chancellor has little to cheer A fragile constituency for Labour? In an area represented by the left-wing firebrand George Galloway from 2005 to 2010, Ms Ali had a majority of under 1,700 at the election last year. Ominously for Labour, an independent candidate was second and the Greens third. No doubt Jeremy Corbyn's new party will also stand next time. In her resignation letter to the PM, Ms Ali said continuing in her ministerial role would be a distraction. Too right. A distraction Sir Keir and his increasingly unpopular government could have done without."
    },
    {
        "title": "'Restriction zones' to be introduced for domestic abusers",
        "description": "The government is seeking to introduce \"restriction zones\" to limit where convicted domestic abusers can go.",
        "url": "https://news.sky.com/story/restriction-zones-to-be-introduced-for-domestic-abusers-13408373",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-domestic-abuse-stock_6965284.jpg?20250715113748",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-07 21:05:00",
        "Headline": "The new plans would place greater limits where abusers can go, with the aim of allowing survivors to go about their daily lives without fear of seeing their former abuser.",
        "Content": "The government is seeking to introduce \"restriction zones\" to limit where convicted domestic abusers can go. Exclusion zones currently exist to stop perpetrators from going within a certain distance of where their victims live. The new plans would place greater limits where abusers can go, with the aim of allowing survivors to go about their daily lives without fear of seeing their former abuser. Sexual and violent offenders could be restricted to certain locations and tracked with technology under the new proposals. They would then face jail time for breaching the conditions. Probation officers will carry out detailed risk assessments and work with survivors to decide on banned locations for perpetrators.  Survivor Leanne said from her experience, she would have asked for restriction zones at the school where she took her two children, her local supermarket or near her family's homes. \"These are places where I was confronted, even when he had restraining orders,\" the 54-year-old said. While Leanne said she is \"loving what I'm hearing\" about the government's approach, she added: \"Would I put a lot of faith in it? Probably not, because I don't like being let down, and I've been let down by previous governments. \"So we can only have hope.\" Read more:More strangulation cases recorded by policePensioner who stalked TV actress to be sentenced Justice minister Alex Davies-Jones will announce the new measure at charity Advance in London on Friday. The victims minister will say abusers will be GPS monitored to provide real-time data about where they are going, and subject to \"virtual boundaries\". The government is overhauling the prison system to curb overcrowding, which could see violent and sexual offenders released from jail earlier, and for more criminals to serve sentences in the community. Tens of thousands of offenders would be tagged, prompting concerns from the victims' commissioner for England and Wales over the Probation Service's ability to cope with rising numbers. The government has announced £700m of funding until 2028/29 for the Probation Service to back up its reforms. It will also recruit 1,300 new probation officers by March 2026."
    },
    {
        "title": "Jayla-Jean Mclaren: Family pay tribute to one-year-old girl after two arrested over her death",
        "description": "The family of a one-year-girl who died on the Isle of Wight have paid tribute to her after a man and woman were arrested in relation to her death.",
        "url": "https://news.sky.com/story/jayla-jean-mclaren-family-pay-tribute-to-one-year-old-girl-after-two-arrested-over-her-death-13408403",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-jayla-jean-mclaren_6985237.jpg?20250808000929",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-07 22:42:00",
        "Headline": "A 31-year-old man and a 27-year-old woman were previously arrested on suspicion of causing grievous bodily harm with intent.",
        "Content": "The family of a one-year-girl who died on the Isle of Wight have paid tribute to her after a man and woman were arrested in relation to her death. Jayla-Jean Mclaren died on Sunday, two days after she was taken to hospital with serious injuries. In a statement published by the Hampshire and Isle of Wight Constabulary on Thursday, her family said: \"Mummy, daddy, and nanny will always love you. Fly high princess.\" A 31-year-old man and a 27-year-old woman, both from Newport in South Wales, were previously arrested on suspicion of causing grievous bodily harm with intent. They have since been released on conditional bail pending further inquiries, police said. \"We know emotions are understandably high in the local community following news of this devastating incident,\" Detective Superintendent Rod Kenny said. Read more from Sky News:Homelessness minister resigns after rent hike claimsTropical storm to bring potential heatwaveSuperman actor joining ICE to 'save America' \"First and foremost, our thoughts remain with all who knew and loved Jayla-Jean,\" he continued. \"I want to reassure the community that our investigation remains ongoing, and we are working tirelessly to establish the full facts surrounding Jayla-Jean's death.\" He added: \"While we understand the community concern, we urge people not to speculate on the circumstances as this will cause further distress to those who knew Jayla-Jean and could impede the ongoing police investigation. \"We will provide further updates as soon as we are able to.\""
    },
    {
        "title": "Tropical Storm Dexter to bring potential heatwave next week",
        "description": "Remnants of Tropical Storm Dexter will bring an increase in temperatures over the weekend, with highs of 34C possible next week.",
        "url": "https://news.sky.com/story/tropical-storm-dexter-to-bring-potential-heatwave-next-week-13408278",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-weather-hyde-park-london_6985024.jpg?20250807175839",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-07 16:31:00",
        "Headline": "Temperatures of 28C are possible in the South on Sunday, reaching 30C across parts of England on Monday before getting closer to 34C on Tuesday.",
        "Content": "Remnants of Tropical Storm Dexter will bring an increase in temperatures over the weekend, with highs of 34C possible next week. A heatwave could be registered in parts of the South early next week and could spread more widely if temperatures hold. Temperatures of 28C (82F) are possible in the South on Sunday, reaching 30C (86F) across parts of England on Monday before getting closer to 34C (93F) on Tuesday. Check the weather forecast where you are Warm and muggy nights are to be expected, especially in the South. Conditions will be more unsettled in the North, with strong winds and rain at times. In its forecast the Met Office said Friday will be a brighter day for many, with sunny spells across southern and central areas and highs of 25-26C expected. Northern Scotland will be breezy with showery outbreaks of rain. Saturday will also see sunny spells for much of England and Wales, but there will be some rain in northern areas, particularly northern Scotland. A weather front moving in from the west will bring rain to Northern Ireland, parts of Scotland and possibly northern England by Sunday evening, while central and southern areas are expected to remain dry with sunny spells. Temperatures will begin to rise in the South from Sunday evening, as the remnants of Tropical Storm Dexter \"draws warm air up from the southwest across the UK\", the Met Office said. Temperatures are expected to exceed 30C across parts of central, southern and eastern England on Monday and Tuesday, the forecaster added. Read more from Sky News:What could happen when Trump and Putin meetCharity calls for clarity on commission's probe into Prince Harry claims \"We're confident that temperatures will increase markedly by the start of next week, reaching the low 30s Celsius in parts of England on Monday and perhaps the mid 30s in a few places on Tuesday,\" said Met Office deputy chief meteorologist Steven Keates. \"However, the length of this warm spell is still uncertain, and it is possible that high temperatures could persist further into next week, particularly in the south.\" \"Ex-Dexter sets the wheels in motion for an uptick in temperatures, but the weather patterns then maintaining any hot weather are rather more uncertain\"."
    },
    {
        "title": "Sentebale war of words continues as charity calls for clarity on commission's probe into Prince Harry claims ",
        "description": "The war of words over Sentebale is continuing, with the charity calling on the Charity Commission to provide clarity that its recent report did not specifically investigate claims of racism and misogyny against Prince Harry.&#160;",
        "url": "https://news.sky.com/story/sentebale-war-of-words-continues-as-charity-calls-for-clarity-on-commissions-probe-into-prince-harry-claims-13408120",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-prince-harry-sentebale_6867313.jpg?20250326102545",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-08-07 10:22:00",
        "Headline": "Sources close to Prince Harry claim Sentebale are \"rehashing unsubstantiated allegations of bullying, misogyny and more\", describing the charity's latest move as not \"just provocative, it's pitiful\".",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  The war of words over Sentebale is continuing, with the charity calling on the Charity Commission to provide clarity that its recent report did not specifically investigate claims of racism and misogyny against Prince Harry.  Sources close to the Duke of Sussex claim they are \"rehashing unsubstantiated allegations of bullying, misogyny and more\", describing their latest move as not \"just provocative, it's pitiful\". A source at Sentebale has told Sky News: \"We have written to The Charity Commission stating that the onus is on the commission to restate for the record that individual allegations of bullying have not been investigated or addressed in the commission's report.\" It comes after the Charity Commission report stated that \"based on the evidence provided and reviewed by the commission, it found no evidence of: widespread or systemic bullying or harassment, including misogyny or misogynoir at the charity\". However, the commission added that it \"acknowledged the strong perception of ill treatment felt by a number of parties to the dispute and the impact this may have had on them personally\". But sources at Sentebale believe the reporting around this statement - that Prince Harry has been cleared of bullying - has been inaccurate, as the charity watchdog did not specifically look at allegations made by the chair, Dr Sophie Chandauka, including during an exclusive interview on Sky News.  A source close to Prince Harry and the former board of trustees has hit back, and said: \"It's remarkable, just yesterday Ms Chanduaka was applauding the Charity Commission's findings, yet today, after a flurry of unflattering headlines, she's back on the warpath. \"Issuing yet another media statement only reinforces the commission's criticism about using the press to air internal disputes. \"Rehashing unsubstantiated allegations of bullying, misogyny and more, which the commission found no evidence of and dressing them up as veiled threats isn't just provocative, it's pitiful. \"If Ms Chanduaka has genuine concerns, she should spell them out plainly or, better yet, redirect her energy toward something truly worthwhile, like raising money for the children Sentebale exists to support.\" It's understood Prince Harry and his supporters have also been left unsatisfied by the scope of the report, including their concerns about money spent on consultants that was authorised by Dr Chandauka. Read more from Sky News:Family waits three years for justice after cyclist killedUK warned it risks exodus of 'disillusioned' doctorsWhat could a ceasefire between Russia and Ukraine involve? 👉 Listen to Sky News Daily on your podcast app 👈 Responding to Sky News, the Charity Commission said: \"We have issued the charity with an action plan which sets out steps the current trustees need to take to improve governance weaknesses and rectify findings of mismanagement. \"We now urge all involved to put their differences behind them and allow the charity to focus on its work and beneficiaries\". Their report, released on Wednesday, was highly critical of all parties for allowing their disagreement to play out so publicly and allowing it to severely impact the charity's reputation."
    },
    {
        "title": "Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer ",
        "description": "The economy is stagnating and job losses are mounting. Now is the time to cut interest rates again. ",
        "url": "https://news.sky.com/story/rachel-reeves-is-celebrating-the-bank-of-englands-interest-cut-8211-but-behind-the-scenes-she-has-little-to-cheer-13408289",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-port-talbot_6984747.jpg?20250807112401",
        "type": "UK",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 17:07:00",
        "Headline": "The Bank of England has cut the interest rate to 4% in its fifth reduction so far this year. On the other hand, though, the Bank upgraded its inflation forecasts. ",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  The economy is stagnating and job losses are mounting. Now is the time to cut interest rates again.  That was the view of the Bank of England's nine-member rate setting committee on Thursday. Well, at least five of them. The other four presented us with a different view: Inflation is above target and climbing - this is no time to cut interest rates.  Who is right? All of them and none of them. Central bankers have been backed into a corner by the current economic climate and navigating a path out is challenging. The difficulty in charting that route was on display as the Bank struggled to decide on the best course of monetary policy. The committee had to take it to a re-vote for the first time in the Bank's history.  On one side, central bankers - including Andrew Bailey - were swayed by the data on the economy. Growth is \"subdued\", they said, and job losses are mounting. This should weigh on wage increases, which are already moderating, and in turn inflation. One member, Alan Taylor, was so worried about the economy he initially suggested a larger half a percentage point cut. On the other side, their colleagues were alarmed by inflation. The Bank upgraded its inflation forecasts, with the headline index expected to hit 4% in September. In a blow to the chancellor, the September figure is used to uprate a number of benefits and pensions. The Bank lifted it from a previous forecast of 3.75%. In explaining the increase, the Bank blamed higher utility bills and food prices. Food price inflation could hit 5.5% this year, an increase driven by poor harvests, some expensive packaging regulations as well as higher employment costs arising from the Autumn Budget. When pressed by Sky News on the main contributor to that increase - poor harvests or government policy - the governor said: \"It's about 50-50.\" The Bank doesn't like to get political but nothing about this is flattering for the chancellor. The Bank said food retailers, including supermarkets, were passing on higher national insurance and living wage costs - the ones announced in the Autumn Budget - to customers. Economists at the Bank pointed out that food retailers employ a large proportion of low wage workers and are more vulnerable to the lowering of the national insurance threshold because they have a larger proportion of part-time workers. The danger doesn't end there. Read more:Who is worst hit by Trump's new tariffs?Chancellor doesn't rule out rising gambling taxes Of all the types of inflation, food price inflation is among the most dangerous. Households spend 11% of their disposable income, meaning higher food price inflation can play an outsized role in our perception of how high overall inflation in the economy is. When that happens, workers are more likely to push for pay rises, a dangerous loop that can lead to higher inflation. So while the chancellor is publicly celebrating the Bank's fifth interest rate cut in a year, behind the scenes she will have very little to cheer."
    },
    {
        "title": "Bromley burglary: £500,000 worth of gold stolen from home",
        "description": "Police have launched an appeal after &#163;500,000 worth of jewellery was stolen from a house in southeast London.",
        "url": "https://news.sky.com/story/bromley-burglary-163500000-worth-of-gold-stolen-from-home-13408213",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-burglary-jewellery_6984860.jpg?20250807134431",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-07 13:20:00",
        "Headline": "The Metropolitan Police said the burglary took place at a house in Bickley Road, Bromley, on 30 December last year, while the owners were at home.",
        "Content": " Police have launched an appeal after £500,000 worth of jewellery was stolen from a house in southeast London. The incident took place at a home in Bickley Road, Bromley, on 30 December last year. Footage showed three men entering the property through a forced bathroom window. The group, who entered the home at 5.40pm and left at 6.25pm, carried out the theft while the owners were home. The Metropolitan Police have now shared images of the stolen jewellery in a new appeal for information. No arrests have been made in connection with the burglary so far. Read more from Sky News:Charity criticises GHF aid sites in GazaSuperman actor says he is joining ICESentebale calls for clarity on commission's probe Detective Constable Jamie White, of the Met's South Area Command Unit, said: \"While the monetary value of this theft is enormous, the sentimental value is priceless - with many of the pieces being passed down through generations of the family. \"Helpfully, a number of the pieces stolen are unique, so we are hoping that releasing these photographs will jog someone's memory.\""
    },
    {
        "title": "19-year-old guilty of murdering another teenager in 'brutal' knife attack in Bedford",
        "description": "A 19-year-old has been convicted of stabbing another teenager to death in what police have described as a \"brutal and senseless\" attack.",
        "url": "https://news.sky.com/story/19-year-old-guilty-of-murdering-another-teenager-in-brutal-knife-attack-in-bedford-13408313",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bennett-ndenkeh-bedford_6985084.jpg?20250807191713",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-07 18:10:00",
        "Headline": "A detective described the assault as a \"senseless act of violence that has ended the life of a young man (with) so many years in front of him\".",
        "Content": "A 19-year-old has been convicted of stabbing another teenager to death in what police have described as a \"brutal and senseless\" attack. Thomas Taylor, 17, and two others were attacked close to Bedford bus station just before 6pm on Wednesday 8 January. Bennett Ndenkeh, 19, produced a knife and fatally stabbed Thomas. Emergency services were called to the scene in Greenhill Street and Thomas was taken to hospital, where he died shortly after arrival. Ndenkeh was found guilty of murder following a seven-week trial at Luton Crown Court. Riaz Miah, 18, was found not guilty of murder but convicted of manslaughter. Detectives used CCTV to track the offenders, who dispersed minutes after the stabbing, and Ndenkeh and Miah were arrested within three days of the attack. Miah told someone else who was at the altercation to \"no comment everything\" just hours before his arrest, messages on seized devices showed. Two other teenagers were found not guilty of murder, while the jury was unable to reach a verdict on a fifth defendant. During the trial, the court heard how Miah had been assaulted by someone linked to Thomas in the days before the stabbing. On the day itself, Miah and Thomas exchanged messages, with Thomas warning against retaliation, before agreeing to meet in the town centre where the fatal altercation took place. \"This was a brutal and senseless act of violence that has ended the life of a young man who had so many years and experiences still in front of him and devasted the lives of those who knew him,\" said Detective Chief Inspector Richard Stott from Bedfordshire Police. \"It has also drastically altered the path of the two people found guilty today - who are now facing the prospect of spending many of the prime years of their life behind bars.\" Ndenkeh and Miah will be sentenced on 10 October."
    },
    {
        "title": "Israeli security cabinet approves Netanyahu's plan to take full military control of Gaza",
        "description": "The Israeli security cabinet has approved Benjamin Netanyahu's plan to take full military control of Gaza, the prime minister's office said.",
        "url": "https://news.sky.com/story/netanyahu-faces-condemnation-over-plan-for-israel-to-take-full-military-control-of-gaza-13408401",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-gaza_6985236.jpg?20250808000159",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-07 22:28:00",
        "Headline": "To take full control of the enclave, Israel would need to launch ground operations in the areas that have not been destroyed, where most of Gaza's two million population have sought refuge.",
        "Content": " The Israeli security cabinet has approved Benjamin Netanyahu's plan to take full military control of Gaza, the prime minister's office said. Mr Netanyahu had made clear his desire for a full military occupation of Gaza on Thursday, before a cabinet meeting that ran into the night. Asked in a Fox News interview ahead of the meeting if Israel would \"take control of all of Gaza\", he replied: \"We intend to, in order to assure our security, remove Hamas there, enable the population to be free of Gaza.\" \"We don't want to keep it. We want to have a security perimeter,\" he continued. \"We want to hand it over to Arab forces that will govern it properly without threatening us and giving Gazans a good life.\" Israel already controls around 75% of Gaza and has largely sealed its borders. To take full control, it would need to launch ground operations in the remaining areas that have not been destroyed, where most of Gaza's two million population have sought refuge.  Plan will 'put hostages and soldiers in danger' The plan has been criticised by many, including families of hostages being held by Hamas and a top Israel Defence Forces (IDF) official. Einav Zangauker, the mother of hostage Matan Zangauker, said Mr Netanyahu promised her that he would pursue a deal to free the hostages. She said in a post on X: \"Someone who talks about a comprehensive deal doesn't go and conquer the Strip and put hostages and soldiers in danger. \"Netanyahu and his partners are about to condemn [Matan] to death.\" Israel's military chief of staff, Eyal Zamir, has warned against occupying Gaza, saying it would endanger the hostages and put further strain on the IDF, according to Israeli media reports. 👉 Listen to Sky News Daily on your podcast app 👈 In an illustration of the kind of opposition Israel could face internationally, a Jordanian official aid Arabs would \"only support what Palestinians agree and decide on\". \"Security in Gaza must be done through legitimate Palestinian institutions,\" the source said. \"Arabs will not be agreeing to Netanyahu's policies nor clean his mess.\"  At least 42 more Palestinians killed by Israeli fire, say hospitals It comes after at least 42 Palestinians were killed in Israeli airstrikes and shootings across southern Gaza on Thursday, according to local hospitals. At least 13 of those people were seeking aid in an Israeli military zone where UN aid convoys are regularly overwhelmed by desperate crowds and looters. Another two were killed on roads leading to sites run by the Israel - and US-backed Gaza Humanitarian Foundation (GHF), according to Nasser Hospital, which received the bodies. The GHF said there were no violent incidents at or near its sites on Thursday. Read more:Video of hostage released by HamasAid sites are scenes of 'orchestrated killing The war in Gaza began when Hamas killed about 1,200 people - mostly civilians - in its attack on 7 October 2023 and abducted 251 others. They still hold approximately 50 of those hostages - with 20 believed to be alive - after most of the others were released in ceasefires or other deals. Israel's retaliatory offensive has killed more than 61,000 Palestinians, according to Gaza's Hamas-run health ministry, which does not differentiate between militants and civilians in its count."
    },
    {
        "title": "Trump vowed to end Ukraine war in first 24 hours of his presidency  - nearly 200 days in, could he be close?",
        "description": "Seven hours is a long time in US politics.",
        "url": "https://news.sky.com/story/trump-vowed-to-end-ukraine-war-in-first-24-hours-of-his-presidency-nearly-200-days-in-could-he-be-close-13407980",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-white-house_6980468.jpg?20250802074400",
        "type": "World",
        "Author": "David Blevins",
        "Date Published": "2025-08-07 05:07:00",
        "Headline": "A White House official said on Wednesday that Donald Trump could meet with Vladimir Putin as early as next week. It suggests something shifted on a day when there was no expectation of a breakthrough.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  Seven hours is a long time in US politics. At 10am, Donald Trump accused Russia of posing a threat to America's national security. By 5pm, Mr Trump said there was a \"good prospect\" of him meeting Vladimir Putin \"soon\". There had, he claimed, been \"great progress\" in talks between his special envoy Steve Witkoff and the Russian president. It's difficult to gauge the chances of a meeting between the two leaders without knowing what \"great progress\" means. Is Russia \"inclined\" towards agreeing a ceasefire, as Ukraine's president now claims? Is Mr Putin prepared to meet with his Ukrainian foe, Volodymyr Zelenskyy, too? The very fact that we're asking those questions suggests something shifted on a day when there was no expectation of a breakthrough. Read more from Sky News:Woman told she may lose leg after liquid Brazilian butt liftZoo kills 12 healthy baboons to ease overcrowding Mr Trump repeatedly vowed to end the war within 24 hours of becoming president. On day 198 of his presidency, he might, just might, be one step closer to achieving that."
    },
    {
        "title": "Does Netanyahu want a 'forever war' in Gaza? ",
        "description": "<a href='https://podcasts.apple.com/us/podcast/sky-news-daily/id951048357' target='_blank'>👉 Listen to Sky News Daily on your podcast app 👈</a>        ",
        "url": "https://news.sky.com/story/does-netanyahu-want-a-forever-war-in-gaza-13408174",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-daily-podcast-070825_6984804.jpg?20250807122211",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-07 11:24:00",
        "Headline": "No subtitle found",
        "Content": "👉 Listen to Sky News Daily on your podcast app 👈  He's been warned against a full military occupation by 600 former Israeli military officials. But after 22 months of war, that's exactly what Benjamin Netanyahu wants. What would long-term occupation mean for Gazans, Israel, the Middle East and the world? What would it be like for those living in Gaza? Will the Israeli hostages be returned? And is there any other option in Netanyahu's eyes? Niall Paterson is joined on the Sky News Daily by a Palestinian aid worker in Gaza and Professor Yossi Mekelberg, senior consulting fellow for the Middle East and North Africa programme at Chatham House to answer those questions. To hear more on Gaza, Yalda Hakim speaks to author Anshel Pfeffer on the latest episode of The World with Richard Engel and Yalda Hakim. Producer: Alix CulbertsonEditor: Mike Bovill"
    },
    {
        "title": "Is a ceasefire in Ukraine finally on the table? Here's what we know - as fighting grinds on",
        "description": "Volodymyr Zelenskyy says Russia is \"more inclined\" towards a ceasefire but details of any potential deal remain scarce - including any concessions Kyiv or Moscow might be asked to make.",
        "url": "https://news.sky.com/story/is-a-ceasefire-in-ukraine-finally-on-the-table-heres-what-we-know-as-fighting-grinds-on-13408008",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-ukraine-kyiv_6984622.jpg?20250807085203",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-08-07 06:45:00",
        "Headline": "President Donald Trump's deadline for Russia to reach a peace deal with Ukraine or face severe economic penalties approaches, but will it work?",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n Volodymyr Zelenskyy says Russia is \"more inclined\" towards a ceasefire but details of any potential deal remain scarce - including any concessions Kyiv or Moscow might be asked to make. President Donald Trump said the meeting between his envoy Steve Witkoff and President Vladimir Putin on Wednesday delivered \"great progress\" but gave no specifics. An agreement has been reached for a meeting between the US and Russian leaders in the coming days, according to Russia. It's not the first time that negotiations over a possible pause to the fighting have ramped up, but none have ever yielded a cessation of hostilities on the battlefield in the years since the 2022 full-scale invasion. President Trump famously vowed to end the war in 24 hours after returning to the White House, a promise he did not fulfil. Follow latest: Trump open to Putin meeting on one condition  What has been happening on the battlefield? Discussion of a possible ceasefire - or negotiations towards one - has increased this week as we approach Mr Trump's deadline of August 8 for Russia to reach a peace deal with Ukraine or face severe economic penalties. Indian has already been hit with a 50% tariff on good coming into the US - in part a punishment for buying Russian oil. Meanwhile, on the battlefield, Russian forces have likely advanced to the outskirts of Kupyansk in north-eastern Ukraine, according to the Institute for the Study of War thinktank. The city was captured in the first wave of Russian advances in February 2022 but was liberated by Ukrainian forces in Kyiv's stunning counterattack later that year. Kremlin forces have continued to make slow battlefield gains along the frontline at the cost of heavy losses. Last week, President Putin said his troops had captured the town of Chasiv Yar after more than a year of fierce combat. The claimed capture, which would be Russia's most significant seizure in many months, was denied by Ukraine. What has Ukraine said about negotiations? After the Witkoff-Putin meeting, Ukrainian President Volodymyr Zelenskyy had a call with Mr Trump, joined by European allies. Speaking on social media on Thursday, Mr Zelenskyy said he hoped for \"real progress on the path to peace and guaranteeing Ukraine's independence under any circumstances\". \"The priorities are absolutely clear,\" he said. \"The first is to stop the killings, and it is Russia that must agree to a ceasefire. \"The second is a format for leaders so that the meeting can work for a truly lasting peace. We in Ukraine have said more than once that the search for real solutions can become truly effective precisely at the level of leaders. We need to decide on the time for such a format, with a range of issues. \"The third is the long-term nature of security. This is possible together with the United States and Europe.\" Putin 'playing a long game' It remains to be seen if Mr Putin is serious about negotiations or is simply playing along to placate President Trump. Former UK ambassador to Ukraine, Simon Smith, told Sky News that he has been \"playing a long game\". \"I think he's pretty certain in his own mind that time is on his side, that all he needs to do is to keep grinding on and wait for Ukraine, and the support for Ukraine, to buckle and to go away, and then he wins.\" \"So [any agreement] may be something like a short-term ceasefire or an agreement to stop particular kinds of military action or so on.\" Read more:India hints it will keep buying Russian oil  What has previously been discussed? When a pause in the fighting seemed like a prospect earlier this year, the US said both sides should agree to an immediate 30-day ceasefire, which could then be mutually extended. Mr Zelenskyy said back then that he was ready to agree to a ceasefire, following a meeting between his officials and US Secretary of State Marco Rubio in Saudi Arabia. The Ukrainian president added that the ceasefire proposal on the table back then was \"not only concerning rockets, drones, and bombs, not only in the Black Sea, but also along the entire front line\". There was no mention of territory, which may be the biggest obstacle to a lasting peace agreement. Russia claims a number of regions of Ukraine, including swathes of territory that its forces do not occupy, and has demanded these be handed over. Ukraine has vowed to recapture all its territory, including Crimea. There is also the matter of how any ceasefire or peace deal would be enforced, with Sir Keir Starmer and French President Emmanuel Macron's 'coalition of the willing' peacekeeping force idea likely to be discussed once again."
    },
    {
        "title": "Trump and Putin's first meeting in years does not necessarily mean a ceasefire in Ukraine",
        "description": "It could be diplomatic dynamite.",
        "url": "https://news.sky.com/story/diplomatic-dynamite-or-just-for-show-the-first-meeting-between-trump-and-putin-in-years-doesnt-necessarily-mean-a-ceasefire-13408149",
        "image_url": "https://e3.365dm.com/22/02/1920x1080/skynews-vladimir-putin-donald-trump_5683209.jpg?20220223113641",
        "type": "World",
        "Author": "Ivor Bennett",
        "Date Published": "2025-08-07 10:44:00",
        "Headline": "If NBC's reports are correct, that a Putin-Trump summit is conditional on the Russian president meeting with Ukrainian leader Volodymyr Zelenskyy, then the summit may not happen at all.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  It could be diplomatic dynamite. The first meeting between a sitting US and Russian president in more than four years, following one of the bleakest periods in the history of their countries' bilateral relations. But a Putin-Trump summit does not necessarily mean there will be a ceasefire. Ukraine war latest: Kremlin aide's full statement on Trump-Putin talks On the one hand, it could signal that a point of agreement has been reached and a face-to-face meeting is needed to seal the deal. That has always been Russia's stance. It's consistently said it would only meet at a presidential level if there's something to agree on. On the other hand, there might not be anything substantive. It might just be for show. \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Donald Trump holds White House ceremony\n                 \n                  Trump will meet Putin even if Russian leader refuses to meet Zelenskyy\n                  It might just be the latest attempt by the Kremlin to diffuse Donald Trump's anger and dodge his deadline to end the war by Friday or face sanctions. It would give Trump something that can be presented as progress, but in reality, it delivers anything but. After all, there has certainly not been any sign that Moscow is willing to soften its negotiating position or step back from its goals on the battlefield. Tellingly, perhaps, it's this latter view which has been taken by some of the Russian press on Thursday. \"Putin won\" is the headline in Moskovsky Komsomolets regarding the Kremlin leader's meeting with Witkoff. The state-run tabloid quotes a political scientist, Marat Bashirov, who claims Putin \"bought time\" ahead of Friday's deadline. \"It is noteworthy that in his rhetoric [on sanctions] Trump did not mention Russia at all,\" the paper notes. Komsomolskaya Pravda is similarly dismissive. \"Donald Trump has two simple interests in connection with Ukraine: to earn money for America, and political whistles and the Nobel Peace Prize for himself,\" it says. \"Russia has its own interests,\" it adds, \"securing them is what Vladimir Putin will seek at a meeting with Trump.\" At this stage, the most likely location is the United Arab Emirates. Putin met the country's president in the Kremlin today, and afterwards said it would be a \"suitable location\". It felt like a strong hint. And the UAE certainly makes sense. It's played mediator for a number of the prisoner swaps between Russia and Ukraine; it has good relations with the US (and was one of Trump's stops on his recent Middle East tour); and most importantly for Moscow, it's not a member of the International Criminal Court. So Putin doesn't have to worry about being arrested. But if NBC's reports are correct, that a Putin-Trump summit is conditional on the Russian president meeting with Ukrainian leader Volodymyr Zelenskyy, then the summit may not happen at all. Read more on Russia and Ukraine:Trump went from frustration to a possible Putin meeting in hoursWhat could a ceasefire between Russia and Ukraine involve?India hints it will keep buying Russian oil - despite Trump threats Until now, Putin has refused to meet Zelenskyy, despite numerous demands from Kyiv, because he views him as illegitimate. The Kremlin said the prospect of a trilateral meeting between the leaders was mentioned by Witkoff on Wednesday, but the proposal was left \"completely without comment\" by Russia."
    },
    {
        "title": "Trump and Putin's first meeting in years does not necessarily mean a ceasefire in Ukraine",
        "description": "It could be diplomatic dynamite.",
        "url": "https://news.sky.com/story/diplomatic-dynamite-or-just-for-show-the-first-meeting-between-trump-and-putin-in-years-doesnt-necessarily-mean-a-ceasefire-13408149",
        "image_url": "https://e3.365dm.com/22/02/1920x1080/skynews-vladimir-putin-donald-trump_5683209.jpg?20220223113641",
        "type": "US",
        "Author": "Ivor Bennett",
        "Date Published": "2025-08-07 10:44:00",
        "Headline": "If NBC's reports are correct, that a Putin-Trump summit is conditional on the Russian president meeting with Ukrainian leader Volodymyr Zelenskyy, then the summit may not happen at all.",
        "Content": "\n          Moscow correspondent\n              @IvorBennett\n  It could be diplomatic dynamite. The first meeting between a sitting US and Russian president in more than four years, following one of the bleakest periods in the history of their countries' bilateral relations. But a Putin-Trump summit does not necessarily mean there will be a ceasefire. Ukraine war latest: Kremlin aide's full statement on Trump-Putin talks On the one hand, it could signal that a point of agreement has been reached and a face-to-face meeting is needed to seal the deal. That has always been Russia's stance. It's consistently said it would only meet at a presidential level if there's something to agree on. On the other hand, there might not be anything substantive. It might just be for show. \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Donald Trump holds White House ceremony\n                 \n                  Trump will meet Putin even if Russian leader refuses to meet Zelenskyy\n                  It might just be the latest attempt by the Kremlin to diffuse Donald Trump's anger and dodge his deadline to end the war by Friday or face sanctions. It would give Trump something that can be presented as progress, but in reality, it delivers anything but. After all, there has certainly not been any sign that Moscow is willing to soften its negotiating position or step back from its goals on the battlefield. Tellingly, perhaps, it's this latter view which has been taken by some of the Russian press on Thursday. \"Putin won\" is the headline in Moskovsky Komsomolets regarding the Kremlin leader's meeting with Witkoff. The state-run tabloid quotes a political scientist, Marat Bashirov, who claims Putin \"bought time\" ahead of Friday's deadline. \"It is noteworthy that in his rhetoric [on sanctions] Trump did not mention Russia at all,\" the paper notes. Komsomolskaya Pravda is similarly dismissive. \"Donald Trump has two simple interests in connection with Ukraine: to earn money for America, and political whistles and the Nobel Peace Prize for himself,\" it says. \"Russia has its own interests,\" it adds, \"securing them is what Vladimir Putin will seek at a meeting with Trump.\" At this stage, the most likely location is the United Arab Emirates. Putin met the country's president in the Kremlin today, and afterwards said it would be a \"suitable location\". It felt like a strong hint. And the UAE certainly makes sense. It's played mediator for a number of the prisoner swaps between Russia and Ukraine; it has good relations with the US (and was one of Trump's stops on his recent Middle East tour); and most importantly for Moscow, it's not a member of the International Criminal Court. So Putin doesn't have to worry about being arrested. But if NBC's reports are correct, that a Putin-Trump summit is conditional on the Russian president meeting with Ukrainian leader Volodymyr Zelenskyy, then the summit may not happen at all. Read more on Russia and Ukraine:Trump went from frustration to a possible Putin meeting in hoursWhat could a ceasefire between Russia and Ukraine involve?India hints it will keep buying Russian oil - despite Trump threats Until now, Putin has refused to meet Zelenskyy, despite numerous demands from Kyiv, because he views him as illegitimate. The Kremlin said the prospect of a trilateral meeting between the leaders was mentioned by Witkoff on Wednesday, but the proposal was left \"completely without comment\" by Russia."
    },
    {
        "title": "OpenAI releases long-awaited GPT-5 AI chatbot upgrade",
        "description": "GPT-5, the long-awaited upgrade to the ChatGPT AI chatbot, has been released by its maker OpenAI.",
        "url": "https://news.sky.com/story/openai-releases-long-awaited-gpt-5-ai-chatbot-upgrade-13408324",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-gpt-5_6985155.jpg?20250807213020",
        "type": "US",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-07 18:33:00",
        "Headline": "It's been one of the most highly anticipated launches in Silicon Valley after OpenAI's first offering ChatGPT - powered by its GPT-3 model - kick-started the current AI boom in late 2022.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n GPT-5, the long-awaited upgrade to the ChatGPT AI chatbot, has been released by its maker OpenAI. It has been one of the most highly anticipated launches in Silicon Valley after OpenAI's first offering ChatGPT - powered by its GPT-3 model - kick-started the current AI boom in late 2022. \"GPT-3 sort of felt like talking to a high school student,\" said Sam Altman, OpenAI's chief executive. \"GPT-4, maybe it was like talking to a college student. But with GPT-5, now it's like talking to an expert, a PhD-level expert in anything, any area you need, on demand.\"  At the launch event, OpenAI claimed the new chatbot, which will be released to all ChatGPT users on Thursday, was more than a simple upgrade to its previous offerings. According to OpenAI, the new model exceeds the chatbot competition from the likes of Google, X and Antropic on \"benchmarks\" - standardised tests used to rank models. \n                  Tech giant OpenAI signs deal with government to boost efficiency in public services\n                 \n                  OpenAI boss Sam Altman denies sister's sexual abuse lawsuit claims\n                 \n                  Scarlett Johansson speaks out about clash with OpenAI\n                 OpenAI claims it has been designed to be easier and more natural to communicate with, better at writing prose and advanced computer code, solving academic questions from mathematics to law, assisting with healthcare-related questions, as well as being safer than its predecessors. \"It's an incredible superpower on demand,\" claimed Mr Altman. The model is also more intelligent in how it uses its own brain power - and therefore an expensive computing resource - according to OpenAI. It is a hybrid of previous chatbots and slower, more computing-intensive \"reasoning\" models like OpenAI's Deep Research. Based on a user's request, the model will decide how much \"thinking\" is required before answering, rather than requiring the user to switch between different models. Although AI enthusiasts who had been expecting GPT-5 to represent \"artificial general intelligence [AGI]\" will be disappointed. Despite this being OpenAI's stated goal, Mr Altman billed GPT-5 as a \"major upgrade\" to GPT-4 and a \"significant step along the path to AGI\". But they're clearly not there yet.  A real test of GPT-5 will be whether it sells. OpenAI is projected to spend $8bn (£6bn) this year, on top of $5bn (£3.7bn) last year, and while it is expected to make a profit this year, the business case for increasingly powerful AI models is still not clear to many investors. Given a single training run for GPT-5 is rumoured to have cost $500m (£373m), there will be an expectation the new model is significantly more useful to business users. Despite a very slick demonstration of its coding skills at the launch presentation, where it built an online language learning game in seconds, GPT-5 will have to prove its worth for professional coding. Many in the tech industry prefer Anthropic AI's Claude model to write code. OpenAI and its investors will be hoping GPT-5 changes that. AI experts will also be testing GPT-5's tendency to \"hallucinate\", an issue OpenAI claims to have improved with GPT-5. But erroneous or bizarre answers are a problem that dogs all large generative AI models. \"Shiny things are always fun to play with, and I fully expect GPT-5 to be the shiniest so far,\" said Gary Marcus, a cognitive scientist at New York University and AI commentator. \"But that doesn't mean that it is a critical step on the optimal path to AI that we can trust,\" Mr Marcus added in a post."
    },
    {
        "title": "Ex-Superman Dean Cain to join ICE 'ASAP' to 'save America'",
        "description": "Dean Cain has been branded the \"worst superman ever\" as he announced he will join the US Immigration and Customs Enforcement (ICE) \"ASAP\".",
        "url": "https://news.sky.com/story/ex-superman-dean-cain-to-join-ice-asap-to-save-america-13408113",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dean-cain-superman_6984880.jpg?20250807140456",
        "type": "US",
        "Author": "Claire Gilbody-Dickerson",
        "Date Published": "2025-08-07 09:35:00",
        "Headline": "Cain, 59 and who was cast as Superman in the TV series Lois & Clark: The New Adventures of Superman, announced he had joined the team amid the federal agency's unprecedented immigration raids.",
        "Content": "\n          Reporter\n              @ClaireGilbodyD\n Dean Cain has been branded the \"worst superman ever\" as he announced he will join the US Immigration and Customs Enforcement (ICE) \"ASAP\". The 59-year-old, who was cast as Superman in the TV series Lois & Clark: The New Adventures of Superman, announced he had joined the team amid the federal agency's unprecedented immigration raids. He told Fox News on Wednesday his recruitment video on Instagram had gone viral and since then, \"I have spoken with some of the officials over at ICE and I will be sworn in as an ICE agent ASAP\". \"You can defend your homeland and get great benefits,\" he said in the Instagram post where he appealed for his followers to join ICE. Speaking with the Superman theme song in the background, he said \"hundreds of thousands of criminals\" had been arrested since US President Donald Trump took office. He then told his followers they would get a series of benefits if they joined ICE, including a $50,000 (£37,407) signing bonus and student loan repayment.  Read more: Farmer becomes first person to die during Trump's ICE raidsMeet the volunteers leading the fight against Trump's immigration raids \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Trump and Putin's first meeting in years does not necessarily mean a ceasefire in Ukraine\n                 \n                  OpenAI releases long-awaited GPT-5 AI chatbot upgrade\n                 \"If you want to help save America ICE is arresting the worst of the worst and removing them from America's streets,\" he said, before adding: \"I voted for that.\" ICE agents are under pressure from the White House to boost their deportation numbers in line with Mr Trump's campaign promise to crack down on illegal immigration. Cain's post on Instagram received some backlash, with one user commenting: \"Worst superman ever\". Another said: \"Shame on you Dean - that's the most un-Superman thing you could possibly advocate.\" One fan turned against him and said: \"Until I saw this I was such a fan. What a sad human being you must be.\""
    },
    {
        "title": "Diddy plotting return to music with Madison Square Garden gig, his lawyer says",
        "description": "Disgraced hip hop mogul Sean \"Diddy\" Combs is hoping to make a comeback to music with a concert at Madison Square Garden, his lawyer has said.",
        "url": "https://news.sky.com/story/diddy-plotting-return-to-music-with-madison-square-garden-gig-his-lawyer-says-13408196",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2010_6983152.jpg?20250805092129",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-07 12:42:00",
        "Headline": "It follows reports the rapper has been in contact with Donald Trump about a pardon after being convicted of prostitution-related offences.",
        "Content": "Disgraced hip hop mogul Sean \"Diddy\" Combs is hoping to make a comeback to music with a concert at Madison Square Garden, his lawyer has said. On Tuesday, the rapper was denied bail ahead of his sentencing in October, when he could face up to 20 years in prison after he was convicted of prostitution-related offences. The sentence, however, will likely be much shorter than that. Speaking to CBS News, the rapper's lawyer Marc Agnifilo said Combs told him \"he's going to be back at Madison Square Garden\", the iconic arena in New York City.    Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs In July, Combs was found guilty of two counts of transportation for prostitution - but cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. Combs, who co-founded Bad Boy Records and launched the career of the late Notorious BIG, was for decades a huge figure in pop culture - as well as a Grammy-winning artist and entrepreneur, who presided over an empire ranging from fashion to reality TV.  Now, as well as the criminal conviction, he is also facing several civil lawsuits. It follows recent reports that Combs has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team told Sky News' US partner network NBC News. A White House spokesperson said it \"will not comment on the existence or nonexistence of any clemency request\"."
    },
    {
        "title": "Trump vowed to end Ukraine war in first 24 hours of his presidency  - nearly 200 days in, could he be close?",
        "description": "Seven hours is a long time in US politics.",
        "url": "https://news.sky.com/story/trump-vowed-to-end-ukraine-war-in-first-24-hours-of-his-presidency-nearly-200-days-in-could-he-be-close-13407980",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-white-house_6980468.jpg?20250802074400",
        "type": "US",
        "Author": "David Blevins",
        "Date Published": "2025-08-07 05:07:00",
        "Headline": "A White House official said on Wednesday that Donald Trump could meet with Vladimir Putin as early as next week. It suggests something shifted on a day when there was no expectation of a breakthrough.",
        "Content": "\n          US correspondent\n              @skydavidblevins\n  Seven hours is a long time in US politics. At 10am, Donald Trump accused Russia of posing a threat to America's national security. By 5pm, Mr Trump said there was a \"good prospect\" of him meeting Vladimir Putin \"soon\". There had, he claimed, been \"great progress\" in talks between his special envoy Steve Witkoff and the Russian president. It's difficult to gauge the chances of a meeting between the two leaders without knowing what \"great progress\" means. Is Russia \"inclined\" towards agreeing a ceasefire, as Ukraine's president now claims? Is Mr Putin prepared to meet with his Ukrainian foe, Volodymyr Zelenskyy, too? The very fact that we're asking those questions suggests something shifted on a day when there was no expectation of a breakthrough. Read more from Sky News:Woman told she may lose leg after liquid Brazilian butt liftZoo kills 12 healthy baboons to ease overcrowding Mr Trump repeatedly vowed to end the war within 24 hours of becoming president. On day 198 of his presidency, he might, just might, be one step closer to achieving that."
    },
    {
        "title": "Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite",
        "description": "What do we do about the non-doms?&#160;",
        "url": "https://news.sky.com/story/why-rachel-reeves-may-want-to-rethink-one-of-her-pivotal-policies-13408251",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6985238.jpg?20250808003624",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 15:05:00",
        "Headline": "As the chancellor tries to shore up the public finances, there are signs her policy to grab billions from non-doms may be backfiring. And with doubts over those calculations anyway, the policy may even result in lower tax revenues.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  What do we do about the non-doms?  It's a question more than a handful of people have been asking themselves at the Treasury lately. Politics Hub: Follow latest updates It had seemed simple enough. In her first budget as chancellor, Rachel Reeves promised a crackdown on the non-dom regime, which for the past 200 years has allowed residents to declare they are permanently domiciled in another country for tax purposes. Under the scheme, non-doms, some of the richest people in the country, were not taxed on their foreign incomes. Then that all changed. Standing at the despatch box in October last year, the chancellor said: \"I have always said that if you make Britain your home, you should pay your tax here. So today, I can confirm we will abolish the non-dom tax regime and remove the outdated concept of domicile from the tax system from April 2025.\" The hope was that the move would raise £3.8bn for the public purse. However, there are signs that the non-doms are leaving in such great numbers that the policy could end up costing the UK investment, jobs and, of course, the tax that the non-doms already pay on their UK earnings. If the numbers don't add up, this tax-raising policy could morph into an act of self-harm. With the budget already under strain, a poor calculation would be costly financially. The alternative, a U-turn, could be expensive for other reasons, eroding faith in a chancellor who has already been on a turbulent ride. So, how worried should she be? The data on the number of non-doms in the country is published with a considerable lag. So, it will be a while before we know the full impact of this policy. However, there is much uncertainty about how this group will behave. While the Office for Budget Responsibility forecast that the policy could generate £3.8bn for the government over the next five years, assuming between 12 and 25% of them leave, it admitted it lacked confidence in those numbers. Worryingly for ministers, there are signs, especially in London, that the exodus could be greater. Property sales Analysis from the property company LonRes, shows there were 35.8% fewer transactions in May for properties in London's most exclusive postcodes compared with a year earlier and 33.5% fewer than the pre-pandemic average. Estate agents blame falling demand from non-dom buyers. This comes as no surprise to Magda Wierzycka, a South African billionaire businesswoman, who runs an investment fund in London. She herself is threatening to leave the UK unless the government waters down its plans. \"Non-doms are leaving, as we speak, and the problem with numbers is that the consequences will only become known in the next 12 to 18 months,\" she said. \"But I have absolutely no doubt, based on people I know who have already left, that the consequences would be quite significant. \"It's not just about the people who are leaving that everyone is focusing on. It's also about the people who are not coming, people who would have come, set up businesses, created jobs, they're not coming. They take one look at what has happened here, and they're not coming.\" Lack of options for non-doms But where will they go? Britain was unusual in offering such an attractive regime. Bar a few notable exceptions, such as Italy, most countries run residency-based tax systems, meaning people pay tax to the country in which they live. This approach meant many non-doms escaped paying tax on their foreign income altogether because they didn't live in those countries where they earned their foreign income. In any case, widespread double taxation treaties mean people are generally not taxed twice, although they may have to pay the difference. In one important sense, Magda is right. It could take a while before the consequences are fully known. There are few firm data points for us to draw conclusions from right now, but the past could be illustrative. Read more on Sky News:Reeves warned over tax risesWhat is a wealth tax?  The non-dom regime has been through repeated reform. George Osborne changed the system back in 2017 to limit it to just 15 years. Then Jeremy Hunt announced the Tories would abolish the regime altogether in one of his final budgets. Following the 2017 reforms there was an initial shock, but the numbers stabilised, falling just 5% after a few years. The data suggests there was an initial exodus of people who were probably considering leaving anyway, but those who remained - and then arrived - were intent on staying in the UK. So, should the government look through the numbers and hold its nerve? Not necessarily. Have Labour crossed a red line? Stuart Adam, a senior economist at the Institute for Fiscal Studies, said the response could be far greater this time because of some key changes under Labour. The government will no longer allow non-doms to protect money held in trusts, so 40% inheritance tax will be due on their estates. For many, that is a red line.  Mr Adam said: \"The 2017 reform deliberately built in what you might call a loophole, a way to avoid paying a lot more tax through the use of existing offshore trusts. That was a route deliberately left open to enable many people to avoid the tax. \"So it's not then surprising that they didn't up sticks and leave. Part of the reform that was announced last year was actually not having that kind of gap in the system to enable people to avoid the tax using trusts, and therefore you might expect to see a bigger response to the kind of reforms we've seen announced now, but it also means we don't have very much idea about how big a response to expect.\" With the public finances under considerable pressure, that will offer little comfort to a chancellor who is operating on the finest of margins."
    },
    {
        "title": "Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer ",
        "description": "The economy is stagnating and job losses are mounting. Now is the time to cut interest rates again. ",
        "url": "https://news.sky.com/story/rachel-reeves-is-celebrating-the-bank-of-englands-interest-cut-8211-but-behind-the-scenes-she-has-little-to-cheer-13408289",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-port-talbot_6984747.jpg?20250807112401",
        "type": "Business",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 17:07:00",
        "Headline": "The Bank of England has cut the interest rate to 4% in its fifth reduction so far this year. On the other hand, though, the Bank upgraded its inflation forecasts. ",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  The economy is stagnating and job losses are mounting. Now is the time to cut interest rates again.  That was the view of the Bank of England's nine-member rate setting committee on Thursday. Well, at least five of them. The other four presented us with a different view: Inflation is above target and climbing - this is no time to cut interest rates.  Who is right? All of them and none of them. Central bankers have been backed into a corner by the current economic climate and navigating a path out is challenging. The difficulty in charting that route was on display as the Bank struggled to decide on the best course of monetary policy. The committee had to take it to a re-vote for the first time in the Bank's history.  On one side, central bankers - including Andrew Bailey - were swayed by the data on the economy. Growth is \"subdued\", they said, and job losses are mounting. This should weigh on wage increases, which are already moderating, and in turn inflation. One member, Alan Taylor, was so worried about the economy he initially suggested a larger half a percentage point cut. On the other side, their colleagues were alarmed by inflation. The Bank upgraded its inflation forecasts, with the headline index expected to hit 4% in September. In a blow to the chancellor, the September figure is used to uprate a number of benefits and pensions. The Bank lifted it from a previous forecast of 3.75%. In explaining the increase, the Bank blamed higher utility bills and food prices. Food price inflation could hit 5.5% this year, an increase driven by poor harvests, some expensive packaging regulations as well as higher employment costs arising from the Autumn Budget. When pressed by Sky News on the main contributor to that increase - poor harvests or government policy - the governor said: \"It's about 50-50.\" The Bank doesn't like to get political but nothing about this is flattering for the chancellor. The Bank said food retailers, including supermarkets, were passing on higher national insurance and living wage costs - the ones announced in the Autumn Budget - to customers. Economists at the Bank pointed out that food retailers employ a large proportion of low wage workers and are more vulnerable to the lowering of the national insurance threshold because they have a larger proportion of part-time workers. The danger doesn't end there. Read more:Who is worst hit by Trump's new tariffs?Chancellor doesn't rule out rising gambling taxes Of all the types of inflation, food price inflation is among the most dangerous. Households spend 11% of their disposable income, meaning higher food price inflation can play an outsized role in our perception of how high overall inflation in the economy is. When that happens, workers are more likely to push for pay rises, a dangerous loop that can lead to higher inflation. So while the chancellor is publicly celebrating the Bank's fifth interest rate cut in a year, behind the scenes she will have very little to cheer."
    },
    {
        "title": "Alchemy spots window to sell home improvements group Anglian",
        "description": "The backer of one of Britain's biggest home improvement specialists is plotting a sale that would close the door on one of the longest ownership periods in the private equity industry's history.",
        "url": "https://news.sky.com/story/alchemy-spots-window-to-sell-home-improvements-group-anglian-13408095",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-conservatory-back-garden_6127214.jpg?20230420092151",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-07 08:55:00",
        "Headline": "The buyout firm is close to hiring bankers for an auction which could bring an end to a quarter of a century as the owner of one of Britain's biggest installers of double-glazing, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The backer of one of Britain's biggest home improvement specialists is plotting a sale that would close the door on one of the longest ownership periods in the private equity industry's history. Sky News has learnt that Alchemy Partners is preparing to appoint investment bankers to sell Anglian Home Improvements, the provider of windows, doors and home extensions. Sources said an auction of the business was likely to kick off in the next 12 months. Money latest: Best countries for Britons to retire ranked One source estimated that the company could be worth in excess of £100m, although a more precise valuation was unclear on Thursday. Alchemy, which specialises in acquiring distressed businesses before improving their performance and selling them on, has owned Anglian in various forms since 2001. The company has been reshaped several times since its original investment. \n                  Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite\n                 \n                  Money blog: Interest rate cut to lowest level since 2023 - as state pension set for 4-5% rise\n                 \n                  Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer \n                 Alchemy took Anglian private in 2001 through a recommended cash offer worth about £160m. At the time, Alchemy was run by Jon Moulton, one of the pioneers of Britain's private equity industry and who later went on to own Anglian's rival double-glazing, Everest, through his subsequent buyout venture, Better Capital. Since then, Anglian has swooped on a number of troubled rivals, including Safestyle in 2023, before acquiring Everest's brand and other assets the following year. Alchemy declined to comment."
    },
    {
        "title": "Aberdeen to introduce 7% 'tourist tax' on visitors",
        "description": "Councillors have given the green light for the introduction of a 7% visitor levy for Aberdeen.",
        "url": "https://news.sky.com/story/aberdeen-to-introduce-7-tourist-tax-on-visitors-13408048",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-aberdeen-aberdeen-harbour_6984648.jpg?20250807093707",
        "type": "Business",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-08-07 10:45:00",
        "Headline": "The levy will bring Aberdeen in line with other visitor hot spots, including Venice, Barcelona, Amsterdam and New York.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Councillors have given the green light for the introduction of a 7% visitor levy for Aberdeen. The \"tourist tax\" will not come into force until at least April 2027, but it is expected to generate millions of pounds a year that will be reinvested back into the city. The charge for overnight stays will apply to paid accommodation, including hotels, B&Bs, hostels, guest houses, camping sites, caravan parks, and vessels that are permanently or predominantly situated in one place. Cruise ships and motor homes will be exempt from the levy, as well as those in receipt of disability payments. A report to Aberdeen City Council's finance and resources committee said that with the average hotel room costing about £70, the levy would cost an extra £4.90 per night. On that basis, the new charge could generate up to £6.8m a year. Funds raised will be put towards projects that help enhance leisure and business tourism in the city. The committee approved the levy on Wednesday. It will bring Aberdeen in line with other visitor hot spots, including Venice, Barcelona, Amsterdam and New York. Councillor Alex McLellan, committee convener, said: \"The income generated from the visitor levy, paid by those visiting the city, will provide a huge boost to our local economy and allow us to invest in bringing major events and conferences here on a more regular basis. \"Across Europe we are paying similar amounts to stay per night subsidising their thriving economies, and we should do the same to ensure we can compete in terms of attracting both business and leisure tourism to Aberdeen.\" Read more from Sky News:Chancellor warned 'substantial tax rises' neededThe state of play as Trump's country-specific tariffs take effect The levy comes after Holyrood last year passed legislation giving councils across Scotland the ability to introduce such a charge. Both Edinburgh and Glasgow have approved a 5% levy on overnight stays in hotels, short-term lets and B&Bs. Edinburgh's tourist tax will come into force from 24 July 2026, while Glasgow's will follow on 25 January 2027. Stephen Gow, chair of VisitAberdeenshire, said: \"A well-managed scheme that supports the aims of the region's destination strategy will drive continued growth of Aberdeen's visitor economy. \"Aberdeen welcomed 2.2 million overnight visits in 2024, contributing to an economic impact from tourism of over £500m. \"The headroom for growth in the leisure and conference sectors will be fulfilled through effective investment in promotion, events, and development of the tourism sector.\""
    },
    {
        "title": "Chancellor doesn't rule out raising gambling taxes after report said it could lift 500,000 children out of poverty",
        "description": "The chancellor has declined to rule out raising taxes on gambling after a thinktank said the move could raise &#163;3.2bn for the public coffers and cover the cost of lifting 500,000 children out of poverty.",
        "url": "https://news.sky.com/story/chancellor-doesnt-rule-out-raising-gambling-taxes-after-report-said-it-could-lift-500000-children-out-of-poverty-13408154",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gambling-tax_6984771.jpg?20250807121105",
        "type": "Business",
        "Author": "Ben Bloch",
        "Date Published": "2025-08-07 12:41:00",
        "Headline": "Raising taxes on online casinos, as well as slots and gaming machines, could raise enough money to scrap the two-child benefit cap, a thinktank says.",
        "Content": "\n          Political reporter\n              @realBenBloch\n The chancellor has declined to rule out raising taxes on gambling after a thinktank said the move could raise £3.2bn for the public coffers and cover the cost of lifting 500,000 children out of poverty. According to the Institute for Public Policy Research (IPPR), hiking taxes on online casinos and slot machines could raise enough revenue to fund scrapping the two-child benefit cap, with the organisation arguing that there is \"no other measure which provides comparable headline child poverty reduction per pound spent\". The proposals have been backed by former prime minister Gordon Brown, but the Betting and Gaming Council says they are \"economically reckless\" and could drive punters towards the black market. The chancellor has not ruled out taking forward the proposals, telling broadcasters that a review into gambling taxes is under way, and policies will be set out at the budget in the autumn. Money blog: Interest rate cut to lowest level in more than two years The IPPR says in its report that the chancellor should consider increasing taxes on online casinos from 21% to 50% and raising those on slots and gaming machines from 20% to 50%, as well as raising general betting duty on non-racing bets from 15% to 25% which it said would bring other sports in line with the rates paid by horse racing. These measures could bring in £3.2bn for the Treasury, which would cover the cost of lifting the two-child benefit cap. \n                  Gardener wins High Court case against Paddy Power over £1m jackpot - after betting firm only paid her £20,000\n                 \n                  Stake, Everton's shirt sponsor, will leave UK gambling market as advert investigated\n                 \n                  Roblox: How kids are being lured into online casinos\n                 The cap was introduced by the Conservative government in April 2017, and it restricts universal credit and child tax credits to the first two children in a family, where the third or subsequent children are born after this date. According to the thinktank's analysis of data from the Department for Work and Pensions, 115,000 families are affected, with an average financial impact of £60 per week. Overall, the policy is keeping over 450,000 in poverty currently, which is set to rise to 550,000 by the end of the decade, it adds. The IPPR says raising these taxes is unlikely to reduce overall revenue for the Exchequer because firms are likely to \"seek to protect their bottom lines by worsening odds\", which means a \"strong possibility of higher government revenue\" than their forecasts expect. 'An investment in our children's future' Henry Parkes, principal economist and head of quantitative research at IPPR, said in a statement: \"The gambling industry is highly profitable, yet is exempt from paying VAT and often pays no corporation tax, with many online firms based offshore. It is also inescapable that gambling causes serious harm, especially in its most high-stakes forms. \"Set against a context of stark and rising levels of child poverty, it only feels fair to ask this industry to contribute a little more.\" Progressive campaign group 38 Degrees has started a petition calling on the government to implement the proposals, and former prime minister Gordon Brown said in a statement: \"Gambling will not build a brighter future for our children. But taxing it properly might just get them properly nourished. Decent clothes. A warm bed. And the full stomachs that let them fill their brains in school. \"Taxing the betting industry to support our children won't be a gamble. It will be an investment in their future. One where everyone wins.\"  Proposals 'would do more harm than good' The government has long been facing calls from its own backbenches to scrap the two-child benefit cap, and has not ruled it out doing so as part of a broader package of measures to tackle child poverty, due to be published in the autumn. Speaking to broadcasters this afternoon, Chancellor Rachel Reeves said she speaks to the former premier \"regularly\", and, like him, is \"deeply concerned around the levels of child poverty in Britain\". She continued: \"We're a Labour government. Of course we care about child poverty. That's why one of the first things we did as a government was to set up a child poverty taskforce that will be reporting in the autumn and respond to it then. \"And on gambling taxes, we've already launched a review into gambling taxes. We're taking evidence on that at the moment and, again, we'll set out our policies in the normal way, in our budget later this year.\" But the Betting and Gaming Council says raising taxes on its members is not a sound way of funding measures to reduce poverty, with a spokesperson saying the proposals are \"economically reckless, factually misleading, and risk driving huge numbers to the growing, unsafe, unregulated gambling black market, which doesn't protect consumers and contributes zero tax\". They added: \"Further tax rises, fresh off the back of government reforms which cost the sector over a billion in lost revenue, would do more harm than good - for punters, jobs, growth and public finances.\""
    },
    {
        "title": "Homelessness minister Rushanara Ali resigns after 'extortionate' rent hike claims",
        "description": "Homelessness minister Rushanara Ali has resigned after reportedly hiking the rent on a property she owns by hundreds of pounds - something described by one of her tenants as \"extortion\". ",
        "url": "https://news.sky.com/story/labours-homelessness-minister-rushanara-ali-resigns-after-rent-hike-claims-13408249",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rushanara-ali-bethnal-green_6984791.jpg?20250807121645",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-07 19:17:00",
        "Headline": "In a letter to the prime minister, Ms Ali said that remaining in her role would be a \"distraction from the ambitious work of this government\".",
        "Content": "Homelessness minister Rushanara Ali has resigned after reportedly hiking the rent on a property she owns by hundreds of pounds - something described by one of her tenants as \"extortion\".  That was just weeks after the previous tenants' contract ended, The i Paper said. Four tenants who rented a house in east London from Ms Ali were sent an email last November saying their lease would not be renewed, and which also gave them four months' notice to leave, the newspaper reported. The property was then re-listed with a £700 rent increase within weeks, the publication added. In a letter to the prime minister, Ms Ali said that remaining in her role would be a \"distraction from the ambitious work of this government\". She added: \"Further to recent reporting, I wanted to make it clear that at all times I have followed all relevant legal requirements. \"I believe I took my responsibilities and duties seriously, and the facts demonstrate this.\" Laura Jackson, one of Ms Ali's former tenants, said she and three others collectively paid £3,300 in rent. Weeks after she and her fellow tenants had left, the self-employed restaurant owner said she saw the house re-listed with a rent of around £4,000. \"It's an absolute joke,\" she said. \"Trying to get that much money from renters is extortion.\" Ms Ali's house, rented on a fixed-term contract, was put up for sale while the tenants were living there, and was only relisted as a rental because it had not sold, according to The i Paper. The government's Renters' Rights Bill includes measures to ban landlords who end a tenancy to sell a property from re-listing it for six months. The Bill, which is nearing its end stages of scrutiny in Parliament, will also abolish fixed-term tenancies and ensure landlords give four months' notice if they want to sell their property. Chief political correspondent Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"Do as I say, not as I do\". She was Labour's minister for homelessness, for goodness' sake, yet she ejected tenants from her near-£1m town house then hiked the rent. A more egregious case of ministerial double standards it would be difficult to imagine. She had to go and was no doubt told by 10 Downing Street to go quickly. MP for the East End constituency of Bethnal Green and Stepney, Ms Ali was the very model of a modern Labour minister: a degree in PPE from Oxford University. In her resignation letter to Sir Keir Starmer, she said she is quitting \"with a heavy heart\". Really? She presumably didn't have a heavy heart when she ejected her four tenants. She'd previously spoken out against \"private renters being exploited\" and said the government would \"empower people to challenge unreasonable rent increases\". She was charging her four former tenants £3,300 a month. Yet after they moved out, she charged her new tenants £4,000, a rent increase of more than 20%. In an area represented by the left-wing firebrand George Galloway from 2005 to 2010, Ms Ali had a majority of under 1,700 at the election last year. Ominously for Labour, an independent candidate was second and the Greens third. No doubt Jeremy Corbyn's new party will also stand next time. In her resignation letter to the PM, Ms Ali said continuing in her ministerial role would be a distraction. Too right. A distraction Sir Keir and his increasingly unpopular government could have done without. Responding to her resignation, shadow housing secretary Sir James Cleverly said: \"I said that her actions were total hypocrisy and that she should go if the accusations were shown to be true.\" A Liberal Democrat spokesperson said: \"Rushanara Ali fundamentally misunderstood her role. Her job was to tackle homelessness, not to increase it.\" Read more:First migrants detained under returns deal with FranceTropical Storm Dexter to bring potential heatwave next week Previously, a spokesperson for Ms Ali said the tenants \"stayed for the entirety of their fixed term contract, and were informed they could stay beyond the expiration of the fixed term, while the property remained on the market, but this was not taken up, and they decided to leave the property\". The prime minister thanked Ms Ali for her \"diligent work\" and for helping to \"deliver this government's ambitious agenda\". Sir Keir Starmer said her work in putting in measures to repeal the Vagrancy Act would have a \"significant impact\". And he said she had been trying to encourage \"more people to engage and participate in our democracy\", something that would leave a \"lasting legacy\"."
    },
    {
        "title": "Rushanara Ali: Humiliating demise for Labour minister after a most egregious case of double standards",
        "description": "Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"do as I say, not as I do\".",
        "url": "https://news.sky.com/story/rushanara-ali-humiliating-demise-for-labour-minister-after-a-most-egregious-case-of-double-standards-13408397",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rushanara-ali-labour_6985222.jpg?20250807231518",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-08-07 22:12:00",
        "Headline": "Labour's homelessness minister Rushanara Ali has resigned having reportedly hiked the rent on a property she owns by hundreds of pounds - something which was described by one of her tenants as \"extortion\".",
        "Content": "\n          Chief political correspondent\n              @joncraig\n  Rushanara Ali's swift and humiliating demise is a classic example of paying the price for the politician's crime of \"do as I say, not as I do\". She was Labour's minister for homelessness, for goodness' sake, yet she ejected tenants from her near-£1m town house and then hiked the rent. Politics Hub: Minister's resignation as it happened A more egregious case of ministerial double standards it would be difficult to imagine. She had to go and was no doubt told by 10 Downing Street to go quickly. 'A heavy heart' - really? MP for the East End constituency of Bethnal Green and Stepney, Ms Ali was the very model of a modern Labour minister: A degree in PPE from Oxford University. In her resignation letter to Sir Keir Starmer, she said she is quitting \"with a heavy heart\". Really? She presumably didn't have a heavy heart when she ejected her four tenants. She'd previously spoken out against \"private renters being exploited\" and said her government would \"empower people to challenge unreasonable rent increases\". The now former minister was charging her four former tenants £3,300 a month. Yet after they moved out, she charged her new tenants £4,000 - a rent increase of more than 20%. Read more politics news:Fact-checking Farage's claimsWhy chancellor has little to cheer A fragile constituency for Labour? In an area represented by the left-wing firebrand George Galloway from 2005 to 2010, Ms Ali had a majority of under 1,700 at the election last year. Ominously for Labour, an independent candidate was second and the Greens third. No doubt Jeremy Corbyn's new party will also stand next time. In her resignation letter to the PM, Ms Ali said continuing in her ministerial role would be a distraction. Too right. A distraction Sir Keir and his increasingly unpopular government could have done without."
    },
    {
        "title": "Rachel Reeves said this flagship policy would raise money - it may end up doing the opposite",
        "description": "What do we do about the non-doms?&#160;",
        "url": "https://news.sky.com/story/why-rachel-reeves-may-want-to-rethink-one-of-her-pivotal-policies-13408251",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-politics_6985238.jpg?20250808003624",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 15:05:00",
        "Headline": "As the chancellor tries to shore up the public finances, there are signs her policy to grab billions from non-doms may be backfiring. And with doubts over those calculations anyway, the policy may even result in lower tax revenues.",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  What do we do about the non-doms?  It's a question more than a handful of people have been asking themselves at the Treasury lately. Politics Hub: Follow latest updates It had seemed simple enough. In her first budget as chancellor, Rachel Reeves promised a crackdown on the non-dom regime, which for the past 200 years has allowed residents to declare they are permanently domiciled in another country for tax purposes. Under the scheme, non-doms, some of the richest people in the country, were not taxed on their foreign incomes. Then that all changed. Standing at the despatch box in October last year, the chancellor said: \"I have always said that if you make Britain your home, you should pay your tax here. So today, I can confirm we will abolish the non-dom tax regime and remove the outdated concept of domicile from the tax system from April 2025.\" The hope was that the move would raise £3.8bn for the public purse. However, there are signs that the non-doms are leaving in such great numbers that the policy could end up costing the UK investment, jobs and, of course, the tax that the non-doms already pay on their UK earnings. If the numbers don't add up, this tax-raising policy could morph into an act of self-harm. With the budget already under strain, a poor calculation would be costly financially. The alternative, a U-turn, could be expensive for other reasons, eroding faith in a chancellor who has already been on a turbulent ride. So, how worried should she be? The data on the number of non-doms in the country is published with a considerable lag. So, it will be a while before we know the full impact of this policy. However, there is much uncertainty about how this group will behave. While the Office for Budget Responsibility forecast that the policy could generate £3.8bn for the government over the next five years, assuming between 12 and 25% of them leave, it admitted it lacked confidence in those numbers. Worryingly for ministers, there are signs, especially in London, that the exodus could be greater. Property sales Analysis from the property company LonRes, shows there were 35.8% fewer transactions in May for properties in London's most exclusive postcodes compared with a year earlier and 33.5% fewer than the pre-pandemic average. Estate agents blame falling demand from non-dom buyers. This comes as no surprise to Magda Wierzycka, a South African billionaire businesswoman, who runs an investment fund in London. She herself is threatening to leave the UK unless the government waters down its plans. \"Non-doms are leaving, as we speak, and the problem with numbers is that the consequences will only become known in the next 12 to 18 months,\" she said. \"But I have absolutely no doubt, based on people I know who have already left, that the consequences would be quite significant. \"It's not just about the people who are leaving that everyone is focusing on. It's also about the people who are not coming, people who would have come, set up businesses, created jobs, they're not coming. They take one look at what has happened here, and they're not coming.\" Lack of options for non-doms But where will they go? Britain was unusual in offering such an attractive regime. Bar a few notable exceptions, such as Italy, most countries run residency-based tax systems, meaning people pay tax to the country in which they live. This approach meant many non-doms escaped paying tax on their foreign income altogether because they didn't live in those countries where they earned their foreign income. In any case, widespread double taxation treaties mean people are generally not taxed twice, although they may have to pay the difference. In one important sense, Magda is right. It could take a while before the consequences are fully known. There are few firm data points for us to draw conclusions from right now, but the past could be illustrative. Read more on Sky News:Reeves warned over tax risesWhat is a wealth tax?  The non-dom regime has been through repeated reform. George Osborne changed the system back in 2017 to limit it to just 15 years. Then Jeremy Hunt announced the Tories would abolish the regime altogether in one of his final budgets. Following the 2017 reforms there was an initial shock, but the numbers stabilised, falling just 5% after a few years. The data suggests there was an initial exodus of people who were probably considering leaving anyway, but those who remained - and then arrived - were intent on staying in the UK. So, should the government look through the numbers and hold its nerve? Not necessarily. Have Labour crossed a red line? Stuart Adam, a senior economist at the Institute for Fiscal Studies, said the response could be far greater this time because of some key changes under Labour. The government will no longer allow non-doms to protect money held in trusts, so 40% inheritance tax will be due on their estates. For many, that is a red line.  Mr Adam said: \"The 2017 reform deliberately built in what you might call a loophole, a way to avoid paying a lot more tax through the use of existing offshore trusts. That was a route deliberately left open to enable many people to avoid the tax. \"So it's not then surprising that they didn't up sticks and leave. Part of the reform that was announced last year was actually not having that kind of gap in the system to enable people to avoid the tax using trusts, and therefore you might expect to see a bigger response to the kind of reforms we've seen announced now, but it also means we don't have very much idea about how big a response to expect.\" With the public finances under considerable pressure, that will offer little comfort to a chancellor who is operating on the finest of margins."
    },
    {
        "title": "'Restriction zones' to be introduced for domestic abusers",
        "description": "The government is seeking to introduce \"restriction zones\" to limit where convicted domestic abusers can go.",
        "url": "https://news.sky.com/story/restriction-zones-to-be-introduced-for-domestic-abusers-13408373",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-domestic-abuse-stock_6965284.jpg?20250715113748",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-07 21:05:00",
        "Headline": "The new plans would place greater limits where abusers can go, with the aim of allowing survivors to go about their daily lives without fear of seeing their former abuser.",
        "Content": "The government is seeking to introduce \"restriction zones\" to limit where convicted domestic abusers can go. Exclusion zones currently exist to stop perpetrators from going within a certain distance of where their victims live. The new plans would place greater limits where abusers can go, with the aim of allowing survivors to go about their daily lives without fear of seeing their former abuser. Sexual and violent offenders could be restricted to certain locations and tracked with technology under the new proposals. They would then face jail time for breaching the conditions. Probation officers will carry out detailed risk assessments and work with survivors to decide on banned locations for perpetrators.  Survivor Leanne said from her experience, she would have asked for restriction zones at the school where she took her two children, her local supermarket or near her family's homes. \"These are places where I was confronted, even when he had restraining orders,\" the 54-year-old said. While Leanne said she is \"loving what I'm hearing\" about the government's approach, she added: \"Would I put a lot of faith in it? Probably not, because I don't like being let down, and I've been let down by previous governments. \"So we can only have hope.\" Read more:More strangulation cases recorded by policePensioner who stalked TV actress to be sentenced Justice minister Alex Davies-Jones will announce the new measure at charity Advance in London on Friday. The victims minister will say abusers will be GPS monitored to provide real-time data about where they are going, and subject to \"virtual boundaries\". The government is overhauling the prison system to curb overcrowding, which could see violent and sexual offenders released from jail earlier, and for more criminals to serve sentences in the community. Tens of thousands of offenders would be tagged, prompting concerns from the victims' commissioner for England and Wales over the Probation Service's ability to cope with rising numbers. The government has announced £700m of funding until 2028/29 for the Probation Service to back up its reforms. It will also recruit 1,300 new probation officers by March 2026."
    },
    {
        "title": "Rachel Reeves is celebrating the Bank of England's interest cut – but behind the scenes she has little to cheer ",
        "description": "The economy is stagnating and job losses are mounting. Now is the time to cut interest rates again. ",
        "url": "https://news.sky.com/story/rachel-reeves-is-celebrating-the-bank-of-englands-interest-cut-8211-but-behind-the-scenes-she-has-little-to-cheer-13408289",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-rachel-reeves-port-talbot_6984747.jpg?20250807112401",
        "type": "Politics",
        "Author": "Gurpreet Narwan",
        "Date Published": "2025-08-07 17:07:00",
        "Headline": "The Bank of England has cut the interest rate to 4% in its fifth reduction so far this year. On the other hand, though, the Bank upgraded its inflation forecasts. ",
        "Content": "\n          Business and economics correspondent\n              @gurpreetnarwan\n  The economy is stagnating and job losses are mounting. Now is the time to cut interest rates again.  That was the view of the Bank of England's nine-member rate setting committee on Thursday. Well, at least five of them. The other four presented us with a different view: Inflation is above target and climbing - this is no time to cut interest rates.  Who is right? All of them and none of them. Central bankers have been backed into a corner by the current economic climate and navigating a path out is challenging. The difficulty in charting that route was on display as the Bank struggled to decide on the best course of monetary policy. The committee had to take it to a re-vote for the first time in the Bank's history.  On one side, central bankers - including Andrew Bailey - were swayed by the data on the economy. Growth is \"subdued\", they said, and job losses are mounting. This should weigh on wage increases, which are already moderating, and in turn inflation. One member, Alan Taylor, was so worried about the economy he initially suggested a larger half a percentage point cut. On the other side, their colleagues were alarmed by inflation. The Bank upgraded its inflation forecasts, with the headline index expected to hit 4% in September. In a blow to the chancellor, the September figure is used to uprate a number of benefits and pensions. The Bank lifted it from a previous forecast of 3.75%. In explaining the increase, the Bank blamed higher utility bills and food prices. Food price inflation could hit 5.5% this year, an increase driven by poor harvests, some expensive packaging regulations as well as higher employment costs arising from the Autumn Budget. When pressed by Sky News on the main contributor to that increase - poor harvests or government policy - the governor said: \"It's about 50-50.\" The Bank doesn't like to get political but nothing about this is flattering for the chancellor. The Bank said food retailers, including supermarkets, were passing on higher national insurance and living wage costs - the ones announced in the Autumn Budget - to customers. Economists at the Bank pointed out that food retailers employ a large proportion of low wage workers and are more vulnerable to the lowering of the national insurance threshold because they have a larger proportion of part-time workers. The danger doesn't end there. Read more:Who is worst hit by Trump's new tariffs?Chancellor doesn't rule out rising gambling taxes Of all the types of inflation, food price inflation is among the most dangerous. Households spend 11% of their disposable income, meaning higher food price inflation can play an outsized role in our perception of how high overall inflation in the economy is. When that happens, workers are more likely to push for pay rises, a dangerous loop that can lead to higher inflation. So while the chancellor is publicly celebrating the Bank's fifth interest rate cut in a year, behind the scenes she will have very little to cheer."
    },
    {
        "title": "Chancellor doesn't rule out raising gambling taxes after report said it could lift 500,000 children out of poverty",
        "description": "The chancellor has declined to rule out raising taxes on gambling after a thinktank said the move could raise &#163;3.2bn for the public coffers and cover the cost of lifting 500,000 children out of poverty.",
        "url": "https://news.sky.com/story/chancellor-doesnt-rule-out-raising-gambling-taxes-after-report-said-it-could-lift-500000-children-out-of-poverty-13408154",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gambling-tax_6984771.jpg?20250807121105",
        "type": "Politics",
        "Author": "Ben Bloch",
        "Date Published": "2025-08-07 12:41:00",
        "Headline": "Raising taxes on online casinos, as well as slots and gaming machines, could raise enough money to scrap the two-child benefit cap, a thinktank says.",
        "Content": "\n          Political reporter\n              @realBenBloch\n The chancellor has declined to rule out raising taxes on gambling after a thinktank said the move could raise £3.2bn for the public coffers and cover the cost of lifting 500,000 children out of poverty. According to the Institute for Public Policy Research (IPPR), hiking taxes on online casinos and slot machines could raise enough revenue to fund scrapping the two-child benefit cap, with the organisation arguing that there is \"no other measure which provides comparable headline child poverty reduction per pound spent\". The proposals have been backed by former prime minister Gordon Brown, but the Betting and Gaming Council says they are \"economically reckless\" and could drive punters towards the black market. The chancellor has not ruled out taking forward the proposals, telling broadcasters that a review into gambling taxes is under way, and policies will be set out at the budget in the autumn. Money blog: Interest rate cut to lowest level in more than two years The IPPR says in its report that the chancellor should consider increasing taxes on online casinos from 21% to 50% and raising those on slots and gaming machines from 20% to 50%, as well as raising general betting duty on non-racing bets from 15% to 25% which it said would bring other sports in line with the rates paid by horse racing. These measures could bring in £3.2bn for the Treasury, which would cover the cost of lifting the two-child benefit cap. \n                  Gardener wins High Court case against Paddy Power over £1m jackpot - after betting firm only paid her £20,000\n                 \n                  Stake, Everton's shirt sponsor, will leave UK gambling market as advert investigated\n                 \n                  Roblox: How kids are being lured into online casinos\n                 The cap was introduced by the Conservative government in April 2017, and it restricts universal credit and child tax credits to the first two children in a family, where the third or subsequent children are born after this date. According to the thinktank's analysis of data from the Department for Work and Pensions, 115,000 families are affected, with an average financial impact of £60 per week. Overall, the policy is keeping over 450,000 in poverty currently, which is set to rise to 550,000 by the end of the decade, it adds. The IPPR says raising these taxes is unlikely to reduce overall revenue for the Exchequer because firms are likely to \"seek to protect their bottom lines by worsening odds\", which means a \"strong possibility of higher government revenue\" than their forecasts expect. 'An investment in our children's future' Henry Parkes, principal economist and head of quantitative research at IPPR, said in a statement: \"The gambling industry is highly profitable, yet is exempt from paying VAT and often pays no corporation tax, with many online firms based offshore. It is also inescapable that gambling causes serious harm, especially in its most high-stakes forms. \"Set against a context of stark and rising levels of child poverty, it only feels fair to ask this industry to contribute a little more.\" Progressive campaign group 38 Degrees has started a petition calling on the government to implement the proposals, and former prime minister Gordon Brown said in a statement: \"Gambling will not build a brighter future for our children. But taxing it properly might just get them properly nourished. Decent clothes. A warm bed. And the full stomachs that let them fill their brains in school. \"Taxing the betting industry to support our children won't be a gamble. It will be an investment in their future. One where everyone wins.\"  Proposals 'would do more harm than good' The government has long been facing calls from its own backbenches to scrap the two-child benefit cap, and has not ruled it out doing so as part of a broader package of measures to tackle child poverty, due to be published in the autumn. Speaking to broadcasters this afternoon, Chancellor Rachel Reeves said she speaks to the former premier \"regularly\", and, like him, is \"deeply concerned around the levels of child poverty in Britain\". She continued: \"We're a Labour government. Of course we care about child poverty. That's why one of the first things we did as a government was to set up a child poverty taskforce that will be reporting in the autumn and respond to it then. \"And on gambling taxes, we've already launched a review into gambling taxes. We're taking evidence on that at the moment and, again, we'll set out our policies in the normal way, in our budget later this year.\" But the Betting and Gaming Council says raising taxes on its members is not a sound way of funding measures to reduce poverty, with a spokesperson saying the proposals are \"economically reckless, factually misleading, and risk driving huge numbers to the growing, unsafe, unregulated gambling black market, which doesn't protect consumers and contributes zero tax\". They added: \"Further tax rises, fresh off the back of government reforms which cost the sector over a billion in lost revenue, would do more harm than good - for punters, jobs, growth and public finances.\""
    },
    {
        "title": "First migrants detained under returns deal with France",
        "description": "Migrants who crossed the English Channel have been detained for deportation to France under the new \"one in, one out\" deal.",
        "url": "https://news.sky.com/story/first-migrants-detained-under-returns-deal-with-france-13408023",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-migrants-border-force_6984962.jpg?20250807164353",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-08-07 07:29:00",
        "Headline": "It's not clear how many people have been detained, but the government is aiming to send a message that anyone who arrives by small boat risks being deported. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Migrants who crossed the English Channel have been detained for deportation to France under the new \"one in, one out\" deal. The Home Office said detentions began at lunchtime on Wednesday, and those people will be held in immigration removal centres pending their return in the coming weeks. Politics live: Tories call for asylum seekers caught working illegally to be immediately deported It comes after pictures showed people on small boats headed for the UK on Wednesday, when the pilot scheme came into force. Home Office figures show 155 people successfully made the journey but it is not known how many of these were detained. The government said it regards such details as operational information, which could be exploited by criminal gangs. However, it said numbers would be disclosed retrospectively \"to ensure transparency around the results of the scheme\". Prime Minister Sir Keir Starmer wrote on the X social media platform: \"We have detained the first illegal migrants under our new deal before returning them to France. \"No gimmicks, just results. If you break the law to enter this country, you will face being sent back. \"When I say I will stop at nothing to secure our borders, I mean it.\" Under the scheme, which will run as a pilot until June 2026, the UK can send adults and accompanied minors who arrive by small boat back to France. In exchange, the UK will allow an approved asylum seeker in France to be brought here via a safe and legal route - as long as they have not previously tried to enter illegally. Home Office officials aim to make referrals for returns to France within three days of a migrant's arrival by small boat, while French authorities will respond within 14 days. However, there are questions over whether a human rights \"loophole\" could allow migrants to avoid deportation. The treaty contains a clause that says in order for people to be returned, the UK must confirm they do not have an \"outstanding human rights claim\". Legal challenges will be 'robustly defended' Shadow home secretary Chris Philp claimed this will result in \"endless legal wrangling\" because people will make up bogus applications to avoid being returned. Home Secretary Yvette Cooper said France is a safe country and ministers would \"robustly defend against any legal challenge that people try\", with returns expected to start \"in a matter of weeks\". She added: \"No one should be in any doubt. Anyone who arrives from now on is eligible for immediate detention and return, and this pilot will now build because we are determined that no one should be making this journey.\" Home Office sources insist that under the treaty's terms, people with human rights claims certified as \"clearly unfounded\" by the Home Office can be removed, with no right to appeal. Certification can be challenged through judicial reviews remotely, and officials are preparing for these to be heard by UK courts in France.  The detentions will be alongside a campaign warning migrants in northern France not to risk their money by making the journey across the Channel. Sky News understands that leaflets will be handed out to migrants in French camps, setting out what the deal is and the risk of people crossing the Channel only to end up back in France. The government is under pressure for the scheme to work as it has presided over record high numbers of Channel crossings, despite a promise in the Labour manifesto to \"smash the gangs\". Reports have suggested that about 50 people a week could be sent to France initially - a small number compared to the 800 people every week on average who have arrived in the UK via small boats this year.  Ministers have previously said the scheme, announced last month, will start off small and grow, but that it is not a \"silver bullet\" and will go alongside other measures, such as a crackdown on illegal working.  The application process for those in France hoping to apply to come to the UK has now also been launched. They will have to meet suitability criteria, the standard visa application process, and security checks. It is understood priority will be given to those with a connection to the United Kingdom, and focusing on nationalities who are most likely to be refugees and those who are most likely to be targeted by smuggling gangs. If accepted, they would be given three months in the UK to claim asylum or apply for a visa, and would be subject to the same rules for all asylum seekers, not allowed to work, study or have access to benefits."
    },
    {
        "title": "OpenAI releases long-awaited GPT-5 AI chatbot upgrade",
        "description": "GPT-5, the long-awaited upgrade to the ChatGPT AI chatbot, has been released by its maker OpenAI.",
        "url": "https://news.sky.com/story/openai-releases-long-awaited-gpt-5-ai-chatbot-upgrade-13408324",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-chatgpt-gpt-5_6985155.jpg?20250807213020",
        "type": "Technology",
        "Author": "Tom Clarke",
        "Date Published": "2025-08-07 18:33:00",
        "Headline": "It's been one of the most highly anticipated launches in Silicon Valley after OpenAI's first offering ChatGPT - powered by its GPT-3 model - kick-started the current AI boom in late 2022.",
        "Content": "\n          Science and technology editor\n              @t0mclark3\n GPT-5, the long-awaited upgrade to the ChatGPT AI chatbot, has been released by its maker OpenAI. It has been one of the most highly anticipated launches in Silicon Valley after OpenAI's first offering ChatGPT - powered by its GPT-3 model - kick-started the current AI boom in late 2022. \"GPT-3 sort of felt like talking to a high school student,\" said Sam Altman, OpenAI's chief executive. \"GPT-4, maybe it was like talking to a college student. But with GPT-5, now it's like talking to an expert, a PhD-level expert in anything, any area you need, on demand.\"  At the launch event, OpenAI claimed the new chatbot, which will be released to all ChatGPT users on Thursday, was more than a simple upgrade to its previous offerings. According to OpenAI, the new model exceeds the chatbot competition from the likes of Google, X and Antropic on \"benchmarks\" - standardised tests used to rank models. \n                  Tech giant OpenAI signs deal with government to boost efficiency in public services\n                 \n                  OpenAI boss Sam Altman denies sister's sexual abuse lawsuit claims\n                 \n                  Scarlett Johansson speaks out about clash with OpenAI\n                 OpenAI claims it has been designed to be easier and more natural to communicate with, better at writing prose and advanced computer code, solving academic questions from mathematics to law, assisting with healthcare-related questions, as well as being safer than its predecessors. \"It's an incredible superpower on demand,\" claimed Mr Altman. The model is also more intelligent in how it uses its own brain power - and therefore an expensive computing resource - according to OpenAI. It is a hybrid of previous chatbots and slower, more computing-intensive \"reasoning\" models like OpenAI's Deep Research. Based on a user's request, the model will decide how much \"thinking\" is required before answering, rather than requiring the user to switch between different models. Although AI enthusiasts who had been expecting GPT-5 to represent \"artificial general intelligence [AGI]\" will be disappointed. Despite this being OpenAI's stated goal, Mr Altman billed GPT-5 as a \"major upgrade\" to GPT-4 and a \"significant step along the path to AGI\". But they're clearly not there yet.  A real test of GPT-5 will be whether it sells. OpenAI is projected to spend $8bn (£6bn) this year, on top of $5bn (£3.7bn) last year, and while it is expected to make a profit this year, the business case for increasingly powerful AI models is still not clear to many investors. Given a single training run for GPT-5 is rumoured to have cost $500m (£373m), there will be an expectation the new model is significantly more useful to business users. Despite a very slick demonstration of its coding skills at the launch presentation, where it built an online language learning game in seconds, GPT-5 will have to prove its worth for professional coding. Many in the tech industry prefer Anthropic AI's Claude model to write code. OpenAI and its investors will be hoping GPT-5 changes that. AI experts will also be testing GPT-5's tendency to \"hallucinate\", an issue OpenAI claims to have improved with GPT-5. But erroneous or bizarre answers are a problem that dogs all large generative AI models. \"Shiny things are always fun to play with, and I fully expect GPT-5 to be the shiniest so far,\" said Gary Marcus, a cognitive scientist at New York University and AI commentator. \"But that doesn't mean that it is a critical step on the optimal path to AI that we can trust,\" Mr Marcus added in a post."
    },
    {
        "title": "Eddie Murphy: I'll get an Oscars trophy eventually - when I'm old and have no teeth",
        "description": "Eddie Murphy has told Sky News he doesn't ever expect to win awards - but will happily accept an honorary Oscar when he's 90.",
        "url": "https://news.sky.com/story/eddie-murphy160ill-get-an-oscars-trophy-eventually-when-im-old-and-have-no-teeth-13408277",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-eddie-murphy-the-nutty-professor_6984273.jpg?20250806165834",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-08-07 16:25:00",
        "Headline": "The Nutty Professor star teams up with Keke Palmer and Pete Davidson for a new heist comedy, The Pickup, based on two security van drivers.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Eddie Murphy has told Sky News he doesn't ever expect to win awards - but will happily accept an honorary Oscar when he's 90. Murphy is one of the biggest stars in comedy after starting out on Saturday Night Live (SNL) in 1980 and starring in a number of big franchises from Beverly Hills Cop to Shrek. Murphy says award recognition was never something that shaped the projects he chose. \"The movies are timeless, and they're special, so for years and years those movies play and the movies have commercial success. \"So you make a lot of money and people love it, so you don't even think about 'I didn't win a trophy!' The response from the people and that the movie has legs, that's the trophy. \"You know what I've earned over these years? One day, they'll give me one of those honorary Oscars. When I'm really old. And I'll say thank you so much for this wonderful honour. I'll be old like that and I'll have no teeth. I'm cool with getting my honorary Oscar when I'm 90.\" Murphy, 64, has only been nominated once - for Dreamgirls in 2007, when Alan Arkin won the best supporting actor Oscar for Little Miss Sunshine. Murphy's co-star Palmer says she considers Murphy an icon in the industry, and The Nutty Professor was a true display of his artistry. \"I feel like recognition and [being] underrated and all this stuff, it annoys me a little bit because I think impact is really the greatest thing, like how people were moved by your work, which can't really be measured by an award or really anything,\" Palmer says. \"It's very hard to make people laugh, and so when I think about it like The Nutty Professor, Eddie was doing everything, and I swear that the family members were real people. \"He didn't camp it to the point where they weren't realistic. His roles had integrity, even when he was in full costume. And I do think that's something that should change in our industry. Comedy, it should be looked at just as prestigious as when you see somebody cry, because it's that hard to make somebody laugh.\" Recalling his time on the 90s comedy, Murphy says he's still in disbelief of what they achieved in making the film with him playing seven characters - Professor Sherman Klump, Buddy Love, Lance Perkins, Young Papa Klump, Granny Klump, Ernie Klump and Mama Klump. \"You can only shoot one character a day. And the rest of the time you're shooting, I'm talking to tennis balls where the people were sitting. \"So to this day when I watch it, I'm like, wow, that's a trip. But we were able to mix all that stuff up and different voices and make it feel so that you don't even feel like when you're watching it, someone have to tell you, hey, you know, those are all one person.\" The film won best makeup at the 1997 Academy Awards. Security guards buddy comedy Palmer says their new project, The Pickup, is responsible for one of the most memorable moments of her life when she mistook Murphy's acting for real praise. \"First of all, Eddie gives me this big speech before I do the monologue, where he's like, 'this is not playing around. This is a pivotal point in the movie'. \"I'm crying in the scene, and then it comes to the end, and Eddie's [clapping] like, and I'm literally like, 'oh my gosh, thank you so much'. And he's like, 'I'm acting'. When I tell you, it was so crazy, yeah. That's like one of my most memorable moments in life.\" Davidson is excited to see how the UK puts its own stamp on SNL, the show where both he and Murphy got their start on-screen. \"It's a smart idea to have SNL over there because it's not that it's a different brand of comedy, but it is a little bit. A lot of the biggest stuff that's in the States is stuff that we stole from you guys, like The Office or literally anything Ricky Gervais does. \"This is the first time I've ever heard anything American going to the UK, so I think it's great. I think it's great to have two opposite sorts of takes on things, but both be funny. That just shows you how broad comedy can be, you know? The Pickup is out on Prime Video now."
    },
    {
        "title": "Diddy plotting return to music with Madison Square Garden gig, his lawyer says",
        "description": "Disgraced hip hop mogul Sean \"Diddy\" Combs is hoping to make a comeback to music with a concert at Madison Square Garden, his lawyer has said.",
        "url": "https://news.sky.com/story/diddy-plotting-return-to-music-with-madison-square-garden-gig-his-lawyer-says-13408196",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sean-combs-diddy-2010_6983152.jpg?20250805092129",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-07 12:42:00",
        "Headline": "It follows reports the rapper has been in contact with Donald Trump about a pardon after being convicted of prostitution-related offences.",
        "Content": "Disgraced hip hop mogul Sean \"Diddy\" Combs is hoping to make a comeback to music with a concert at Madison Square Garden, his lawyer has said. On Tuesday, the rapper was denied bail ahead of his sentencing in October, when he could face up to 20 years in prison after he was convicted of prostitution-related offences. The sentence, however, will likely be much shorter than that. Speaking to CBS News, the rapper's lawyer Marc Agnifilo said Combs told him \"he's going to be back at Madison Square Garden\", the iconic arena in New York City.    Read more:How the trial unfoldedThe rise and fall of Sean 'Diddy' Combs In July, Combs was found guilty of two counts of transportation for prostitution - but cleared of more serious charges of racketeering conspiracy and sex-trafficking, which carried potential life sentences. Combs, who co-founded Bad Boy Records and launched the career of the late Notorious BIG, was for decades a huge figure in pop culture - as well as a Grammy-winning artist and entrepreneur, who presided over an empire ranging from fashion to reality TV.  Now, as well as the criminal conviction, he is also facing several civil lawsuits. It follows recent reports that Combs has been in contact with Donald Trump about a pardon, a source close to the rapper's legal team told Sky News' US partner network NBC News. A White House spokesperson said it \"will not comment on the existence or nonexistence of any clemency request\"."
    },
    {
        "title": "Anna Friel: Pensioner who stalked Marcella star for nearly three years to be sentenced next month",
        "description": "A man who stalked actress Anna Friel for nearly three years is to be sentenced next month.",
        "url": "https://news.sky.com/story/anna-friel-pensioner-who-stalked-marcella-star-for-nearly-three-years-to-be-sentenced-next-month-13408189",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-anna-friel-actress_6984855.jpg?20250807133323",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-07 14:01:00",
        "Headline": "The 71-year-old, who has admitted stalking, sent numerous messages, visited the actress's home address and left \"unwanted\" gifts, a court heard.",
        "Content": "A man who stalked actress Anna Friel for nearly three years is to be sentenced next month. Phil Appleton, 71, sent numerous messages, visited the actress's home address several times and left \"unwanted\" gifts between January 2022 and December last year, Reading Crown Court previously heard. The defendant, described online as an actor and retired pilot, admitted stalking under Section 2A of the Protection from Harassment Act 1997 earlier this week. Appleton was due to be sentenced on Thursday but judge Alan Blake adjourned the hearing until 18 September for a pre-sentence report to be carried out. The court heard the pensioner, from Windsor in Berkshire, has been in custody for six months and has spent time in a mental health facility. Granted conditional bail, he was told he must not contact Ms Friel or enter the Royal Borough of Windsor and Maidenhead and is to co-operate with those conducting the pre-sentence report. Friel, 49, rose to fame with her role as Beth Jordache in Channel 4 soap opera Brookside. Read more on Sky News:Superman star joining ICECombs asks Trump for pardonTV star charged with rape She achieved international renown in 2007, starring as Charlotte \"Chuck\" Charles in the ABC comedy series Pushing Daisies. In 2017, she won the International Emmy for Best Actress for her role as the title character in the ITV and Netflix mystery drama series Marcella"
    },
    {
        "title": "Oasis gig at Murrayfield in Edinburgh beats Taylor Swift for most 'ground-shaking' concert",
        "description": "Oasis provided the most \"ground-shaking\" performance at Edinburgh's Murrayfield Stadium when they last performed there in 2009, according to analysis of seismic data.",
        "url": "https://news.sky.com/story/oasis-gig-at-murrayfield-in-edinburgh-beats-taylor-swift-for-most-ground-shaking-concert-13408137",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-liam-gallagher-oasis_6984736.jpg?20250807111529",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-07 13:20:00",
        "Headline": "Oasis' June 2009 gig beat the Red Hot Chili Peppers in June 2004, Kings of Leon in June 2011 and Taylor Swift in June 2024 – when measuring the peak earthshaking power of each event.",
        "Content": "Oasis provided the most \"ground-shaking\" performance at Edinburgh's Murrayfield Stadium when they last performed there in 2009, according to analysis of seismic data. The Gallagher brothers' last Scottish gig has topped the chart for the most powerful seismic concert at the venue in the past 20 years, the British Geological Survey (BGS) said. Oasis' June 2009 gig beat the Red Hot Chili Peppers in June 2004, Kings of Leon in June 2011 and Taylor Swift in June 2024 - when measuring the peak earthshaking power of each event. The measurements were taken from a seismic monitoring station, some 4km from the venue. At peak power of 215.06kW, the Oasis gig was more than twice as powerful as the next strongest one by the Red Hot Chili Peppers at 106.87kW. Murrayfield Stadium's most seismic concerts: • Oasis: 17 June 2009, 215.06kW• Red Hot Chili Peppers: 14 June 2004, 106.87kW• Kings of Leon: 26 June 2011, 96.18kW• Taylor Swift: 8 June 2024, 82.56kW• Foo Fighters: 8 September 2015, 78.65kW• Harry Styles: 26 May 2023, 65.38kW• Beyonce: 20 May 2023, 29.31kW• Robbie Williams: 31 May 2025, 14.18kW• Bon Jovi: 22 June 2011, 13.20kW• Spice Girls: 8 June 2019, 10.63kW• One Direction: 3 June 2014, 6.82kW \n                  Jewish comedian Rachel Creeger says she has new venue for Edinburgh Fringe show\n                 \n                  Why the Oasis reunion tour is 'catastrophic' for Edinburgh Fringe performers \n                 \n                  Jewish comedian says shows cancelled as Gaza in the spotlight at Edinburgh Fringe\n                 The rankings were revealed ahead of Oasis' return to the Scottish capital this weekend as part of their comeback tour. The power output is not related to the volume of the band or the crowd; rather, it is the movement of fans jumping and dancing in time to the music, with the height of the jumping and weight of the crowd also potential factors. Read more:Oasis reunion tour 'catastrophic' for Edinburgh Fringe performersLiam hits out at council after Oasis fans branded 'rowdy' BGS seismologist Callum Harrison said: \"In 2009, seismic signals generated by Oasis fans were consistent with a crowd energy of 215kW at its peak - enough to power around 30 of the scooters featured on the iconic Be Here Now album cover. \"Our network of sensors around the country is sensitive enough to pick up ground movement from a source miles away that may not be detectable to humans - and precise enough to register exact timestamps for when the events occur. \"The peak energy reading was recorded around 8.30pm on that June evening back in 2009, which correlates to the time the band first took the stage and performed Rock 'N' Roll Star, which couldn't be more fitting in terms of topping our seismic music chart.\" The BGS keeps an archive of continuous ground motion recordings from seismic sensors around the country, dating back several decades. Mr Harrison said: \"Improving our understanding of historical earthquakes is an important part of BGS research in trying to understand and mitigate the seismic risk around the country.\" Oasis will take to Murrayfield's stage on Friday, Saturday and Tuesday, so there is potential for another \"shakermaker\". Mr Harrison said it is \"certainly possible\" the band could top their 2009 gig, adding: \"We'll just have to wait and see. \"The main contributing factors are going to be how energetic the crowd is. If they're jumping along with the music, how high or how fast are they jumping?\""
    },
    {
        "title": "Ex-Superman Dean Cain to join ICE 'ASAP' to 'save America'",
        "description": "Dean Cain has been branded the \"worst superman ever\" as he announced he will join the US Immigration and Customs Enforcement (ICE) \"ASAP\".",
        "url": "https://news.sky.com/story/ex-superman-dean-cain-to-join-ice-asap-to-save-america-13408113",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dean-cain-superman_6984880.jpg?20250807140456",
        "type": "Entertainment",
        "Author": "Claire Gilbody-Dickerson",
        "Date Published": "2025-08-07 09:35:00",
        "Headline": "Cain, 59 and who was cast as Superman in the TV series Lois & Clark: The New Adventures of Superman, announced he had joined the team amid the federal agency's unprecedented immigration raids.",
        "Content": "\n          Reporter\n              @ClaireGilbodyD\n Dean Cain has been branded the \"worst superman ever\" as he announced he will join the US Immigration and Customs Enforcement (ICE) \"ASAP\". The 59-year-old, who was cast as Superman in the TV series Lois & Clark: The New Adventures of Superman, announced he had joined the team amid the federal agency's unprecedented immigration raids. He told Fox News on Wednesday his recruitment video on Instagram had gone viral and since then, \"I have spoken with some of the officials over at ICE and I will be sworn in as an ICE agent ASAP\". \"You can defend your homeland and get great benefits,\" he said in the Instagram post where he appealed for his followers to join ICE. Speaking with the Superman theme song in the background, he said \"hundreds of thousands of criminals\" had been arrested since US President Donald Trump took office. He then told his followers they would get a series of benefits if they joined ICE, including a $50,000 (£37,407) signing bonus and student loan repayment.  Read more: Farmer becomes first person to die during Trump's ICE raidsMeet the volunteers leading the fight against Trump's immigration raids \n                  Trump's Ukraine deadline for Putin arrives - as uncertainty remains over possible meeting\n                 \n                  Trump and Putin's first meeting in years does not necessarily mean a ceasefire in Ukraine\n                 \n                  OpenAI releases long-awaited GPT-5 AI chatbot upgrade\n                 \"If you want to help save America ICE is arresting the worst of the worst and removing them from America's streets,\" he said, before adding: \"I voted for that.\" ICE agents are under pressure from the White House to boost their deportation numbers in line with Mr Trump's campaign promise to crack down on illegal immigration. Cain's post on Instagram received some backlash, with one user commenting: \"Worst superman ever\". Another said: \"Shame on you Dean - that's the most un-Superman thing you could possibly advocate.\" One fan turned against him and said: \"Until I saw this I was such a fan. What a sad human being you must be.\""
    }
]