[
    {
        "title": "Police search Peter Mandelson's properties in Camden and Wiltshire",
        "description": "Two of Peter Mandelson's properties have been searched by police investigating claims of misconduct in a public office.",
        "url": "https://news.sky.com/story/police-search-peter-mandelsons-properties-in-camden-and-wiltshire-13504109",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-police-search_7157799.jpg?20260206200541",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-06 14:29:00",
        "Headline": "Officers say the warrants related to an \"investigation into misconduct in public office offences, involving a 72-year-old man\".",
        "Content": "Two of Peter Mandelson's properties have been searched by police investigating claims of misconduct in a public office. Boxes were seen being carried from his property in Camden, north London, on Friday evening, while police cars were parked in the driveway of Mandelson's Wiltshire house. Plain-clothed officers also used torches to briefly search a Range Rover outside the London address. Live updates on Mandelson investigation Metropolitan Police deputy assistant commissioner Hayley Sewart said the \"central specialist crime team\" were carrying out the warrants. \"The searches are related to an ongoing investigation into misconduct in public office offences, involving a 72-year-old man,\" said a statement. \"He has not been arrested and enquiries are ongoing.\" The search is part of an investigation into Lord Mandelson following the latest release of files about Jeffrey Epstein, which have revealed more details about the pair's relationship. They appear to show Mandelson passed on market-sensitive information to Epstein when he was business secretary after the 2008 financial crisis. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the financier's victims. 'Significant volume of material' to be reviewed Sir Keir Starmer remains under pressure to release documents related to the peer's vetting to become UK ambassador to the US - a job he was sacked from in September. The prime minister has said Mandelson lied about the depth of his friendship with Epstein ahead of getting the prestigious job. In a letter to the chair of parliament's Intelligence and Security Committee (ISC), Sir Keir said he wanted the documents released as soon as possible. However, he said \"a very significant volume of material\" on Mandelson's appointment as ambassador needed to be reviewed first. In Friday's letter, Sir Keir said he had told the cabinet secretary to work with the ISC on \"how material that may be prejudicial to the UK's national security and international relations is shared and reviewed\". Documents coming 'shortly' Speaking to journalists earlier, Downing Street said the government would publish the documents \"shortly\". Sky News understands the government is working with police to ensure any document released does not undermine the police investigation into Mandelson. Officials are believed to be in the early stages of assessing the documents, of which there are thousands. The scandal surrounding Lord Mandelson has left Sir Keir under severe pressure, with some in Labour wanting him to resign. Labour MPs are urging Sir Keir to reveal whether he saw a report by an influential party peer that warned of Lord Mandelson's links to Epstein. Labour grandee Lord Glasman told Sky News last September that he had flagged to Number 10 about the pair's relationship but was met with a \"discreet suggestion to basically shut up\". Read more:What we've found in Epstein filesSurvivors condemn US government's handling of files In an interview with Sky News' Sophy Ridge, Lord Glasman suggested he was asked to report to Number 10 about the pair's relationship and he did - but suggested no action was taken. \"They asked me to send a report and I sent a report,\" he said. \"I did say when I got back, I would think again about this publicly. \"Then I did get a discreet suggestion to basically shut up about that, and I did.\" McSweeney under pressure Even more focus has been placed on the prime minister's chief of staff, Morgan McSweeney, who was a close political ally of Lord Mandelson. Labour backbencher MP Simon Opher called for a \"clear out at Number 10\". \"If my chief of staff had done this, I think he would be looking for another job,\" Mr Opher told the BBC. Veteran Labour MP Clive Efford and Southport MP Patrick Hurley have also said Mr McSweeney should leave Number 10. PM's future Former cabinet minister and Labour grandee Harriet Harman told the Electoral Dysfunction podcast previously that the prime minister needed a \"real reset\". Sir Keir could lose his premiership if he does not do the right thing, Ms Harman added. However, so far no big names on the current frontline of Labour politics have turned their fire on the prime minister and his staff. Sir Keir on Thursday apologised for believing Lord Mandelson's \"lies\" about his closeness to paedophile financier Epstein. The prime minister made Lord Mandelson the UK's ambassador to the US in 2024. 👉Tap here to listen to Electoral Dysfunction on your podcast app 👈 Following a partial release of the Epstein files last year, Sir Keir sacked him after it emerged how close the pair were. Another tranche of millions of documents released by the US government recently saw Mandelson quit Labour and resign from the House of Lords."
    },
    {
        "title": "We've combed through thousands of pages, photos and videos - here's what we've found in Epstein files",
        "description": "We've now combed through hundreds of thousands of files, photos and videos.",
        "url": "https://news.sky.com/story/what-weve-learned-from-the-latest-jeffrey-epstein-files-13504191",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lord-peter-mandelson_7151106.png?20260131131904",
        "type": "Home",
        "Author": "Tom Cheshire",
        "Date Published": "2026-02-06 17:44:00",
        "Headline": "Some of those named have said they didn't have the full picture of Epstein's crimes - and the files also show many others refused to have anything to do with him after his conviction.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n We've now combed through hundreds of thousands of files, photos and videos. They stretch back decades but their effect has been immediate. All week we have said that being mentioned in the files is not evidence of wrongdoing, and that remains a true and important point. But the release has permanently tarnished reputations and, at the very least, raised questions about supposedly clever people's judgement. It has cost Peter Mandelson his seat in the Lords, and who knows what will come of the police investigation now launched. And it has left many others with questions to answer. There is no evidence to suggest wrongdoing by the tech moguls Bill Gates and Elon Musk, for example. But the files show that both, like Mandelson, associated with Epstein after his conviction for child prostitution. Sarah Ferguson took her daughters to meet Epstein in Miami the week after his release for that very offence. Sarah Ferguson has previously said her involvement with Epstein was \"a gigantic error of judgment\". \n                  Norway's crown princess Mette-Marit apologises over Epstein links\n                 \n                  Can Starmer survive the Mandelson scandal? \n                 \n                  King's response to heckler will frustrate critics - but he doesn't want Andrew to be a distraction\n                 Andrew Mountbatten-Windsor's long and close relationship with Epstein does not need recounting. Some, like Mandelson, have argued that they didn't have the full picture of Epstein's crimes. But the files also show that many people refused to have anything to do with Epstein after his conviction. They didn't need to know every detail to understand, like Melinda Gates did in just one meeting, that Epstein was \"evil personified\". We do now have the full picture, or as full as we can hope for, and it is bleak. It is the experiences of the survivors - or victims, because not everyone survived, like Virginia Giuffre who died last year - that haunts the documents. Much of the files look dry and methodical, including one which details some witnesses interviewed by authorities, but on closer inspection you can see it is their high schools that are listed; all are 17, and between them they were abused hundreds of times. Read more from Sky News:Neighbourhood stunned by a crime mystifying AmericaWhy Bad Bunny's Super Bowl show is causing a stir Or the victim who took a pen to the title of her journal, \"Flights of fancy\", and altered it to read \"Flights and yachts of horror\". Or the testimony of Lisa Phillips, who spoke to Sky News this week: \"One of the young girls came to the door and said, you know, Jeffrey's ready for his massage and, I argue with the girls for a little bit because I don’t want to do a massage. \"I went with the other girl who brought me to the island. I went into the room to do this massage, and the massage turned into a sexual assault.\" The great and the good visited that same island, or they sought invitations. Unlike Lisa, they had a choice."
    },
    {
        "title": "White House removes video shared by Trump showing Obamas as apes",
        "description": "Donald Trump has been accused of \"disgusting behaviour\" after a video was shared on his Truth Social account depicting Barack and Michelle Obama as apes.",
        "url": "https://news.sky.com/story/donald-trump-accused-of-disgusting-behaviour-after-sharing-image-of-obamas-as-apes-13504107",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-obama_7157544.jpg?20260206152041",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-06 14:21:00",
        "Headline": "The White House initially defended the post before removing it hours later - blaming a member of staff for \"erroneously\" sharing the video.",
        "Content": "Donald Trump has been accused of \"disgusting behaviour\" after a video was shared on his Truth Social account depicting Barack and Michelle Obama as apes. The depiction appeared towards the end of the video, asserting debunked claims that the 2020 election - which he lost to Joe Biden - was stolen from him. Posted on Mr Trump's own social media network, the two-second clip shows the Obamas as apes bobbing up and down to the tune of \"The Lion Sleeps Tonight\". The post was later deleted - around 12 hours after being shared. A White House official said a member of staff \"erroneously made the post\" and it had now been taken down. The post sparked widespread outrage from across the political spectrum, while the White House's response was also criticised. Kamala Harris, Mr Trump's Democratic rival in the 2024 presidential election, said: \"No one believes this cover up from the White House, especially since they originally defended the post. \n                  New plaques in Trump's White House attack Joe Biden, Barack Obama and George W Bush\n                 \n                  Joseph James O'Connor ordered to pay back over £4m in Bitcoin after hacking celebrity X accounts\n                 \n                  What was it like to be 10ft from Trump assassination attempt?\n                 \"We are all clear-eyed about who Donald Trump is and what he believes.\" In a message on X, formerly Twitter, Gavin Newsom, the Democratic governor of California, accused the president of \"disgusting behaviour\" over the post. He added: \"Every single Republican must denounce this. Now.\" Responding to the video, Senate Democratic leader Chuck Schumer wrote on X: \"Racist. Vile. Abhorrent. This is dangerous and degrades our country-where are Senate Republicans?\" Mr Schumer urged the US president to apologise to the Obamas, calling the couple \"two great Americans who make Donald Trump look like a small, envious man\". Ben Rhodes, who served as deputy national security adviser in the Obama White House, reacted to the video by calling Trump \"a stain on our history\". \"Let it haunt Trump and his racist followers that future Americans will embrace the Obamas as beloved figures while studying him as a stain on our history,\" he wrote on X. George Conway - ex-husband of Kellyanne Conway, who managed the president's successful election campaign in 2016 - responded by highlighting an article he'd written describing Trump as a \"racist\" in 2019. The group Republicans Against Trump wrote: \"There's no bottom.\" White House initially criticised 'fake outrage' Before the post was removed, White House press secretary Karoline Leavitt defended it and said the depiction formed part of a longer video depicting various politicians as animals. She said: \"This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King. \"Please stop the fake outrage and report on something today that actually matters to the American public.\" Mr Trump has a long history of attacking Mr Obama, his predecessor as president, and was a vocal proponent of the \"birther\" conspiracy theory. The theory cast doubt on Mr Obama's birth in Hawaii, asserting that he was actually born in Kenya, and therefore ineligible to hold the office of president. Mr Obama produced his long-form birth certificate in 2011. In 2016 Mr Trump publicly accepted that his predecessor was born in the USA."
    },
    {
        "title": "Nigerian court orders UK to pay £420m over coal mine deaths in 1949",
        "description": "A Nigerian court has reportedly ordered the UK to pay &#163;420m to the families of 21 striking miners killed by security forces during British colonial rule.",
        "url": "https://news.sky.com/story/nigerian-court-orders-uk-to-pay-163420m-over-coal-mine-deaths-in-1949-13504264",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-enugu-nigeria_7157911.jpg?20260206215525",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-06 20:38:00",
        "Headline": "The incident is widely seen in Nigeria as one of the events that led to agitations for independence in Africa's most populous nation.",
        "Content": "A Nigerian court has reportedly ordered the UK to pay £420m to the families of 21 striking miners killed by security forces during British colonial rule. The judge, Justice Anthony Onovo of the Enugu High Court, found the former colonial administration liable over the 1949 incident and said Britain should formally apologise. The UK was not represented in court, according to local reports, and the government has declined to comment. The miners, who were protesting over harsh working conditions and had occupied the facility, were shot by colonial police at the Iva Valley Coal Mine in southeastern Enugu state. Fifty-one others were seriously injured in the shooting, News Agency of Nigeria reported. \"These defenceless coal miners were asking for improved work conditions, they were not embarking on any violent action against the authorities, but yet were shot and killed,\" the judge said. Campaigners have been pursuing damages for decades and Mr Onovo said a £20m payment to each family would be \"effective remedy and compensation for the violations of the right to life\". \n                  'More than 170' killed in suspected Islamist attack in Nigeria\n                 \n                  Anthony Joshua pays tribute to friends killed in Nigeria crash\n                 \n                  Nigerian bandits who kidnapped 150 churchgoers demand motorbikes in return\n                 He also ruled that the Nigerian government had failed in its duty to seek redress for the victims. Read more from Sky News:Norway's crown princess apologises over Epstein linksPakistan suicide bombing leaves at least 31 dead  The incident is widely seen in Nigeria as one of the events that led to agitations for independence in Africa's most populous nation. The country broke free from Britain 11 years later in 1960. A lawyer on the case, Yemi Akinseye-George, said Thursday's ruling gave \"historical accountability and justice for colonial-era violations, affirming that the right to life transcends time, borders, and changes in sovereignty\"."
    },
    {
        "title": "Trump administration wants to deport five-year-old detained by ICE in Minnesota",
        "description": "The Trump administration is moving to deport a five-year-old boy who was detained by Immigration and Customs Enforcement (ICE) agents in Minnesota last month.",
        "url": "https://news.sky.com/story/trump-administration-wants-to-deport-five-year-old-detained-by-ice-in-minnesota-13504253",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-minnesota-liam-conejo-ramos_7152537.jpg?20260201174129",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-06 20:15:00",
        "Headline": "Liam Conejo Ramos and his father were taken into custody by immigration enforcement agents outside their home in Minneapolis on 20 January.",
        "Content": "The Trump administration is moving to deport a five-year-old boy who was detained by Immigration and Customs Enforcement (ICE) agents in Minnesota last month. Homeland Security, which oversees immigration enforcement, confirmed on Friday that it would seek to deport Liam Conejo Ramos, but denied a claim by a lawyer for the boy that it was seeking expedited removal. The move was \"extraordinary\" and possibly \"retaliatory\", his lawyer Danielle Molliver told New York Times. \"These are regular removal proceedings,\" Homeland Security spokesperson Tricia McLaughlin said. \"This is standard procedure and there is nothing retaliatory about enforcing the nation's immigration laws.\" The boy and his father, Adrian Alexander Conejo Arias, were taken into custody by ICE agents on the driveway of their family home on 20 January. The pair was then flown more than 1,000 miles from their home in Minneapolis to a facility in Texas. Nearly two weeks later, they were released following a judge's order and returned to Minnesota. The judge was critical of Mr Trump's immigration crackdown saying that \"the case has its genesis in the ill-conceived and incompetently-implemented government pursuit of daily deportation quotas, apparently even if it requires traumatising children\". The five-year-old, who was born in Ecuador, and Mr Conejo Arias came to the US legally as asylum applicants. Read more: My five-year-old son has nightmares after ICE detention The Trump administration defended the move to detain them, with Homeland Security accusing Mr Conejo Arias of being in the US illegally, without providing details. Mr Conejo Arias said his son \"hasn't been the same since all this happened\". Read more:What is ICE and what powers do its agents have?ICE agents ordered to leave Minnesota A photo of child, wearing a bunny hat and Spider-Man backpack as he was surrounded by ICE agents, went viral and caused outrage among protesters and the wider public. Their detention came between the high-profile killings of Minneapolis residents Renee Nicole Good and Alex Pretti, both 37 and US citizens."
    },
    {
        "title": "Mystery as Russian general shot at close range - with equally curious response from the Kremlin",
        "description": "From the Skripal poisonings to the invasion of Ukraine to subverting American elections, it is hard to think of a Russian outrage Lieutenant General Vladimir Alekseyev has not been involved in.",
        "url": "https://news.sky.com/story/this-russian-general-fought-and-meddled-for-vladimir-putin-around-the-world-now-hes-fighting-for-his-own-life-13504073",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-russia-alexeyev-assasination_7157416.jpg?20260206133713",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-06 13:10:00",
        "Headline": "Lieutenant General Vladimir ‍Alekseyev is fighting for his life after being shot several times in a Moscow apartment building - and Russia is blaming Ukraine.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n From the Skripal poisonings to the invasion of Ukraine to subverting American elections, it is hard to think of a Russian outrage Lieutenant General Vladimir Alekseyev has not been involved in. He is now fighting for his life in a Moscow hospital, the victim himself of foul play. The military intelligence deputy chief had a role in so many of Vladimir Putin's acts of malice stretching back decades. And he would have had no shortage of enemies. And yet, this high-ranking soldier spy was so badly protected that his would-be killer was able to shoot him several times at close range in the stairwell of his own apartment building. As in any cheap spy novel, the shooter is reported to have slipped in behind him, entering the building by posing as a food delivery courier. That is not the only mystery about this astonishing attempted assassination. \n                  Second fatal bombing in Moscow 'embarrassing' for Kremlin but helpful timing for Ukraine\n                 \n                  Ksenia Karelina: Ballerina arrives home in US after 'nightmare' of Russian penal colony\n                 \n                  Do Russians believe Donald Trump can stop the war in Ukraine?\n                 The Kremlin's response to it has been curious too. \"It's clear\", said spokesman Dmitri Peskov, \"that such military leaders and high-ranking specialists are at risk during wartime. It's not the Kremlin's job to figure out how to ensure their safety.\" You're on your own boys, seemed to be the message, hardly reassuring for some of Russia's highest-ranking and most decorated commanders. And Lt Gen Alekseyev is just the latest in a line of top Russians neutralised or attacked on home turf. Officially, Russia is unsurprisingly blaming Ukraine. Foreign Minister Sergei Lavrov called it a terrorist act designed to \"provoke, in turn, the goal of disrupting the negotiation process\". But in truth, there are any number of people who would have wanted Alekseyev dead. He helped orchestrate the botched attempt to kill Sergei Skripal in Salisbury with the nerve agent Novichok. He was deeply involved with Russia's murderous campaign in Syria that targeted hospitals, clinics and aid convoys. He is alleged to have been involved in Russian efforts to undermine both the 2016 and 2020 US elections. Read more from Sky News:Iran and US to begin high-stakes talksHistoric crown crushed during Louvre heist And when Yevgeny Prigozhin's Wagner group mutinied and marched on Moscow, Lt Gen Alekseyev helped negotiate an end to its rebellion. Mr Prigozhin himself, of course, would die some time later in a mysterious plane accident. If Ukrainians were behind the attempt on the general's life, it would signal a catastrophic failure of security at the very top of Russia's military intelligence structure. But it may just as well be the result of an internal power struggle within those elites. Either way, the shooting bodes ill for the leadership of Putin's Russia."
    },
    {
        "title": "Paedophile camp leader Jon Ruben jailed for 23 years for sexually abusing children he drugged with sweets",
        "description": "A summer camp leader who drugged children with sweets laced with a tranquiliser before sexually assaulting them has been jailed for more than 23 years.",
        "url": "https://news.sky.com/story/summer-camp-leader-jon-ruben-jailed-for-drugging-and-sexually-assaulting-children-13503963",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jon-ruben-leicestershire_7157377.png?20260206130504",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-06 13:03:00",
        "Headline": "Ruben's stepson raised concerns after finding baby oil and syringes containing white powder. The paedophile held his head in his hands and sobbed during sentencing, and was heard saying \"I'm sorry\".",
        "Content": "A summer camp leader who drugged children with sweets laced with a tranquiliser before sexually assaulting them has been jailed for more than 23 years. Warning: This report contains references to graphic material including self-harm and sexual abuse which readers may find distressing Leicester Crown Court heard Jon Ruben, 76, who ran a camp for at least 27 years, was arrested in July 2025 after eight children were taken to hospital. Liquid Xanax was found to have been used on some of the victims at Stathern Lodge in Leicestershire. The former vet admitted drugging and abusing two boys - pleading guilty to sexual assault of a child under 13, assault of a child under 13 by penetration, eight counts of child cruelty, three counts of making indecent images of children and four drugs charges. Ruben from Ruddington, Nottinghamshire, this week also admitted a further charge of drugging his wife Susan with temazepam so she would not wake while the abuse took place. On Friday, she told his sentencing he was \"a sadistic, monstrous, paedophile\" who had spent decades \"trying to paint a picture that he was a righteous, honourable man\". She said she felt \"terribly guilty\" about what he had done. Baby oil and syringes At one point, Ruben shouted \"no\" and cried as he heard the prosecution outline the facts of the case and was told by the judge to restrain himself. He was jailed for 23 years and 10 months and will serve a further eight years on licence. Judge Timothy Spencer KC told the court: \"This was the deliberate drugging of boys aged between eight and 11 years to facilitate sexual assaults without detection, and the harm is at the highest level.\" The court previously heard Ruben's stepson had raised concerns during the camp after finding baby oil, syringes containing white powder and other items. The prosecution said the children fell ill after playing a so-called sweet game and found it difficult to walk, had slurred speech and could not wake up. Prosecutor Mary Prior KC said the next morning some were \"walking into walls and in the wrong direction\". Xanax's effects can start after about half an hour and last up to six hours. Ms Prior said Ruben had \"used his cloak of Christianity and his position of authority and trust\" to poison and abuse boys as young as eight at the camp - located eight miles north of Melton Mowbray. 'Devious sexual predator' The prosecution said Ruben had used his skill as a vet to illegally purchase sedatives, research quantities, and crush and inject drugs into very sweet and sticky sweets. Ruben leaned forward in the dock with his head in his hands as graphic details of the abuse were described to the court on Friday. He was heard crying and saying: \"I'm sorry\". The mother of one of the children said her son had \"shut down and started self-harming\", while another victim's mother called him a \"devious sexual predator\". The father of one victim told the court his son \"admired and respected\" Ruben and because the camp was a Christian event they \"were confident it would be safe\", but they had been \"betrayed\". Another father described being \"unbelievably angry\" seeing his son in hospital after he had been drugged and said he \"looked like a zombie\". Addressing Ruben, a child's mother called him a \"disgusting, vile man\" who had \"ruined the lives of these children\". She added: \"I want you to suffer every day.\" Read more from Sky News:'Suffolk Strangler' told he'll die in jail after admitting murderTrump criticised for sharing image of Obamas as apes Temporary Detective Chief Inspector Neil Holden described Ruben as a \"vile, horrific offender\" who \"tried to blame others things, other factors, other people\" for his abuse. He said Ruben had worked in schools, youth organisations and summer camps for at least 20 years and the force is urging any more victims or witnesses to come forward. The owners of Stathern Lodge are independent from those who use or hire it and were not connected to the incident, Leicestershire Police confirmed."
    },
    {
        "title": "'Suffolk Strangler' told he will die in jail as he's sentenced for sixth murder",
        "description": "Police have launched a fresh appeal for information about \"possible previous offending\" by serial killer Steve Wright, as he was jailed for the murder of a teenager more than 25 years ago.",
        "url": "https://news.sky.com/story/fresh-police-appeal-over-suffolk-strangler-steve-wright-as-hes-sentenced-for-sixth-murder-13504065",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-victoria-hall-steve-wright_7153181.jpg?20260202113117",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-02-06 12:54:00",
        "Headline": "Police have now launched a fresh appeal for information about \"possible previous offending\" by serial killer Steve Wright.",
        "Content": "Police have launched a fresh appeal for information about \"possible previous offending\" by serial killer Steve Wright, as he was jailed for the murder of a teenager more than 25 years ago. Wright, dubbed the \"Suffolk Strangler\", was told he will die in prison as he was sentenced for the abduction and murder of 17-year-old Victoria Hall. She had disappeared early on 19 September 1999 in a village on the outskirts of Felixstowe, Suffolk. Wright - who was already serving a whole-life sentence for five other murders - was sentenced on Friday to life in prison with a minimum term of 40 years for Miss Hall's murder and the attempted abduction of Emily Doherty. Outside court after the hearing, Miss Hall's father told reporters: \"Unfortunately, my wife, Lorinda, has not lived to see this day, but she did know that it probably was Steve Wright... \"We lost our lovely daughter, sister, niece, granddaughter, have endured 26 years of hell, which will continue from today onwards and forever.\" He described his daughter as a \"loving girl with a whole life before her\" which was \"snatched away\" by Wright. Suffolk Police said it was appealing for information relating to \"possible previous offending\" by Wright. In a statement, the force said: \"In light of the guilty plea by Steve Wright for the murder of Victoria Hall in 1999, the joint major investigation team are appealing for information relating to him and his possible previous offending. \"Suffolk and Norfolk constabularies are always alive to new information and how this could assist, alongside modern forensic and investigative techniques, to build an evidential case for court and bring offenders to justice.\" Wright tried to abduct a then 22-year-old Ms Doherty just the night before Miss Hall's murder. She had only survived after evading him and seeking refuge in a random couple's home. Ms Doherty exclusively told Sky News she believes if police had taken her story seriously, the other women Wright went on to murder may still be alive today. In her first ever interview with the media, she described how, while she was on a night out, she had to flee from him repeatedly for 40 minutes until someone came to her aid. But when police were called, they treated her like \"a silly little girl\", and failed to follow it up with a full investigation - even after Ms Hall's body was later found. \"It's devastating what happened to everyone else, absolutely devastating,\" Ms Doherty said. \"You can't help thinking, if they had taken me seriously, Vicky could have survived, but certainly if they had found him sooner the five other women would still be here.\" On Monday, Wright admitted to the kidnap and murder of Miss Hall and the attempted kidnap of Ms Doherty. Miss Hall's body was \"callously discarded - stripped naked of everything except for her jewellery\", prosecutor Jocelyn Ledward KC told the Old Bailey. The judge, Mr Justice Bennathan, said it was \"extraordinarily unlikely\" Wright would ever be released from prison. He told Wright: \"Given the sentence from your other dreadful crimes, it is almost certain you will die in prison.\" Wright appeared to give a slight shrug and smile as he was sent down from the dock. After those incidents in the Suffolk town of Felixstowe in 1999, Wright went on to murder five other women. In October 2006 Tania Nicol, 19, vanished from Ipswich; followed by Gemma Adams, 25, around two weeks later. Then in December the body of Anneli Alderton, 24, was discovered in a woodland, followed later by Paula Clennell, 24, and Annette Nicholls, 29. In 2008 was handed a a whole-life prison sentence for the murders."
    },
    {
        "title": "Labour MPs urge Starmer to reveal if he saw peer's warnings about Mandelson's Epstein links",
        "description": "Labour MPs are urging Sir Keir Starmer to reveal whether he saw a report by an influential party peer that warned of Peter Mandelson's links to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/labour-mps-urge-starmer-to-reveal-if-he-saw-peers-warnings-about-mandelsons-epstein-links-13504035",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-keir-starmer-speech_7156342.jpg?20260205121444",
        "type": "Home",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-06 11:36:00",
        "Headline": "Lord Glasman told Sky News he flagged his concerns to Downing Street but received a \"discreet suggestion to basically shut up\".",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n Labour MPs are urging Sir Keir Starmer to reveal whether he saw a report by an influential party peer that warned of Peter Mandelson's links to Jeffrey Epstein. Labour grandee Lord Glassman told Sky News last September that he had flagged to Number 10 about the pair's relationship but was met with a \"discreet suggestion to basically shut up\". Politics latest: Police search Mandelson address In an interview with Sky News' Sophy Ridge, Lord Glasman suggested he was asked to report to Number 10 about the pair's relationship and he did - but suggested no action was taken. \"They asked me to send a report and I sent a report,\" he said. \"I did say when I got back, I would think again about this publicly. \"Then I did get a discreet suggestion to basically shut up about that, and I did.\" \n                  Police search Peter Mandelson's properties in Camden and Wiltshire\n                 \n                  Can Starmer survive the Mandelson scandal? \n                 \n                  Trump grudgingly supports Starmer's Chagos deal\n                 Sky News has approached Downing Street for comment on whether the report was passed to the prime minister but has not received a response. 'Starmer must reveal if he saw Glasman's report' Clive Lewis, the Labour MP for Norwich South, told Sky News that the report \"must be released\". \"Either Maurice [Lord Glassman] needs to show the email trail and the document that he passed on to Number 10. And Number 10 needs to show what they knew. \"The longer this takes to draw out, the more damage to the Labour Party - this needs a clean, all cards on the table approach. \"They can't have it dragged out kicking and screaming - this will destroy us. We need full disclosure. \"Keir Starmer must reveal if he saw Glasman's report or if it was kept from him.\" A minister added: \"We need to know if the PM saw it or if it was deliberately withheld from him. \"The report should be definitely be released. It just highlights how badly Keir was failed by those closest to him.\" It comes as the prime minister continues to face intense pressure over his decision to appoint Lord Mandelson as US ambassador despite admitting that the official security vetting he received mentioned his ongoing relationship with Epstein even following his conviction for soliciting a minor in 2008. On Thursday, Sir Keir attempted to save his premiership by offering an apology to Epstein's victims for believing what he called \"Mandelson's lies\". Addressing Epstein's victims from an event in Hastings, the prime minister said: \"I want to say this: I am sorry. \"Sorry for what was done to you. Sorry that so many people with power failed you. \"Sorry for having believed Mandelson's lies and appointed him, and sorry that even now you're forced to watch this story unfold in public once again.\" Lord Mandelson, a senior adviser to Sir Tony Blair and a cabinet minister during the New Labour years, was sacked in September after he featured in a number of Epstein-related files and photos released by a US Congressional committee. He then resigned from the Labour party and the House of Lords after further damaging revelations were uncovered among a tranche of three million documents released by the US Department of Justice last week. Emails showed that Lord Mandelson had a close business relationship with Epstein as well as personal one. Among the most damaging accusations are that he forwarded market-sensitive information to Epstein - including an alleged forewarning about a €500bn EU bank bailout in 2010. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the financier's victims. During a dramatic day in the Commons on Wednesday, the government agreed to publish documents relating to Lord Mandelson's appointment after the Conservatives tabled a humble address to force their disclosure. Initially the government wanted to release the documents on the condition they did not compromise national security or international relations - but that stance was later watered down following interventions from Angela Rayner, the former deputy prime minister, who demanded that the files deemed to be a risk first be reviewed by parliament's Intelligence and Security Committee. Read more:Top Labour figure warns Mandelson scandal could bring PM downWhat do the Epstein files say about Lord Peter Mandelson? It means that instead of the cabinet secretary deciding what does or does not compromise national security or international relations, that power will lie with the MPs on the committee. The publication of documents may be further delayed by a criminal investigation into Lord Mandelson, whose two properties in Wilshire and Camden were searched on Friday afternoon. Despite the prime minister's public apology to Epstein's victims, Labour MPs were still calling on Mr McSweeney to go. \"Universally we can see PM is a good man and I genuinely believe he means his apology,\" said one minister. \"The problem we have is the people around him - he is clearly reliant on people who give him bad advice. It is a universal feeling in the majority of the PLP [parliamentary Labour Party] that Morgan needs to go.\" Another Labour MP added: \"Keir needs to get rid of Morgan - and he could actually have an OK relationship with the PLP if he did.\" Some reserved their anger for the prime minister, with one backbencher telling Sky News: \"100% Keir needs to go. He wants to hang on to May so he can say things haven't worked out. He wants to blame the local elections. Frankly his name is dirt here.\""
    },
    {
        "title": "Police search Peter Mandelson's properties in Camden and Wiltshire",
        "description": "Two of Peter Mandelson's properties have been searched by police investigating claims of misconduct in a public office.",
        "url": "https://news.sky.com/story/police-search-peter-mandelsons-properties-in-camden-and-wiltshire-13504109",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-police-search_7157799.jpg?20260206200541",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 14:29:00",
        "Headline": "Officers say the warrants related to an \"investigation into misconduct in public office offences, involving a 72-year-old man\".",
        "Content": "Two of Peter Mandelson's properties have been searched by police investigating claims of misconduct in a public office. Boxes were seen being carried from his property in Camden, north London, on Friday evening, while police cars were parked in the driveway of Mandelson's Wiltshire house. Plain-clothed officers also used torches to briefly search a Range Rover outside the London address. Live updates on Mandelson investigation Metropolitan Police deputy assistant commissioner Hayley Sewart said the \"central specialist crime team\" were carrying out the warrants. \"The searches are related to an ongoing investigation into misconduct in public office offences, involving a 72-year-old man,\" said a statement. \"He has not been arrested and enquiries are ongoing.\" The search is part of an investigation into Lord Mandelson following the latest release of files about Jeffrey Epstein, which have revealed more details about the pair's relationship. They appear to show Mandelson passed on market-sensitive information to Epstein when he was business secretary after the 2008 financial crisis. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the financier's victims. 'Significant volume of material' to be reviewed Sir Keir Starmer remains under pressure to release documents related to the peer's vetting to become UK ambassador to the US - a job he was sacked from in September. The prime minister has said Mandelson lied about the depth of his friendship with Epstein ahead of getting the prestigious job. In a letter to the chair of parliament's Intelligence and Security Committee (ISC), Sir Keir said he wanted the documents released as soon as possible. However, he said \"a very significant volume of material\" on Mandelson's appointment as ambassador needed to be reviewed first. In Friday's letter, Sir Keir said he had told the cabinet secretary to work with the ISC on \"how material that may be prejudicial to the UK's national security and international relations is shared and reviewed\". Documents coming 'shortly' Speaking to journalists earlier, Downing Street said the government would publish the documents \"shortly\". Sky News understands the government is working with police to ensure any document released does not undermine the police investigation into Mandelson. Officials are believed to be in the early stages of assessing the documents, of which there are thousands. The scandal surrounding Lord Mandelson has left Sir Keir under severe pressure, with some in Labour wanting him to resign. Labour MPs are urging Sir Keir to reveal whether he saw a report by an influential party peer that warned of Lord Mandelson's links to Epstein. Labour grandee Lord Glasman told Sky News last September that he had flagged to Number 10 about the pair's relationship but was met with a \"discreet suggestion to basically shut up\". Read more:What we've found in Epstein filesSurvivors condemn US government's handling of files In an interview with Sky News' Sophy Ridge, Lord Glasman suggested he was asked to report to Number 10 about the pair's relationship and he did - but suggested no action was taken. \"They asked me to send a report and I sent a report,\" he said. \"I did say when I got back, I would think again about this publicly. \"Then I did get a discreet suggestion to basically shut up about that, and I did.\" McSweeney under pressure Even more focus has been placed on the prime minister's chief of staff, Morgan McSweeney, who was a close political ally of Lord Mandelson. Labour backbencher MP Simon Opher called for a \"clear out at Number 10\". \"If my chief of staff had done this, I think he would be looking for another job,\" Mr Opher told the BBC. Veteran Labour MP Clive Efford and Southport MP Patrick Hurley have also said Mr McSweeney should leave Number 10. PM's future Former cabinet minister and Labour grandee Harriet Harman told the Electoral Dysfunction podcast previously that the prime minister needed a \"real reset\". Sir Keir could lose his premiership if he does not do the right thing, Ms Harman added. However, so far no big names on the current frontline of Labour politics have turned their fire on the prime minister and his staff. Sir Keir on Thursday apologised for believing Lord Mandelson's \"lies\" about his closeness to paedophile financier Epstein. The prime minister made Lord Mandelson the UK's ambassador to the US in 2024. 👉Tap here to listen to Electoral Dysfunction on your podcast app 👈 Following a partial release of the Epstein files last year, Sir Keir sacked him after it emerged how close the pair were. Another tranche of millions of documents released by the US government recently saw Mandelson quit Labour and resign from the House of Lords."
    },
    {
        "title": "'Suffolk Strangler' told he will die in jail as he's sentenced for sixth murder",
        "description": "Police have launched a fresh appeal for information about \"possible previous offending\" by serial killer Steve Wright, as he was jailed for the murder of a teenager more than 25 years ago.",
        "url": "https://news.sky.com/story/fresh-police-appeal-over-suffolk-strangler-steve-wright-as-hes-sentenced-for-sixth-murder-13504065",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-victoria-hall-steve-wright_7153181.jpg?20260202113117",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 12:54:00",
        "Headline": "Police have now launched a fresh appeal for information about \"possible previous offending\" by serial killer Steve Wright.",
        "Content": "Police have launched a fresh appeal for information about \"possible previous offending\" by serial killer Steve Wright, as he was jailed for the murder of a teenager more than 25 years ago. Wright, dubbed the \"Suffolk Strangler\", was told he will die in prison as he was sentenced for the abduction and murder of 17-year-old Victoria Hall. She had disappeared early on 19 September 1999 in a village on the outskirts of Felixstowe, Suffolk. Wright - who was already serving a whole-life sentence for five other murders - was sentenced on Friday to life in prison with a minimum term of 40 years for Miss Hall's murder and the attempted abduction of Emily Doherty. Outside court after the hearing, Miss Hall's father told reporters: \"Unfortunately, my wife, Lorinda, has not lived to see this day, but she did know that it probably was Steve Wright... \"We lost our lovely daughter, sister, niece, granddaughter, have endured 26 years of hell, which will continue from today onwards and forever.\" He described his daughter as a \"loving girl with a whole life before her\" which was \"snatched away\" by Wright. Suffolk Police said it was appealing for information relating to \"possible previous offending\" by Wright. In a statement, the force said: \"In light of the guilty plea by Steve Wright for the murder of Victoria Hall in 1999, the joint major investigation team are appealing for information relating to him and his possible previous offending. \"Suffolk and Norfolk constabularies are always alive to new information and how this could assist, alongside modern forensic and investigative techniques, to build an evidential case for court and bring offenders to justice.\" Wright tried to abduct a then 22-year-old Ms Doherty just the night before Miss Hall's murder. She had only survived after evading him and seeking refuge in a random couple's home. Ms Doherty exclusively told Sky News she believes if police had taken her story seriously, the other women Wright went on to murder may still be alive today. In her first ever interview with the media, she described how, while she was on a night out, she had to flee from him repeatedly for 40 minutes until someone came to her aid. But when police were called, they treated her like \"a silly little girl\", and failed to follow it up with a full investigation - even after Ms Hall's body was later found. \"It's devastating what happened to everyone else, absolutely devastating,\" Ms Doherty said. \"You can't help thinking, if they had taken me seriously, Vicky could have survived, but certainly if they had found him sooner the five other women would still be here.\" On Monday, Wright admitted to the kidnap and murder of Miss Hall and the attempted kidnap of Ms Doherty. Miss Hall's body was \"callously discarded - stripped naked of everything except for her jewellery\", prosecutor Jocelyn Ledward KC told the Old Bailey. The judge, Mr Justice Bennathan, said it was \"extraordinarily unlikely\" Wright would ever be released from prison. He told Wright: \"Given the sentence from your other dreadful crimes, it is almost certain you will die in prison.\" Wright appeared to give a slight shrug and smile as he was sent down from the dock. After those incidents in the Suffolk town of Felixstowe in 1999, Wright went on to murder five other women. In October 2006 Tania Nicol, 19, vanished from Ipswich; followed by Gemma Adams, 25, around two weeks later. Then in December the body of Anneli Alderton, 24, was discovered in a woodland, followed later by Paula Clennell, 24, and Annette Nicholls, 29. In 2008 was handed a a whole-life prison sentence for the murders."
    },
    {
        "title": "Teenager charged with murder of university student in Leicester",
        "description": "An 18-year-old man has been charged with the murder of a university student in Leicester.",
        "url": "https://news.sky.com/story/teenager-charged-with-murder-of-university-student-in-leicester-13502304",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-khaleed-oladipo-leicester_7156538.jpg?20260205150352",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 00:01:00",
        "Headline": "Harper Dennis is accused of murdering Khaleed Oladipo, a cyber security student at De Montfort University, who died after being stabbed in the chest.",
        "Content": "An 18-year-old man has been charged with the murder of a university student in Leicester. Harper Dennis is due to appear at Leicester Magistrates' Court on Saturday, accused of murdering 20-year-old Khaleed Oladipo, Leicestershire Police said. Mr Oladipo, a cyber security student at De Montfort University, died in hospital on Tuesday night after being stabbed in the chest. Dennis, of West Drayton, London, is also charged with possession of an offensive weapon in a public place. He also faces two counts of possession of an offensive weapon in a private place, which are unrelated to the murder investigation. Read more from Sky News:Police carry searches at Mandelson addressesSummer camp leader jailed for sexually assaulting children In a tribute, Mr Oladipo's family said they could not \"begin to put into words how sad we are to have lost Khaleed\". \"He was an extremely loved son, brother, uncle, boyfriend and friend,\" they said. \"Khaleed was a good boy who loved his family. He was in his second year at university, and we were so proud of him. \"One of his main passions was football and he had played since the age of four. \"He was an Arsenal supporter and we believe he was on his way home to watch the game later that night when he was stabbed and killed. \"We want to thank the members of the public who stopped to try and help Khaleed and the ambulance service and hospital staff who did all they could to try and save him.\" This breaking news story is being updated and more details will be published shortly. Please refresh the page for the fullest version. You can receive breaking news alerts on a smartphone or tablet via the Sky News app. You can also follow us on WhatsApp and subscribe to our YouTube channel to keep up with the latest news."
    },
    {
        "title": "Julia Donaldson reveals new character for third Gruffalo",
        "description": "The next Gruffalo book will introduce a new member to the monster's family, best selling children's author Julia Donaldson has revealed.",
        "url": "https://news.sky.com/story/details-of-eagerly-awaited-new-gruffalo-book-revealed-13504213",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-gruffalo-gruffalo-granny_7157723.png?20260206190404",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 18:51:00",
        "Headline": "The Gruffalo family will expand in the long anticipated third book about Julia Donaldson's much loved monster - titled Gruffalo Granny.",
        "Content": "The next Gruffalo book will introduce a new member to the monster's family, best selling children's author Julia Donaldson has revealed. Gruffalo Granny will be published on 10 September 2026. This third instalment comes more than 20 years after Donaldson's last foray into the deep dark wood, the 2004 The Gruffalo's Child, which was a sequel to the 1999 best-selling original. The news that she would be revisiting the character with knobbly knees, turned out toes and a poisonous wart on the end of his nose was first announced in April 2025. Now some details about the book have been released. It will feature a visit from new character the Gruffalo Granny, with an excerpt reading: \"The Gruffalo said to his daughter one day, your Gruffalo Granny is coming to stay.\" The story, which will again feature illustrations by Donaldson's frequent collaborator Axel Scheffler, will also see the return of the characters from the previous two books, including Fox, Snake, Owl and Mouse. Donaldson said: \"It's always a challenge to write a sequel. \"Five years elapsed between publication of The Gruffalo and The Gruffalo's Child, and now it will be more than 20 between The Gruffalo's Child and the third book. \"I actually had the basic idea for the story a long time ago but couldn't think how to develop it. \"It was only when the National Literacy Trust, whose work I'm very impressed by, used the first two books as part of their Early Words Matter programme that I was spurred on to get my idea out of the cupboard and see once and for all if I could turn it into a really satisfying story. \"To my surprise, I managed to do just that! I was of course delighted when Axel came on board and am even more so now that I've seen the brilliant illustrations he's done for the new book. \"I really hope that children - and adults too - will enjoy the new story, as I know what a wonderful experience shared reading can be.\" The Gruffalo and The Gruffalo's Child have sold more than 18 million copies combined and the books have been translated into 115 languages and dialects. Fans got the chance to see the illustration of Gruffalo Granny when Scheffler's illustration was projected in central London and Glasgow on Friday evening."
    },
    {
        "title": "Nigerian court orders UK to pay £420m over coal mine deaths in 1949",
        "description": "A Nigerian court has reportedly ordered the UK to pay &#163;420m to the families of 21 striking miners killed by security forces during British colonial rule.",
        "url": "https://news.sky.com/story/nigerian-court-orders-uk-to-pay-163420m-over-coal-mine-deaths-in-1949-13504264",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-enugu-nigeria_7157911.jpg?20260206215525",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 20:38:00",
        "Headline": "The incident is widely seen in Nigeria as one of the events that led to agitations for independence in Africa's most populous nation.",
        "Content": "A Nigerian court has reportedly ordered the UK to pay £420m to the families of 21 striking miners killed by security forces during British colonial rule. The judge, Justice Anthony Onovo of the Enugu High Court, found the former colonial administration liable over the 1949 incident and said Britain should formally apologise. The UK was not represented in court, according to local reports, and the government has declined to comment. The miners, who were protesting over harsh working conditions and had occupied the facility, were shot by colonial police at the Iva Valley Coal Mine in southeastern Enugu state. Fifty-one others were seriously injured in the shooting, News Agency of Nigeria reported. \"These defenceless coal miners were asking for improved work conditions, they were not embarking on any violent action against the authorities, but yet were shot and killed,\" the judge said. Campaigners have been pursuing damages for decades and Mr Onovo said a £20m payment to each family would be \"effective remedy and compensation for the violations of the right to life\". \n                  'More than 170' killed in suspected Islamist attack in Nigeria\n                 \n                  Anthony Joshua pays tribute to friends killed in Nigeria crash\n                 \n                  Nigerian bandits who kidnapped 150 churchgoers demand motorbikes in return\n                 He also ruled that the Nigerian government had failed in its duty to seek redress for the victims. Read more from Sky News:Norway's crown princess apologises over Epstein linksPakistan suicide bombing leaves at least 31 dead  The incident is widely seen in Nigeria as one of the events that led to agitations for independence in Africa's most populous nation. The country broke free from Britain 11 years later in 1960. A lawyer on the case, Yemi Akinseye-George, said Thursday's ruling gave \"historical accountability and justice for colonial-era violations, affirming that the right to life transcends time, borders, and changes in sovereignty\"."
    },
    {
        "title": "Michelin-star restaurant owner spiked woman's cocktail with date-rape drug",
        "description": "The owner of a Michelin-star restaurant has been found guilty of spiking a woman's drink with a date-rape drug at a Mayfair private members' club in a bid to overpower her for sex.",
        "url": "https://news.sky.com/story/michelin-star-restaurant-owner-spiked-womans-cocktail-with-date-rape-drug-13504159",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-vikas-nath-southwark_7155726.jpg?20260206184453",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 15:58:00",
        "Headline": "Jurors were told Vikas Nath wanted to have sex with his companion at his Knightsbridge home and film it. But he had become impatient and put GBL in her spicy margarita at Mayfair members club, Annabel's.",
        "Content": "The owner of a Michelin-star restaurant has been found guilty of spiking a woman's drink with a date-rape drug at a Mayfair private members' club in a bid to overpower her for sex. Vikas Nath, 63, laced the woman's spicy margarita with gamma-butyrolactone (GBL) after she left him with the drink in the rooftop garden bar at Annabel's in the exclusive area of London on 15 January 2024. Southwark Crown Court heard Nath had grown frustrated with the woman's apparent reluctance to have sex with him prior to the spiking incident and took GBL in a vanilla extract bottle with him to the club. Nath had two bottles of the liquid drug at his home, in Knightsbridge, London, as well as a motion sensor-activated covert camera pointed at his bed. The businessman, who owns Benares in Mayfair and other top restaurants in the UK and Spain, admitted in a police interview to past incidents when he had covertly filmed sex at his home. Prosecutors said his plan was to drug the woman and take her back to his home for sex when she had been \"overpowered or stupefied\". However, Annabel's staff noticed \"rather strange actions\" by Nath, who was using a straw to put GBL into the margarita, and intervened to stop the woman from drinking it. \n                  Steve Wright sentencing live: 'Suffolk Strangler' told he'll die in prison after admitting to 1999 murder and kidnap\n                 \n                  Sledgehammer-wielding robbers raid family jewellers in Richmond, London\n                 \n                  Man who stabbed nine-year-old Lilia Valutyte in the heart found guilty of murder\n                 On Friday, Nath was found guilty by a jury of attempting to administer a substance with intent and possession of a Class B drug. As the jury returned its verdicts, the restaurateur could be seen shaking his head in the dock. He had been forced to admit spiking the woman's drink after being apprehended by Annabel's staff and recorded on the exclusive members' club's CCTV. The court heard Nath - after realising he had been \"rumbled\" - threw the bottle of Madagascar vanilla extract into a toilet cistern, but it was later recovered by police. Bar staff also managed to retrieve the spiked drink from the table, so it could later be tested by police forensics experts. The woman told the court that she felt \"betrayed\" and had not believed the staff at first. \"I remember vividly defending Mr Nath, saying 'There is no way he could do that',\" she said. \"I remember sending him a message saying, 'I'm sorry, I don't know what's happening'. Because I felt it was my fault.\" Nath had actually warned the woman about drinks being spiked before, messaging her saying: \"My biggest concern last night was someone spiking your drink.\" The woman told the court that their relationship had not been a sexual one. After he was arrested at the club, Nath admitted spiking the woman's drink without her consent, but insisted he had been trying to \"relax\" her rather than overpower her for sex. He claimed to have obtained GBL to clean the wheel rims of a high-powered car, on the advice of a friend. In texts shown to the jury, Nath had described the woman to a friend as \"eminently f***able\". He had said of their friendship \"I want to get laid, not hold hands\", and suggested he would need to \"play the long game\". Read more from Sky News:British man holidaying in Spain with family falls to death from hotelThe most striking pictures of the week On the day of the spiking incident, he wrote: \"I'm at Annabel's. This is probably the last evening with (her). She ain't biting.\" Nath was \"impatient with lack of progress\", said Prosecutor Tim Clark KC, telling jurors the restaurateur \"wanted to have sex at his house where there was a camera, and it could record it\". In the witness box, Nath broke down in tears as he admitted spiking the drink had been \"wrong\". \"I regret it very deeply\", he said, but argued he had not been thinking about sex at the time. He also argued that he did not realise the substance was an illegal drug. After the guilty verdicts, Timothy Greaves, from the CPS, said: \"Spiking is an incredibly serious offence that leaves victims traumatised and fearful. \"While these offences can often go undetected, the CPS is clear that offenders like Nath will face the full extent of the law so we can deliver the justice victims deserve.\" A further hearing in Nath's case has been scheduled for 16 February."
    },
    {
        "title": "Labour MPs urge Starmer to reveal if he saw peer's warnings about Mandelson's Epstein links",
        "description": "Labour MPs are urging Sir Keir Starmer to reveal whether he saw a report by an influential party peer that warned of Peter Mandelson's links to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/labour-mps-urge-starmer-to-reveal-if-he-saw-peers-warnings-about-mandelsons-epstein-links-13504035",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-keir-starmer-speech_7156342.jpg?20260205121444",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-06 11:36:00",
        "Headline": "Lord Glasman told Sky News he flagged his concerns to Downing Street but received a \"discreet suggestion to basically shut up\".",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n Labour MPs are urging Sir Keir Starmer to reveal whether he saw a report by an influential party peer that warned of Peter Mandelson's links to Jeffrey Epstein. Labour grandee Lord Glassman told Sky News last September that he had flagged to Number 10 about the pair's relationship but was met with a \"discreet suggestion to basically shut up\". Politics latest: Police search Mandelson address In an interview with Sky News' Sophy Ridge, Lord Glasman suggested he was asked to report to Number 10 about the pair's relationship and he did - but suggested no action was taken. \"They asked me to send a report and I sent a report,\" he said. \"I did say when I got back, I would think again about this publicly. \"Then I did get a discreet suggestion to basically shut up about that, and I did.\" \n                  Police search Peter Mandelson's properties in Camden and Wiltshire\n                 \n                  Can Starmer survive the Mandelson scandal? \n                 \n                  Trump grudgingly supports Starmer's Chagos deal\n                 Sky News has approached Downing Street for comment on whether the report was passed to the prime minister but has not received a response. 'Starmer must reveal if he saw Glasman's report' Clive Lewis, the Labour MP for Norwich South, told Sky News that the report \"must be released\". \"Either Maurice [Lord Glassman] needs to show the email trail and the document that he passed on to Number 10. And Number 10 needs to show what they knew. \"The longer this takes to draw out, the more damage to the Labour Party - this needs a clean, all cards on the table approach. \"They can't have it dragged out kicking and screaming - this will destroy us. We need full disclosure. \"Keir Starmer must reveal if he saw Glasman's report or if it was kept from him.\" A minister added: \"We need to know if the PM saw it or if it was deliberately withheld from him. \"The report should be definitely be released. It just highlights how badly Keir was failed by those closest to him.\" It comes as the prime minister continues to face intense pressure over his decision to appoint Lord Mandelson as US ambassador despite admitting that the official security vetting he received mentioned his ongoing relationship with Epstein even following his conviction for soliciting a minor in 2008. On Thursday, Sir Keir attempted to save his premiership by offering an apology to Epstein's victims for believing what he called \"Mandelson's lies\". Addressing Epstein's victims from an event in Hastings, the prime minister said: \"I want to say this: I am sorry. \"Sorry for what was done to you. Sorry that so many people with power failed you. \"Sorry for having believed Mandelson's lies and appointed him, and sorry that even now you're forced to watch this story unfold in public once again.\" Lord Mandelson, a senior adviser to Sir Tony Blair and a cabinet minister during the New Labour years, was sacked in September after he featured in a number of Epstein-related files and photos released by a US Congressional committee. He then resigned from the Labour party and the House of Lords after further damaging revelations were uncovered among a tranche of three million documents released by the US Department of Justice last week. Emails showed that Lord Mandelson had a close business relationship with Epstein as well as personal one. Among the most damaging accusations are that he forwarded market-sensitive information to Epstein - including an alleged forewarning about a €500bn EU bank bailout in 2010. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the financier's victims. During a dramatic day in the Commons on Wednesday, the government agreed to publish documents relating to Lord Mandelson's appointment after the Conservatives tabled a humble address to force their disclosure. Initially the government wanted to release the documents on the condition they did not compromise national security or international relations - but that stance was later watered down following interventions from Angela Rayner, the former deputy prime minister, who demanded that the files deemed to be a risk first be reviewed by parliament's Intelligence and Security Committee. Read more:Top Labour figure warns Mandelson scandal could bring PM downWhat do the Epstein files say about Lord Peter Mandelson? It means that instead of the cabinet secretary deciding what does or does not compromise national security or international relations, that power will lie with the MPs on the committee. The publication of documents may be further delayed by a criminal investigation into Lord Mandelson, whose two properties in Wilshire and Camden were searched on Friday afternoon. Despite the prime minister's public apology to Epstein's victims, Labour MPs were still calling on Mr McSweeney to go. \"Universally we can see PM is a good man and I genuinely believe he means his apology,\" said one minister. \"The problem we have is the people around him - he is clearly reliant on people who give him bad advice. It is a universal feeling in the majority of the PLP [parliamentary Labour Party] that Morgan needs to go.\" Another Labour MP added: \"Keir needs to get rid of Morgan - and he could actually have an OK relationship with the PLP if he did.\" Some reserved their anger for the prime minister, with one backbencher telling Sky News: \"100% Keir needs to go. He wants to hang on to May so he can say things haven't worked out. He wants to blame the local elections. Frankly his name is dirt here.\""
    },
    {
        "title": "Paedophile camp leader Jon Ruben jailed for 23 years for sexually abusing children he drugged with sweets",
        "description": "A summer camp leader who drugged children with sweets laced with a tranquiliser before sexually assaulting them has been jailed for more than 23 years.",
        "url": "https://news.sky.com/story/summer-camp-leader-jon-ruben-jailed-for-drugging-and-sexually-assaulting-children-13503963",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-jon-ruben-leicestershire_7157377.png?20260206130504",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-02-06 13:03:00",
        "Headline": "Ruben's stepson raised concerns after finding baby oil and syringes containing white powder. The paedophile held his head in his hands and sobbed during sentencing, and was heard saying \"I'm sorry\".",
        "Content": "A summer camp leader who drugged children with sweets laced with a tranquiliser before sexually assaulting them has been jailed for more than 23 years. Warning: This report contains references to graphic material including self-harm and sexual abuse which readers may find distressing Leicester Crown Court heard Jon Ruben, 76, who ran a camp for at least 27 years, was arrested in July 2025 after eight children were taken to hospital. Liquid Xanax was found to have been used on some of the victims at Stathern Lodge in Leicestershire. The former vet admitted drugging and abusing two boys - pleading guilty to sexual assault of a child under 13, assault of a child under 13 by penetration, eight counts of child cruelty, three counts of making indecent images of children and four drugs charges. Ruben from Ruddington, Nottinghamshire, this week also admitted a further charge of drugging his wife Susan with temazepam so she would not wake while the abuse took place. On Friday, she told his sentencing he was \"a sadistic, monstrous, paedophile\" who had spent decades \"trying to paint a picture that he was a righteous, honourable man\". She said she felt \"terribly guilty\" about what he had done. Baby oil and syringes At one point, Ruben shouted \"no\" and cried as he heard the prosecution outline the facts of the case and was told by the judge to restrain himself. He was jailed for 23 years and 10 months and will serve a further eight years on licence. Judge Timothy Spencer KC told the court: \"This was the deliberate drugging of boys aged between eight and 11 years to facilitate sexual assaults without detection, and the harm is at the highest level.\" The court previously heard Ruben's stepson had raised concerns during the camp after finding baby oil, syringes containing white powder and other items. The prosecution said the children fell ill after playing a so-called sweet game and found it difficult to walk, had slurred speech and could not wake up. Prosecutor Mary Prior KC said the next morning some were \"walking into walls and in the wrong direction\". Xanax's effects can start after about half an hour and last up to six hours. Ms Prior said Ruben had \"used his cloak of Christianity and his position of authority and trust\" to poison and abuse boys as young as eight at the camp - located eight miles north of Melton Mowbray. 'Devious sexual predator' The prosecution said Ruben had used his skill as a vet to illegally purchase sedatives, research quantities, and crush and inject drugs into very sweet and sticky sweets. Ruben leaned forward in the dock with his head in his hands as graphic details of the abuse were described to the court on Friday. He was heard crying and saying: \"I'm sorry\". The mother of one of the children said her son had \"shut down and started self-harming\", while another victim's mother called him a \"devious sexual predator\". The father of one victim told the court his son \"admired and respected\" Ruben and because the camp was a Christian event they \"were confident it would be safe\", but they had been \"betrayed\". Another father described being \"unbelievably angry\" seeing his son in hospital after he had been drugged and said he \"looked like a zombie\". Addressing Ruben, a child's mother called him a \"disgusting, vile man\" who had \"ruined the lives of these children\". She added: \"I want you to suffer every day.\" Read more from Sky News:'Suffolk Strangler' told he'll die in jail after admitting murderTrump criticised for sharing image of Obamas as apes Temporary Detective Chief Inspector Neil Holden described Ruben as a \"vile, horrific offender\" who \"tried to blame others things, other factors, other people\" for his abuse. He said Ruben had worked in schools, youth organisations and summer camps for at least 20 years and the force is urging any more victims or witnesses to come forward. The owners of Stathern Lodge are independent from those who use or hire it and were not connected to the incident, Leicestershire Police confirmed."
    },
    {
        "title": "'Incel' schoolboy who threatened Valentine's Day massacre pleads guilty to terrorism offences",
        "description": "An \"incel\" schoolboy who threatened to launch a Valentine's Day massacre has pleaded guilty to possessing bomb-making videos.",
        "url": "https://news.sky.com/story/incel-schoolboy-who-threatened-valentines-day-massacre-pleads-guilty-to-terrorism-offences-13504141",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-dihan-rahman-incel_7157597.jpg?20260206161609",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2026-02-06 15:37:00",
        "Headline": "Dihan Rahman also threatened to attack his school's prom and released \"doxing\" material on to the internet to encourage online attacks on female pupils.",
        "Content": "By Duncan Gardham, security journalist  An \"incel\" schoolboy who threatened to launch a Valentine's Day massacre has pleaded guilty to possessing bomb-making videos. Dihan Rahman, then aged 17, also made threats to attack his school's prom and released \"doxing\" material on to the internet to encourage online attacks on female pupils. The former army cadet from Uxbridge, west London, had violent Islamist material on his phone and was the administrator of a far-right social media group in the first known case of extremists finding \"common ground\" over their hatred of Jews. He took selfies, dressed in his cadet uniform, giving a Nazi salute, with the caption \"Heil Hitler\" and took an image of himself with a noose and the caption \"kys [kill yourself] f****t\", along with the numbers 1488 - a code for a white supremacist slogan. Doxing is an online practice of exposing personal information about others to encourage members of the online 'troll' community to harass the named victim. Rahman admitted to stalking a girl, who was two years younger than him, after she spurned his advances, along with her friend, who was the same age, and a teacher who investigated the stalking. Even after his arrest, he made threats from behind bars as part of a misogynistic campaign against the women, the Old Bailey was told. Serena Gates, prosecuting, had told the Old Bailey that Rahman had \"embraced\" extreme ideology that included graphic videos of women being mutilated and abused. He was said to have material showing \"Incel ideology\" and misogyny alongside far-right and violent Islamist videos. Incel is an online subculture of male so-called \"involuntary celibates\" which blames women for a lack of success in relationships and encourages violent attacks as retribution. Read more from Sky News:Only 'Suffolk Strangler' survivor describes being chased by himSummer camp leader jailed for drugging and sexually assaulting kids Following an incident on 15 March 2024, in which Rahman took pictures of a girl, a teacher examined his phone and found images of beheadings, dead bodies, women being lashed and strangled by cable ties and images of Hitler, Saddam Hussein, and extreme political ideology. One image showed Rahman wearing military fatigues and giving a Nazi salute and another showed him in the same outfit, holding up a green cord tied in a noose. The teacher also saw images of Rahman with a headscarf around his face, in army uniform with the words \"kill yourself\" and an image saying: \"Who's in for a valentines school shooting?\" Rahman was also an administrator for a far-right group on the Telegram social media app called the Sturmjager Division, a violent extremist group that attracted young members, inspired by mass killers and figures from the far-right. Rahman also had images and videos supporting Hamas and the October 7 attacks on Israel, along with graphic footage of ISIS executions and appeared to have made \"common cause\" with the far right, Ms Gates said. Rahman had denied possessing bomb-making documents and videos that included the instructions used by the Manchester Arena bomber but changed his plea on the second day of the trial. Now aged 19, he pleaded guilty to possessing two videos and one document useful for terrorism. Three other charges were ordered to lie on file. The judge, Simon Mayo KC, told him: \"These are very serious offences and they will require appropriate punishment but I will take into account everything I read and am told about you before I decide what type and how long that sentence should be.\" The judge ordered a pre-sentence report and he will be sentenced in May. Chief Superintendent Helen Flanagan, head of operations for Counter-Terrorism Policing London, said: \"This case is yet another example of a growing and concerning trend of young people being drawn into extremist, violent and terrorist ideologies - principally from what they are exposed to and consuming online. \"Rahman's actions towards his victims - two of whom were teenaged girls - were completely unacceptable and I want to praise their incredible courage and resilience throughout this whole ordeal.\""
    },
    {
        "title": "Mystery as Russian general shot at close range - with equally curious response from the Kremlin",
        "description": "From the Skripal poisonings to the invasion of Ukraine to subverting American elections, it is hard to think of a Russian outrage Lieutenant General Vladimir Alekseyev has not been involved in.",
        "url": "https://news.sky.com/story/this-russian-general-fought-and-meddled-for-vladimir-putin-around-the-world-now-hes-fighting-for-his-own-life-13504073",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-russia-alexeyev-assasination_7157416.jpg?20260206133713",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-02-06 13:10:00",
        "Headline": "Lieutenant General Vladimir ‍Alekseyev is fighting for his life after being shot several times in a Moscow apartment building - and Russia is blaming Ukraine.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n From the Skripal poisonings to the invasion of Ukraine to subverting American elections, it is hard to think of a Russian outrage Lieutenant General Vladimir Alekseyev has not been involved in. He is now fighting for his life in a Moscow hospital, the victim himself of foul play. The military intelligence deputy chief had a role in so many of Vladimir Putin's acts of malice stretching back decades. And he would have had no shortage of enemies. And yet, this high-ranking soldier spy was so badly protected that his would-be killer was able to shoot him several times at close range in the stairwell of his own apartment building. As in any cheap spy novel, the shooter is reported to have slipped in behind him, entering the building by posing as a food delivery courier. That is not the only mystery about this astonishing attempted assassination. \n                  Second fatal bombing in Moscow 'embarrassing' for Kremlin but helpful timing for Ukraine\n                 \n                  Ksenia Karelina: Ballerina arrives home in US after 'nightmare' of Russian penal colony\n                 \n                  Do Russians believe Donald Trump can stop the war in Ukraine?\n                 The Kremlin's response to it has been curious too. \"It's clear\", said spokesman Dmitri Peskov, \"that such military leaders and high-ranking specialists are at risk during wartime. It's not the Kremlin's job to figure out how to ensure their safety.\" You're on your own boys, seemed to be the message, hardly reassuring for some of Russia's highest-ranking and most decorated commanders. And Lt Gen Alekseyev is just the latest in a line of top Russians neutralised or attacked on home turf. Officially, Russia is unsurprisingly blaming Ukraine. Foreign Minister Sergei Lavrov called it a terrorist act designed to \"provoke, in turn, the goal of disrupting the negotiation process\". But in truth, there are any number of people who would have wanted Alekseyev dead. He helped orchestrate the botched attempt to kill Sergei Skripal in Salisbury with the nerve agent Novichok. He was deeply involved with Russia's murderous campaign in Syria that targeted hospitals, clinics and aid convoys. He is alleged to have been involved in Russian efforts to undermine both the 2016 and 2020 US elections. Read more from Sky News:Iran and US to begin high-stakes talksHistoric crown crushed during Louvre heist And when Yevgeny Prigozhin's Wagner group mutinied and marched on Moscow, Lt Gen Alekseyev helped negotiate an end to its rebellion. Mr Prigozhin himself, of course, would die some time later in a mysterious plane accident. If Ukrainians were behind the attempt on the general's life, it would signal a catastrophic failure of security at the very top of Russia's military intelligence structure. But it may just as well be the result of an internal power struggle within those elites. Either way, the shooting bodes ill for the leadership of Putin's Russia."
    },
    {
        "title": "Trump administration wants to deport five-year-old detained by ICE in Minnesota",
        "description": "The Trump administration is moving to deport a five-year-old boy who was detained by Immigration and Customs Enforcement (ICE) agents in Minnesota last month.",
        "url": "https://news.sky.com/story/trump-administration-wants-to-deport-five-year-old-detained-by-ice-in-minnesota-13504253",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-minnesota-liam-conejo-ramos_7152537.jpg?20260201174129",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 20:15:00",
        "Headline": "Liam Conejo Ramos and his father were taken into custody by immigration enforcement agents outside their home in Minneapolis on 20 January.",
        "Content": "The Trump administration is moving to deport a five-year-old boy who was detained by Immigration and Customs Enforcement (ICE) agents in Minnesota last month. Homeland Security, which oversees immigration enforcement, confirmed on Friday that it would seek to deport Liam Conejo Ramos, but denied a claim by a lawyer for the boy that it was seeking expedited removal. The move was \"extraordinary\" and possibly \"retaliatory\", his lawyer Danielle Molliver told New York Times. \"These are regular removal proceedings,\" Homeland Security spokesperson Tricia McLaughlin said. \"This is standard procedure and there is nothing retaliatory about enforcing the nation's immigration laws.\" The boy and his father, Adrian Alexander Conejo Arias, were taken into custody by ICE agents on the driveway of their family home on 20 January. The pair was then flown more than 1,000 miles from their home in Minneapolis to a facility in Texas. Nearly two weeks later, they were released following a judge's order and returned to Minnesota. The judge was critical of Mr Trump's immigration crackdown saying that \"the case has its genesis in the ill-conceived and incompetently-implemented government pursuit of daily deportation quotas, apparently even if it requires traumatising children\". The five-year-old, who was born in Ecuador, and Mr Conejo Arias came to the US legally as asylum applicants. Read more: My five-year-old son has nightmares after ICE detention The Trump administration defended the move to detain them, with Homeland Security accusing Mr Conejo Arias of being in the US illegally, without providing details. Mr Conejo Arias said his son \"hasn't been the same since all this happened\". Read more:What is ICE and what powers do its agents have?ICE agents ordered to leave Minnesota A photo of child, wearing a bunny hat and Spider-Man backpack as he was surrounded by ICE agents, went viral and caused outrage among protesters and the wider public. Their detention came between the high-profile killings of Minneapolis residents Renee Nicole Good and Alex Pretti, both 37 and US citizens."
    },
    {
        "title": "Pakistan suicide bombing leaves at least 31 dead and 169 injured",
        "description": "At least 31 people have been killed and 169 injured in a suicide bombing in Pakistan.",
        "url": "https://news.sky.com/story/pakistan-suicide-bombing-leaves-at-least-31-dead-and-169-injured-13504146",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-pakistan-bombing_7157642.jpg?20260206170637",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 15:46:00",
        "Headline": "The blast ripped through an Islamabad Shiite mosque during Friday prayers. Authorities say the bomber opened fire on security guards before blowing himself up. ",
        "Content": "At least 31 people have been killed and 169 injured in a suicide bombing in Pakistan. The blast ripped through a Shiite mosque on the outskirts of Pakistan's capital Islamabad during Friday's morning prayers. Witnesses to the attack describe chaotic scenes with bodies lying on the Khadija Al-Kubra mosque's carpeted floors and the wounded screaming for help. Footage of the aftermath shows police and residents transporting the injured to nearby hospitals, with some in a critical condition. The Islamic State terror group has claimed responsibility for the attack. Earlier, Pakistan's defence minister suggested the Taliban was behind the attack, acting as a proxy for India. But India has rejected the allegation as \"baseless\". Hussain Shah said he was praying in the mosque courtyard when he heard a sudden, loud explosion. \n                  Pakistan latest: India rejects 'baseless' allegations after bomb attack at Pakistan mosque kills dozens\n                 \n                  Nearly 150 militants killed in 40-hour battle after deadly attacks in Pakistan\n                 \n                  67 people killed in Pakistan shopping centre fire\n                 \"I immediately thought that some big attack had happened,\" he said. Pakistan's President Asif Ali Zardari and Prime Minister Shehbaz Sharif condemned the attack and extended their condolences to the families of those killed. \"Targeting innocent civilians is a crime against humanity,\" Mr Zardari said. \"The nation stands with the affected families in this difficult time.\" Mr Sharif said he had ordered a full investigation, adding: \"Those who are responsible must be identified and punished\". Pakistan's defence minister Khawaja Muhammad Asif said on X that the mosque's security guards tried to intercept the suspect, who opened fire and then detonated his explosives among the last row of worshippers. He said the bomber had \"been proven to have been coming and going from Afghanistan\". The minister also accused India of using \"proxies\" against Pakistan. \"The threads of the alliance between India and the Taliban are being uncovered,\" he wrote. \"The state will respond to this oppression with full force.\" But India's foreign ministry hit back, saying in a post on X: \"It is unfortunate that, instead of seriously addressing the problems plaguing its social fabric, Pakistan should choose to delude itself by blaming others for its home-grown ills. \"India rejects any and every such allegation, which is as baseless as it is pointless.\" Pakistan often accuses Afghanistan, where the Taliban seized power again in August 2021, of harbouring militants. But Afghanistan's foreign ministry also denied involvement, condemning attacks on mosques as being against Islamic values. Read more from Sky News:Iran and US to begin high-stakes talks amid fears of conflictNorth Korea 'executes schoolchildren for watching Squid Game' The bombing has overshadowed the return of the Basant kite flying festival in Pakistan following the lifting of an 18-year ban, with authorities announcing that a related concert in Lahore had been cancelled because of the attack. Pakistan has struggled to rein in a surge in militant attacks across the country, especially in Balochistan province in the country's southwest. The country's largest and poorest province was brought to a virtual standstill last Saturday when the separatist Baloch Liberation Army (BLA) launched a coordinated attack. Its fighters entered schools, banks, markets and security installations and temporarily took over the desert town of Nushki. Security forces responded by killing at least 216 militants in a week-long operation that concluded on Friday. Ethnic Baloch separatists have sought greater autonomy and a larger share of the region's natural resources."
    },
    {
        "title": "Norway's crown princess Mette-Marit apologises over Epstein links",
        "description": "Norway's crown princess Mette-Marit has apologised for her friendship with Jeffrey Epstein after the latest release of files about the late convicted sex offender.",
        "url": "https://news.sky.com/story/norways-crown-princess-mette-marit-apologises-over-epstein-links-13504085",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-norway-crown-princess_7157461.jpg?20260206141001",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 13:37:00",
        "Headline": "Crown ⁠Princess Mette-Marit has apologised to Norway's king and queen for her ties to paedophile financier Jeffrey Epstein, saying she should have realised \"sooner what kind of person he was\".",
        "Content": "Norway's crown princess Mette-Marit has apologised for her friendship with Jeffrey Epstein after the latest release of files about the late convicted sex offender. Crown ⁠Princess Mette-Marit said on Friday that she \"must take responsibility for not having investigated Epstein's background more thoroughly, and for not realising sooner what kind of person he was\". She added: \"I showed poor judgment and regret having had any contact with Epstein at all. It is simply embarrassing.\" \"I also apologise for the ‍situation that I have put the royal family ‌in, especially ⁠the King ‌and Queen,\" ‍Crown Princess Mette-Marit said. Her statement comes after the latest tranche of files concerning Epstein revealed that she had extensive email contact with him after he was found guilty of child sex crimes in 2008. The documents show that Crown ⁠Princess Mette-Marit used one of Epstein's properties in Palm Beach, Florida, in 2013. Appearing in the Epstein files release does not imply any wrongdoing. \n                  We've combed through thousands of pages, photos and videos - here's what we've found in Epstein files\n                 \n                  Can Starmer survive the Mandelson scandal? \n                 \n                  King's response to heckler will frustrate critics - but he doesn't want Andrew to be a distraction\n                 Crown ⁠Princess Mette-Marit said in 2019 that she regretted having had contact with Epstein. Read more:Epstein files: The key findings so farSurvivors condemn US government's handling of files The files emerged as Norway's royal family came under scrutiny as Crown ⁠Princess Mette-Marit's son, Marius Borg Hoiby, went on trial for rape and domestic violence offences. Epstein died in prison in 2019 while awaiting trial on sex trafficking charges. His death was ruled as suicide."
    },
    {
        "title": "Nigerian court orders UK to pay £420m over coal mine deaths in 1949",
        "description": "A Nigerian court has reportedly ordered the UK to pay &#163;420m to the families of 21 striking miners killed by security forces during British colonial rule.",
        "url": "https://news.sky.com/story/nigerian-court-orders-uk-to-pay-163420m-over-coal-mine-deaths-in-1949-13504264",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-enugu-nigeria_7157911.jpg?20260206215525",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 20:38:00",
        "Headline": "The incident is widely seen in Nigeria as one of the events that led to agitations for independence in Africa's most populous nation.",
        "Content": "A Nigerian court has reportedly ordered the UK to pay £420m to the families of 21 striking miners killed by security forces during British colonial rule. The judge, Justice Anthony Onovo of the Enugu High Court, found the former colonial administration liable over the 1949 incident and said Britain should formally apologise. The UK was not represented in court, according to local reports, and the government has declined to comment. The miners, who were protesting over harsh working conditions and had occupied the facility, were shot by colonial police at the Iva Valley Coal Mine in southeastern Enugu state. Fifty-one others were seriously injured in the shooting, News Agency of Nigeria reported. \"These defenceless coal miners were asking for improved work conditions, they were not embarking on any violent action against the authorities, but yet were shot and killed,\" the judge said. Campaigners have been pursuing damages for decades and Mr Onovo said a £20m payment to each family would be \"effective remedy and compensation for the violations of the right to life\". \n                  'More than 170' killed in suspected Islamist attack in Nigeria\n                 \n                  Anthony Joshua pays tribute to friends killed in Nigeria crash\n                 \n                  Nigerian bandits who kidnapped 150 churchgoers demand motorbikes in return\n                 He also ruled that the Nigerian government had failed in its duty to seek redress for the victims. Read more from Sky News:Norway's crown princess apologises over Epstein linksPakistan suicide bombing leaves at least 31 dead  The incident is widely seen in Nigeria as one of the events that led to agitations for independence in Africa's most populous nation. The country broke free from Britain 11 years later in 1960. A lawyer on the case, Yemi Akinseye-George, said Thursday's ruling gave \"historical accountability and justice for colonial-era violations, affirming that the right to life transcends time, borders, and changes in sovereignty\"."
    },
    {
        "title": "Iran and US to begin high-stakes talks amid fears of conflict",
        "description": "Iranian and American officials will kick off face-to-face talks in Oman today, following weeks of threatened military action by Donald Trump.",
        "url": "https://news.sky.com/story/iran-and-us-to-begin-high-stakes-talks-amid-fears-of-conflict-13503914",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-us_7156991.jpg?20260206053604",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 05:14:00",
        "Headline": "The US and Iran have threatened one another with strikes over recent weeks - and expectations of a breakthrough during Friday's discussions are low.",
        "Content": "Iranian and American officials will kick off face-to-face talks in Oman today, following weeks of threatened military action by Donald Trump. The US is sending its Middle East envoy, Steve Witkoff, to the Muscat summit, where he will meet with Tehran's foreign minister Abbas Araqchi. It comes amid a continued American naval build-up near Iran, which Mr Trump has described as an \"armada\". He has repeatedly threatened to take military action since the Iranian regime launched a bloody crackdown against protesters who took to the streets of cities across the country last month. While his rhetoric has cooled somewhat from its bombastic peak, the White House has maintained that the president remains willing to forego diplomacy. His press secretary, Karoline Leavitt, told reporters on Thursday: \"While these negotiations are taking place, I would remind the Iranian regime that the president has many options at ​his disposal, aside from diplomacy as the commander in chief of the most powerful military in the history of the world.\" Iran has also threatened to hit back in the event of strikes, which saw the US withdraw some personnel from its large military base in Qatar. So what's the point of the talks? Iran has been in a long-running dispute with the West over its nuclear ambitions. The regime insists its programme is meant for peaceful, not military purposes, but the US and Israel have accused the regime repeatedly of seeking to develop nuclear weapons. A spokesperson for Iran's foreign ministry has said it would engage in the talks \"with responsibility, realism, and seriousness\", with a willingness to reach a \"mutually acceptable and dignified understanding on the nuclear issue\". US secretary of state Marco Rubio has suggested they should cover more ground - including the regime's arsenal of ballistic missiles, support for armed groups in the wider Middle East, and \"treatment of their own people\". Tehran has flatly ruled out talks on ‌its \"defence capabilities, including missiles and their range\". More from Sky News:Starmer 'fighting for his political life''How I escaped man who became serial killer' An analyst at US thinktank FDD, Edmund Fitton-Brown, said it was \"very difficult\" to envisage a breakthrough. Military conflict, therefore, \"is more likely than not\", he said."
    },
    {
        "title": "North Korea 'executes schoolchildren for watching Squid Game'",
        "description": "People in North Korea, including schoolchildren, are being executed for watching Squid Game and other foreign media, according to new testimony.",
        "url": "https://news.sky.com/story/north-korea-executes-schoolchildren-for-watching-squid-game-13504047",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-kim-jong-un-squid-games_7157347.jpg?20260206123724",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 12:14:00",
        "Headline": "Amnesty International has revealed the brutal punishments meted out to North Koreans who consume foreign media, after 25 interviews with escapees.",
        "Content": "People in North Korea, including schoolchildren, are being executed for watching Squid Game and other foreign media, according to new testimony. Citizens also face being killed for listening to K-pop, a South Korean music genre that includes bands like BTS. Interviewees have described a climate of fear in which the South's culture is treated as a serious crime. The less well-off are more likely to suffer the harshest punishments, while wealthier North Koreans are able to pay corrupt officials to dodge prosecution, it is claimed. The testimonies were revealed by Amnesty International after conducting 25 in-depth interviews with escapees who have fled the secretive state run by Kim Jong-un's regime. The escapees said watching globally popular South Korean dramas, such as Squid Game, Crash Landing on You, and Descendants of the Sun, can lead to the most extreme consequences, including death. 'Multiple executions' \n                  KPop Demon Hunters stars to perform at BAFTAs in first live show outside US\n                 \n                  K-pop stars BTS reveal comeback tour after completing military service\n                 \n                  Final BTS member discharged from military service, sparking reunion hopes\n                 One interviewee said they heard from an escapee with family links how people, including high school students, had been executed for watching Squid Game in Yanggang Province, which is close to the Chinese border. Another execution for distributing the South Korean show was previously documented by Radio Free Asia in neighbouring North Hamgyong Province in 2021. \"Taken together, these reports from different provinces suggest multiple executions related to the shows,\" Amnesty said in a statement. Interviewees also described the perils of listening to foreign music, particularly K-pop from South Korea, with the popular band BTS named in their testimony. In 2021, The Korea Times reported that a group of teenagers were caught and investigated for listening to the group in South Pyongan Province, which neighbours the capital, Pyongyang. 'Homes sold to avoid re-education camps' Choi Suvin, who fled North Korea in 2019, said people would sell their own homes to avoid punishment. \"People are caught for the same act, but punishment depends entirely on money,\" the 39-year-old said. \"People without money sell their houses to gather $5,000 or $10,000 to pay to get out of the re-education camps.\" This inequality was further evidenced by the case of Kim Joonsik, who was caught three times watching South Korean dramas, but avoided punishment because his family had connections. The 28-year-old, who left the country in 2019, said: \"Usually when high school students are caught, if their family has money, they just get warnings. \"I didn't receive legal punishment because we had connections.\" He contrasted his fate with that of three of his sister's school friends. In the late 2010s, the girls were condemned to years-long sentences in North Korea's labour camps because their families could not afford bribes. 'Executions to brainwash' People, including schoolchildren, were made to attend public executions as part of their \"ideological education\", the interviewees said. Ms Choi described seeing someone executed for allegedly distributing foreign media in 2017 or 2018, in Sinuiju, near the Chinese border. \"Authorities told everyone to go, and tens of thousands of people from Sinuiju city gathered to watch,\" she said. \"They execute people to brainwash and educate us.\" Kim Eunju, 40, said: \"When we were 16, 17, in middle school, they took us to executions and showed us everything. \"People were executed for watching or distributing South Korean media. It's ideological education: if you watch, this happens to you too.\" 'Ideological cage' Sarah Brooks, deputy regional director at Amnesty, said: \"These testimonies show how North Korea is enforcing dystopian laws that mean watching a South Korean TV show can cost you your life - unless you can afford to pay. \"The authorities criminalise access to information in violation of international law, then allow officials to profit off those fearing punishment. \"This is repression layered with corruption, and it most devastates those without wealth or connections.\" She added: \"This government's fear of information has effectively placed the entire population in an ideological cage, suffocating their access to the views and thoughts of other human beings. \"People who strive to learn more about the world outside North Korea, or seek simple entertainment from overseas, face the harshest of punishments. \"This completely arbitrary system, built on fear and corruption, violates fundamental principles of justice and internationally recognised human rights. It must be dismantled.\" Under North Korea's 2020 Anti-Reactionary Thought and Culture Act, South Korean content is \"branded rotten ideology that paralyses the people's revolutionary sense\". Those caught consuming such media face between five and 15 years of forced labour under the act, with heavier sentences - including death - for distributing it or organising group viewings. Fifteen interviewees described how a specialised police unit dubbed the \"109 Group\" would hunt for foreign media, conducting spot checks on people's homes, and street searches of mobile phones and bags, all without a warrant. One defector recalled members of the unit warning: \"We don't want to punish you harshly, but we need to bribe our bosses to save our own lives.\" Read more:K-pop stars BTS reveal comeback tourKim Jong-un dismisses deputy in rare public rebuke Security agents 'watch it secretly' Nonetheless, consumption of foreign media is widespread in North Korea, the escapees said. They described how dramas, films and music were smuggled in from China on USB drives, which are then plugged into notebook computers. One interviewee said: \"Workers watch it openly, party officials watch it proudly, security agents watch it secretly, and police watch it safely. \"Everyone knows everyone watches, including those who do the crackdowns.\" Most of those interviewed were aged between 15 and 25 years old when they escaped. The most recent departure had fled in June 2020, with 11 more having left between 2019 and 2020. Escapes have been rare since 2020, when COVID-19 border closures sealed the country off from the outside world."
    },
    {
        "title": "British man holidaying in Spain with wife and children falls to death from hotel balcony",
        "description": "A British man has died after falling from the sixth-floor balcony of a hotel in Spain.",
        "url": "https://news.sky.com/story/british-man-holidaying-in-spain-with-wife-and-children-falls-to-death-from-hotel-balcony-13504042",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-spain-police-police_5989000.jpg?20221207085001",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-02-06 11:55:00",
        "Headline": "The circumstances surrounding the death of the 37-year-old in the Costa del Sol town of Torremolinos in the early hours of Wednesday are being investigated.",
        "Content": "A British man has died after falling from the sixth-floor balcony of a hotel in Spain. The country's National Police are investigating the circumstances behind the death of the 37-year-old in the Costa del Sol town of Torremolinos in the early hours of Wednesday, according to local newspaper Diario Sur. Emergency services had received several calls alerting them to the fall of a man from a hotel balcony. Paramedics attended, but were unable to save the man's life. The man was staying at the hotel with his wife and two young children, both under the age of 10, the police investigation has found. Read more from Sky News:'Suffolk Strangler' survivor describes being chased by himWhen will the rain end? What the Met Office are saying According to Diario Sur, which cited the investigation, the couple had been drinking alcohol. The woman, it is reported, said she went to the bedroom to sleep, while her husband stayed alone on the balcony, at which point he fell. The newspaper said that she told police that she was sure the fall was an accident ."
    },
    {
        "title": "White House removes video shared by Trump showing Obamas as apes",
        "description": "Donald Trump has been accused of \"disgusting behaviour\" after a video was shared on his Truth Social account depicting Barack and Michelle Obama as apes.",
        "url": "https://news.sky.com/story/donald-trump-accused-of-disgusting-behaviour-after-sharing-image-of-obamas-as-apes-13504107",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-trump-obama_7157544.jpg?20260206152041",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-06 14:21:00",
        "Headline": "The White House initially defended the post before removing it hours later - blaming a member of staff for \"erroneously\" sharing the video.",
        "Content": "Donald Trump has been accused of \"disgusting behaviour\" after a video was shared on his Truth Social account depicting Barack and Michelle Obama as apes. The depiction appeared towards the end of the video, asserting debunked claims that the 2020 election - which he lost to Joe Biden - was stolen from him. Posted on Mr Trump's own social media network, the two-second clip shows the Obamas as apes bobbing up and down to the tune of \"The Lion Sleeps Tonight\". The post was later deleted - around 12 hours after being shared. A White House official said a member of staff \"erroneously made the post\" and it had now been taken down. The post sparked widespread outrage from across the political spectrum, while the White House's response was also criticised. Kamala Harris, Mr Trump's Democratic rival in the 2024 presidential election, said: \"No one believes this cover up from the White House, especially since they originally defended the post. \n                  New plaques in Trump's White House attack Joe Biden, Barack Obama and George W Bush\n                 \n                  Joseph James O'Connor ordered to pay back over £4m in Bitcoin after hacking celebrity X accounts\n                 \n                  What was it like to be 10ft from Trump assassination attempt?\n                 \"We are all clear-eyed about who Donald Trump is and what he believes.\" In a message on X, formerly Twitter, Gavin Newsom, the Democratic governor of California, accused the president of \"disgusting behaviour\" over the post. He added: \"Every single Republican must denounce this. Now.\" Responding to the video, Senate Democratic leader Chuck Schumer wrote on X: \"Racist. Vile. Abhorrent. This is dangerous and degrades our country-where are Senate Republicans?\" Mr Schumer urged the US president to apologise to the Obamas, calling the couple \"two great Americans who make Donald Trump look like a small, envious man\". Ben Rhodes, who served as deputy national security adviser in the Obama White House, reacted to the video by calling Trump \"a stain on our history\". \"Let it haunt Trump and his racist followers that future Americans will embrace the Obamas as beloved figures while studying him as a stain on our history,\" he wrote on X. George Conway - ex-husband of Kellyanne Conway, who managed the president's successful election campaign in 2016 - responded by highlighting an article he'd written describing Trump as a \"racist\" in 2019. The group Republicans Against Trump wrote: \"There's no bottom.\" White House initially criticised 'fake outrage' Before the post was removed, White House press secretary Karoline Leavitt defended it and said the depiction formed part of a longer video depicting various politicians as animals. She said: \"This is from an internet meme video depicting President Trump as the King of the Jungle and Democrats as characters from The Lion King. \"Please stop the fake outrage and report on something today that actually matters to the American public.\" Mr Trump has a long history of attacking Mr Obama, his predecessor as president, and was a vocal proponent of the \"birther\" conspiracy theory. The theory cast doubt on Mr Obama's birth in Hawaii, asserting that he was actually born in Kenya, and therefore ineligible to hold the office of president. Mr Obama produced his long-form birth certificate in 2011. In 2016 Mr Trump publicly accepted that his predecessor was born in the USA."
    },
    {
        "title": "We've combed through thousands of pages, photos and videos - here's what we've found in Epstein files",
        "description": "We've now combed through hundreds of thousands of files, photos and videos.",
        "url": "https://news.sky.com/story/what-weve-learned-from-the-latest-jeffrey-epstein-files-13504191",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-lord-peter-mandelson_7151106.png?20260131131904",
        "type": "US",
        "Author": "Tom Cheshire",
        "Date Published": "2026-02-06 17:44:00",
        "Headline": "Some of those named have said they didn't have the full picture of Epstein's crimes - and the files also show many others refused to have anything to do with him after his conviction.",
        "Content": "\n          Data and forensics correspondent\n              @chesh\n We've now combed through hundreds of thousands of files, photos and videos. They stretch back decades but their effect has been immediate. All week we have said that being mentioned in the files is not evidence of wrongdoing, and that remains a true and important point. But the release has permanently tarnished reputations and, at the very least, raised questions about supposedly clever people's judgement. It has cost Peter Mandelson his seat in the Lords, and who knows what will come of the police investigation now launched. And it has left many others with questions to answer. There is no evidence to suggest wrongdoing by the tech moguls Bill Gates and Elon Musk, for example. But the files show that both, like Mandelson, associated with Epstein after his conviction for child prostitution. Sarah Ferguson took her daughters to meet Epstein in Miami the week after his release for that very offence. Sarah Ferguson has previously said her involvement with Epstein was \"a gigantic error of judgment\". \n                  Norway's crown princess Mette-Marit apologises over Epstein links\n                 \n                  Can Starmer survive the Mandelson scandal? \n                 \n                  King's response to heckler will frustrate critics - but he doesn't want Andrew to be a distraction\n                 Andrew Mountbatten-Windsor's long and close relationship with Epstein does not need recounting. Some, like Mandelson, have argued that they didn't have the full picture of Epstein's crimes. But the files also show that many people refused to have anything to do with Epstein after his conviction. They didn't need to know every detail to understand, like Melinda Gates did in just one meeting, that Epstein was \"evil personified\". We do now have the full picture, or as full as we can hope for, and it is bleak. It is the experiences of the survivors - or victims, because not everyone survived, like Virginia Giuffre who died last year - that haunts the documents. Much of the files look dry and methodical, including one which details some witnesses interviewed by authorities, but on closer inspection you can see it is their high schools that are listed; all are 17, and between them they were abused hundreds of times. Read more from Sky News:Neighbourhood stunned by a crime mystifying AmericaWhy Bad Bunny's Super Bowl show is causing a stir Or the victim who took a pen to the title of her journal, \"Flights of fancy\", and altered it to read \"Flights and yachts of horror\". Or the testimony of Lisa Phillips, who spoke to Sky News this week: \"One of the young girls came to the door and said, you know, Jeffrey's ready for his massage and, I argue with the girls for a little bit because I don’t want to do a massage. \"I went with the other girl who brought me to the island. I went into the room to do this massage, and the massage turned into a sexual assault.\" The great and the good visited that same island, or they sought invitations. Unlike Lisa, they had a choice."
    },
    {
        "title": "Trump administration wants to deport five-year-old detained by ICE in Minnesota",
        "description": "The Trump administration is moving to deport a five-year-old boy who was detained by Immigration and Customs Enforcement (ICE) agents in Minnesota last month.",
        "url": "https://news.sky.com/story/trump-administration-wants-to-deport-five-year-old-detained-by-ice-in-minnesota-13504253",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-minnesota-liam-conejo-ramos_7152537.jpg?20260201174129",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-06 20:15:00",
        "Headline": "Liam Conejo Ramos and his father were taken into custody by immigration enforcement agents outside their home in Minneapolis on 20 January.",
        "Content": "The Trump administration is moving to deport a five-year-old boy who was detained by Immigration and Customs Enforcement (ICE) agents in Minnesota last month. Homeland Security, which oversees immigration enforcement, confirmed on Friday that it would seek to deport Liam Conejo Ramos, but denied a claim by a lawyer for the boy that it was seeking expedited removal. The move was \"extraordinary\" and possibly \"retaliatory\", his lawyer Danielle Molliver told New York Times. \"These are regular removal proceedings,\" Homeland Security spokesperson Tricia McLaughlin said. \"This is standard procedure and there is nothing retaliatory about enforcing the nation's immigration laws.\" The boy and his father, Adrian Alexander Conejo Arias, were taken into custody by ICE agents on the driveway of their family home on 20 January. The pair was then flown more than 1,000 miles from their home in Minneapolis to a facility in Texas. Nearly two weeks later, they were released following a judge's order and returned to Minnesota. The judge was critical of Mr Trump's immigration crackdown saying that \"the case has its genesis in the ill-conceived and incompetently-implemented government pursuit of daily deportation quotas, apparently even if it requires traumatising children\". The five-year-old, who was born in Ecuador, and Mr Conejo Arias came to the US legally as asylum applicants. Read more: My five-year-old son has nightmares after ICE detention The Trump administration defended the move to detain them, with Homeland Security accusing Mr Conejo Arias of being in the US illegally, without providing details. Mr Conejo Arias said his son \"hasn't been the same since all this happened\". Read more:What is ICE and what powers do its agents have?ICE agents ordered to leave Minnesota A photo of child, wearing a bunny hat and Spider-Man backpack as he was surrounded by ICE agents, went viral and caused outrage among protesters and the wider public. Their detention came between the high-profile killings of Minneapolis residents Renee Nicole Good and Alex Pretti, both 37 and US citizens."
    },
    {
        "title": "Iran and US to begin high-stakes talks amid fears of conflict",
        "description": "Iranian and American officials will kick off face-to-face talks in Oman today, following weeks of threatened military action by Donald Trump.",
        "url": "https://news.sky.com/story/iran-and-us-to-begin-high-stakes-talks-amid-fears-of-conflict-13503914",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-iran-us_7156991.jpg?20260206053604",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-06 05:14:00",
        "Headline": "The US and Iran have threatened one another with strikes over recent weeks - and expectations of a breakthrough during Friday's discussions are low.",
        "Content": "Iranian and American officials will kick off face-to-face talks in Oman today, following weeks of threatened military action by Donald Trump. The US is sending its Middle East envoy, Steve Witkoff, to the Muscat summit, where he will meet with Tehran's foreign minister Abbas Araqchi. It comes amid a continued American naval build-up near Iran, which Mr Trump has described as an \"armada\". He has repeatedly threatened to take military action since the Iranian regime launched a bloody crackdown against protesters who took to the streets of cities across the country last month. While his rhetoric has cooled somewhat from its bombastic peak, the White House has maintained that the president remains willing to forego diplomacy. His press secretary, Karoline Leavitt, told reporters on Thursday: \"While these negotiations are taking place, I would remind the Iranian regime that the president has many options at ​his disposal, aside from diplomacy as the commander in chief of the most powerful military in the history of the world.\" Iran has also threatened to hit back in the event of strikes, which saw the US withdraw some personnel from its large military base in Qatar. So what's the point of the talks? Iran has been in a long-running dispute with the West over its nuclear ambitions. The regime insists its programme is meant for peaceful, not military purposes, but the US and Israel have accused the regime repeatedly of seeking to develop nuclear weapons. A spokesperson for Iran's foreign ministry has said it would engage in the talks \"with responsibility, realism, and seriousness\", with a willingness to reach a \"mutually acceptable and dignified understanding on the nuclear issue\". US secretary of state Marco Rubio has suggested they should cover more ground - including the regime's arsenal of ballistic missiles, support for armed groups in the wider Middle East, and \"treatment of their own people\". Tehran has flatly ruled out talks on ‌its \"defence capabilities, including missiles and their range\". More from Sky News:Starmer 'fighting for his political life''How I escaped man who became serial killer' An analyst at US thinktank FDD, Edmund Fitton-Brown, said it was \"very difficult\" to envisage a breakthrough. Military conflict, therefore, \"is more likely than not\", he said."
    },
    {
        "title": "Nancy Guthrie: A neighbourhood left stunned by a crime that's mystifying America",
        "description": "The Catalina Foothills, a desert community just north of Tucson, Arizona, isn't the sort of place where these things happen. But it's now the focus of a crime that's mystifying America.",
        "url": "https://news.sky.com/story/nancy-guthrie-a-neighbourhood-left-stunned-by-a-crime-thats-mystifying-america-13503912",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-nancy-guthrie-us_7156987.jpg?20260206044926",
        "type": "US",
        "Author": "Martha Kelner",
        "Date Published": "2026-02-06 04:34:00",
        "Headline": "Nancy Guthrie, 84, the mother of US TV host Savannah Guthrie, was last seen at her home near Tucson, Arizona, on Saturday evening after being dropped off by family.",
        "Content": "\n          US correspondent\n              @marthakelner\n The Catalina Foothills, a desert community just north of Tucson, Arizona, isn't the sort of place where these things happen. But it's now the focus of a crime that's mystifying America. A long line of TV reporters from all over the world are positioned outside Nancy Guthrie's home, an expansive red brick bungalow set back from the road on a large plot, bordered by cacti and yucca shrubs. Private security stand guard on the driveway. It's from this house that detectives believe 84-year-old Nancy was snatched in the dead of night. She is the mother of Savannah Guthrie, one of the country's best known TV hosts, and the pair have often appeared on screen together. As the search for her enters a sixth day, police have no suspect and no person of interest. They did confirm blood found on the front porch of the house belonged to Nancy. They are also treating a ransom note sent to two news organisations seriously. The note made reference to an Apple Watch worn by Nancy and a floodlight outside the house. \"The ransom note that was distributed to the media did make a demand for 5pm today, and if a transfer wasn't made, then I think a second demand was for next Monday,\" Heith Janke, special agent in charge of the FBI's Phoenix division, said. Family renew emotional plea Camron Guthrie, Savannah's brother and Nancy's son, made a new appeal from the family, released on social media at the exact time of that 5pm deadline. \"Whoever is out there, holding our mother, we want to hear from you,\" he said, staring directly at the camera. \"We haven't heard anything directly. We need you to reach out, and we need a way to communicate with you so we can move forward, but first we have to know that you have our mum. \"We want to talk to you, and we are waiting for contact.\" Read more from Sky News:Starmer 'fighting for his political life'One Battle After Another 'devastatingly' timely Neighbours in shock - and increasing security People in the usually sedate neighbourhood where Nancy lives are stunned by this apparent kidnapping. An elderly couple walk past her house, the man holding a giant staff, to ward off feral pigs he tells me. That's the biggest danger here, usually, he says. But now local people are reviewing their own security. \"I do know that there's some people looking at their own security for their homes,\" said Laura Gargano, whose house backs on to Nancy's. \"If they have them, maybe they're enhancing them or if they don't, they're installing them. \"I had been to [Nancy's] house before about a year, a year-and-a-half ago, and she's a very sweet woman, very nice, she welcomed me right into her home.\" Cindy Matte, who lives a few streets away, believes Nancy was targeted because of her daughter's high profile. \"I definitely think that, yeah,\" she said. \"That's what I told my friends who are afraid for me to walk in this neighbourhood. I'm like 'my family doesn't have any money. They're not gonna come after me for any reason'.\" A sign on the pavement at the end of Nancy's driveway reads: \"Dear Guthrie Family, your neighbors stand with you.\" In a place where they speak with collective pride about Savannah Guthrie, the TV star who was raised here and became one of its most successful exports, someone may hold the clue to finding Nancy."
    },
    {
        "title": "FBI 'most wanted terrorist' arrested in Wales can be extradited, judge rules",
        "description": "One of the FBI's \"most wanted terrorists\", who remained a fugitive for more than 20 years, can be extradited to the US to face trial after he was arrested in Wales, a judge has ruled.",
        "url": "https://news.sky.com/story/fbi-most-wanted-terrorist-arrested-in-wales-can-be-extradited-judge-rules-13493689",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-daniel-andreas-san-diego_7104473.jpg?20251208091722",
        "type": "US",
        "Author": "Henry Vaughan",
        "Date Published": "2026-02-06 11:25:00",
        "Headline": "Daniel Andreas San Diego, 47, had been a fugitive for more than 20 years when he was found at a rural property living under a new identity.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n One of the FBI's \"most wanted terrorists\", who remained a fugitive for more than 20 years, can be extradited to the US to face trial after he was arrested in Wales, a judge has ruled. Daniel Andreas San Diego, 47, allegedly carried out two bombings in the San Francisco area in 2003, which were claimed by an animal rights group. He was arrested in November 2024 at a property in a rural area next to woodland in Conwy in North Wales, where he had been living under the false identity Danny Webb. A distinctive tattoo on his chest with the words \"it only takes a spark\" helped identify him as the fugitive. He was the first alleged domestic terrorist added to the FBI's most wanted list in 2009, alongside the likes of late al Qaeda leader Osama bin Laden. Judge ​Samuel Goozee's ruling at Westminster Magistrates' Court in London on Friday stated that there is no bar to San Diego's extradition - and that the home secretary will make a final decision, which is expected to be a formality. San Diego has the right to appeal the decision at the High Court. He fought extradition to the US, where his barrister Mark Summers KC said he could face a \"90-year sentence\" if convicted, at a series of hearings at Westminster Magistrates' Court last year. His lawyers argued he could not get a fair trial in Donald Trump's America, where the president had \"engaged in a 'purge'\" of the US Department of Justice (DoJ) and \"installed his former personal lawyers to positions of power\". They said the high-profile and \"notorious case\" was \"precisely the type of trial in which the current US presidential administration has shown themselves capable of, and intent on, direct interference\". San Diego was first indicted in California in 2004, charged with two offences of causing damage by explosives, and possession of explosives. More counts were added to a later indictment, including charges of \"using or carrying an explosive device to commit a felony\". On 28 August 2003, two bombs exploded about an hour apart on the campus of the Chiron biotechnology corporation in Emeryville, California. Then, on 26 September 2003, one bomb strapped with nails exploded at the Shaklee nutritional products corporation in Pleasanton, California. The bombings didn't cause any injuries, but authorities said the biotechnology blast was meant to harm first responders. A group called Revolutionary Cells-Animal Liberation Brigade claimed responsibility for the attacks, citing the firms' ties to Huntingdon Life Sciences - a company targeted by animal rights activists over its work with experimental drugs on animals. San Diego disappeared into a transit station on 6 October 2003, when the FBI had him under surveillance as he parked his car near downtown San Francisco. The agency didn't see him again but said there had been several sightings reported around the world. A $250,000 (£199,000) reward was offered for information leading directly to the arrest of San Diego, who was born in Berkeley, California. The FBI claimed he had ties to an animal rights extremist group, was known to follow a vegan diet, known to possess a handgun, and worked as a computer network specialist."
    },
    {
        "title": "Two killed in US strike on 'narco-terrorists' as forces attack alleged drug boat",
        "description": "US forces say they have struck what they called \"narco-terrorists\" on an alleged drug boat in the eastern Pacific on Thursday, killing two people.",
        "url": "https://news.sky.com/story/two-killed-in-us-strike-on-narco-terrorists-as-forces-attack-alleged-drug-boat-13503995",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-us-southern-command_7157245.png?20260206104019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-02-06 10:04:00",
        "Headline": "The US military has conducted at least 36 attacks on boats allegedly transporting drugs since September in the Caribbean Sea and eastern Pacific Ocean.",
        "Content": "US forces say they have struck what they called \"narco-terrorists\" on an alleged drug boat in the eastern Pacific on Thursday, killing two people. \"Intelligence confirmed the vessel was transiting along known narco-trafficking routes in the eastern Pacific and was engaged in narco-trafficking operations,\" US Southern Command announced on social media. \"Two narco-terrorists were killed during this action. No US military forces were harmed,\" added the statement on X. Southern Command did not specify where the boat was coming from or where it was heading. A video linked to the post shows a boat moving through the water before exploding in flames. The US military has conducted at least 36 attacks on boats allegedly transporting drugs since September in the Caribbean Sea and eastern Pacific Ocean. The Trump administration has argued the operations serve the national security purpose of stopping the flow of drugs into the US. \n                  White House removes video shared by Trump showing Obamas as apes\n                 \n                  Trump U-turns (again) as America searches for Nancy Guthrie\n                 \n                  Trump grudgingly supports Starmer's Chagos deal\n                 The US military has put the total number killed at 128, including those presumed dead after being lost at sea. The latest strike is only the second since the US captured Nicolas Maduro, then the president of Venezuela, in a military operation on 3 January and brought him to New York for trial. Read more from Sky News:Iran and US begin high-stakes talksSon has nightmares after ICE arrestUK agents help seize 'narco sub' Maduro has pleaded not guilty to charges which include narco-terrorism conspiracy and cocaine importation conspiracy. The latest strike is also the first since Donald Trump's meeting this week with Colombian President Gustavo Petro, who has repeatedly criticised the boat attacks, comparing them to war crimes. Colombian citizens have been injured or killed in the previous strikes. Mr Trump told reporters on Tuesday that he and President Petro - whom he had previously called a \"drug leader\" - discussed counternarcotics efforts. Last October, US Treasury Secretary Scott Bessent said: \"Since President Gustavo Petro came to power, cocaine production in Colombia has exploded to the highest rate in decades, flooding the United States and poisoning Americans.\" \"President Petro has allowed drug cartels to flourish,\" Mr Bessent added. Mr Petro disputes the basis for the US allegations, saying his government has seized cocaine at unprecedented rates and that expansion of coca crops - the base ingredient for cocaine - has slowed every year since 2021."
    },
    {
        "title": "Supermarket giant Morrisons explores £1bn property deal",
        "description": "Morrisons, the UK's fifth-largest supermarket chain, is exploring a &#163;1bn property deal amid its battle to recapture the ground it has lost to rivals including Sainsbury's and Aldi.",
        "url": "https://news.sky.com/story/supermarket-giant-morrisons-explores-1631bn-property-deal-13504032",
        "image_url": "https://e3.365dm.com/22/06/1920x1080/skynews-morrisons-supermarket_5806327.jpg?20220616100955",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-02-06 11:16:00",
        "Headline": "The UK's fifth-biggest grocery chain has hired real estate advisors from CBRE to assess options for releasing up to £1bn of value from its large freehold store portfolio, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Morrisons, the UK's fifth-largest supermarket chain, is exploring a £1bn property deal amid its battle to recapture the ground it has lost to rivals including Sainsbury's and Aldi. Sky News has learnt that Morrisons, which is based in Bradford, West Yorkshire, has engaged the real estate advisory firm CBRE to evaluate options for raising finance secured against part of its large freehold store portfolio. Sources said the process was at an early stage, but that it was unlikely to involve a conventional sale-and-leaseback transaction of the kind favoured by major grocers in recent decades. One option expected to be considered is a medium- or long-term borrowing deal secured against a number of Morrisons' supermarkets. Read the latest from the Money blog Any agreement could raise as much as £1bn, although neither the structure nor size have yet been determined. Morrisons, which trades from approximately 500 supermarkets in the UK and employs about 95,000 people, was taken private from the stock market by Clayton Dubilier & Rice, the US-based buyout firm, in 2021 in a deal worth close to £10bn including debt. \n                  List of closures as hundreds at risk of redundancy due to Morrisons shutting cafes, meat counters and convenience stores\n                 \n                  Morrisons takes legal action to stop farmers' protests\n                 \n                  Supermarket giants face £200m hit from Reeves' NI hike\n                 Its performance since then has been patchy, with Aldi overtaking it last year to become the UK's fourth-biggest grocer by sales. In 2023, the company named Rami Baitieh, a former Carrefour executive, as its new chief executive in an attempt to arrest its decline. For more information about how we use your data and your rights, you can visit our Privacy Centre. Morrisons owns the freeholds to roughly 80% of its store estate, among the highest levels in the sector. One source said that releasing £1bn of value through a sale-and-leaseback or leverage-based transaction would still leave the proportion at wholly owned stores at about 60%. The company has been steadily paying down the debt it took on as part of CD&R's takeover, with only about £1bn of acquisition finance left to be repaid. Read more from Sky News:Supermarket fuel profit margins soarLidl wins battle to open in-store pubAsda to sell stores only to rent them back Morrisons has no short-term debt maturities, the source said, meaning it was under no pressure to strike a property deal. During a hotly contested battle to buy the supermarket chain, CD&R pledged not to engage in significant disposals of store freeholds for a limited period. Since then, its main real estate activities have involved the sale of non-store assets. In 2024, it struck a partnership with Song Capital, an investment firm, which paid £370m for the right to receive an income stream from 75 of the chain's supermarkets for 45 years. Along with Asda, Morrisons is one of the two major UK grocers now owned by private equity firms. Asda is owned by TDR Capital, while former owner Walmart retains a residual financial interest. Last month, Morrisons published results which it said showed \"strong\" Christmas trading. \"2024/25 was another year of renewal and modernisation for Morrisons. In a year when consumers were feeling the squeeze, we grew like-for-like sales for a twelfth consecutive quarter, maintained EBITDA and our market share, and demonstrated our resilience in the face of some tough external headwinds,\" Rami Baitieh, chief executive, said. Morrisons declined to comment on a prospective real estate deal."
    },
    {
        "title": "Police search Peter Mandelson's properties in Camden and Wiltshire",
        "description": "Two of Peter Mandelson's properties have been searched by police investigating claims of misconduct in a public office.",
        "url": "https://news.sky.com/story/police-search-peter-mandelsons-properties-in-camden-and-wiltshire-13504109",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-peter-mandelson-police-search_7157799.jpg?20260206200541",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-02-06 14:29:00",
        "Headline": "Officers say the warrants related to an \"investigation into misconduct in public office offences, involving a 72-year-old man\".",
        "Content": "Two of Peter Mandelson's properties have been searched by police investigating claims of misconduct in a public office. Boxes were seen being carried from his property in Camden, north London, on Friday evening, while police cars were parked in the driveway of Mandelson's Wiltshire house. Plain-clothed officers also used torches to briefly search a Range Rover outside the London address. Live updates on Mandelson investigation Metropolitan Police deputy assistant commissioner Hayley Sewart said the \"central specialist crime team\" were carrying out the warrants. \"The searches are related to an ongoing investigation into misconduct in public office offences, involving a 72-year-old man,\" said a statement. \"He has not been arrested and enquiries are ongoing.\" The search is part of an investigation into Lord Mandelson following the latest release of files about Jeffrey Epstein, which have revealed more details about the pair's relationship. They appear to show Mandelson passed on market-sensitive information to Epstein when he was business secretary after the 2008 financial crisis. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the financier's victims. 'Significant volume of material' to be reviewed Sir Keir Starmer remains under pressure to release documents related to the peer's vetting to become UK ambassador to the US - a job he was sacked from in September. The prime minister has said Mandelson lied about the depth of his friendship with Epstein ahead of getting the prestigious job. In a letter to the chair of parliament's Intelligence and Security Committee (ISC), Sir Keir said he wanted the documents released as soon as possible. However, he said \"a very significant volume of material\" on Mandelson's appointment as ambassador needed to be reviewed first. In Friday's letter, Sir Keir said he had told the cabinet secretary to work with the ISC on \"how material that may be prejudicial to the UK's national security and international relations is shared and reviewed\". Documents coming 'shortly' Speaking to journalists earlier, Downing Street said the government would publish the documents \"shortly\". Sky News understands the government is working with police to ensure any document released does not undermine the police investigation into Mandelson. Officials are believed to be in the early stages of assessing the documents, of which there are thousands. The scandal surrounding Lord Mandelson has left Sir Keir under severe pressure, with some in Labour wanting him to resign. Labour MPs are urging Sir Keir to reveal whether he saw a report by an influential party peer that warned of Lord Mandelson's links to Epstein. Labour grandee Lord Glasman told Sky News last September that he had flagged to Number 10 about the pair's relationship but was met with a \"discreet suggestion to basically shut up\". Read more:What we've found in Epstein filesSurvivors condemn US government's handling of files In an interview with Sky News' Sophy Ridge, Lord Glasman suggested he was asked to report to Number 10 about the pair's relationship and he did - but suggested no action was taken. \"They asked me to send a report and I sent a report,\" he said. \"I did say when I got back, I would think again about this publicly. \"Then I did get a discreet suggestion to basically shut up about that, and I did.\" McSweeney under pressure Even more focus has been placed on the prime minister's chief of staff, Morgan McSweeney, who was a close political ally of Lord Mandelson. Labour backbencher MP Simon Opher called for a \"clear out at Number 10\". \"If my chief of staff had done this, I think he would be looking for another job,\" Mr Opher told the BBC. Veteran Labour MP Clive Efford and Southport MP Patrick Hurley have also said Mr McSweeney should leave Number 10. PM's future Former cabinet minister and Labour grandee Harriet Harman told the Electoral Dysfunction podcast previously that the prime minister needed a \"real reset\". Sir Keir could lose his premiership if he does not do the right thing, Ms Harman added. However, so far no big names on the current frontline of Labour politics have turned their fire on the prime minister and his staff. Sir Keir on Thursday apologised for believing Lord Mandelson's \"lies\" about his closeness to paedophile financier Epstein. The prime minister made Lord Mandelson the UK's ambassador to the US in 2024. 👉Tap here to listen to Electoral Dysfunction on your podcast app 👈 Following a partial release of the Epstein files last year, Sir Keir sacked him after it emerged how close the pair were. Another tranche of millions of documents released by the US government recently saw Mandelson quit Labour and resign from the House of Lords."
    },
    {
        "title": "Labour MPs urge Starmer to reveal if he saw peer's warnings about Mandelson's Epstein links",
        "description": "Labour MPs are urging Sir Keir Starmer to reveal whether he saw a report by an influential party peer that warned of Peter Mandelson's links to Jeffrey Epstein.",
        "url": "https://news.sky.com/story/labour-mps-urge-starmer-to-reveal-if-he-saw-peers-warnings-about-mandelsons-epstein-links-13504035",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-keir-starmer-speech_7156342.jpg?20260205121444",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2026-02-06 11:36:00",
        "Headline": "Lord Glasman told Sky News he flagged his concerns to Downing Street but received a \"discreet suggestion to basically shut up\".",
        "Content": "\n          Political correspondent\n              @alexrogerssky\n Labour MPs are urging Sir Keir Starmer to reveal whether he saw a report by an influential party peer that warned of Peter Mandelson's links to Jeffrey Epstein. Labour grandee Lord Glassman told Sky News last September that he had flagged to Number 10 about the pair's relationship but was met with a \"discreet suggestion to basically shut up\". Politics latest: Police search Mandelson address In an interview with Sky News' Sophy Ridge, Lord Glasman suggested he was asked to report to Number 10 about the pair's relationship and he did - but suggested no action was taken. \"They asked me to send a report and I sent a report,\" he said. \"I did say when I got back, I would think again about this publicly. \"Then I did get a discreet suggestion to basically shut up about that, and I did.\" \n                  Police search Peter Mandelson's properties in Camden and Wiltshire\n                 \n                  Can Starmer survive the Mandelson scandal? \n                 \n                  Trump grudgingly supports Starmer's Chagos deal\n                 Sky News has approached Downing Street for comment on whether the report was passed to the prime minister but has not received a response. 'Starmer must reveal if he saw Glasman's report' Clive Lewis, the Labour MP for Norwich South, told Sky News that the report \"must be released\". \"Either Maurice [Lord Glassman] needs to show the email trail and the document that he passed on to Number 10. And Number 10 needs to show what they knew. \"The longer this takes to draw out, the more damage to the Labour Party - this needs a clean, all cards on the table approach. \"They can't have it dragged out kicking and screaming - this will destroy us. We need full disclosure. \"Keir Starmer must reveal if he saw Glasman's report or if it was kept from him.\" A minister added: \"We need to know if the PM saw it or if it was deliberately withheld from him. \"The report should be definitely be released. It just highlights how badly Keir was failed by those closest to him.\" It comes as the prime minister continues to face intense pressure over his decision to appoint Lord Mandelson as US ambassador despite admitting that the official security vetting he received mentioned his ongoing relationship with Epstein even following his conviction for soliciting a minor in 2008. On Thursday, Sir Keir attempted to save his premiership by offering an apology to Epstein's victims for believing what he called \"Mandelson's lies\". Addressing Epstein's victims from an event in Hastings, the prime minister said: \"I want to say this: I am sorry. \"Sorry for what was done to you. Sorry that so many people with power failed you. \"Sorry for having believed Mandelson's lies and appointed him, and sorry that even now you're forced to watch this story unfold in public once again.\" Lord Mandelson, a senior adviser to Sir Tony Blair and a cabinet minister during the New Labour years, was sacked in September after he featured in a number of Epstein-related files and photos released by a US Congressional committee. He then resigned from the Labour party and the House of Lords after further damaging revelations were uncovered among a tranche of three million documents released by the US Department of Justice last week. Emails showed that Lord Mandelson had a close business relationship with Epstein as well as personal one. Among the most damaging accusations are that he forwarded market-sensitive information to Epstein - including an alleged forewarning about a €500bn EU bank bailout in 2010. Lord Mandelson has denied any wrongdoing in relation to Epstein. He has said he regrets maintaining a relationship with him and apologised to the financier's victims. During a dramatic day in the Commons on Wednesday, the government agreed to publish documents relating to Lord Mandelson's appointment after the Conservatives tabled a humble address to force their disclosure. Initially the government wanted to release the documents on the condition they did not compromise national security or international relations - but that stance was later watered down following interventions from Angela Rayner, the former deputy prime minister, who demanded that the files deemed to be a risk first be reviewed by parliament's Intelligence and Security Committee. Read more:Top Labour figure warns Mandelson scandal could bring PM downWhat do the Epstein files say about Lord Peter Mandelson? It means that instead of the cabinet secretary deciding what does or does not compromise national security or international relations, that power will lie with the MPs on the committee. The publication of documents may be further delayed by a criminal investigation into Lord Mandelson, whose two properties in Wilshire and Camden were searched on Friday afternoon. Despite the prime minister's public apology to Epstein's victims, Labour MPs were still calling on Mr McSweeney to go. \"Universally we can see PM is a good man and I genuinely believe he means his apology,\" said one minister. \"The problem we have is the people around him - he is clearly reliant on people who give him bad advice. It is a universal feeling in the majority of the PLP [parliamentary Labour Party] that Morgan needs to go.\" Another Labour MP added: \"Keir needs to get rid of Morgan - and he could actually have an OK relationship with the PLP if he did.\" Some reserved their anger for the prime minister, with one backbencher telling Sky News: \"100% Keir needs to go. He wants to hang on to May so he can say things haven't worked out. He wants to blame the local elections. Frankly his name is dirt here.\""
    },
    {
        "title": "Two arrested for illegally dumping waste at six sites across England",
        "description": "Two people have been arrested in Essex for allegedly illegally dumping waste at six different illegal spots across England, the Environment Agency has said.",
        "url": "https://news.sky.com/story/two-arrested-for-illegally-dumping-waste-at-six-sites-across-england-13504147",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-merseyside-anonymous_7100764.jpg?20251204215736",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2026-02-06 15:46:00",
        "Headline": "The Environment Agency said two people had been arrested in a string of recent actions, but it has long been criticised for being too slow or failing to act on illegal waste sites, as it grapples with budget cuts.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n Two people have been arrested in Essex for allegedly illegally dumping waste at six different illegal spots across England, the Environment Agency has said. The pair are suspected of trashing spots across Warwickshire, Derbyshire and Buckinghamshire, as the country grapples with a proliferating black market in illegal waste, dubbed the \"new narcotics\". Earlier this week, the 54-year-old male and 50-year-old woman, both from Essex, were arrested in a joint raid by the Environment Agency (EA) and the Eastern Regional Special Operations Unit. The suspects were interviewed and then released as the agencies still needed to gather further information. The EA said the action was part of a \"large-scale, active investigation\" into waste crime, fraud and money laundering. On Tuesday, a fourth person was arrested over a massive waste site in Kidlington, Oxfordshire, leaching pollution into the countryside and waterways. The EA's enforcement and investigations manager Emma Viner said: \"Waste crime is completely unacceptable, and we are clear that those responsible will be pursued.\" \n                  Police make fourth arrest in connection with massive Kidlington rubbish dump\n                 \n                  Kidlington fly-tipping: Two men arrested over rubbish dumped in Oxfordshire field\n                 \n                  What it's like to live next to a 25,000-tonne illegal waste dump - with rats everywhere\n                 But the agency has also faced criticism for being too slow to act on reports of waste crime. The problem sees criminals paid to take away waste and then dodging landfill tax by disposing of it illegally. It is plaguing communities forced to live next to filthy, stinking tips, and landowners and farmers left to foot the bill for rubbish dumped on their land. Last year, the EA told a Lords inquiry that its waste crime unit (JUWC) had made 186 arrests during its five-year time, though did not know how many prosecutions that had led to. Earl John Russell, a Lib Dem peer who sat on the Lords inquiry, welcomed \"the fact that action is finally being taken\" but said \"the EA is not doing enough\". \"Broken systems are creating broken results, and the criminals are running amok,\" he told Sky News. The EA has been \"ill-equipped to address these highly complex and highly lucrative and low-risk serious crime issues\", he added. Lord Russell called on the government to review and publish a report on the scale of serious organised waste crime, and said responsibility for tackling it should be escalated from the Environment Agency to the National Crime Agency. Environment secretary Emma Reynolds said: \"With five waste crime arrests in just seven days, we've shown that those responsible for these appalling crimes will be tracked down and held to account.\" This year, the government increased the EA's budget for waste crime enforcement by 50 per cent to £15.6m. Ms Reynolds said they are also hiring more officers, introducing tougher checks and exploring digital waste tracking."
    },
    {
        "title": "Julia Donaldson reveals new character for third Gruffalo",
        "description": "The next Gruffalo book will introduce a new member to the monster's family, best selling children's author Julia Donaldson has revealed.",
        "url": "https://news.sky.com/story/details-of-eagerly-awaited-new-gruffalo-book-revealed-13504213",
        "image_url": "https://e3.365dm.com/26/02/1920x1080/skynews-gruffalo-gruffalo-granny_7157723.png?20260206190404",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-02-06 18:51:00",
        "Headline": "The Gruffalo family will expand in the long anticipated third book about Julia Donaldson's much loved monster - titled Gruffalo Granny.",
        "Content": "The next Gruffalo book will introduce a new member to the monster's family, best selling children's author Julia Donaldson has revealed. Gruffalo Granny will be published on 10 September 2026. This third instalment comes more than 20 years after Donaldson's last foray into the deep dark wood, the 2004 The Gruffalo's Child, which was a sequel to the 1999 best-selling original. The news that she would be revisiting the character with knobbly knees, turned out toes and a poisonous wart on the end of his nose was first announced in April 2025. Now some details about the book have been released. It will feature a visit from new character the Gruffalo Granny, with an excerpt reading: \"The Gruffalo said to his daughter one day, your Gruffalo Granny is coming to stay.\" The story, which will again feature illustrations by Donaldson's frequent collaborator Axel Scheffler, will also see the return of the characters from the previous two books, including Fox, Snake, Owl and Mouse. Donaldson said: \"It's always a challenge to write a sequel. \"Five years elapsed between publication of The Gruffalo and The Gruffalo's Child, and now it will be more than 20 between The Gruffalo's Child and the third book. \"I actually had the basic idea for the story a long time ago but couldn't think how to develop it. \"It was only when the National Literacy Trust, whose work I'm very impressed by, used the first two books as part of their Early Words Matter programme that I was spurred on to get my idea out of the cupboard and see once and for all if I could turn it into a really satisfying story. \"To my surprise, I managed to do just that! I was of course delighted when Axel came on board and am even more so now that I've seen the brilliant illustrations he's done for the new book. \"I really hope that children - and adults too - will enjoy the new story, as I know what a wonderful experience shared reading can be.\" The Gruffalo and The Gruffalo's Child have sold more than 18 million copies combined and the books have been translated into 115 languages and dialects. Fans got the chance to see the illustration of Gruffalo Granny when Scheffler's illustration was projected in central London and Glasgow on Friday evening."
    }
]