[
    {
        "title": "Starmer to unveil plan for digital ID cards to crack down on illegal immigration ",
        "description": "Every adult in Britain will require a digital ID under plans to tackle illegal immigration. ",
        "url": "https://news.sky.com/story/starmer-to-unveil-plan-for-digital-id-cards-to-crack-down-on-illegal-immigration-13438007",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-northern-ireland_7025482.jpg?20250919183418",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-09-25 13:57:00",
        "Headline": "The so-called \"Brit card\" would verify a citizen's right to live and work in the UK.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Every adult in Britain will require a digital ID under plans to tackle illegal immigration.  Writing for The Daily Telegraph, Sir Keir Starmer said the government would make a \"new, free-of-charge digital ID that would be mandatory for the right to work by the end of this parliament\". Sky News earlier reported that the prime minister was due to announce his backing for the scheme in a speech on Friday. The idea behind the so-called \"Brit card\" is that it would verify a citizen's right to live and work in the UK. The plans would require anyone starting a new job or renting a home to show the card on a smartphone app, which would then be checked against a central database of those entitled to work and live here. It is hoped this would reduce the attraction of working in the UK illegally, including for delivery companies. At the moment, workers have to show at least one form of physical ID in the form of documents, but there are concerns within government that these can be faked. \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 French President Emmanuel Macron has repeatedly warned that the lack of ID cards in the UK acts as a major pull factor for Channel crossings, as migrants feel they are able to find work in the black economy. Politics Live: Andy Burnham says Labour MPs want him to oust Starmer Sir Keir is expected to flesh out more details in a speech at the Global Progress Action Summit in London on Friday, when he will argue that relying on migration to plug workforce gaps \"is not compassionate left-wing politics\". The plan represents a shift in the government's position, as last year ministers ruled out the idea following an intervention from Sir Tony Blair just days after Labour won the general election. The former Labour prime minister has long been an advocate of ID cards and took steps to introduce a system that would begin as voluntary and could later become compulsory while in office. The rollout was scrapped after Labour was ejected from power in 2010, having been opposed by the Liberal Democrats and the Tories at the time. Last July, then Home Secretary Yvette Cooper said of the idea: \"It's not in our manifesto. That's not our approach.\" The UK has only previously had mandatory ID cards during wartime, with the last tranche scrapped in 1952. The idea has long been opposed by civil liberty and privacy groups in the UK. Sir Keir is said to have shared their concerns but came round to the idea amid record high levels of small boat crossings. A report by the Tony Blair Institute published on Wednesday said digital ID can \"help close loopholes that trafficking gangs and unscrupulous employers currently exploit, reducing pull factors driving illegal migration to Britain and restoring control over borders\". Labour Together, a Starmer-backed thinktank, published a report in June which said digital ID could play a role in right-to-work and right-to-rent checks, supporting \"better enforcement of migration rules\". How would digital ID work? There is no unique regime for identity cards, but decisions the government would have to make include who is required to register, how much information they should hold, and whether physical forms of the ID should also be made available. Pat McFadden, now the work and pensions secretary, started a cross-government unit to look at how it could work while he was in charge of the cabinet office. He visited Estonia last month, before the cabinet reshuffle, where he said the Baltic country's model could be used as an example. In Estonia, citizens are given a unique number at birth which they use to register marriages, access bank accounts, vote, book GP appointments, file their tax return and even collect supermarket loyalty points, among hundreds of other services. Mr McFadden told The Times digital ID could be applied \"to the immigration system, to the benefit system, to a number of areas\". 'Checkpoint society' The government's plan will be subject to a consultation and would require legislation to be passed, before being rolled out. Labour MPs on the left of the party have already hit out at the idea. Nadia Whittome labelled the policy \"divisive, authoritarian nonsense\", adding: \"If we're going to reheat Blair-era policies, can we please focus on lifting children out of poverty?\" Reform UK and the Tories are also against the proposal, arguing it will not stop small boat crossings. The Lib Dems meanwhile said they were against the principle of people being \"forced to turn over their private data just to go about their daily lives\". The civil liberty group Big Brother Watch said: \"Plans for a mandatory digital ID would make us all reliant on a digital pass to go about our daily lives, turning us into a checkpoint society that is wholly unBritish.\""
    },
    {
        "title": "'There are costs to standing up to Trump,' says ex-FBI chief James Comey after being charged with lying to Congress",
        "description": "Ex-FBI director James Comey has been charged with obstruction of justice and making a false statement to Congress.",
        "url": "https://news.sky.com/story/ex-fbi-director-james-comey-charged-with-making-false-statement-and-obstruction-13438312",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-james-comey-donald-trump_6917946.jpg?20250516082020",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 22:54:00",
        "Headline": "The charges come days after the US president appeared to chide his attorney general, Pam Bondi, for not bringing criminal charges against Comey and other perceived political enemies quickly enough.",
        "Content": "Ex-FBI director James Comey has been charged with obstruction of justice and making a false statement to Congress. Comey was fired months into Donald Trump's first presidency, in the middle of an investigation into Russian interference in the 2016 election. Fellow former FBI chief Robert Mueller took over the investigation, which found numerous contacts between Mr Trump's 2016 campaign and Russian officials, but concluded that there was not enough evidence to establish a criminal conspiracy. Mr Trump and his supporters labelled the investigation a \"hoax\" and a \"witch hunt\" used to undermine Mr Trump's first administration - despite several government reviews showing that Moscow interfered on behalf of the Republican's campaign. The two charges come days after the US president appeared to chide his attorney general, Pam Bondi, for not bringing criminal charges against Comey and other perceived political enemies quickly enough. \"We can't delay any longer, it's killing our reputation and credibility,\" Mr Trump wrote, referencing the fact that he himself had been indicted and impeached multiple times. \"JUSTICE MUST BE SERVED, NOW!!!\" When she announced the charges, Ms Bondi said: \"No one is above the law. Today's indictment reflects this Department of Justice's commitment to holding those who abuse positions of power accountable for misleading the American people.\" \n                  James Comey: Trump says ex-FBI director's seashells post 'meant assassination'\n                 \n                  Donald Trump like a 'mob boss' but he shouldn't be prosecuted, says ex-FBI boss Comey\n                 \n                  Biden inauguration: Former FBI boss James Comey warns of serious threat from 'armed, disturbed people'\n                 Mr Trump celebrated the charges as \"JUSTICE IN AMERICA\" in a Truth Social post, adding that Comey \"was indicted by a Grand Jury on two felony counts for various illegal and unlawful acts\". Comey asserted his innocence, saying in a statement: \"My family and I have known for years that there are costs to standing up to Donald Trump, but we couldn't imagine ourselves living any other way. We will not live on our knees, and you shouldn't either. Somebody that I love dearly recently said that fear is the tool of a tyrant and she's right. But I'm not afraid and I hope you're not either.\" He added: \"My heart is broken for the Department of Justice, but I have great confidence in the federal judicial system, and I am innocent, so let's have a trial and keep the faith.\" His son-in-law, Troy Edwards, reacted to the charges by resigning as a federal prosecutor. He said he quit his job \"to uphold my oath to the Constitution and the country\". After he was fired, Comey became a prominent critic of the president, calling him \"morally unfit\" for office. The criminal case against Comey, who served as FBI director from 2013 to 2017, does not concern the substance of the Russia investigation. Instead, it accuses him of having lied to Congress in 2020 when he said he never authorised anyone to serve as an anonymous source to a reporter about the investigation. An internal watchdog for the US Justice Department found evidence of numerous errors but no political bias concerning the FBI's opening of the investigation into Russian election interference. In a 2019 report, the watchdog faulted Comey for asking a friend to give memos detailing Comey's one-on-one interactions with Mr Trump to the New York Times. During Mr Trump's first term, the Justice Department declined to pursue criminal charges against Comey. Read more from Sky News:Trump signs TikTok order to pave way for US ownershipFBI shares details of note 'by Dallas shooting suspect' The case against Comey is the starkest example of the Trump administration using law enforcement to target a critic, following the president's promise of retribution against the former FBI chief during his 2024 election campaign. If Comey is convicted of making a false statement and obstruction, he faces up to five years in prison. The former FBI director is expected to surrender Friday morning, according to CNN."
    },
    {
        "title": "UAE is 'main backer behind RSF militia in Sudan', intelligence officer claims in secret interview",
        "description": "The tribal militia turned paramilitary Rapid Support Forces (RSF) in Sudan are known to document their own war crimes.",
        "url": "https://news.sky.com/story/uae-is-main-backer-behind-rsf-militia-in-sudan-intelligence-officer-claims-in-secret-interview-13437966",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-idris-ali-yousra-elbagir_7031549.png?20250925165011",
        "type": "Home",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-09-25 23:01:00",
        "Headline": "In an exclusive interview in an undisclosed location, Sky News learns many of the planes landing in South Darfur are allegedly bringing weapons from the Middle Eastern country - something its government vehemently denies.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n The tribal militia turned paramilitary Rapid Support Forces (RSF) in Sudan are known to document their own war crimes. Videos of their fighters lynching women, lashing emergency responders and cheering over dead bodies have circulated online since the start of the RSF's war with Sudan's army in April 2023. One piece of evidence never revealed in any of their violent videos is who is backing them and why? In an exclusive interview with Sky News at a location we cannot disclose, an RSF intelligence officer confirms widespread allegations that the United Arab Emirates (UAE) is the RSF's main backer in a war that has created the world’s largest humanitarian crisis and forced 13 million people to flee their homes. \"In the beginning, it was the Russians - Wagner and the state. Now, they tell me it is the UAE supporting the RSF,\" says Ahmed*, using an alias to protect his identity. Originally from North Darfur, Ahmed lives a double life as a refugee in one of Sudan's neighbouring countries while staying connected to forces on the ground. \"Many of the planes landing at Nyala [in South Darfur] are said to bring weapons from the UAE and partially through the Amdjarras airport in Chad. \n                  Deaths from mosque attack in besieged Sudanese city 'include at least 11 children'\n                 \n                  At least 70 killed in Sudan after paramilitary attack on mosque\n                 \n                  The men facing torture and death to smuggle food into famine-ridden Sudan city\n                 \"It’s a financial relationship, no more,\" he said. \"The RSF controls areas with large gold mines - Darfur alone has more than four or five gold mines - the UAE is a gold trading hub.\" The RSF is accused of genocide in Darfur and mass looting, sexual violence and armed raids across the country. Its troops are currently strangling the last state-held capital of North Darfur in a violent siege to complete its control of western Sudan. Close to a million people in Al Fashir locality are being starved by an RSF blockade and bombarded by daily drone strikes and shelling. On the outskirts of North Darfur's Karnoi town, we meet Joint Task Forces intelligence commander Idris Ali. The Joint Task Forces are made up of former rebels from across Darfur that the military armed the RSF to crush, through mass ethnic violence in the early 2000s. Now, they are armed by the state to fight the RSF. \"Our patriotism does not allow us to surrender. Our right to the land means we have to fight until our last breath,\" says Commander Ali. Read more:The men facing death to smuggle food to SudanInside the epicentre of Sudan's war The RSF is currently using sophisticated weapons and drones to pummel his forces and civilians in Al Fashir, and carry out strikes across Sudan. \"According to our sources, the weapons come from the UAE. Chad is just a corridor for these arms to reach Sudan,\" he added. According to his intelligence, supplies travel from Chad's second city Abeche through the Adre crossing and into West Darfur to Al Geneina - the state capital the RSF massacred before its violent takeover in November 2023.  One video he shared with us shows a truck crossing after dark with khaki material covering its cargo. The commander says it was filmed by sources on the Chad-Sudan border during an arms transfer from Adre town into West Darfur. There is no identifiable branding of humanitarian aid or visible signs of weapons in the footage. In another video, a convoy of land cruisers races through terrain similar to that of eastern Chad. He says his sources also documented this at the Adre crossing and alleges that the land cruisers are painted in RSF colours and turned into lethal 'technicals' [weaponised civilian vehicles] once in West Darfur. He describes a second route that runs south of the border town Tine into North Darfur. Further north, he says RSF arms and supplies land in Amdjarras airport in Chad and head to the main RSF base and supply hub in Zurug town. At least 86 flights travelling from the UAE to Amdjarras airport were independently documented by December 2024. In a letter to the United Nations Security Council on 4 September, the Sudanese authorities alleged no fewer than 248 flights between November 2024 and February 2025 were operated by UAE-chartered aircraft to smuggle mercenaries, weapons and military equipment into Sudanese territory. More recently, online flight tracker @AfriMEOSINT noted flights from the UAE arriving in N'djamena airport in Chad's capital. On 20 September, a cargo flight left Al Reef airbase in Abu Dhabi and landed in the military section of N'Djamena airport. In April, the Guardian reported on a leaked United Nations report that documented a consistent pattern of Ilyushin 1L-76TD cargo flights originating from the UAE into Chad, with multiple flights making deliberate attempts to avoid detection and identified at least three overland routes from Chad potentially used for transporting weapons into Sudan. According to the Guardian, the experts added they could not identify what the planes were carrying or locate any evidence the planes were transporting weapons. These findings were not included in the final 39-page report. UAE 'categorically rejects' claims We presented the allegations in our report to the UAE’s foreign ministry. It sent us this response: \"Since the onset of the civil war, the UAE has consistently supported regional and international efforts to achieve an immediate ceasefire, protect civilians, and ensure accountability for violations committed by all warring parties. \"The UAE remains committed to a civilian-led process that places the needs of the Sudanese people above the interests of any faction. \"In this spirit, the UAE notes a marked increase in unfounded accusations and deliberate propaganda from the so-called Port Sudan Authority, one of the warring parties to the civil war, which actively undermines efforts to end the conflict and restore stability. \"These escalating fabrications form part of a calculated pattern of deflection - shifting blame to others to evade responsibility for its own actions - intended to prolong the war and obstruct a genuine peace process. \"We categorically reject any claims of providing any form of support to either warring party since the onset of the civil war, and condemn atrocities committed by both Port Sudan Authority and RSF. \"The latest UN Panel of Experts report makes clear that there is no substantiated evidence that the UAE has provided any support to RSF, or has any involvement in the conflict. \"The UAE reaffirms its unwavering commitment to working closely with partners to foster dialogue, mobilise international support, and contribute to initiatives that address the humanitarian crisis and lay the groundwork for sustainable peace. \"These efforts will assist in building a secure and stable future for Sudan that meets the aspirations of the brotherly Sudanese people for peace and development.\" The Chadian government did not respond to our request for comment."
    },
    {
        "title": "Taxi driver who left as Southport killer carried out knife attack 'regrets' not doing more",
        "description": "A taxi driver who dropped triple killer Axel Rudakubana at a Southport dance studio and then drove away as he launched his attack has apologised to the families of the victims for not doing more.",
        "url": "https://news.sky.com/story/taxi-driver-who-left-as-southport-killer-carried-out-knife-attack-regrets-not-doing-more-13437995",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-southport-gary-poland_7031413.jpg?20250925145254",
        "type": "Home",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-25 13:27:00",
        "Headline": "Gary Poland took 50 minutes to call the police after seeing children running in his rear view mirror, when it was possible to hear their screams.",
        "Content": "By Duncan Gardham, security journalist  A taxi driver who dropped triple killer Axel Rudakubana at a Southport dance studio and then drove away as he launched his attack has apologised to the families of the victims for not doing more. Alice Aguiar, nine, Bebe King, six, and Elsie Dot Stancombe, seven, were killed at the Taylor Swift-themed class on 29 July last year by Rudakubana, who was later jailed for a minimum of 52 years. The inquiry was told that Rudakubana was picked up from his home in nearby Banks by Gary Poland from One Call Taxis. He got into the back, wearing a green hoodie with the hood up and a COVID-type face mask. The pair did not speak during the journey, but when Rudakubana got out of the taxi in Hart Street, and was asked \"cash or card?\", he walked off without paying. Mr Poland got out of his vehicle and pursued Rudakabuna as he walked down an alleyway to a vehicle body shop, but the killer told him and workers at a nearby garage: \"What are you going to do about it?\" Mr Poland got back into his car and drove down the alleyway that led to the Hart Space, telling him: \"You pay now, or the police are on their way, you f**king knob.\" He saw Rudakubana as he tried the door to the ground floor, and then found the door to the upper floors was unlocked and went inside. The taxi driver turned his vehicle around, but as he prepared leave, children could be seen in the rear dashcam running alongside the taxi, and it was possible to hear their screams, the inquiry was told. Mr Poland looked in the rearview mirror, then drove off. He took another fare before returning home and eventually calling the police at 12.36pm, 50 minutes after the attack. It was only then that they were able to identify Rudakubana, who had refused to tell them who he was when he was arrested by two unarmed police officers. Mr Poland told the inquiry, in a statement: \"On reflection, I do consider that I should have called the police earlier. In hindsight, I wish I had done, and it is something that I think about every day - what I should have done, and how this is my fault because I drove him there. \"I regret not helping the children, their screams were harrowing, and I can still hear them when I think back to that day. \"I regret not doing more. There isn't a day that passes when I don't think about that day and what ifs. What if I had called the police? What if I had got out of my car? What if I had apprehended him for not paying me? But I do not know the answers.\" He said he thought there was a \"gunman shooting at people\" and believed it was the person he had just been shouting at to pay and threatening to call the police, and was worried about becoming a target. Mr Poland admitted hearing the screams and seeing children running out of the building and said he \"just panicked and was not thinking clearly.\" \"I did what I did based upon fear, shock and panic, these are human emotions which I could not control. I can only say that I panicked, and I fled for my own safety,\" Mr Poland added. \"I cannot imagine what the victims and the families of the victims have been through, and they have my deepest sympathy for what happened that day.\" As he drove off, Mr Poland said children were running \"like a stampede for their lives\" and added: \"I was in a state of complete mortal terror and shock.\" Read more from Sky News:Two more deported under UK-France 'one in, one out' dealRooney says he'd be dead if it wasn't for wife Coleen Tattooed and wearing a black zip-up top, white t-shirt and glasses, he told the inquiry: \"I just remember seeing the face. I can't sleep at night, I shut my eyes, I see his face, it's just there all the time in my head.\" However, in a phone call to his friend, who ran the vehicle body shop next door to the Hart Space, recorded on the dashcam after he pulled up around the corner, Mr Poland said: \"I've just dropped a lad off, I chased him down your thing. He ran next door and I think he shot some people. \"Do you not hear screaming and shots go off? He's just f**king shot everyone ain't he?\" His friend, Julian Medlock, told him: \"Lucky you weren't in it\" and Mr Poland added: \"He shot upstairs and I heard these f**king shots and I f**king shot off Jim. Lucky he didn't shoot me, weren't it?\" Nicholas Moss KC, counsel to the inquiry, said: \"The outside observer listening to this exchange may pick up a sense of disbelief from you about what had happened, but not 'mortal terror and shock' \"That wasn't your state at the time that you made this call, was it?\" Mr Poland replied: \"All I can say is I was in shock and I didn't know what was what.\" Mr Moss added: \"At any time during this call, did you say anything about those young girls or their welfare?\" Mr Poland said: \"I don't think so. I really don't know.\" Mr Moss said: \"The fact that you were prepared to confront him verbally might be thought to suggest you are not a shrinking violet, would that be fair?\" \"Correct,\" Mr Poland replied. He told the inquiry: \"If I thought he had a knife, I probably would have got out and disarmed him. It's only a knife.\" When Rudakubana went into the building, he thought that he had gone to get him his money and he would wait. \"I was thinking, he's not said much, I'm thinking, he's gone to get some money, and then that's when, a minute or two later, I heard all these screams, and I thought, what's going on there.' \"What I thought I heard was gunshots, four or five gunshots. That's when I got worried, and I thought, I'm not going to confront anybody with a gun. I don't think anybody would.\" The inquiry continues."
    },
    {
        "title": "Now is moment of 'maximum danger' for Sir Keir Starmer, Harriet Harman warns",
        "description": "Now is the moment of \"maximum danger\" for Sir Keir Starmer, Harriet Harman has warned.",
        "url": "https://news.sky.com/story/now-is-moment-of-maximum-danger-for-sir-keir-starmer-harriet-harman-warns-13438032",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-electoral-dysfunction_7031470.png?20250925154735",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 14:37:00",
        "Headline": "Greater Manchester mayor Andy Burnham has said Labour MPs have urged him to challenge Sir Keir's leadership.",
        "Content": " Now is the moment of \"maximum danger\" for Sir Keir Starmer, Harriet Harman has warned. The Labour peer told Beth Rigby on the Electoral Dysfunction podcast \"everyone really wants Keir Starmer to succeed\" after Greater Manchester's Labour mayor, Andy Burnham, said Labour MPs have been urging him to challenge Sir Keir's premiership. Baroness Harman, who was a Labour MP for 42 years, said this was always \"going to be the most difficult time\" because people are \"fed up\" with hearing it is the Tories' fault, \"yet they're not feeling better off\". \"So this was always going to be the moment of maximum danger,\" she said. \"But I think that what people want is for Keir Starmer to succeed. And they don't want, I think at this point, the turbulence of a leadership challenge.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 She said Mr Burnham, who was in Gordon Brown's cabinet with her, is \"not hiding his light under a bushel in any way, shape or form\". \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 But added: \"I do not want the drama and chaos of a leadership election. \"It's like 'this guy hasn't done it, so we're going to try somebody else'. You know, everybody really wants Keir Starmer to succeed.\" Read more: Could Andy Burnham be a serious threat to Starmer? Baroness Harman said she thinks the \"anxiety\" around Nigel Farage getting into Number 10 is \"fuelling\" the push for Mr Burnham to challenge Sir Keir. \"Keir Starmer would come out absolutely swinging,\" she added. But she admitted Mr Burnham is \"something of a vote whisperer\" and is a very different person from when he served in Gordon Brown's cabinet with her. She said: \"He has actually grown in that position [as mayor] and is something of a vote whisperer. \"Every single ward which was up for contest in the mayoralty of Greater Manchester, he won, including the die-hard Tory areas. \"So you know, he has grown, and it's good to see people grow in politics.\"  This week, Mr Burnham said Labour MPs had contacted him over the summer when asked if they had encouraged him to try to challenge Sir Keir. He told The Telegraph: \"I'm not going to say to you that that hasn't happened. \"But as I say, it's more a decision for those people than it is for me.\" He added: \"I stood twice to be leader of the Labour Party. And I think that tells you, doesn't it?\" As he is not currently an MP, Mr Burnham would have to win a by-election to be able to challenge Sir Keir. There are none on the horizon, yet. Listen to the full episode of Electoral Dysfunction on Friday morning."
    },
    {
        "title": "FBI shares details of handwritten notes allegedly written by Dallas shooting suspect",
        "description": "A handwritten note recovered after a deadly shooting in Dallas detailed the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI has said.",
        "url": "https://news.sky.com/story/notes-showed-dallas-shooting-suspect-wanted-to-spark-real-terror-for-ice-agents-fbi-chief-says-13438057",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dallas-shooting_7031580.jpg?20250925172235",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 15:09:00",
        "Headline": "One person was killed, with two more critically injured in the shooting at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas",
        "Content": "A handwritten note recovered after a deadly shooting in Dallas detailed the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI has said. One person was killed and two people were critically injured after a gunman opened fire at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas, on Wednesday. All three victims were in a transport van outside the facility at the time, the Department of Homeland Security said in a statement. Several more people were injured before the gunman took his own life, officials said. FBI director, Kash Patel, said the agency had seized devices and processed \"writings\" obtained at the scene and in the suspect's home since the attack. A handwritten note recovered read: \"Hopefully this will give ICE agents real terror, to think, 'is there a sniper with AP rounds on that roof?\" The FBI previously said the suspect left a bullet casing engraved with the phrase \"ANTI-ICE\" at the scene. Mr Kash said in a post on X: \"While the investigation is ongoing, an initial review of the evidence shows an ideological motive behind this attack.\" Acting ICE Director Todd Lyons told Sky News partner NBC that ICE agents pulled some of the detainees out of the line of fire. \"The shooter was just shooting at random vehicles inside,\" Mr Lyons said \"They were still hit inside the vehicle. You know, there were some brave men and women on the ground that went into those vans, pulling those detainees out while they were under fire.\" According to the FBI, evidence recovered so far shows a high level of planning ahead of the shooting, including searches of buildings belonging to the Dallas County Office of Homeland Security and Emergency Management. Officials have not yet disclosed the identity of the victims. US Homeland Security Secretary Kristi Noem identified the gunman, in a Fox News interview, as Joshua Jahn, 29. Ms Noem said he had fired the bullets from a nearby rooftop. Read more from Sky News:Star criticses show delay after Charlie Kirk killingMeet NASA crew trying to complete feat not achieved for 50 years Mr Jahn's older brother, Noah Jahn, who lives around 30 miles north of Dallas in McKinney, said he was not aware his brother held any negative feelings towards ICE. He said: \"I didn't know he had any political intent at all.\" The shooting comes at a time of heightened tension in the US following the assassination of right-wing influencer Charlie Kirk. Mr Kirk, a close ally of President Donald Trump, was shot dead by a sniper while speaking at an event in Utah on 10 September. Tyler Robinson, 22, has been charged with the murder of Mr Kirk. Acting US attorney, Nancy Larson, said the gunman was believed to have been seen in footage with a large ladder on his car before the shooting. She also confirmed he likely acted alone. Ms Larson said: \"It did not take long to identify the shooter, who was found deceased at the scene from a self-inflicted gunshot wound. He very likely acted alone. His name is Joshua Jahn, 29, of Fairview, Texas. \"We believe at some point around 3am, the suspect was seen driving on footage with a large ladder on his car and we believe that is what he used to position himself on top of the building. \"The shooting itself started at approximately 6.30am, and after the shooting started police arrived en masse at the scene.\""
    },
    {
        "title": "Donald Trump signs order on TikTok to pave way for US ownership",
        "description": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States.",
        "url": "https://news.sky.com/story/donald-trump-signs-order-on-tiktok-to-pave-way-for-us-ownership-13438247",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-tiktok_7031798.jpg?20250925222852",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:43:00",
        "Headline": "Mr Trump, who held talks with China's President Xi Jinping last week, has repeatedly credited TikTok with helping him win re-election.",
        "Content": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States. The US president held talks with China's President Xi Jinping last week - where the pair discussed the final terms of a deal. The app was ordered to shut down for American users by January 2025 if its Chinese owner - Beijing-based tech firm ByteDance - didn't sell its assets in the country. The ban was delayed four times by Mr Trump. The deal, which vice president JD Vance said was valued at around $14bn (£10.5bn), will see TikTok's US operations run by a new joint-venture company, with ByteDance holding less than 20% of the stock, a senior White House official said prior to the deal being signed. \"There was some resistance on the Chinese side, but the fundamental thing that we wanted to accomplish is that we wanted to keep TikTok operating, but we also wanted to make sure that we protected Americans' data privacy as required by law,\" Mr Vance said. Mr Trump said: \"I spoke with President Xi. We had a good talk, I told him what we were doing, and he said go ahead with it.\" American officials have previously warned that TikTok's algorithm - a complex system of rules and calculations that platforms use to deliver content to people's feeds - is vulnerable to manipulation by Chinese authorities. However, no evidence has ever been presented by US officials showing that Beijing has attempted to do this. Concerns have also been raised about user data being shared with the Chinese government - something ByteDance has said it does not and would never do. Mr Trump attempted to ban TikTok during his first term in the White House, but has repeatedly credited the app, which has 170 million US users, with helping him win re-election. The White House also launched an official TikTok account last month. Mr Trump said media mogul Rupert Murdoch and \"probably four or five absolutely world-class investors\" would be part of the deal. This also includes Oracle co-founder Larry Ellison. Both Mr Ellison and Mr Murdoch have political and business ties to Mr Trump, raising fresh questions about potential political influence on the platform. Questions still remain over how the deal works, but Mr Trump said China's leader, Xi Jinping, has approved it. Around 43% of US adults under the age of 30 say they regularly consume news from TikTok, higher than any other social media app, including YouTube, Facebook and Instagram, according to a Pew Research Centre report."
    },
    {
        "title": "Donald Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister",
        "description": "Saudi Arabia's foreign minister has told Sky News he believes Donald Trump is \"very, very committed\" to ending the war in Gaza.",
        "url": "https://news.sky.com/story/donald-trump-very-very-committed-to-ending-gaza-war-says-saudi-foreign-minister-13438223",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-saudi-arabia-faisal-bin-farhan-al-saud_7031741.jpg?20250925213614",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:02:00",
        "Headline": "Faisal bin Farhan al Saud told Sky News that a recent meeting with the US president went \"very well\" and he was hopeful that a ceasefire deal could soon be signed.",
        "Content": " Saudi Arabia's foreign minister has told Sky News he believes Donald Trump is \"very, very committed\" to ending the war in Gaza. Prince Faisal bin Farhan al Saud said a recent meeting between the US president and Arab leaders went \"very well\" and that he was hopeful that a peace deal could soon be agreed. He told The World with Yalda Hakim: \"The war has gone on for far too long, too many people have died. Too much suffering has occurred [and] we have a famine going on in Gaza right now. \"And I got the sense from the meeting that President Trump is very, very committed to finding a path to ending the war, bringing the hostages out, bringing the relief to the people of Gaza. \"So I'm actually hopeful that we've started the dialogue that's going to get us towards achieving this ceasefire.\" His comments come amid heightened international pressure on Israel after a commission established by the United Nations recently found its military was committing genocide in Gaza. Israel, which launched its offensive in Gaza in response to Hamas's deadly 7 October attacks in 2023, said it \"categorically rejects this distorted and false report\". Alongside the UN Commission report, multiple Western countries, including the UK, have also decided to formally recognise Palestine as a state.  That has prompted some Israeli ministers to call for the annexation of the West Bank to push back against efforts towards a two-state solution to the conflict. But speaking to Sky News, Saudi Arabia's foreign minister said he felt \"reassured that the [US] president understands how dangerous the idea of annexation in the West Bank is, how strongly the Arab and Muslim countries feel about the need to find an end to the war.\" Read more from Sky News:Palestinian president addresses UNTalks held over Israel football banIsrael 'kills 22 in Gaza massacre' After the Sky News interview was recorded, Mr Trump appeared to confirm such a stance later on Thursday, telling reporters at the White House: \"I will not allow Israel to annex the West Bank... It's not gonna' happen... There's been enough.\" The deputy prime minister has addressed the war in Gaza during a speech at the UN General Assembly in New York, saying: \"What is happening in Gaza is indefensible, it is inhumane, it is utterly unjustifiable and it must end now.\" Mr Lammy added that the UK had \"proudly\" recognised the state of Palestine and said both its people and those of Israel \"deserve better\". \"Better than the horrific acts by Hamas on 7 October that left children without their parents and parents without their children,\" he said. \"Better than the torment of families waiting desperately for the return of their loved ones from the most barbaric captivity.  \"Better than the fanatical rule by Hamas, a vile, pitiless terrorist organisation that must have no future in Gaza. \"Better than Israel's denial of life-saving humanitarian aid and the catastrophic famine that it has caused.\" He said that there \"can be no answer except for the hostages out now, aid in now and a ceasefire now\". Meanwhile, the Saudi foreign minister told Sky News that formal recognition of Palestine by so many nations demonstrated that \"real hope partially exists in the renewed commitment by the international community to the two-state solution to a Palestinian state\". He said: \"Because that's a strong signal to everyone, but most particularly to the Palestinian people, that there is actually a hope for them to live in peace and harmony side by side with Israel.\""
    },
    {
        "title": "Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack",
        "description": "Hackers have claimed to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain.",
        "url": "https://news.sky.com/story/hackers-claim-to-have-stolen-pictures-names-and-addresses-of-children-in-nursery-firm-cyber-attack-13438122",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-cyber-hack-attack-hacker_6639079.jpg?20240725172039",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 16:42:00",
        "Headline": "Online criminals are demanding a ransom from the Kido chain of nurseries after posting images of children on the dark web. Police said officers were investigating.",
        "Content": "Hackers have claimed to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain. The group posted images of children from the Kido nursery chain on the dark web - and are demanding a ransom from the company. Parents whose children attend a Kido nursery branch told Sky News they had received an email confirming the data incident - and were offered reassurance by the company. An independent intelligence company confirmed the claims from the hackers, who appear to be threatening to release further details, and those of staff members. An Information Commissioner's Office spokesperson said: \"Kido International has reported an incident to us and we are assessing the information provided.\"  The Met Police said they \"received a referral on Thursday, 25 September, following reports of a ransomware attack on a London-based organisation\". They said enquiries are at the early stages and no arrests have been made. Sky News has contacted Kido for comment. Graeme Stewart, a cyber security expert from Check Point Software, described the cyber attack as a \"new low\". He told Sky News' The UK Tonight With Sarah-Jane Mee: \"I've been involved in cyber security for 25 years and this is the most depressing day, I think, since I've been doing this. \"I've seen hundreds, probably thousands of cyber attacks over the years... This is just indefensible. It's an appalling attack and it just shows frankly a lack of ethics and morals, to go after children's data.\" Read more:Man arrested over airports cyber attackTeenagers charged over cyber attack on TfLPatient's death linked to cyber attack on NHS Toby Lewis, head of threat analysis at cyber security company Darktrace, told Sky News that while the style of attack was not new, \"what is different is the brazenness and willingness to target children or children settings\". He told the News Hour with Mark Austin: \"It definitely seems we are seeing a different style of group, maybe, certainly one that is less concerned about the ethics of what they're doing.\" Mr Lewis said the hackers were likely motivated by money, adding: \"Essentially, it seems they're trying to get parents to pay up so that their children's photos are taken offline. It's a money-making scheme, fundamentally\". Recent high-profile victims of cyber criminals in the UK include retail giant Marks and Spencer, which lost an estimated £300m in a ransomware attack earlier this year. Meanwhile, the government has been urged to step in this week to support suppliers affected by a cyber attack on Jaguar Land Rover, after the car-making firm was forced to halt production at the end of August."
    },
    {
        "title": "Police launch vape-spiking crackdown after teens as young as 14 admitted to hospital",
        "description": "Police in London are launching a crackdown on vape-spiking.",
        "url": "https://news.sky.com/story/police-launch-vape-spiking-crackdown-after-teens-as-young-as-14-admitted-to-hospital-13438302",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-vape-spiking-met-police_7031821.jpg?20250925231118",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-25 23:01:00",
        "Headline": "Officers said in one case teenagers as young as 14 were admitted to hospital after \"cannabis products\" were placed in their devices.",
        "Content": "Police in London are launching a crackdown on vape-spiking. It comes after a case in the southeast of the capital where vapes were tampered with \"cannabis products\", leading to teenagers as young as 14 being admitted to hospital, the Metropolitan Police said. Under the measures, new detection equipment is to be used by officers during checks at bars, nightclubs, party boats, music festivals, concerts and schools to test vapes suspected of containing drugs such as THC or spice, the force said. Police will also use a range of drug-testing equipment including near infra-red detectors that can test powders and tablets suspected of containing drugs. The Met received more than 2,000 allegations of spiking between March 2024 and March 2025. However, officers believe the true scale to be higher due to under-reporting. Women and girls are disproportionately affected, with 66% of victims in August 2025 being female. Read more from Sky News:School coach crashes into ditchFootballer dies following match injuryBritish lawyer killed in Los Angeles Met Deputy Assistant Commissioner Ben Russell said: \"Spiking is an abhorrent crime that we are tackling head on, whether it takes place in a nightclub, a private venue, or on the Thames. \"The ongoing trial of new vape-spiking detection kits is just one example of how we are innovating to get ahead of offenders and better protect the public.\" He added: \"If you think you've been spiked, please come forward - being spiked is never your fault, it's always the fault of the perpetrator. The sooner we know, the more we can do to support you, collect evidence and stop dangerous offenders from targeting others.\""
    },
    {
        "title": "Starmer to unveil plan for digital ID cards to crack down on illegal immigration ",
        "description": "Every adult in Britain will require a digital ID under plans to tackle illegal immigration. ",
        "url": "https://news.sky.com/story/starmer-to-unveil-plan-for-digital-id-cards-to-crack-down-on-illegal-immigration-13438007",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-northern-ireland_7025482.jpg?20250919183418",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-09-25 13:57:00",
        "Headline": "The so-called \"Brit card\" would verify a citizen's right to live and work in the UK.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Every adult in Britain will require a digital ID under plans to tackle illegal immigration.  Writing for The Daily Telegraph, Sir Keir Starmer said the government would make a \"new, free-of-charge digital ID that would be mandatory for the right to work by the end of this parliament\". Sky News earlier reported that the prime minister was due to announce his backing for the scheme in a speech on Friday. The idea behind the so-called \"Brit card\" is that it would verify a citizen's right to live and work in the UK. The plans would require anyone starting a new job or renting a home to show the card on a smartphone app, which would then be checked against a central database of those entitled to work and live here. It is hoped this would reduce the attraction of working in the UK illegally, including for delivery companies. At the moment, workers have to show at least one form of physical ID in the form of documents, but there are concerns within government that these can be faked. \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 French President Emmanuel Macron has repeatedly warned that the lack of ID cards in the UK acts as a major pull factor for Channel crossings, as migrants feel they are able to find work in the black economy. Politics Live: Andy Burnham says Labour MPs want him to oust Starmer Sir Keir is expected to flesh out more details in a speech at the Global Progress Action Summit in London on Friday, when he will argue that relying on migration to plug workforce gaps \"is not compassionate left-wing politics\". The plan represents a shift in the government's position, as last year ministers ruled out the idea following an intervention from Sir Tony Blair just days after Labour won the general election. The former Labour prime minister has long been an advocate of ID cards and took steps to introduce a system that would begin as voluntary and could later become compulsory while in office. The rollout was scrapped after Labour was ejected from power in 2010, having been opposed by the Liberal Democrats and the Tories at the time. Last July, then Home Secretary Yvette Cooper said of the idea: \"It's not in our manifesto. That's not our approach.\" The UK has only previously had mandatory ID cards during wartime, with the last tranche scrapped in 1952. The idea has long been opposed by civil liberty and privacy groups in the UK. Sir Keir is said to have shared their concerns but came round to the idea amid record high levels of small boat crossings. A report by the Tony Blair Institute published on Wednesday said digital ID can \"help close loopholes that trafficking gangs and unscrupulous employers currently exploit, reducing pull factors driving illegal migration to Britain and restoring control over borders\". Labour Together, a Starmer-backed thinktank, published a report in June which said digital ID could play a role in right-to-work and right-to-rent checks, supporting \"better enforcement of migration rules\". How would digital ID work? There is no unique regime for identity cards, but decisions the government would have to make include who is required to register, how much information they should hold, and whether physical forms of the ID should also be made available. Pat McFadden, now the work and pensions secretary, started a cross-government unit to look at how it could work while he was in charge of the cabinet office. He visited Estonia last month, before the cabinet reshuffle, where he said the Baltic country's model could be used as an example. In Estonia, citizens are given a unique number at birth which they use to register marriages, access bank accounts, vote, book GP appointments, file their tax return and even collect supermarket loyalty points, among hundreds of other services. Mr McFadden told The Times digital ID could be applied \"to the immigration system, to the benefit system, to a number of areas\". 'Checkpoint society' The government's plan will be subject to a consultation and would require legislation to be passed, before being rolled out. Labour MPs on the left of the party have already hit out at the idea. Nadia Whittome labelled the policy \"divisive, authoritarian nonsense\", adding: \"If we're going to reheat Blair-era policies, can we please focus on lifting children out of poverty?\" Reform UK and the Tories are also against the proposal, arguing it will not stop small boat crossings. The Lib Dems meanwhile said they were against the principle of people being \"forced to turn over their private data just to go about their daily lives\". The civil liberty group Big Brother Watch said: \"Plans for a mandatory digital ID would make us all reliant on a digital pass to go about our daily lives, turning us into a checkpoint society that is wholly unBritish.\""
    },
    {
        "title": "The pros and cons of digital IDs - and do we need them?",
        "description": "Fans of digital ID cards argue that they will speed the UK into a digital future by giving everyone a way to prove who they are.",
        "url": "https://news.sky.com/story/do-we-need-digital-ids-in-the-uk-13438109",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-labour-together-britcard_7031496.jpg?20250925161002",
        "type": "UK",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-09-25 16:17:00",
        "Headline": "A sweeping shake-up of how the government handles our data could potentially address many of the problems of the current system. But whether No 10 can achieve its goals is another matter entirely.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n Fans of digital ID cards argue that they will speed the UK into a digital future by giving everyone a way to prove who they are. What's confusing about this argument is that we can do that already. We have physical ID cards in the form of passports and driving licences. We also have an extensive system of digital identification and a whole range of laws that require you to prove your identity, sometimes multiple times a week. If you've employed someone recently, even for a few days, you'll know that you have to check their right to work documents, either physically or digitally. It's the same if you open a bank account, hire a solicitor, file a tax return, vote in an election or apply to get government services like Universal Credit. These days, even accessing pornographic content online requires an identity check. The trouble, from a government point of view, is that none of these systems are joined together, which makes it possible to slip through the gaps. Despite all the checks, for instance, illegal immigrants regularly get access to bank accounts. The Home Office is meant to share its data with banks and building societies to stop this happening, but the information is often incomplete or just plain wrong: that's why the system had to be paused for four years after the Windrush scandal came to light. Read more from Sky News:Vaccine giant opens new UK factoryBritish lawyer killed in Los AngelesFormer French president jailed A truly efficient system would clean this kind of data, link it up, and connect it in one sweeping overview. But that would require the creaking civil service to access information that's often hard to find, let alone share. Much easier - or so advocates of ID cards say - to sweep the old bureaucracy aside and begin again with a single central system. The result, they say, would be a system that's faster and more reliable for citizens. But mainly this is a piece of infrastructure that, its proponents hope, would make government function in the way it's supposed to. All of which raises the question - do we actually want that? Do we want a government that can track us in every part of our lives? That can actually enforce the law, in a way it has no hope of doing currently? The government believes the answer is yes. Their focus groups and polling tell them that people are sick and tired of failing government systems and desperate for decisive action, especially on immigration.  That's why the bigger risk in all this might not be the politics but the delivery. Can they make sure this system is built on budget and without massive delays? Can they get it operating at scale without suffering a hack or a major technical glitch? Can they show people that the problem is the current system, not the way it is being used? This is a task that even Google or Amazon would quail at. One that makes HS2 look easy. Yet Whitehall - not known for its tech expertise - might be asked to take it on, perhaps in time for the next election."
    },
    {
        "title": "Police Scotland investigating more than 70 complaints of 'missing ashes and fraud' against ex-funeral directors",
        "description": "Police Scotland has received complaints from more than 70 people as investigations continue into the alleged mismanagement of human remains and funds at a former funeral firm.",
        "url": "https://news.sky.com/story/police-scotland-investigating-more-than-70-complaints-of-missing-ashes-and-fraud-against-ex-funeral-directors-13437987",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-glasgow-funeral-a-milne_7031378.jpg?20250925142416",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-09-25 23:01:00",
        "Headline": "A Milne Independent Funeral Directors is being investigated by Police Scotland over the alleged mismanagement of cremated remains and funds.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n Police Scotland has received complaints from more than 70 people as investigations continue into the alleged mismanagement of human remains and funds at a former funeral firm. Operation Koine was launched in April 2024 into A Milne Independent Funeral Directors in response to allegations of missing ashes and funeral plan fraud. The company had an office in Glasgow and another in Dumbarton, West Dunbartonshire. Two women, aged 37 and 55, and a 56-year-old man were arrested in connection with the probe last year and were released pending further inquiries. Detective Superintendent Robert Bowie told Sky News that a dedicated team has been working through \"hundreds of lines of inquiries\". He said: \"So far, we have identified in excess of 70 separate reports, all relating to the mishandling of cremated remains and fraudulent prepaid funeral plans. \"I firmly believe that there's other people out there who have not come forward as yet - and my appeal is for anyone who has any information, who has any concerns relating to this former funeral director, to please come forward.\" \n                  UK's first drug consumption room in Glasgow should not be seen as 'silver bullet', says Westminster committee\n                 \n                  James Clacher: Tinder rape victim arrested during her hunt for fugitive fake death attacker\n                 \n                  Bar manager wins payout after boss said she looked 'very Aryan'\n                 Det Supt Bowie described the operation as an \"unprecedented investigation for Police Scotland and one of the largest ongoing financial inquiries\". Support is being provided by the force's financial investigation unit. Det Supt Bowie said the team has been liaising with colleagues across the UK who have investigated similar alleged crimes. He said: \"We're seeking advice and guidance from partners and other UK forces. \"We are looking to implement, or we have already implemented, that learning and good practice into our own investigation.\" Det Supt Bowie said the \"vast majority\" of cremated remains recovered from A Milne's two branches during the investigation have been returned to families, but a \"small amount\" remain unclaimed. He added: \"At this moment in time, we have not received any other reports of any other concerns regarding any other funeral firms within Scotland.\" Victim Support Scotland is working closely with Police Scotland to explore a package of support for anyone potentially affected. A helpline is available on 0800 160 1985, with a webchat service at victimsupport.scot. Debbie Adams, director of development and external affairs at Victim Support Scotland, told Sky News: \"It's the uncertainty at the moment. \"People are going to be hearing about this out of the blue and it's the uncertainty of not knowing what's happened to the remains of their loved ones.\" Ms Adams said the additional \"financial uncertainty\" surrounding potential funeral plan fraud has been \"really, really, highly traumatic for people\". Those who believe they have been affected are being urged to come forward and receive the emotional support and practical help on offer. Ms Adams added: \"There's no guessing how people are going to feel, but we will know that this uncertain time is particularly traumatic.\""
    },
    {
        "title": "Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack",
        "description": "Hackers have claimed to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain.",
        "url": "https://news.sky.com/story/hackers-claim-to-have-stolen-pictures-names-and-addresses-of-children-in-nursery-firm-cyber-attack-13438122",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-cyber-hack-attack-hacker_6639079.jpg?20240725172039",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-25 16:42:00",
        "Headline": "Online criminals are demanding a ransom from the Kido chain of nurseries after posting images of children on the dark web. Police said officers were investigating.",
        "Content": "Hackers have claimed to have stolen pictures, names and addresses of thousands of children in a cyber attack on a nursery chain. The group posted images of children from the Kido nursery chain on the dark web - and are demanding a ransom from the company. Parents whose children attend a Kido nursery branch told Sky News they had received an email confirming the data incident - and were offered reassurance by the company. An independent intelligence company confirmed the claims from the hackers, who appear to be threatening to release further details, and those of staff members. An Information Commissioner's Office spokesperson said: \"Kido International has reported an incident to us and we are assessing the information provided.\"  The Met Police said they \"received a referral on Thursday, 25 September, following reports of a ransomware attack on a London-based organisation\". They said enquiries are at the early stages and no arrests have been made. Sky News has contacted Kido for comment. Graeme Stewart, a cyber security expert from Check Point Software, described the cyber attack as a \"new low\". He told Sky News' The UK Tonight With Sarah-Jane Mee: \"I've been involved in cyber security for 25 years and this is the most depressing day, I think, since I've been doing this. \"I've seen hundreds, probably thousands of cyber attacks over the years... This is just indefensible. It's an appalling attack and it just shows frankly a lack of ethics and morals, to go after children's data.\" Read more:Man arrested over airports cyber attackTeenagers charged over cyber attack on TfLPatient's death linked to cyber attack on NHS Toby Lewis, head of threat analysis at cyber security company Darktrace, told Sky News that while the style of attack was not new, \"what is different is the brazenness and willingness to target children or children settings\". He told the News Hour with Mark Austin: \"It definitely seems we are seeing a different style of group, maybe, certainly one that is less concerned about the ethics of what they're doing.\" Mr Lewis said the hackers were likely motivated by money, adding: \"Essentially, it seems they're trying to get parents to pay up so that their children's photos are taken offline. It's a money-making scheme, fundamentally\". Recent high-profile victims of cyber criminals in the UK include retail giant Marks and Spencer, which lost an estimated £300m in a ransomware attack earlier this year. Meanwhile, the government has been urged to step in this week to support suppliers affected by a cyber attack on Jaguar Land Rover, after the car-making firm was forced to halt production at the end of August."
    },
    {
        "title": "Police launch vape-spiking crackdown after teens as young as 14 admitted to hospital",
        "description": "Police in London are launching a crackdown on vape-spiking.",
        "url": "https://news.sky.com/story/police-launch-vape-spiking-crackdown-after-teens-as-young-as-14-admitted-to-hospital-13438302",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-vape-spiking-met-police_7031821.jpg?20250925231118",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-25 23:01:00",
        "Headline": "Officers said in one case teenagers as young as 14 were admitted to hospital after \"cannabis products\" were placed in their devices.",
        "Content": "Police in London are launching a crackdown on vape-spiking. It comes after a case in the southeast of the capital where vapes were tampered with \"cannabis products\", leading to teenagers as young as 14 being admitted to hospital, the Metropolitan Police said. Under the measures, new detection equipment is to be used by officers during checks at bars, nightclubs, party boats, music festivals, concerts and schools to test vapes suspected of containing drugs such as THC or spice, the force said. Police will also use a range of drug-testing equipment including near infra-red detectors that can test powders and tablets suspected of containing drugs. The Met received more than 2,000 allegations of spiking between March 2024 and March 2025. However, officers believe the true scale to be higher due to under-reporting. Women and girls are disproportionately affected, with 66% of victims in August 2025 being female. Read more from Sky News:School coach crashes into ditchFootballer dies following match injuryBritish lawyer killed in Los Angeles Met Deputy Assistant Commissioner Ben Russell said: \"Spiking is an abhorrent crime that we are tackling head on, whether it takes place in a nightclub, a private venue, or on the Thames. \"The ongoing trial of new vape-spiking detection kits is just one example of how we are innovating to get ahead of offenders and better protect the public.\" He added: \"If you think you've been spiked, please come forward - being spiked is never your fault, it's always the fault of the perpetrator. The sooner we know, the more we can do to support you, collect evidence and stop dangerous offenders from targeting others.\""
    },
    {
        "title": "Ex-Arsenal academy player Billy Vigar dies from 'significant brain injury' suffered playing for Chichester City",
        "description": "Former Arsenal academy player Billy Vigar has died aged 21 following an incident at a non-League match.",
        "url": "https://news.sky.com/story/ex-arsenal-academy-player-billy-vigar-dies-from-significant-brain-injury-suffered-playing-for-chichester-city-13438240",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-billy-vigar-arsenal_7031783.jpg?20250925220525",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:26:00",
        "Headline": "Billy Vigar, who was playing for Chichester City Football Club when he suffered the injury, died after being placed into a coma.",
        "Content": "Former Arsenal academy player Billy Vigar has died aged 21 following an incident at a non-League match. Vigar, who was playing for Chichester City Football Club, suffered a significant brain injury during last weekend's game at Wingate and Finchley FC. He was taken to hospital and placed into an induced coma before he had surgery on Tuesday. But his club, who play in the Isthmian League Premier Division, announced Vigar died this morning. A statement on social media read: \"It is with great sadness that Chichester City Football Club has to confirm the passing of Billy Vigar. \"We request that his family's privacy is respected at this most difficult time. Rest in peace Billy. Forever in the hearts of all at Chichester City Football Club.\" The club have postponed Saturday's scheduled match against Lewes. Vigar's family, in a statement posted by the club, said: \"After sustaining a significant brain injury last Saturday, Billy Vigar was put in an induced coma. \"On Tuesday, he needed an operation to aid any chances of recovery. Although this helped, the injury proved too much for him and he passed away on Thursday (25th) morning. \"The responses to the original update show how much Billy was thought of and loved within the sport. His family are devastated that this has happened whilst he was playing the sport that he loved.\" Vigar joined the Gunners' academy on schoolboy terms aged 14 before earning a full-time scholarship for the 2020/21 season. The striker, who also had a loan spell with Derby Under-21s and Eastbourne Borough, left the Premier League side in 2024 after playing once in the EFL Trophy. He then signed for Hastings before a move to Chichester last month. Arsenal said in a statement: \"Everyone at Arsenal is devastated by the shocking news that former academy graduate Billy Vigar has passed away. \"All our thoughts are with his family and loved ones at this time. Rest in peace, Billy.\""
    },
    {
        "title": "Taxi driver who left as Southport killer carried out knife attack 'regrets' not doing more",
        "description": "A taxi driver who dropped triple killer Axel Rudakubana at a Southport dance studio and then drove away as he launched his attack has apologised to the families of the victims for not doing more.",
        "url": "https://news.sky.com/story/taxi-driver-who-left-as-southport-killer-carried-out-knife-attack-regrets-not-doing-more-13437995",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-southport-gary-poland_7031413.jpg?20250925145254",
        "type": "UK",
        "Author": "Duncan Gardham, security journalist",
        "Date Published": "2025-09-25 13:27:00",
        "Headline": "Gary Poland took 50 minutes to call the police after seeing children running in his rear view mirror, when it was possible to hear their screams.",
        "Content": "By Duncan Gardham, security journalist  A taxi driver who dropped triple killer Axel Rudakubana at a Southport dance studio and then drove away as he launched his attack has apologised to the families of the victims for not doing more. Alice Aguiar, nine, Bebe King, six, and Elsie Dot Stancombe, seven, were killed at the Taylor Swift-themed class on 29 July last year by Rudakubana, who was later jailed for a minimum of 52 years. The inquiry was told that Rudakubana was picked up from his home in nearby Banks by Gary Poland from One Call Taxis. He got into the back, wearing a green hoodie with the hood up and a COVID-type face mask. The pair did not speak during the journey, but when Rudakubana got out of the taxi in Hart Street, and was asked \"cash or card?\", he walked off without paying. Mr Poland got out of his vehicle and pursued Rudakabuna as he walked down an alleyway to a vehicle body shop, but the killer told him and workers at a nearby garage: \"What are you going to do about it?\" Mr Poland got back into his car and drove down the alleyway that led to the Hart Space, telling him: \"You pay now, or the police are on their way, you f**king knob.\" He saw Rudakubana as he tried the door to the ground floor, and then found the door to the upper floors was unlocked and went inside. The taxi driver turned his vehicle around, but as he prepared leave, children could be seen in the rear dashcam running alongside the taxi, and it was possible to hear their screams, the inquiry was told. Mr Poland looked in the rearview mirror, then drove off. He took another fare before returning home and eventually calling the police at 12.36pm, 50 minutes after the attack. It was only then that they were able to identify Rudakubana, who had refused to tell them who he was when he was arrested by two unarmed police officers. Mr Poland told the inquiry, in a statement: \"On reflection, I do consider that I should have called the police earlier. In hindsight, I wish I had done, and it is something that I think about every day - what I should have done, and how this is my fault because I drove him there. \"I regret not helping the children, their screams were harrowing, and I can still hear them when I think back to that day. \"I regret not doing more. There isn't a day that passes when I don't think about that day and what ifs. What if I had called the police? What if I had got out of my car? What if I had apprehended him for not paying me? But I do not know the answers.\" He said he thought there was a \"gunman shooting at people\" and believed it was the person he had just been shouting at to pay and threatening to call the police, and was worried about becoming a target. Mr Poland admitted hearing the screams and seeing children running out of the building and said he \"just panicked and was not thinking clearly.\" \"I did what I did based upon fear, shock and panic, these are human emotions which I could not control. I can only say that I panicked, and I fled for my own safety,\" Mr Poland added. \"I cannot imagine what the victims and the families of the victims have been through, and they have my deepest sympathy for what happened that day.\" As he drove off, Mr Poland said children were running \"like a stampede for their lives\" and added: \"I was in a state of complete mortal terror and shock.\" Read more from Sky News:Two more deported under UK-France 'one in, one out' dealRooney says he'd be dead if it wasn't for wife Coleen Tattooed and wearing a black zip-up top, white t-shirt and glasses, he told the inquiry: \"I just remember seeing the face. I can't sleep at night, I shut my eyes, I see his face, it's just there all the time in my head.\" However, in a phone call to his friend, who ran the vehicle body shop next door to the Hart Space, recorded on the dashcam after he pulled up around the corner, Mr Poland said: \"I've just dropped a lad off, I chased him down your thing. He ran next door and I think he shot some people. \"Do you not hear screaming and shots go off? He's just f**king shot everyone ain't he?\" His friend, Julian Medlock, told him: \"Lucky you weren't in it\" and Mr Poland added: \"He shot upstairs and I heard these f**king shots and I f**king shot off Jim. Lucky he didn't shoot me, weren't it?\" Nicholas Moss KC, counsel to the inquiry, said: \"The outside observer listening to this exchange may pick up a sense of disbelief from you about what had happened, but not 'mortal terror and shock' \"That wasn't your state at the time that you made this call, was it?\" Mr Poland replied: \"All I can say is I was in shock and I didn't know what was what.\" Mr Moss added: \"At any time during this call, did you say anything about those young girls or their welfare?\" Mr Poland said: \"I don't think so. I really don't know.\" Mr Moss said: \"The fact that you were prepared to confront him verbally might be thought to suggest you are not a shrinking violet, would that be fair?\" \"Correct,\" Mr Poland replied. He told the inquiry: \"If I thought he had a knife, I probably would have got out and disarmed him. It's only a knife.\" When Rudakubana went into the building, he thought that he had gone to get him his money and he would wait. \"I was thinking, he's not said much, I'm thinking, he's gone to get some money, and then that's when, a minute or two later, I heard all these screams, and I thought, what's going on there.' \"What I thought I heard was gunshots, four or five gunshots. That's when I got worried, and I thought, I'm not going to confront anybody with a gun. I don't think anybody would.\" The inquiry continues."
    },
    {
        "title": "Now is moment of 'maximum danger' for Sir Keir Starmer, Harriet Harman warns",
        "description": "Now is the moment of \"maximum danger\" for Sir Keir Starmer, Harriet Harman has warned.",
        "url": "https://news.sky.com/story/now-is-moment-of-maximum-danger-for-sir-keir-starmer-harriet-harman-warns-13438032",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-electoral-dysfunction_7031470.png?20250925154735",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-25 14:37:00",
        "Headline": "Greater Manchester mayor Andy Burnham has said Labour MPs have urged him to challenge Sir Keir's leadership.",
        "Content": " Now is the moment of \"maximum danger\" for Sir Keir Starmer, Harriet Harman has warned. The Labour peer told Beth Rigby on the Electoral Dysfunction podcast \"everyone really wants Keir Starmer to succeed\" after Greater Manchester's Labour mayor, Andy Burnham, said Labour MPs have been urging him to challenge Sir Keir's premiership. Baroness Harman, who was a Labour MP for 42 years, said this was always \"going to be the most difficult time\" because people are \"fed up\" with hearing it is the Tories' fault, \"yet they're not feeling better off\". \"So this was always going to be the moment of maximum danger,\" she said. \"But I think that what people want is for Keir Starmer to succeed. And they don't want, I think at this point, the turbulence of a leadership challenge.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 She said Mr Burnham, who was in Gordon Brown's cabinet with her, is \"not hiding his light under a bushel in any way, shape or form\". \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 But added: \"I do not want the drama and chaos of a leadership election. \"It's like 'this guy hasn't done it, so we're going to try somebody else'. You know, everybody really wants Keir Starmer to succeed.\" Read more: Could Andy Burnham be a serious threat to Starmer? Baroness Harman said she thinks the \"anxiety\" around Nigel Farage getting into Number 10 is \"fuelling\" the push for Mr Burnham to challenge Sir Keir. \"Keir Starmer would come out absolutely swinging,\" she added. But she admitted Mr Burnham is \"something of a vote whisperer\" and is a very different person from when he served in Gordon Brown's cabinet with her. She said: \"He has actually grown in that position [as mayor] and is something of a vote whisperer. \"Every single ward which was up for contest in the mayoralty of Greater Manchester, he won, including the die-hard Tory areas. \"So you know, he has grown, and it's good to see people grow in politics.\"  This week, Mr Burnham said Labour MPs had contacted him over the summer when asked if they had encouraged him to try to challenge Sir Keir. He told The Telegraph: \"I'm not going to say to you that that hasn't happened. \"But as I say, it's more a decision for those people than it is for me.\" He added: \"I stood twice to be leader of the Labour Party. And I think that tells you, doesn't it?\" As he is not currently an MP, Mr Burnham would have to win a by-election to be able to challenge Sir Keir. There are none on the horizon, yet. Listen to the full episode of Electoral Dysfunction on Friday morning."
    },
    {
        "title": "Man accused of murdering mother and three children in Bradford house fire dies in prison",
        "description": "A man accused of murdering a mother and her three children in a house fire in West Yorkshire has died in prison, the Prison Service has confirmed.",
        "url": "https://news.sky.com/story/man-accused-of-murdering-mother-and-three-children-in-bradford-house-fire-dies-in-prison-13438050",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-bryonie-gawith-denisty-birtle_6662584.jpg?20240821172518",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-25 17:05:00",
        "Headline": "Mohammed Shabir, 45, died at HMP Leeds on Wednesday, a Prison Service spokesperson said.",
        "Content": "A man accused of murdering a mother and her three children in a house fire in West Yorkshire has died in prison, the Prison Service has confirmed. Mohammed Shabir, 45, died at HMP Leeds on Wednesday, a spokesperson said. Mr Shabir, of Keighley, was on remand after being charged with the murders of Bryonie Gawith, 29, Denisty Birtle, nine, Oscar Birtle, five, and Aubree Birtle, 22 months. The family died after a fire at their house in Westbury Road, Bradford, in the early hours of 21 August 2024. Shabir was awaiting trial at Bradford Crown Court on 17 November alongside Sharaz Ali, 40, of no fixed address, and Calum Sunderland, 26, of Keighley, who are accused of the same offences. At a previous court hearing, they all denied the charges, which also include the attempted murder and attempted grievous bodily harm of Ms Gawith's sister, Antonia Gawith. Read more from Sky NewsTwo more deported under one-in-one-out schemeInquiry into prison killing of child abductorFormer French president sentenced to five years The Prison Service said the prisons and probation ombudsman will investigate the circumstances of Mr Shabir's death. The trial of the other two men is scheduled to take place as planned."
    },
    {
        "title": "Man arrested after school coach crashes into ditch in Hampshire",
        "description": "A man has been arrested after the school coach he was driving crashed into a ditch with 29 pupils on board.",
        "url": "https://news.sky.com/story/man-arrested-after-school-coach-crashes-into-ditch-in-hampshire-13438024",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-crash-ower-a36-hampshire_7031484.jpg?20250925155335",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-25 14:25:00",
        "Headline": "Police said no children were hurt, although a teacher suffered a minor leg injury and was treated at the scene.",
        "Content": "A man has been arrested after the school coach he was driving crashed into a ditch with 29 pupils on board. No children were hurt in the collision, which happened on the A36 near Ower, Hampshire, at 5.10am on Thursday. However, one of four teachers on board suffered a minor leg injury and was treated at the scene. Police said the driver, a 48-year-old from Hungerford, Berkshire, also suffered minor injuries and was taken to hospital. He was later arrested on suspicion of dangerous driving while unfit through drink or drugs and remains in custody. The coach, which had been travelling from the Bristol area, came off the road between the Ower roundabout and junction 2 of the M27. A police spokesperson said the vehicle \"left the southbound carriageway\" and then \"went into a ditch.\" Read more from Sky News:Former French president jailedBritish lawyer killed in Los AngelesPM to unveil plan for digital ID cards The school and all parents of those involved have been contacted. The busy road was closed for several hours during the morning rush hour, but has now reopened following a \"complex recovery of the coach from the ditch,\" officers said. The police spokesperson added: \"We're appealing for any motorists who were on that stretch of road around the time of the collision to contact us if they saw the coach in the lead up to the incident, or if you may have any dash cam footage which could assist with our investigation.\""
    },
    {
        "title": "UAE is 'main backer behind RSF militia in Sudan', intelligence officer claims in secret interview",
        "description": "The tribal militia turned paramilitary Rapid Support Forces (RSF) in Sudan are known to document their own war crimes.",
        "url": "https://news.sky.com/story/uae-is-main-backer-behind-rsf-militia-in-sudan-intelligence-officer-claims-in-secret-interview-13437966",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-idris-ali-yousra-elbagir_7031549.png?20250925165011",
        "type": "World",
        "Author": "Yousra Elbagir",
        "Date Published": "2025-09-25 23:01:00",
        "Headline": "In an exclusive interview in an undisclosed location, Sky News learns many of the planes landing in South Darfur are allegedly bringing weapons from the Middle Eastern country - something its government vehemently denies.",
        "Content": "\n          Africa correspondent\n              @YousraElbagir\n The tribal militia turned paramilitary Rapid Support Forces (RSF) in Sudan are known to document their own war crimes. Videos of their fighters lynching women, lashing emergency responders and cheering over dead bodies have circulated online since the start of the RSF's war with Sudan's army in April 2023. One piece of evidence never revealed in any of their violent videos is who is backing them and why? In an exclusive interview with Sky News at a location we cannot disclose, an RSF intelligence officer confirms widespread allegations that the United Arab Emirates (UAE) is the RSF's main backer in a war that has created the world’s largest humanitarian crisis and forced 13 million people to flee their homes. \"In the beginning, it was the Russians - Wagner and the state. Now, they tell me it is the UAE supporting the RSF,\" says Ahmed*, using an alias to protect his identity. Originally from North Darfur, Ahmed lives a double life as a refugee in one of Sudan's neighbouring countries while staying connected to forces on the ground. \"Many of the planes landing at Nyala [in South Darfur] are said to bring weapons from the UAE and partially through the Amdjarras airport in Chad. \n                  Deaths from mosque attack in besieged Sudanese city 'include at least 11 children'\n                 \n                  At least 70 killed in Sudan after paramilitary attack on mosque\n                 \n                  The men facing torture and death to smuggle food into famine-ridden Sudan city\n                 \"It’s a financial relationship, no more,\" he said. \"The RSF controls areas with large gold mines - Darfur alone has more than four or five gold mines - the UAE is a gold trading hub.\" The RSF is accused of genocide in Darfur and mass looting, sexual violence and armed raids across the country. Its troops are currently strangling the last state-held capital of North Darfur in a violent siege to complete its control of western Sudan. Close to a million people in Al Fashir locality are being starved by an RSF blockade and bombarded by daily drone strikes and shelling. On the outskirts of North Darfur's Karnoi town, we meet Joint Task Forces intelligence commander Idris Ali. The Joint Task Forces are made up of former rebels from across Darfur that the military armed the RSF to crush, through mass ethnic violence in the early 2000s. Now, they are armed by the state to fight the RSF. \"Our patriotism does not allow us to surrender. Our right to the land means we have to fight until our last breath,\" says Commander Ali. Read more:The men facing death to smuggle food to SudanInside the epicentre of Sudan's war The RSF is currently using sophisticated weapons and drones to pummel his forces and civilians in Al Fashir, and carry out strikes across Sudan. \"According to our sources, the weapons come from the UAE. Chad is just a corridor for these arms to reach Sudan,\" he added. According to his intelligence, supplies travel from Chad's second city Abeche through the Adre crossing and into West Darfur to Al Geneina - the state capital the RSF massacred before its violent takeover in November 2023.  One video he shared with us shows a truck crossing after dark with khaki material covering its cargo. The commander says it was filmed by sources on the Chad-Sudan border during an arms transfer from Adre town into West Darfur. There is no identifiable branding of humanitarian aid or visible signs of weapons in the footage. In another video, a convoy of land cruisers races through terrain similar to that of eastern Chad. He says his sources also documented this at the Adre crossing and alleges that the land cruisers are painted in RSF colours and turned into lethal 'technicals' [weaponised civilian vehicles] once in West Darfur. He describes a second route that runs south of the border town Tine into North Darfur. Further north, he says RSF arms and supplies land in Amdjarras airport in Chad and head to the main RSF base and supply hub in Zurug town. At least 86 flights travelling from the UAE to Amdjarras airport were independently documented by December 2024. In a letter to the United Nations Security Council on 4 September, the Sudanese authorities alleged no fewer than 248 flights between November 2024 and February 2025 were operated by UAE-chartered aircraft to smuggle mercenaries, weapons and military equipment into Sudanese territory. More recently, online flight tracker @AfriMEOSINT noted flights from the UAE arriving in N'djamena airport in Chad's capital. On 20 September, a cargo flight left Al Reef airbase in Abu Dhabi and landed in the military section of N'Djamena airport. In April, the Guardian reported on a leaked United Nations report that documented a consistent pattern of Ilyushin 1L-76TD cargo flights originating from the UAE into Chad, with multiple flights making deliberate attempts to avoid detection and identified at least three overland routes from Chad potentially used for transporting weapons into Sudan. According to the Guardian, the experts added they could not identify what the planes were carrying or locate any evidence the planes were transporting weapons. These findings were not included in the final 39-page report. UAE 'categorically rejects' claims We presented the allegations in our report to the UAE’s foreign ministry. It sent us this response: \"Since the onset of the civil war, the UAE has consistently supported regional and international efforts to achieve an immediate ceasefire, protect civilians, and ensure accountability for violations committed by all warring parties. \"The UAE remains committed to a civilian-led process that places the needs of the Sudanese people above the interests of any faction. \"In this spirit, the UAE notes a marked increase in unfounded accusations and deliberate propaganda from the so-called Port Sudan Authority, one of the warring parties to the civil war, which actively undermines efforts to end the conflict and restore stability. \"These escalating fabrications form part of a calculated pattern of deflection - shifting blame to others to evade responsibility for its own actions - intended to prolong the war and obstruct a genuine peace process. \"We categorically reject any claims of providing any form of support to either warring party since the onset of the civil war, and condemn atrocities committed by both Port Sudan Authority and RSF. \"The latest UN Panel of Experts report makes clear that there is no substantiated evidence that the UAE has provided any support to RSF, or has any involvement in the conflict. \"The UAE reaffirms its unwavering commitment to working closely with partners to foster dialogue, mobilise international support, and contribute to initiatives that address the humanitarian crisis and lay the groundwork for sustainable peace. \"These efforts will assist in building a secure and stable future for Sudan that meets the aspirations of the brotherly Sudanese people for peace and development.\" The Chadian government did not respond to our request for comment."
    },
    {
        "title": "Donald Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister",
        "description": "Saudi Arabia's foreign minister has told Sky News he believes Donald Trump is \"very, very committed\" to ending the war in Gaza.",
        "url": "https://news.sky.com/story/donald-trump-very-very-committed-to-ending-gaza-war-says-saudi-foreign-minister-13438223",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-saudi-arabia-faisal-bin-farhan-al-saud_7031741.jpg?20250925213614",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:02:00",
        "Headline": "Faisal bin Farhan al Saud told Sky News that a recent meeting with the US president went \"very well\" and he was hopeful that a ceasefire deal could soon be signed.",
        "Content": " Saudi Arabia's foreign minister has told Sky News he believes Donald Trump is \"very, very committed\" to ending the war in Gaza. Prince Faisal bin Farhan al Saud said a recent meeting between the US president and Arab leaders went \"very well\" and that he was hopeful that a peace deal could soon be agreed. He told The World with Yalda Hakim: \"The war has gone on for far too long, too many people have died. Too much suffering has occurred [and] we have a famine going on in Gaza right now. \"And I got the sense from the meeting that President Trump is very, very committed to finding a path to ending the war, bringing the hostages out, bringing the relief to the people of Gaza. \"So I'm actually hopeful that we've started the dialogue that's going to get us towards achieving this ceasefire.\" His comments come amid heightened international pressure on Israel after a commission established by the United Nations recently found its military was committing genocide in Gaza. Israel, which launched its offensive in Gaza in response to Hamas's deadly 7 October attacks in 2023, said it \"categorically rejects this distorted and false report\". Alongside the UN Commission report, multiple Western countries, including the UK, have also decided to formally recognise Palestine as a state.  That has prompted some Israeli ministers to call for the annexation of the West Bank to push back against efforts towards a two-state solution to the conflict. But speaking to Sky News, Saudi Arabia's foreign minister said he felt \"reassured that the [US] president understands how dangerous the idea of annexation in the West Bank is, how strongly the Arab and Muslim countries feel about the need to find an end to the war.\" Read more from Sky News:Palestinian president addresses UNTalks held over Israel football banIsrael 'kills 22 in Gaza massacre' After the Sky News interview was recorded, Mr Trump appeared to confirm such a stance later on Thursday, telling reporters at the White House: \"I will not allow Israel to annex the West Bank... It's not gonna' happen... There's been enough.\" The deputy prime minister has addressed the war in Gaza during a speech at the UN General Assembly in New York, saying: \"What is happening in Gaza is indefensible, it is inhumane, it is utterly unjustifiable and it must end now.\" Mr Lammy added that the UK had \"proudly\" recognised the state of Palestine and said both its people and those of Israel \"deserve better\". \"Better than the horrific acts by Hamas on 7 October that left children without their parents and parents without their children,\" he said. \"Better than the torment of families waiting desperately for the return of their loved ones from the most barbaric captivity.  \"Better than the fanatical rule by Hamas, a vile, pitiless terrorist organisation that must have no future in Gaza. \"Better than Israel's denial of life-saving humanitarian aid and the catastrophic famine that it has caused.\" He said that there \"can be no answer except for the hostages out now, aid in now and a ceasefire now\". Meanwhile, the Saudi foreign minister told Sky News that formal recognition of Palestine by so many nations demonstrated that \"real hope partially exists in the renewed commitment by the international community to the two-state solution to a Palestinian state\". He said: \"Because that's a strong signal to everyone, but most particularly to the Palestinian people, that there is actually a hope for them to live in peace and harmony side by side with Israel.\""
    },
    {
        "title": "Former French president Nicolas Sarkozy sentenced to five years in prison",
        "description": "Former French president Nicolas Sarkozy has been sentenced to five years in prison.",
        "url": "https://news.sky.com/story/former-french-president-nicolas-sarkozy-found-guilty-of-conspiracy-in-gaddafi-finance-trial-13437795",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-nicolas-sarkoz-nicolas-sarkozy_7031286.jpg?20250925130751",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 09:33:00",
        "Headline": "Sarkozy, who was French president between 2007 and 2012, was found guilty of criminal conspiracy - but not guilty of receiving illegal campaign financing from the late Libyan dictator Muammar Gaddafi.",
        "Content": "Former French president Nicolas Sarkozy has been sentenced to five years in prison. The former leader, 70, was found guilty of criminal conspiracy, but not guilty of passive corruption, illegal campaign financing, and concealing the embezzlement of public funds. The three-month court case in Paris was over the alleged illegal financing of Sarkozy's 2007 presidential election campaign by the government of late Libyan dictator Muammar Gaddafi. In a surprise move, the judge said he would be jailed regardless of whether he appeals the verdict, which usually suspends sentencing. He was not sent straight to prison, however, with the start date of his sentence yet to be decided. Sarkozy still vowed to appeal regardless, telling reporters outside court on Thursday: \"This injustice is a scandal. \"I ask the French people - whether they voted for me or not, whether they support me or not - to grasp what has just happened. Hatred truly knows no bounds.\" The ruling undermines confidence in the French justice system, he added, before vowing to \"fight right until the end\" to \"prove his innocence in this affair\". \"If they absolutely want me to sleep in jail, I will sleep in jail, but with my head held high,\" he concluded.  He was accompanied by his wife, singer and model Carla Bruni-Sarkozy, and his three sons. Overall, the hours-long verdict suggested the former president and his co-defendants had conspired to seek Libyan campaign funding - but not that he was personally involved or that money was actually used. The judge said Sarkozy had allowed his associates to reach out to Libyan authorities \"to obtain or try to obtain financial support in Libya for the purpose of securing campaign financing\". Read more from Sky NewsTrump disparages Russian armyWhite House will help to prevent Israel football ban Earlier this year, Sarkozy was stripped of his Legion of Honour medal, France's highest accolade, having been involved in multiple court cases. In 2021, he was found guilty of trying to bribe a magistrate for information about a legal case in which he was implicated in 2014. Two years later, he was sentenced to a year on electronic tag, of which six months were suspended. After three months, it was ruled he could remove the monitoring device due to his age. In another case last year, he was convicted of illegal campaign financing during his unsuccessful 2012 re-election bid, having spent almost twice the allowed amount. He was sentenced to a year in prison, with six months suspended. He has appealed the sentence and is awaiting the outcome from France's highest court - the Court of Cassation. Despite his criminal record, Sarkozy has remained an influential figure within the French Right. Light shed on French-Libyan relations during Gaddafi's rule During the Gaddafi finance trial, he described the case against him as a \"plot\" staged by the \"Gaddafi clan\" and other \"liars and crooks\". He claimed it was revenge for his decision to call for Gaddafi to be removed from office. The allegations stretch back to 2011 when a Libyan news agency reported that Gaddafi had said Libya had secretly sent millions of euros to Sarkozy's election campaign. A year later, French investigative outlet Mediapart published what it claimed to be a piece of Libyan intelligence referencing a £43.7m funding agreement, which Sarkozy rubbished and saw him sue for defamation. The court ruled on Thursday that it \"now appears most likely that this document was a forgery\". In the current case, Sarkozy had 11 co-defendants, including three former ministers. Two of them, Claude Gueant and Brice Hortefeux, both among his closest confidantes during his presidency, were also found guilty of criminal conspiracy but not guilty on other charges. The trial shed light on France's relationship with Libya during the 2000s, when Gaddafi, who was toppled and killed in 2011, was trying to restore diplomatic ties with Western countries. It also saw investigators scrutinise several trips to Libya made by people in Sarkozy's inner circle while he was still interior minister between 2005 and 2007 - including his chief of staff. In a key development in 2016, Franco-Lebanese businessman Ziad Takieddine told Mediapart he had delivered suitcases full of cash from Tripoli to the French interior ministry while Sarkozy was in charge - but later retracted the claims. Mr Takieddine, who was one of the co-defendants, died aged 75 on Tuesday in Beirut, according to his lawyer, Elise Arfi said. He fled to Lebanon in 2020 and did not attend the trial. His change of heart is now subject to a separate investigation into alleged witness interference - but it has not yet gone to trial."
    },
    {
        "title": "'There are costs to standing up to Trump,' says ex-FBI chief James Comey after being charged with lying to Congress",
        "description": "Ex-FBI director James Comey has been charged with obstruction of justice and making a false statement to Congress.",
        "url": "https://news.sky.com/story/ex-fbi-director-james-comey-charged-with-making-false-statement-and-obstruction-13438312",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-james-comey-donald-trump_6917946.jpg?20250516082020",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 22:54:00",
        "Headline": "The charges come days after the US president appeared to chide his attorney general, Pam Bondi, for not bringing criminal charges against Comey and other perceived political enemies quickly enough.",
        "Content": "Ex-FBI director James Comey has been charged with obstruction of justice and making a false statement to Congress. Comey was fired months into Donald Trump's first presidency, in the middle of an investigation into Russian interference in the 2016 election. Fellow former FBI chief Robert Mueller took over the investigation, which found numerous contacts between Mr Trump's 2016 campaign and Russian officials, but concluded that there was not enough evidence to establish a criminal conspiracy. Mr Trump and his supporters labelled the investigation a \"hoax\" and a \"witch hunt\" used to undermine Mr Trump's first administration - despite several government reviews showing that Moscow interfered on behalf of the Republican's campaign. The two charges come days after the US president appeared to chide his attorney general, Pam Bondi, for not bringing criminal charges against Comey and other perceived political enemies quickly enough. \"We can't delay any longer, it's killing our reputation and credibility,\" Mr Trump wrote, referencing the fact that he himself had been indicted and impeached multiple times. \"JUSTICE MUST BE SERVED, NOW!!!\" When she announced the charges, Ms Bondi said: \"No one is above the law. Today's indictment reflects this Department of Justice's commitment to holding those who abuse positions of power accountable for misleading the American people.\" \n                  James Comey: Trump says ex-FBI director's seashells post 'meant assassination'\n                 \n                  Donald Trump like a 'mob boss' but he shouldn't be prosecuted, says ex-FBI boss Comey\n                 \n                  Biden inauguration: Former FBI boss James Comey warns of serious threat from 'armed, disturbed people'\n                 Mr Trump celebrated the charges as \"JUSTICE IN AMERICA\" in a Truth Social post, adding that Comey \"was indicted by a Grand Jury on two felony counts for various illegal and unlawful acts\". Comey asserted his innocence, saying in a statement: \"My family and I have known for years that there are costs to standing up to Donald Trump, but we couldn't imagine ourselves living any other way. We will not live on our knees, and you shouldn't either. Somebody that I love dearly recently said that fear is the tool of a tyrant and she's right. But I'm not afraid and I hope you're not either.\" He added: \"My heart is broken for the Department of Justice, but I have great confidence in the federal judicial system, and I am innocent, so let's have a trial and keep the faith.\" His son-in-law, Troy Edwards, reacted to the charges by resigning as a federal prosecutor. He said he quit his job \"to uphold my oath to the Constitution and the country\". After he was fired, Comey became a prominent critic of the president, calling him \"morally unfit\" for office. The criminal case against Comey, who served as FBI director from 2013 to 2017, does not concern the substance of the Russia investigation. Instead, it accuses him of having lied to Congress in 2020 when he said he never authorised anyone to serve as an anonymous source to a reporter about the investigation. An internal watchdog for the US Justice Department found evidence of numerous errors but no political bias concerning the FBI's opening of the investigation into Russian election interference. In a 2019 report, the watchdog faulted Comey for asking a friend to give memos detailing Comey's one-on-one interactions with Mr Trump to the New York Times. During Mr Trump's first term, the Justice Department declined to pursue criminal charges against Comey. Read more from Sky News:Trump signs TikTok order to pave way for US ownershipFBI shares details of note 'by Dallas shooting suspect' The case against Comey is the starkest example of the Trump administration using law enforcement to target a critic, following the president's promise of retribution against the former FBI chief during his 2024 election campaign. If Comey is convicted of making a false statement and obstruction, he faces up to five years in prison. The former FBI director is expected to surrender Friday morning, according to CNN."
    },
    {
        "title": "Amazon agrees historic $2.5bn settlement for allegedly duping customers into Prime membership",
        "description": "Amazon has reached a historic $2.5bn (&#163;1.9bn) settlement with a US business watchdog over allegations it tricked customers into signing up for Prime membership.",
        "url": "https://news.sky.com/story/amazon-agrees-historic-25bn-settlement-for-allegedly-duping-customers-into-prime-membership-13438160",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-amazon-prime_7031648.jpg?20250925194503",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 18:26:00",
        "Headline": "The Federal Trade Commission (FTC) accused Amazon of tricking customers into its Prime membership, and making it difficult to unsubscribe. ",
        "Content": "Amazon has reached a historic $2.5bn (£1.9bn) settlement with a US business watchdog over allegations it tricked customers into signing up for Prime membership. The Federal Trade Commission (FTC) accused the online giant of tricking customers into the membership scheme - which includes perks like faster delivery - and then making it difficult to cancel. The Seattle-based company will pay $1bn (£750m) in civil penalties, and $1.5bn (£1.1bn) paid back to customers unintentionally enrolled in Prime or deterred from cancelling their subscriptions. Around 35 million Prime customers will be eligible for a payout from the $1.5bn (£1.1bn) fund, the FTC said. Customers who signed up for Prime between 23 June, 2019, and 23 June, 2025, through certain offers, and used few Prime benefits afterwards, will automatically receive $51 (£38). The FTC accused Amazon of making it deliberately difficult for customers to purchase an item without also subscribing to Prime. It added that customers were, in some cases, presented with a button to complete their transactions, which did not clearly state that it would enrol them into Prime. Getting out of a subscription was often too complicated, and Amazon slowed or rejected changes that would have made cancelling easier, according to an FTC complaint. The process of unsubscribing, requiring customers to affirm on three pages their desire to quit, was referred to internally as \"Iliad\", an ancient Greek epic by Homer about the Trojan War, according to the watchdog's complaint. The settlement came just days after a trial began in Seattle this week. Chris Mufarrige, director of the Bureau of Consumer Protection, said: \"I think it just took a few days for them to see that they were going to lose. And they came to us and they paid out.\" Amazon, which admitted no wrongdoing in the case filed two years ago, said it was confident it would win the case but chose to resolve it quickly rather than going through potentially years of trial and appeal. Amazon spokesman, Mark Blafkin, said: \"Amazon and our executives have always followed the law and this settlement allows us to move forward and focus on innovating for customers. \"We work incredibly hard to make it clear and simple for customers to both sign up or cancel their Prime membership, and to offer substantial value for our many millions of loyal Prime members around the world.\" Under the settlement, Amazon is prohibited from misrepresenting the terms of the subscriptions. It must fully disclose the costs to be incurred and obtain the customer's express consent for the charge, with a clear option for customers to accept or decline a Prime subscription offered during purchase and avoid language deemed confusing, such as: \"No thanks, I don't want free shipping.\" Amazon said the settlement does not require it to make any additional changes, only to maintain its current sign-up and cancellation process that it had put in place for a year."
    },
    {
        "title": "Three young women tortured and murdered by drug gang - all captured live on Instagram",
        "description": "Three young women were tortured, raped and murdered by an Argentinian drug gang - who captured it all live on Instagram.",
        "url": "https://news.sky.com/story/three-young-women-tortured-and-murdered-by-drug-gang-all-captured-live-on-instagram-13437790",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lara-gutierrez-brenda-del-castillo_7031282.jpg?20250925130350",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 09:27:00",
        "Headline": "Police believe the friends were tricked into going to a house at night, having been invited to a fake event. ",
        "Content": "Three young women were tortured, raped and murdered by an Argentinian drug gang - who captured it all live on Instagram. Security minister Javier Alonso said the horrific crime was watched by about 45 people in a closed Instagram Live group. Brenda del Castillo, Morena Verdi, and Lara Gutiérrez went missing on Friday. But police have now confirmed their bodies have been found buried in the garden of a house in the southern outskirts of Buenos Aires. Detectives believe they were tricked into going to the property by their murderers. Mr Alonso said: \"They were last seen getting into a vehicle voluntarily because they had been invited to an event, not knowing they were falling into a trap set for them by an international drugs trafficking gang which had hatched a plan to kill them. \"The torture session was streamed live on social media - not recorded, broadcast live - to a private Instagram group, and apparently about 45 people watched it. \"The drug trafficking organisation has its operational command in Buenos Aires and they had chosen this house to carry out the murders.\" 'Brutal dehumanisation' The Buenos Aires Ministry of Women and Diversity said the crime was a femicide - \"the most extreme expressions of gender-based violence\". A statement said: \"In the context of drug-related crime, they are a brutal and ferocious expression of dehumanisation, cruelty, and neglect. \"We accompany their families and loved ones in their grief.\" Wasteland The young women were last seen on CCTV footage from Friday evening, which showed them getting into a white pickup truck. Their bodies were found at the house where their mobile phone signal was last detected. The burned-out truck was later found in a section of wasteland 100m from the house. Four people have so far been arrested. Sky News has contacted Meta, the parent company of Instagram, for comment."
    },
    {
        "title": "FBI shares details of handwritten notes allegedly written by Dallas shooting suspect",
        "description": "A handwritten note recovered after a deadly shooting in Dallas detailed the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI has said.",
        "url": "https://news.sky.com/story/notes-showed-dallas-shooting-suspect-wanted-to-spark-real-terror-for-ice-agents-fbi-chief-says-13438057",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dallas-shooting_7031580.jpg?20250925172235",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 15:09:00",
        "Headline": "One person was killed, with two more critically injured in the shooting at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas",
        "Content": "A handwritten note recovered after a deadly shooting in Dallas detailed the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI has said. One person was killed and two people were critically injured after a gunman opened fire at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas, on Wednesday. All three victims were in a transport van outside the facility at the time, the Department of Homeland Security said in a statement. Several more people were injured before the gunman took his own life, officials said. FBI director, Kash Patel, said the agency had seized devices and processed \"writings\" obtained at the scene and in the suspect's home since the attack. A handwritten note recovered read: \"Hopefully this will give ICE agents real terror, to think, 'is there a sniper with AP rounds on that roof?\" The FBI previously said the suspect left a bullet casing engraved with the phrase \"ANTI-ICE\" at the scene. Mr Kash said in a post on X: \"While the investigation is ongoing, an initial review of the evidence shows an ideological motive behind this attack.\" Acting ICE Director Todd Lyons told Sky News partner NBC that ICE agents pulled some of the detainees out of the line of fire. \"The shooter was just shooting at random vehicles inside,\" Mr Lyons said \"They were still hit inside the vehicle. You know, there were some brave men and women on the ground that went into those vans, pulling those detainees out while they were under fire.\" According to the FBI, evidence recovered so far shows a high level of planning ahead of the shooting, including searches of buildings belonging to the Dallas County Office of Homeland Security and Emergency Management. Officials have not yet disclosed the identity of the victims. US Homeland Security Secretary Kristi Noem identified the gunman, in a Fox News interview, as Joshua Jahn, 29. Ms Noem said he had fired the bullets from a nearby rooftop. Read more from Sky News:Star criticses show delay after Charlie Kirk killingMeet NASA crew trying to complete feat not achieved for 50 years Mr Jahn's older brother, Noah Jahn, who lives around 30 miles north of Dallas in McKinney, said he was not aware his brother held any negative feelings towards ICE. He said: \"I didn't know he had any political intent at all.\" The shooting comes at a time of heightened tension in the US following the assassination of right-wing influencer Charlie Kirk. Mr Kirk, a close ally of President Donald Trump, was shot dead by a sniper while speaking at an event in Utah on 10 September. Tyler Robinson, 22, has been charged with the murder of Mr Kirk. Acting US attorney, Nancy Larson, said the gunman was believed to have been seen in footage with a large ladder on his car before the shooting. She also confirmed he likely acted alone. Ms Larson said: \"It did not take long to identify the shooter, who was found deceased at the scene from a self-inflicted gunshot wound. He very likely acted alone. His name is Joshua Jahn, 29, of Fairview, Texas. \"We believe at some point around 3am, the suspect was seen driving on footage with a large ladder on his car and we believe that is what he used to position himself on top of the building. \"The shooting itself started at approximately 6.30am, and after the shooting started police arrived en masse at the scene.\""
    },
    {
        "title": "Donald Trump signs order on TikTok to pave way for US ownership",
        "description": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States.",
        "url": "https://news.sky.com/story/donald-trump-signs-order-on-tiktok-to-pave-way-for-us-ownership-13438247",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-tiktok_7031798.jpg?20250925222852",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:43:00",
        "Headline": "Mr Trump, who held talks with China's President Xi Jinping last week, has repeatedly credited TikTok with helping him win re-election.",
        "Content": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States. The US president held talks with China's President Xi Jinping last week - where the pair discussed the final terms of a deal. The app was ordered to shut down for American users by January 2025 if its Chinese owner - Beijing-based tech firm ByteDance - didn't sell its assets in the country. The ban was delayed four times by Mr Trump. The deal, which vice president JD Vance said was valued at around $14bn (£10.5bn), will see TikTok's US operations run by a new joint-venture company, with ByteDance holding less than 20% of the stock, a senior White House official said prior to the deal being signed. \"There was some resistance on the Chinese side, but the fundamental thing that we wanted to accomplish is that we wanted to keep TikTok operating, but we also wanted to make sure that we protected Americans' data privacy as required by law,\" Mr Vance said. Mr Trump said: \"I spoke with President Xi. We had a good talk, I told him what we were doing, and he said go ahead with it.\" American officials have previously warned that TikTok's algorithm - a complex system of rules and calculations that platforms use to deliver content to people's feeds - is vulnerable to manipulation by Chinese authorities. However, no evidence has ever been presented by US officials showing that Beijing has attempted to do this. Concerns have also been raised about user data being shared with the Chinese government - something ByteDance has said it does not and would never do. Mr Trump attempted to ban TikTok during his first term in the White House, but has repeatedly credited the app, which has 170 million US users, with helping him win re-election. The White House also launched an official TikTok account last month. Mr Trump said media mogul Rupert Murdoch and \"probably four or five absolutely world-class investors\" would be part of the deal. This also includes Oracle co-founder Larry Ellison. Both Mr Ellison and Mr Murdoch have political and business ties to Mr Trump, raising fresh questions about potential political influence on the platform. Questions still remain over how the deal works, but Mr Trump said China's leader, Xi Jinping, has approved it. Around 43% of US adults under the age of 30 say they regularly consume news from TikTok, higher than any other social media app, including YouTube, Facebook and Instagram, according to a Pew Research Centre report."
    },
    {
        "title": "Airport drone sightings: What we know, why it's dangerous, and can they be stopped?",
        "description": "Airports in Denmark and Norway have had to close after reports of drones in their airspace in recent days.",
        "url": "https://news.sky.com/story/airport-drone-sightings-what-we-know-why-its-dangerous-and-can-they-be-stopped-13437923",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-drone-scotland_6110368.jpg?20250113164005",
        "type": "World",
        "Author": "Michael Drummond, foreign news reporter, and Lauren Russell, news reporter",
        "Date Published": "2025-09-25 12:18:00",
        "Headline": "Drone sightings across several days have affected airports and military installations across Denmark and Norway. Here is all you need to know.",
        "Content": "By Michael Drummond, foreign news reporter, and Lauren Russell, news reporter   Airports in Denmark and Norway have had to close after reports of drones in their airspace in recent days. The incidents are part of what some European officials see as a pattern of Russian disruption that has exposed the vulnerability of European airspace at a time of high tensions between Moscow and NATO. But the Kremlin has strongly denied any involvement. Here is all you need to know. What has happened? In Denmark, the civilian-military Aalborg airport was shut two nights in a row on Wednesday and Thursday, with planes grounded. Danish police said the drones followed a similar pattern to the ones that caused a shutdown at Copenhagen airport a few days earlier. Police said drones had also been observed near airports in the Danish towns of Esbjerg, Sonderborg and Skrydstrup - where Denmark's fleet of F-16 and F-35 fighter jets is based. In Norway, authorities were forced to halt flights at Oslo airport for three hours on Monday after a drone was seen. A link between the Norwegian and Danish incidents has yet to be established. It comes after reports of Russian drones breaching the airspace of Poland and Romania, prompting Article 4 conversations within NATO. Why is it dangerous? Danish justice minister, Peter Hummelgaard, said on Thursday the goal of the drones was to \"sow fear and division\". When drones fly over airports, they pose a risk of colliding with planes, particularly during take-off or landing. In 2018, researchers at the University of Dayton Research Institute released video footage of what can happen when a small drone strikes the wing of an aircraft. The team mimicked a collision between an unmanned aircraft and a small Mooney M20 aircraft at 238mph. The footage showed the drone ripping a hole through the wing. Do airports have to completely close? No, airports do not have to implement a complete shutdown when a drone is detected, but it is typical to halt air traffic in and out of the space to avoid collisions. This has knock-on effects for travelling passengers, causing delays and flights being redirected elsewhere. It is the owner or operator of an individual airport that decides whether to close the facility, and for how long planes are halted. Is Russia responsible? There has been a range of drone incidents reported and it's not clear yet how many - if any - are linked. Danish national police commissioner Thorkild Fogde said many people around the country had reported drone sightings to the police since Monday. \"Of course, many of these reports do not cover activities that are of interest to the police or the military, but some of them do, and I think the one in Aalborg does,\" he said. \"It is too early to say what the goal of the drones is and who is the actor behind,\" a Danish police official from the north of the country said. Of the Copenhagen incident, European Commission President Ursula von der Leyen said the drones were part of a \"pattern of persistent contestation at our borders\". Russia's embassy in Copenhagen rejected suggestions that Moscow could be involved, calling the accusation \"absurd\" speculation. Kremlin spokesperson Dmitry Peskov also denied any involvement. Russia is regularly accused by European countries of engaging in 'grey zone' or hybrid warfare, something its leadership persistently denies.  Has this happened before? A string of drone sightings, as well as digital outages has repeatedly disrupted airports since 2018. In December 2018, Gatwick Airport in West Sussex - the UK's second-busiest airport - was forced to shut down a runway for almost 30 hours after more than 100 drone sightings over three days. More than 100,000 Christmas travellers were affected by the airport's closure, which was the first time a major airport in the UK had been shut down due to drones. Two people were later held but released and subsequently exonerated. Police maintain it was a malicious incident. Almost five years after that, in 2023, Gatwick was again forced to shut down a runway for almost an hour as police investigated a drone sighting. Last year, the operator of Frankfurt airport in Germany - one of Europe's busiest - said that air traffic had to be stopped completely on two days in 2023 over drone incursions. Meanwhile, in America, drone sightings last year forced officials to close down Wright-Patterson Air Force Base near Dayton, Ohio, for around four hours.  What can airports do to stop drones? After the recent sightings, the Danish defence minister said the country would get new capabilities to neutralise drones and put forward laws to allow airports to shoot them down. Similar legislation was implemented in the UK in the wake of the 2018 incident at Gatwick. The UK government introduced extended no-fly zones around airports to three miles (around 5km), and millions of pounds were invested in anti-drone technology, which was installed at both Gatwick and London Heathrow. Known as the Israeli-designed Drone Dome system, the technology can jam communications between a drone and its operator, while it also uses a laser beam in order to locate and destroy hostile drones. It is said to be able to intercept drones at a range of several kilometres. Russian airports and airfields, which are frequent targets for Ukrainian kamikaze drones, regularly utilise GPS jamming to try and disorientate UAVs and stop them from finding their targets. However, this is an imprecise technology and is not targeted, meaning that other aircraft in the surrounding area would also be affected and thus likely impractical for European countries that are not involved in a direct conflict."
    },
    {
        "title": "'There are costs to standing up to Trump,' says ex-FBI chief James Comey after being charged with lying to Congress",
        "description": "Ex-FBI director James Comey has been charged with obstruction of justice and making a false statement to Congress.",
        "url": "https://news.sky.com/story/ex-fbi-director-james-comey-charged-with-making-false-statement-and-obstruction-13438312",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-james-comey-donald-trump_6917946.jpg?20250516082020",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 22:54:00",
        "Headline": "The charges come days after the US president appeared to chide his attorney general, Pam Bondi, for not bringing criminal charges against Comey and other perceived political enemies quickly enough.",
        "Content": "Ex-FBI director James Comey has been charged with obstruction of justice and making a false statement to Congress. Comey was fired months into Donald Trump's first presidency, in the middle of an investigation into Russian interference in the 2016 election. Fellow former FBI chief Robert Mueller took over the investigation, which found numerous contacts between Mr Trump's 2016 campaign and Russian officials, but concluded that there was not enough evidence to establish a criminal conspiracy. Mr Trump and his supporters labelled the investigation a \"hoax\" and a \"witch hunt\" used to undermine Mr Trump's first administration - despite several government reviews showing that Moscow interfered on behalf of the Republican's campaign. The two charges come days after the US president appeared to chide his attorney general, Pam Bondi, for not bringing criminal charges against Comey and other perceived political enemies quickly enough. \"We can't delay any longer, it's killing our reputation and credibility,\" Mr Trump wrote, referencing the fact that he himself had been indicted and impeached multiple times. \"JUSTICE MUST BE SERVED, NOW!!!\" When she announced the charges, Ms Bondi said: \"No one is above the law. Today's indictment reflects this Department of Justice's commitment to holding those who abuse positions of power accountable for misleading the American people.\" \n                  James Comey: Trump says ex-FBI director's seashells post 'meant assassination'\n                 \n                  Donald Trump like a 'mob boss' but he shouldn't be prosecuted, says ex-FBI boss Comey\n                 \n                  Biden inauguration: Former FBI boss James Comey warns of serious threat from 'armed, disturbed people'\n                 Mr Trump celebrated the charges as \"JUSTICE IN AMERICA\" in a Truth Social post, adding that Comey \"was indicted by a Grand Jury on two felony counts for various illegal and unlawful acts\". Comey asserted his innocence, saying in a statement: \"My family and I have known for years that there are costs to standing up to Donald Trump, but we couldn't imagine ourselves living any other way. We will not live on our knees, and you shouldn't either. Somebody that I love dearly recently said that fear is the tool of a tyrant and she's right. But I'm not afraid and I hope you're not either.\" He added: \"My heart is broken for the Department of Justice, but I have great confidence in the federal judicial system, and I am innocent, so let's have a trial and keep the faith.\" His son-in-law, Troy Edwards, reacted to the charges by resigning as a federal prosecutor. He said he quit his job \"to uphold my oath to the Constitution and the country\". After he was fired, Comey became a prominent critic of the president, calling him \"morally unfit\" for office. The criminal case against Comey, who served as FBI director from 2013 to 2017, does not concern the substance of the Russia investigation. Instead, it accuses him of having lied to Congress in 2020 when he said he never authorised anyone to serve as an anonymous source to a reporter about the investigation. An internal watchdog for the US Justice Department found evidence of numerous errors but no political bias concerning the FBI's opening of the investigation into Russian election interference. In a 2019 report, the watchdog faulted Comey for asking a friend to give memos detailing Comey's one-on-one interactions with Mr Trump to the New York Times. During Mr Trump's first term, the Justice Department declined to pursue criminal charges against Comey. Read more from Sky News:Trump signs TikTok order to pave way for US ownershipFBI shares details of note 'by Dallas shooting suspect' The case against Comey is the starkest example of the Trump administration using law enforcement to target a critic, following the president's promise of retribution against the former FBI chief during his 2024 election campaign. If Comey is convicted of making a false statement and obstruction, he faces up to five years in prison. The former FBI director is expected to surrender Friday morning, according to CNN."
    },
    {
        "title": "FBI shares details of handwritten notes allegedly written by Dallas shooting suspect",
        "description": "A handwritten note recovered after a deadly shooting in Dallas detailed the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI has said.",
        "url": "https://news.sky.com/story/notes-showed-dallas-shooting-suspect-wanted-to-spark-real-terror-for-ice-agents-fbi-chief-says-13438057",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-dallas-shooting_7031580.jpg?20250925172235",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 15:09:00",
        "Headline": "One person was killed, with two more critically injured in the shooting at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas",
        "Content": "A handwritten note recovered after a deadly shooting in Dallas detailed the suspect's desire to inflict \"real terror\" on US immigration agents, the head of the FBI has said. One person was killed and two people were critically injured after a gunman opened fire at an Immigration and Customs Enforcement (ICE) field office in Dallas, Texas, on Wednesday. All three victims were in a transport van outside the facility at the time, the Department of Homeland Security said in a statement. Several more people were injured before the gunman took his own life, officials said. FBI director, Kash Patel, said the agency had seized devices and processed \"writings\" obtained at the scene and in the suspect's home since the attack. A handwritten note recovered read: \"Hopefully this will give ICE agents real terror, to think, 'is there a sniper with AP rounds on that roof?\" The FBI previously said the suspect left a bullet casing engraved with the phrase \"ANTI-ICE\" at the scene. Mr Kash said in a post on X: \"While the investigation is ongoing, an initial review of the evidence shows an ideological motive behind this attack.\" Acting ICE Director Todd Lyons told Sky News partner NBC that ICE agents pulled some of the detainees out of the line of fire. \"The shooter was just shooting at random vehicles inside,\" Mr Lyons said \"They were still hit inside the vehicle. You know, there were some brave men and women on the ground that went into those vans, pulling those detainees out while they were under fire.\" According to the FBI, evidence recovered so far shows a high level of planning ahead of the shooting, including searches of buildings belonging to the Dallas County Office of Homeland Security and Emergency Management. Officials have not yet disclosed the identity of the victims. US Homeland Security Secretary Kristi Noem identified the gunman, in a Fox News interview, as Joshua Jahn, 29. Ms Noem said he had fired the bullets from a nearby rooftop. Read more from Sky News:Star criticses show delay after Charlie Kirk killingMeet NASA crew trying to complete feat not achieved for 50 years Mr Jahn's older brother, Noah Jahn, who lives around 30 miles north of Dallas in McKinney, said he was not aware his brother held any negative feelings towards ICE. He said: \"I didn't know he had any political intent at all.\" The shooting comes at a time of heightened tension in the US following the assassination of right-wing influencer Charlie Kirk. Mr Kirk, a close ally of President Donald Trump, was shot dead by a sniper while speaking at an event in Utah on 10 September. Tyler Robinson, 22, has been charged with the murder of Mr Kirk. Acting US attorney, Nancy Larson, said the gunman was believed to have been seen in footage with a large ladder on his car before the shooting. She also confirmed he likely acted alone. Ms Larson said: \"It did not take long to identify the shooter, who was found deceased at the scene from a self-inflicted gunshot wound. He very likely acted alone. His name is Joshua Jahn, 29, of Fairview, Texas. \"We believe at some point around 3am, the suspect was seen driving on footage with a large ladder on his car and we believe that is what he used to position himself on top of the building. \"The shooting itself started at approximately 6.30am, and after the shooting started police arrived en masse at the scene.\""
    },
    {
        "title": "Trump administration will push back if FIFA bans Israel from international football as UEFA close to suspension decision",
        "description": "The Trump administration will work to prevent FIFA banning Israel from international football ahead of the 2026 World Cup, Sky News can reveal.",
        "url": "https://news.sky.com/story/trump-administration-will-work-to-prevent-banning-israel-from-international-football-13437794",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-paok-fans-greece-israel_7030900.jpg?20250925105302",
        "type": "US",
        "Author": "Rob Harris",
        "Date Published": "2025-09-25 09:35:00",
        "Headline": "The US government, through Marco Rubio's state department, has made a direct intervention to stop sporting sanctions being imposed.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  The Trump administration will work to prevent FIFA banning Israel from international football ahead of the 2026 World Cup, Sky News can reveal. It comes as we have also learnt that European governing body UEFA is heading towards its own decision to suspend Israeli teams over the war in Gaza - with many FAs and members of the executive committee understood to favour that. Israel's next match is against Norway on 11 October in a men's World Cup qualifier. Football's world and European governing bodies were urged this week by United Nations (UN) advisory experts to impose sporting sanctions. FIFA has not responded to the UN special rapporteurs as Israel's men continue trying to qualify for next year's World Cup, which is largely being played in the United States. And the US government, through Marco Rubio's state department, has made a direct intervention to stop sporting sanctions being imposed. A state department spokesperson told Sky News: \"We will absolutely work to fully stop any effort to attempt to ban Israel's national soccer team from the World Cup.\" \n                  Donald Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister\n                 \n                  Trump rages against three 'very sinister events' at UN and says Secret Service is investigating\n                 \n                  'Great regret' some European nations buying Russian oil and gas, says top EU official\n                 FIFA launched an investigation last year into allegations of discrimination raised by the Palestine Football Association against the Israeli FA. There is also an investigation into whether teams from Israeli settlements in the West Bank playing in Israeli competitions breaches FIFA regulations. FIFA President Gianni Infantino has a close relationship with US President Donald Trump and is a regular visitor to the White House. He has been in New York this week, meeting world leaders around the UN General Assembly - while also at FIFA's office in Trump Tower. During a speech after collecting an Atlantic Council Global Citizen Award last night, Mr Infantino referenced the war while speaking on bringing people together in \"a divided world, in an aggressive world\". In an indirect reference to the challenge of sanctioning countries over wars, Mr Infantino said there are 80 countries where there are conflicts. He added: \"I suffer when I see children suffer. I cry when I see mothers crying, whether it's in Gaza... anywhere in the world.\" Sky News revealed yesterday that discussions are taking place at high levels in European football about whether Israel should be banned but no decision has been taken. Officials have been deliberating over why Russia remains banned over the war in Ukraine but Israel is clear to continue playing in European club competitions and on the international stage as the death toll mounts. UEFA has previously publicly said there is a difference in how the wars started - with Russia launching an unprovoked invasion of Ukraine and Israel responding to the 7 October 2023 Hamas attacks. But a UN commission of inquiry has now said Israel is committing genocide in Gaza - accusations rejected by Israel. That led to UN advisers calling for Israeli teams to be expelled from world football. Read more from Sky News:Israel 'kills 22 people including nine children' in GazaWhat recognising a Palestinian state actually means \"Sports cannot be business as usual and something has to change and Israel has to be excluded,\" Alexandra Xanthaki, the UN special rapporteur for cultural rights, told Sky News. \"I think that when we talk about teams, national teams, not individual athletes, of states that are subject to valid claims of genocide... this is where this is for sure a red line.\" Among the athletes killed during the war is the footballer known as the Palestinian Pele - Suleiman al Obeid - who the Palestine FA announced in August died in an Israeli airstrike. The Palestine Olympic Committee this week said the Israeli sports system has been an \"active participant\" in war. \"Over 1,000 athletes have had their lives extinguished. Thousands more are wounded, maimed or disabled,\" said POC President Jibril Rajoub, who also heads the FA. \"Our stadiums, our facilities, our dreams, all have been ground into dust.\" A suspension of Israeli teams would prevent Aston Villa having to go ahead with their match in the Europa League against Maccabi Tel Aviv in November. FIFA did not respond to a request for comment."
    },
    {
        "title": "Donald Trump signs order on TikTok to pave way for US ownership",
        "description": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States.",
        "url": "https://news.sky.com/story/donald-trump-signs-order-on-tiktok-to-pave-way-for-us-ownership-13438247",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-tiktok_7031798.jpg?20250925222852",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:43:00",
        "Headline": "Mr Trump, who held talks with China's President Xi Jinping last week, has repeatedly credited TikTok with helping him win re-election.",
        "Content": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States. The US president held talks with China's President Xi Jinping last week - where the pair discussed the final terms of a deal. The app was ordered to shut down for American users by January 2025 if its Chinese owner - Beijing-based tech firm ByteDance - didn't sell its assets in the country. The ban was delayed four times by Mr Trump. The deal, which vice president JD Vance said was valued at around $14bn (£10.5bn), will see TikTok's US operations run by a new joint-venture company, with ByteDance holding less than 20% of the stock, a senior White House official said prior to the deal being signed. \"There was some resistance on the Chinese side, but the fundamental thing that we wanted to accomplish is that we wanted to keep TikTok operating, but we also wanted to make sure that we protected Americans' data privacy as required by law,\" Mr Vance said. Mr Trump said: \"I spoke with President Xi. We had a good talk, I told him what we were doing, and he said go ahead with it.\" American officials have previously warned that TikTok's algorithm - a complex system of rules and calculations that platforms use to deliver content to people's feeds - is vulnerable to manipulation by Chinese authorities. However, no evidence has ever been presented by US officials showing that Beijing has attempted to do this. Concerns have also been raised about user data being shared with the Chinese government - something ByteDance has said it does not and would never do. Mr Trump attempted to ban TikTok during his first term in the White House, but has repeatedly credited the app, which has 170 million US users, with helping him win re-election. The White House also launched an official TikTok account last month. Mr Trump said media mogul Rupert Murdoch and \"probably four or five absolutely world-class investors\" would be part of the deal. This also includes Oracle co-founder Larry Ellison. Both Mr Ellison and Mr Murdoch have political and business ties to Mr Trump, raising fresh questions about potential political influence on the platform. Questions still remain over how the deal works, but Mr Trump said China's leader, Xi Jinping, has approved it. Around 43% of US adults under the age of 30 say they regularly consume news from TikTok, higher than any other social media app, including YouTube, Facebook and Instagram, according to a Pew Research Centre report."
    },
    {
        "title": "Donald Trump 'very, very committed' to ending Gaza war, says Saudi foreign minister",
        "description": "Saudi Arabia's foreign minister has told Sky News he believes Donald Trump is \"very, very committed\" to ending the war in Gaza.",
        "url": "https://news.sky.com/story/donald-trump-very-very-committed-to-ending-gaza-war-says-saudi-foreign-minister-13438223",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-saudi-arabia-faisal-bin-farhan-al-saud_7031741.jpg?20250925213614",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:02:00",
        "Headline": "Faisal bin Farhan al Saud told Sky News that a recent meeting with the US president went \"very well\" and he was hopeful that a ceasefire deal could soon be signed.",
        "Content": " Saudi Arabia's foreign minister has told Sky News he believes Donald Trump is \"very, very committed\" to ending the war in Gaza. Prince Faisal bin Farhan al Saud said a recent meeting between the US president and Arab leaders went \"very well\" and that he was hopeful that a peace deal could soon be agreed. He told The World with Yalda Hakim: \"The war has gone on for far too long, too many people have died. Too much suffering has occurred [and] we have a famine going on in Gaza right now. \"And I got the sense from the meeting that President Trump is very, very committed to finding a path to ending the war, bringing the hostages out, bringing the relief to the people of Gaza. \"So I'm actually hopeful that we've started the dialogue that's going to get us towards achieving this ceasefire.\" His comments come amid heightened international pressure on Israel after a commission established by the United Nations recently found its military was committing genocide in Gaza. Israel, which launched its offensive in Gaza in response to Hamas's deadly 7 October attacks in 2023, said it \"categorically rejects this distorted and false report\". Alongside the UN Commission report, multiple Western countries, including the UK, have also decided to formally recognise Palestine as a state.  That has prompted some Israeli ministers to call for the annexation of the West Bank to push back against efforts towards a two-state solution to the conflict. But speaking to Sky News, Saudi Arabia's foreign minister said he felt \"reassured that the [US] president understands how dangerous the idea of annexation in the West Bank is, how strongly the Arab and Muslim countries feel about the need to find an end to the war.\" Read more from Sky News:Palestinian president addresses UNTalks held over Israel football banIsrael 'kills 22 in Gaza massacre' After the Sky News interview was recorded, Mr Trump appeared to confirm such a stance later on Thursday, telling reporters at the White House: \"I will not allow Israel to annex the West Bank... It's not gonna' happen... There's been enough.\" The deputy prime minister has addressed the war in Gaza during a speech at the UN General Assembly in New York, saying: \"What is happening in Gaza is indefensible, it is inhumane, it is utterly unjustifiable and it must end now.\" Mr Lammy added that the UK had \"proudly\" recognised the state of Palestine and said both its people and those of Israel \"deserve better\". \"Better than the horrific acts by Hamas on 7 October that left children without their parents and parents without their children,\" he said. \"Better than the torment of families waiting desperately for the return of their loved ones from the most barbaric captivity.  \"Better than the fanatical rule by Hamas, a vile, pitiless terrorist organisation that must have no future in Gaza. \"Better than Israel's denial of life-saving humanitarian aid and the catastrophic famine that it has caused.\" He said that there \"can be no answer except for the hostages out now, aid in now and a ceasefire now\". Meanwhile, the Saudi foreign minister told Sky News that formal recognition of Palestine by so many nations demonstrated that \"real hope partially exists in the renewed commitment by the international community to the two-state solution to a Palestinian state\". He said: \"Because that's a strong signal to everyone, but most particularly to the Palestinian people, that there is actually a hope for them to live in peace and harmony side by side with Israel.\""
    },
    {
        "title": "Amazon agrees historic $2.5bn settlement for allegedly duping customers into Prime membership",
        "description": "Amazon has reached a historic $2.5bn (&#163;1.9bn) settlement with a US business watchdog over allegations it tricked customers into signing up for Prime membership.",
        "url": "https://news.sky.com/story/amazon-agrees-historic-25bn-settlement-for-allegedly-duping-customers-into-prime-membership-13438160",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-amazon-prime_7031648.jpg?20250925194503",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 18:26:00",
        "Headline": "The Federal Trade Commission (FTC) accused Amazon of tricking customers into its Prime membership, and making it difficult to unsubscribe. ",
        "Content": "Amazon has reached a historic $2.5bn (£1.9bn) settlement with a US business watchdog over allegations it tricked customers into signing up for Prime membership. The Federal Trade Commission (FTC) accused the online giant of tricking customers into the membership scheme - which includes perks like faster delivery - and then making it difficult to cancel. The Seattle-based company will pay $1bn (£750m) in civil penalties, and $1.5bn (£1.1bn) paid back to customers unintentionally enrolled in Prime or deterred from cancelling their subscriptions. Around 35 million Prime customers will be eligible for a payout from the $1.5bn (£1.1bn) fund, the FTC said. Customers who signed up for Prime between 23 June, 2019, and 23 June, 2025, through certain offers, and used few Prime benefits afterwards, will automatically receive $51 (£38). The FTC accused Amazon of making it deliberately difficult for customers to purchase an item without also subscribing to Prime. It added that customers were, in some cases, presented with a button to complete their transactions, which did not clearly state that it would enrol them into Prime. Getting out of a subscription was often too complicated, and Amazon slowed or rejected changes that would have made cancelling easier, according to an FTC complaint. The process of unsubscribing, requiring customers to affirm on three pages their desire to quit, was referred to internally as \"Iliad\", an ancient Greek epic by Homer about the Trojan War, according to the watchdog's complaint. The settlement came just days after a trial began in Seattle this week. Chris Mufarrige, director of the Bureau of Consumer Protection, said: \"I think it just took a few days for them to see that they were going to lose. And they came to us and they paid out.\" Amazon, which admitted no wrongdoing in the case filed two years ago, said it was confident it would win the case but chose to resolve it quickly rather than going through potentially years of trial and appeal. Amazon spokesman, Mark Blafkin, said: \"Amazon and our executives have always followed the law and this settlement allows us to move forward and focus on innovating for customers. \"We work incredibly hard to make it clear and simple for customers to both sign up or cancel their Prime membership, and to offer substantial value for our many millions of loyal Prime members around the world.\" Under the settlement, Amazon is prohibited from misrepresenting the terms of the subscriptions. It must fully disclose the costs to be incurred and obtain the customer's express consent for the charge, with a clear option for customers to accept or decline a Prime subscription offered during purchase and avoid language deemed confusing, such as: \"No thanks, I don't want free shipping.\" Amazon said the settlement does not require it to make any additional changes, only to maintain its current sign-up and cancellation process that it had put in place for a year."
    },
    {
        "title": "Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing",
        "description": "Jessica Chastain has criticised Apple's decision to delay the release of political thriller series The Savant after the killing of Charlie Kirk.",
        "url": "https://news.sky.com/story/jessica-chastain-criticises-decision-to-delay-release-of-the-savant-after-charlie-kirk-killing-13437637",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jessica-chastain-the-savant_7030944.jpg?20250925034644",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 02:10:00",
        "Headline": "In the show, Chastain portrays a military veteran who works at the Anti-Hate Alliance, where she secretly visits 4Chan-like message boards and poses as a white nationalist to identify possible terrorists.",
        "Content": "Jessica Chastain has criticised Apple's decision to delay the release of political thriller series The Savant after the killing of Charlie Kirk. The actress, who is also executive producer of the show for the tech giant's TV+ streaming service, said she was \"not aligned on the decision to pause the release\". In a post on Instagram, she said the programme, in which she plays a woman who tries to draw out potential terrorists online, is \"so relevant\" and she has never \"shied away from difficult subjects\". Chastain portrays a military veteran who works at the Anti-Hate Alliance, where she secretly visits 4Chan-like message boards and poses as a white nationalist to identify possible terrorists. \"'The Savant' is about the heroes who work every day to stop violence before it happens, and honouring their courage feels more urgent than ever,\" Chastain said. \"I remain hopeful the show will reach audiences soon. Until then, I'm wishing safety and strength for everyone.\" She listed several acts of political violence in the US in recent years, including a plot to kidnap Michigan's governor Gretchen Whitmer, the attempted assassinations of Donald Trump last year and also the killing of controversial influencer Kirk. Read more:The string of bloody political violence in the MAGA era Apple said it chose to postpone the show after \"careful consideration\" but did not give a reason why. Kimmel's comeback show brings in record ratings Meanwhile, millions of people tuned in to watch Jimmy Kimmel on Tuesday after he returned to TV after Disney suspended him for nearly a week after he made comments about Kirk. ABC said 6.26 million people watched Kimmel as he said it was \"never my intention to make light of\" Kirk's death. It was the late-night show's highest-rated regularly scheduled episode. Read more:Explained: Why Jimmy Kimmel was taken off air  \"I don't think there's anything funny about it,\" he said as he choked up. \"Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual. That was really the opposite of the point I was trying to make\". Kimmel had been accused of being \"offensive and insensitive\" after using his programme, Jimmy Kimmel Live, to accuse Donald Trump and his allies of capitalising on the killing."
    },
    {
        "title": "Scottish lawyer June Bunyan who moved to US to become defence attorney 'murdered' in Los Angeles",
        "description": "A Scottish lawyer who moved to the US to pursue her dream of becoming a defence attorney has been murdered in Los Angeles, investigators say.",
        "url": "https://news.sky.com/story/scottish-lawyer-june-bunyan-who-moved-to-us-to-become-defence-attorney-murdered-in-los-angeles-13437767",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-june-bunyan-los-angeles_7031187.jpg?20250925111617",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-25 09:12:00",
        "Headline": "The Los Angeles Police Department (LAPD) has arrested a man on charges of murder, mutilation and sexual contact with human remains.",
        "Content": "A Scottish lawyer who moved to the US to pursue her dream of becoming a defence attorney has been murdered in Los Angeles, investigators say. Family and friends have launched a crowdfunder to repatriate the body of June Bunyan, 37, after she was killed at her residence on 11 September. The Los Angeles County Medical Examiner reported Ms Bunyan suffered \"traumatic neck injuries\". The Los Angeles Police Department (LAPD) has arrested a man on charges of murder, mutilation and sexual contact with human remains. Suspect Jonathan Renteria, 25, is being held at the Twin Towers Correctional Facility in Los Angeles. The Foreign, Commonwealth and Development Office (FCDO) is supporting Ms Bunyan's family and said it is in contact with local authorities in the US. Ms Bunyan's friend Vicky Tulika set up a GoFundMe page to help her family with repatriation and funeral costs, which has so far raised more than £5,000. \n                  Body found in Tesla registered to singer d4vd named as missing 15-year-old girl\n                 \n                  Trump suffers setback in bid to act as national police chief after chaos on streets of LA\n                 \n                  California: 21 children taken into custody - amid claims couple misled surrogate mothers across the US\n                 She wrote: \"With unimaginable heartbreak, we share the devastating news that our beloved daughter, sister, niece, cousin and friend, June Bunyan, was tragically taken from us due to a violent crime in the United States. \"Our lives are forever changed.\" Read more from Sky News:Airport forced to close after drones spottedOscar-winner criticises decision to delay new show after Charlie Kirk killing The Robert Gordon University graduate was \"known for her vibrant personality, infectious laugh, and deeply compassionate heart\", she wrote. Ms Tulika said her friend, who grew up on the island of Arran, was pursuing her \"dream\" of becoming a defence attorney before her life was \"cut short so far from home\". She added: \"We are now faced with the heartbreaking task of bringing her back to the UK. She can then be laid to rest with the dignity and love she deserves, surrounded by family and friends.\" A FCDO spokesperson said: \"We are supporting the family of a British woman who has died in USA and are in contact with the local authorities.\""
    },
    {
        "title": "Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'",
        "description": "Small firms reliant on the production-halted British car maker Jaguar Land Rover, \"may have at best a week of cashflow left to support themselves\" with \"urgent\" action needed to support businesses.",
        "url": "https://news.sky.com/story/jaguar-land-rover-says-some-it-systems-back-online-after-cyber-attack-13438046",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7009369.jpg?20250902155229",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-09-25 14:58:00",
        "Headline": "Jaguar Land Rover said some IT systems are back online after the cyber attack. Supplier payments, supply of parts and registration of vehicles can all recommence. ",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Small firms reliant on the production-halted British car maker Jaguar Land Rover, \"may have at best a week of cashflow left to support themselves\" with \"urgent\" action needed to support businesses. Liam Byrne, the head of the influential Business and Trade Committee of MPs, wrote to Chancellor Rachel Reeves with the warning after meeting with the car maker's suppliers. \"Larger firms, we heard, may begin to seriously struggle within a fortnight - and many are simply unclear how they will pay payroll costs at the end of October,\" he said \"In short, many firms have merely \"weeks left\" before the financial impact on them becomes untenable and causes critical damage to key elements of the automotive supply chain.\" Money latest: HMRC can now take money direct from your account if you don't pay Since 31 August, production has been halted across the car-making supply chain, with staff off work as a result of the attack. More than 33,000 people work directly for JLR in the UK, many of them on assembly lines in the West Midlands, the largest of which is in Solihull, and a plant at Halewood on Merseyside. \n                  Hackers claim to have stolen pictures, names and addresses of children in nursery firm cyber attack\n                 \n                  Man arrested in connection with airports cyber attack\n                 \n                  Jaguar Land Rover production shutdown after cyber attack extended to 1 October\n                  An estimated 200,000 more are employed by several hundred companies in the supply chain, who have faced business interruption with their largest client out of action. Calls for government financial support had been growing, but Prime Minister Keir Starmer on Thursday afternoon said, \"I haven't got an outcome here to give to you today\". A partial restart It comes as JLR announced some of its IT systems are back online after being hit by a cyber attack late last month though production is still not expected to start again until 1 October at the earliest. \"The foundational work of our recovery programme is firmly underway,\" a company spokesperson said in a statement. As part of the partial restart, supplier payments can begin again. \"We have significantly increased IT processing capacity for invoicing,\" the statement said. \"We are now working to clear the backlog of payments to our suppliers as quickly as we can.\" The supply of parts to customers across the world can also now recommence. After a workaround was reached on Tuesday to allow cars to move to buyers without the usual online registration, the financial system to process wholesale vehicles is back online. \"We are able to sell and register vehicles for our clients faster, delivering important cash flow\", the company said. \"Our focus remains on supporting our customers, suppliers, colleagues and our retailers. We fully recognise this is a difficult time for all connected with JLR and we thank everyone for their continued support and patience.\""
    },
    {
        "title": "Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history",
        "description": "There was some speculation, when it emerged that Nigel Farage was heading to Threadneedle Street to see the Bank of England governor, that he was about to \"do a Trump\".",
        "url": "https://news.sky.com/story/farage-and-tice-right-to-scrutinise-one-of-bank-of-englands-most-radical-monetary-experiments-in-history-13437894",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-reform-nigel-farage_7031275.jpg?20250925125321",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-09-25 11:43:00",
        "Headline": "Fears of a Trump style-trolling of the central bank head have, for now, been allayed. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  There was some speculation, when it emerged that Nigel Farage was heading to Threadneedle Street to see the Bank of England governor, that he was about to \"do a Trump\". You might recall, if you follow American politics, how the US president has been, for want of a better word, trolling the chairman of the Federal Reserve, Jerome Powell, threatening to fire him if he didn't cut interest rates. Might Mr Farage and Reform be about to do the same thing in the UK, raising deep (and, for economists, scary) questions about the independence of the central bank? The short answer, as far as anyone can tell following today's meeting, is: no. Instead, Mr Farage and his fellow Reform MP Richard Tice enjoyed a relatively cordial meeting with the governor, where they discussed the intricacies of quantitative easing, the Bank's reserves policies and even cryptocurrency - a slightly unexpected addition to the agenda which might reflect the fact that Reform is hoping to raise lots of campaign funds from crypto dudes. Money latest: HMRC can now take money direct from your account if you don't pay The main Bank-related issue Reform has been campaigning on - Mr Tice in particular - comes back to something seemingly arcane but certainly important. As you may be aware, in recent years, the Bank of England has, alongside its interest rate policy, been engaged in something called quantitative easing (QE). QE is complex, but it boils down to this: in an effort to boost the economy, the Bank bought up a lot of government bonds and they now sit awkwardly in its balance sheet. In recent months, the Bank has begun to reverse QE (quantitative tightening) - selling off billions of pounds of bonds.  Anyway, reach deeper into the arcane mechanism of how QE works and something interesting leaps out. Two things, actually. First, as part of QE, in order to get hold of those government bonds, the Bank created \"reserves\" - sort of bank-account-at-the-Bank-of-England - for the high street banks from whom it bought them. Tens of billions to high street banks \n                  Bank of England governor to join Reeves on key China visit\n                 \n                  Brexit has 'weighed' on economy and UK 'must rebuild relations' with EU - Bank of England governor\n                 \n                  Reeves has welcome support from Bank's governor as she goes for growth and seeks to woo City\n                 Those reserves earn interest at the Bank's official interest rate. At the time of QE, the rate was near zero, so no one spent much time thinking about reserves. But since then, rates went up to 5.25%, and are now at 4%, and hence the Bank has recently been paying out a hefty amount - tens of billions of pounds - in interest to high street banks. This, says Richard Tice, is an abomination. In the last Reform manifesto, he said the Bank should stop paying out those reserves. Which, on the face of it, sounds perfectly sensible. However, there are a few catches. A big bank tax The first is that while in theory it might help recoup billions of pounds of public money, that money has to come from somewhere, and in this case, it would come from high street banks. In other words, this is, in all but name, a very big bank tax. The Bank of England's point, when asked about all this, is that if anyone is going to do something like that, it should really be the government, since it's rightly in charge of taxing and spending. Read more:Co-op reveals £80m profit hit from cyber attack disruption - with more to comeJaguar Land Rover cyber attack: No easy options for taxpayer aid The other catch is that Bank of England reserves systems are desperately complex. Changing the way they're structured is a delicate operation. Running a coach and horses through it, as Mr Tice is suggesting, could have all sorts of unintended consequences, including undermining confidence in UK economic policy. This, by the way, is not the only thing Reform is unhappy about: they also think the Bank should slow down its quantitative tightening programme. But the point of all the above is that while there are some big question marks about the particular idea Reform is proposing, the worst thing of all would be not to discuss this as publicly as possible. The worst outcome of all would be for the government and Bank to take certain decisions which affect billions of pounds of public money with only the merest of scrutiny, save at the Treasury Select Committee, whose sessions rarely get much attention beyond the financial pages. And that is more or less the situation we've had for the past decade and a half. The Bank of England has introduced one of the most radical monetary experiments in history, which may or may not have been a success or a failure, but few outside of the City are even aware of it. Mr Tice's policy platform may be flawed, but his overarching point - that this stuff desperately needs more scrutiny - is quite right."
    },
    {
        "title": "WH Smith buyer Modella clinches deal for Claire's",
        "description": "The buyer of WH Smith's high street chain is on the brink of a deal to rescue the British operations of Claire's, the accessories retailer, in a deal which is nevertheless likely to trigger scores of shop closures.",
        "url": "https://news.sky.com/story/wh-smith-buyer-modella-clinches-deal-for-claires-13437871",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-claires-claires-accesories_7005467.jpg?20250830115912",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-25 11:01:00",
        "Headline": "Modella Capital and Interpath Advisory could announce a transaction as soon as Friday, with store closures and job losses at the accessories chain expected to follow, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The buyer of WH Smith's high street chain is on the brink of a deal to rescue the British operations of Claire's, the accessories retailer, in a deal which is nevertheless likely to trigger scores of shop closures. Sky News has learnt that Modella Capital and Interpath Advisory, the administrator to Claire's UK and Irish operations, could announce a transaction as soon as Friday. Money latest: Sales process 'fixed' after Ticketmaster inquiry Industry sources said that while the deal would preserve parts of Claire's store portfolio, a significant number of shops are likely to be earmarked for closure subject to negotiations with suppliers and landlords. Jobs are also likely to be axed at Claire's UK head office as a result of Modella's plans, which sources said would include merging functions with those of its TG Jones - formerly WH Smith - and Hobbycraft businesses. Sky News revealed last week that Modella had agreed the outline of a deal with Claire's new US-based owner, private equity firm Ames Watson, paving the way for it to buy the UK chain. Modella saw off competition from rival bidders including Touker Suleyman, the Dragons' Den judge, and HMV-owner Doug Putman. \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  Money latest: HMRC can now take money direct from your account if you don't pay\n                 Claire's trades from 278 stores in the UK and 28 in Ireland, employing about 2,100 people across the combined estate. Interpath said last month it would keep all shops open while it assessed options for the business. Modella has emerged from nowhere to become the most prolific investor in bricks-and-mortar retailing in Britain in recent months. Read more from Sky News:JLR not insured for cyber attack, journal claimsCo-op reveals £80m cyber hit - with more to come It also owns The Original Factory Shop, with both that chain and Hobbycraft being put into formal restructuring processes after Modella acquired them. Claire's, which has been a fixture in British shopping centres and town centres for decades, is one of the biggest high street chains to fall into insolvency this year. It has a particular following among teenage shoppers. The company had been running a sale process prior to its appointment as administrators, but did not manage to secure a solvent deal. The retail industry has been left reeling by the employers' national insurance hike announced by Rachel Reeves, the chancellor, last autumn. Both Poundland and River Island recently survived creditor votes paving the way for them to slash rents and close dozens of stores. The collapse of Claire's UK operations came a week after its US parent company filed for Chapter 11 bankruptcy protection. The company had been owned by former creditors Elliott Management and Monarch Alternative Capital following a previous financial restructuring. Will Wright, UK chief executive at Interpath, said last month: \"Claire's has long been a popular brand across the UK, known not only for its trend-led accessories but also as the go-to destination for ear piercing. \"Over the coming weeks, we will endeavour to continue to operate all stores as a going concern for as long as we can, while we assess options for the company. \"This includes exploring the possibility of a sale which would secure a future for this well-loved brand.\" Interpath and Modella both declined to comment."
    },
    {
        "title": "Jaguar Land Rover was not insured for cyber attack, journal claims ",
        "description": "Jaguar Land Rover (JLR) \"failed to finalise\" a cyber insurance deal before it was struck by hackers last month, forcing a halt to production and threatening the  future of its supply chain, according to an industry journal.",
        "url": "https://news.sky.com/story/jaguar-land-rover-was-not-insured-for-cyber-attack-journal-claims-13437655",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jaguar-land-rover_7014411.jpg?20250908133052",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-25 04:49:00",
        "Headline": "If true, it leaves the company facing the prospect of footing the bill for the hacking itself as ministers are said to be examining the first taxpayer support for its supply chain.",
        "Content": "Jaguar Land Rover (JLR) \"failed to finalise\" a cyber insurance deal before it was struck by hackers last month, forcing a halt to production and threatening the  future of its supply chain, according to an industry journal. The Insurer, citing three insurance sector sources, said Britain's biggest carmaker was still in negotiations over cover before the cyber attack at the end of August. It opens the prospect that the company faces footing the bill for the hacking by itself. Losses will easily run into many hundreds of millions of pounds, with its global factory shutdown set to last for a month at least. Money latest: Rich Britons reveal the taxes they hate most  Marks and Spencer, which was targeted back in April, said it expected that the estimated £300m bill it was facing from the disruption would be largely offset by the cyber insurance cover it had taken out. As frantic efforts continue at JLR to recover its systems, the government is exploring ways to support JLR's supply chain and the 200,000 jobs within it. \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  WH Smith buyer Modella clinches deal for Claire's\n                 One idea under consideration, according to ITV News, was taxpayer money being used to purchase parts. These components could then be sold back to JLR as its manufacturing operations got back up to speed, resulting in no direct losses for the public purse.  The \"just-in-time\" nature of automotive production means that many suppliers had little choice but to shut down immediately after JLR announced its manufacturing freeze. Industry sources estimate that around 25% of suppliers have already taken steps to pause production and lay off workers, many of them by \"banking hours\" they will have to work in future. Union demands for a COVID-style furlough scheme have not been taken up by ministers, who have said that support to date has come only from JLR. Industry minister Chris McDonald said on a visit to a West Midlands manufacturer on Tuesday he was \"supremely confident\" that JLR would get through the cyber attack. He added: \"What I really want this to be is a wake-up call to British industry. I'm affronted by this attack on British industry. This is a serious attack on a flagship of British industry.\" Jaguar Land Rover said it declined to comment on commercial matters when asked about its insurance cover. The government has also been approached for comment."
    },
    {
        "title": "Should you put money in savings or pension? It depends exactly how old you are",
        "description": "In a special edition of the savings guide, April Leeson, financial adviser at The Private Office, discusses whether earners should pay into pensions or savings accounts, alongside our usual top rates tables...",
        "url": "https://news.sky.com/story/savings-guide-should-you-put-money-in-savings-or-pension-it-depends-exactly-how-old-you-are-13437769",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-savings-pension-money-blog_7031020.jpg?20250925082040",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-25 08:55:00",
        "Headline": "Every Wednesday in our Money blog, we take a look at what's happening in the savings market. In this special edition, we discuss how best to spread your cash across savings and pensions.",
        "Content": "In a special edition of the savings guide, April Leeson, financial adviser at The Private Office, discusses whether earners should pay into pensions or savings accounts, alongside our usual top rates tables... The balance between how much you deposit into a pension or cash savings depends heavily on what stage of life you are in, how much you can afford and what access you might need and when. It's advantageous for younger people to prioritise pensions for long-term growth because compound returns over decades mean they can afford to take more equity risk. But savings should still be maintained as an emergency fund (with a pot worth three to six months of your expenses recommended). Cash can also be vital for expenses like saving for a deposit on a home. Read all the latest Money news here For people in middle age, balance becomes key. \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  WH Smith buyer Modella clinches deal for Claire's\n                 It's important to keep building pensions but also to increase savings to create a buffer against risk when you begin making withdrawals. You would normally earn more as your career develops, so you should have more available to put into your pension, and you could benefit even more from tax relief. Cash savings are essential for retirees for covering short-term living costs, enjoying their retirement years and future healthcare needs. Pensions remain important for long-term income, but withdrawals must be managed carefully so that you don't unwittingly pay too much tax. For a look at the best up-to-date savings options, see below - or scroll down to find out more about the pros and cons of savings v pensions... Advantages of pensions Long-term growth: Investments within pensions can usually outperform cash savings over the long run, helping to keep pace with or to beat inflation. Tax benefits: Pension contributions usually receive tax relief at the basic rate of income tax or your own marginal rate, boosting the amount invested. So, for each £80 invested, you'll receive £20 tax relief. If you're a higher rate or additional rate taxpayer, you can claim back the extra from HMRC through self-assessment. You can save on national insurance contributions by contributing to a pension via salary sacrifice, too. If you were to die before age 75, a pension can provide longer-term income tax benefits for your beneficiaries. Pension funds grow tax-free: All returns are free of income tax (until you withdraw), as well as capital gains tax and dividend tax. Company contributions: Your employer will pay into your pension, too. Retirement income: Pensions are designed specifically to provide an income in retirement, for you and your spouse (on death), through structured withdrawal strategies, with a quarter of the pension being entirely tax-free - as a tax-free cash lump sum - up to a maximum of £268,275. Disadvantages of pensions Access restrictions: You usually cannot access pension funds until a set age. Market risks: Investment returns fluctuate. Timing withdrawals badly can erode value. Complexity: Managing pension investments often requires careful planning and regular reviews, as legislation changes and allowances move around. Advantages of savings  Liquidity: Cash savings are immediately accessible, useful for emergencies or short-term needs. Short-term returns: Higher interest rates mean cash savingshave become more attractive. Personal Savings Allowance: For basic-rate taxpayers, up to £1,000 of interest can be earned tax-free per year. It's £500 for higher-rate taxpayers. Disadvantages of savings Inflation risk: Over time, cash can lose value in real terms. Taxable interest: Interest on large savings can push earners into a higher tax bracket without realising. Lower returns: Savings accounts do not grow wealth likeinvestments or pensions do. According to JP Morgan Asset Management, cash has been the worst-performing asset class against inflation since 1900."
    },
    {
        "title": "Jaguar Land Rover cyber attack: No easy options for taxpayer aid",
        "description": "Ministers are considering offering financial support to Jaguar Land Rover's suppliers but are understood at this stage to have ruled out a broad furlough-style scheme for their employees.",
        "url": "https://news.sky.com/story/jaguar-land-rover-cyber-attack-no-easy-options-for-taxpayer-aid-13437670",
        "image_url": "https://e3.365dm.com/24/02/1920x1080/skynews-solihull-land-rover_6456328.jpg?20240215103749",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-09-25 06:03:00",
        "Headline": "Sky's Paul Kelso writes that the complexities of JLR's 'just in time' supply chain make helping hundreds of companies, while maintaining taxpayer value, a difficult prospect.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n Ministers are considering offering financial support to Jaguar Land Rover's suppliers but are understood at this stage to have ruled out a broad furlough-style scheme for their employees. JLR, Britain's largest car manufacturer, has been debilitated by a malicious cyber attack, with production lines in the UK, India, Slovakia and Brazil shutdown since the start of September, and scheduled to be closed until at least the start of next month. The prolonged shutdown of its assembly lines and engine manufacturing in the midlands and on Merseyside poses enormous risks for the hundreds of companies in its supply chain. Money latest: Rich Britons reveal the taxes they hate most Around a quarter of those companies are already laying off temporary staff and restricting permanent hires to short hours, with another quarter thought to be facing similar decisions in the next week. At one major supplier some staff have been reduced to working zero hours, others cut back to half their paid hours, and others told they are free to seek temporary work elsewhere until production resumes.  Business secretary Peter Kyle, who only took up the post five days into the shutdown, has been under mounting pressure to act since it became clear JLR faces a prolonged closure. \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  WH Smith buyer Modella clinches deal for Claire's\n                 That is only likely to have intensified if a report that JLR had no cyber insurance cover is true. He is understood to be willing to offer financial support and is considering a range of options. One proposal, first reported by ITV News, is for the government to buy stock from suppliers in order to provide them with cash flow, and then sell it on to JLR when it resumes production.  That would be deeply complex given the just-in-time nature of the supply chain, with JLR unable to store parts and no guarantee they would all be required when production resumes. It would also be hard to discriminate between the major multi-national companies in the supply chain, who arguably have the cash flow to support their local operations, and smaller companies in the lower tiers of JLRs supply chain at a real risk of bankruptcy. While smaller suppliers are already laying off staff and struggling with cash flow others are unaffected. Japanese company Denso, the world’s second-largest car parts supplier with turnover of more than $45bn last year, told Sky News: \"As of now, our operations and supply in the UK are continuing as usual and there have been no layoffs or production stoppages at our facilities.\"   Unions have called for a furlough scheme similar to that operated during the pandemic to be offered to the auto supply chain, but sources have indicated that is not considered the right option. It would come with significant cost and carry the same risk of offering indiscriminate support rather than targeting those smaller firms most at risk. Mr Kyle and industry minister Chris McDonald visited JLR and some of its suppliers on Tuesday. Speaking to Sky News Mr McDonald said they were \"mapping the supply chain\" to assess where help might be required, but indicated that he considered JLR should take responsibility for supporting companies: \"This is JLR's supply chain,\" he said. While unions favour intervention, any decision to deploy taxpayer funds would have to be justified against JLR’s own resources. The company made profits of £2.5bn last year and is backed by Tata, the giant Indian conglomerate that has received close to £1bn in state support for its other UK concerns in the past 18 months, including a battery factory in Somerset and the electrification of the Port Talbot steelworks. JLR cannot say how long they will be closed, but they will need the supply chain when the production lines start rolling again. "
    },
    {
        "title": "Payments firm Ebury to revive £2bn London float next year",
        "description": "Ebury, the payments company backed by Spanish banking giant Santander, is drawing up plans to revive a &#163;2bn London flotation in the first half of next year.",
        "url": "https://news.sky.com/story/payments-firm-ebury-to-revive-1632bn-london-float-next-year-13437799",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-london-skyline-city_6961956.jpg?20250710153801",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-25 09:37:00",
        "Headline": "Advisers to the Santander-owned cross-border payments company have pencilled in the spring of 2026 to resurrect an initial public offering, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ebury, the payments company backed by Spanish banking giant Santander, is drawing up plans to revive a £2bn London flotation in the first half of next year. Sky News has learnt that Ebury's board and its investment banking advisers have tentatively pencilled in the second quarter of 2026 to resurrect an initial public offering of the business. Its original plan to go public earlier this year was derailed by the market volatility caused by President Donald Trump's global tariffs regime, with the IPO window not being deemed sufficiently open this autumn to render an Ebury flotation viable. Money latest: Sales process 'fixed' after Ticketmaster inquiry City sources said that the spring of next year was now being discussed between Ebury's board and bankers as a potential launch date. Ebury, which handles cross-border payments for small businesses, is expected to seek a valuation of around £2bn, with Santander thought to be unlikely to proceed with an IPO if that figure is not attainable. Banks, including Barclays, Goldman Sachs and Peel Hunt, have been engaged to work on the deal. \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  WH Smith buyer Modella clinches deal for Claire's\n                 Read more from Sky News:JLR not insured for cyber attack, journal claimsCo-op reveals £80m cyber hit - with more to come Bruce Carnegie-Brown, the City grandee who until recently was chairman of Lloyd's of London, was appointed last year as Ebury's chairman. The payments firm is one of a cluster of companies whose flotations in London could spark a broader revival of the City's IPO pipeline after a protracted fallow period. Among the other listing candidates are Shawbrook Group, the bank, and New Princes, the canned food manufacturer. Ebury declined to comment."
    },
    {
        "title": "Co-op reveals £80m profit hit from cyber attack disruption - with more to come",
        "description": "A cyber attack in April delivered an &#163;80m hit to half-year operating profits at the Co-operative Group, it has been revealed.",
        "url": "https://news.sky.com/story/co-op-reveals-16380m-profit-hit-from-cyber-attack-disruption-with-more-to-come-13437683",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-yoghurt-yogurt-coop_5747023.jpg?20220422024153",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-09-25 06:33:00",
        "Headline": "The mutual expects a further hit to its earnings across the rest of its financial year, with insurance policies failing to offset much of the damage from April's attack.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n A cyber attack in April delivered an £80m hit to half-year operating profits at the Co-operative Group, it has been revealed. The results showed an underlying pre-tax loss of £75m over the six months to 5 July compared with a profit of £3m over the same period a year ago. The £80m figure included a £20m hit from one-off costs. The impact of the attack on sales revenue was estimated at £206m. Money latest: Rich Britons reveal the taxes they hate most While the mutual had insurance cover for operational disruption, it did not have a policy to meet full losses arising from a cyber incident. It further revealed that the total profit damage was expected to nudge £120m over its full financial year. Co-op was among several retailers hit in April, including M&S, and all its members had data stolen. \n                  Many small firms reliant on Jaguar Land Rover have 'weeks left' before damage 'untenable'\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  WH Smith buyer Modella clinches deal for Claire's\n                 In-store, customers faced problems making payments initially and latterly empty shelves as the group struggled to restore control of key systems. It prioritised rural stores for limited deliveries until stocks recovered in late May.  Co-op chair Debbie White said: \"The first half of 2025 brought significant challenges, most notably from a malicious cyber attack. \"Our balance sheet strength and the magnificent response of our 53,000 colleagues enabled us to maintain vital services for our members and their communities. \"We must now build our Co-op back better and stronger to meet the challenges and opportunities that lie ahead.\" The attacks on the retailers, which have resulted in four arrests, have brought the insurance issue to the fore as Jaguar Land Rover battles the impact of a similar attack. Its factories are currently on track to produce nothing for at least a month and the government is now actively considering some kind of taxpayer support for its vast supply chain. It has been reported that it was in discussions over cyber cover when its systems came under attack at the end of August. Like the Co-op, it leaves the company facing the prospect of meeting many of the costs itself. M&S put a £300m cost on the ransomware attack on its own systems ahead of Easter but expects to claw much of that money back through insurance payouts. The government has this week described the run of hacking attempts as a further wake-up call to the business community and urged continued investment in cyber security."
    },
    {
        "title": "Now is moment of 'maximum danger' for Sir Keir Starmer, Harriet Harman warns",
        "description": "Now is the moment of \"maximum danger\" for Sir Keir Starmer, Harriet Harman has warned.",
        "url": "https://news.sky.com/story/now-is-moment-of-maximum-danger-for-sir-keir-starmer-harriet-harman-warns-13438032",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-electoral-dysfunction_7031470.png?20250925154735",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-25 14:37:00",
        "Headline": "Greater Manchester mayor Andy Burnham has said Labour MPs have urged him to challenge Sir Keir's leadership.",
        "Content": " Now is the moment of \"maximum danger\" for Sir Keir Starmer, Harriet Harman has warned. The Labour peer told Beth Rigby on the Electoral Dysfunction podcast \"everyone really wants Keir Starmer to succeed\" after Greater Manchester's Labour mayor, Andy Burnham, said Labour MPs have been urging him to challenge Sir Keir's premiership. Baroness Harman, who was a Labour MP for 42 years, said this was always \"going to be the most difficult time\" because people are \"fed up\" with hearing it is the Tories' fault, \"yet they're not feeling better off\". \"So this was always going to be the moment of maximum danger,\" she said. \"But I think that what people want is for Keir Starmer to succeed. And they don't want, I think at this point, the turbulence of a leadership challenge.\" 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 She said Mr Burnham, who was in Gordon Brown's cabinet with her, is \"not hiding his light under a bushel in any way, shape or form\". \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 But added: \"I do not want the drama and chaos of a leadership election. \"It's like 'this guy hasn't done it, so we're going to try somebody else'. You know, everybody really wants Keir Starmer to succeed.\" Read more: Could Andy Burnham be a serious threat to Starmer? Baroness Harman said she thinks the \"anxiety\" around Nigel Farage getting into Number 10 is \"fuelling\" the push for Mr Burnham to challenge Sir Keir. \"Keir Starmer would come out absolutely swinging,\" she added. But she admitted Mr Burnham is \"something of a vote whisperer\" and is a very different person from when he served in Gordon Brown's cabinet with her. She said: \"He has actually grown in that position [as mayor] and is something of a vote whisperer. \"Every single ward which was up for contest in the mayoralty of Greater Manchester, he won, including the die-hard Tory areas. \"So you know, he has grown, and it's good to see people grow in politics.\"  This week, Mr Burnham said Labour MPs had contacted him over the summer when asked if they had encouraged him to try to challenge Sir Keir. He told The Telegraph: \"I'm not going to say to you that that hasn't happened. \"But as I say, it's more a decision for those people than it is for me.\" He added: \"I stood twice to be leader of the Labour Party. And I think that tells you, doesn't it?\" As he is not currently an MP, Mr Burnham would have to win a by-election to be able to challenge Sir Keir. There are none on the horizon, yet. Listen to the full episode of Electoral Dysfunction on Friday morning."
    },
    {
        "title": "Starmer to unveil plan for digital ID cards to crack down on illegal immigration ",
        "description": "Every adult in Britain will require a digital ID under plans to tackle illegal immigration. ",
        "url": "https://news.sky.com/story/starmer-to-unveil-plan-for-digital-id-cards-to-crack-down-on-illegal-immigration-13438007",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-northern-ireland_7025482.jpg?20250919183418",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-25 13:57:00",
        "Headline": "The so-called \"Brit card\" would verify a citizen's right to live and work in the UK.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Every adult in Britain will require a digital ID under plans to tackle illegal immigration.  Writing for The Daily Telegraph, Sir Keir Starmer said the government would make a \"new, free-of-charge digital ID that would be mandatory for the right to work by the end of this parliament\". Sky News earlier reported that the prime minister was due to announce his backing for the scheme in a speech on Friday. The idea behind the so-called \"Brit card\" is that it would verify a citizen's right to live and work in the UK. The plans would require anyone starting a new job or renting a home to show the card on a smartphone app, which would then be checked against a central database of those entitled to work and live here. It is hoped this would reduce the attraction of working in the UK illegally, including for delivery companies. At the moment, workers have to show at least one form of physical ID in the form of documents, but there are concerns within government that these can be faked. \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 French President Emmanuel Macron has repeatedly warned that the lack of ID cards in the UK acts as a major pull factor for Channel crossings, as migrants feel they are able to find work in the black economy. Politics Live: Andy Burnham says Labour MPs want him to oust Starmer Sir Keir is expected to flesh out more details in a speech at the Global Progress Action Summit in London on Friday, when he will argue that relying on migration to plug workforce gaps \"is not compassionate left-wing politics\". The plan represents a shift in the government's position, as last year ministers ruled out the idea following an intervention from Sir Tony Blair just days after Labour won the general election. The former Labour prime minister has long been an advocate of ID cards and took steps to introduce a system that would begin as voluntary and could later become compulsory while in office. The rollout was scrapped after Labour was ejected from power in 2010, having been opposed by the Liberal Democrats and the Tories at the time. Last July, then Home Secretary Yvette Cooper said of the idea: \"It's not in our manifesto. That's not our approach.\" The UK has only previously had mandatory ID cards during wartime, with the last tranche scrapped in 1952. The idea has long been opposed by civil liberty and privacy groups in the UK. Sir Keir is said to have shared their concerns but came round to the idea amid record high levels of small boat crossings. A report by the Tony Blair Institute published on Wednesday said digital ID can \"help close loopholes that trafficking gangs and unscrupulous employers currently exploit, reducing pull factors driving illegal migration to Britain and restoring control over borders\". Labour Together, a Starmer-backed thinktank, published a report in June which said digital ID could play a role in right-to-work and right-to-rent checks, supporting \"better enforcement of migration rules\". How would digital ID work? There is no unique regime for identity cards, but decisions the government would have to make include who is required to register, how much information they should hold, and whether physical forms of the ID should also be made available. Pat McFadden, now the work and pensions secretary, started a cross-government unit to look at how it could work while he was in charge of the cabinet office. He visited Estonia last month, before the cabinet reshuffle, where he said the Baltic country's model could be used as an example. In Estonia, citizens are given a unique number at birth which they use to register marriages, access bank accounts, vote, book GP appointments, file their tax return and even collect supermarket loyalty points, among hundreds of other services. Mr McFadden told The Times digital ID could be applied \"to the immigration system, to the benefit system, to a number of areas\". 'Checkpoint society' The government's plan will be subject to a consultation and would require legislation to be passed, before being rolled out. Labour MPs on the left of the party have already hit out at the idea. Nadia Whittome labelled the policy \"divisive, authoritarian nonsense\", adding: \"If we're going to reheat Blair-era policies, can we please focus on lifting children out of poverty?\" Reform UK and the Tories are also against the proposal, arguing it will not stop small boat crossings. The Lib Dems meanwhile said they were against the principle of people being \"forced to turn over their private data just to go about their daily lives\". The civil liberty group Big Brother Watch said: \"Plans for a mandatory digital ID would make us all reliant on a digital pass to go about our daily lives, turning us into a checkpoint society that is wholly unBritish.\""
    },
    {
        "title": "The pros and cons of digital IDs - and do we need them?",
        "description": "Fans of digital ID cards argue that they will speed the UK into a digital future by giving everyone a way to prove who they are.",
        "url": "https://news.sky.com/story/do-we-need-digital-ids-in-the-uk-13438109",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-labour-together-britcard_7031496.jpg?20250925161002",
        "type": "Politics",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-09-25 16:17:00",
        "Headline": "A sweeping shake-up of how the government handles our data could potentially address many of the problems of the current system. But whether No 10 can achieve its goals is another matter entirely.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n Fans of digital ID cards argue that they will speed the UK into a digital future by giving everyone a way to prove who they are. What's confusing about this argument is that we can do that already. We have physical ID cards in the form of passports and driving licences. We also have an extensive system of digital identification and a whole range of laws that require you to prove your identity, sometimes multiple times a week. If you've employed someone recently, even for a few days, you'll know that you have to check their right to work documents, either physically or digitally. It's the same if you open a bank account, hire a solicitor, file a tax return, vote in an election or apply to get government services like Universal Credit. These days, even accessing pornographic content online requires an identity check. The trouble, from a government point of view, is that none of these systems are joined together, which makes it possible to slip through the gaps. Despite all the checks, for instance, illegal immigrants regularly get access to bank accounts. The Home Office is meant to share its data with banks and building societies to stop this happening, but the information is often incomplete or just plain wrong: that's why the system had to be paused for four years after the Windrush scandal came to light. Read more from Sky News:Vaccine giant opens new UK factoryBritish lawyer killed in Los AngelesFormer French president jailed A truly efficient system would clean this kind of data, link it up, and connect it in one sweeping overview. But that would require the creaking civil service to access information that's often hard to find, let alone share. Much easier - or so advocates of ID cards say - to sweep the old bureaucracy aside and begin again with a single central system. The result, they say, would be a system that's faster and more reliable for citizens. But mainly this is a piece of infrastructure that, its proponents hope, would make government function in the way it's supposed to. All of which raises the question - do we actually want that? Do we want a government that can track us in every part of our lives? That can actually enforce the law, in a way it has no hope of doing currently? The government believes the answer is yes. Their focus groups and polling tell them that people are sick and tired of failing government systems and desperate for decisive action, especially on immigration.  That's why the bigger risk in all this might not be the politics but the delivery. Can they make sure this system is built on budget and without massive delays? Can they get it operating at scale without suffering a hack or a major technical glitch? Can they show people that the problem is the current system, not the way it is being used? This is a task that even Google or Amazon would quail at. One that makes HS2 look easy. Yet Whitehall - not known for its tech expertise - might be asked to take it on, perhaps in time for the next election."
    },
    {
        "title": "Starmer to unveil plan for digital ID cards to crack down on illegal immigration ",
        "description": "Every adult in Britain will require a digital ID under plans to tackle illegal immigration. ",
        "url": "https://news.sky.com/story/starmer-to-unveil-plan-for-digital-id-cards-to-crack-down-on-illegal-immigration-13438007",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-keir-starmer-northern-ireland_7025482.jpg?20250919183418",
        "type": "Technology",
        "Author": "Faye Brown",
        "Date Published": "2025-09-25 13:57:00",
        "Headline": "The so-called \"Brit card\" would verify a citizen's right to live and work in the UK.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Every adult in Britain will require a digital ID under plans to tackle illegal immigration.  Writing for The Daily Telegraph, Sir Keir Starmer said the government would make a \"new, free-of-charge digital ID that would be mandatory for the right to work by the end of this parliament\". Sky News earlier reported that the prime minister was due to announce his backing for the scheme in a speech on Friday. The idea behind the so-called \"Brit card\" is that it would verify a citizen's right to live and work in the UK. The plans would require anyone starting a new job or renting a home to show the card on a smartphone app, which would then be checked against a central database of those entitled to work and live here. It is hoped this would reduce the attraction of working in the UK illegally, including for delivery companies. At the moment, workers have to show at least one form of physical ID in the form of documents, but there are concerns within government that these can be faked. \n                  Politics latest: Starmer compares Burnham to Truss amid leadership threat\n                 \n                  What does Andy Burnham want?\n                 \n                  Could Andy Burnham be a serious threat to Sir Keir Starmer?\n                 French President Emmanuel Macron has repeatedly warned that the lack of ID cards in the UK acts as a major pull factor for Channel crossings, as migrants feel they are able to find work in the black economy. Politics Live: Andy Burnham says Labour MPs want him to oust Starmer Sir Keir is expected to flesh out more details in a speech at the Global Progress Action Summit in London on Friday, when he will argue that relying on migration to plug workforce gaps \"is not compassionate left-wing politics\". The plan represents a shift in the government's position, as last year ministers ruled out the idea following an intervention from Sir Tony Blair just days after Labour won the general election. The former Labour prime minister has long been an advocate of ID cards and took steps to introduce a system that would begin as voluntary and could later become compulsory while in office. The rollout was scrapped after Labour was ejected from power in 2010, having been opposed by the Liberal Democrats and the Tories at the time. Last July, then Home Secretary Yvette Cooper said of the idea: \"It's not in our manifesto. That's not our approach.\" The UK has only previously had mandatory ID cards during wartime, with the last tranche scrapped in 1952. The idea has long been opposed by civil liberty and privacy groups in the UK. Sir Keir is said to have shared their concerns but came round to the idea amid record high levels of small boat crossings. A report by the Tony Blair Institute published on Wednesday said digital ID can \"help close loopholes that trafficking gangs and unscrupulous employers currently exploit, reducing pull factors driving illegal migration to Britain and restoring control over borders\". Labour Together, a Starmer-backed thinktank, published a report in June which said digital ID could play a role in right-to-work and right-to-rent checks, supporting \"better enforcement of migration rules\". How would digital ID work? There is no unique regime for identity cards, but decisions the government would have to make include who is required to register, how much information they should hold, and whether physical forms of the ID should also be made available. Pat McFadden, now the work and pensions secretary, started a cross-government unit to look at how it could work while he was in charge of the cabinet office. He visited Estonia last month, before the cabinet reshuffle, where he said the Baltic country's model could be used as an example. In Estonia, citizens are given a unique number at birth which they use to register marriages, access bank accounts, vote, book GP appointments, file their tax return and even collect supermarket loyalty points, among hundreds of other services. Mr McFadden told The Times digital ID could be applied \"to the immigration system, to the benefit system, to a number of areas\". 'Checkpoint society' The government's plan will be subject to a consultation and would require legislation to be passed, before being rolled out. Labour MPs on the left of the party have already hit out at the idea. Nadia Whittome labelled the policy \"divisive, authoritarian nonsense\", adding: \"If we're going to reheat Blair-era policies, can we please focus on lifting children out of poverty?\" Reform UK and the Tories are also against the proposal, arguing it will not stop small boat crossings. The Lib Dems meanwhile said they were against the principle of people being \"forced to turn over their private data just to go about their daily lives\". The civil liberty group Big Brother Watch said: \"Plans for a mandatory digital ID would make us all reliant on a digital pass to go about our daily lives, turning us into a checkpoint society that is wholly unBritish.\""
    },
    {
        "title": "Donald Trump signs order on TikTok to pave way for US ownership",
        "description": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States.",
        "url": "https://news.sky.com/story/donald-trump-signs-order-on-tiktok-to-pave-way-for-us-ownership-13438247",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-donald-trump-tiktok_7031798.jpg?20250925222852",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-25 20:43:00",
        "Headline": "Mr Trump, who held talks with China's President Xi Jinping last week, has repeatedly credited TikTok with helping him win re-election.",
        "Content": "Donald Trump has signed an executive order on TikTok, which will allow the app to continue to operate in the United States. The US president held talks with China's President Xi Jinping last week - where the pair discussed the final terms of a deal. The app was ordered to shut down for American users by January 2025 if its Chinese owner - Beijing-based tech firm ByteDance - didn't sell its assets in the country. The ban was delayed four times by Mr Trump. The deal, which vice president JD Vance said was valued at around $14bn (£10.5bn), will see TikTok's US operations run by a new joint-venture company, with ByteDance holding less than 20% of the stock, a senior White House official said prior to the deal being signed. \"There was some resistance on the Chinese side, but the fundamental thing that we wanted to accomplish is that we wanted to keep TikTok operating, but we also wanted to make sure that we protected Americans' data privacy as required by law,\" Mr Vance said. Mr Trump said: \"I spoke with President Xi. We had a good talk, I told him what we were doing, and he said go ahead with it.\" American officials have previously warned that TikTok's algorithm - a complex system of rules and calculations that platforms use to deliver content to people's feeds - is vulnerable to manipulation by Chinese authorities. However, no evidence has ever been presented by US officials showing that Beijing has attempted to do this. Concerns have also been raised about user data being shared with the Chinese government - something ByteDance has said it does not and would never do. Mr Trump attempted to ban TikTok during his first term in the White House, but has repeatedly credited the app, which has 170 million US users, with helping him win re-election. The White House also launched an official TikTok account last month. Mr Trump said media mogul Rupert Murdoch and \"probably four or five absolutely world-class investors\" would be part of the deal. This also includes Oracle co-founder Larry Ellison. Both Mr Ellison and Mr Murdoch have political and business ties to Mr Trump, raising fresh questions about potential political influence on the platform. Questions still remain over how the deal works, but Mr Trump said China's leader, Xi Jinping, has approved it. Around 43% of US adults under the age of 30 say they regularly consume news from TikTok, higher than any other social media app, including YouTube, Facebook and Instagram, according to a Pew Research Centre report."
    },
    {
        "title": "The pros and cons of digital IDs - and do we need them?",
        "description": "Fans of digital ID cards argue that they will speed the UK into a digital future by giving everyone a way to prove who they are.",
        "url": "https://news.sky.com/story/do-we-need-digital-ids-in-the-uk-13438109",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-labour-together-britcard_7031496.jpg?20250925161002",
        "type": "Technology",
        "Author": "Rowland Manthorpe",
        "Date Published": "2025-09-25 16:17:00",
        "Headline": "A sweeping shake-up of how the government handles our data could potentially address many of the problems of the current system. But whether No 10 can achieve its goals is another matter entirely.",
        "Content": "\n          Technology correspondent\n              @rowlsmanthorpe\n Fans of digital ID cards argue that they will speed the UK into a digital future by giving everyone a way to prove who they are. What's confusing about this argument is that we can do that already. We have physical ID cards in the form of passports and driving licences. We also have an extensive system of digital identification and a whole range of laws that require you to prove your identity, sometimes multiple times a week. If you've employed someone recently, even for a few days, you'll know that you have to check their right to work documents, either physically or digitally. It's the same if you open a bank account, hire a solicitor, file a tax return, vote in an election or apply to get government services like Universal Credit. These days, even accessing pornographic content online requires an identity check. The trouble, from a government point of view, is that none of these systems are joined together, which makes it possible to slip through the gaps. Despite all the checks, for instance, illegal immigrants regularly get access to bank accounts. The Home Office is meant to share its data with banks and building societies to stop this happening, but the information is often incomplete or just plain wrong: that's why the system had to be paused for four years after the Windrush scandal came to light. Read more from Sky News:Vaccine giant opens new UK factoryBritish lawyer killed in Los AngelesFormer French president jailed A truly efficient system would clean this kind of data, link it up, and connect it in one sweeping overview. But that would require the creaking civil service to access information that's often hard to find, let alone share. Much easier - or so advocates of ID cards say - to sweep the old bureaucracy aside and begin again with a single central system. The result, they say, would be a system that's faster and more reliable for citizens. But mainly this is a piece of infrastructure that, its proponents hope, would make government function in the way it's supposed to. All of which raises the question - do we actually want that? Do we want a government that can track us in every part of our lives? That can actually enforce the law, in a way it has no hope of doing currently? The government believes the answer is yes. Their focus groups and polling tell them that people are sick and tired of failing government systems and desperate for decisive action, especially on immigration.  That's why the bigger risk in all this might not be the politics but the delivery. Can they make sure this system is built on budget and without massive delays? Can they get it operating at scale without suffering a hack or a major technical glitch? Can they show people that the problem is the current system, not the way it is being used? This is a task that even Google or Amazon would quail at. One that makes HS2 look easy. Yet Whitehall - not known for its tech expertise - might be asked to take it on, perhaps in time for the next election."
    },
    {
        "title": "Amazon agrees historic $2.5bn settlement for allegedly duping customers into Prime membership",
        "description": "Amazon has reached a historic $2.5bn (&#163;1.9bn) settlement with a US business watchdog over allegations it tricked customers into signing up for Prime membership.",
        "url": "https://news.sky.com/story/amazon-agrees-historic-25bn-settlement-for-allegedly-duping-customers-into-prime-membership-13438160",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-amazon-prime_7031648.jpg?20250925194503",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-09-25 18:26:00",
        "Headline": "The Federal Trade Commission (FTC) accused Amazon of tricking customers into its Prime membership, and making it difficult to unsubscribe. ",
        "Content": "Amazon has reached a historic $2.5bn (£1.9bn) settlement with a US business watchdog over allegations it tricked customers into signing up for Prime membership. The Federal Trade Commission (FTC) accused the online giant of tricking customers into the membership scheme - which includes perks like faster delivery - and then making it difficult to cancel. The Seattle-based company will pay $1bn (£750m) in civil penalties, and $1.5bn (£1.1bn) paid back to customers unintentionally enrolled in Prime or deterred from cancelling their subscriptions. Around 35 million Prime customers will be eligible for a payout from the $1.5bn (£1.1bn) fund, the FTC said. Customers who signed up for Prime between 23 June, 2019, and 23 June, 2025, through certain offers, and used few Prime benefits afterwards, will automatically receive $51 (£38). The FTC accused Amazon of making it deliberately difficult for customers to purchase an item without also subscribing to Prime. It added that customers were, in some cases, presented with a button to complete their transactions, which did not clearly state that it would enrol them into Prime. Getting out of a subscription was often too complicated, and Amazon slowed or rejected changes that would have made cancelling easier, according to an FTC complaint. The process of unsubscribing, requiring customers to affirm on three pages their desire to quit, was referred to internally as \"Iliad\", an ancient Greek epic by Homer about the Trojan War, according to the watchdog's complaint. The settlement came just days after a trial began in Seattle this week. Chris Mufarrige, director of the Bureau of Consumer Protection, said: \"I think it just took a few days for them to see that they were going to lose. And they came to us and they paid out.\" Amazon, which admitted no wrongdoing in the case filed two years ago, said it was confident it would win the case but chose to resolve it quickly rather than going through potentially years of trial and appeal. Amazon spokesman, Mark Blafkin, said: \"Amazon and our executives have always followed the law and this settlement allows us to move forward and focus on innovating for customers. \"We work incredibly hard to make it clear and simple for customers to both sign up or cancel their Prime membership, and to offer substantial value for our many millions of loyal Prime members around the world.\" Under the settlement, Amazon is prohibited from misrepresenting the terms of the subscriptions. It must fully disclose the costs to be incurred and obtain the customer's express consent for the charge, with a clear option for customers to accept or decline a Prime subscription offered during purchase and avoid language deemed confusing, such as: \"No thanks, I don't want free shipping.\" Amazon said the settlement does not require it to make any additional changes, only to maintain its current sign-up and cancellation process that it had put in place for a year."
    },
    {
        "title": "China does targets differently to the West - and it may be just what the world needs",
        "description": "There is something peculiar about the Chinese government that makes its targets very different to those in countries like Britain.",
        "url": "https://news.sky.com/story/china-does-targets-differently-to-the-west-and-it-may-be-just-what-the-world-needs-13437634",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-china-climate-xi-jinping_7030943.jpg?20250925013734",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-09-25 00:12:00",
        "Headline": "China is the world's biggest greenhouse gas emitter, but is also a clean energy superpower. The regime there will be key to any global effort to tackle climate change.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n There is something peculiar about the Chinese government that makes its targets very different to those in countries like Britain. That quirk gives analysts some hope after it's \"timid\" announcement on the green transition - and as Donald Trump yesterday condemned climate change as a \"hoax\". The good news is that China has, for the first time, made a commitment to cut its greenhouse gas emissions. It's a landmark moment. In a video statement to the UN in New York, President Xi Jinping vowed China would cut emissions by 7-10% by 2035, while \"striving to do better\". But it is still \"critically short\" of the roughly 30% believed to be necessary from the world's biggest greenhouse gas polluter and clean tech superpower, analysts said. Juan Manuel Santos, former president of Colombia and chair of The Elders, a group of global leaders founded by Nelson Mandela, said: \"China's latest climate target is too timid given the country's extraordinary record on clean energy - both at home and through its green partnerships with emerging economies.\" Read more: Super typhoon hits China  China also chose not to say when it thinks its emissions will peak - allowing plenty of time for them to keep rising before they then fall. But here's why all is not lost - far from it. In the West, targets are often aspirational. They are knowingly optimistic, sometimes wildly so, because the purpose isn't necessarily to hit them. Instead, they are designed to provide some certainty to investors, energy companies, local authorities and so on about where the country is headed, stimulating them all to kick into gear.  'Taking targets seriously' The Chinese work differently. In fact, they have a record over under promising and over delivering on climate targets. Why? \"In China's top-down political system, setting and evaluating targets is a key means through which the central government manages the country,\" says Zhe Yao from Greenpeace Asia. \"As a result, there is a strong political culture of taking targets seriously. This mentality means policymakers usually take a realistic approach to setting targets rather than treating them as aspirations.\" Just look at their wind and solar rollout: meeting a target of 1,200GW by 2030 six years early. Today they pledged to more than double today's capacity of around 1,400GW to 3,600GW by 2035 - rates many countries can only dream of. There are other targets China has missed - such as to \"strictly control\" coal power - but still that record gives analysts hope. Another ray of light is the fact that it was delivered by Xi himself - this is perceived as the commitment being more serious than if it was delivered by anyone else. And \"striving to better\" sounds weasley, but suggests they aim to overachieve, and again should be taken more seriously from President Xi than perhaps we would from other leaders. US and EU fall short China is far from alone in disappointing with its pledge, made as a part of its latest five-year climate plan (known as nationally determined contribution or NDC), something all countries are doing this year as per the Paris Agreement. The US government under Trump has ditched climate action altogether. The EU, which thinks of itself as ambitious, failed to come up with its own plan on time, effectively coming to the UN this week with an \"I Owe You\" instead. With other leaders faltering, there was less heat on Beijing to step up. Even the 10% reduction in emissions will \"still put the world on a pathway to catastrophic climate impacts\" says Kate Logan, director of the China Climate Hub at the Asia Society Policy Institute. So let's hope this target will not just be hot air, but another one for cautious China to overachieve."
    },
    {
        "title": "Wayne Rooney says he'd be dead if it wasn't for wife Coleen",
        "description": "Footballer Wayne Rooney has said he believes he would be dead if it wasn't for his wife Coleen's help with his alcohol issues.",
        "url": "https://news.sky.com/story/wayne-rooney-says-hed-be-dead-if-it-wasnt-for-wife-coleen-13437697",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-wayne-rooney-coleen-rooney_7031023.jpg?20250925082503",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-25 07:17:00",
        "Headline": "The former England and Manchester United star told his friend and former teammate Rio Ferdinand he would \"drink for two days straight\" at the peak of his career.",
        "Content": " Footballer Wayne Rooney has said he believes he would be dead if it wasn't for his wife Coleen's help with his alcohol issues. The former England and Manchester United star told his friend and former teammate Rio Ferdinand he would \"drink for two days straight\" at the peak of his career. Recalling that period on the Rio Ferdinand Presents podcast, he said he would \"come training and at the weekend I'd score two goals and then I'd go back and go and drink for two days straight again\". But the 39-year-old said his wife \"helped me control that massively\" and \"managed me because I needed managing\". \"I honestly believe, if she weren't there, I'd be dead,\" he said. Speaking to Ferdinand, he recalled meeting Coleen when they were at secondary school together in Liverpool and getting married in 2008 after six years of dating. \"When I was 17, she could see, she knew my mind and she knew I was a bit out there,\" he said. \"I loved my football, obsessed with football, but also I loved a night out or whatever, going out. She's seen it very early on and she's controlled that. Well, not controlled, but helped me control that massively.\" Read more from Sky NewsCheryl Tweedy's stalker jailed for fourth timeMaggots in Diddy's food in prison ahead of sentencingNoel Clarke to pay £3m to newspaper Gum and eye drops to hide drinking at work When he was playing for Manchester United, he would try to hide his drinking sessions from manager Sir Alex Ferguson by chewing gum and using eye drops, he added. The couple have four children together. Their marriage has been impacted by several allegations of Rooney being unfaithful, for which he has issued public apologies. The former striker, who is still Manchester United's all-time record goal scorer, was arrested for drink-driving in 2017. After he was caught over the limit in Wilmslow, Cheshire, he pleaded guilty to drink-driving and was banned for two years, made to do 100 hours of unpaid work, and was fined two weeks' wages by his then-team Everton. He was arrested for \"public intoxication\" in the US a year later and fined $116 (£86) without going to court. Having left his role as head coach at Plymouth Argyle, Rooney now has his own BBC podcast and works as a pundit on Match Of The Day."
    },
    {
        "title": "Jessica Chastain criticises decision to delay release of The Savant after Charlie Kirk killing",
        "description": "Jessica Chastain has criticised Apple's decision to delay the release of political thriller series The Savant after the killing of Charlie Kirk.",
        "url": "https://news.sky.com/story/jessica-chastain-criticises-decision-to-delay-release-of-the-savant-after-charlie-kirk-killing-13437637",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-jessica-chastain-the-savant_7030944.jpg?20250925034644",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-09-25 02:10:00",
        "Headline": "In the show, Chastain portrays a military veteran who works at the Anti-Hate Alliance, where she secretly visits 4Chan-like message boards and poses as a white nationalist to identify possible terrorists.",
        "Content": "Jessica Chastain has criticised Apple's decision to delay the release of political thriller series The Savant after the killing of Charlie Kirk. The actress, who is also executive producer of the show for the tech giant's TV+ streaming service, said she was \"not aligned on the decision to pause the release\". In a post on Instagram, she said the programme, in which she plays a woman who tries to draw out potential terrorists online, is \"so relevant\" and she has never \"shied away from difficult subjects\". Chastain portrays a military veteran who works at the Anti-Hate Alliance, where she secretly visits 4Chan-like message boards and poses as a white nationalist to identify possible terrorists. \"'The Savant' is about the heroes who work every day to stop violence before it happens, and honouring their courage feels more urgent than ever,\" Chastain said. \"I remain hopeful the show will reach audiences soon. Until then, I'm wishing safety and strength for everyone.\" She listed several acts of political violence in the US in recent years, including a plot to kidnap Michigan's governor Gretchen Whitmer, the attempted assassinations of Donald Trump last year and also the killing of controversial influencer Kirk. Read more:The string of bloody political violence in the MAGA era Apple said it chose to postpone the show after \"careful consideration\" but did not give a reason why. Kimmel's comeback show brings in record ratings Meanwhile, millions of people tuned in to watch Jimmy Kimmel on Tuesday after he returned to TV after Disney suspended him for nearly a week after he made comments about Kirk. ABC said 6.26 million people watched Kimmel as he said it was \"never my intention to make light of\" Kirk's death. It was the late-night show's highest-rated regularly scheduled episode. Read more:Explained: Why Jimmy Kimmel was taken off air  \"I don't think there's anything funny about it,\" he said as he choked up. \"Nor was it my intention to blame any specific group for the actions of what was obviously a deeply disturbed individual. That was really the opposite of the point I was trying to make\". Kimmel had been accused of being \"offensive and insensitive\" after using his programme, Jimmy Kimmel Live, to accuse Donald Trump and his allies of capitalising on the killing."
    }
]