[
    {
        "title": "PM could lift controversial benefit cap in budget - as Farage makes two big election promises",
        "description": "Sir Keir Starmer could decide to lift the two-child benefit cap in the autumn budget, amid further pressure from Nigel Farage to appeal to traditional Labour voters.",
        "url": "https://news.sky.com/story/pm-could-lift-controversial-benefit-cap-in-budget-as-farage-makes-two-big-election-promises-13374193",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-nigel-farage_6894583.jpg?20250423133018",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-05-24 22:47:00",
        "Headline": "Unrest has grown on the Labour backbenches over the prime minister's approach since winning power, while his unpopularity with the public was made clear at this month's elections. Reform UK reckon it stands to benefit from the disillusionment. ",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Sir Keir Starmer could decide to lift the two-child benefit cap in the autumn budget, amid further pressure from Nigel Farage to appeal to traditional Labour voters. The Reform leader will use a speech this week to commit his party to scrapping the two-child cap, as well as reinstating winter fuel payments in full. The prime minister - who took Westminster by surprise at PMQs by revealing his intention to row back on the winter fuel cut - has previously said he would like to lift the two-child cap if the government could afford it. There are now mounting suggestions an easing of the controversial benefit restriction may be unveiled when the chancellor delivers the budget later this year. According to The Observer, Sir Keir told cabinet ministers he wanted to axe the measure - and asked the Treasury to look for ways to fund the move. It comes after the government delayed the release of its child poverty strategy, which is expected to recommend the divisive cap - introduced by former Tory chancellor George Osborne - is scrapped.  Ministers have already said any changes to winter fuel payments, triggered by mounting political pressure, would only be made when the government's next fiscal event rolls round. The Financial Times reported it may be done by restoring the benefit to all pensioners, with the cash needed being clawed back from the wealthy through the tax system. The payment was taken from more than 10 million pensioners this winter after it became means-tested, and its unpopularity was a big factor in Labour's battering at recent elections. Before Wednesday's PMQs, the prime minister and chancellor had insisted there would be no U-turn. More from Sky News:PM's winter fuel claim 'not credible'Starmer vs Reeves - the 'rift' in Downing Street  Many Labour MPs have called for the government to do more to help the poorest in society, amid mounting concern over the impact of wider benefit reforms. Former prime minister Gordon Brown this week told Sky News the two-child cap was \"pretty discriminatory\" and could be scrapped by raising money through a tax on the gambling industry.  Mr Farage, who believes Reform UK can win the next election, will this week accuse Sir Keir of being \"out of touch with working people\". In a speech first reported by The Sunday Telegraph, he is expected to say: \"It's going to be these very same working people that will vote Reform at the next election and kick Labour out of government.\""
    },
    {
        "title": "My week with Prince William, the quiet disruptor",
        "description": "Photographed in a beam of sunlight, Prince William walked through Westminster Abbey with the King behind him.",
        "url": "https://news.sky.com/story/my-week-with-prince-william-the-quiet-disruptor-13374195",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-william-royal-family_6926503.jpg?20250525012532",
        "type": "Home",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-24 23:28:00",
        "Headline": "Rhiannon Mills, Sky News royal correspondent, spent the week shadowing Prince William, seeing first hand the potential blueprint for the future king.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Photographed in a beam of sunlight, Prince William walked through Westminster Abbey with the King behind him. The ornate robes of the Order of the Bath service, two weeks ago, felt like a world away from the more modern image he wants to portray. But as a man bestowed with so many traditional titles, it's a new role he's shaping for himself that is more intriguing - William, the quiet disruptor. In a week when Time Magazine named the Prince and Princess of Wales in its top 100 philanthropists list for \"modernising royal philanthropy\", I spent the week following the prince on various engagements. None of them particularly headline-grabbing, but all examples of how he's setting out to do things differently, or underlining the challenges, and potential criticisms, he faces doing things his own way. Take Tuesday, for example. We weren't expecting him to turn up as we waited at the Soho Hotel in London to watch a new series of films about the dangers faced by wildlife rangers, a project described as \"the brainchild\" of Prince William. But all of a sudden, there he was in the room, taking the mic to explain what it really means to him. Speaking about his drive to \"give a voice to the voiceless\", it was indicative of what feels like a greater desire from him to articulate more publicly what he stands for. Since November, when he described how he wanted to carry out his duties with \"a smaller r in the royal\", you've got the sense William, and his team, have further wanted to cement in our minds where he sees his role. From conversations this week, with those who work closely with him, the word \"convening\" came up time and again; the prince doesn't want to waste what he knows is a unique position, to bring people together, start conversations and support those who are already doing amazing things in their communities. Shifting the dial But this isn't just about him personally. This is now a man whose vision for the monarchy, I'm told, is increasingly driven by a desire to \"shift the dial on global leadership\" where others may be failing. With palace sources telling me he'd be more than happy to \"be acknowledged\" as a quiet disruptor, despite the criticism his new ways of working might bring. Those who've known him a long time will tell you this compulsion to do things differently has been there for some time. Dr Tessy Ojo, the chief executive from The Diana Award, has worked with Prince William and Prince Harry for over 20 years. She said: \"They would never do royal engagements from the sense of cutting the ribbon or simply being poster people. We were very clearly warned if you wanted any form of engagement, it almost had to have a whole strategy behind it.\" She told me she has always sensed how much William appreciates the responsibility that comes with his role, especially in a world where \"there's a massive demand on leadership… there's a lot of distrust on leaders\". \"What people wanted 40 years ago from their monarch is completely different,\" she said. \"I think it's super important that as the heir, as the next monarch, he's very in tune with what the people want, and what people expect. And being able to be that 21st century monarch, who is a present dad, but also a leader who understands how to use your leadership for social good\". A modern royal Wednesday, and William walked into a sweaty, but infectiously positive, community hall in Leith in Edinburgh. No ribbon cutting here, but this is the kind of visit the prince now sees as a big deal, \"impact\" the buzz word ahead of any engagement now. A very lively game of football launching what they hope will be a long-term tie-up between the Royal Foundation (their charitable trust), Leith community centre and Street Soccer Scotland. On Thursday, the sight of a guard of honour saluting the prince and princess, as the national anthem was played alongside HMS Glasgow, just emphasised the regular handbrake turns they face from the more relaxed to the formal, as they want to make the monarchy feel connected and relevant. Then there is family to consider, in a way that past generations just haven't. Their working diaries are now arranged around their children. They've made no secret of that. On paper, it means fewer engagements compared to other members of the family, and it has led to mutterings of that word no one within the palace wants to hear: \"workshy\". Making an impact? But talking to people in Glasgow, away from the royal visit, I overwhelmingly found most thought William was setting a good example by putting family first. What people were less clear on was his \"social impact\" work and what that is all about. The community projects may not necessarily grab as much attention as William and his advisors want, but what will be fascinating to watch is the potential long-term impact of this new kind of ethos. As the Prince and Princess of Wales stood on the steps of Buckingham Palace at a garden party on Tuesday, pausing for the national anthem, you can't help but wonder whether those traditional elements of royal life could face a shake-up when one day he leads the firm full time. Understandably, no one likes to talk about transition, and Prince William certainly doesn't shout about his thoughts on what will come. Read more from Sky News:Arsenal win Women's Champions LeagueWhat do dolphins get up to beneath the waves?Mother and her three children die in house fire But as heir, his vision for the future and what royal leadership should look like could have huge consequences for the institution. An impact far more significant and lasting than the noisy disruptions it's faced from other family members in recent years."
    },
    {
        "title": "Sir Alan Bates attacks 'kangaroo court' Post Office scheme after 'take it or leave it' offer",
        "description": "Sir Alan Bates has accused the government of presiding over a \"quasi kangaroo court\" for Post Office compensation.",
        "url": "https://news.sky.com/story/sir-alan-bates-attacks-kangaroo-court-post-office-scheme-after-receiving-take-it-or-leave-it-offer-13374194",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-alan-bates-horizon_6515491.jpg?20240409092117",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-24 22:56:00",
        "Headline": "Sir Alan Bates led a years-long effort, fighting for justice for sub-postmasters who were wrongly accused and prosecuted after faulty software made it look as if money was missing from their accounts.",
        "Content": "Sir Alan Bates has accused the government of presiding over a \"quasi kangaroo court\" for Post Office compensation. Writing in The Sunday Times, the campaigner, who led a years-long effort for justice for sub-postmasters, revealed he had been given a \"take it or leave it\" offer that was less than half of his original claim. \"The sub-postmaster compensation schemes have been turned into quasi-kangaroo courts in which the Department for Business and Trade sits in judgement of the claims and alters the goal posts as and when it chooses,\" he said. \"Claims are, and have been, knocked back on the basis that legally you would not be able to make them, or that the parameters of the scheme do not extend to certain items.\" More than 900 sub-postmasters were prosecuted between 1999 and 2015 after faulty Horizon accounting software made it look as if money was missing from their accounts. Many are still waiting for compensation despite the previous government saying those who had their convictions quashed were eligible for £600,000 payouts.  After the Post Office terminated his contract over a false shortfall in 2003, Sir Alan began seeking out other sub-postmasters and eventually took the Post Office to court. \n                  Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation\n                 \n                  Post Office to unveil £1.75bn banking deal with big British lenders\n                 \n                  Post Office auditor EY under investigation by accounting regulator FRC\n                 A group litigation order (GLO) scheme was set up to achieve redress for 555 claimants who took the Post Office to the High Court between 2017 and 2019. Sir Alan, who was portrayed by actor Toby Jones in ITV drama Mr Bates Vs The Post Office, has called for an independent body to be created to deliver compensation. He added that promises the compensation schemes would be \"non-legalistic\" had turned out to be \"worthless\". It is understood around 80% of postmasters in Sir Alan's group have accepted a full and final redress, or been paid most of their offer. Read more:Post Office scandal explainedWho are the key figures in the scandal?  A Department for Business and Trade spokesperson told Sky News: \"We pay tribute to all the postmasters who've suffered from this scandal, including Sir Alan for his tireless campaign for justice, and we have quadrupled the total amount paid to postmasters since entering government. \"We recognise there will be an absence of evidence given the length of time which has passed, and we therefore aim to give the benefit of the doubt to postmasters as far as possible. \"Anyone unhappy with their offer can have their case reviewed by a panel of experts, which is independent of the government.\""
    },
    {
        "title": "Arsenal win Women's Champions League with victory over Barcelona",
        "description": "Arsenal have won the Women's Champions League for the second time, beating Barcelona 1-0 in the final in Lisbon.",
        "url": "https://news.sky.com/story/arsenal-win-uefa-womens-champions-league-with-victory-over-barcelona-13374014",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-arsenal-kim-little_6926366.jpg?20250524193736",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-05-24 17:55:00",
        "Headline": "Arsenal - the only English team to have won the women's competition - had not lifted the trophy since their maiden title in the 2006-07 season.",
        "Content": "Arsenal have won the Women's Champions League for the second time, beating Barcelona 1-0 in the final in Lisbon. Substitute Stina Blackstenius scored the game's only goal in the 75th minute after a brilliant pass from England's Beth Mead. Defending champions Barcelona had dominated the game up to that point, both in possession and shots on goal. Arsenal had nearly taken the lead in the 21st minute of the game, when Barcelona’s Irene Paredes turned Frida Maanum's cross into her net. But the midfielder had gone slightly too early, and VAR ruled for offside. The score remained 0-0 until the masterclass by Mead and Blackstenius in the second half, which secured their team's win over Barcelona and stunned their opponent's fans into silence. This is the first time Barcelona failed to find the net in 41 matches, after scoring an impressive 19 goals in their last three games and keeping clean sheets in their previous four games. Barcelona went into the match as favourites to lift the trophy, having won three of the last four finals. Meanwhile, Arsenal - the only English team to have won the women's competition - had not lifted the trophy since their maiden title in the 2006-07 season. Arsenal boss Renee Slegers said prior to the game that her team, who many considered the underdogs, wanted \"to show bravery\". After the game, Slegers, who can now call herself a European winner in her very first season with the north London club, praised her team's ability to handle \"critical, high-pressure moments\" this season. WSL Golden Boot joint-winner Alessia Russo said Arsenal believed they could lift the trophy \"from day one\"."
    },
    {
        "title": "Nine of Gazan doctor's 10 children killed in Israeli strike on Khan Younis",
        "description": "Nine of a doctor's 10 children have been killed in an Israeli missile strike on their home in Gaza, which also left her surviving son badly injured and her husband in a critical condition.",
        "url": "https://news.sky.com/story/nine-of-gaza-doctors-children-killed-in-israeli-strike-13373740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-al-najjar_6925708.jpg?20250524100800",
        "type": "Home",
        "Author": "Samuel Osborne",
        "Date Published": "2025-05-24 08:16:00",
        "Headline": "Graphic footage shared by the Hamas-run Palestinian Civil Defence shows the bodies of small children being pulled from rubble in southern Gaza.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  Nine of a doctor's 10 children have been killed in an Israeli missile strike on their home in Gaza, which also left her surviving son badly injured and her husband in a critical condition. Warning: This article contains details of child deaths Alaa Al Najjar, a paediatrician at Al Tahrir Clinic in the Nasser Medical Complex, was at work during the attack on her home, south of the city of Khan Younis in southern Gaza, on Friday. Graphic footage shared by the Hamas-run Palestinian Civil Defence shows the bodies of at least seven small children being pulled from the rubble. Rescuers can be seen battling fires and searching through a collapsed building, shouting out when they locate a body, before bringing the children out one by one and wrapping their remains in body bags. In the footage, Dr Al Najjar's husband, Hamdi Al Najjar, who is also a doctor, is put on to a stretcher and then carried to an ambulance. The oldest of their children was only 12 years old, according to Dr Muneer Alboursh, the director general of Gaza's health ministry, which is run by Hamas. \"This is the reality our medical staff in Gaza endure. Words fall short in describing the pain,\" he wrote in a social media post. \"In Gaza, it is not only healthcare workers who are targeted - Israel's aggression goes further, wiping out entire families.\" British doctors describe 'horrific' and 'unimaginable' attack Two British doctors working at Nasser Hospital described the attack as \"horrific\" and \"unimaginable\" for Dr Al Najjar. Speaking in a video diary on Friday night, Dr Graeme Groom said his last patient of the day was Dr Al Najjar's 11-year-old son, who was badly injured and \"seemed much younger as we lifted him on to the operating table\". The strike \"may or may not have been aimed at his father\", Dr Groom said, adding that the man had been left \"very badly injured\". Dr Victoria Rose said the family \"lived opposite a petrol station, so I don't know whether the bomb set off some massive fire\". 'No political or military connections' Dr Groom added: \"It is unimaginable for that poor woman, both of them are doctors here. \"The father was a physician at Nasser Hospital. He had no political and no military connections. He doesn't seem to be prominent on social media, and yet his poor wife is the only uninjured one, who has the prospect of losing her husband.\"  He said it was \"a particularly sad day\", while Dr Rose added: \"That is life in Gaza. That is the way it goes in Gaza.\" In a statement, the Israeli Defence Forces (IDF) said: \"Yesterday (Friday), an IDF aircraft struck a number of suspects who were identified operating from a structure adjacent to IDF troops in the area of Khan Yunis. \"The Khan Yunis area is a dangerous war zone. Before beginning operations there, the IDF evacuated civilians from this area for their own safety. \"The claim regarding harm to uninvolved civilians is under review.\" Read more:Mum of emaciated baby in Gaza says 'I don't want to lose her'Dad wrongly pronounced dead in Israeli bombing killed in airstrike Israel's war against Hamas in Gaza began when the militant group stormed across the border into Israel on 7 October 2023, killing some 1,200 people, most of them civilians, and abducting 251 others. Israel's military response has flattened large areas of Gaza and killed more than 53,000 Palestinians, mostly women and children, according to Gaza's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count."
    },
    {
        "title": "PM could lift controversial benefit cap in budget - as Farage makes two big election promises",
        "description": "Sir Keir Starmer could decide to lift the two-child benefit cap in the autumn budget, amid further pressure from Nigel Farage to appeal to traditional Labour voters.",
        "url": "https://news.sky.com/story/pm-could-lift-controversial-benefit-cap-in-budget-as-farage-makes-two-big-election-promises-13374193",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-nigel-farage_6894583.jpg?20250423133018",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-05-24 22:47:00",
        "Headline": "Unrest has grown on the Labour backbenches over the prime minister's approach since winning power, while his unpopularity with the public was made clear at this month's elections. Reform UK reckon it stands to benefit from the disillusionment. ",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Sir Keir Starmer could decide to lift the two-child benefit cap in the autumn budget, amid further pressure from Nigel Farage to appeal to traditional Labour voters. The Reform leader will use a speech this week to commit his party to scrapping the two-child cap, as well as reinstating winter fuel payments in full. The prime minister - who took Westminster by surprise at PMQs by revealing his intention to row back on the winter fuel cut - has previously said he would like to lift the two-child cap if the government could afford it. There are now mounting suggestions an easing of the controversial benefit restriction may be unveiled when the chancellor delivers the budget later this year. According to The Observer, Sir Keir told cabinet ministers he wanted to axe the measure - and asked the Treasury to look for ways to fund the move. It comes after the government delayed the release of its child poverty strategy, which is expected to recommend the divisive cap - introduced by former Tory chancellor George Osborne - is scrapped.  Ministers have already said any changes to winter fuel payments, triggered by mounting political pressure, would only be made when the government's next fiscal event rolls round. The Financial Times reported it may be done by restoring the benefit to all pensioners, with the cash needed being clawed back from the wealthy through the tax system. The payment was taken from more than 10 million pensioners this winter after it became means-tested, and its unpopularity was a big factor in Labour's battering at recent elections. Before Wednesday's PMQs, the prime minister and chancellor had insisted there would be no U-turn. More from Sky News:PM's winter fuel claim 'not credible'Starmer vs Reeves - the 'rift' in Downing Street  Many Labour MPs have called for the government to do more to help the poorest in society, amid mounting concern over the impact of wider benefit reforms. Former prime minister Gordon Brown this week told Sky News the two-child cap was \"pretty discriminatory\" and could be scrapped by raising money through a tax on the gambling industry.  Mr Farage, who believes Reform UK can win the next election, will this week accuse Sir Keir of being \"out of touch with working people\". In a speech first reported by The Sunday Telegraph, he is expected to say: \"It's going to be these very same working people that will vote Reform at the next election and kick Labour out of government.\""
    },
    {
        "title": "My week with Prince William, the quiet disruptor",
        "description": "Photographed in a beam of sunlight, Prince William walked through Westminster Abbey with the King behind him.",
        "url": "https://news.sky.com/story/my-week-with-prince-william-the-quiet-disruptor-13374195",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-prince-william-royal-family_6926503.jpg?20250525012532",
        "type": "UK",
        "Author": "Rhiannon Mills",
        "Date Published": "2025-05-24 23:28:00",
        "Headline": "Rhiannon Mills, Sky News royal correspondent, spent the week shadowing Prince William, seeing first hand the potential blueprint for the future king.",
        "Content": "\n          Royal correspondent\n              @SkyRhiannon\n  Photographed in a beam of sunlight, Prince William walked through Westminster Abbey with the King behind him. The ornate robes of the Order of the Bath service, two weeks ago, felt like a world away from the more modern image he wants to portray. But as a man bestowed with so many traditional titles, it's a new role he's shaping for himself that is more intriguing - William, the quiet disruptor. In a week when Time Magazine named the Prince and Princess of Wales in its top 100 philanthropists list for \"modernising royal philanthropy\", I spent the week following the prince on various engagements. None of them particularly headline-grabbing, but all examples of how he's setting out to do things differently, or underlining the challenges, and potential criticisms, he faces doing things his own way. Take Tuesday, for example. We weren't expecting him to turn up as we waited at the Soho Hotel in London to watch a new series of films about the dangers faced by wildlife rangers, a project described as \"the brainchild\" of Prince William. But all of a sudden, there he was in the room, taking the mic to explain what it really means to him. Speaking about his drive to \"give a voice to the voiceless\", it was indicative of what feels like a greater desire from him to articulate more publicly what he stands for. Since November, when he described how he wanted to carry out his duties with \"a smaller r in the royal\", you've got the sense William, and his team, have further wanted to cement in our minds where he sees his role. From conversations this week, with those who work closely with him, the word \"convening\" came up time and again; the prince doesn't want to waste what he knows is a unique position, to bring people together, start conversations and support those who are already doing amazing things in their communities. Shifting the dial But this isn't just about him personally. This is now a man whose vision for the monarchy, I'm told, is increasingly driven by a desire to \"shift the dial on global leadership\" where others may be failing. With palace sources telling me he'd be more than happy to \"be acknowledged\" as a quiet disruptor, despite the criticism his new ways of working might bring. Those who've known him a long time will tell you this compulsion to do things differently has been there for some time. Dr Tessy Ojo, the chief executive from The Diana Award, has worked with Prince William and Prince Harry for over 20 years. She said: \"They would never do royal engagements from the sense of cutting the ribbon or simply being poster people. We were very clearly warned if you wanted any form of engagement, it almost had to have a whole strategy behind it.\" She told me she has always sensed how much William appreciates the responsibility that comes with his role, especially in a world where \"there's a massive demand on leadership… there's a lot of distrust on leaders\". \"What people wanted 40 years ago from their monarch is completely different,\" she said. \"I think it's super important that as the heir, as the next monarch, he's very in tune with what the people want, and what people expect. And being able to be that 21st century monarch, who is a present dad, but also a leader who understands how to use your leadership for social good\". A modern royal Wednesday, and William walked into a sweaty, but infectiously positive, community hall in Leith in Edinburgh. No ribbon cutting here, but this is the kind of visit the prince now sees as a big deal, \"impact\" the buzz word ahead of any engagement now. A very lively game of football launching what they hope will be a long-term tie-up between the Royal Foundation (their charitable trust), Leith community centre and Street Soccer Scotland. On Thursday, the sight of a guard of honour saluting the prince and princess, as the national anthem was played alongside HMS Glasgow, just emphasised the regular handbrake turns they face from the more relaxed to the formal, as they want to make the monarchy feel connected and relevant. Then there is family to consider, in a way that past generations just haven't. Their working diaries are now arranged around their children. They've made no secret of that. On paper, it means fewer engagements compared to other members of the family, and it has led to mutterings of that word no one within the palace wants to hear: \"workshy\". Making an impact? But talking to people in Glasgow, away from the royal visit, I overwhelmingly found most thought William was setting a good example by putting family first. What people were less clear on was his \"social impact\" work and what that is all about. The community projects may not necessarily grab as much attention as William and his advisors want, but what will be fascinating to watch is the potential long-term impact of this new kind of ethos. As the Prince and Princess of Wales stood on the steps of Buckingham Palace at a garden party on Tuesday, pausing for the national anthem, you can't help but wonder whether those traditional elements of royal life could face a shake-up when one day he leads the firm full time. Understandably, no one likes to talk about transition, and Prince William certainly doesn't shout about his thoughts on what will come. Read more from Sky News:Arsenal win Women's Champions LeagueWhat do dolphins get up to beneath the waves?Mother and her three children die in house fire But as heir, his vision for the future and what royal leadership should look like could have huge consequences for the institution. An impact far more significant and lasting than the noisy disruptions it's faced from other family members in recent years."
    },
    {
        "title": "Sir Alan Bates attacks 'kangaroo court' Post Office scheme after 'take it or leave it' offer",
        "description": "Sir Alan Bates has accused the government of presiding over a \"quasi kangaroo court\" for Post Office compensation.",
        "url": "https://news.sky.com/story/sir-alan-bates-attacks-kangaroo-court-post-office-scheme-after-receiving-take-it-or-leave-it-offer-13374194",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-alan-bates-horizon_6515491.jpg?20240409092117",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-24 22:56:00",
        "Headline": "Sir Alan Bates led a years-long effort, fighting for justice for sub-postmasters who were wrongly accused and prosecuted after faulty software made it look as if money was missing from their accounts.",
        "Content": "Sir Alan Bates has accused the government of presiding over a \"quasi kangaroo court\" for Post Office compensation. Writing in The Sunday Times, the campaigner, who led a years-long effort for justice for sub-postmasters, revealed he had been given a \"take it or leave it\" offer that was less than half of his original claim. \"The sub-postmaster compensation schemes have been turned into quasi-kangaroo courts in which the Department for Business and Trade sits in judgement of the claims and alters the goal posts as and when it chooses,\" he said. \"Claims are, and have been, knocked back on the basis that legally you would not be able to make them, or that the parameters of the scheme do not extend to certain items.\" More than 900 sub-postmasters were prosecuted between 1999 and 2015 after faulty Horizon accounting software made it look as if money was missing from their accounts. Many are still waiting for compensation despite the previous government saying those who had their convictions quashed were eligible for £600,000 payouts.  After the Post Office terminated his contract over a false shortfall in 2003, Sir Alan began seeking out other sub-postmasters and eventually took the Post Office to court. \n                  Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation\n                 \n                  Post Office to unveil £1.75bn banking deal with big British lenders\n                 \n                  Post Office auditor EY under investigation by accounting regulator FRC\n                 A group litigation order (GLO) scheme was set up to achieve redress for 555 claimants who took the Post Office to the High Court between 2017 and 2019. Sir Alan, who was portrayed by actor Toby Jones in ITV drama Mr Bates Vs The Post Office, has called for an independent body to be created to deliver compensation. He added that promises the compensation schemes would be \"non-legalistic\" had turned out to be \"worthless\". It is understood around 80% of postmasters in Sir Alan's group have accepted a full and final redress, or been paid most of their offer. Read more:Post Office scandal explainedWho are the key figures in the scandal?  A Department for Business and Trade spokesperson told Sky News: \"We pay tribute to all the postmasters who've suffered from this scandal, including Sir Alan for his tireless campaign for justice, and we have quadrupled the total amount paid to postmasters since entering government. \"We recognise there will be an absence of evidence given the length of time which has passed, and we therefore aim to give the benefit of the doubt to postmasters as far as possible. \"Anyone unhappy with their offer can have their case reviewed by a panel of experts, which is independent of the government.\""
    },
    {
        "title": "Arsenal win Women's Champions League with victory over Barcelona",
        "description": "Arsenal have won the Women's Champions League for the second time, beating Barcelona 1-0 in the final in Lisbon.",
        "url": "https://news.sky.com/story/arsenal-win-uefa-womens-champions-league-with-victory-over-barcelona-13374014",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-arsenal-kim-little_6926366.jpg?20250524193736",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-24 17:55:00",
        "Headline": "Arsenal - the only English team to have won the women's competition - had not lifted the trophy since their maiden title in the 2006-07 season.",
        "Content": "Arsenal have won the Women's Champions League for the second time, beating Barcelona 1-0 in the final in Lisbon. Substitute Stina Blackstenius scored the game's only goal in the 75th minute after a brilliant pass from England's Beth Mead. Defending champions Barcelona had dominated the game up to that point, both in possession and shots on goal. Arsenal had nearly taken the lead in the 21st minute of the game, when Barcelona’s Irene Paredes turned Frida Maanum's cross into her net. But the midfielder had gone slightly too early, and VAR ruled for offside. The score remained 0-0 until the masterclass by Mead and Blackstenius in the second half, which secured their team's win over Barcelona and stunned their opponent's fans into silence. This is the first time Barcelona failed to find the net in 41 matches, after scoring an impressive 19 goals in their last three games and keeping clean sheets in their previous four games. Barcelona went into the match as favourites to lift the trophy, having won three of the last four finals. Meanwhile, Arsenal - the only English team to have won the women's competition - had not lifted the trophy since their maiden title in the 2006-07 season. Arsenal boss Renee Slegers said prior to the game that her team, who many considered the underdogs, wanted \"to show bravery\". After the game, Slegers, who can now call herself a European winner in her very first season with the north London club, praised her team's ability to handle \"critical, high-pressure moments\" this season. WSL Golden Boot joint-winner Alessia Russo said Arsenal believed they could lift the trophy \"from day one\"."
    },
    {
        "title": "Ex-PM Boris Johnson and wife announce birth of their fourth child",
        "description": "Former prime minister Boris Johnson has welcomed his fourth child with his wife, Carrie Johnson.",
        "url": "https://news.sky.com/story/ex-pm-boris-johnson-and-wife-announce-birth-of-their-fourth-child-13373914",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-boris-johnson-carrie-johnson_6926065.jpg?20250524163336",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-24 15:06:00",
        "Headline": "Their daughter Poppy Eliza Josephine Johnson is the couple's fourth and \"final\" child, Carrie Johnson said on Instagram.",
        "Content": "Former prime minister Boris Johnson has welcomed his fourth child with his wife, Carrie Johnson. Mrs Johnson shared the news on social media of the birth of Poppy Eliza Josephine Johnson on 21 May. She wrote in a post on Instagram: \"I can't believe how pretty and tiny you are. Feel so incredibly lucky. We are all totally smitten. Not sure I've slept a minute since you were born as can't stop looking at how completely lovely you are.\" Poppy is the couple's fourth child, after Wilfred, Romy, and Frank. Mrs Johnson continued: \"Thank you so much to the amazing maternity team at UCLH and particularly to Asma and Patrick who have looked after me so well through all my pregnancies. I really cannot thank you guys enough. \"Wilf, Romy and Frank are utterly delighted, particularly Romy who was desperate for a little sister. Bring on the matching dresses.\" She said she is out of hospital and looking forward to \"cocktails and pizza with my tiny baby snoozing on my lap\". \"Life doesn't get any better,\" Mrs Johnson added. The couple married in May 2021. Their eldest, Wilf, was born in April 2020, followed by Romy in December 2021, and Frank in July 2023. Their daughter Poppy, who Mrs Johnson said is the \"final gang member\", is Mr Johnson's ninth child. Read more on Sky News:Man arrested after four people die in fireTrade wars reignate as EU strikes back against Trump Mr Johnson, 60, finally confirmed the number of children he had - at the time it was six - during an interview in 2021, after much speculation. He also has four children with ex-wife Marina Wheeler, and a child born in 2009 as a result of an affair with art consultant Helen Macintyre."
    },
    {
        "title": "Man arrested on suspicion of murder as mother and her three children die in house fire",
        "description": "A man has been arrested on suspicion of murder after a mother and her three children died in a house fire in Brent, northwest London.",
        "url": "https://news.sky.com/story/three-boys-and-a-woman-die-in-house-fire-man-arrested-at-scene-13373774",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-brent-fire_6925782.jpg?20250524120835",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-05-24 09:48:00",
        "Headline": "A 43-year-old woman and three children, aged 15, eight and four, died at the scene in Brent, near Wembley, northwest London, the Metropolitan Police said. Two others were taken to hospital.",
        "Content": " A man has been arrested on suspicion of murder after a mother and her three children died in a house fire in Brent, northwest London. Warning: This article contains pictures of a fire in which people died Metropolitan Police officers are investigating after being called to assist firefighters in Stonebridge, near Wembley, shortly after 1.20am. A 43-year-old woman and three children - a 15-year-old girl, an eight-year-old boy, and a four-year-old boy - died at the scene, the force said. Their next-of-kin have been informed. Police are waiting for an update on the conditions of two other people who were taken to hospital. A 41-year-old man was arrested at the scene and remains in custody. Witness Mohamed Labidi, 38, said: \"They're very good people, no problems on their side at all. It's really shocking. It's a really strong community here, we look after each other. \"We used to socialise together. I can't even look at the house right now,\" he added. A neighbour, who did not want to be named, said: \"It's horrible, we saw people running outside. It's hard to process. I only just moved in, so it's hard to think about it.\" Eight fire engines and around 60 firefighters responded to the blaze, the London Fire Brigade (LFB) said. Two terrace houses, each with three floors, were severely damaged in the fire, which was under control by around 3.25am, the fire service added. Firefighters rescued the woman and one of the children from the second floor of the house, but they were declared dead by air ambulance crews. The two other children were found inside the property and were also declared dead at the scene, LFB said. LFB assistant commissioner Keeley Foster said: \"Upon arrival, firefighters were met with a well-developed fire involving two adjoining properties. Crews immediately set to work carrying out firefighting operations in order to bring the incident under control. \"Sadly, a woman and her three children have died as a result of this fire. \"Crews wearing breathing apparatus were able to rescue the woman and one of the children from the second floor, but they were later declared deceased at the scene. \"A further two children were discovered to have died in the fire, as crews carried out a search of the properties involved.\" She added: \"This is an extremely tragic incident, and the thoughts of everyone across the brigade are with those impacted by this incident.\" London Ambulance Service said an air ambulance, incident response officers, advanced paramedics, and a hazardous area response team were deployed. Read more from Sky News:Trade war fears reignite as EU strikes back at Trump's threatWhy Russian troops are massing near Ukraine's 'fortress city'UN chief condemns 'teaspoon' of aid allowed into Gaza Superintendent Steve Allen, from the Met's local policing team in northwest London, said: \"My thoughts and the thoughts of all the emergency services are with the four people who died in the fire, as well as the two people who were taking to hospital. \"Detectives from the Metropolitan Police are leading the investigation and we are working closely with the London Fire Brigade to establish the cause of the fire.\" He added: \"We remain in the early stages of our investigation, however one man was arrested outside the house. He remains in custody and is being questioned by officers.\" Mayor of London Sadiq Khan said in a post on X: \"This is devastating news and my thoughts are with the family, friends and wider community of the four people who sadly have lost their lives. \"I remain in close contact with the London Fire Brigade and Metropolitan Police as they work to establish the cause of the fire and offer support to all those impacted.\" Dawn Butler, the local Labour MP for Brent East, posted: \"Devastated to see the fatal fire at homes in Tillett Close last night. \"My prayers are with the family and friends affected by this is a very sad tragedy. \"@LFB_Brent worked hard to get it under control, thank you.\""
    },
    {
        "title": "Nine of Gazan doctor's 10 children killed in Israeli strike on Khan Younis",
        "description": "Nine of a doctor's 10 children have been killed in an Israeli missile strike on their home in Gaza, which also left her surviving son badly injured and her husband in a critical condition.",
        "url": "https://news.sky.com/story/nine-of-gaza-doctors-children-killed-in-israeli-strike-13373740",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-gaza-al-najjar_6925708.jpg?20250524100800",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-05-24 08:16:00",
        "Headline": "Graphic footage shared by the Hamas-run Palestinian Civil Defence shows the bodies of small children being pulled from rubble in southern Gaza.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  Nine of a doctor's 10 children have been killed in an Israeli missile strike on their home in Gaza, which also left her surviving son badly injured and her husband in a critical condition. Warning: This article contains details of child deaths Alaa Al Najjar, a paediatrician at Al Tahrir Clinic in the Nasser Medical Complex, was at work during the attack on her home, south of the city of Khan Younis in southern Gaza, on Friday. Graphic footage shared by the Hamas-run Palestinian Civil Defence shows the bodies of at least seven small children being pulled from the rubble. Rescuers can be seen battling fires and searching through a collapsed building, shouting out when they locate a body, before bringing the children out one by one and wrapping their remains in body bags. In the footage, Dr Al Najjar's husband, Hamdi Al Najjar, who is also a doctor, is put on to a stretcher and then carried to an ambulance. The oldest of their children was only 12 years old, according to Dr Muneer Alboursh, the director general of Gaza's health ministry, which is run by Hamas. \"This is the reality our medical staff in Gaza endure. Words fall short in describing the pain,\" he wrote in a social media post. \"In Gaza, it is not only healthcare workers who are targeted - Israel's aggression goes further, wiping out entire families.\" British doctors describe 'horrific' and 'unimaginable' attack Two British doctors working at Nasser Hospital described the attack as \"horrific\" and \"unimaginable\" for Dr Al Najjar. Speaking in a video diary on Friday night, Dr Graeme Groom said his last patient of the day was Dr Al Najjar's 11-year-old son, who was badly injured and \"seemed much younger as we lifted him on to the operating table\". The strike \"may or may not have been aimed at his father\", Dr Groom said, adding that the man had been left \"very badly injured\". Dr Victoria Rose said the family \"lived opposite a petrol station, so I don't know whether the bomb set off some massive fire\". 'No political or military connections' Dr Groom added: \"It is unimaginable for that poor woman, both of them are doctors here. \"The father was a physician at Nasser Hospital. He had no political and no military connections. He doesn't seem to be prominent on social media, and yet his poor wife is the only uninjured one, who has the prospect of losing her husband.\"  He said it was \"a particularly sad day\", while Dr Rose added: \"That is life in Gaza. That is the way it goes in Gaza.\" In a statement, the Israeli Defence Forces (IDF) said: \"Yesterday (Friday), an IDF aircraft struck a number of suspects who were identified operating from a structure adjacent to IDF troops in the area of Khan Yunis. \"The Khan Yunis area is a dangerous war zone. Before beginning operations there, the IDF evacuated civilians from this area for their own safety. \"The claim regarding harm to uninvolved civilians is under review.\" Read more:Mum of emaciated baby in Gaza says 'I don't want to lose her'Dad wrongly pronounced dead in Israeli bombing killed in airstrike Israel's war against Hamas in Gaza began when the militant group stormed across the border into Israel on 7 October 2023, killing some 1,200 people, most of them civilians, and abducting 251 others. Israel's military response has flattened large areas of Gaza and killed more than 53,000 Palestinians, mostly women and children, according to Gaza's Hamas-run health ministry, which does not differentiate between civilians and combatants in its count."
    },
    {
        "title": "Man charged over cargo ship that crashed into front garden",
        "description": "A man has been charged after a cargo ship ran aground in a front garden as the homeowner was sleeping indoors.",
        "url": "https://news.sky.com/story/man-charged-over-cargo-ship-that-crashed-into-front-garden-13373705",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-norway-container-ship_6924784.jpg?20250523081254",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-24 04:23:00",
        "Headline": "Norwegian police said the suspect told them he had fallen asleep while on duty. He has been charged with negligent navigation.",
        "Content": " A man has been charged after a cargo ship ran aground in a front garden as the homeowner was sleeping indoors. Remarkable pictures showed just how close the 135m-long vessel came to crashing into Johan Helberg's house near Trondheim, Norway, on Thursday. Police launched an investigation into the incident and have charged a Ukrainian man in his 30s who was serving as second officer aboard the vessel. He was one of 16 people on the ship, and has been charged with negligent navigation. Like Mr Helberg, the officer was asleep. \"The individual charged was the officer on watch at the time of the incident,\" said a police statement. \"During questioning, he stated that he fell asleep while on duty alone, which led to the vessel running aground.\" Read more from Sky News:Neville out of Premier League finaleAll passengers dead in US plane crashEU vows response to Trump tariff threat Police are continuing to investigate whether rules regarding working and resting hours were adhered to on the ship. No injuries were reported as a result of the crash, and authorities are working on relocating the vessel."
    },
    {
        "title": "US-EU trade war fears reignite as Europe strikes back at Trump's threat",
        "description": "Fears of a US-EU trade war have been reignited after Europe refused to back down in the face of fresh threats from Donald Trump.",
        "url": "https://news.sky.com/story/us-eu-trade-war-fears-reignite-as-europe-strikes-back-at-trumps-threat-13373692",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6925474.jpg?20250523200732",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-05-24 00:40:00",
        "Headline": "In recent days, the US president has again threatened once-allies with the spectre of tariffs. But he also said he would impose the levy on one of America's most successful companies: Apple. Markets have responded negatively to the news.",
        "Content": " Fears of a US-EU trade war have been reignited after Europe refused to back down in the face of fresh threats from Donald Trump. The word tariff has dominated much of the US president's second term, and he has repeatedly and freely threatened countries with them. Money blog: Trump sends message to UK on energy bills This included the so-called \"liberation day\" last month, when he unleashed tariffs on many of his trade partners. On Friday, after a period of relative calm which has included striking a deal with the UK, he threatened to impose a 50% tariff on the EU after claiming trade talks with Brussels were \"going nowhere\". The US president has repeatedly taken issue with the EU, going as far as to claim it was created to rip the US off. However, in the face of the latest hostile rhetoric from Mr Trump's social media account, the European Commission - which oversees trade for the 27-country bloc - has refused to back down. EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\" Fellow EU leaders and ministers have also held the line after Mr Trump's comments. Polish deputy economy minister Michal Baranowski said the tariffs appeared to be a negotiating ploy, with Dutch prime minister Dick Schoof said tariffs \"can go up and down\". French trade minister Laurent Saint-Martin said the latest threats did nothing to help trade talks. He stressed \"de-escalation\" was one of the EU's main aims but warned: \"We are ready to respond.\" Mr Sefcovic spoke with US trade representative Jamieson Greer and commerce secretary Howard Lutnick after Mr Trump's comments. Mr Trump has previously backed down on a tit-for-tat trade war with China, which saw tariffs soar above 100%. Read more:Trump accepts $400m plane from QatarJudge blocks Trump's Harvard foreign student ban  Sticking points Talks between the US and EU have stumbled. In the past week, Washington sent a list of demands to Brussels - including adopting US food safety standards and removing national digital services taxes, people familiar with the talks told Reuters news agency. In response, the EU reportedly offered a mutually beneficial deal that could include the bloc potentially buying more liquefied natural gas and soybeans from the US, as well as cooperation on issues such as steel overcapacity, which both sides blame on China. Stocks tumble as Trump grumbles Major stock indices tumbled after Mr Trump's comments, which came as he also threatened to slap US tech giant Apple with a 25% tariff. The president is adamant that he wants the company's iPhones to be built in America. The vast majority of its phones are made in China, and the company has also shifted some production to India. Shares of Apple ended 3% lower and the dollar sank 1% versus the Japanese yen and the euro rose 0.8% against the dollar."
    },
    {
        "title": "US-EU trade war fears reignite as Europe strikes back at Trump's threat",
        "description": "Fears of a US-EU trade war have been reignited after Europe refused to back down in the face of fresh threats from Donald Trump.",
        "url": "https://news.sky.com/story/us-eu-trade-war-fears-reignite-as-europe-strikes-back-at-trumps-threat-13373692",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6925474.jpg?20250523200732",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-24 00:40:00",
        "Headline": "In recent days, the US president has again threatened once-allies with the spectre of tariffs. But he also said he would impose the levy on one of America's most successful companies: Apple. Markets have responded negatively to the news.",
        "Content": " Fears of a US-EU trade war have been reignited after Europe refused to back down in the face of fresh threats from Donald Trump. The word tariff has dominated much of the US president's second term, and he has repeatedly and freely threatened countries with them. Money blog: Trump sends message to UK on energy bills This included the so-called \"liberation day\" last month, when he unleashed tariffs on many of his trade partners. On Friday, after a period of relative calm which has included striking a deal with the UK, he threatened to impose a 50% tariff on the EU after claiming trade talks with Brussels were \"going nowhere\". The US president has repeatedly taken issue with the EU, going as far as to claim it was created to rip the US off. However, in the face of the latest hostile rhetoric from Mr Trump's social media account, the European Commission - which oversees trade for the 27-country bloc - has refused to back down. EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\" Fellow EU leaders and ministers have also held the line after Mr Trump's comments. Polish deputy economy minister Michal Baranowski said the tariffs appeared to be a negotiating ploy, with Dutch prime minister Dick Schoof said tariffs \"can go up and down\". French trade minister Laurent Saint-Martin said the latest threats did nothing to help trade talks. He stressed \"de-escalation\" was one of the EU's main aims but warned: \"We are ready to respond.\" Mr Sefcovic spoke with US trade representative Jamieson Greer and commerce secretary Howard Lutnick after Mr Trump's comments. Mr Trump has previously backed down on a tit-for-tat trade war with China, which saw tariffs soar above 100%. Read more:Trump accepts $400m plane from QatarJudge blocks Trump's Harvard foreign student ban  Sticking points Talks between the US and EU have stumbled. In the past week, Washington sent a list of demands to Brussels - including adopting US food safety standards and removing national digital services taxes, people familiar with the talks told Reuters news agency. In response, the EU reportedly offered a mutually beneficial deal that could include the bloc potentially buying more liquefied natural gas and soybeans from the US, as well as cooperation on issues such as steel overcapacity, which both sides blame on China. Stocks tumble as Trump grumbles Major stock indices tumbled after Mr Trump's comments, which came as he also threatened to slap US tech giant Apple with a 25% tariff. The president is adamant that he wants the company's iPhones to be built in America. The vast majority of its phones are made in China, and the company has also shifted some production to India. Shares of Apple ended 3% lower and the dollar sank 1% versus the Japanese yen and the euro rose 0.8% against the dollar."
    },
    {
        "title": "All passengers confirmed dead after California plane crash",
        "description": "All six people aboard a small plane that crashed into a US neighbourhood have died, investigators said on Friday.",
        "url": "https://news.sky.com/story/all-passengers-confirmed-dead-after-california-plane-crash-13373695",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-san-diego-us-plane-crash_6925633.jpg?20250524032407",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-24 02:06:00",
        "Headline": "On Thursday, a small plane crashed into a neighbourhood in San Diego, destroying and damaging several cars and homes. According to US authorities, all six people on board died.",
        "Content": " All six people aboard a small plane that crashed into a US neighbourhood have died, investigators said on Friday. They also highlighted a number of issues that may have contributed to the incident, including the foggy weather conditions. US music agent Dave Shapiro was among those who died on the jet that went down in Murphy Canyon, San Diego California, on Thursday. Investigator Dan Baker of the National Transportation Safety Board said runway lights were out at the time of the incident, and a weather alert system also wasn't working when the pilot made the decision to try to land. Investigators said they came up short and crashed instead. Before this, the pilot acknowledged the weather conditions were not ideal and debated diverting to a different airport while talking to an air traffic controller, according to audio posted by LiveATC.net. The Federal Aviation Administration had posted a notice that the lights were not working, but it isn't clear whether the pilot was aware. \n                  FBI names suspect in California fertility clinic bombing as Guy Edward Bartkus\n                 \n                  Alcatraz: Why does Donald Trump want to reopen the notorious prison - and did anyone ever escape?\n                 \n                  Man injured by hot tea from Starbucks awarded $50m in damages\n                 He is heard saying \"doesn't sound great, but we'll give it a go\" to an air traffic controller. The plane crashed two miles (3.2km) from the airport. Mr Shapiro and two unnamed employees of the music agency he co-founded, Sound Talent Group, were among the dead, along with Daniel Williams, the former drummer for metal band The Devil Wears Prada. Mr Shapiro, 42, was listed as the owner of the plane and had a pilot's licence. 'You could barely see' The aircraft had taken off from Teterboro, New Jersey, around 11.15pm local time Wednesday, and it made a fuel stop in Kansas before continuing to San Diego. This schedule wouldn't have been allowed for an airliner under federal rules, but these do not apply to private planes. Assistant San Diego Fire Department chief Dan Eddy said the fog had been so thick at the time of the crash that \"you could barely see in front of you.\" The twin-engine Cessna Citation, on its approach to Montgomery-Gibbs Executive Airport, clipped power lines before crashing, according to Mr Baker. The fire ignited by the impact of the plane damaged nearby homes and vehicles, but nobody on the ground was killed or seriously injured. Eight people were treated for minor injuries. Read more from Sky News:Billy Joel cancels upcoming concerts over brain illnessThe penny is about to drop in America - for the final timeTrade war fears reignite as Europe strikes back Following the crash, the San Diego Humane Society has been retrieving lost animals, and decontaminating dogs exposed to jet fuel. The group said it had taken in 22 animals, including 16 contaminated dogs and puppies."
    },
    {
        "title": "Hannah Gutierrez-Reed: Weapons supervisor convicted in fatal shooting on Alec Baldwin film set freed from jail",
        "description": "A weapons supervisor who was jailed for involuntary manslaughter over the fatal shooting of Halyna Hutchins on the set of the Alec Baldwin movie, Rust, has been freed.",
        "url": "https://news.sky.com/story/hannah-gutierrez-reed-weapons-supervisor-convicted-in-fatal-shooting-on-alec-baldwin-film-set-freed-from-jail-13373872",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-alec-baldwin-rust-shooting_5751640.jpg?20220426014753",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-05-24 14:07:00",
        "Headline": "Gutierrez-Reed, who was jailed for a maximum 18 months, was released on Friday to Arizona, after completing her sentence, but will be on both parole and probation.",
        "Content": "A weapons supervisor who was jailed for involuntary manslaughter over the fatal shooting of Halyna Hutchins on the set of the Alec Baldwin movie, Rust, has been freed. Hannah Gutierrez-Reed was released on parole from the Western New Mexico Correctional Facility in Grants on Friday, after serving her 18-month sentence, NBC News, Sky's US partner said, quoting New Mexico Corrections Department spokesperson, Brittany Roembach. Gutierrez-Reed was released to return home to Bullhead City, Arizona, where she will be on parole for a year for the manslaughter case. She was in charge of weapons during the production of the Western film in Santa Fe, New Mexico, in October 2021, when a prop gun held by star and co-producer Alec Baldwin went off during a rehearsal. Cinematographer Hutchins died following the incident, while director Joel Souza was injured. Gutierrez-Reed was acquitted of charges of tampering with evidence in the investigation, but will be on probation over a separate conviction for unlawfully carrying a gun into a Santa Fe bar where firearms are banned weeks before Rust began filming. Involuntary manslaughter means causing someone's death due to negligence, without intending to. At her 10-day trial in New Mexico in March last year, prosecutors blamed Gutierrez-Reed for unwittingly bringing live ammunition onto the set of Rust and for failing to follow basic gun safety protocols. The 18-month sentence she was given was the maximum available for the offence. Baldwin, 67, was also charged with involuntary manslaughter, but the case was dramatically dismissed by the judge during his trial last July over mistakes made by police and prosecutors, including allegations of withholding ammunition evidence from the defence. The actor had always denied the charge, maintaining he did not pull the gun's trigger and that others on the set were responsible for safety checks on the weapon. Rust was finished in Montana and released earlier this month, minus the scene they were working on when Hutchins was shot, Souza, speaking at November's premiere in Poland, said. Rust is billed as the story of a 13-year-old boy who, left to fend for himself and his younger brother following their parents' deaths in 1880s Wyoming, goes on the run with his long-estranged grandfather after being sentenced to hang for the accidental killing of a local rancher."
    },
    {
        "title": "AA owners line up banks to steer path towards £4.5bn exit",
        "description": "The owners of the AA, Britain's biggest breakdown recovery service, are lining up bankers to steer a path towards a sale or stock market listing next year which could value the company at well over &#163;4bn.",
        "url": "https://news.sky.com/story/aa-owners-line-up-banks-to-steer-path-towards-16345bn-exit-13373735",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-aa-van-breakdown_6402269.jpg?20231223122950",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-05-24 07:55:00",
        "Headline": "The three investors that own the breakdown recovery service are lining up JP Morgan and Rothschild to advise on strategic options for the business, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of the AA, Britain's biggest breakdown recovery service, are lining up bankers to steer a path towards a sale or stock market listing next year which could value the company at well over £4bn. Sky News has learnt that JP Morgan and Rothschild are in pole position to be appointed to conduct a review of the AA's strategic options following a recovery in its financial and operating performance. The AA, which has more than 16 million customers, including 3.3 million individual members, is jointly owned by three private equity firms: Towerbrook Capital Partners, Warburg Pincus and Stonepeak. Insiders said this weekend that any form of corporate transaction involving the AA was not imminent or likely to take place for at least 12 months. They added that there was no fixed timetable and that a deal might not take place until after 2026. Nevertheless, the impending appointment of advisers underlines the renewed confidence its shareholders now have in its prospects, with the business having recorded four consecutive years of customer, revenue and earnings growth. A strategic review of the AA's options is likely to encompass an outright sale, listing on the public markets or the disposal of a further minority stake. \n                  US-EU trade war fears reignite as Europe strikes back at Trump's threat\n                 \n                  Weekend Money: Is 50/50 enough? The 'ludicrous' divorce settlements leaving many women 'devastated'\n                 \n                  British taxpayers' £10.2bn loss on bailout of RBS\n                 Stonepeak invested £450m into the company in a combination of common and preferred equity, in a transaction which completed in July last year. That deal was undertaken at an enterprise valuation - comprising the AA's equity and debt - of approximately £4bn, the shareholders said at the time. Given the company's growth and the valuation at which Stonepeak invested, any future transaction would be unlikely to take place with a price of less than £4.5bn, according to bankers. The AA, which has a large insurance division as well as its roadside recovery operations, remains weighed down by a substantial - albeit declining - debt burden. Its most recent set of financial results disclosed that it had £1.9bn of net debt, which it is gradually paying down as profitability improves. AA owners over the years The company has been through a succession of owners during the last 25 years. In 1999, it was bought by Centrica, the owner of British Gas, for £1.1bn. It was then sold five years later to CVC Capital Partners and Permira, two buyout firms, for £1.75bn, and sat under the corporate umbrella Acromas alongside Saga for a decade. The AA listed on the London Stock Exchange in 2014, but its shares endured a miserable run, being taken private nearly seven years later at little more than 15% of its value on flotation. Under the ownership of Towerbrook and Warburg Pincus, the company embarked on a long-term transformation plan, recruiting a new leadership team in the form of chairman Rick Haythornthwaite - who also chairs NatWest Group - and chief executive Jakob Pfaudler. For many years, the AA styled itself as \"Britain's fourth emergency service\", competing with fierce rival the RAC for market share in the breakdown recovery sector. Founded in 1905 by a quartet of driving enthusiasts, the AA passed 100,000 members in 1934, before reaching the one million mark in 1950. Last year, it attended 3.5 million breakdowns on Britain's roads, with 2,700 patrols wearing its uniform. The company also operates the largest driving school business in the UK under the AA and BSM brands. In the past, it has explored a sale of its insurance arm, which also has millions of customers, at various points but is not actively doing so now. By recruiting a third major shareholder last, the AA mirrored a deal struck in 2021 by the RAC. The RAC's then owners - CVC Capital Partners and the Singaporean state fund GIC - brought the technology-focused private equity firm, Silver Lake, in as another major investor. A spokesman for the AA declined to comment on Saturday."
    },
    {
        "title": "US-EU trade war fears reignite as Europe strikes back at Trump's threat",
        "description": "Fears of a US-EU trade war have been reignited after Europe refused to back down in the face of fresh threats from Donald Trump.",
        "url": "https://news.sky.com/story/us-eu-trade-war-fears-reignite-as-europe-strikes-back-at-trumps-threat-13373692",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-us-president_6925474.jpg?20250523200732",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-05-24 00:40:00",
        "Headline": "In recent days, the US president has again threatened once-allies with the spectre of tariffs. But he also said he would impose the levy on one of America's most successful companies: Apple. Markets have responded negatively to the news.",
        "Content": " Fears of a US-EU trade war have been reignited after Europe refused to back down in the face of fresh threats from Donald Trump. The word tariff has dominated much of the US president's second term, and he has repeatedly and freely threatened countries with them. Money blog: Trump sends message to UK on energy bills This included the so-called \"liberation day\" last month, when he unleashed tariffs on many of his trade partners. On Friday, after a period of relative calm which has included striking a deal with the UK, he threatened to impose a 50% tariff on the EU after claiming trade talks with Brussels were \"going nowhere\". The US president has repeatedly taken issue with the EU, going as far as to claim it was created to rip the US off. However, in the face of the latest hostile rhetoric from Mr Trump's social media account, the European Commission - which oversees trade for the 27-country bloc - has refused to back down. EU trade chief Maros Sefcovic said: \"EU-US trade is unmatched and must be guided by mutual respect, not threats. \"We stand ready to defend our interests.\" Fellow EU leaders and ministers have also held the line after Mr Trump's comments. Polish deputy economy minister Michal Baranowski said the tariffs appeared to be a negotiating ploy, with Dutch prime minister Dick Schoof said tariffs \"can go up and down\". French trade minister Laurent Saint-Martin said the latest threats did nothing to help trade talks. He stressed \"de-escalation\" was one of the EU's main aims but warned: \"We are ready to respond.\" Mr Sefcovic spoke with US trade representative Jamieson Greer and commerce secretary Howard Lutnick after Mr Trump's comments. Mr Trump has previously backed down on a tit-for-tat trade war with China, which saw tariffs soar above 100%. Read more:Trump accepts $400m plane from QatarJudge blocks Trump's Harvard foreign student ban  Sticking points Talks between the US and EU have stumbled. In the past week, Washington sent a list of demands to Brussels - including adopting US food safety standards and removing national digital services taxes, people familiar with the talks told Reuters news agency. In response, the EU reportedly offered a mutually beneficial deal that could include the bloc potentially buying more liquefied natural gas and soybeans from the US, as well as cooperation on issues such as steel overcapacity, which both sides blame on China. Stocks tumble as Trump grumbles Major stock indices tumbled after Mr Trump's comments, which came as he also threatened to slap US tech giant Apple with a 25% tariff. The president is adamant that he wants the company's iPhones to be built in America. The vast majority of its phones are made in China, and the company has also shifted some production to India. Shares of Apple ended 3% lower and the dollar sank 1% versus the Japanese yen and the euro rose 0.8% against the dollar."
    },
    {
        "title": "PM could lift controversial benefit cap in budget - as Farage makes two big election promises",
        "description": "Sir Keir Starmer could decide to lift the two-child benefit cap in the autumn budget, amid further pressure from Nigel Farage to appeal to traditional Labour voters.",
        "url": "https://news.sky.com/story/pm-could-lift-controversial-benefit-cap-in-budget-as-farage-makes-two-big-election-promises-13374193",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-keir-starmer-nigel-farage_6894583.jpg?20250423133018",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-05-24 22:47:00",
        "Headline": "Unrest has grown on the Labour backbenches over the prime minister's approach since winning power, while his unpopularity with the public was made clear at this month's elections. Reform UK reckon it stands to benefit from the disillusionment. ",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Sir Keir Starmer could decide to lift the two-child benefit cap in the autumn budget, amid further pressure from Nigel Farage to appeal to traditional Labour voters. The Reform leader will use a speech this week to commit his party to scrapping the two-child cap, as well as reinstating winter fuel payments in full. The prime minister - who took Westminster by surprise at PMQs by revealing his intention to row back on the winter fuel cut - has previously said he would like to lift the two-child cap if the government could afford it. There are now mounting suggestions an easing of the controversial benefit restriction may be unveiled when the chancellor delivers the budget later this year. According to The Observer, Sir Keir told cabinet ministers he wanted to axe the measure - and asked the Treasury to look for ways to fund the move. It comes after the government delayed the release of its child poverty strategy, which is expected to recommend the divisive cap - introduced by former Tory chancellor George Osborne - is scrapped.  Ministers have already said any changes to winter fuel payments, triggered by mounting political pressure, would only be made when the government's next fiscal event rolls round. The Financial Times reported it may be done by restoring the benefit to all pensioners, with the cash needed being clawed back from the wealthy through the tax system. The payment was taken from more than 10 million pensioners this winter after it became means-tested, and its unpopularity was a big factor in Labour's battering at recent elections. Before Wednesday's PMQs, the prime minister and chancellor had insisted there would be no U-turn. More from Sky News:PM's winter fuel claim 'not credible'Starmer vs Reeves - the 'rift' in Downing Street  Many Labour MPs have called for the government to do more to help the poorest in society, amid mounting concern over the impact of wider benefit reforms. Former prime minister Gordon Brown this week told Sky News the two-child cap was \"pretty discriminatory\" and could be scrapped by raising money through a tax on the gambling industry.  Mr Farage, who believes Reform UK can win the next election, will this week accuse Sir Keir of being \"out of touch with working people\". In a speech first reported by The Sunday Telegraph, he is expected to say: \"It's going to be these very same working people that will vote Reform at the next election and kick Labour out of government.\""
    },
    {
        "title": "Sir Alan Bates attacks 'kangaroo court' Post Office scheme after 'take it or leave it' offer",
        "description": "Sir Alan Bates has accused the government of presiding over a \"quasi kangaroo court\" for Post Office compensation.",
        "url": "https://news.sky.com/story/sir-alan-bates-attacks-kangaroo-court-post-office-scheme-after-receiving-take-it-or-leave-it-offer-13374194",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-alan-bates-horizon_6515491.jpg?20240409092117",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-24 22:56:00",
        "Headline": "Sir Alan Bates led a years-long effort, fighting for justice for sub-postmasters who were wrongly accused and prosecuted after faulty software made it look as if money was missing from their accounts.",
        "Content": "Sir Alan Bates has accused the government of presiding over a \"quasi kangaroo court\" for Post Office compensation. Writing in The Sunday Times, the campaigner, who led a years-long effort for justice for sub-postmasters, revealed he had been given a \"take it or leave it\" offer that was less than half of his original claim. \"The sub-postmaster compensation schemes have been turned into quasi-kangaroo courts in which the Department for Business and Trade sits in judgement of the claims and alters the goal posts as and when it chooses,\" he said. \"Claims are, and have been, knocked back on the basis that legally you would not be able to make them, or that the parameters of the scheme do not extend to certain items.\" More than 900 sub-postmasters were prosecuted between 1999 and 2015 after faulty Horizon accounting software made it look as if money was missing from their accounts. Many are still waiting for compensation despite the previous government saying those who had their convictions quashed were eligible for £600,000 payouts.  After the Post Office terminated his contract over a false shortfall in 2003, Sir Alan began seeking out other sub-postmasters and eventually took the Post Office to court. \n                  Capture: Victims of second Post Office scandal to receive 'recognition' payments before compensation\n                 \n                  Post Office to unveil £1.75bn banking deal with big British lenders\n                 \n                  Post Office auditor EY under investigation by accounting regulator FRC\n                 A group litigation order (GLO) scheme was set up to achieve redress for 555 claimants who took the Post Office to the High Court between 2017 and 2019. Sir Alan, who was portrayed by actor Toby Jones in ITV drama Mr Bates Vs The Post Office, has called for an independent body to be created to deliver compensation. He added that promises the compensation schemes would be \"non-legalistic\" had turned out to be \"worthless\". It is understood around 80% of postmasters in Sir Alan's group have accepted a full and final redress, or been paid most of their offer. Read more:Post Office scandal explainedWho are the key figures in the scandal?  A Department for Business and Trade spokesperson told Sky News: \"We pay tribute to all the postmasters who've suffered from this scandal, including Sir Alan for his tireless campaign for justice, and we have quadrupled the total amount paid to postmasters since entering government. \"We recognise there will be an absence of evidence given the length of time which has passed, and we therefore aim to give the benefit of the doubt to postmasters as far as possible. \"Anyone unhappy with their offer can have their case reviewed by a panel of experts, which is independent of the government.\""
    },
    {
        "title": "Ex-PM Boris Johnson and wife announce birth of their fourth child",
        "description": "Former prime minister Boris Johnson has welcomed his fourth child with his wife, Carrie Johnson.",
        "url": "https://news.sky.com/story/ex-pm-boris-johnson-and-wife-announce-birth-of-their-fourth-child-13373914",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-boris-johnson-carrie-johnson_6926065.jpg?20250524163336",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-05-24 15:06:00",
        "Headline": "Their daughter Poppy Eliza Josephine Johnson is the couple's fourth and \"final\" child, Carrie Johnson said on Instagram.",
        "Content": "Former prime minister Boris Johnson has welcomed his fourth child with his wife, Carrie Johnson. Mrs Johnson shared the news on social media of the birth of Poppy Eliza Josephine Johnson on 21 May. She wrote in a post on Instagram: \"I can't believe how pretty and tiny you are. Feel so incredibly lucky. We are all totally smitten. Not sure I've slept a minute since you were born as can't stop looking at how completely lovely you are.\" Poppy is the couple's fourth child, after Wilfred, Romy, and Frank. Mrs Johnson continued: \"Thank you so much to the amazing maternity team at UCLH and particularly to Asma and Patrick who have looked after me so well through all my pregnancies. I really cannot thank you guys enough. \"Wilf, Romy and Frank are utterly delighted, particularly Romy who was desperate for a little sister. Bring on the matching dresses.\" She said she is out of hospital and looking forward to \"cocktails and pizza with my tiny baby snoozing on my lap\". \"Life doesn't get any better,\" Mrs Johnson added. The couple married in May 2021. Their eldest, Wilf, was born in April 2020, followed by Romy in December 2021, and Frank in July 2023. Their daughter Poppy, who Mrs Johnson said is the \"final gang member\", is Mr Johnson's ninth child. Read more on Sky News:Man arrested after four people die in fireTrade wars reignate as EU strikes back against Trump Mr Johnson, 60, finally confirmed the number of children he had - at the time it was six - during an interview in 2021, after much speculation. He also has four children with ex-wife Marina Wheeler, and a child born in 2009 as a result of an affair with art consultant Helen Macintyre."
    },
    {
        "title": "Welsh Labour leader asks PM for 'fair share' of funding ahead of spending review",
        "description": "The first minister of Wales has asked Sir Keir Starmer for \"a fair share for Wales\" at a meeting in Downing Street.",
        "url": "https://news.sky.com/story/welsh-labour-leader-asks-pm-for-fair-share-of-funding-ahead-of-spending-review-13373711",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sir-keir-wales-eluned-morgan_6925653.png?20250524073209",
        "type": "Politics",
        "Author": "Ali Fortescue",
        "Date Published": "2025-05-24 06:06:00",
        "Headline": "The \"constructive\" discussion between Sir Keir Starmer and Baroness Morgan comes as her government prepares for a challenging set of elections next year. ",
        "Content": "\n          Political correspondent\n              @AliFortescue\n  The first minister of Wales has asked Sir Keir Starmer for \"a fair share for Wales\" at a meeting in Downing Street. Labour's Eluned Morgan, who was attending the Council of Nations and Regions meeting alongside metro mayors and fellow first ministers, says she made the case for more funding ahead of the spending review next month. Baroness Morgan says her meeting with Sir Keir was \"constructive\" and she was \"grateful\" to him for listening to the public on winter fuel payments. On Wednesday, Sir Keir said he would ease the cut to the winter fuel payment, something Ms Morgan previously called for. \"I've made it clear I'd like the vast majority of people who have received it before to receive it again,\" she said. It remains unclear where exactly the payment threshold will be. She also said the controversial two-child benefit cap was an issue \"lots of people brought up\", and the government is thinking about when and how to change it. Read more on Sky News:UN chief condemns 'teaspoon' of aid allowed into GazaUS-EU trade war fears reignitedBilly Joel cancels all upcoming concerts due to brain illness The meeting comes as Welsh Labour prepare for a challenging set of elections in the Senedd next year. Labour have been in power in Wales since devolution began in 1999, but polls currently predict a three-horse race between Plaid Cymru, Reform UK and Labour. The first minister accepted Reform could win power, saying they are a \"genuine threat\" to her party that they \"need to take seriously\". She said she understands the desire for change. \"They've never had the opportunity to vote for a female first minister before, that in itself is a big change\", Baroness Morgan said. Plaid Cymru leader Rhun ap Iorwerth, who, according to recent polls could be in power in Wales next year, said the first minister left Downing Street with \"nothing more than a photo with the prime minister\"."
    },
    {
        "title": "Government delays child poverty strategy - leaving tens of thousands facing hardship",
        "description": "The two-child benefit cap has been a raw nerve for the Labour party since long before they came to power.",
        "url": "https://news.sky.com/story/government-delays-child-poverty-strategy-leaving-tens-of-thousands-facing-hardship-13373773",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-child-poverty_6925754.png?20250524113454",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-05-24 09:48:00",
        "Headline": "The government's child poverty taskforce was due to report back this spring - but publication has now been pushed back to later this year.",
        "Content": "\n          Political correspondent\n              @amandaakass\n The two-child benefit cap has been a raw nerve for the Labour party since long before they came to power. It's become increasingly exposed amid internal party divisions over the government's forthcoming welfare reforms, which are expected to push another 250,000 people into poverty, including 50,000 children. Lifting the cap could raise up to 350,000 children out of poverty, according to the Institute for Fiscal Studies. A left-wing rebellion over the issue just weeks after the general election saw seven of the party's MPs lose the whip. But in a bid to show he was still committed to tackling the problem - while also kicking the ball down the road - Keir Starmer set up a child poverty taskforce, which promised to look at policies to tackle the \"root causes\" of the issue. That taskforce was due to report in the \"spring\" - which should be any day now. But now, as first reported by the Guardian, the Department of Work and Pensions has confirmed it has decided to push back publication until later in the year, to ensure its \"ambitious child poverty strategy\" can deliver \"fully funded measures\". I understand that means the announcements will be made as part of the autumn statement - and it looks like the prime minister is now backing a change on the cap. Welsh First Minister Eluned Morgan told Sky News on Friday that the policy was an issue \"lots of people brought up\", and the government is thinking about when and how to change it. Scrapping the two-child benefit cap is seen by charities as the most effective way of pulling children out of poverty. But doing so will come at a cost, estimated to be some £2.5bn. The prime minister has previously suggested he would like to lift the cap, but only when the fiscal situation allows. This promise was one of the government's key public declarations of responsibility to the financial markets. But this week he's signalled he's prepared to U-turn over the other flashpoint policy - means testing the winter fuel allowance. Read more on Sky News:Three boys and a woman die in house fireWhy Russian troops are massing near Kharkiv Under pressure from concerned MPs and activists riled up by thousands of angry doorstep conversations during their recent local election debacle, he is prepared to move. He's justified that change by arguing it was right to look again at the measure \"as the economy improves\". But if that's the case - why not do the same for children as for pensioners? Charities estimate the two-child benefit cap pushes another 100 children into poverty every day, which would affect another 20,000 by the time of the budget. Some Labour MPs are prepared to criticise the delay publicly. Neil Duncan-Jordan told me: \"Millions of families will be devastated by the delay in tackling the scandal of child poverty... the need to act is now.\" But others, including Helen Barnard, from the Trussell Trust charity, have argued the delay might not be such a bad thing, posting on X: \"This may be good news. Better a delayed child poverty strategy with measures to really protect children from hunger and hardship than one hitting the deadline but falling short on substance.\" It's unclear how the government would fund such a change. This week, former PM Gordon Brown told Sky News' Sophy Ridge they should be looking at a gambling tax to find the cash. By giving ground now on winter fuel and hints on child benefit, Sir Keir may be hoping to head off the fermenting rebellion on his planned welfare cuts. But those MPs angry about welfare cuts are also incensed about child poverty - and today's news will likely only embolden their resistance."
    },
    {
        "title": "Hannah Gutierrez-Reed: Weapons supervisor convicted in fatal shooting on Alec Baldwin film set freed from jail",
        "description": "A weapons supervisor who was jailed for involuntary manslaughter over the fatal shooting of Halyna Hutchins on the set of the Alec Baldwin movie, Rust, has been freed.",
        "url": "https://news.sky.com/story/hannah-gutierrez-reed-weapons-supervisor-convicted-in-fatal-shooting-on-alec-baldwin-film-set-freed-from-jail-13373872",
        "image_url": "https://e3.365dm.com/22/04/1920x1080/skynews-alec-baldwin-rust-shooting_5751640.jpg?20220426014753",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-05-24 14:07:00",
        "Headline": "Gutierrez-Reed, who was jailed for a maximum 18 months, was released on Friday to Arizona, after completing her sentence, but will be on both parole and probation.",
        "Content": "A weapons supervisor who was jailed for involuntary manslaughter over the fatal shooting of Halyna Hutchins on the set of the Alec Baldwin movie, Rust, has been freed. Hannah Gutierrez-Reed was released on parole from the Western New Mexico Correctional Facility in Grants on Friday, after serving her 18-month sentence, NBC News, Sky's US partner said, quoting New Mexico Corrections Department spokesperson, Brittany Roembach. Gutierrez-Reed was released to return home to Bullhead City, Arizona, where she will be on parole for a year for the manslaughter case. She was in charge of weapons during the production of the Western film in Santa Fe, New Mexico, in October 2021, when a prop gun held by star and co-producer Alec Baldwin went off during a rehearsal. Cinematographer Hutchins died following the incident, while director Joel Souza was injured. Gutierrez-Reed was acquitted of charges of tampering with evidence in the investigation, but will be on probation over a separate conviction for unlawfully carrying a gun into a Santa Fe bar where firearms are banned weeks before Rust began filming. Involuntary manslaughter means causing someone's death due to negligence, without intending to. At her 10-day trial in New Mexico in March last year, prosecutors blamed Gutierrez-Reed for unwittingly bringing live ammunition onto the set of Rust and for failing to follow basic gun safety protocols. The 18-month sentence she was given was the maximum available for the offence. Baldwin, 67, was also charged with involuntary manslaughter, but the case was dramatically dismissed by the judge during his trial last July over mistakes made by police and prosecutors, including allegations of withholding ammunition evidence from the defence. The actor had always denied the charge, maintaining he did not pull the gun's trigger and that others on the set were responsible for safety checks on the weapon. Rust was finished in Montana and released earlier this month, minus the scene they were working on when Hutchins was shot, Souza, speaking at November's premiere in Poland, said. Rust is billed as the story of a 13-year-old boy who, left to fend for himself and his younger brother following their parents' deaths in 1880s Wyoming, goes on the run with his long-estranged grandfather after being sentenced to hang for the accidental killing of a local rancher."
    },
    {
        "title": "The Phoenician Scheme: Is this every Hollywood actor's ultimate bucket list job?",
        "description": "Wes Anderson is a rarity in Hollywood, with an unswayed distinct aesthetic which has every big name in Hollywood pleading to be in his next project.",
        "url": "https://news.sky.com/story/the-phoenician-scheme-is-this-every-hollywood-actors-ultimate-bucket-list-job-13373694",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-wes-anderson-the-phoenician-scheme_6925637.jpg?20250524032826",
        "type": "Entertainment",
        "Author": "Debbie Ridgard",
        "Date Published": "2025-05-24 02:05:00",
        "Headline": "The latest Wes Anderson film, The Phoenician Scheme, has been released in cinemas and boasts a cast of Benicio del Toro, Michael Cera, Mia Threapleton, Tom Hanks, Jeffrey Wright, Scarlett Johansson, Bryan Cranston and Riz Ahmed.",
        "Content": "\n          Entertainment reporter\n              @Debbie_Ridgard\n  Wes Anderson is a rarity in Hollywood, with an unswayed distinct aesthetic which has every big name in Hollywood pleading to be in his next project. Fronted by Benicio del Toro, his new film The Phoenician Scheme sees the return of numerous previous collaborators including Tom Hanks, Jeffrey Wright and Scarlett Johansson, but also adds new faces to the Anderson universe. It is set in the 1950s and follows a ruthless yet charismatic European business tycoon called Zsa-Zsa Korda who, in Anderson's own words, \"has very little obligation to honour the truth.\" Looking to solidify his own legacy, without much thought for his 10 children, the slaves he wants to use or the land he wants to exploit, Sza-Sza chases multiple deals so he can build his career-defining project, Korda Land and Sea Phoenician Infrastructure Scheme. 'A motivation pill The Phoenician Scheme was partly inspired by the life of Anderson's father-in-law, whom he dedicated the film to, Lebanese businessman Fouad Malouf. Del Toro tells Sky News it was a gift to play a truly unique character. \"It's like taking a motivation pill,\" he says. \"You're motivated because it's Wes Anderson, you're motivated because of the script and the story and the character. It's unpredictable, original. [There's] one hell of an arc, and it's full of contradictions.\" Always an actor in mind - well, mostly… Michael Cera, who plays Bjorn, says he had a \"sense of dread\" joining the cast. His role was written with him in mind, something he still can't believe is true. \"[Anderson] has got every actor at his disposal, you'd imagine,\" he says. With production pushed back due to an actors' strike, Cera feared the project might \"fall apart\". \"I was not really at ease until we were there,\" he admits. Every detail is meticulously planned in the Anderson film universe - from the art on the walls (original works from Renoir and Magritte in this case), to the intricate backstory of a character collecting fleas in a plastic bag as a child. While most roles are written by the Fantastic Mr Fox filmmaker with certain actors in mind - the exception this time is Liesl, the daughter of the business tycoon. The dream phone call After months of an audition process, Mia Threapleton got the call to play the straight-talking nun who is beckoned by her father to inherit the family business after his sixth near-death experience. The 24-year-old daughter of Kate Winslet got the news via a call from her agent while she was on the train - and was in such disbelief she told her to call them back. \"I didn't believe them - and she laughed at me [and said] 'of course I'm not lying to you, this is true'. And then I sat on the floor and I cried.\" More entertainment news:Billy Joel cancels upcoming gigsMarvel's next Avengers films delayed Del Toro believes it was Threapleton's screen test where she stood out as an \"inventive\" actor who thought on her feet that got her the part, having fashioned part of a makeshift nun costume with a napkin from a lunch tray. \"I said, 'is there anyone who got any hairpins?' And I pinned it to my head.\" Ticking a Wes Anderson film off the bucket list is a goal for many actors. Threapelton says she still hasn't come to terms with achieving it so early in her career. The Phoenician Scheme is in cinemas now."
    }
]