[
    {
        "title": "At least five killed after Mormon church in Michigan set on fire during mass shooting",
        "description": "Five people have been killed and at least eight injured after a mass shooting and fire at a Mormon church in Michigan, police have said.",
        "url": "https://news.sky.com/story/several-people-shot-at-mormon-church-in-michigan-13440437",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-fire-shooting-grand-blanc_7035243.jpg?20250928181937",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-28 15:36:00",
        "Headline": "The shooting took place at the Church of Jesus Christ of Latter-day Saints in Grand Blanc, about 50 miles north of Detroit.",
        "Content": " Five people have been killed and at least eight others injured after a mass shooting and fire at a Mormon church in Michigan, police have said. The suspect was shot dead by police officers, authorities said at a news conference. The incident took place at around 10.25am local time at the Church of Jesus Christ of Latter-day Saints in Grand Blanc Township, Michigan, about 50 miles north of Detroit. The suspect has been identified as Thomas Jacob Sanford, 40, from the nearby city of Burton. Police said he was \"neutralised at 10.33am\" local time. He served in the Marines and was deployed to Iraq, Sky's sister US network NBC reports. The shooter drove a vehicle through the front doors of the church before opening fire with an assault rifle.The suspect exited the vehicle and began firing rounds at people who were attending Sunday service, police said. He then deliberately started the blaze. The blaze has been extinguished but authorities believe they will find additional victims in the charred building. \n                  Donald Trump: Fact-checking the president's speech in Michigan\n                 \n                  US election: Michigan voters feel 'overlooked' by Harris campaign\n                 \n                  'We've had a lot of good energy here': University students handed cookies for voting early in Michigan\n                 At around 8pm on Sunday (1am in the UK), Grand Blanc Township Chief William Renye confirmed that a further two victims were found in the burned remains of the church, in addition to two other victims who had suffered gunshot wounds.As many as three improvised devices were found at the scene, according to two senior US law enforcement officials briefed on the investigation, NBC reported. According to Renye, when gunfire broke out, people inside the church bravely put themselves at risk to protect the children. \"They were shielding the children who were also present within the church, moving them to safety,\" he said. \"Just extreme courage.\" Renye said law enforcement officers arrived at the church within 30 seconds of receiving a 911 call. The suspect was \"neutralized\" in the back parking lot within eight minutes by a Department of Natural Resources officer and a Grand Blanc Township officer, he said. Michigan governor Gretchen Whitmer said in a statement that \"my heart is breaking for the Grand Blanc community\" after the shooting. She added: \"Violence anywhere, especially in a place of worship, is unacceptable. I am grateful to the first responders who took action quickly.\" Sheriff: 'Entire church is on fire' Genesee County sheriff Christopher Swanson said at around 12.20pm that the \"entire church is on fire\", and confirmed that people who were at the church have been evacuated. Around 20 minutes later, the police department said the fire had been contained. US attorney general Pam Bondi also confirmed the FBI and the Bureau of Alcohol, Tobacco, Firearms and Explosives were responding to the incident. US President Donald Trump said on Truth Social that \"the suspect is dead, but there is still a lot to learn\", before saying the shooting \"appears to be yet another targeted attack on Christians in the United States of America\". He added: \"PRAY for the victims, and their families. THIS EPIDEMIC OF VIOLENCE IN OUR COUNTRY MUST END, IMMEDIATELY!\" In the wake of the shooting and fire, the New York Police Department said it would deploy officers to religious institutions across the city \"out of an abundance of caution\". The incident occurred the morning after Russell M Nelson, the oldest-ever president of The Church of Jesus Christ of Latter-day Saints, died at 101. Shootings reported in North Carolina, New Orleans, Texas Meanwhile, authorities responded to a mass shooting at a coastal town in North Carolina late on Saturday, where three people were killed. At least eight others were injured in that incident, where someone opened fire from a boat into a crowd at a bar. Another shooting took place at a south Texas casino early on Sunday, with seven people shot and two killed. A woman was also killed, and three others were injured in Bourbon Street, New Orleans, early on Sunday after a shooting."
    },
    {
        "title": "Russia's clear warning that it can easily chip away at Europe's defences",
        "description": "The brutality of Russia's drone assaults on Ukraine's towns and cities shows no let up.",
        "url": "https://news.sky.com/story/why-drones-are-proving-critical-as-russia-sends-a-clear-warning-to-europe-13440471",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-russia-drone_7035435.jpg?20250928203229",
        "type": "Home",
        "Author": "Diana Magnay",
        "Date Published": "2025-09-28 16:18:00",
        "Headline": "Germany and Denmark are the latest countries to raise the alarm over drone sightings and unexplained drone activity.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n The brutality of Russia's drone assaults on Ukraine's towns and cities shows no let up. \"Savage strikes, a deliberate targeted terror\" is how the Ukrainian President Volodymyr Zelenskyy described the latest overnight bombardment. Some 595 attack drones and 48 missiles were involved and even if only a small fraction made it through Ukrainian air defences, the destruction - in Sumy and Odessa, Zaporizhia and Kyiv - is significant.    Also overnight, Denmark reported yet more drone sightings. It has not named Russia directly but after a week in which unidentified drones have resulted in the temporary shutdown of military and civilian airports, it is banning all civil drone flights and describing the threat as a hybrid attack. Germany is also raising the alarm over unexplained drone activity along its border with Denmark. Germany's interior minister said on Saturday: \"We are witnessing an arms race, an arms race between drone threats and drone defences. It is a race we cannot afford to lose.\" NATO is having to deploy extra assets to beef up its Baltic Sea defences and its Eastern flank. European nations are working to establish a drone wall along their borders with Russia and Ukraine. Germany is setting up a drone defence centre to make sure it has what it needs to protect itself. The Kremlin is forcing NATO to divert assets to protect its airspace and sub-sea infrastructure at a time when Europe is trying to work out how best to support and finance Ukraine. Read more:Putin's top diplomat issues warningWhy Trump has made a U-turn With drones an inexpensive element of its hybrid warfare arsenal, Russia is sending a clear warning that it can relatively easily chip away at Europe's defences and that Europe had better focus on protecting itself. \"If NATO begins to look too rattled, that actually is encouragement for Putin precisely to step up the pressure,\" says Mark Galeotti, a specialist in Russian security. \"So really we need to be holding our nerve. \"Yes, reserving the right to shoot things down that look like direct threats, but otherwise actually talking down, not talking up, the nature of the threat while of course we arm so that we are even more prepared.\" Last week, Estonia said its fighter jets had escorted three Russian MIG fighter jets out of their airspace after a 12-minute incursion, which Russia denies ever took place.  On Saturday, Estonia pledged €10m (£8.7m) to NATO's \"Prioritised Ukraine Requirement List\" or PURL programme, which sees US-produced weapons, paid for by NATO's European partners, fast-tracked to Ukraine. Zelenskyy posted on Sunday after speaking with the NATO secretary general that PURL is moving forward well. And that is just what Russia is trying to prevent."
    },
    {
        "title": "Chancellor to make case for 'contribution' ahead of youth jobs guarantee",
        "description": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment.",
        "url": "https://news.sky.com/story/chancellor-to-make-case-for-contribution-ahead-of-youth-jobs-guarantee-13440405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-chancellor_7029992.jpg?20250924035136",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today.",
        "Content": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment. The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today. She is expected to confirm plans for every young person who has received universal credit (UC) for 18 months without \"earning or learning\" to be guaranteed an offer of paid work. Labour conference in Liverpool - follow live updates Those who refuse to take up jobs without a \"reasonable excuse\" will face sanctions such as losing their benefits, it is understood. The guarantee, which will be overseen by Work and Pensions Secretary Pat McFadden, forms part of a pledge of \"nothing less than the abolition of long-term youth unemployment\". Ms Reeves is expected to say: \"I believe in a Britain founded on contribution - where we do our duty for each other, and where hard work is matched by fair reward. \n                  If stuff doesn't work for Starmer - the vibes will be out of control\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 \"I believe in a Britain based on opportunity - where ordinary kids can flourish, unhindered by their background. \"And I believe that Britain's real wealth is found not only in the success of the fortunate few, but in the talents of all our people, in every part of our great country.\"  It comes in the wake of concerns among some Labour members that the government needs to offer voters a clearer vision of its agenda. Sir Keir Starmer has previously avoided using buzzwords to define his politics, but thinktank Labour Together published a paper last week in which it argued the concept of contribution should be put at the heart of policymaking. Read more:Burnham warns Labour not to 'underestimate the peril' party is inLabour promise changes to indefinite leave to remainMahmood vows migration law reforms Ms Reeves is expected to add: \"We won't leave a generation of young people to languish without prospects - denied the dignity, the security and the ladders of opportunity that good work provides. \"Just as the last Labour government, with its new deal for young people, abolished long-term youth unemployment I can commit this government to nothing less than the abolition of long-term youth unemployment. \"We've done it before and we'll do it again.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Mel Stride, the shadow chancellor, accused Labour of \"contradictions\" within their policies. He said: \"Rachel Reeves says she wants to abolish youth unemployment - yet in her very first budget, she introduced a £25bn jobs tax that made it more expensive for businesses to hire, especially young people. \"That's the contradiction at the heart of Labour's plan: they talk about opportunity, but their policies kill jobs. \"Since Labour came to power, unemployment is up. Business confidence is down. And now Reeves is trying to fix a problem she created - while pointing the finger of blame, as she so often does, at everyone else.\" Chancellor Rachel Reeves will be speaking to Sky News at 7.15am this morning ahead of her speech at the conference at midday."
    },
    {
        "title": "Andy Burnham warns Labour not to 'underestimate the peril' party is in",
        "description": "Andy Burnham has hit out at allies of Sir Keir Starmer for \"demanding simplistic statements of loyalty\", claiming they are underestimating the \"peril\" Labour is in. ",
        "url": "https://news.sky.com/story/andy-burnham-warns-labour-not-to-underestimate-the-peril-party-is-in-13440515",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-burnham-labour_7035455.jpg?20250928205330",
        "type": "Home",
        "Author": "Faye Brown",
        "Date Published": "2025-09-28 16:58:00",
        "Headline": "The mayor of Greater Manchester says the local elections next year pose a huge challenge and his interventions are about sparking a debate about Labour's direction.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Andy Burnham has hit out at allies of Sir Keir Starmer for \"demanding simplistic statements of loyalty\", claiming they are underestimating the \"peril\" Labour is in.  The mayor of Greater Manchester insisted his recent interventions have not been about \"personal ambition\", but starting an \"open debate\" about the direction of the party ahead of potentially catastrophic local and devolved elections next year. In the lead up to Labour's annual conference in Liverpool this week, the so-called \"King of the North\" has accused Sir Keir of having no vision for the country, while setting out his own policy proposals. Follow the latest from our politics team  It has fuelled mounting speculation he could launch a future leadership challenge against the prime minister, who in turn has compared Mr Burnham to Liz Truss. At a fringe event on the opening day of the conference, the Northern mayor said: \"I was clear in the interviews I gave last week, I wanted to launch a debate about the direction of the party and getting a plan to beat Reform UK. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  London mayor Sadiq Khan hits out at 'misinformation' as new figures show fall in crimes\n                 \"Those out there making calls for simplistic statements of loyalty are underestimating the peril the party is in.\" Two polls this week have predicted Reform UK leader Nigel Farage will become the next prime minister, while a poll of Labour members found more than half of them don't want Sir Keir to fight the next general election. Mr Burnham later turned up to a rally about Proportional Representation (PR), in which he insisted he wanted \"this government to work\". He received a rapturous reception as he entered the room, flanked by over a dozen photographers. Mr Burnham made light of the attention, quipping that \"there's nothing more unstoppable than an idea whose time has come\", in reference to PR. But this was not the focus of the punchy speech that followed, in which he criticised the Labour leadership's handling of dissent, saying a \"climate of fear\" was preventing MPs from having an \"open debate\" about the direction of the party. 👉Listen to Politics at Sam and Anne's on your podcast app👈 A handful of Labour MPs have been suspended over the past year for criticising the government on issues like welfare reform and the two child benefit cap, but Mr Burnham has the freedom to be outspoken as he is not a member of parliament. He said he had been accused of \"all sorts of things\" in the past week but had done \"nothing more than launch a debate\". Mr Burnham drew clear dividing lines in a recent interview with The New Statesman, as he said the country should be \"less in hock to the bond markets\", called for a greater focus on council housing and said public utilities should be nationalised. It fuelled speculation of an impending leadership challenge, given Mr Burnham fought twice to run the Labour Party while he was an MP, before stepping down in 2017 to run for the metro mayor position. He has not ruled out a return to Westminster and last week claimed Labour MPs have privately asked him to stand. Sir Keir tried to shut down the narrative by suggesting Mr Burnham's policies would unleash the economic chaos of Ms Truss, whose fatal mini budget sent the markets into meltdown, as he dismissed the \"personal ambitions of the mayor\". However, in a direct message to \"those who say that I'm speaking out purely for my own ambition\", a defiant Mr Burnham said: \"I can say to you tonight I am speaking out for the thousands of councillors here at this conference who are worried about going to those doorsteps next May, speaking for the members of the Senedd who, again, are working hard to keep Wales Labour... and, of course, members of the Scottish parliament as well, who want a stronger story about Labour to go to those doorsteps. \"I'm speaking out for the millions of good people around Britain who want a more hopeful direction for the country. \"I think we can do it. I honestly believe it can be done. We can make this government work, we can find that more hopeful direction and we can win again at the next general election.\" The speech was met with a big round of applause from members, while one Labour MP told Sky News it was a \"great speech\". And while cabinet ministers have called for the party to unite behind the prime minister to fight Reform UK - there appeared to a change in tone from Wes Streeting as the first day of conference drew to a close. The health secretary told a fringe event that the government must be \"open to challenge\" from within. He said: \"We've got to be self-confident enough as ministers to be open to challenge, and openly debate different ideas, because it makes you stronger as a government.\""
    },
    {
        "title": "London mayor Sadiq Khan hits out at 'misinformation' as new figures show fall in crimes",
        "description": "Sadiq Khan has hit back at politicians \"spreading misinformation\" about safety in London as new data shows the number of violent crimes leading to injury has fallen in every borough over the past year.",
        "url": "https://news.sky.com/story/london-mayor-sadiq-khan-hits-out-at-misinformation-as-new-figures-show-fall-in-crimes-13440442",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sadiq-khan-donald-trump_7030271.jpg?20250924120816",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "Sir Sadiq Khan's comments come after renewed attacks from US President Donald Trump - who recently claimed \"crime in London is through the roof\".",
        "Content": "Sadiq Khan has hit back at politicians \"spreading misinformation\" about safety in London as new data shows the number of violent crimes leading to injury has fallen in every borough over the past year. Figures from the mayor's office for policing and crime compare the 12 months ending in August 2025 with the previous 12 months - and show there were 8,749 fewer crimes which resulted in someone being hurt, a drop of nearly 12%. The borough of Havering in east London recorded the largest drop (16.3%) followed by Enfield in north London (16.1%). The smallest decreases were in Greenwich (4.3%) and Kensington and Chelsea (4.6%). Sir Sadiq said: \"We've seen a number of politicians here and across the globe talking down London and spreading misinformation about crime and safety in the capital. \"The evidence is clear, our approach to tackling crime and its complex causes works. It's driving down violence right across the capital.\" His comments come after Donald Trump reignited his feud with Sir Sadiq earlier this month by accusing him of doing a \"terrible job\" and claiming \"crime in London is through the roof\". \n                  Play hard, party harder: England's Red Roses revel in World Cup glory at London celebrations\n                 \n                  Nursery worker who kicked, punched and pinched children in her care is jailed\n                 \n                  Barry George charged with rape and indecent assault\n                 The US president also hit out at the mayor in a speech at the UN General Assembly on Tuesday, where he also made the outlandish claim that London \"wants Sharia law\" - something there is no evidence for.  Asked about the attacks, Sir Sadiq said: \"I think President Trump has shown he is racist, he is sexist, he is misogynistic, and he is Islamophobic.\" He added that the public would be \"wondering what it is about this Muslim mayor who leads a liberal, multicultural, progressive, successful city that means I appear to be living rent-free inside Donald Trump's head\". Read more:Trump's jaw-dropping weekStarmer hits out at Reform's 'racist' policy According to the mayor's office, overall homicides in London are at a 10-year low, and the city's rate is lower than in Berlin, Brussels, Madrid, Paris and all major US cities. The rate of homicide was down by 17% in the 12-month period to June this year compared with the 12-month period to May 2016, it previously said. Metropolitan Police Assistant Commissioner Rachel Williams said: \"We're targeting the most dangerous individuals, disrupting criminal networks, and investing in prevention to protect those most at risk. \"That's why fewer people are being hurt, fewer lives are being lost, and London is becoming a safer city.\" The Conservatives rejected the suggestion that London is safer. Shadow home secretary Chris Philp said: \"Under this Labour mayor, criminals know the odds are stacked in their favour. \"Only one in 20 robberies is solved, fewer offenders are being jailed, and more than a thousand police officers have been cut from the Metropolitan Police, with Sir Mark Rowley warning of further losses this year. \"Londoners don't feel safer because London isn't safer.\""
    },
    {
        "title": "Team Europe win Ryder Cup in nail-biting finale",
        "description": "Team Europe have won the Ryder Cup in New York - despite a last-minute fightback from Team USA.",
        "url": "https://news.sky.com/story/team-europe-retain-ryder-cup-in-nail-biting-finale-13440308",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ryder-cup-2025-winner-europe-with-trophy_7035575.jpg?20250928233630",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-28 13:57:00",
        "Headline": "Tensions have frequently boiled over at this year's contest, with multiple spectators being ejected and Rory McIlroy at one point telling an attendee to \"shut the f*** up\".",
        "Content": " Team Europe have won the Ryder Cup in New York - despite a last-minute fightback from Team USA. Team Europe finished day two of the tournament with an unprecedented 11.5-4.5 lead. They then inched closer to the 14 points needed to retain the trophy before any players had even teed off on Sunday, after both teams were awarded half a point when Viktor Hovland was forced to pull out due to injury. A final day fightback saw the host side roar back into contention with a series of tight wins before Europe reached the all-important 14 points to retain the trophy thanks to a putt from Shane Lowry. Tyrrell Hatton's draw with Collin Morikawa landed Europe the final half point needed to win. Tensions have frequently boiled over at this year's contest, with multiple spectators at Bethpage Black in New York being ejected as Luke Donald's Europe dominated on Saturday. Rory McIlroy has frequently been on the receiving end of boos and heckles - some of which were led by the Ryder Cup first-tee announcer over a megaphone on Saturday. \n                  Ryder Cup 2031 to take place at Camiral in Girona, Spain as tournament heads to continental Europe for fourth time\n                 \n                  Ryder Cup: Rory McIlroy expresses concerns over Ian Poulter captaincy hopes but hopes for Jon Rahm involvement in 2025\n                 \n                  Ryder Cup: Fire breaks out at Marco Simone golf club, venue for the tournament last weekend\n                 Heather McMahan encouraged a chant of \"f*** you Rory\" ahead of the morning session. She has apologised and stepped down from her role, the PGA of America said on Sunday. Later on Saturday, McIlroy hit back by telling a spectator to \"shut the f*** up\" while his teammate Shane Lowry was seen being held back by his caddie as he tried to confront someone.  The players themselves have also clashed, with America's Bryson DeChambeau confronting Europe's Justin Rose after he asked his caddie to move while he was lining up a putt. Extra security and police officers were drafted in to control fan behaviour while big screens showed warnings about spectator noise. Holding back the tears after a draining week, McIlroy said of Europe's victory: \"I am extremely proud to be a part of this team. \"As soon as we won in Rome, we turned our attentions to doing something that was pretty impossible to do - to win in America and in New York. \"It's been an amazing week. To hear the 'Ole Ole's' here in America, to do something people thought we couldn't do, the comments after Whistling Straits (in 2021), decades of American dominance - we took a lot from that, we let it fuel us.\"  He added: \"We got so lucky in getting an incredible leader in Luke Donald and he shepherded us through the process and he's been amazing. \"Eleven of the 12 players from Rome came back. We did what we needed to do and we are going to celebrate like there is no tomorrow.\""
    },
    {
        "title": "Woman raped by group of men in Oxfordshire churchyard",
        "description": "A woman has been raped outside a church in Oxford by a group of men, police have said.",
        "url": "https://news.sky.com/story/woman-raped-by-group-of-men-in-oxfordshire-churchyard-13440491",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-banbury-st-marys-church_7035195.jpg?20250928174830",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-28 16:33:00",
        "Headline": "The woman, who is in her 30s, was attacked in the early hours of Sunday morning.  Police are urging a woman who tried to stop the attack to come forward.",
        "Content": "A woman has been raped outside a church in Oxford by a group of men, police have said. The woman, who is in her 30s, was attacked in the churchyard of St Mary's and the surrounding area of Banbury town centre in the early hours of Sunday morning, Thames Valley Police said. The force is appealing for a woman who tried to stop the attack and help the victim to come forward. Detective Sergeant Mark Personius said they do not have a description of the \"good Samaritan\" but encouraged the person to contact police as she might have \"vital information that can help us piece together what happened\".  \"This is a horrific crime and Thames Valley Police is conducting a thorough investigation to identify the offenders,\" DS Personius added. \"The town centre would have been busy on a Saturday night into the early hours of a Sunday morning, therefore, I would also appeal to anyone else who saw or heard anything in the area between about 12am and 2.30am this morning to come forward.\" He said a scene watch is in place at the church to enable the force to carry out forensic examinations. Officers have also been instructed to carry out house-to-house and CCTV inquiries."
    },
    {
        "title": "Arrests made as Palestine Action supporters protest at Labour conference in Liverpool",
        "description": "Protesters supporting Palestine Action have been arrested outside the Labour party conference in Liverpool.",
        "url": "https://news.sky.com/story/arrests-made-as-palestine-action-supporters-protest-at-labour-conference-in-liverpool-13440517",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-liverpool-protest-palestine_7035236.jpg?20250928181311",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-09-28 17:02:00",
        "Headline": "Merseyside Police confirmed on Sunday afternoon that officers were in attendance at a protest organised by the Defend Our Juries group near the conference venue. ",
        "Content": " Protesters supporting Palestine Action have been arrested outside the Labour party conference in Liverpool. Around 100 people gathered on Sunday near the conference venue where they silently held signs reading \"I oppose genocide, I support Palestine Action\", Defend Our Juries - which organised the protest - said. Palestine Action was banned as a terror organisation in July after it claimed responsibility for an incident which saw two planes damaged at RAF Brize Norton in June. A Merseyside Police spokesman said: \"We can confirm that officers are in attendance at a Defend Our Juries protest near to The Wheel of Liverpool this afternoon, Sunday 28 September. \"Some of the people in attendance have displayed material in support of Palestine Action. \"Officers are in the process of making arrests on suspicion of wearing/carrying an article supporting a proscribed organisation.\" A spokesman for Defend Our Juries said: \"We've come to remind everyone that the Labour Party is in breach of its duty to act to prevent genocide under international law. \n                  Sally Rooney says she's been told not to enter UK because she may be arrested\n                 \n                  First people charged with supporting Palestine Action plead not guilty\n                 \n                  New Banksy artwork to be removed from Royal Courts of Justice after report of criminal damage\n                 \"Instead it made the cowardly decision to ban the direct action group that was trying to prevent genocide.\" The spokesman added: \"Instead of shutting down protest, it's time the Labour Party took the responsibility to prevent genocide seriously and impose blanket sanctions on Israel including stopping the flow of arms from factories in this country.\" Israel has repeatedly denied claims of genocide, with Israeli Prime Minister Benjamin Netanyahu telling the UN on Friday: \"If Hamas agrees to demands, war could end.\" Sunday marked the first day of Labour's four-day annual conference - where the prime minister has vowed to show the party can be an alternative to the \"toxic divide and decline\" offered by Reform UK."
    },
    {
        "title": "If stuff doesn't work for Starmer - the vibes will be out of control",
        "description": "If Sir Keir Starmer keeps the focus on vibes alone at this conference, he'll probably do just fine here in Liverpool.",
        "url": "https://news.sky.com/story/if-stuff-doesnt-work-for-starmer-the-vibes-will-be-out-of-control-13440669",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-exit_7034600.jpg?20250928104442",
        "type": "Home",
        "Author": "Sam Coates",
        "Date Published": "2025-09-28 20:08:00",
        "Headline": "The big lingering question for Sir Keir Starmer is not about vibes and not about personnel. It's about whether any of it will actually work.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n If Sir Keir Starmer keeps the focus on vibes alone at this conference, he'll probably do just fine here in Liverpool. Flags. Patriotism. Determination. Change. Grit. Frustration. Optimism. The word cloud on Tuesday will come out just fine. And there's no doubt he's helped along the way by the faux fight with the King of the North. Government aides were laughing at yet another Andy Burnham this morning - having renounced the Bond Markets, he's now denounced the renunciation. They're not worried. But the big lingering question is not about vibes and not about personnel. It's about whether any of it will actually work. Policy - not Sir Keir's strong suit - is absolutely fundamental to delivering the change he harps on about, and will ultimately determine whether this government succeeds. Follow the latest from our politics team Because the problem of this government, and its interminable obsession with who is up and who is down, is because until now Sir Keir has lacked a vision of change the country can get behind - something he pleaded guilty to on TV this morning by saying he would fix that this week. Without policy, it is hard for the people in Liverpool to have passion. Absent this morning is any conversation about the biggest challenge facing this government - the £30bn black hole. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 The government is having three meetings a week about it, yet the prime minister has conspicuously nothing new to say about it and no desire to say it. The chancellor suggested additional growth from a youth mobility scheme. Not only is that policy not signed off, but the idea that it would touch the sides of the £30bn black hole is, as ex-Institute for Fiscal Studies (IFS) director Paul Johnson points out, for the birds. This is one challenge that Ben Nunn, Rachel Reeves's director of communications, will not have to worry about if he agrees to return to Number 10 after the budget to plug the gaps as I revealed on the Politics At Sam And Anne's podcast.  There will be some defence of the fiscal position in Monday's Reeves speech. But the kindest explanation more generally about the absence of discussion about the black hole from a ministerial aide was that it would come after conference season with \"difficult\" conversations with the Parliamentary Labour Party. But equally, why do today what you can put off until tomorrow. So then there is a question of the policy they do want to talk about: ID cards. This was announced on Friday, but the question asked by ministers is whether the party can withstand the opposition which is already looming on the horizon. Sir Keir sold the idea as a patriotic answer to part of the problem posed by illegal migration, and stopping people who come over here on small boats from taking jobs. There was no clear answer from the PM when pressed on the BBC this morning that people who employ illegal migrants were already breaking the law. But the challenge on this policy goes deeper, as I also reveal on the podcast. I understand that inside government there is no idea how to begin to answer the question of how this will work. It could be based on the existing passport databases, the driving licence databases, the veterans card or visas system. But even more strikingly, I am told by a government spokesman that despite this being core to identity and sold as an answer to illegal migration, the Home Office is not in the lead but instead it will be overseen by the Department for Science, Innovation and Technology (DSIT), now run by Liz Kendall. 👉Listen to Politics at Sam and Anne's on your podcast app👈 \"We have some of the youngest staff in Whitehall,\" said a source on why DSIT was the right place to lead the policy. The Home Office passed on the opportunity to take the lead. None of this bodes well for a successful rollout. This is yet another a massive policy that was not in the manifesto and bears all the hallmarks of being rushed. Then there is broader gap between Sir Keir's approach on immigration and that of the new home secretary. He called some Reform UK policies racist this morning, emphasising the dividing line is between legal and illegal policies. But writing in The Sun, Shabana Mahmood is talking about making things that are currently legal illegal - changing the Refugee Convention, changing the rules around indefinite leave to remain. Under her vision, maybe 400,000 people could be required to leave. These are huge numbers for a Labour home secretary to be thinking about. Removing numbers on this scale could make the dividing line with Reform UK much harder. How much is Sir Keir really across the new approach being taken by Ms Mahmood? How does the Reeves pro-EU youth mobility announcement conflict with the Mahmood approach in her speech and interviews? Who is reconciling competing ministerial interests? I am repeatedly told that Sir Keir acts as if the announcement of the policy is the moment he hands it over to colleagues, then only checks in months later, bemused why things haven't happened. Some people think he is very much the chairman of his government. Perhaps he needs to become more like an interventionist chief executive. Because ultimately if stuff doesn't work, the vibes will be out of control."
    },
    {
        "title": "Play hard, party harder: England's Red Roses revel in World Cup glory at London celebrations",
        "description": "England&#8217;s Red Roses promised they would celebrate hard after their World Cup win, and they kept their word.",
        "url": "https://news.sky.com/story/play-hard-party-harder-englands-red-roses-revel-in-world-cup-glory-at-london-celebrations-13440275",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-zoe-aldcroft-england_7035315.jpg?20250928184740",
        "type": "Home",
        "Author": "Tom Parmenter",
        "Date Published": "2025-09-28 13:33:00",
        "Headline": "After beating Canada at Allianz Stadium on Saturday afternoon, the Red Roses partied hard. So too did England fans at London's Battersea Power Station.",
        "Content": "\n          National correspondent\n              @TomSkyNews\n  England’s Red Roses promised they would celebrate hard after their World Cup win, and they kept their word. The hoarse throats, sore heads and never-ending smiles on Sunday confirmed they'd had the night of their lives. They strode out onto the balcony at the front of Battersea Power Station, southwest London, on Sunday afternoon, lapping up the love from thousands of fans who had gathered in the rain to share the celebrations. Player of the match in the final, flanker Sadia Kabeya, told Sky News it had been a big night: \"You can't go home until [captain] Zoe Aldcroft goes home and that girl stays out late.\"  \"So, as you can imagine, it was a long night, but it was great night,\" she continued. \"You know, we've got to celebrate. This happens, you know, what, once every four years or so.\" The team's victory over Canada in front of a world record-breaking crowd of 81,885 at Twickenham on Saturday represents a huge milestone for the game.  Rugby fan Akua, from London, bagged a last-minute ticket to the final and said it was \"magical, inspiring and empowering\". \"We just need to keep inspiring young girls and get them to keep believing in themselves,\" she added. Rachel Baxter travelled down from Liverpool and had also thrown herself into the post-match celebrations. She said: \"It is just amazing, it has been building so much. I was looking at the stands yesterday and there were no gaps, and I got a bit emotional. \"I am so proud it bursts your heart.\" It hasn't happened by chance. The Rugby Football Union (RFU) has backed the women's game with record investment and the Red Roses are the best-funded women's rugby team on earth - but they still had to win it. They saved their best performance of the tournament for the World Cup final and will now reap the rewards and hope the game continues to grow. Read more: Royals - and Russell Crowe - lead congratulations Among the crowd was Lucy Bronze, a key player in the Lionesses football team that won the Euros again this summer, said she hoped the Red Roses enjoy the glory and embrace the opportunity it brings. \"We want to help lift little girls up, we want to help show little boys what girls are capable of,\" Bronze said. \"Being here today to celebrate them, I know they're huge fans of the Lionesses as well - and just celebrating strong powerful women being successful is just so good for the nation.\" Double Olympic champion Dame Kelly Holmes joined the celebrations too after watching the final against Canada on Saturday. \"I didn't know much about women's rugby, yesterday I was there, now I'm a big fan,\" she said. \"So I just hope that we keep the momentum going... the Lionesses, the rugby women, the Red Roses, they brought like this pride in England. \"I saw the English flag being flown yesterday - that's why we fly the English flag, because we're proud of who we are - because sport is what brings us together.\" The Red Roses carried their trophy off stage and went down to meet friends, family and their growing army of fans. It's the party that none of them want to leave."
    },
    {
        "title": "Andy Burnham warns Labour not to 'underestimate the peril' party is in",
        "description": "Andy Burnham has hit out at allies of Sir Keir Starmer for \"demanding simplistic statements of loyalty\", claiming they are underestimating the \"peril\" Labour is in. ",
        "url": "https://news.sky.com/story/andy-burnham-warns-labour-not-to-underestimate-the-peril-party-is-in-13440515",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-burnham-labour_7035455.jpg?20250928205330",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-09-28 16:58:00",
        "Headline": "The mayor of Greater Manchester says the local elections next year pose a huge challenge and his interventions are about sparking a debate about Labour's direction.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Andy Burnham has hit out at allies of Sir Keir Starmer for \"demanding simplistic statements of loyalty\", claiming they are underestimating the \"peril\" Labour is in.  The mayor of Greater Manchester insisted his recent interventions have not been about \"personal ambition\", but starting an \"open debate\" about the direction of the party ahead of potentially catastrophic local and devolved elections next year. In the lead up to Labour's annual conference in Liverpool this week, the so-called \"King of the North\" has accused Sir Keir of having no vision for the country, while setting out his own policy proposals. Follow the latest from our politics team  It has fuelled mounting speculation he could launch a future leadership challenge against the prime minister, who in turn has compared Mr Burnham to Liz Truss. At a fringe event on the opening day of the conference, the Northern mayor said: \"I was clear in the interviews I gave last week, I wanted to launch a debate about the direction of the party and getting a plan to beat Reform UK. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  London mayor Sadiq Khan hits out at 'misinformation' as new figures show fall in crimes\n                 \"Those out there making calls for simplistic statements of loyalty are underestimating the peril the party is in.\" Two polls this week have predicted Reform UK leader Nigel Farage will become the next prime minister, while a poll of Labour members found more than half of them don't want Sir Keir to fight the next general election. Mr Burnham later turned up to a rally about Proportional Representation (PR), in which he insisted he wanted \"this government to work\". He received a rapturous reception as he entered the room, flanked by over a dozen photographers. Mr Burnham made light of the attention, quipping that \"there's nothing more unstoppable than an idea whose time has come\", in reference to PR. But this was not the focus of the punchy speech that followed, in which he criticised the Labour leadership's handling of dissent, saying a \"climate of fear\" was preventing MPs from having an \"open debate\" about the direction of the party. 👉Listen to Politics at Sam and Anne's on your podcast app👈 A handful of Labour MPs have been suspended over the past year for criticising the government on issues like welfare reform and the two child benefit cap, but Mr Burnham has the freedom to be outspoken as he is not a member of parliament. He said he had been accused of \"all sorts of things\" in the past week but had done \"nothing more than launch a debate\". Mr Burnham drew clear dividing lines in a recent interview with The New Statesman, as he said the country should be \"less in hock to the bond markets\", called for a greater focus on council housing and said public utilities should be nationalised. It fuelled speculation of an impending leadership challenge, given Mr Burnham fought twice to run the Labour Party while he was an MP, before stepping down in 2017 to run for the metro mayor position. He has not ruled out a return to Westminster and last week claimed Labour MPs have privately asked him to stand. Sir Keir tried to shut down the narrative by suggesting Mr Burnham's policies would unleash the economic chaos of Ms Truss, whose fatal mini budget sent the markets into meltdown, as he dismissed the \"personal ambitions of the mayor\". However, in a direct message to \"those who say that I'm speaking out purely for my own ambition\", a defiant Mr Burnham said: \"I can say to you tonight I am speaking out for the thousands of councillors here at this conference who are worried about going to those doorsteps next May, speaking for the members of the Senedd who, again, are working hard to keep Wales Labour... and, of course, members of the Scottish parliament as well, who want a stronger story about Labour to go to those doorsteps. \"I'm speaking out for the millions of good people around Britain who want a more hopeful direction for the country. \"I think we can do it. I honestly believe it can be done. We can make this government work, we can find that more hopeful direction and we can win again at the next general election.\" The speech was met with a big round of applause from members, while one Labour MP told Sky News it was a \"great speech\". And while cabinet ministers have called for the party to unite behind the prime minister to fight Reform UK - there appeared to a change in tone from Wes Streeting as the first day of conference drew to a close. The health secretary told a fringe event that the government must be \"open to challenge\" from within. He said: \"We've got to be self-confident enough as ministers to be open to challenge, and openly debate different ideas, because it makes you stronger as a government.\""
    },
    {
        "title": "If stuff doesn't work for Starmer - the vibes will be out of control",
        "description": "If Sir Keir Starmer keeps the focus on vibes alone at this conference, he'll probably do just fine here in Liverpool.",
        "url": "https://news.sky.com/story/if-stuff-doesnt-work-for-starmer-the-vibes-will-be-out-of-control-13440669",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-exit_7034600.jpg?20250928104442",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-09-28 20:08:00",
        "Headline": "The big lingering question for Sir Keir Starmer is not about vibes and not about personnel. It's about whether any of it will actually work.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n If Sir Keir Starmer keeps the focus on vibes alone at this conference, he'll probably do just fine here in Liverpool. Flags. Patriotism. Determination. Change. Grit. Frustration. Optimism. The word cloud on Tuesday will come out just fine. And there's no doubt he's helped along the way by the faux fight with the King of the North. Government aides were laughing at yet another Andy Burnham this morning - having renounced the Bond Markets, he's now denounced the renunciation. They're not worried. But the big lingering question is not about vibes and not about personnel. It's about whether any of it will actually work. Policy - not Sir Keir's strong suit - is absolutely fundamental to delivering the change he harps on about, and will ultimately determine whether this government succeeds. Follow the latest from our politics team Because the problem of this government, and its interminable obsession with who is up and who is down, is because until now Sir Keir has lacked a vision of change the country can get behind - something he pleaded guilty to on TV this morning by saying he would fix that this week. Without policy, it is hard for the people in Liverpool to have passion. Absent this morning is any conversation about the biggest challenge facing this government - the £30bn black hole. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 The government is having three meetings a week about it, yet the prime minister has conspicuously nothing new to say about it and no desire to say it. The chancellor suggested additional growth from a youth mobility scheme. Not only is that policy not signed off, but the idea that it would touch the sides of the £30bn black hole is, as ex-Institute for Fiscal Studies (IFS) director Paul Johnson points out, for the birds. This is one challenge that Ben Nunn, Rachel Reeves's director of communications, will not have to worry about if he agrees to return to Number 10 after the budget to plug the gaps as I revealed on the Politics At Sam And Anne's podcast.  There will be some defence of the fiscal position in Monday's Reeves speech. But the kindest explanation more generally about the absence of discussion about the black hole from a ministerial aide was that it would come after conference season with \"difficult\" conversations with the Parliamentary Labour Party. But equally, why do today what you can put off until tomorrow. So then there is a question of the policy they do want to talk about: ID cards. This was announced on Friday, but the question asked by ministers is whether the party can withstand the opposition which is already looming on the horizon. Sir Keir sold the idea as a patriotic answer to part of the problem posed by illegal migration, and stopping people who come over here on small boats from taking jobs. There was no clear answer from the PM when pressed on the BBC this morning that people who employ illegal migrants were already breaking the law. But the challenge on this policy goes deeper, as I also reveal on the podcast. I understand that inside government there is no idea how to begin to answer the question of how this will work. It could be based on the existing passport databases, the driving licence databases, the veterans card or visas system. But even more strikingly, I am told by a government spokesman that despite this being core to identity and sold as an answer to illegal migration, the Home Office is not in the lead but instead it will be overseen by the Department for Science, Innovation and Technology (DSIT), now run by Liz Kendall. 👉Listen to Politics at Sam and Anne's on your podcast app👈 \"We have some of the youngest staff in Whitehall,\" said a source on why DSIT was the right place to lead the policy. The Home Office passed on the opportunity to take the lead. None of this bodes well for a successful rollout. This is yet another a massive policy that was not in the manifesto and bears all the hallmarks of being rushed. Then there is broader gap between Sir Keir's approach on immigration and that of the new home secretary. He called some Reform UK policies racist this morning, emphasising the dividing line is between legal and illegal policies. But writing in The Sun, Shabana Mahmood is talking about making things that are currently legal illegal - changing the Refugee Convention, changing the rules around indefinite leave to remain. Under her vision, maybe 400,000 people could be required to leave. These are huge numbers for a Labour home secretary to be thinking about. Removing numbers on this scale could make the dividing line with Reform UK much harder. How much is Sir Keir really across the new approach being taken by Ms Mahmood? How does the Reeves pro-EU youth mobility announcement conflict with the Mahmood approach in her speech and interviews? Who is reconciling competing ministerial interests? I am repeatedly told that Sir Keir acts as if the announcement of the policy is the moment he hands it over to colleagues, then only checks in months later, bemused why things haven't happened. Some people think he is very much the chairman of his government. Perhaps he needs to become more like an interventionist chief executive. Because ultimately if stuff doesn't work, the vibes will be out of control."
    },
    {
        "title": "Chancellor to make case for 'contribution' ahead of youth jobs guarantee",
        "description": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment.",
        "url": "https://news.sky.com/story/chancellor-to-make-case-for-contribution-ahead-of-youth-jobs-guarantee-13440405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-chancellor_7029992.jpg?20250924035136",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today.",
        "Content": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment. The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today. She is expected to confirm plans for every young person who has received universal credit (UC) for 18 months without \"earning or learning\" to be guaranteed an offer of paid work. Labour conference in Liverpool - follow live updates Those who refuse to take up jobs without a \"reasonable excuse\" will face sanctions such as losing their benefits, it is understood. The guarantee, which will be overseen by Work and Pensions Secretary Pat McFadden, forms part of a pledge of \"nothing less than the abolition of long-term youth unemployment\". Ms Reeves is expected to say: \"I believe in a Britain founded on contribution - where we do our duty for each other, and where hard work is matched by fair reward. \n                  If stuff doesn't work for Starmer - the vibes will be out of control\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 \"I believe in a Britain based on opportunity - where ordinary kids can flourish, unhindered by their background. \"And I believe that Britain's real wealth is found not only in the success of the fortunate few, but in the talents of all our people, in every part of our great country.\"  It comes in the wake of concerns among some Labour members that the government needs to offer voters a clearer vision of its agenda. Sir Keir Starmer has previously avoided using buzzwords to define his politics, but thinktank Labour Together published a paper last week in which it argued the concept of contribution should be put at the heart of policymaking. Read more:Burnham warns Labour not to 'underestimate the peril' party is inLabour promise changes to indefinite leave to remainMahmood vows migration law reforms Ms Reeves is expected to add: \"We won't leave a generation of young people to languish without prospects - denied the dignity, the security and the ladders of opportunity that good work provides. \"Just as the last Labour government, with its new deal for young people, abolished long-term youth unemployment I can commit this government to nothing less than the abolition of long-term youth unemployment. \"We've done it before and we'll do it again.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Mel Stride, the shadow chancellor, accused Labour of \"contradictions\" within their policies. He said: \"Rachel Reeves says she wants to abolish youth unemployment - yet in her very first budget, she introduced a £25bn jobs tax that made it more expensive for businesses to hire, especially young people. \"That's the contradiction at the heart of Labour's plan: they talk about opportunity, but their policies kill jobs. \"Since Labour came to power, unemployment is up. Business confidence is down. And now Reeves is trying to fix a problem she created - while pointing the finger of blame, as she so often does, at everyone else.\" Chancellor Rachel Reeves will be speaking to Sky News at 7.15am this morning ahead of her speech at the conference at midday."
    },
    {
        "title": "London mayor Sadiq Khan hits out at 'misinformation' as new figures show fall in crimes",
        "description": "Sadiq Khan has hit back at politicians \"spreading misinformation\" about safety in London as new data shows the number of violent crimes leading to injury has fallen in every borough over the past year.",
        "url": "https://news.sky.com/story/london-mayor-sadiq-khan-hits-out-at-misinformation-as-new-figures-show-fall-in-crimes-13440442",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sadiq-khan-donald-trump_7030271.jpg?20250924120816",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "Sir Sadiq Khan's comments come after renewed attacks from US President Donald Trump - who recently claimed \"crime in London is through the roof\".",
        "Content": "Sadiq Khan has hit back at politicians \"spreading misinformation\" about safety in London as new data shows the number of violent crimes leading to injury has fallen in every borough over the past year. Figures from the mayor's office for policing and crime compare the 12 months ending in August 2025 with the previous 12 months - and show there were 8,749 fewer crimes which resulted in someone being hurt, a drop of nearly 12%. The borough of Havering in east London recorded the largest drop (16.3%) followed by Enfield in north London (16.1%). The smallest decreases were in Greenwich (4.3%) and Kensington and Chelsea (4.6%). Sir Sadiq said: \"We've seen a number of politicians here and across the globe talking down London and spreading misinformation about crime and safety in the capital. \"The evidence is clear, our approach to tackling crime and its complex causes works. It's driving down violence right across the capital.\" His comments come after Donald Trump reignited his feud with Sir Sadiq earlier this month by accusing him of doing a \"terrible job\" and claiming \"crime in London is through the roof\". \n                  Play hard, party harder: England's Red Roses revel in World Cup glory at London celebrations\n                 \n                  Nursery worker who kicked, punched and pinched children in her care is jailed\n                 \n                  Barry George charged with rape and indecent assault\n                 The US president also hit out at the mayor in a speech at the UN General Assembly on Tuesday, where he also made the outlandish claim that London \"wants Sharia law\" - something there is no evidence for.  Asked about the attacks, Sir Sadiq said: \"I think President Trump has shown he is racist, he is sexist, he is misogynistic, and he is Islamophobic.\" He added that the public would be \"wondering what it is about this Muslim mayor who leads a liberal, multicultural, progressive, successful city that means I appear to be living rent-free inside Donald Trump's head\". Read more:Trump's jaw-dropping weekStarmer hits out at Reform's 'racist' policy According to the mayor's office, overall homicides in London are at a 10-year low, and the city's rate is lower than in Berlin, Brussels, Madrid, Paris and all major US cities. The rate of homicide was down by 17% in the 12-month period to June this year compared with the 12-month period to May 2016, it previously said. Metropolitan Police Assistant Commissioner Rachel Williams said: \"We're targeting the most dangerous individuals, disrupting criminal networks, and investing in prevention to protect those most at risk. \"That's why fewer people are being hurt, fewer lives are being lost, and London is becoming a safer city.\" The Conservatives rejected the suggestion that London is safer. Shadow home secretary Chris Philp said: \"Under this Labour mayor, criminals know the odds are stacked in their favour. \"Only one in 20 robberies is solved, fewer offenders are being jailed, and more than a thousand police officers have been cut from the Metropolitan Police, with Sir Mark Rowley warning of further losses this year. \"Londoners don't feel safer because London isn't safer.\""
    },
    {
        "title": "Woman raped by group of men in Oxfordshire churchyard",
        "description": "A woman has been raped outside a church in Oxford by a group of men, police have said.",
        "url": "https://news.sky.com/story/woman-raped-by-group-of-men-in-oxfordshire-churchyard-13440491",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-banbury-st-marys-church_7035195.jpg?20250928174830",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-28 16:33:00",
        "Headline": "The woman, who is in her 30s, was attacked in the early hours of Sunday morning.  Police are urging a woman who tried to stop the attack to come forward.",
        "Content": "A woman has been raped outside a church in Oxford by a group of men, police have said. The woman, who is in her 30s, was attacked in the churchyard of St Mary's and the surrounding area of Banbury town centre in the early hours of Sunday morning, Thames Valley Police said. The force is appealing for a woman who tried to stop the attack and help the victim to come forward. Detective Sergeant Mark Personius said they do not have a description of the \"good Samaritan\" but encouraged the person to contact police as she might have \"vital information that can help us piece together what happened\".  \"This is a horrific crime and Thames Valley Police is conducting a thorough investigation to identify the offenders,\" DS Personius added. \"The town centre would have been busy on a Saturday night into the early hours of a Sunday morning, therefore, I would also appeal to anyone else who saw or heard anything in the area between about 12am and 2.30am this morning to come forward.\" He said a scene watch is in place at the church to enable the force to carry out forensic examinations. Officers have also been instructed to carry out house-to-house and CCTV inquiries."
    },
    {
        "title": "Arrests made as Palestine Action supporters protest at Labour conference in Liverpool",
        "description": "Protesters supporting Palestine Action have been arrested outside the Labour party conference in Liverpool.",
        "url": "https://news.sky.com/story/arrests-made-as-palestine-action-supporters-protest-at-labour-conference-in-liverpool-13440517",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-liverpool-protest-palestine_7035236.jpg?20250928181311",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-09-28 17:02:00",
        "Headline": "Merseyside Police confirmed on Sunday afternoon that officers were in attendance at a protest organised by the Defend Our Juries group near the conference venue. ",
        "Content": " Protesters supporting Palestine Action have been arrested outside the Labour party conference in Liverpool. Around 100 people gathered on Sunday near the conference venue where they silently held signs reading \"I oppose genocide, I support Palestine Action\", Defend Our Juries - which organised the protest - said. Palestine Action was banned as a terror organisation in July after it claimed responsibility for an incident which saw two planes damaged at RAF Brize Norton in June. A Merseyside Police spokesman said: \"We can confirm that officers are in attendance at a Defend Our Juries protest near to The Wheel of Liverpool this afternoon, Sunday 28 September. \"Some of the people in attendance have displayed material in support of Palestine Action. \"Officers are in the process of making arrests on suspicion of wearing/carrying an article supporting a proscribed organisation.\" A spokesman for Defend Our Juries said: \"We've come to remind everyone that the Labour Party is in breach of its duty to act to prevent genocide under international law. \n                  Sally Rooney says she's been told not to enter UK because she may be arrested\n                 \n                  First people charged with supporting Palestine Action plead not guilty\n                 \n                  New Banksy artwork to be removed from Royal Courts of Justice after report of criminal damage\n                 \"Instead it made the cowardly decision to ban the direct action group that was trying to prevent genocide.\" The spokesman added: \"Instead of shutting down protest, it's time the Labour Party took the responsibility to prevent genocide seriously and impose blanket sanctions on Israel including stopping the flow of arms from factories in this country.\" Israel has repeatedly denied claims of genocide, with Israeli Prime Minister Benjamin Netanyahu telling the UN on Friday: \"If Hamas agrees to demands, war could end.\" Sunday marked the first day of Labour's four-day annual conference - where the prime minister has vowed to show the party can be an alternative to the \"toxic divide and decline\" offered by Reform UK."
    },
    {
        "title": "Labour promise changes to indefinite leave to remain - but don't go as far as Reform",
        "description": "Indefinite leave to remain (ILR) will be tougher to acquire under new rules, the home secretary is to confirm - as Labour seek to counter Nigel Farage's anti-migration policies.",
        "url": "https://news.sky.com/story/labour-promise-changes-to-indefinite-leave-to-remain-but-dont-go-as-far-as-reform-13440249",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-british-uk-passport_7034853.jpg?20250928143651",
        "type": "UK",
        "Author": "Tim Baker",
        "Date Published": "2025-09-28 13:11:00",
        "Headline": "Home Secretary Shabana Mahmood says she will make it harder to settle in the UK - but her changes don't go as far as Reform UK's.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Indefinite leave to remain (ILR) will be tougher to acquire under new rules, the home secretary is to confirm - as Labour seek to counter Nigel Farage's anti-migration policies. Shabana Mahmood will reveal details of promised reforms to the system, including higher English language requirements, as well as paying into national insurance, a \"spotless\" criminal record and having a job. However, unlike Reform's policy, Labour do not plan to deport people who already have ILR who do not apply to be British citizens. Labour Party conference: Follow live updates here  Speaking on Sunday, Sir Keir Starmer branded Mr Farage's proposals \"racist\". Ms Mahmood is set to speak at the Labour Party on conference on Monday where she will confirm her party's plans. Ahead of the speech, Labour said: \"These measures draw a clear dividing line between the Labour government and Reform, whose recent announcement on indefinite leave to remain would force workers, who have been contributing to this country for decades, to leave their homes and families.\" Ms Mahmood is set to tell the Labour Party conference that her policies are needed for an \"open, generous, tolerant\" country - but members \"won't always like what I do\". However, she is also set to say she will be a \"tough Labour home secretary, fighting for a vision of this country that is distinctly our own\". Read more:Mahmood vows migration law reformsLabour and Lib Dems could learn from Farage's plansUK records second biggest annual population jump in 75 years Concerns over ILR - which gives people the right to settle, work and study in the UK and even claim benefits - have been mounting in the lead up to January 2026, when a large number of people are expected to become eligible for the status. Those who have lived and worked in the UK for five years are eligible for ILR - and January next year will see the first of the so-called \"Boriswave\" reach this checkpoint. This is the increase in immigration that began under former prime minister Boris Johnson, when his post-Brexit immigration policies came into force. Statistics from the past two periods on record - 2022 to 2023 and 2023 to 2024 - showed the highest level of legal immigration to the UK since current record keeping began in the 1940s, according to the Office for National Statistics (ONS).  Some have warned that this cohort being eligible for ILR could put further strain on public service, housing and the welfare budget. Reform's head of policy Zia Yusuf, when his party's policy was announced, said: \"Between 2026 and 2030, thanks to the Boriswave, 800,000 new migrants are estimated to get ILR. \"About half of all of them will never work, ever.\" Reform claimed this would cost hundreds of billions of pounds - but the numbers were in fact from a withdrawn thinktank paper. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Labour are already consulting on whether to change the five-year period before ILR claims can be submitted to 10 years - but it is not clear when this will come into force. As well as a crackdown on migration, Ms Mahmood will also announce a \"winter of action\" aimed at tackling shoplifting over the Christmas period."
    },
    {
        "title": "Russia's clear warning that it can easily chip away at Europe's defences",
        "description": "The brutality of Russia's drone assaults on Ukraine's towns and cities shows no let up.",
        "url": "https://news.sky.com/story/why-drones-are-proving-critical-as-russia-sends-a-clear-warning-to-europe-13440471",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-russia-drone_7035435.jpg?20250928203229",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-09-28 16:18:00",
        "Headline": "Germany and Denmark are the latest countries to raise the alarm over drone sightings and unexplained drone activity.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n The brutality of Russia's drone assaults on Ukraine's towns and cities shows no let up. \"Savage strikes, a deliberate targeted terror\" is how the Ukrainian President Volodymyr Zelenskyy described the latest overnight bombardment. Some 595 attack drones and 48 missiles were involved and even if only a small fraction made it through Ukrainian air defences, the destruction - in Sumy and Odessa, Zaporizhia and Kyiv - is significant.    Also overnight, Denmark reported yet more drone sightings. It has not named Russia directly but after a week in which unidentified drones have resulted in the temporary shutdown of military and civilian airports, it is banning all civil drone flights and describing the threat as a hybrid attack. Germany is also raising the alarm over unexplained drone activity along its border with Denmark. Germany's interior minister said on Saturday: \"We are witnessing an arms race, an arms race between drone threats and drone defences. It is a race we cannot afford to lose.\" NATO is having to deploy extra assets to beef up its Baltic Sea defences and its Eastern flank. European nations are working to establish a drone wall along their borders with Russia and Ukraine. Germany is setting up a drone defence centre to make sure it has what it needs to protect itself. The Kremlin is forcing NATO to divert assets to protect its airspace and sub-sea infrastructure at a time when Europe is trying to work out how best to support and finance Ukraine. Read more:Putin's top diplomat issues warningWhy Trump has made a U-turn With drones an inexpensive element of its hybrid warfare arsenal, Russia is sending a clear warning that it can relatively easily chip away at Europe's defences and that Europe had better focus on protecting itself. \"If NATO begins to look too rattled, that actually is encouragement for Putin precisely to step up the pressure,\" says Mark Galeotti, a specialist in Russian security. \"So really we need to be holding our nerve. \"Yes, reserving the right to shoot things down that look like direct threats, but otherwise actually talking down, not talking up, the nature of the threat while of course we arm so that we are even more prepared.\" Last week, Estonia said its fighter jets had escorted three Russian MIG fighter jets out of their airspace after a 12-minute incursion, which Russia denies ever took place.  On Saturday, Estonia pledged €10m (£8.7m) to NATO's \"Prioritised Ukraine Requirement List\" or PURL programme, which sees US-produced weapons, paid for by NATO's European partners, fast-tracked to Ukraine. Zelenskyy posted on Sunday after speaking with the NATO secretary general that PURL is moving forward well. And that is just what Russia is trying to prevent."
    },
    {
        "title": "Contact with two hostages 'lost' during Israeli operations in Gaza, Hamas's armed group says",
        "description": "Hamas's armed group has claimed it has lost contact with two hostages as a result of Israel's operations in Gaza - after it called on air deployments to be stopped for 24 hours.",
        "url": "https://news.sky.com/story/contact-with-two-hostages-lost-during-israeli-operations-in-gaza-hamass-armed-group-says-13440234",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gaza-smoke_7034913.jpg?20250928150622",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 12:57:00",
        "Headline": "It comes a day before Israeli Prime Minister Benjamin Netanyahu is due to meet US President Donald Trump and as the number of those killed in Gaza surpasses the 66,000 mark, according to the enclave's Hamas-run health ministry.",
        "Content": " Hamas's armed group has claimed it has lost contact with two hostages as a result of Israel's operations in Gaza - after it called on air deployments to be stopped for 24 hours. In a statement, Hamas's armed al-Qassam Brigades said it had demanded that Israel halt air sorties for 24 hours, starting at 6pm, in part of Gaza City, to remove the hostages from danger. It comes a day before Israeli Prime Minister Benjamin Netanyahu is due to meet US President Donald Trump and as the number of those killed in Gaza surpasses the 66,000 mark, according to the enclave's Hamas-run health ministry. Its figure does not differentiate between civilians and fighters.   A total of 48 hostages are still being held captive by Hamas, the militant group which rules Gaza, with about 20 believed by Israel to still be alive. A total of 251 hostages were taken on 7 October 2023, when Hamas launched an unprecedented attack on Israel which killed 1,200 people. Situation on the ground In Gaza, a war-torn enclave where famine has been declared in some areas and where Israel has been accused of committing acts of genocide - which it has repeatedly denied - the almost two-year war raged on. On Sunday, the number of those killed rose to at least 21 as five people were killed in an airstrike in the Al Naser area, local health authorities said, while medics reported 16 more deaths in strikes on houses in central Gaza. The Civil Emergency Service in Gaza said late on Saturday that Israel had denied 73 requests, sent via internationalorganisations, to rescue injured Palestinians in Gaza City. Israeli authorities had no immediate comment. The military earlier said forces were expanding operations in the city andthat five militants firing an anti-tank missile towards Israeli troops had been killed by the Israeli air force. Read more: Volunteer nurse's video diary of Gaza horrorsBlair being lined up to lead temporary Gaza administration - reports 'We will get it done'  In Monday's White House meeting, President Trump is expected to share a new 21-point proposal for an immediate ceasefire. His proposal would include the release of all hostages within 48 hours and a gradual withdrawal of Israeli forces from the Palestinian enclave, according to three Arab officials briefed on the plan, the PA news agency reports. A Hamas official said the group was briefed on the plan but has yet to receive an official offer from Egyptian and Qatari mediators. Hamas has said it is ready to \"study any proposals positively and responsibly\". Mr Trump, who has been one of Israel's greatest allies, said on Sunday there is \"a real chance for greatness in the Middle East\". It is unclear, however, what Mr Trump was specifically referring to. He said in a Truth Social post: \"We have a real chance for Greatness in the Middle East. All are on board for something special, first time ever. We will get it done.\" On Friday - the same day a video of diplomats walking out on Mr Netanyahu during his address to the United Nations went viral - Mr Trump said he believed the US had reached a deal on easing fighting in Gaza, saying it \"will get the hostages back\" and \"end the war\".  \"I think we maybe have a deal on Gaza, very close to a deal on Gaza,\" the US president told reporters on the White House lawn as he was leaving to attend the Ryder Cup. Mr Trump has repeatedly claimed an agreement to end the war was imminent, only for nothing to materialise. Weeks ago, he said: \"I think we're going to have a deal on Gaza very soon.\""
    },
    {
        "title": "Team Europe win Ryder Cup in nail-biting finale",
        "description": "Team Europe have won the Ryder Cup in New York - despite a last-minute fightback from Team USA.",
        "url": "https://news.sky.com/story/team-europe-retain-ryder-cup-in-nail-biting-finale-13440308",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ryder-cup-2025-winner-europe-with-trophy_7035575.jpg?20250928233630",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 13:57:00",
        "Headline": "Tensions have frequently boiled over at this year's contest, with multiple spectators being ejected and Rory McIlroy at one point telling an attendee to \"shut the f*** up\".",
        "Content": " Team Europe have won the Ryder Cup in New York - despite a last-minute fightback from Team USA. Team Europe finished day two of the tournament with an unprecedented 11.5-4.5 lead. They then inched closer to the 14 points needed to retain the trophy before any players had even teed off on Sunday, after both teams were awarded half a point when Viktor Hovland was forced to pull out due to injury. A final day fightback saw the host side roar back into contention with a series of tight wins before Europe reached the all-important 14 points to retain the trophy thanks to a putt from Shane Lowry. Tyrrell Hatton's draw with Collin Morikawa landed Europe the final half point needed to win. Tensions have frequently boiled over at this year's contest, with multiple spectators at Bethpage Black in New York being ejected as Luke Donald's Europe dominated on Saturday. Rory McIlroy has frequently been on the receiving end of boos and heckles - some of which were led by the Ryder Cup first-tee announcer over a megaphone on Saturday. \n                  Ryder Cup 2031 to take place at Camiral in Girona, Spain as tournament heads to continental Europe for fourth time\n                 \n                  Ryder Cup: Rory McIlroy expresses concerns over Ian Poulter captaincy hopes but hopes for Jon Rahm involvement in 2025\n                 \n                  Ryder Cup: Fire breaks out at Marco Simone golf club, venue for the tournament last weekend\n                 Heather McMahan encouraged a chant of \"f*** you Rory\" ahead of the morning session. She has apologised and stepped down from her role, the PGA of America said on Sunday. Later on Saturday, McIlroy hit back by telling a spectator to \"shut the f*** up\" while his teammate Shane Lowry was seen being held back by his caddie as he tried to confront someone.  The players themselves have also clashed, with America's Bryson DeChambeau confronting Europe's Justin Rose after he asked his caddie to move while he was lining up a putt. Extra security and police officers were drafted in to control fan behaviour while big screens showed warnings about spectator noise. Holding back the tears after a draining week, McIlroy said of Europe's victory: \"I am extremely proud to be a part of this team. \"As soon as we won in Rome, we turned our attentions to doing something that was pretty impossible to do - to win in America and in New York. \"It's been an amazing week. To hear the 'Ole Ole's' here in America, to do something people thought we couldn't do, the comments after Whistling Straits (in 2021), decades of American dominance - we took a lot from that, we let it fuel us.\"  He added: \"We got so lucky in getting an incredible leader in Luke Donald and he shepherded us through the process and he's been amazing. \"Eleven of the 12 players from Rome came back. We did what we needed to do and we are going to celebrate like there is no tomorrow.\""
    },
    {
        "title": "'I don't care': Colombia's president says US violating international law after visa revoked",
        "description": "Colombia's president has dismissed Washington's decision to cancel his visa, saying \"revoking it for denouncing genocide shows the US no longer respects international law\".",
        "url": "https://news.sky.com/story/i-dont-care-colombias-president-says-us-violating-international-law-after-visa-revoked-13440048",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-gustavo-petro-colombian-president_7032920.jpg?20250927074836",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 07:40:00",
        "Headline": "Colombian President Gustavo Petro has responded to Washington's decision to revoke his visa following \"incendiary actions\" at a pro-Palestinian rally in New York. He said: \"I no longer have a visa to travel to the United States. I don't care.\"",
        "Content": "Colombia's president has dismissed Washington's decision to cancel his visa, saying \"revoking it for denouncing genocide shows the US no longer respects international law\". It comes after the state department announced on Friday it would cancel Gustavo Pedro's visa over \"incendiary actions\" at a pro-Palestinian demonstration in New York. Speaking outside the United Nations on Friday, President Petro called for a global armed force with the priority of liberating Palestinians. Mr Petro, who appeared at the rally alongside Roger Waters of Pink Floyd, said in Spanish that the force \"has to be bigger than that of the United States\". \"I ask all the soldiers of the army of the United States not to point their guns at people. Disobey the orders of Trump. Obey the orders of humanity.\" The US state department said in a post on X that it will \"revoke Petro's visa due to his reckless and incendiary actions\". But Mr Petro has now responded, saying: \"I no longer have a visa to travel to the United States. I don't care. \n                  At least 17 dead in Colombia after car bombing and helicopter attack\n                 \n                  Colombian presidential hopeful Miguel Uribe Turbay dies after campaign rally shooting\n                 \n                  San Jose: Shipwreck with £16bn of treasure on board identified - fuelling international row over who owns it\n                 \"I don't need a visa... because I'm not only a Colombian citizen but a European citizen, and I truly consider myself a free person in the world,\" the Colombian leader said on social media. \"Revoking it for denouncing genocide shows the US no longer respects international law,\" he added on a post on X.  Israel has repeatedly denied allegations of genocide in Gaza, where it has been engaged in a war with Hamas since October 2023. Read more:Watch moment diplomats walk out as Israeli PM speaks at UNBlair being lined up to lead temporary Gaza administration - reports More than 65,000 people have died since Israel began its campaign in the territory, with more than 167,000 others wounded, according to the Hamas-run Gaza health ministry. It does not distinguish between civilians and combatants, but has said women and children make up around half the fatalities. Israel's military action was a response to the Hamas-led attack on southern Israel on 7 October 2023, which left around 1,200 people dead and 251 others taken hostage, 48 of whom are still in Gaza. Colombia's ministry of foreign affairs said in a statement that using visa revocation as a diplomatic weapon goes against the spirit of the UN, which protects freedom of expression and guarantees the independence of member states at UN events. \"The UN should find a completely neutral host country... that would allow the organisation itself to issue authorisation to enter the territory of that new host state,\" the ministry said."
    },
    {
        "title": "Indian police investigate Vijay's 'overcrowded' political rally as 40 people die",
        "description": "Police in India are investigating after 40 people died in a stampede at a political rally that officials said was much larger than expected.",
        "url": "https://news.sky.com/story/indian-police-investigate-vijays-overcrowded-political-rally-as-40-people-die-13440178",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-india-tamil-nadu-vijay_7034793.jpg?20250928140658",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 11:41:00",
        "Headline": "A case has been filed against TVK's senior leaders after the party said it was expecting 10,000 people, \"but the actual crowd was more than double\".",
        "Content": "Police in India are investigating after 40 people died in a stampede at a political rally that officials said was much larger than expected. The tragedy happened in Tamil Nadu as actor-turned-politician Vijay was campaigning for his Tamilaga Vettri Kazhagam (TVK) party ahead of state elections early next year. Detectives have filed a case \"against TVK party senior leaders Bussy Anand, Nirmal Kumar and VP Mathiyalagan, and the investigation is under way\", senior police official V Selvaraj said. \"TVK originally sought permission for a gathering of 10,000 people, but the actual crowd was more than double,\" he added. Ma Subramanian, Tamil Nadu's health minister, who said \"there was indiscipline\" at the rally, announced on Sunday that the number of deaths following the event in the Karur district had risen by four to 40. At least 124 people who were injured have been treated in hospital. Mr Subramanian said 36 victims were dead by the time they reached hospital on Saturday night and four more died later. \n                  Vijay rally stampede: At least 36 people killed and dozens injured at campaign event for Indian actor-politician\n                 \n                  India's state of Kerala fighting rise in cases of rare 'brain-eating' disease\n                 \n                  Internet access in Middle East and Asia disrupted after 'undersea cables cut'\n                 Nine of the dead were children, he said, adding that the injured were largely in a stable condition. Vijay, whose full name is Joseph Vijay Chandrasekhar, was one of the southern Indian state's most bankable stars for three decades. He said he was \"heartbroken\" by the stampede, pledging support for the victims' families. Vijay's rallies have drawn massive crowds since he launched his party last year. He was supposed to address the rally around noon but arrived more than six hours late, by which time the heat was stifling, according to S Sabesan, a 42-year-old textile businessman who was there. He said by that time, a large crowd had packed surrounding roads. Mr Sabesan said a lot of barricades and ropes were placed around the venue \"for crowd management\", but the crowd became so large that \"nobody could control it\". Local media video showed Vijay throwing water bottles from the top of his vehicle to fainting supporters during the event, and calling for police help when the crowd became uncontrollable. Read more on Sky News:Crowe congratulates Red RosesP Diddy to be sentencedStongman pulls ship Lawyer R Rajendaran said a commotion began when Vijay tried to leave, as \"hundreds of his fans and supporters chased his vehicle\". \"That is what led to the stampede.\" Tamil Nadu chief minister MK Stalin announced compensation of one million rupees (£8,400) per family as the state appointed a commission to investigate the cause of the stampede. Prime Minister Narendra Modi posted on X that the incident was \"deeply saddening\"."
    },
    {
        "title": "Ashraf Mahrous: Egypt's 'strongman' wrestler pulls ship using his teeth",
        "description": "An Egyptian wrestler is hoping he has set a world record after pulling a 700-ton (635,000kg) ship with his teeth.",
        "url": "https://news.sky.com/story/ashraf-mahrous-egypts-strongman-wrestler-pulls-ship-using-his-teeth-13440098",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-egypt-ashraf-mahrous_7034583.jpg?20250928101156",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 09:13:00",
        "Headline": "Nicknamed 'Kabonga' and also known simply as 'strongman', Mahrous pulled the vessel across the water in Egypt's Red Sea resort of Hurghada and later pulled two ships weighing around 1,150 tons together.",
        "Content": " An Egyptian wrestler is hoping he has set a world record after pulling a 700-ton (635,000kg) ship with his teeth. Ashraf Mahrous, 44, pulled it across the water in Egypt's Red Sea resort of Hurghada on Saturday. Mahrous, nicknamed 'Kabonga' and known to Egyptians as 'strongman', later pulled two ships weighing about 1,150 tons (1,043,000kg) together. Mahrous said afterwards: \"Today, I have come to break the world record. I pulled them both, thanks to God, to prove to my friends and the whole world that God blessed me by being the strongest man in the world.\" The wrestler, from the port city of Ismalia, said he will send videos and photos of his attempt to Guinness World Records to see if he has set a new mark, as the current record is a 614-ton (557,000kg) ship set in 2018. In March, Mahrous pulled a train weighing 279 tons (253,105kg) with a rope in his teeth for nearly 10 metres (33ft) and was formally recognised by Guinness World Records for the heaviest rail pull, along with certificates for the heaviest locomotive pull and for the fastest 100-metre road vehicle pull. Three years earlier, he was recognised for pulling a 15,730kg truck with his teeth. \n                  British-Egyptian activist Alaa Abd El Fattah released from prison after being pardoned\n                 \n                  Irish politician faces deportation from Egypt after trying to cross into Gaza\n                 \n                  Laila Soueif: It's a 'miracle' mother of jailed activist is alive on day 245 of hunger strike, family says\n                 He built up his strength for Saturday's challenge by training six hours a day while eating a protein and iron-rich diet, featuring at least a dozen eggs, two whole chickens, and 5kg of fish. Mahrous, who stands 6ft 3in (1.9m) tall and weighs 155kg (341lbs), said his strength emerged early and began lifting items for money when he was nine. He once accidentally broke a friend's arm when he tried to pull him as they played. Growing up, he loved sports and trained in kung fu, kickboxing and set up a wrestling team in Cairo. Friends who saw him easily flip giant tyres 10 times in a row in a deserted courtyard at their gym, and push a car using only a finger, persuaded him to go for a world record. He takes no supplements, he says, but eats, sleeps and works out at least twice every day. Read more on Sky News:Crowe congratulates Red RosesP Diddy to be sentencedDozens die in rally stampede Next, he is going to ask Egypt's president Abdul Fattah al Sisi for permission to pull a submarine and one day wants to pull a plane using only his eyelid muscles. Mahrous believes that speaking with the object he pulls beforehand helps him establish a connection and is key to his success. \"It's important for me to treat the object that I will pull as part of my body that moves along with my heartbeat,\" he said."
    },
    {
        "title": "UN reimposes sanctions on Iran over accusations it violated nuclear deal",
        "description": "The United Nations has reimposed sanctions on Iran over accusations that the country violated a nuclear deal.",
        "url": "https://news.sky.com/story/un-reimposes-sanctions-on-iran-over-accusations-it-violated-nuclear-deal-13439986",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-iran-tehran_7034430.jpg?20250928051044",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 02:36:00",
        "Headline": "Britain, France and Germany triggered the return of sanctions on Iran at the UN Security Council after Tehran allegedly violated the 2015 deal aimed at stopping it from developing a nuclear bomb.",
        "Content": "The United Nations has reimposed sanctions on Iran over accusations that the country violated a nuclear deal. Britain, France and Germany triggered the return of sanctions on Iran at the UN Security Council after Tehran allegedly violated the 2015 deal aimed at stopping it from developing a nuclear bomb. The end of the nuclear deal originally agreed by Iran, Britain, Germany, France, the US, Russia and China is likely to further exacerbate tensions in the Middle East, months after Israel and the US bombed Iranian nuclear sites. Iran denies trying to build nuclear weapons, and Iranian President Masoud Pezeshkian said on Friday that Tehran had no intention of leaving the 2015 non-proliferation treaty. After the UN sanctions were reinstated, Iran warned of a harsh response and recalled its ambassadors to Britain, France and Germany for consultations. Russia and China unsuccessfully tried to delay the return of UN sanctions on Iran, with Russian foreign minister Sergei Lavrov later calling the decision to reinstate them \"unlawful\". Read more: Some of Iran's nuclear facilities were 'destroyed' by US strikes, nuclear chief admits \n                  Son of British couple detained in Iran has 'grave concerns' about their health\n                 \n                  Some of Iran's nuclear facilities were 'destroyed' by US strikes, nuclear chief admits\n                 \n                  'They're in conditions you can't even imagine': Son of UK couple held in Iran renews plea for their release\n                  \"It cannot be implemented,\" he told reporters at the UN. He added that he had written to Antonio Guterres, the UN secretary-general, to warn him that it would be a \"major mistake\" for him to acknowledge a return of sanctions on Iran. Britain, France and Germany had offered to delay reimposing the sanctions for up to six months to allow time for talks on a long-term deal. In return, the European powers were asking for Tehran to restore access for UN nuclear inspectors, address concerns about its stock of enriched uranium, and engage in talks with the US. \"Our countries will continue to pursue diplomatic routes and negotiations. The reimposition of UN sanctions is not the end of diplomacy,\" the foreign ministers of Britain, France and Germany said in a joint statement. \"We urge Iran to refrain from any escalatory action and to return to compliance with its legally binding safeguards obligations.\" US President Donald Trump believes that diplomacy is still an option for Iran and a new deal remains the best outcome for Iranians and the world, according to US secretary of state Marco Rubio. \"For that to happen, Iran must accept direct talks, held in good faith, without stalling or obfuscation,\" he said after the reinstated sanctions were announced. Mr Rubio added that it was important that countries implement sanctions \"immediately in order to pressure Iran's leaders to do what is right for their nation, and best for the safety of the world\", and accept a new deal. Read more from Sky News:Russia warns NATO and EU of response against 'aggression'Destruction of Gaza hospital witnessed by nurse The new sanctions on Iran include an arms embargo and a ban on all uranium enrichment, reprocessing activities, the supply of anything that could be used in the country's nuclear programme, and any activity related to ballistic missiles capable of delivering nuclear weapons, including launches. There is also a travel ban on dozens of Iranians, as well as an asset freeze on a dozen Iranian individuals and entities. Iran's economy is already struggling after President Trump reimposed US sanctions during his first term in 2018, and its rial currency fell to a new record low over fears of the new sanctions."
    },
    {
        "title": "Russia launches massive attack on Kyiv - as Poland scrambles jets and closes airspace",
        "description": "Russia has launched a massive drone and missile attack on Ukraine's capital this morning, killing four people and injuring about 10,&#160;Kyiv's military administration has said.",
        "url": "https://news.sky.com/story/russia-launches-massive-attack-on-kyiv-as-poland-scrambles-jets-and-closes-airspace-13439999",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-fire-drone-ukraine_7034589.jpg?20250928101917",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-09-28 05:13:00",
        "Headline": "Drones flew over Kyiv and anti-aircraft fire rang out through the night in what independent monitors said was one of the biggest strikes on the city since the Ukraine war began in February 2022.",
        "Content": "Russia has launched a massive drone and missile attack on Ukraine's capital this morning, killing four people and injuring about 10, Kyiv's military administration has said. A 12-year-old girl is believed to be among the dead but that is yet to be officially confirmed, Tymur Tkachenko, head of Kyiv's military administration, said on the Telegram messaging app. Poland closed the airspace near two of its southeastern cities, Lublin and Rzeszow, as its air force scrambled jets in response to Russia's attack on Kyiv. Drones flew over Kyiv and anti-aircraft fire rang out through the night in what independent monitors said was one of the biggest strikes on the city since the Ukraine war began in February 2022. Ukrainian President Volodymyr Zelenskyy said Russia launched around 500 drones and over 40 missiles in the overnight attack on Ukraine. \"Moscow wants to continue fighting and killing and deserves only the harshest pressure from the world,\" Mr Zelenskyy said on the Telegram app. The attack, which started at around 6am local time (4am UK time), also saw several other regions hit, with at least 16 people, including three children, injured in the southern city of Zaporizhzhia, authorities said. \n                  Ukraine war latest: Pro-EU party lead over Moscow-leaning opposition as counting continues in high-stakes Moldova election\n                 \n                  Russia's clear warning that it can easily chip away at Europe's defences\n                 \n                  Contact with two hostages 'lost' during Israeli operations in Gaza, Hamas's armed group says\n                 Some residents in Kyiv fled to metro stations deep underground for safety as the attack continued. Poland closed its airspace near the two cities due to \"unplanned military activity related to ensuring state security\", flight tracking service Flightradar24 said. \"In connection with the activity of the Russian Federation's long-range aviation carrying out strikes on the territory of Ukraine, Polish and allied aircraft have begun operating in our airspace,\" the Polish military said in a post on X. It described the actions as preventive and aimed at securing airspace and protecting citizens. Russian foreign minister Sergei Lavrov on Saturday addressed the UN amid allegations that Moscow has violated the airspace of several of its neighbours in recent weeks. A NATO air defence mission was recently carried out over Poland in response to \"unprecedented\" Russian drone incursions above the country. On Saturday, Mr Lavrov, who has been Russia's foreign minister for 21 years, spoke in New York at the 80th UN General Assembly. During his address, Mr Lavrov said his country had no intention of attacking any NATO or EU member state but warned of a \"decisive response\" if any \"aggression\" was directed towards Moscow. \"Threats of force against Russia, accused of practically planning an attack on the North Atlantic Alliance and the European Union, are becoming increasingly common,\" Mr Lavrov said in New York. \"President Putin has repeatedly debunked such provocations. Russia has never had and does not have such intentions, but any aggression against my country will be met with a decisive response.\"  'They will regret it' After his UN address, Mr Lavrov held a news conference, where he insisted again that Moscow \"has nothing to hide\" over the allegations against it. He was then asked by US correspondent Mark Stone what the Kremlin's response would be if a nation shot down a Russian drone or plane in Russian airspace. Mr Lavrov said: \"Try to understand that a drone, when it is flying not over our territory, but if it crosses someone's border but has left our airspace, probably everyone has the right to do with that drone whatever they consider necessary to ensure their security. \"But if there are attempts to shoot down any flying object, or indeed any object at all, on our territory, in our airspace, then I think people will seriously regret it, undertaking such a gross violation of our territorial integrity, our sovereignty.\""
    },
    {
        "title": "At least five killed after Mormon church in Michigan set on fire during mass shooting",
        "description": "Five people have been killed and at least eight others injured after a mass shooting and fire at a Mormon church in Michigan, police have said.",
        "url": "https://news.sky.com/story/several-people-shot-at-mormon-church-in-michigan-13440437",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-fire-shooting-grand-blanc_7035243.jpg?20250928181937",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-28 15:36:00",
        "Headline": "The shooting took place at the Church of Jesus Christ of Latter-day Saints in Grand Blanc, about 50 miles north of Detroit.",
        "Content": " Five people have been killed and at least eight others injured after a mass shooting and fire at a Mormon church in Michigan, police have said. The suspect was shot dead by police officers, authorities said at a news conference. The incident took place at around 10.25am local time at the Church of Jesus Christ of Latter-day Saints in Grand Blanc Township, Michigan, about 50 miles north of Detroit. The suspect has been identified as Thomas Jacob Sanford, 40, from the nearby city of Burton. Police said he was \"neutralised at 10.33am\" local time. He served in the Marines and was deployed to Iraq, Sky's sister US network NBC reports. The shooter drove a vehicle through the front doors of the church before opening fire with an assault rifle.The suspect exited the vehicle and began firing rounds at people who were attending Sunday service, police said. He then deliberately started the blaze. The blaze has been extinguished but authorities believe they will find additional victims in the charred building. \n                  Donald Trump: Fact-checking the president's speech in Michigan\n                 \n                  US election: Michigan voters feel 'overlooked' by Harris campaign\n                 \n                  'We've had a lot of good energy here': University students handed cookies for voting early in Michigan\n                 At around 8pm on Sunday (1am in the UK), Grand Blanc Township Chief William Renye confirmed that a further two victims were found in the burned remains of the church, in addition to two other victims who had suffered gunshot wounds.As many as three improvised devices were found at the scene, according to two senior US law enforcement officials briefed on the investigation, NBC reported. According to Renye, when gunfire broke out, people inside the church bravely put themselves at risk to protect the children. \"They were shielding the children who were also present within the church, moving them to safety,\" he said. \"Just extreme courage.\" Renye said law enforcement officers arrived at the church within 30 seconds of receiving a 911 call. The suspect was \"neutralized\" in the back parking lot within eight minutes by a Department of Natural Resources officer and a Grand Blanc Township officer, he said. Michigan governor Gretchen Whitmer said in a statement that \"my heart is breaking for the Grand Blanc community\" after the shooting. She added: \"Violence anywhere, especially in a place of worship, is unacceptable. I am grateful to the first responders who took action quickly.\" Sheriff: 'Entire church is on fire' Genesee County sheriff Christopher Swanson said at around 12.20pm that the \"entire church is on fire\", and confirmed that people who were at the church have been evacuated. Around 20 minutes later, the police department said the fire had been contained. US attorney general Pam Bondi also confirmed the FBI and the Bureau of Alcohol, Tobacco, Firearms and Explosives were responding to the incident. US President Donald Trump said on Truth Social that \"the suspect is dead, but there is still a lot to learn\", before saying the shooting \"appears to be yet another targeted attack on Christians in the United States of America\". He added: \"PRAY for the victims, and their families. THIS EPIDEMIC OF VIOLENCE IN OUR COUNTRY MUST END, IMMEDIATELY!\" In the wake of the shooting and fire, the New York Police Department said it would deploy officers to religious institutions across the city \"out of an abundance of caution\". The incident occurred the morning after Russell M Nelson, the oldest-ever president of The Church of Jesus Christ of Latter-day Saints, died at 101. Shootings reported in North Carolina, New Orleans, Texas Meanwhile, authorities responded to a mass shooting at a coastal town in North Carolina late on Saturday, where three people were killed. At least eight others were injured in that incident, where someone opened fire from a boat into a crowd at a bar. Another shooting took place at a south Texas casino early on Sunday, with seven people shot and two killed. A woman was also killed, and three others were injured in Bourbon Street, New Orleans, early on Sunday after a shooting."
    },
    {
        "title": "Team Europe win Ryder Cup in nail-biting finale",
        "description": "Team Europe have won the Ryder Cup in New York - despite a last-minute fightback from Team USA.",
        "url": "https://news.sky.com/story/team-europe-retain-ryder-cup-in-nail-biting-finale-13440308",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-ryder-cup-2025-winner-europe-with-trophy_7035575.jpg?20250928233630",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-28 13:57:00",
        "Headline": "Tensions have frequently boiled over at this year's contest, with multiple spectators being ejected and Rory McIlroy at one point telling an attendee to \"shut the f*** up\".",
        "Content": " Team Europe have won the Ryder Cup in New York - despite a last-minute fightback from Team USA. Team Europe finished day two of the tournament with an unprecedented 11.5-4.5 lead. They then inched closer to the 14 points needed to retain the trophy before any players had even teed off on Sunday, after both teams were awarded half a point when Viktor Hovland was forced to pull out due to injury. A final day fightback saw the host side roar back into contention with a series of tight wins before Europe reached the all-important 14 points to retain the trophy thanks to a putt from Shane Lowry. Tyrrell Hatton's draw with Collin Morikawa landed Europe the final half point needed to win. Tensions have frequently boiled over at this year's contest, with multiple spectators at Bethpage Black in New York being ejected as Luke Donald's Europe dominated on Saturday. Rory McIlroy has frequently been on the receiving end of boos and heckles - some of which were led by the Ryder Cup first-tee announcer over a megaphone on Saturday. \n                  Ryder Cup 2031 to take place at Camiral in Girona, Spain as tournament heads to continental Europe for fourth time\n                 \n                  Ryder Cup: Rory McIlroy expresses concerns over Ian Poulter captaincy hopes but hopes for Jon Rahm involvement in 2025\n                 \n                  Ryder Cup: Fire breaks out at Marco Simone golf club, venue for the tournament last weekend\n                 Heather McMahan encouraged a chant of \"f*** you Rory\" ahead of the morning session. She has apologised and stepped down from her role, the PGA of America said on Sunday. Later on Saturday, McIlroy hit back by telling a spectator to \"shut the f*** up\" while his teammate Shane Lowry was seen being held back by his caddie as he tried to confront someone.  The players themselves have also clashed, with America's Bryson DeChambeau confronting Europe's Justin Rose after he asked his caddie to move while he was lining up a putt. Extra security and police officers were drafted in to control fan behaviour while big screens showed warnings about spectator noise. Holding back the tears after a draining week, McIlroy said of Europe's victory: \"I am extremely proud to be a part of this team. \"As soon as we won in Rome, we turned our attentions to doing something that was pretty impossible to do - to win in America and in New York. \"It's been an amazing week. To hear the 'Ole Ole's' here in America, to do something people thought we couldn't do, the comments after Whistling Straits (in 2021), decades of American dominance - we took a lot from that, we let it fuel us.\"  He added: \"We got so lucky in getting an incredible leader in Luke Donald and he shepherded us through the process and he's been amazing. \"Eleven of the 12 players from Rome came back. We did what we needed to do and we are going to celebrate like there is no tomorrow.\""
    },
    {
        "title": "Lorenz Kraus: New York man arrested after admitting in TV interview he killed his parents ",
        "description": "A US man has been arrested after admitting during a television interview that he killed his parents.",
        "url": "https://news.sky.com/story/lorenz-kraus-new-york-man-arrested-after-admitting-in-tv-interview-he-killed-his-parents-13440042",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-new-york-lorenz-kraus_7034480.jpg?20250928114550",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-09-28 07:13:00",
        "Headline": "Kraus was charged with two counts of murder on Friday after telling a news presenter he had suffocated them in August 2017 as an act of mercy.",
        "Content": " A US man has been arrested after admitting during a television interview that he killed his parents. Lorenz Kraus, 53, was held after leaving the studios of WRGB in Albany, New York State, on Thursday, where he admitted he had suffocated them. He has been charged with two counts of murder and two counts of concealment of a human corpse. Kraus pleaded not guilty to the charges on Friday as he appeared at Albany City Court. Kraus described the deaths of Franz and Theresia Kraus, which he said happened \"sometime August 2017\", as mercy killings for aging parents who were becoming more frail. Kraus said his father, who was 92, could no longer drive after cataract surgery, while his 83-year-old mother had recently been injured from falling while crossing a road but did not say if either had life-threatening conditions. Pressed by interviewer Greg Floyd to clarify if he killed the pair, he said he \"buried them in their property\". Mr Floyd asked: \"You buried them in the back of your house in Albany?\" \n                  Gunman who targeted NFL HQ 'had brain disease that's linked to playing American football'\n                 \n                  Donald Trump makes full-throttle assault on UN and says he is 'right about everything'\n                 \n                  Luigi Mangione: Terrorism charges dropped against alleged killer of healthcare boss\n                 Kraus said: \"Yes.\" Asked if he had suffocated them, he said: \"Yeah, basically.\" Mr Floyd asked: \"They knew that this was it for them, that they were perishing at your hand?\" Kraus replied: \"Yes. And it was so quick.\" He said his parents didn't ask to be killed but \"they knew they were going downhill. \"I did my duty to my parents. My concern for their misery was paramount.\" His arrest came a day after two bodies were found at their home in the city by detectives investigating why the couple was still receiving social security payments despite not having been seen or heard from in years. Police say Kraus had been collecting his parents' benefits and using the funds for his own personal use. In the half-hour interview, Kraus said: \"I did my duty to my parents. My concern for their misery was paramount.\" Read more on Sky News:Crowe congratulates Red RosesP Diddy to be sentencedDozens die in rally stampede Assistant Albany County Public Defender Rebekah Sokol, whose office is representing Kraus, admitted the interview was \"shocking\", but said she suspects that it is not admissible in court. A neighbour who lived next to the couple told NBC, Sky's US partner, she noticed that they vanished in June 2017. Since then, Kraus regularly visited the property to collect post, mow the lawn and clear snow, but when asked about his parents, he told her they had moved to Germany."
    },
    {
        "title": "Sean 'Diddy' Combs faces sentencing - how much time is he expected to serve?",
        "description": "Sean \"Diddy\" Combs is set to be sentenced over prostitution-related charges next week.",
        "url": "https://news.sky.com/story/sean-diddy-combs-faces-sentencing-how-much-time-is-he-expected-to-serve-13437222",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-court_6907439.jpg?20250505190258",
        "type": "US",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-28 12:00:00",
        "Headline": "Hip-hop mogul Sean \"Diddy\" Combs is just days away from being sentenced on prostitution-related charges, following his high-profile trial earlier this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs is set to be sentenced over prostitution-related charges next week. The hip-hop mogul has already served just over a year in prison after being arrested in New York in September 2023. Following his high-profile trial earlier in 2025, he was found guilty of two counts of transportation for engagement in prostitution - but cleared of the more serious charges of sex-trafficking and racketeering conspiracy. Combs, 55, was one of the most influential hip-hop producers of the 1990s and 2000s, the founder of Bad Boy Records and a Grammy-winning artist in his own right. Now, he faces up to 20 years in jail - although his defence team is arguing for much less. Here is everything you need to know ahead of his sentencing.  What is transportation to engage in prostitution? During the trial, the court heard details of sexual encounters called \"freak offs\" by Combs - also referred to as \"hotel nights\" - which involved his girlfriends and male sex workers. The rapper would \"orchestrate\" these encounters between the women and the sex workers, while he watched. Sometimes, these sessions would take place in different states across the US, as well as abroad, and Combs would pay for the sex workers and the women to travel. He was found guilty of two charges - one relating to sex workers he paid for while in a relationship with singer and model Cassie Ventura, and another relating to sex workers who took part in sessions with Jane*, a woman he was later in a relationship with who was not identified during the trial. The charges fall under America's Mann Act, which prohibits interstate commerce related to prostitution. What about the other charges? Combs was found not guilty of two counts of sex-trafficking, relating to both Cassie and Jane, and one count of racketeering conspiracy. This means while jurors believed Combs broke the law over using sex workers, they did not find the sexual encounters involving the women were non-consensual, which is what prosecutors had argued. Both Cassie and Jane gave evidence, telling the court they felt manipulated and coerced, and sometimes blackmailed, into taking part in the freak offs during their relationships with the rapper. However, defence lawyers argued these were consensual encounters and part of a \"swingers lifestyle\". \"The men chose to travel and engage in the activity voluntarily,\" defence lawyers said in legal submissions after the verdict. \"The verdict confirms the women were not vulnerable or exploited or trafficked or sexually assaulted during the freak offs or hotel nights.\" What is racketeering? Racketeering broadly means engaging in an illegal scheme or enterprise, and the charge falls under the Racketeering Influenced and Corrupt Organisations Act (RICO) in the US. According to the US justice department's definition of RICO statute, it is also illegal to \"conspire to violate\" the laws. Prosecutors alleged Combs led a racketeering conspiracy \"that engaged in sex trafficking, forced labour, kidnapping, arson, bribery, and obstruction of justice, among other crimes\". However, jurors also cleared him of this charge. Had he been found guilty of the more serious charges, he could have faced life in prison. Will Combs be jailed for 20 years? Each charge of transportation to engage in prostitution carries a maximum sentence of 10 years, so in theory he could be sentenced to up to 20 years in prison. However, it is thought his sentence will be less than this. Following the verdict, prosecutors said he should be sentenced to at least four to five years. The music mogul has been denied bail several times since his arrest and again since the trial. What do his lawyers say? Following the trial verdict, both prosecutors and the defence team have made arguments to the judge about sentencing. Most recently, Combs's lawyers submitted a legal submission to the court calling for the rapper to be jailed for no more than 14 months - which after time already served would mean him walking free almost immediately. Before this, they called for Combs to be acquitted or for a retrial on the prostitution-related charges. The US government \"painted him as a monster\", they said, but argued his two-month trial showed the allegations were \"not supported by credible evidence\". The rapper's lawyers have argued that, to their knowledge, he is \"the only person\" ever convicted of the Mann Act charges for the conduct he was accused of in court. What has the judge said? Judge Arun Subramanian, who presided over the trial, will decide Combs's fate. He has previously decided several times not to grant bail, saying the hip-hop mogul's team have failed to show sufficient evidence he is not a flight risk and also citing admissions of previous violence made during the trial. During her opening statement, Teny Geragos, who is on Combs's defence team, described him as \"a complicated man\" and conceded he could be violent. However, she argued, this was not the charge against him. Will Combs try to revive his career after 'unspeakable shame'? Despite being convicted of the prostitution-related charges, his lawyers hailed the verdict a \"victory\", given he was cleared of the more serious allegations. In interviews since, they have said he is planning a return to music with a New York gig. However, in legal submissions, they have also said the trial brought Combs \"unspeakable shame and monumental adverse consequences\" and that his \"legacy has been destroyed\". Read more:The rise and fall of Sean Combs After allegations against him were made public, Combs was removed from the boards at three charter schools he created in Harlem, the Bronx and Connecticut and was also stripped of an honorary doctorate degree from Howard University, which plans to return his prior donations, they said. He was also forced to return the key to the city of New York that was previously presented to him by the mayor, and his career has \"collapsed\". As well as this case, he is also still facing several civil lawsuits - and has \"mounting legal bills\" from defending these and the criminal charges, his lawyers have said."
    },
    {
        "title": "Team GB chief Anson to head online retailer Sportscape",
        "description": "The outgoing boss of the British Olympic Association will this week be named as the new chief executive of one of Europe's biggest e-commerce platforms for sports and outdoor enthusiasts.",
        "url": "https://news.sky.com/story/team-gb-chief-anson-to-head-online-retailer-sportscape-13440223",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-andy-anson-team-gb_7034777.jpg?20250928135252",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-09-28 12:47:00",
        "Headline": "Andy Anson will be announced on Monday as group CEO of Sportscape Group, which is owned by private equity firms bd-capital and Bridgepoint, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The outgoing boss of the British Olympic Association will this week be named as the new chief executive of one of Europe's biggest e-commerce platforms for sports and outdoor enthusiasts. Sky News has learnt that Andy Anson, who will step down next month as chief executive of Team GB, is joining Sportscape Group, which boasts a 'member community' of over 25 million people. Sportscape is owned by bd-capital and Bridgepoint, which merged their respective portfolio companies SportPursuit and PrivateSportShop in 2022. Prior to leading the BOA, Mr Anson was chief executive of Kitbag, which was subsequently sold to Fanatics. He is also a former commercial director of Manchester United Football Club. Sportscape trades across core markets including the UK, France, Germany, Italy and Spain. \"Sportscape has already established itself as a key player in the European sports e-commerce landscape, and I look forward to working with the team to unlock its next phase of growth,\" Mr Anson said in a statement issued to Sky News. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Jaguar Land Rover gets £1.5bn government-backed loan guarantee to help suppliers after crippling cyber attack\n                 \n                  Money latest: Phil Spencer reveals three questions you should ask estate agents - and one thing you should never do on a viewing\n                 Andy Dawson, bd-capital's co-founder and managing partner, said Mr Anson's experience in global sports commerce made him the right choice to head Sportscape. Since his departure as the BOA boss was announced during the summer, Mr Anson had agreed to work with another bd-capital-backed company, Science In Sport, by joining its board. His successor as Team GB chief has yet to be announced."
    },
    {
        "title": "Chancellor to make case for 'contribution' ahead of youth jobs guarantee",
        "description": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment.",
        "url": "https://news.sky.com/story/chancellor-to-make-case-for-contribution-ahead-of-youth-jobs-guarantee-13440405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-chancellor_7029992.jpg?20250924035136",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today.",
        "Content": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment. The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today. She is expected to confirm plans for every young person who has received universal credit (UC) for 18 months without \"earning or learning\" to be guaranteed an offer of paid work. Labour conference in Liverpool - follow live updates Those who refuse to take up jobs without a \"reasonable excuse\" will face sanctions such as losing their benefits, it is understood. The guarantee, which will be overseen by Work and Pensions Secretary Pat McFadden, forms part of a pledge of \"nothing less than the abolition of long-term youth unemployment\". Ms Reeves is expected to say: \"I believe in a Britain founded on contribution - where we do our duty for each other, and where hard work is matched by fair reward. \n                  If stuff doesn't work for Starmer - the vibes will be out of control\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 \"I believe in a Britain based on opportunity - where ordinary kids can flourish, unhindered by their background. \"And I believe that Britain's real wealth is found not only in the success of the fortunate few, but in the talents of all our people, in every part of our great country.\"  It comes in the wake of concerns among some Labour members that the government needs to offer voters a clearer vision of its agenda. Sir Keir Starmer has previously avoided using buzzwords to define his politics, but thinktank Labour Together published a paper last week in which it argued the concept of contribution should be put at the heart of policymaking. Read more:Burnham warns Labour not to 'underestimate the peril' party is inLabour promise changes to indefinite leave to remainMahmood vows migration law reforms Ms Reeves is expected to add: \"We won't leave a generation of young people to languish without prospects - denied the dignity, the security and the ladders of opportunity that good work provides. \"Just as the last Labour government, with its new deal for young people, abolished long-term youth unemployment I can commit this government to nothing less than the abolition of long-term youth unemployment. \"We've done it before and we'll do it again.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Mel Stride, the shadow chancellor, accused Labour of \"contradictions\" within their policies. He said: \"Rachel Reeves says she wants to abolish youth unemployment - yet in her very first budget, she introduced a £25bn jobs tax that made it more expensive for businesses to hire, especially young people. \"That's the contradiction at the heart of Labour's plan: they talk about opportunity, but their policies kill jobs. \"Since Labour came to power, unemployment is up. Business confidence is down. And now Reeves is trying to fix a problem she created - while pointing the finger of blame, as she so often does, at everyone else.\" Chancellor Rachel Reeves will be speaking to Sky News at 7.15am this morning ahead of her speech at the conference at midday."
    },
    {
        "title": "Chancellor to make case for 'contribution' ahead of youth jobs guarantee",
        "description": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment.",
        "url": "https://news.sky.com/story/chancellor-to-make-case-for-contribution-ahead-of-youth-jobs-guarantee-13440405",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-rachel-reeves-chancellor_7029992.jpg?20250924035136",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today.",
        "Content": "Rachel Reeves will stress the need for \"hard work matched by fair reward\" when she unveils plans for a \"youth guarantee\" to drive down unemployment. The chancellor will make the case for a society founded on \"contribution\" in her speech at Labour's annual conference in Liverpool today. She is expected to confirm plans for every young person who has received universal credit (UC) for 18 months without \"earning or learning\" to be guaranteed an offer of paid work. Labour conference in Liverpool - follow live updates Those who refuse to take up jobs without a \"reasonable excuse\" will face sanctions such as losing their benefits, it is understood. The guarantee, which will be overseen by Work and Pensions Secretary Pat McFadden, forms part of a pledge of \"nothing less than the abolition of long-term youth unemployment\". Ms Reeves is expected to say: \"I believe in a Britain founded on contribution - where we do our duty for each other, and where hard work is matched by fair reward. \n                  If stuff doesn't work for Starmer - the vibes will be out of control\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 \"I believe in a Britain based on opportunity - where ordinary kids can flourish, unhindered by their background. \"And I believe that Britain's real wealth is found not only in the success of the fortunate few, but in the talents of all our people, in every part of our great country.\"  It comes in the wake of concerns among some Labour members that the government needs to offer voters a clearer vision of its agenda. Sir Keir Starmer has previously avoided using buzzwords to define his politics, but thinktank Labour Together published a paper last week in which it argued the concept of contribution should be put at the heart of policymaking. Read more:Burnham warns Labour not to 'underestimate the peril' party is inLabour promise changes to indefinite leave to remainMahmood vows migration law reforms Ms Reeves is expected to add: \"We won't leave a generation of young people to languish without prospects - denied the dignity, the security and the ladders of opportunity that good work provides. \"Just as the last Labour government, with its new deal for young people, abolished long-term youth unemployment I can commit this government to nothing less than the abolition of long-term youth unemployment. \"We've done it before and we'll do it again.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Sir Mel Stride, the shadow chancellor, accused Labour of \"contradictions\" within their policies. He said: \"Rachel Reeves says she wants to abolish youth unemployment - yet in her very first budget, she introduced a £25bn jobs tax that made it more expensive for businesses to hire, especially young people. \"That's the contradiction at the heart of Labour's plan: they talk about opportunity, but their policies kill jobs. \"Since Labour came to power, unemployment is up. Business confidence is down. And now Reeves is trying to fix a problem she created - while pointing the finger of blame, as she so often does, at everyone else.\" Chancellor Rachel Reeves will be speaking to Sky News at 7.15am this morning ahead of her speech at the conference at midday."
    },
    {
        "title": "Andy Burnham warns Labour not to 'underestimate the peril' party is in",
        "description": "Andy Burnham has hit out at allies of Sir Keir Starmer for \"demanding simplistic statements of loyalty\", claiming they are underestimating the \"peril\" Labour is in. ",
        "url": "https://news.sky.com/story/andy-burnham-warns-labour-not-to-underestimate-the-peril-party-is-in-13440515",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-burnham-labour_7035455.jpg?20250928205330",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-09-28 16:58:00",
        "Headline": "The mayor of Greater Manchester says the local elections next year pose a huge challenge and his interventions are about sparking a debate about Labour's direction.",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Andy Burnham has hit out at allies of Sir Keir Starmer for \"demanding simplistic statements of loyalty\", claiming they are underestimating the \"peril\" Labour is in.  The mayor of Greater Manchester insisted his recent interventions have not been about \"personal ambition\", but starting an \"open debate\" about the direction of the party ahead of potentially catastrophic local and devolved elections next year. In the lead up to Labour's annual conference in Liverpool this week, the so-called \"King of the North\" has accused Sir Keir of having no vision for the country, while setting out his own policy proposals. Follow the latest from our politics team  It has fuelled mounting speculation he could launch a future leadership challenge against the prime minister, who in turn has compared Mr Burnham to Liz Truss. At a fringe event on the opening day of the conference, the Northern mayor said: \"I was clear in the interviews I gave last week, I wanted to launch a debate about the direction of the party and getting a plan to beat Reform UK. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  London mayor Sadiq Khan hits out at 'misinformation' as new figures show fall in crimes\n                 \"Those out there making calls for simplistic statements of loyalty are underestimating the peril the party is in.\" Two polls this week have predicted Reform UK leader Nigel Farage will become the next prime minister, while a poll of Labour members found more than half of them don't want Sir Keir to fight the next general election. Mr Burnham later turned up to a rally about Proportional Representation (PR), in which he insisted he wanted \"this government to work\". He received a rapturous reception as he entered the room, flanked by over a dozen photographers. Mr Burnham made light of the attention, quipping that \"there's nothing more unstoppable than an idea whose time has come\", in reference to PR. But this was not the focus of the punchy speech that followed, in which he criticised the Labour leadership's handling of dissent, saying a \"climate of fear\" was preventing MPs from having an \"open debate\" about the direction of the party. 👉Listen to Politics at Sam and Anne's on your podcast app👈 A handful of Labour MPs have been suspended over the past year for criticising the government on issues like welfare reform and the two child benefit cap, but Mr Burnham has the freedom to be outspoken as he is not a member of parliament. He said he had been accused of \"all sorts of things\" in the past week but had done \"nothing more than launch a debate\". Mr Burnham drew clear dividing lines in a recent interview with The New Statesman, as he said the country should be \"less in hock to the bond markets\", called for a greater focus on council housing and said public utilities should be nationalised. It fuelled speculation of an impending leadership challenge, given Mr Burnham fought twice to run the Labour Party while he was an MP, before stepping down in 2017 to run for the metro mayor position. He has not ruled out a return to Westminster and last week claimed Labour MPs have privately asked him to stand. Sir Keir tried to shut down the narrative by suggesting Mr Burnham's policies would unleash the economic chaos of Ms Truss, whose fatal mini budget sent the markets into meltdown, as he dismissed the \"personal ambitions of the mayor\". However, in a direct message to \"those who say that I'm speaking out purely for my own ambition\", a defiant Mr Burnham said: \"I can say to you tonight I am speaking out for the thousands of councillors here at this conference who are worried about going to those doorsteps next May, speaking for the members of the Senedd who, again, are working hard to keep Wales Labour... and, of course, members of the Scottish parliament as well, who want a stronger story about Labour to go to those doorsteps. \"I'm speaking out for the millions of good people around Britain who want a more hopeful direction for the country. \"I think we can do it. I honestly believe it can be done. We can make this government work, we can find that more hopeful direction and we can win again at the next general election.\" The speech was met with a big round of applause from members, while one Labour MP told Sky News it was a \"great speech\". And while cabinet ministers have called for the party to unite behind the prime minister to fight Reform UK - there appeared to a change in tone from Wes Streeting as the first day of conference drew to a close. The health secretary told a fringe event that the government must be \"open to challenge\" from within. He said: \"We've got to be self-confident enough as ministers to be open to challenge, and openly debate different ideas, because it makes you stronger as a government.\""
    },
    {
        "title": "Labour promise changes to indefinite leave to remain - but don't go as far as Reform",
        "description": "Indefinite leave to remain (ILR) will be tougher to acquire under new rules, the home secretary is to confirm - as Labour seek to counter Nigel Farage's anti-migration policies.",
        "url": "https://news.sky.com/story/labour-promise-changes-to-indefinite-leave-to-remain-but-dont-go-as-far-as-reform-13440249",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-british-uk-passport_7034853.jpg?20250928143651",
        "type": "Politics",
        "Author": "Tim Baker",
        "Date Published": "2025-09-28 13:11:00",
        "Headline": "Home Secretary Shabana Mahmood says she will make it harder to settle in the UK - but her changes don't go as far as Reform UK's.",
        "Content": "\n          Political reporter\n              @TimJ_B\n Indefinite leave to remain (ILR) will be tougher to acquire under new rules, the home secretary is to confirm - as Labour seek to counter Nigel Farage's anti-migration policies. Shabana Mahmood will reveal details of promised reforms to the system, including higher English language requirements, as well as paying into national insurance, a \"spotless\" criminal record and having a job. However, unlike Reform's policy, Labour do not plan to deport people who already have ILR who do not apply to be British citizens. Labour Party conference: Follow live updates here  Speaking on Sunday, Sir Keir Starmer branded Mr Farage's proposals \"racist\". Ms Mahmood is set to speak at the Labour Party on conference on Monday where she will confirm her party's plans. Ahead of the speech, Labour said: \"These measures draw a clear dividing line between the Labour government and Reform, whose recent announcement on indefinite leave to remain would force workers, who have been contributing to this country for decades, to leave their homes and families.\" Ms Mahmood is set to tell the Labour Party conference that her policies are needed for an \"open, generous, tolerant\" country - but members \"won't always like what I do\". However, she is also set to say she will be a \"tough Labour home secretary, fighting for a vision of this country that is distinctly our own\". Read more:Mahmood vows migration law reformsLabour and Lib Dems could learn from Farage's plansUK records second biggest annual population jump in 75 years Concerns over ILR - which gives people the right to settle, work and study in the UK and even claim benefits - have been mounting in the lead up to January 2026, when a large number of people are expected to become eligible for the status. Those who have lived and worked in the UK for five years are eligible for ILR - and January next year will see the first of the so-called \"Boriswave\" reach this checkpoint. This is the increase in immigration that began under former prime minister Boris Johnson, when his post-Brexit immigration policies came into force. Statistics from the past two periods on record - 2022 to 2023 and 2023 to 2024 - showed the highest level of legal immigration to the UK since current record keeping began in the 1940s, according to the Office for National Statistics (ONS).  Some have warned that this cohort being eligible for ILR could put further strain on public service, housing and the welfare budget. Reform's head of policy Zia Yusuf, when his party's policy was announced, said: \"Between 2026 and 2030, thanks to the Boriswave, 800,000 new migrants are estimated to get ILR. \"About half of all of them will never work, ever.\" Reform claimed this would cost hundreds of billions of pounds - but the numbers were in fact from a withdrawn thinktank paper. 👉Listen to Politics at Sam and Anne's on your podcast app👈 Labour are already consulting on whether to change the five-year period before ILR claims can be submitted to 10 years - but it is not clear when this will come into force. As well as a crackdown on migration, Ms Mahmood will also announce a \"winter of action\" aimed at tackling shoplifting over the Christmas period."
    },
    {
        "title": "London mayor Sadiq Khan hits out at 'misinformation' as new figures show fall in crimes",
        "description": "Sadiq Khan has hit back at politicians \"spreading misinformation\" about safety in London as new data shows the number of violent crimes leading to injury has fallen in every borough over the past year.",
        "url": "https://news.sky.com/story/london-mayor-sadiq-khan-hits-out-at-misinformation-as-new-figures-show-fall-in-crimes-13440442",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-sadiq-khan-donald-trump_7030271.jpg?20250924120816",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-28 23:01:00",
        "Headline": "Sir Sadiq Khan's comments come after renewed attacks from US President Donald Trump - who recently claimed \"crime in London is through the roof\".",
        "Content": "Sadiq Khan has hit back at politicians \"spreading misinformation\" about safety in London as new data shows the number of violent crimes leading to injury has fallen in every borough over the past year. Figures from the mayor's office for policing and crime compare the 12 months ending in August 2025 with the previous 12 months - and show there were 8,749 fewer crimes which resulted in someone being hurt, a drop of nearly 12%. The borough of Havering in east London recorded the largest drop (16.3%) followed by Enfield in north London (16.1%). The smallest decreases were in Greenwich (4.3%) and Kensington and Chelsea (4.6%). Sir Sadiq said: \"We've seen a number of politicians here and across the globe talking down London and spreading misinformation about crime and safety in the capital. \"The evidence is clear, our approach to tackling crime and its complex causes works. It's driving down violence right across the capital.\" His comments come after Donald Trump reignited his feud with Sir Sadiq earlier this month by accusing him of doing a \"terrible job\" and claiming \"crime in London is through the roof\". \n                  Play hard, party harder: England's Red Roses revel in World Cup glory at London celebrations\n                 \n                  Nursery worker who kicked, punched and pinched children in her care is jailed\n                 \n                  Barry George charged with rape and indecent assault\n                 The US president also hit out at the mayor in a speech at the UN General Assembly on Tuesday, where he also made the outlandish claim that London \"wants Sharia law\" - something there is no evidence for.  Asked about the attacks, Sir Sadiq said: \"I think President Trump has shown he is racist, he is sexist, he is misogynistic, and he is Islamophobic.\" He added that the public would be \"wondering what it is about this Muslim mayor who leads a liberal, multicultural, progressive, successful city that means I appear to be living rent-free inside Donald Trump's head\". Read more:Trump's jaw-dropping weekStarmer hits out at Reform's 'racist' policy According to the mayor's office, overall homicides in London are at a 10-year low, and the city's rate is lower than in Berlin, Brussels, Madrid, Paris and all major US cities. The rate of homicide was down by 17% in the 12-month period to June this year compared with the 12-month period to May 2016, it previously said. Metropolitan Police Assistant Commissioner Rachel Williams said: \"We're targeting the most dangerous individuals, disrupting criminal networks, and investing in prevention to protect those most at risk. \"That's why fewer people are being hurt, fewer lives are being lost, and London is becoming a safer city.\" The Conservatives rejected the suggestion that London is safer. Shadow home secretary Chris Philp said: \"Under this Labour mayor, criminals know the odds are stacked in their favour. \"Only one in 20 robberies is solved, fewer offenders are being jailed, and more than a thousand police officers have been cut from the Metropolitan Police, with Sir Mark Rowley warning of further losses this year. \"Londoners don't feel safer because London isn't safer.\""
    },
    {
        "title": "If stuff doesn't work for Starmer - the vibes will be out of control",
        "description": "If Sir Keir Starmer keeps the focus on vibes alone at this conference, he'll probably do just fine here in Liverpool.",
        "url": "https://news.sky.com/story/if-stuff-doesnt-work-for-starmer-the-vibes-will-be-out-of-control-13440669",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-starmer-exit_7034600.jpg?20250928104442",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-09-28 20:08:00",
        "Headline": "The big lingering question for Sir Keir Starmer is not about vibes and not about personnel. It's about whether any of it will actually work.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n If Sir Keir Starmer keeps the focus on vibes alone at this conference, he'll probably do just fine here in Liverpool. Flags. Patriotism. Determination. Change. Grit. Frustration. Optimism. The word cloud on Tuesday will come out just fine. And there's no doubt he's helped along the way by the faux fight with the King of the North. Government aides were laughing at yet another Andy Burnham this morning - having renounced the Bond Markets, he's now denounced the renunciation. They're not worried. But the big lingering question is not about vibes and not about personnel. It's about whether any of it will actually work. Policy - not Sir Keir's strong suit - is absolutely fundamental to delivering the change he harps on about, and will ultimately determine whether this government succeeds. Follow the latest from our politics team Because the problem of this government, and its interminable obsession with who is up and who is down, is because until now Sir Keir has lacked a vision of change the country can get behind - something he pleaded guilty to on TV this morning by saying he would fix that this week. Without policy, it is hard for the people in Liverpool to have passion. Absent this morning is any conversation about the biggest challenge facing this government - the £30bn black hole. \n                  Chancellor to make case for 'contribution' ahead of youth jobs guarantee\n                 \n                  Labour promise changes to indefinite leave to remain - but don't go as far as Reform\n                 \n                  Labour MPs gather in Liverpool as Starmer mounts fightback against Reform\n                 The government is having three meetings a week about it, yet the prime minister has conspicuously nothing new to say about it and no desire to say it. The chancellor suggested additional growth from a youth mobility scheme. Not only is that policy not signed off, but the idea that it would touch the sides of the £30bn black hole is, as ex-Institute for Fiscal Studies (IFS) director Paul Johnson points out, for the birds. This is one challenge that Ben Nunn, Rachel Reeves's director of communications, will not have to worry about if he agrees to return to Number 10 after the budget to plug the gaps as I revealed on the Politics At Sam And Anne's podcast.  There will be some defence of the fiscal position in Monday's Reeves speech. But the kindest explanation more generally about the absence of discussion about the black hole from a ministerial aide was that it would come after conference season with \"difficult\" conversations with the Parliamentary Labour Party. But equally, why do today what you can put off until tomorrow. So then there is a question of the policy they do want to talk about: ID cards. This was announced on Friday, but the question asked by ministers is whether the party can withstand the opposition which is already looming on the horizon. Sir Keir sold the idea as a patriotic answer to part of the problem posed by illegal migration, and stopping people who come over here on small boats from taking jobs. There was no clear answer from the PM when pressed on the BBC this morning that people who employ illegal migrants were already breaking the law. But the challenge on this policy goes deeper, as I also reveal on the podcast. I understand that inside government there is no idea how to begin to answer the question of how this will work. It could be based on the existing passport databases, the driving licence databases, the veterans card or visas system. But even more strikingly, I am told by a government spokesman that despite this being core to identity and sold as an answer to illegal migration, the Home Office is not in the lead but instead it will be overseen by the Department for Science, Innovation and Technology (DSIT), now run by Liz Kendall. 👉Listen to Politics at Sam and Anne's on your podcast app👈 \"We have some of the youngest staff in Whitehall,\" said a source on why DSIT was the right place to lead the policy. The Home Office passed on the opportunity to take the lead. None of this bodes well for a successful rollout. This is yet another a massive policy that was not in the manifesto and bears all the hallmarks of being rushed. Then there is broader gap between Sir Keir's approach on immigration and that of the new home secretary. He called some Reform UK policies racist this morning, emphasising the dividing line is between legal and illegal policies. But writing in The Sun, Shabana Mahmood is talking about making things that are currently legal illegal - changing the Refugee Convention, changing the rules around indefinite leave to remain. Under her vision, maybe 400,000 people could be required to leave. These are huge numbers for a Labour home secretary to be thinking about. Removing numbers on this scale could make the dividing line with Reform UK much harder. How much is Sir Keir really across the new approach being taken by Ms Mahmood? How does the Reeves pro-EU youth mobility announcement conflict with the Mahmood approach in her speech and interviews? Who is reconciling competing ministerial interests? I am repeatedly told that Sir Keir acts as if the announcement of the policy is the moment he hands it over to colleagues, then only checks in months later, bemused why things haven't happened. Some people think he is very much the chairman of his government. Perhaps he needs to become more like an interventionist chief executive. Because ultimately if stuff doesn't work, the vibes will be out of control."
    },
    {
        "title": "Reform's immigration policy is 'racist' and 'immoral', says Sir Keir Starmer",
        "description": "Reform's immigration policy is \"racist\" and \"immoral\", Sir Keir Starmer has said.",
        "url": "https://news.sky.com/story/reforms-immigration-policy-is-racist-says-sir-keir-starmer-13440103",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-reform-nigel-farage_6975963.jpg?20250728130942",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-09-28 09:33:00",
        "Headline": "Reform has said it would axe the right of migrants to apply for indefinite leave to remain, ban anyone who is not a UK citizen from claiming benefits, and force those applying for UK citizenship to renounce other citizenship.",
        "Content": "Reform's immigration policy is \"racist\" and \"immoral\", Sir Keir Starmer has said. He was reacting after Nigel Farage's party said it would axe the right of migrants to apply for indefinite leave to remain (ILR), ban anyone who is not a UK citizen from claiming benefits, and force those applying for UK citizenship to renounce other citizenship. This policy could impact hundreds of thousands of people, although Reform has exempted EU citizens with settled status from its plans to ban migrant access to benefits and its policies on ILR. Indefinite leave to remain is the status which grants legal migrants the ability to settle in the UK without the need to renew a visa every few years. Labour conference in Liverpool - follow live updates Speaking to the BBC, the prime minister and Labour leader said: \"Well, I do think that it is a racist policy. I do think it is immoral. It needs to be called out for what it is.\" But he did not condemn those supporting Reform UK. \n                  Nigel Farage on course to be next prime minister, mega poll projects\n                 \n                  Farage and Tice right to scrutinise one of Bank of England's most radical monetary experiments in history\n                 \n                  Farage criticised for failing to 'stand up to idol' Trump over autism claim\n                 Sir Keir added: \"No, I think there are plenty of people who either vote Reform or are thinking of voting Reform who are frustrated. \"They had 14 years of failure under the Conservatives, they want us to change things. \"They may have voted Labour a year ago, and they want the change to come more quickly. I actually do understand that.\"  He had said previously: \"It is one thing to say we're going to remove illegal migrants, people who have no right to be here. I'm up for that. \"It is a completely different thing to say we are going to reach in to people who are lawfully here and start removing them. They are our neighbours. \"They're people who work in our economy. They are part of who we are. It will rip this country apart.\" Labour has proposed its own changes to indefinite leave to remain, although it does not appear to be retrospective like Reform's. Read more:Labour proposes change to migrationPM mounts fightback against Reform  Responding to the prime minister on social media, Reform's head of policy Zia Yusuf said \"Labour's new message to the British electorate just dropped: \"'Pay hundreds of billions for foreign nationals to live off the state forever, or we'll call you racist!'\" Polling released at the start of the Labour conference by Survation shows that 65% of party members think Labour is going in the wrong direction, 64% think Sir Keir has done badly since taking office and 53% think the party should change leader before the next general election. Speaking to Sunday Morning with Trevor Phillips on Sky News, Housing Secretary Steve Reed defended his government's record. He claimed wages went up faster in 10 months under Labour compared to 10 years under the Conservatives. But he claimed it \"takes time\" for improvements to really be felt by the public, \"so we have to stay on course and not divert on the basis of one poll or another\". 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Mr Reed said that the \"revolving door\" of Tory leaders was one of the reasons for Labour's tricky inheritance - and he was \"absolutely\" sure Sir Keir should lead the party into the next general election. The minister went on to brand Mr Farage a \"plastic\" patriot after the Reform UK leader \"begged\" the US Congress to put sanctions on British workers."
    },
    {
        "title": "Sean 'Diddy' Combs faces sentencing - how much time is he expected to serve?",
        "description": "Sean \"Diddy\" Combs is set to be sentenced over prostitution-related charges next week.",
        "url": "https://news.sky.com/story/sean-diddy-combs-faces-sentencing-how-much-time-is-he-expected-to-serve-13437222",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-sean-combs-diddy-court_6907439.jpg?20250505190258",
        "type": "Entertainment",
        "Author": "Gemma Peplow",
        "Date Published": "2025-09-28 12:00:00",
        "Headline": "Hip-hop mogul Sean \"Diddy\" Combs is just days away from being sentenced on prostitution-related charges, following his high-profile trial earlier this year.",
        "Content": "\n          Culture and entertainment reporter\n              @gemmapeplow\n Sean \"Diddy\" Combs is set to be sentenced over prostitution-related charges next week. The hip-hop mogul has already served just over a year in prison after being arrested in New York in September 2023. Following his high-profile trial earlier in 2025, he was found guilty of two counts of transportation for engagement in prostitution - but cleared of the more serious charges of sex-trafficking and racketeering conspiracy. Combs, 55, was one of the most influential hip-hop producers of the 1990s and 2000s, the founder of Bad Boy Records and a Grammy-winning artist in his own right. Now, he faces up to 20 years in jail - although his defence team is arguing for much less. Here is everything you need to know ahead of his sentencing.  What is transportation to engage in prostitution? During the trial, the court heard details of sexual encounters called \"freak offs\" by Combs - also referred to as \"hotel nights\" - which involved his girlfriends and male sex workers. The rapper would \"orchestrate\" these encounters between the women and the sex workers, while he watched. Sometimes, these sessions would take place in different states across the US, as well as abroad, and Combs would pay for the sex workers and the women to travel. He was found guilty of two charges - one relating to sex workers he paid for while in a relationship with singer and model Cassie Ventura, and another relating to sex workers who took part in sessions with Jane*, a woman he was later in a relationship with who was not identified during the trial. The charges fall under America's Mann Act, which prohibits interstate commerce related to prostitution. What about the other charges? Combs was found not guilty of two counts of sex-trafficking, relating to both Cassie and Jane, and one count of racketeering conspiracy. This means while jurors believed Combs broke the law over using sex workers, they did not find the sexual encounters involving the women were non-consensual, which is what prosecutors had argued. Both Cassie and Jane gave evidence, telling the court they felt manipulated and coerced, and sometimes blackmailed, into taking part in the freak offs during their relationships with the rapper. However, defence lawyers argued these were consensual encounters and part of a \"swingers lifestyle\". \"The men chose to travel and engage in the activity voluntarily,\" defence lawyers said in legal submissions after the verdict. \"The verdict confirms the women were not vulnerable or exploited or trafficked or sexually assaulted during the freak offs or hotel nights.\" What is racketeering? Racketeering broadly means engaging in an illegal scheme or enterprise, and the charge falls under the Racketeering Influenced and Corrupt Organisations Act (RICO) in the US. According to the US justice department's definition of RICO statute, it is also illegal to \"conspire to violate\" the laws. Prosecutors alleged Combs led a racketeering conspiracy \"that engaged in sex trafficking, forced labour, kidnapping, arson, bribery, and obstruction of justice, among other crimes\". However, jurors also cleared him of this charge. Had he been found guilty of the more serious charges, he could have faced life in prison. Will Combs be jailed for 20 years? Each charge of transportation to engage in prostitution carries a maximum sentence of 10 years, so in theory he could be sentenced to up to 20 years in prison. However, it is thought his sentence will be less than this. Following the verdict, prosecutors said he should be sentenced to at least four to five years. The music mogul has been denied bail several times since his arrest and again since the trial. What do his lawyers say? Following the trial verdict, both prosecutors and the defence team have made arguments to the judge about sentencing. Most recently, Combs's lawyers submitted a legal submission to the court calling for the rapper to be jailed for no more than 14 months - which after time already served would mean him walking free almost immediately. Before this, they called for Combs to be acquitted or for a retrial on the prostitution-related charges. The US government \"painted him as a monster\", they said, but argued his two-month trial showed the allegations were \"not supported by credible evidence\". The rapper's lawyers have argued that, to their knowledge, he is \"the only person\" ever convicted of the Mann Act charges for the conduct he was accused of in court. What has the judge said? Judge Arun Subramanian, who presided over the trial, will decide Combs's fate. He has previously decided several times not to grant bail, saying the hip-hop mogul's team have failed to show sufficient evidence he is not a flight risk and also citing admissions of previous violence made during the trial. During her opening statement, Teny Geragos, who is on Combs's defence team, described him as \"a complicated man\" and conceded he could be violent. However, she argued, this was not the charge against him. Will Combs try to revive his career after 'unspeakable shame'? Despite being convicted of the prostitution-related charges, his lawyers hailed the verdict a \"victory\", given he was cleared of the more serious allegations. In interviews since, they have said he is planning a return to music with a New York gig. However, in legal submissions, they have also said the trial brought Combs \"unspeakable shame and monumental adverse consequences\" and that his \"legacy has been destroyed\". Read more:The rise and fall of Sean Combs After allegations against him were made public, Combs was removed from the boards at three charter schools he created in Harlem, the Bronx and Connecticut and was also stripped of an honorary doctorate degree from Howard University, which plans to return his prior donations, they said. He was also forced to return the key to the city of New York that was previously presented to him by the mayor, and his career has \"collapsed\". As well as this case, he is also still facing several civil lawsuits - and has \"mounting legal bills\" from defending these and the criminal charges, his lawyers have said."
    },
    {
        "title": "Ashraf Mahrous: Egypt's 'strongman' wrestler pulls ship using his teeth",
        "description": "An Egyptian wrestler is hoping he has set a world record after pulling a 700-ton (635,000kg) ship with his teeth.",
        "url": "https://news.sky.com/story/ashraf-mahrous-egypts-strongman-wrestler-pulls-ship-using-his-teeth-13440098",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-egypt-ashraf-mahrous_7034583.jpg?20250928101156",
        "type": "Strange",
        "Author": "Unknown",
        "Date Published": "2025-09-28 09:13:00",
        "Headline": "Nicknamed 'Kabonga' and also known simply as 'strongman', Mahrous pulled the vessel across the water in Egypt's Red Sea resort of Hurghada and later pulled two ships weighing around 1,150 tons together.",
        "Content": " An Egyptian wrestler is hoping he has set a world record after pulling a 700-ton (635,000kg) ship with his teeth. Ashraf Mahrous, 44, pulled it across the water in Egypt's Red Sea resort of Hurghada on Saturday. Mahrous, nicknamed 'Kabonga' and known to Egyptians as 'strongman', later pulled two ships weighing about 1,150 tons (1,043,000kg) together. Mahrous said afterwards: \"Today, I have come to break the world record. I pulled them both, thanks to God, to prove to my friends and the whole world that God blessed me by being the strongest man in the world.\" The wrestler, from the port city of Ismalia, said he will send videos and photos of his attempt to Guinness World Records to see if he has set a new mark, as the current record is a 614-ton (557,000kg) ship set in 2018. In March, Mahrous pulled a train weighing 279 tons (253,105kg) with a rope in his teeth for nearly 10 metres (33ft) and was formally recognised by Guinness World Records for the heaviest rail pull, along with certificates for the heaviest locomotive pull and for the fastest 100-metre road vehicle pull. Three years earlier, he was recognised for pulling a 15,730kg truck with his teeth. \n                  British-Egyptian activist Alaa Abd El Fattah released from prison after being pardoned\n                 \n                  Irish politician faces deportation from Egypt after trying to cross into Gaza\n                 \n                  Laila Soueif: It's a 'miracle' mother of jailed activist is alive on day 245 of hunger strike, family says\n                 He built up his strength for Saturday's challenge by training six hours a day while eating a protein and iron-rich diet, featuring at least a dozen eggs, two whole chickens, and 5kg of fish. Mahrous, who stands 6ft 3in (1.9m) tall and weighs 155kg (341lbs), said his strength emerged early and began lifting items for money when he was nine. He once accidentally broke a friend's arm when he tried to pull him as they played. Growing up, he loved sports and trained in kung fu, kickboxing and set up a wrestling team in Cairo. Friends who saw him easily flip giant tyres 10 times in a row in a deserted courtyard at their gym, and push a car using only a finger, persuaded him to go for a world record. He takes no supplements, he says, but eats, sleeps and works out at least twice every day. Read more on Sky News:Crowe congratulates Red RosesP Diddy to be sentencedDozens die in rally stampede Next, he is going to ask Egypt's president Abdul Fattah al Sisi for permission to pull a submarine and one day wants to pull a plane using only his eyelid muscles. Mahrous believes that speaking with the object he pulls beforehand helps him establish a connection and is key to his success. \"It's important for me to treat the object that I will pull as part of my body that moves along with my heartbeat,\" he said."
    }
]