[
    {
        "title": "Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'",
        "description": "The US will take over Gaza and \"own it\", Donald Trump has said.\n",
        "url": "https://news.sky.com/story/donald-trump-says-gaza-residents-should-be-resettled-or-they-will-end-up-dying-13303161",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-palestinians-nuseirat_6809287.jpg?20250124140119",
        "type": "Home",
        "Author": "Andy Hayes and Claire Gilbody Dickerson, news reporters",
        "Date Published": "2025-02-04 19:02:00",
        "Headline": "Donald Trump described Gaza as \"hell\" and \"one of the meanest, toughest places on earth\" as Benjamin Netanyahu visited him at the White House. ",
        "Content": "By Andy Hayes and Claire Gilbody Dickerson, news reporters   The US will take over Gaza and \"own it\", Donald Trump has said.\n Speaking alongside Israeli Prime Minister Benjamin Netanyahu at the White House, he said the two million Palestinian people living in the territory, which he described as a \"demolition site\", would go to \"various domains\". Asked about deploying US troops to fill a potential security vacuum, the president replied: \"We'll do what is necessary.\" Expanding on plans for the territory, he said the US would \"develop it, create thousands and thousands of jobs\" and turn it into \"something the entire Middle East can be very proud of\". The president reiterated his suggestion from 25 January that Palestinians could be relocated to Egypt and Jordan - something both countries, other Arab nations including Saudi Arabia, and Palestinian leaders, have rejected. Palestinians in Gaza could go to countries beyond Jordan and Egypt too, he said. Asked whether he thought Egypt and Jordan would accept Palestinians, he said he believed they would. But, he added: \"I hope we could do something where they wouldn't want to go back. Who would want to go back? \"They've experienced nothing but death and destruction.\" However, Saudi Arabia immediately responded, stressing its rejection of attempts to displace Palestinians from Gaza, and insisted it would not establish relations with Israel without a Palestinian state. Asked on what authority the US could take control of Gaza, Mr Trump told reporters he sees a \"long term ownership position\" which would, he claimed, bring stability to that part of the Middle East. \"This was not a decision made lightly,\" he said. \"Everybody I've spoken to loves the idea of the United States owning that piece of land, developing and creating thousands of jobs.\" It would be the \"Riviera of the Middle East\". He continued: \"I've studied it. I've studied this very closely over a lot of months, and I've seen it from every different angle.\" He does not believe Palestinians should return to Gaza because it is a \"guarantee that they're going to end up dying\". He talked about finding a \"beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what's happening in Gaza\".  Read more from Sky News: 'Hardest Geezer' to run full length of New ZealandWhy China has not retaliated more in Donald Trump trade spat The war, triggered by Hamas carrying out a massacre of 1,200 people and taking 250 others hostage during the 7 October 2023 attacks in Israel, has temporarily stopped since the long-sought ceasefire deal came into effect on 19 January. More than 47,000 Palestinians have been killed in Gaza since Hamas's attack, according to local authorities. Mr Netanyahu, the first world leader to meet Mr Trump since the pro-Israel president's return to the White House, sat beside the Republican as he answered questions from the press. US correspondent If President Trump is to be taken at face value then he is set to repeat history. It would end the prospect of a two-state solution - Israelis and Palestinians living side by side on the same land. It could also wreck any prospects of diplomatic normalisation between Israel and Gulf Arab states.  Nations like Saudi Arabia wouldn't stand for such a permanent resettlement and probably wouldn't trust any resettlement presented as 'temporary' - which this is conspicuously not. The two countries being told to take the people of Gaza - Egypt and Jordan - have firmly refused to do so. The American president seems convinced they will roll over. Maybe though this is part of Trump's art of the deal: to suggest something, then not follow through - and present that as a concession down the line. There’s something else too. Even if Israeli PM Netanyahu believes it's a plan that can't work and could further the cries of ethnic cleansing (it's notable that he didn't add his overt support to it alongside Trump) the president's plan will certainly help him domestically where his future is fragile. Netanyahu can dangle 'permanent relocation' in front of the real hardliners in his government who keep him in power. Whatever is at play here, the announcement today will horrify Palestinians and it will delight and embolden the hardline elements of Israeli society who have dreamt of a Jewish state free of Palestinians. 'Plans change with time' The US president hinted he would seek an independent Palestinian state as part of a broader two-state solution to the decades-long Israel-Palestine conflict. \"Well, a lot of plans change with time,\" he told reporters when he was asked if he was still committed to a plan similar to the one he spelled out in 2020 that described a possible Palestinian state. That plan proposed a series of Palestinian enclaves surrounded by an enlarged Israel, did not have the Palestinian capital in East Jerusalem, but suggested a Palestinian capital on the outskirts of the city. \"A lot of death has occurred since I left and now came back. Now we are faced with a situation that's different - in some ways better and in some ways worse. But we are faced with a very complex and difficult situation that we'll solve,\" he said. On the likelihood of getting a permanent ceasefire in Gaza, Mr Trump said: \"We are dealing with a lot of people, and we have steps to go yet, as you know, and maybe those steps go forward, and maybe they don't. \"We're dealing with a very complex group of people, situation and people, but we have the right man. We have the right leader of Israel. He's done a great job.\" Mr Trump was also asked whether he should get the Nobel Peace Prize. He said: \"They will never give me a Nobel Peace Prize. It's too bad. I deserve it, but they will never give it to me.\""
    },
    {
        "title": "Trump's Gaza solution betrays his ignorance of history - and could make the conflict worse",
        "description": "For a man ignorant in the history and ways of the Middle East, it makes perfect sense.",
        "url": "https://news.sky.com/story/trumps-gaza-solution-betrays-his-ignorance-of-history-and-could-make-the-conflict-worse-13303310",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-white-house_6819915.jpg?20250204233331",
        "type": "Home",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-02-04 23:23:00",
        "Headline": "Contrary to the US president's claim that many countries have offered to help take Palestinians in, none have done so publicly.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n For a man ignorant in the history and ways of the Middle East, it makes perfect sense. The people of Gaza do not have homes to go back to, their land is a living hell and has brought them nothing but suffering. Surely the world can get together and build them somewhere nice where they can live instead. Crucial meeting between Trump and Netanyahu: Live updates Donald Trump should know better than that you might say. He is after all the leader of the free world and has at his disposal as many foreign policy advisers as he cares to listen to. Trump says Gaza residents should be resettled permanently or they will end up dying If he had asked them they would have told him there are a few issues with his proposal that the people of Gaza leave and don't go back. \n                  Trump threatens Iran would be 'obliterated' if it assassinates him - as he signs 'tough' directive against Tehran\n                 \n                  Trump maximises leverage over Iran by squeezing where it hurts most\n                 \n                  Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'\n                 Firstly they regard Gaza as their home. They are fiercely proud of their heritage and their history of being there. Ask anyone who has ever been to Gaza. Secondly, contrary to the US president's claim that many countries have offered to help take them in, none have done so publicly. In fact Israel's immediate neighbours Egypt, Jordan, Saudi Arabia have all dismissed the idea out of hand. But thirdly, and more to the point, there is a long and dark history of Palestinians being encouraged one way or another to leave their homes never to return. Many of those living in Gaza's 'refugee camps' are descendants of the victims of the Nakba, as they call it, or the catastrophe when during Israel's first war of independence, they had to flee homes on land that is now in Israel. They believe they should be allowed to return to that land which they say Israelis wrongly took from them. Any acquiescence with another mass displacement would be a betrayal of their forefathers' rights of return, they believe. In the early days of the Gaza war, Israeli right wing politicians quietly pushed the idea that maybe the world could take Gazans in, give them a better life etc. They don't really want to live there anyway we were told, they'd be much better off in Michigan, or the emptier bits of Europe, or maybe Jordan, and Egypt might be persuaded to take in more in return for the huge amounts of American aid they receive. Those politicians and diplomats understand their neighbours more than Donald Trump, or should do and should have known better. But the idea never went away. Donald Trump it seems was listening and is now advocating the idea despite all its obvious shortcomings. That will embolden far right Jewish extremists in the Netanyahu government who openly advocate the return of Israeli settlers to occupy Gaza. But it will do nothing to bring a solution to the conflict - quite the opposite."
    },
    {
        "title": "Worst mass shooting in Sweden's history with 11 killed at adult education centre",
        "description": "Swedish police have said 11 people have been killed at an adult education centre, in what the country's prime minister said is the worst mass shooting in Sweden's history.",
        "url": "https://news.sky.com/story/attacker-among-around-10-killed-in-shooting-at-adult-education-centre-in-sweden-13302756",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sweden-shooting-school_6819796.jpg?20250204210040",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 06:07:00",
        "Headline": "A major police operation is under way in Orebro, around 200km (125 miles) west of the capital Stockholm. The centre offers primary and upper secondary school courses, as well as Swedish classes for immigrants, vocational training and programmes for people with learning disabilities.",
        "Content": " Swedish police have said 11 people have been killed at an adult education centre, in what the country's prime minister said is the worst mass shooting in Sweden's history. The attack happened at around 12.30pm local time (11.30am UK time) at Campus Risbergska in the town of Orebro, around 200km (125 miles) west of the capital Stockholm. A spokesperson told a news conference on Tuesday evening that police believe the \"primary perpetrator\" is dead and acted alone. They do not expect more attacks, the spokesperson added. Police said they carried out investigations at various addresses in Orebro, with technical personnel working at the scene. Sweden shooting latest: 'Everything points to typical loner attack' \"At present, the police believe that the perpetrator acted alone, but we cannot rule out more perpetrators connected to the incident,\" the update on the Swedish police's website said. Police also said they do not know the motive but do not believe it is terrorism, adding they \"had no warning sign\" about the attack. \n                  Sweden shooting: What we know after 11 people are killed at adult education centre, police say\n                 \n                  Iraqi man who sparked riots with Koran burnings shot dead in Sweden\n                 \n                  New Eurovision rules announced to 'protect' artists after controversies at competition\n                 Officers are working to identify the perpetrator and the victims. The damage at the crime scene was so extensive that investigators were unable to be more definitive on the number killed, said Roberto Eid Forest, head of the local police. \"When it comes to saying anything more about the perpetrator, it is still very early. The operation is ongoing and that will undoubtedly become clearer. But we are working very intensively right now,\" Mr Forest said. He described the attack as a \"horrible\" incident, calling it \"exceptional\" and a \"nightmare\". The suspected gunman had not previously been known to police, Mr Forest said.. Speaking at a press conference this evening, Sweden's prime minister Ulf Kristersson said the tragedy is the worst mass shooting in the country's history. \"Today, we have witnessed brutal, deadly violence against completely innocent people,\" Mr Kristersson told reporters. \"This is the worst mass shooting in Swedish history. Many questions remain unanswered, and I cannot provide those answers either. \"But the time will come when we will know what happened, how it could occur, and what motives may have been behind it. Let us not speculate,\" he said. Meanwhile, the country's king Carl XVI Gustaf said the shooting was a \"terrible atrocity\". \"We send our condolences tonight to the families and friends of the deceased. Our thoughts at this time also go to the injured and their relatives, as well as to others affected. \"My family and I would like to express our great appreciation for the police, rescue and medical personnel who worked intensively to save and protect human lives on this dark day.\" Police earlier urged the public to stay away from the centre as they were searching and evacuating the premises. At least five people were taken to hospital. Four underwent surgery - one is critically injured, two are stable and one is lightly injured, police said at an earlier news conference. Swedish newspaper Dagens Nyheter said police officers had been shot at, but police said no officers had been shot. The centre is for students over the age of 20, according to its website. It offers primary and upper secondary school courses, as well as Swedish classes for immigrants, vocational training and programmes for people with intellectual disabilities. Google Maps shows a number of schools for children in the vicinity. The shooting happened after many students had gone home following a national exam. Students were taking shelter in nearby buildings and other parts of the campus were evacuated. Teacher Lena Warenmark told SVT News that there were unusually few students on the campus on Tuesday afternoon after the exam. She also told the broadcaster that she heard probably 10 gunshots. Andreas Sundling, 28, was among those forced to barricade themselves inside the school. Read more: What we know about Sweden shooting so far \"We heard loud bangs and first we thought people were fighting outside and maybe throwing chairs and tables, [but] then we heard people screaming,\" he told Sky News. \"Then the people in my class realised that something is wrong. We closed all the doors to the classroom and we locked the doors and I barricaded the doors with tables and chairs.\" Mr Sundling said his class hid under the tables and he began thinking about his family, including his two-year-old daughter and six siblings. The student said there was \"blood everywhere on the floor\" inside the school and it was \"crazy\". Swedish newspaper Aftonbladet reported one person trapped in the centre as saying: \"We have heard several shots outside.\" The newspaper also quoted a person who had received a text from a teacher at the centre saying \"there was a shooting with automatic weapons\". It said local emergency and intensive care departments are being made ready for casualties. Fatal attacks at educational establishments in Sweden are rare, with 10 killed in seven incidents between 2010 and 2022, according to the Swedish National Council for Crime Prevention."
    },
    {
        "title": "Family of Sheffield school stabbing victim Harvey Willgoose says they are 'utterly heartbroken'",
        "description": "The family of a 15-year-old boy stabbed to death at a school in Sheffield has paid tribute to their \"beautiful boy\".",
        "url": "https://news.sky.com/story/family-of-sheffield-school-stabbing-victim-harvey-willgoose-says-they-are-utterly-heartbroken-13303127",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harvey-willgoose-sophie-willgoose_6819192.jpg?20250204090820",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 17:47:00",
        "Headline": "A separate tribute from Harvey Willgoose's school, where the stabbing took place, said the community was \"struggling to process what has happened\".",
        "Content": "The family of a 15-year-old boy stabbed to death at a school in Sheffield has paid tribute to their \"beautiful boy\". In a statement released by police, the family of Harvey Willgoose said their lives would \"never be the same again\". \"We are utterly heartbroken at the loss of our beautiful boy, Harvey Goose,\" they said. \"Our lives are devastated and will never be the same again. We have lost a beloved son, brother, grandson, cousin, nephew and most importantly, a best friend to all. \"Harvey will be forever known for being a caring, loving and funny young man. At this difficult time we ask you to please respect our privacy as we grieve as a family.\" The stabbing took place at All Saints Catholic High School at lunchtime on Monday. Police were called to reports of a stabbing and found Harvey with \"serious injuries\". He died a short time after despite the best efforts of medics. A 15-year-old boy has been detained on suspicion of murder and remains in custody. Officers are continuing to support Harvey's family and conduct further enquiries at the school. A statement from All Saints Catholic High School said Harvey was an \"immensely popular young man with his fellow students and teachers alike\" and had \"a smile that would light up the room\". \"We are all struggling to process what has happened and our thoughts and prayers are with Harvey's family and friends at this incredibly difficult time,\" it said. \"It is unimaginable to comprehend what they are going through and whilst there are no words that will take away the pain and grief from Harvey's family and friends, I simply want to express, on behalf of the whole school community, our heartfelt condolences.\" It added that the \"tragic and shocking incident... shakes us to our core\". Read more from Sky News:Around 10 killed in shooting at school in SwedenExperts claim no evidence of murder in Lucy Letby case The school also said it is assisting the police with their investigation. Assistant Chief Constable Lindsey Butterfield said: \"Our thoughts remain with Harvey's family, friends and loved ones, as well as the wider school community as they come to terms with his loss. \"We understand that news of Harvey's death will have caused a considerable amount of shock and upset in the local community, and our officers will remain in the nearby area to offer reassurance to residents.\" However she urged people to \"avoid unhelpful online speculation and identifying anyone who they believe to be involved in this tragic incident\". \"Identifying a suspect can prejudice court proceedings and risks justice not being secured for Harvey and his family,\" she said. \"We will take action against those who pose a risk to judicial proceedings and I want to remind people of their responsibility around what they share and post online and the potential impact it can have on justice.\""
    },
    {
        "title": "'Monster' beat top chef to death and left him to go clubbing, court hears",
        "description": "A self-confessed \"monster\" beat a top chef to death near the Notting Hill Carnival and left him in the street to go clubbing, a court has heard.",
        "url": "https://news.sky.com/story/monster-beat-top-chef-to-death-and-left-him-to-go-clubbing-court-hears-13303102",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-mussie-imnetu-carnival_6670021.jpg?20240829113819",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 17:00:00",
        "Headline": "Omar Wilson, 31, allegedly told a friend \"there's a monster in me, man, and it's just like sometimes it comes out\" after chef Mussie Imnetu was attacked near the Notting Hill Carnival.",
        "Content": "A self-confessed \"monster\" beat a top chef to death near the Notting Hill Carnival and left him in the street to go clubbing, a court has heard. Omar Wilson, 31, punched and kicked Mussie Imnetu, 41, outside Dr Power restaurant in Queensway, west London, on the evening of 26 August last year, the Old Bailey was told. The violent incident was caught on CCTV and began when Wilson approached Mr Imnetu and headbutted him, prosecutor Jacob Hallam KC said. About a minute later, Wilson punched Mr Imnetu five times in the head, causing him to fall to the floor. Wilson continued to punch Mr Imnetu repeatedly as he was on his hands and knees and then kicked him in the head, jurors heard. Mr Hallam said: \"The defendant had, by that point, struck him to his head more than a dozen times. Mr Imnetu had struck the defendant not once.\" After the attack, Wilson allegedly went clubbing in the Ministry of Sound and allegedly told an associate that he \"crossed the line\". \n                  Chelsea striker Sam Kerr 'feared for her life' during taxi journey, court hears\n                 \n                  Chelsea footballer Sam Kerr called Met Police officer 'stupid and white', trial hears\n                 \n                  Two teenage girls on student exchange from Morocco missing in London\n                 In a message, he allegedly said: \"There's a monster in me, man, and it's just like sometimes it comes out. \"And I think I've messed up now, I've messed up, everything's finished.\" Asked how the carnival was going, he replied: \"Can't lie. I did the hands ting [sic] and I think it's a manslaughter,\" jurors heard. Wilson also allegedly dropped his sunglasses and keys at the scene. Mr Imnetu, who worked at The Arts Club, was taken to hospital and died four days later, having never regained consciousness. Following his arrest on 28 August, 2024, Wilson told police he had struck the victim in \"self-defence\". He claimed Mr Imnetu was behaving erratically, harassing girls, and had a bottle. After being shown CCTV of Mr Imnetu being assaulted, Wilson said it \"seems excessive now\" and watching it was \"f*****g disgusting\", jurors were told. Wilson, of Napier Road, Leytonstone, east London, has denied murder. The trial continues."
    },
    {
        "title": "Donald Trump Junior accused of killing protected species of duck on hunt in Venice lagoon",
        "description": "An Italian politician has told Sky News he's filed a criminal complaint after  Donald Trump Junior allegedly killing a protected species of duck while on a hunting trip in the Venice lagoon.",
        "url": "https://news.sky.com/story/donald-trump-junior-accused-of-killing-protected-species-of-duck-on-hunt-in-venice-lagoon-13303311",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ruddy-shelduck-pyin-u-lwin_6819931.jpg?20250205000800",
        "type": "Home",
        "Author": "Simone Baglivo, Italy producer",
        "Date Published": "2025-02-04 23:28:00",
        "Headline": "Dead birds allegedly included a ruddy shelduck, which is protected by the EU Birds Directive and Italian wildlife protection legislation.",
        "Content": "By Simone Baglivo, Italy producer  An Italian politician has told Sky News he's filed a criminal complaint after  Donald Trump Junior allegedly killing a protected species of duck while on a hunting trip in the Venice lagoon. Andrea Zanoni, from the Green Europe party, said he had notified the Carabinieri environmental crime unit in Mestre. He claimed Mr Trump hunted and killed protected species of birds in Campagna Lupia, a town in the province of Venice, last December. \"The US president's son killed a protected species in a protected natural area, and this is a serious criminal offence,\" Mr Zanoni said. \"No one should be above the law.\" Mr Zanoni is currently serving as president of the region of Veneto's justice commission. A spokesman for Mr Trump said his party had permits and were in a legally allowed area. A video posted online and reported by Italian media outlets appears to show Mr Trump Jr shooting at ducks inside a special conservation area south of Venice, and then addressing the camera and pointing to an orange-brown duck among at least six other dead waterfowl around him. The dead birds allegedly included a ruddy shelduck, which is protected by the EU Birds Directive and Italian wildlife protection legislation. In addition, it is thought Mr Trump needed to reside in an Italian region in order to be granted a hunting permit. Veneto imposes a different hunting calendar for each species. Mr Zanoni said he was \"100% sure\" the Venice Public Prosecutor's Office will soon open a probe into the case. If so, it is thought Donald Trump Jr could face both a jail sentence and a fine. A source close to the investigation told Sky News they are \"evaluating\" possible crimes following Mr Zanoni's complaint. Environment Minister Gilberto Pichetto said he was \"waiting for a report\". Sergio Costa, a former Italian environment minister, told Sky News he was \"horrified\" by the case. \"It's as if Italy became Trump Junior's backyard,\" Mr Costa said. \"I'll ask the government to report on this and I'm going to file a complaint with the Public Prosecutor's Office,\" he added. Read more:Donald Trump says Gaza residents should be resettled permanentlyWorst mass shooting in Sweden's history An animal rights NGO, LAV, expressed indignation along with other Italian political parties. Veneto governor Luca Zaia refused to comment on the case. A spokesman for Mr Trump said \"there were countless other hunting groups present\" while the hunting party had permits and were in a legally allowed area. Andy Surabian added: \"While it's unclear whether this single duck was unintentionally shot by someone in Don's hunting group, another hunting group, or killed in a different manner and retrieved by the group's hunting dog, Don takes following all rules, regulations and conservation on his hunts very seriously and plans on fully cooperating with any investigation.\""
    },
    {
        "title": "Things really do seem better in the morning, study suggests",
        "description": "Things, generally, \"do seem better in the morning\" - that is according to scientists who suggest the earlier hours of the day are when most feel at their best.",
        "url": "https://news.sky.com/story/things-really-do-seem-better-in-the-morning-study-suggests-13302975",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-morning-alarm_6819469.jpg?20250204141112",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 23:30:00",
        "Headline": "Research using the University College London (UCL) COVID-19 Social Study found people also generally feel happier in the morning than they do at night..",
        "Content": "Things, generally, \"do seem better in the morning\" - that is according to scientists who suggest the earlier hours of the day are when most feel at their best. Research using the University College London (UCL) COVID-19 Social Study found people also widely feel happier in the summertime than they do during the winter months. Using survey data from 49,218 adults between March 2020 and March 2022, the researchers found people generally woke up \"feeling best\" but were \"feeling worst\" by midnight. Dr Feifei Bu, from UCL's department of behavioural science and health, said: \"Our findings suggest that on average, people's mental health and wellbeing are better in the morning and worst at midnight.\" And writing in the journal BMJ Mental Health, the team added: \"Generally, things do seem better in the morning.\" In the study, people were asked questions like: \"In the past week, how happy did you feel?\", \"How satisfied have you been with your life?\", and \"To what extent have you felt the things you are doing in your life are worthwhile?\" Taking into account factors such as age, health conditions and whether people worked, the results showed that happiness, life satisfaction, and worthwhile ratings were all higher on Mondays and Fridays than on Sundays. Happiness was also higher on Tuesdays, but there was no evidence that loneliness differed across days of the week. The researchers also suggested the changes in mental health and wellbeing across the day could be explained by physiological changes associated with the body clock. \"For example, cortisol [a hormone that regulates mood, motivation and fear] peaks shortly after waking and reaches its lowest levels around bedtime,\" they noted. Read more from Sky News:Men urged to confront mental health problemsNeil Gaiman accused of sexual assault in US civil lawsuits However, the experts noted differences in mood between weekdays and weekends could be driven by things like the changes in daily tasks. Dr Bu added: \"This pattern could reflect when people choose to respond to the survey, rather than a direct effect of time of day. \"For example, those already feeling better in the morning might be more likely to engage with the survey at that time.\" She also said the findings need \"to be replicated in other studies that fully account for this potential bias\", but suggested that if backed by other research, \"this could have important practical implications\". \"Mental health support services might consider adjusting resources to match fluctuating needs across the day - for instance, prioritising late-night availability,\" Dr Bu added."
    },
    {
        "title": "Trump threatens Iran would be 'obliterated' if it assassinates him - as he signs 'tough' directive against Tehran",
        "description": "Donald Trump has reinstated his \"maximum pressure\" campaign on Iran - as he threatened Tehran it would be \"obliterated\" if it assassinates him.",
        "url": "https://news.sky.com/story/trump-threatens-iran-would-be-obliterated-if-it-assassinates-him-as-he-signs-tough-directive-against-tehran-13303201",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-executive-orders_6819773.jpg?20250204204123",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 20:38:00",
        "Headline": "The president has also stopped funding for the UN's relief agency for Gaza as he claims Palestinians have \"no alternative\" but to leave the strip.",
        "Content": " Donald Trump has reinstated his \"maximum pressure\" campaign on Iran - as he threatened Tehran it would be \"obliterated\" if it assassinates him. The US president signed a memorandum on Tuesday in an effort to crack down on Iran's nuclear programme and restrict oil exports - moments before he met Israel's prime minister Benjamin Netanyahu. Mr Trump said he also signed the \"tough\" directive on Iran because Tehran was \"too close\" to having a nuclear weapon.  He added he would hold talks with his counterpart in Tehran, but warned he has left \"instructions\" for his advisers that if Iran assassinated him, the US foe \"would be obliterated\". The US Justice Department announced in federal charges in November that an Iranian plot to kill Mr Trump before the presidential election had been thwarted. The department alleged Iranian officials had instructed Farhad Shakeri, 51, to focus on surveilling and ultimately assassinating Mr Trump. Shakeri is still at large in Iran. It comes as Mr Trump withdrew the US from the UN Human Rights Council in an executive order. \n                  Trump's Gaza solution betrays his ignorance of history - and could make the conflict worse\n                 \n                  Trump maximises leverage over Iran by squeezing where it hurts most\n                 \n                  Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'\n                 The president has also stopped funding of the UN's relief agency for Gaza. The order means Mr Trump has reinstated policies that were in place during his first administration. Joe Biden's administration previously paused funding to the UN Relief and Works Agency for Palestine Refugees (UNRWA) after reports its staff were involved in the 7 October attacks. Mr Trump also claimed that Palestinians have \"no alternative\" but to leave Gaza, but that he doesn't necessarily support Israelis settling in the enclave. International affairs editor Leverage is the most important thing in negotiations, Donald Trump said in his book The Art Of The Deal. \"Don't make deals without it.\" The US president has just maximised his leverage over Iran's government, squeezing it where it hurts most. Oil sales. The move will hurt Iran's economy already in deep trouble and could lead to more social unrest. But the impact does not stop there. The global price of oil has already jumped on the news. Read more here The US president also repeated previous suggestions that he would like to see Jordan and Egypt take Palestinians from Gaza. \"The Gaza thing has never worked,\" Trump told reporters. \"If we could find the right piece of land, pieces of land, and build them some really nice places...I think that would be a lot better than going back to Gaza.\" Read more:What's going on with Trump's tariffs? The Goonies cast reuniteEl Salvador agrees to take criminals from US Egypt and Jordan, as well other Arab nations, have flatly rejected calls by Trump to relocate the territory's population during post-war rebuilding of the territory. The UN estimates that 60% of structures in the enclave have been damaged or destroyed, with almost all of the 2.3 million people in Gaza having been forced to leave their homes during Israel's 15-month war to take shelter elsewhere in the territory. Meanwhile, the president said he thinks he will wind down the US Agency for International Development (USAID), in what would be a dramatic overhaul of how the world's largest single donor allocates foreign assistance. When a reporter said to Trump it sounded like he was going to \"wind down\" the agency, Trump chuckled and said \"I think so.\" Chaos has consumed the agency, which distributes billions of dollars of humanitarian aid around the world, since Trumpordered a freeze on most US foreign aid hours after taking office and tasked billionaire Elon Musk, who has falsely accused USAID of being a \"criminal\" organisation, with scaling down the agency. Mr Trump also said he would like to close the US Department of Education with executive action."
    },
    {
        "title": "The Aga Khan Prince Karim Al-Hussaini, spiritual leader and friend of the late Queen, dies aged 88",
        "description": "Aga Khan IV, the spiritual leader, racehorse owner and friend of Queen Elizabeth II, has died aged 88. ",
        "url": "https://news.sky.com/story/the-aga-khan-prince-karim-al-hussaini-philanthropist-and-friend-of-the-late-queen-dies-aged-88-13303266",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-aga-khan-racing_6819873.jpg?20250204221748",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 21:49:00",
        "Headline": "The Aga Khan was the spiritual leader of about 12 million people from the Ismaili sect of Islam, having inherited his title at the age of 20.",
        "Content": "Aga Khan IV, the spiritual leader, racehorse owner and friend of Queen Elizabeth II, has died aged 88.  Despite spending most of his life out of the limelight, the Aga Khan was the spiritual leader of about 12 million people from the Ismaili sect of Islam. Some of his followers believed he was the direct descendant of the Prophet Mohammed. A notice on the website of the Aga Khan Development Network - the development organisation he founded - announced his death, saying that he \"passed away peacefully in Lisbon on 4 February 2025... surrounded by his family\". It said: \"His Highness Prince Karim Al-Hussaini, Aga Khan IV, 49th hereditary Imam of the Shia Ismaili Muslims and direct descendant of the Prophet Muhammad (peace be upon him), passed away peacefully in Lisbon on 4 February 2025, aged 88, surrounded by his family. \"Prince Karim Aga Khan was the founder and chairman of the Aga Khan Development Network. \"The announcement of his designated successor will follow. \"Leaders and staff of the Aga Khan Development Network offer our condolences to the family of His Highness and to the Ismaili community worldwide. \"As we honour the legacy of our founder, Prince Karim Aga Khan, we continue to work with our partners to improve the quality of life for individuals and communities across the world, as he wished, irrespective of their religious affiliations or origins.\" The Aga Khan, who inherited his title of the 49th Imam of the Shia Imami Ismailis in 1957 at the age of 20, was believed to have been worth over £11bn at the time of his death. He was born in Switzerland and spent much of his later life in France, although he had British citizenship. He was an old friend of the late Queen Elizabeth II, who had bestowed on him the title of His Highness when he became the leader of the Ismaili Muslims. Read more on Sky News:Trump says Iran would be 'obliterated' if it assassinates himFamily 'utterly heartbroken' after fatal school stabbingWorst mass shooting in Sweden's history as around 10 killed Much like the late royal, the Aga Khan was a huge fan of horseracing and owned various horses. These included the famous Shergar, who was stolen by gunmen in Ireland in 1983 and never seen again. He is survived by his children Princess Zahra, Prince Rahim, Prince Hussain and Prince Aly Muhammad, and four grandchildren."
    },
    {
        "title": "Fife nurse who objected to transgender doctor in changing room admits 'harassment'",
        "description": "A nurse who was suspended after complaining about sharing a changing room with a transgender colleague has admitted being guilty of harassment under workplace policies, but denied comparing the doctor to convicted rapist Isla Bryson, an employment tribunal heard.",
        "url": "https://news.sky.com/story/fife-nurse-who-objected-to-transgender-doctor-in-changing-room-admits-harassment-13303082",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-nhs-hospital-changing-room_6819620.jpg?20250204170100",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-02-04 16:21:00",
        "Headline": "An employment tribunal is under way after a nurse lodged a complaint over being suspended for complaining about sharing a changing room with a transgender colleague.",
        "Content": "A nurse who was suspended after complaining about sharing a changing room with a transgender colleague has admitted being guilty of harassment under workplace policies, but denied comparing the doctor to convicted rapist Isla Bryson, an employment tribunal heard. Sandie Peggie was suspended from Victoria Hospital in Kirkcaldy, Fife, in January 2024 after she objected to Dr Beth Upton - a transwoman - using the changing facilities in the A&E department on Christmas Eve 2023. The tribunal in Dundee heard the doctor began working with Ms Peggie in the department in August of that year, before three incidents in the changing room. Ms Peggie told the hearing on Tuesday her issues were not with Dr Upton but with sharing the changing facilities, and she took issue with NHS decision-making. The nurse lodged a complaint of sexual harassment or harassment related to protected beliefs under the Equality Act 2010 regarding the three incidents - indirect harassment; victimisation; and whistleblowing. Ms Peggie said she believed Dr Upton was a man, and admitted she was the only person involved who would have been guilty of committing harassment under a workplace policy. Referring to Dr Upton using male pronouns - after a previous legal battle allowed her to refer to her as a man - Ms Peggie said: \"I didn't want to leave the changing room because of the situation I was in with menstruation. \"I've never been scared of Beth - I was intimidated when he started taking his clothes off and I was in an embarrassing situation. \"He has a male presence and I don't want to be alone with a male taking his clothes off.\" The tribunal heard she initiated a conversation where Dr Upton \"sympathised\" and told her to raise it through the proper channels. 'I don't have a problem with trans people' However, Ms Peggie said: \"I think it was appropriate to call Beth a man. In the situation I was in, he would never be able to understand.\" She added: \"I don't have a problem with trans people and I didn't have a problem with Beth until I found him in the female changing rooms.\" Under questioning from lawyer Jane Russell KC, representing Dr Upton and NHS Fife, Ms Peggie said: \"Most of the staff were aware that I didn't like Beth going into the changing room. \"I don't have a problem with Beth's gender status, the only problem I had was Beth being allowed to be in the changing room.\" Ms Russell said: \"You didn't want Beth to be in there. What you didn't like is that a transwoman had been given permission to be in there.\" Ms Peggie replied: \"My objection was Beth had been allowed by the NHS to come into a female changing area. It's more about the NHS allowing Beth to come into a female area.\" Read more:NHS Fife seeking secret tribunalNurse denies using 'offensive language' 'You compared Beth to Isla Bryson' She told the tribunal when she made a comment about \"a biological man in a women's prison\", she did not know the case involved transgender rapist Isla Bryson, who was jailed for eight years in 2023 for raping two women pre-transition. Scottish Prison Service (SPS) guidance at the time saw Bryson initially housed in segregation at Cornton Vale women's prison near Stirling while awaiting sentencing. Bryson was quickly moved to the male estate following a public outcry, with the scandal engulfing the final weeks of Nicola Sturgeon's premiership as first minister. Ms Russell said: \"You suggested that Beth's presence in a female changing room is akin to a rapist being in a women's prison. It's correct you compared Beth to Isla Bryson, who is a rapist.\" Ms Peggie replied: \"I couldn't remember Isla Bryson's name or the case, but I could remember that a biological man had been imprisoned in a female prison.\" Ms Russell said: \"You compared Beth to a biological man in a women's prison who is also a convicted rapist.\" Ms Peggie replied: \"I knew it was a biological man in a women's prison and there was a disturbance around it. Because biological women are opposed to men being in their spaces.\" 'I've got no homophobic views' The court heard Dr Upton sent an email on Christmas Day, which read: \"I don't feel safe using the changing room when she's there,\" while another doctor said Dr Upton was \"extremely distressed\". Dr Upton lodged a complaint on 30 December, and Ms Peggie was placed on \"special leave\". Ms Russell said: \"You are the only person in this case who is guilty of harassment under the policy.\" Ms Peggie replied: \"Yes.\" The tribunal heard Ms Peggie made a complaint on 15 February claiming it was \"harassment\" that she was put on special leave. The hearing also heard the nurse's \"strong political opinions\" were known, including admiring Donald Trump. Her husband had also posted on Facebook \"mocking\" transgender women; however she insisted neither of them would wish to upset anyone and described it as \"banter\". Ms Peggie said: \"My daughter's gay. I've got no homophobic views.\" The tribunal continues."
    },
    {
        "title": "Lucy Letby: Defence calls for miscarriage of justice investigation as medics give alternative causes of death",
        "description": "A panel of international medical experts has given alternative causes of death in several cases against child serial killer Lucy Letby.",
        "url": "https://news.sky.com/story/lucy-letby-case-expert-panel-disputes-key-prosecution-evidence-over-skin-discolouration-in-some-victims-13302798",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-lucy-letby-court_6726415.jpg?20241024131746",
        "type": "UK",
        "Author": "Samuel Osborne",
        "Date Published": "2025-02-04 08:13:00",
        "Headline": "The panel laid out alternative causes of death in many of the cases, including natural causes and poor medical care.",
        "Content": "\n          News reporter\n              @samuelosborne93\n  A panel of international medical experts has given alternative causes of death in several cases against child serial killer Lucy Letby. It comes as her defence lawyers announced they have asked for her case to be investigated as a miscarriage of justice. Letby, 35, the UK's most prolific child killer of modern times, is serving fifteen whole life terms in prison after she was convicted at Manchester Crown Court of murdering seven infants and attempting to murder seven others between June 2015 and June 2016. Various methods were used to attack the babies while Letby worked as a nurse on the neonatal unit at the Countess of Chester Hospital. One method was air being injected into the bloodstream which caused an air embolism, blocking the bloody supply and leading to sudden and unexpected collapses. On Tuesday, retired neonatologist Dr Shoo Lee, who co-authored an academic paper on air embolisms (bubbles) in babies in 1989 which featured prominently during her trial, chaired a panel of 14 experts to compile an \"impartial evidence-based report\". Dr Lee said he believed his findings on skin mottling were misinterpreted by the prosecution. He said in a new paper he published in December 2024 that there were no cases of skin discolouration when air was injected into the veins. At her trial in 2023, prosecutors pointed to skin discolouration in several of the victims as evidence that air had been injected into their veins by Letby. \"The notion that these cases are air embolism because they collapsed and because there were skin rashes has no basis in evidence. Let's be clear about that,\" Dr Lee said. Lucy Letby latest: Experts reveal 'new medical evidence' questioning nurse's guilt The panel laid out alternative causes of death in many of the cases, including natural causes and poor medical care at Countess of Chester Hospital. \"We did not find any murders,\" Dr Lee said. \"In all cases, death or injury were due to natural causes or just bad medical care.\" Asked about the Countess of Chester Hospital, Dr Lee, a retired medic from Canada, said: \"I would say if this was a hospital in Canada, it would be shut down. It would not be happening.\" A spokesperson at the Countess of Chester Hospital NHS Foundation Trust said: \"Due to the Thirlwall Inquiry and the ongoing police investigations, it would not be appropriate to comment further at this time.\" The Criminal Cases Review Commission (CCRC) will now review all the evidence after an application from the defence to determine if the case should be referred back to the courts. A CCRC spokesperson said: \"We are aware that there has been a great deal of speculation and commentary surrounding Lucy Letby's case, much of it from parties with only a partial view of the evidence. \"We ask that everyone remembers the families affected by events at the Countess of Chester Hospital between June 2015 and June 2016. \"We have received a preliminary application in relation to Ms Letby's case, and work has begun to assess the application.\" Opening the press conference, MP Sir David Davis described Letby's convictions as \"one of the major injustices of modern times\". Health correspondent This must have been one of the most distressing mornings for the grieving parents of the babies who died in Chester. A 10-month trial concluded their new borns were murdered by Lucy Letby. Now they have been presented with a body of evidence gathered by some of the world's leading neonatal experts that could and probably will put some doubt against her conviction. Every single baby's death has been forensically analysed: the allegations presented in court with the circumstances of each death against what the panel claims are the clinical facts in the case. Dr Shoo Lee, the panel chair, approached Letby's lawyers following her conviction in 2023. He was convinced his 1989 paper on neonatal deaths used as evidence in the case against Letby had been misinterpreted. The team he has assembled to examine each death is a world leader in their own respective field. For parents learning today these experts believe some of the baby deaths were preventable and not the result of a serial killer nurse will come as nothing less than earth-shattering.  This expert panel review of each case, if true, could point to yet another systemic failure of NHS maternity care. But now it will be for the Criminal Cases Review Commission to decide if Letby's case is investigated as a potential miscarriage of justice. Last year Letby lost two bids to challenge her convictions at the Court of Appeal - in May for seven murders and seven attempted murders, and in October for the attempted murder of a baby girl, which she was convicted of by a different jury at a retrial. In December, the former nurse's barrister, Mark McDonald, said he would seek permission from the Court of Appeal to re-open her case on the grounds Dr Dewi Evans, the lead prosecution medical expert at her trial, was \"not reliable\". Dr Evans, a retired consultant paediatrician, said concerns regarding his evidence were \"unsubstantiated, unfounded, inaccurate\". In September a public inquiry into how Letby was able to commit her crimes began hearing evidence. Closing legal submissions are expected in March and the findings are expected to be published this autumn. Detectives from Cheshire Constabulary are also continuing their review of the care of some 4,000 babies admitted to the Countess of Chester Hospital from January 2012 to the end of June 2016, while Letby worked as a neonatal nurse, there. It also includes two work placements at Liverpool Women's Hospital in 2012 and 2015. Letby has been interviewed under caution at HMP Bronzefield in Ashford, Surrey, in relation to the ongoing investigation into baby deaths and non-fatal collapses. She maintains her innocence."
    },
    {
        "title": "Family of Sheffield school stabbing victim Harvey Willgoose says they are 'utterly heartbroken'",
        "description": "The family of a 15-year-old boy stabbed to death at a school in Sheffield has paid tribute to their \"beautiful boy\".",
        "url": "https://news.sky.com/story/family-of-sheffield-school-stabbing-victim-harvey-willgoose-says-they-are-utterly-heartbroken-13303127",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harvey-willgoose-sophie-willgoose_6819192.jpg?20250204090820",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-04 17:47:00",
        "Headline": "A separate tribute from Harvey Willgoose's school, where the stabbing took place, said the community was \"struggling to process what has happened\".",
        "Content": "The family of a 15-year-old boy stabbed to death at a school in Sheffield has paid tribute to their \"beautiful boy\". In a statement released by police, the family of Harvey Willgoose said their lives would \"never be the same again\". \"We are utterly heartbroken at the loss of our beautiful boy, Harvey Goose,\" they said. \"Our lives are devastated and will never be the same again. We have lost a beloved son, brother, grandson, cousin, nephew and most importantly, a best friend to all. \"Harvey will be forever known for being a caring, loving and funny young man. At this difficult time we ask you to please respect our privacy as we grieve as a family.\" The stabbing took place at All Saints Catholic High School at lunchtime on Monday. Police were called to reports of a stabbing and found Harvey with \"serious injuries\". He died a short time after despite the best efforts of medics. A 15-year-old boy has been detained on suspicion of murder and remains in custody. Officers are continuing to support Harvey's family and conduct further enquiries at the school. A statement from All Saints Catholic High School said Harvey was an \"immensely popular young man with his fellow students and teachers alike\" and had \"a smile that would light up the room\". \"We are all struggling to process what has happened and our thoughts and prayers are with Harvey's family and friends at this incredibly difficult time,\" it said. \"It is unimaginable to comprehend what they are going through and whilst there are no words that will take away the pain and grief from Harvey's family and friends, I simply want to express, on behalf of the whole school community, our heartfelt condolences.\" It added that the \"tragic and shocking incident... shakes us to our core\". Read more from Sky News:Around 10 killed in shooting at school in SwedenExperts claim no evidence of murder in Lucy Letby case The school also said it is assisting the police with their investigation. Assistant Chief Constable Lindsey Butterfield said: \"Our thoughts remain with Harvey's family, friends and loved ones, as well as the wider school community as they come to terms with his loss. \"We understand that news of Harvey's death will have caused a considerable amount of shock and upset in the local community, and our officers will remain in the nearby area to offer reassurance to residents.\" However she urged people to \"avoid unhelpful online speculation and identifying anyone who they believe to be involved in this tragic incident\". \"Identifying a suspect can prejudice court proceedings and risks justice not being secured for Harvey and his family,\" she said. \"We will take action against those who pose a risk to judicial proceedings and I want to remind people of their responsibility around what they share and post online and the potential impact it can have on justice.\""
    },
    {
        "title": "Harvey Willgoose: Community in shock over teen's school stabbing death",
        "description": "At the gates of All Saints Catholic High School in Sheffield, the tributes to Harvey Willgoose continue to arrive.",
        "url": "https://news.sky.com/story/harvey-willgoose-tributes-left-at-school-where-teen-was-stabbed-to-death-13303010",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-tributes-sheffield_6819213.jpg?20250204095201",
        "type": "UK",
        "Author": "Greg Milam",
        "Date Published": "2025-02-04 14:28:00",
        "Headline": "Harvey Willgoose was stabbed around midday on Monday at All Saints Catholic High School in Sheffield.",
        "Content": "\n          Chief North of England correspondent\n              @GregMilamSky\n At the gates of All Saints Catholic High School in Sheffield, the tributes to Harvey Willgoose continue to arrive. Flowers bearing notes from friends and former teachers, balloons and cards, one woman even arrived with a shirt of his beloved Sheffield United. The school remains closed but some youngsters were allowed through the locked gates by police to lay flowers at a small garden bed outside the main entrance. Those coming to lay flowers all spoke of their shock at Harvey's death. Luisa Meco's daughter knew Harvey from when they were both in nursery school and also attended All Saints. She said: \"It's just shocking, really sad, heartbreaking.\" Her thoughts were with Harvey's family. She said: \"Obviously we're all putting ourselves in their shoes and thinking 'What on earth?'. It is hard to describe, it is just unreal.\" Luisa was also concerned with how her daughter would feel returning to school when it reopens. \"I will wait and see what she says and if she's not comfortable, I will just have to keep her off for a couple of days,\" she said. She added: \"It's not something that's easy to get over, it's not an easy thing even as an adult to understand, how it could happen at school, so for 14 and 15-year-olds it's even harder.\" Flowers have also been placed at the Bramall Lane home of Sheffield United. The club said it was aware discussions were taking place about how best to pay tribute to Harvey. A line of flowers had also appeared outside Harvey's family home, on a quiet housing estate five miles from All Saints. Not far from the home, a family friend, who saw Harvey on his way to school on the tram on Monday morning, said she was \"in shock\" at the death of a boy she considered to be \"like a brother\" to her. The 17-year-old told Sky News that Harvey was \"funny, he's cheeky, he's caring, just a lovely boy, he'd never hurt anyone. He's never been nasty, he's just not a nasty person at all\". The girl and Harvey's family went on numerous holidays together. Read more from Sky News:Southport killer refuses to leave cell for hearingActor and comedian Brian Murphy diesInside UK care homes \"We're just so close. I can't believe he has gone,\" she said. At the gates of All Saints, some families came to look at the tributes and reflect. Brenda Bartholomew's granddaughter witnessed the incident on Monday lunchtime. \"This should just not be happening,\" she said."
    },
    {
        "title": "Actor and comedian Brian Murphy dies aged 92",
        "description": "Actor and comedian Brian Murphy has died aged 92.",
        "url": "https://news.sky.com/story/actor-and-comedian-brian-murphy-dies-aged-92-13302770",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-george-and-mildred_6819109.jpg?20250204073329",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-04 07:05:00",
        "Headline": "Brian Murphy was best known for his role in the 1970s sitcoms Man About The House and George And Mildred.",
        "Content": "Actor and comedian Brian Murphy has died aged 92. He was known for his role in the 1970s sitcoms Man About The House and George And Mildred. News of his passing was shared by his wife Hi-de-Hi! actress Linda Regan. Posting a picture of her kissing her husband, she said: \"My love for you will never die. RIP sweetheart.\" He died on Sunday morning at his home in Kent, with his wife of 35 years by his side. In a statement, she said: \"I was lucky to have in my lifetime found my soulmate. Brian who I will love forever!\" Agent and friend Thomas Bowington described Murphy as a \"truly joyful and profoundly good-hearted man\". Murphy first came to prominence playing landlord George Roper in Man About The House, starring alongside the late Yootha Joyce. The show began in 1973 and was considered controversial for the time because it featured two single women living with a man. When it ended in 1976, Murphy and Joyce starred in the spin-off, George And Mildred, which ran for five series until 1979. He also starred as Alvin Smedley in Last Of The Summer Wine. Read more from Sky News:Bereaved parents demand tougher laws on unlicensed drivingSheffield school stabbing victim named Born on the Isle of Wight, Murphy was a member of the Theatre Workshop, founded by Joan Littlewood, and was a jobbing actor before appearing in TV shows including Z-Cars. In 1993, he starred in the first major stage version of the HG Wells science fiction classic The Invisible Man. More recently, Murphy appeared in TV shows including the BBC's Holby City and ITV's Benidorm. He is survived by his wife and two sons."
    },
    {
        "title": "Brother and sister killed in hit-and-run believed to have been riding e-scooter",
        "description": "A teenage boy and his nine-year-old sister were riding an e-scooter when they were killed in a hit-and-run crash in Essex, police said.",
        "url": "https://news.sky.com/story/brother-and-sister-killed-in-essex-hit-and-run-believed-to-have-been-riding-e-scooter-13302768",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-roman-darcie_6819183.jpg?20250204085303",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-04 08:22:00",
        "Headline": "A man and woman were arrested on suspicion of causing death by careless driving and failing to stop at the scene after the crash in Pitsea.",
        "Content": "A teenage boy and his nine-year-old sister were riding an e-scooter when they were killed in a hit-and-run crash in Essex, police said. Roman, 16, and Darcie Casselden were struck by a car in Ashlyns, Pitsea, at around 6.25pm on Saturday and the vehicle failed to stop at the scene. The children died despite the efforts of emergency services to help them, Essex Police said. Their mum has paid tribute to them in a statement and officers have now revealed they believe the children were riding a privately-owned e-scooter when they were struck. 'Our beautiful angels' Mum Emma said Roman had a \"heart of gold\" and his \"warmth and generosity touched so many lives\". She added: \"His legacy is one of selflessness, compassion, and an unwavering belief in the goodness of people.\" She said Darcie was a \"soul filled with creativity and beauty\" and was a \"wonderful individual who brought joy and inspiration to those lucky enough to know her\". The tribute went on: \"Though they are no longer here in person, their love, kindness, and spirit live on in the hearts of all who knew them. Their impact will never fade, and their memory will forever be cherished. \"Rest in peace, our beautiful angels, Roman and Darcie. \"You were loved beyond words and will be missed beyond measure. \"From everyone including your siblings Madison and Harrison.\" Two arrested A man and a woman were arrested on suspicion of causing death by careless driving and failing to stop at the scene of a collision. The woman has been bailed while the man has been released under investigation. Read more from Sky News:Tougher rules on weight loss jabsInside UK care homes: Maggots, bruises and neglect Chief Superintendent Leighton Hammett said: \"This has been a hugely emotive incident and I know the family, and wider community, want to know what happened. \"We are making good progress in our investigation which is focusing on a number of factors. \"I know there has been a lot of commentary online about the incident but I would ask that people please do not speculate. \"We will investigate and we will get the answers.\" 'Their loss will be felt by many' The school which Darcie attended, and where Roman was a former pupil, paid tribute to the children this morning. Briscoe Primary School in Basildon, Essex, said in a statement: \"We are deeply saddened regarding the news of the sudden death of one of our pupils, Darcie, and her brother Roman (who also attended our school up to the 24th July 2019). During this time of immeasurable loss, our thoughts and sympathies are with Darcie and Roman's family, friends and to all those who knew them both. \"Darcie and Roman were both beloved children and members of our school community. We know their loss will be felt by many and we will continue to support friends, family and the wider staff and locality.\" A GoFundMe page set up to raise money for funeral costs and to support the children's family during their ordeal had raised nearly £30,000 as of 9am on Tuesday. It comes after around 20 members of the local community, including children, gathered together on Sunday and left tributes, including flowers, at the junction between Ashlyns and Walthams. A card that appears to have been left by a teacher - alongside a bunch of flowers - paid tribute to Roman. It described him as \"such a good kid\" and a \"joy to teach in PE\". Another card, left by a member of staff at a school, read: \"I'm so sorry that you have both been taken away, far too young. \"My thoughts and prayers are with everyone that had the joy to know you both, especially your family.\" Police are appealing for any witnesses or anyone with CCTV, dash cam or doorbell footage to contact them."
    },
    {
        "title": "'Hardest Geezer' Russ Cook to run full length of New Zealand",
        "description": "Russ Cook, the \"Hardest Geezer\" who ran the length of Africa, is set to start a new long-distance running challenge.",
        "url": "https://news.sky.com/story/hardest-geezer-russ-cook-to-run-full-length-of-new-zealand-13302916",
        "image_url": "https://e3.365dm.com/24/04/1920x1080/skynews-hardest-geezer-tunisia_6513800.png?20240407165537",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-04 11:52:00",
        "Headline": "The runner from Worthing, West Sussex, finished a 16,000km journey from South Africa to Tunisia in April last year. His latest challenge will see him run 3,000km, but with 30,000ft of elevation gain - the equivalent of 10 Mount Everests.",
        "Content": " Russ Cook, the \"Hardest Geezer\" who ran the length of Africa, is set to start a new long-distance running challenge. The fundraising runner, from Worthing, West Sussex, finished a 16,000km (9,941 miles) journey from the southernmost point of the continent - Cape Agulhas in South Africa - to Ras Angela, Tunisia in April last year. Speaking to Kay Burley and Rob Harris on Sky News Breakfast, Cook said he will now run 3,000km (1,864 miles) and navigate mountainous terrain on the Te Araroa trail across New Zealand. \"We got about 30,000ft of elevation gain, [like] 60 back-to-back marathons,\" he said. \"I'm really excited to go out there and explore the country and get after it.\"  The 27-year-old will kick off his latest challenge in March from Stirling Point in Bluff, located at the southern tip of the South Island. With the finish line at Cape Reinga in Northland at the top of the North Island, Cook must navigate diverse terrain including mountains, native forests, cities and coastlines. \"It's been a little while now since Africa, so the cogs are turning again and we're back out there for another landmass,\" he added. \"New Zealand, I couldn't think of a better place to go... obviously, we banked up quite a lot of mileage in Africa, so the legs are well accustomed to that now.\" 'Thought I was going to die' Cook also told Sky News about a moment during his Africa run when he was held hostage in the Democratic Republic of Congo. He said he was \"separated from my sports team and then ended up on the back of a motorbike for seven hours\" while running through the country - one of 16 he crossed during the ultra-marathon. \"We got driven into this little village... I thought I was going to die, it's actually quite dramatic. We made contact with my team, and they got a rescue mission together, took about two days. \"And then we squared some money and it was all alright in the end. Lucky one, it really changed the way I thought about a lot of things.\"  'Ten Mount Everests' The runner - also known as Hardest Geezer - added \"there's a lot of things with this one that I'm not quite sure how it's going to go\" - pointing to the elevation he'll be running in New Zealand. \"We're looking at about 10 Mount Everests in 10 weeks of elevation gain,\" Cook said. \"So you're just going to be scaling mountains. We've also got to go through rivers, forests, the trail - it is really diverse.\" This time, Cook and his team will stop along the way to talk with people, with the runner saying: \"It was one of the things I really like in Africa, getting to dive into a lot of the culture and learn about a lot of different people in a lot of different places. \"So with New Zealand, we're going to really make an effort, stop and do that a little bit more this time, and get to learn about the Maori people and the indigenous culture.\" Read more:Africa run contested by man who did it 14 years agoRuss Cook's inspiring message as he completed epic run Cook has partnered with 100% Pure New Zealand, a campaign by Tourism New Zealand promoting the country, for this long-distance run. Along with his 3,000km run, he will also go bungee jumping off the Auckland Harbour Bridge, skydiving above Abel Tasman National Park and swing across a canyon in Queenstown. Rene de Monchy, chief executive at 100% Pure New Zealand, said: \"We're delighted to be working with Russ on his next incredible mission, and excited to help guide him through the wealth of landscapes, coasts, culture and cuisine the country has to offer all year round. \"Russ's determination, sense of adventure and kindness towards others truly reflect the values of our nation.\""
    },
    {
        "title": "Things really do seem better in the morning, study suggests",
        "description": "Things, generally, \"do seem better in the morning\" - that is according to scientists who suggest the earlier hours of the day are when most feel at their best.",
        "url": "https://news.sky.com/story/things-really-do-seem-better-in-the-morning-study-suggests-13302975",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-morning-alarm_6819469.jpg?20250204141112",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-04 23:30:00",
        "Headline": "Research using the University College London (UCL) COVID-19 Social Study found people also generally feel happier in the morning than they do at night..",
        "Content": "Things, generally, \"do seem better in the morning\" - that is according to scientists who suggest the earlier hours of the day are when most feel at their best. Research using the University College London (UCL) COVID-19 Social Study found people also widely feel happier in the summertime than they do during the winter months. Using survey data from 49,218 adults between March 2020 and March 2022, the researchers found people generally woke up \"feeling best\" but were \"feeling worst\" by midnight. Dr Feifei Bu, from UCL's department of behavioural science and health, said: \"Our findings suggest that on average, people's mental health and wellbeing are better in the morning and worst at midnight.\" And writing in the journal BMJ Mental Health, the team added: \"Generally, things do seem better in the morning.\" In the study, people were asked questions like: \"In the past week, how happy did you feel?\", \"How satisfied have you been with your life?\", and \"To what extent have you felt the things you are doing in your life are worthwhile?\" Taking into account factors such as age, health conditions and whether people worked, the results showed that happiness, life satisfaction, and worthwhile ratings were all higher on Mondays and Fridays than on Sundays. Happiness was also higher on Tuesdays, but there was no evidence that loneliness differed across days of the week. The researchers also suggested the changes in mental health and wellbeing across the day could be explained by physiological changes associated with the body clock. \"For example, cortisol [a hormone that regulates mood, motivation and fear] peaks shortly after waking and reaches its lowest levels around bedtime,\" they noted. Read more from Sky News:Men urged to confront mental health problemsNeil Gaiman accused of sexual assault in US civil lawsuits However, the experts noted differences in mood between weekdays and weekends could be driven by things like the changes in daily tasks. Dr Bu added: \"This pattern could reflect when people choose to respond to the survey, rather than a direct effect of time of day. \"For example, those already feeling better in the morning might be more likely to engage with the survey at that time.\" She also said the findings need \"to be replicated in other studies that fully account for this potential bias\", but suggested that if backed by other research, \"this could have important practical implications\". \"Mental health support services might consider adjusting resources to match fluctuating needs across the day - for instance, prioritising late-night availability,\" Dr Bu added."
    },
    {
        "title": "Britain could do slimmed down trade deal with US within months, says former minister",
        "description": "Britain could do a slimmed down trade deal with the United States within months, the last politician to oversee negotiations with Donald Trump's administration over a UK-US agreement has told Sky News.",
        "url": "https://news.sky.com/story/britain-could-do-slimmed-down-trade-deal-with-us-within-months-says-former-minister-13303143",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-white-house_6815997.jpg?20250131230434",
        "type": "UK",
        "Author": "Sam Coates",
        "Date Published": "2025-02-04 18:12:00",
        "Headline": "Britain was negotiating a full Free Trade Agreement with Mr Trump during his first presidency, but this was junked by his successor President Biden.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Britain could do a slimmed down trade deal with the United States within months, the last politician to oversee negotiations with Donald Trump's administration over a UK-US agreement has told Sky News. Last night Sky News revealed that leading members of the Trump administration believe a trade deal with the UK could be sealed in a matter of months. Mr Trump has singled out Keir Starmer for praise and suggested that he wanted to change UK trade policy. Politics latest: Billions to be spent to increase state pension Britain was negotiating a full Free Trade Agreement with Mr Trump during his first presidency, but this was junked by his successor President Biden. The negotiations were overseen by then Tory trade secretary, Anne-Marie Trevelyan, who told Sky News that a deal could even be struck with the US before the EU-UK Trade and Cooperation Agreement is concluded. Ms Trevelyan said about half the work on a deal had already been concluded under the Boris Johnson administration. \n                  Politics latest: Billions to be spent to increase state pension - as PM warned against major Trump trade deal\n                 \n                  Tougher laws on unlicensed drivers to be considered after Sky News report\n                 \n                  Labour MPs set up new group to focus on threat of Reform UK\n                 \"I was the trade secretary just at the end of the first Trump administration, and we had already, been moving discussions, probably about halfway there. In terms of the trade negotiations.\" She said that the US can work faster than the EU on trade negotiations, and that might be concluded first. \"I think absolutely that's possible. I think the challenge with anything with the EU is you're dealing with, you know, multiple countries who all have to agree. And the challenge with any trade deal, which is why TCA took a long time to negotiate to the level that we got, is that everyone's pulling a little bit differently.\" On President Trump's style, she said: \"I think, realistically, because of the way Trump works, which is transactional but very determined, he'll take decisions, big decisions.\" The negotiation between the UK and the US began in May 2020 when Liz Truss was trade secretary and lasted until the end of Mr Trump's time in office in January 2021. Ms Trevelyan was trade secretary from September 2021 to September 2022. Up to five chapters - areas of trade negotiation - had been completed but the most difficult, agriculture and trade, had not been sorted. The United States has different food standards to the UK and EU, and is not currently able to sell into our market - which has previously been a big ask. Trump latest: EU would respond 'within an hour' to Trump tariffs However Ms Trevelyan said that omitting agriculture from the deal could get it over the line, providing there were sufficient other wins for the US. She said that the UK and US trade deal could make a big difference. \"A UK-US trade move will be a big, punchy, broad ranging trade deal,\" she said. 👉Listen to Politics At Jack And Sam's on your podcast app👈 \"I think what's important is what are we good at? What's the UK good at? What do we want to be able to do more? Our financial services, second only in the world to the US, are fantastic. \"(You look for) lots of things where we don't crash into each other. Really important for success in a trade deal is where you get that complementarity. \"What is it that the US has that they want to sell to us that, you know, isn't of concern to us? So some of the conversations with California around some of their nuts and properties like that, there's all sorts of different pulls and pushes that you work together as a whole.\" She went on: \"It'll be everything from financial services through to whisky and everything in between. The market is enormous, important issues around metals, steel and aluminium are really important ones. So, we had got caught, when I had just come into post, actually an EU tariff last time round that President Trump was putting tariffs on people around steel aluminium.\" But Lord Kim Darroch, the UK's ambassador to the US during Donald Trump's first presidency, said he was sceptical about a UK-US trade deal. Speaking to Sophy Ridge on the Politics Hub, Lord Darroch said the UK's problems stem from the fact that food and agriculture standards are higher here than they are in the US. He explained that there are \"two big regulatory schemes\" in the world, one being the EU's and the other being America's. \"At the moment, we are still basically aligned with the EU,\" he said. \"One of the objectives of the Americans would be to pull us into their regulatory system,\" he adds, and - given we do more far more trade with Europe than America - \"I don't see that being in the national interest.\""
    },
    {
        "title": "Labour MPs set up new group to focus on threat of Reform UK",
        "description": "Labour MPs have set up a new pressure group to focus on the threat of Reform UK's rising popularity.",
        "url": "https://news.sky.com/story/labour-mps-set-up-new-group-to-focus-on-threat-of-reform-uk-13303209",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nigel-farage-kemi-badenoch_6815940.jpg?20250203173612",
        "type": "UK",
        "Author": "Faye Brown",
        "Date Published": "2025-02-04 20:49:00",
        "Headline": "News of the group comes after a YouGov surfor Sky News put Nigel Farage's party ahead of Labour in the polls for the first time. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Labour MPs have set up a new pressure group to focus on the threat of Reform UK's rising popularity. The informal cohort is drawn from the 89 constituencies where Nigel Farage's party came second to Labour at the July General Election. Politics latest: Billions to be spent to increase state pension One of the MP's involved told Sky News it is an \"important signal of where things are headed\" and the members will shout about the need to do more on migration and for tangible local delivery. \"We're a fearless bunch,\" the MP said, adding the group were not afraid to \"call a spade a spade\". Some Labour MPs are worried about the government's communication strategy and fear positive things ministers are doing - like nationalising the railways and the new deal for working people - are not cutting through. The group is expected to focus on working together to get on top of Reform's threat rather than express active unhappiness with Sir Keir Starmer. \n                  Reform UK tops landmark poll for first time\n                 \n                  Nigel Farage compares Reform polling with Donald Trump election victory\n                 \n                  Could we be about to witness a seismic political shift in Wales? \n                 According to The Guardian, Downing Street has dispatched data and strategy experts to advise MPs on the sort of messages that are resonating with Reform-minded voters. A Labour Party source said: \"Groups of MPs meet all the time about lots of different issues. \"Labour MPs are rightly concerned about Nigel Farage's plans to make people pay to access NHS services and will carry on taking the fight to them and other opposition parties in parliament and at the ballot box.\" Mr Farage said recently that he is \"open to anything\" when it comes to the NHS and he is interested in the model of the French healthcare system \"where you pay in to effectively an insurance scheme\". Many Labour MPs, including health secretary Wes Streeting, have seized on the comments to draw dividing lines between Labour and Reform. While Reform's rise hit the Tories the most at the last general election, multiple polls suggest there is now a real threat to Sir Keir Starmer, despite his landslide victory just six months ago. Read More:Millions face council tax rise of more than 5% Starmer says it's 'early days' after Trump tariff threat A YouGov poll for Sky News on Monday showed Reform UK in the lead for the first time on 25%, with Labour pushed into second on 24% and the Tories on 21%. Pollsters stressed Reform's lead was \"within the margin of error\". However it comes after multiple other polls suggested Mr Farage's favourability rating is on the rise while Sir Keir Starmer's has plummeted. Many experts see change as the result of a collapse in the belief that the mainstream political parties can improve the lives of ordinary people. The first major test for Reform will come at the local elections in May, while the party is also hoping to make gains at the Welsh parliament elections next year. "
    },
    {
        "title": "Money Problem: 'My boss is taking a cut of our tips because they worked on the shift - is this legal?'",
        "description": "Every week in our Money blog, we answer questions about your financial problems or consumer disputes. This week, a reader asked if their boss was allowed to take a cut of their tips. ",
        "url": "https://news.sky.com/story/my-boss-is-taking-a-cut-of-our-tips-because-they-worked-on-the-shift-is-this-legal-13303071",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-money-blog-tips_6819097.jpg?20250204065620",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-02-04 15:38:00",
        "Headline": "A reader called Elliott got in touch with our Money team after his boss took a cut of the tips earned by staff on a shift. We talk him through what the law says about this. ",
        "Content": "Every week in our Money blog, we answer questions about your financial problems or consumer disputes. This week, a reader asked if their boss was allowed to take a cut of their tips.  Elliott asked: \"Can my boss take a cut of the tips that are shared between the staff if the boss works the shift?\" We spoke to Caroline Walker, managing director at Cavendish Employment Law, to get her thoughts. First, it's not quite clear if the boss in question is the owner of the company or an employee themselves. Caroline says if the manager is an employee and was part of service on a particular shift, it would be reasonable for the tips to be shared with them. But she adds that if they took tips not related to their service, or against the specific policy of the business, there would be grounds to raise a formal grievance. Caroline breaks down here what UK employment law says about this topic:  \n                  Trump latest: President says he wants US to take ownership of Gaza so he can level it for 'jobs and housing'\n                 \n                  Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation\n                 \n                  Britain could do slimmed down trade deal with US within months, says former minister\n                 \"Under the Employment (Allocation of Tips) Act 2023 that came in on 1 October, employers have to pass on tips to workers. This legislation prevents employers from keeping any part of the tips for their costs and aims to ensure hospitality workers receive 100% of tips, gratuities and service charges,\" she says. \"Prior to this legislation, employers could take 20-30% to cover their costs of the business, including tax, breakages or even staff parties. They also had no rules on when the payments had to be made or any obligation to be transparent over the calculation of the payments.\" Caroline describes the new legislation as a \"welcome change\". The legislation specifically says that, as of the start of October, the employer has to ensure: If the employer fails to provide these records, the workers can bring claims in the employment tribunal, Caroline says.  \"If the reader believes the employer has previously failed to account for their tips, or particularly if they have failed to comply with these obligations since 1 October, they should submit a formal grievance to the employer setting out their concerns, which the employer will be obliged to investigate and respond to,\" she says. Read more from this series:'My workplace is bringing in new clock-in system to pay us by the minute''I waited months for a delivery - then they said I needed to pay another £49 to get it''Should I top up my national insurance?' \"If their response is either not forthcoming, or confirms they have breached these obligations, they will be able to present a claim in the employment tribunal. \"By submitting the formal grievance, the reader will be able to establish whether any tips have been retained and they can include a request for the written confirmation referred to above. \"It is possible, particularly if this is a small employer, that they may not be aware of their obligations and this will provide them with an opportunity to become aware of these obligations.\" This feature is not intended as financial advice - the aim is to give an overview of the things you should think about. Submit your dilemma or consumer dispute via:"
    },
    {
        "title": "Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'",
        "description": "The US will take over Gaza and \"own it\", Donald Trump has said.\n",
        "url": "https://news.sky.com/story/donald-trump-says-gaza-residents-should-be-resettled-or-they-will-end-up-dying-13303161",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-palestinians-nuseirat_6809287.jpg?20250124140119",
        "type": "World",
        "Author": "Andy Hayes and Claire Gilbody Dickerson, news reporters",
        "Date Published": "2025-02-04 19:02:00",
        "Headline": "Donald Trump described Gaza as \"hell\" and \"one of the meanest, toughest places on earth\" as Benjamin Netanyahu visited him at the White House. ",
        "Content": "By Andy Hayes and Claire Gilbody Dickerson, news reporters   The US will take over Gaza and \"own it\", Donald Trump has said.\n Speaking alongside Israeli Prime Minister Benjamin Netanyahu at the White House, he said the two million Palestinian people living in the territory, which he described as a \"demolition site\", would go to \"various domains\". Asked about deploying US troops to fill a potential security vacuum, the president replied: \"We'll do what is necessary.\" Expanding on plans for the territory, he said the US would \"develop it, create thousands and thousands of jobs\" and turn it into \"something the entire Middle East can be very proud of\". The president reiterated his suggestion from 25 January that Palestinians could be relocated to Egypt and Jordan - something both countries, other Arab nations including Saudi Arabia, and Palestinian leaders, have rejected. Palestinians in Gaza could go to countries beyond Jordan and Egypt too, he said. Asked whether he thought Egypt and Jordan would accept Palestinians, he said he believed they would. But, he added: \"I hope we could do something where they wouldn't want to go back. Who would want to go back? \"They've experienced nothing but death and destruction.\" However, Saudi Arabia immediately responded, stressing its rejection of attempts to displace Palestinians from Gaza, and insisted it would not establish relations with Israel without a Palestinian state. Asked on what authority the US could take control of Gaza, Mr Trump told reporters he sees a \"long term ownership position\" which would, he claimed, bring stability to that part of the Middle East. \"This was not a decision made lightly,\" he said. \"Everybody I've spoken to loves the idea of the United States owning that piece of land, developing and creating thousands of jobs.\" It would be the \"Riviera of the Middle East\". He continued: \"I've studied it. I've studied this very closely over a lot of months, and I've seen it from every different angle.\" He does not believe Palestinians should return to Gaza because it is a \"guarantee that they're going to end up dying\". He talked about finding a \"beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what's happening in Gaza\".  Read more from Sky News: 'Hardest Geezer' to run full length of New ZealandWhy China has not retaliated more in Donald Trump trade spat The war, triggered by Hamas carrying out a massacre of 1,200 people and taking 250 others hostage during the 7 October 2023 attacks in Israel, has temporarily stopped since the long-sought ceasefire deal came into effect on 19 January. More than 47,000 Palestinians have been killed in Gaza since Hamas's attack, according to local authorities. Mr Netanyahu, the first world leader to meet Mr Trump since the pro-Israel president's return to the White House, sat beside the Republican as he answered questions from the press. US correspondent If President Trump is to be taken at face value then he is set to repeat history. It would end the prospect of a two-state solution - Israelis and Palestinians living side by side on the same land. It could also wreck any prospects of diplomatic normalisation between Israel and Gulf Arab states.  Nations like Saudi Arabia wouldn't stand for such a permanent resettlement and probably wouldn't trust any resettlement presented as 'temporary' - which this is conspicuously not. The two countries being told to take the people of Gaza - Egypt and Jordan - have firmly refused to do so. The American president seems convinced they will roll over. Maybe though this is part of Trump's art of the deal: to suggest something, then not follow through - and present that as a concession down the line. There’s something else too. Even if Israeli PM Netanyahu believes it's a plan that can't work and could further the cries of ethnic cleansing (it's notable that he didn't add his overt support to it alongside Trump) the president's plan will certainly help him domestically where his future is fragile. Netanyahu can dangle 'permanent relocation' in front of the real hardliners in his government who keep him in power. Whatever is at play here, the announcement today will horrify Palestinians and it will delight and embolden the hardline elements of Israeli society who have dreamt of a Jewish state free of Palestinians. 'Plans change with time' The US president hinted he would seek an independent Palestinian state as part of a broader two-state solution to the decades-long Israel-Palestine conflict. \"Well, a lot of plans change with time,\" he told reporters when he was asked if he was still committed to a plan similar to the one he spelled out in 2020 that described a possible Palestinian state. That plan proposed a series of Palestinian enclaves surrounded by an enlarged Israel, did not have the Palestinian capital in East Jerusalem, but suggested a Palestinian capital on the outskirts of the city. \"A lot of death has occurred since I left and now came back. Now we are faced with a situation that's different - in some ways better and in some ways worse. But we are faced with a very complex and difficult situation that we'll solve,\" he said. On the likelihood of getting a permanent ceasefire in Gaza, Mr Trump said: \"We are dealing with a lot of people, and we have steps to go yet, as you know, and maybe those steps go forward, and maybe they don't. \"We're dealing with a very complex group of people, situation and people, but we have the right man. We have the right leader of Israel. He's done a great job.\" Mr Trump was also asked whether he should get the Nobel Peace Prize. He said: \"They will never give me a Nobel Peace Prize. It's too bad. I deserve it, but they will never give it to me.\""
    },
    {
        "title": "Trump's Gaza solution betrays his ignorance of history - and could make the conflict worse",
        "description": "For a man ignorant in the history and ways of the Middle East, it makes perfect sense.",
        "url": "https://news.sky.com/story/trumps-gaza-solution-betrays-his-ignorance-of-history-and-could-make-the-conflict-worse-13303310",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-white-house_6819915.jpg?20250204233331",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-02-04 23:23:00",
        "Headline": "Contrary to the US president's claim that many countries have offered to help take Palestinians in, none have done so publicly.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n For a man ignorant in the history and ways of the Middle East, it makes perfect sense. The people of Gaza do not have homes to go back to, their land is a living hell and has brought them nothing but suffering. Surely the world can get together and build them somewhere nice where they can live instead. Crucial meeting between Trump and Netanyahu: Live updates Donald Trump should know better than that you might say. He is after all the leader of the free world and has at his disposal as many foreign policy advisers as he cares to listen to. Trump says Gaza residents should be resettled permanently or they will end up dying If he had asked them they would have told him there are a few issues with his proposal that the people of Gaza leave and don't go back. \n                  Trump threatens Iran would be 'obliterated' if it assassinates him - as he signs 'tough' directive against Tehran\n                 \n                  Trump maximises leverage over Iran by squeezing where it hurts most\n                 \n                  Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'\n                 Firstly they regard Gaza as their home. They are fiercely proud of their heritage and their history of being there. Ask anyone who has ever been to Gaza. Secondly, contrary to the US president's claim that many countries have offered to help take them in, none have done so publicly. In fact Israel's immediate neighbours Egypt, Jordan, Saudi Arabia have all dismissed the idea out of hand. But thirdly, and more to the point, there is a long and dark history of Palestinians being encouraged one way or another to leave their homes never to return. Many of those living in Gaza's 'refugee camps' are descendants of the victims of the Nakba, as they call it, or the catastrophe when during Israel's first war of independence, they had to flee homes on land that is now in Israel. They believe they should be allowed to return to that land which they say Israelis wrongly took from them. Any acquiescence with another mass displacement would be a betrayal of their forefathers' rights of return, they believe. In the early days of the Gaza war, Israeli right wing politicians quietly pushed the idea that maybe the world could take Gazans in, give them a better life etc. They don't really want to live there anyway we were told, they'd be much better off in Michigan, or the emptier bits of Europe, or maybe Jordan, and Egypt might be persuaded to take in more in return for the huge amounts of American aid they receive. Those politicians and diplomats understand their neighbours more than Donald Trump, or should do and should have known better. But the idea never went away. Donald Trump it seems was listening and is now advocating the idea despite all its obvious shortcomings. That will embolden far right Jewish extremists in the Netanyahu government who openly advocate the return of Israeli settlers to occupy Gaza. But it will do nothing to bring a solution to the conflict - quite the opposite."
    },
    {
        "title": "Worst mass shooting in Sweden's history with 11 killed at adult education centre",
        "description": "Swedish police have said 11 people have been killed at an adult education centre, in what the country's prime minister said is the worst mass shooting in Sweden's history.",
        "url": "https://news.sky.com/story/attacker-among-around-10-killed-in-shooting-at-adult-education-centre-in-sweden-13302756",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-sweden-shooting-school_6819796.jpg?20250204210040",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-04 06:07:00",
        "Headline": "A major police operation is under way in Orebro, around 200km (125 miles) west of the capital Stockholm. The centre offers primary and upper secondary school courses, as well as Swedish classes for immigrants, vocational training and programmes for people with learning disabilities.",
        "Content": " Swedish police have said 11 people have been killed at an adult education centre, in what the country's prime minister said is the worst mass shooting in Sweden's history. The attack happened at around 12.30pm local time (11.30am UK time) at Campus Risbergska in the town of Orebro, around 200km (125 miles) west of the capital Stockholm. A spokesperson told a news conference on Tuesday evening that police believe the \"primary perpetrator\" is dead and acted alone. They do not expect more attacks, the spokesperson added. Police said they carried out investigations at various addresses in Orebro, with technical personnel working at the scene. Sweden shooting latest: 'Everything points to typical loner attack' \"At present, the police believe that the perpetrator acted alone, but we cannot rule out more perpetrators connected to the incident,\" the update on the Swedish police's website said. Police also said they do not know the motive but do not believe it is terrorism, adding they \"had no warning sign\" about the attack. \n                  Sweden shooting: What we know after 11 people are killed at adult education centre, police say\n                 \n                  Iraqi man who sparked riots with Koran burnings shot dead in Sweden\n                 \n                  New Eurovision rules announced to 'protect' artists after controversies at competition\n                 Officers are working to identify the perpetrator and the victims. The damage at the crime scene was so extensive that investigators were unable to be more definitive on the number killed, said Roberto Eid Forest, head of the local police. \"When it comes to saying anything more about the perpetrator, it is still very early. The operation is ongoing and that will undoubtedly become clearer. But we are working very intensively right now,\" Mr Forest said. He described the attack as a \"horrible\" incident, calling it \"exceptional\" and a \"nightmare\". The suspected gunman had not previously been known to police, Mr Forest said.. Speaking at a press conference this evening, Sweden's prime minister Ulf Kristersson said the tragedy is the worst mass shooting in the country's history. \"Today, we have witnessed brutal, deadly violence against completely innocent people,\" Mr Kristersson told reporters. \"This is the worst mass shooting in Swedish history. Many questions remain unanswered, and I cannot provide those answers either. \"But the time will come when we will know what happened, how it could occur, and what motives may have been behind it. Let us not speculate,\" he said. Meanwhile, the country's king Carl XVI Gustaf said the shooting was a \"terrible atrocity\". \"We send our condolences tonight to the families and friends of the deceased. Our thoughts at this time also go to the injured and their relatives, as well as to others affected. \"My family and I would like to express our great appreciation for the police, rescue and medical personnel who worked intensively to save and protect human lives on this dark day.\" Police earlier urged the public to stay away from the centre as they were searching and evacuating the premises. At least five people were taken to hospital. Four underwent surgery - one is critically injured, two are stable and one is lightly injured, police said at an earlier news conference. Swedish newspaper Dagens Nyheter said police officers had been shot at, but police said no officers had been shot. The centre is for students over the age of 20, according to its website. It offers primary and upper secondary school courses, as well as Swedish classes for immigrants, vocational training and programmes for people with intellectual disabilities. Google Maps shows a number of schools for children in the vicinity. The shooting happened after many students had gone home following a national exam. Students were taking shelter in nearby buildings and other parts of the campus were evacuated. Teacher Lena Warenmark told SVT News that there were unusually few students on the campus on Tuesday afternoon after the exam. She also told the broadcaster that she heard probably 10 gunshots. Andreas Sundling, 28, was among those forced to barricade themselves inside the school. Read more: What we know about Sweden shooting so far \"We heard loud bangs and first we thought people were fighting outside and maybe throwing chairs and tables, [but] then we heard people screaming,\" he told Sky News. \"Then the people in my class realised that something is wrong. We closed all the doors to the classroom and we locked the doors and I barricaded the doors with tables and chairs.\" Mr Sundling said his class hid under the tables and he began thinking about his family, including his two-year-old daughter and six siblings. The student said there was \"blood everywhere on the floor\" inside the school and it was \"crazy\". Swedish newspaper Aftonbladet reported one person trapped in the centre as saying: \"We have heard several shots outside.\" The newspaper also quoted a person who had received a text from a teacher at the centre saying \"there was a shooting with automatic weapons\". It said local emergency and intensive care departments are being made ready for casualties. Fatal attacks at educational establishments in Sweden are rare, with 10 killed in seven incidents between 2010 and 2022, according to the Swedish National Council for Crime Prevention."
    },
    {
        "title": "Sweden shooting: What we know after 11 people are killed at adult education centre, police say",
        "description": "A major police operation is under way after 11 people were killed at an adult education centre in Sweden.",
        "url": "https://news.sky.com/story/sweden-shooting-what-we-know-after-five-people-shot-at-adult-education-centre-13302979",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-risbergska-school-police_6819403.jpg?20250204131925",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-04 13:31:00",
        "Headline": "The shooting is believed to have taken place at Campus Risbergska, which caters for students over the age of 20 in the town of Orebro. ",
        "Content": "A major police operation is under way after 11 people were killed at an adult education centre in Sweden. Authorities have warned the public to stay away from the area in the town of Orebro, around 200km (125 miles) west of the capital Stockholm. Sweden shooting latest: Follow updates  Police said 11 people had been killed in the shooting. The gunman is believed to be among the dead, officers said. The website for the Swedish police added: \"About ten people have been killed in the incident. \"We are currently working on identification. The total number of injured is currently unclear.\" Here is everything we know about the shooting so far. What happened? Police were alerted to shots being fired at Campus Risbergska adult education centre just after 12.30pm local time (11.30am UK time) on Tuesday. The violence broke out after many students had gone home following a national exam. Video footage from the scene showed a large police presence and other emergency vehicles. In a news conference after 5pm UK time, police said around 10 people had been killed. Officers added they don't believe there is a terror motive in the attack, but this is not conclusive. None of those admitted to hospital are children, according to a separate update on the Orebro regional authorities' website. Students that were sheltering in nearby buildings, and other parts of the school, were evacuated following the shooting. Campus Risbergska serves students who are over the age of 20, according to its website. Primary and upper secondary school courses are offered, as well as Swedish classes for immigrants, vocational training and programmes for people with intellectual disabilities. What we know about the suspect The suspect remains unnamed, but police confirmed they are a male. In their evening update, police said they believed the suspect had also died. He was not known to officers, police said. A spokesperson added that they cannot rule out that there are more suspected attackers involved. 'Three bangs and loud screams' Teacher Lena Warenmark told SVT News that there were unusually few students on the campus on Tuesday afternoon after the exam. She also told the broadcaster that she heard probably 10 gunshots. Andreas Sundling, 28, was among those forced to barricade themselves inside the school. \"We heard three bangs and loud screams,\" he told the Expressen newspaper while sheltering in a classroom. \"Now we're sitting here waiting to be evacuated from the school. The information we have received is that we should sit and wait.\" Pavel Koubak, a photographer who was in the area at the time of the attack, said that he saw at least three police helicopters in the sky. \"I was talking to a guy riding a bicycle who passed through the area,\" he told Sky News presenter Kamali Melbourne. \"He had a friend that was working inside the school that had sent him a text message that there was automatic rifle fire. He was laying down on the floor inside the school.\" Asked whether gun violence was rare in the area, Mr Koubak said it was not. \"We've had plenty of shootings around Sweden and also in Orebro in the last couple of years. But, this seems to be sort of a bigger magnitude,\" he said. \"I think [the police] are pretty educated on these types of situations nowadays. There was a pretty quick response from the big unit of police and lots of helicopters very, very quickly after the alarm.\" What have the police said? Police said they carried out investigations at various addresses in Orebro, with technical personnel working at the scene. \"At present, the police believe that the perpetrator acted alone, but we cannot rule out more perpetrators connected to the incident,\" the update on the Swedish police's website said. Police added that they \"had no warning sign\" about the attack. Officers are also working to identify the perpetrator and the victims. The damage at the crime scene was so extensive that investigators were unable to be more definitive on the number killed, said Roberto Eid Forest, head of the local police. \"When it comes to saying anything more about the perpetrator, it is still very early. The operation is ongoing and that will undoubtedly become clearer. But we are working very intensively right now,\" Mr Forest said. He described the attack as a \"horrible\" incident, calling it \"exceptional\" and a \"nightmare\". What has the government said? Sweden's prime minister Ulf Kristersson said the tragedy is the worst mass shooting in the country's history. \"Today, we have witnessed brutal, deadly violence against completely innocent people,\" Mr Kristersson told reporters. \"This is the worst mass shooting in Swedish history. Many questions remain unanswered, and I cannot provide those answers either. \"But the time will come when we will know what happened, how it could occur, and what motives may have been behind it. Let us not speculate,\" he said. Meanwhile, the country's king Carl XVI Gustaf said the shooting was a \"terrible atrocity\". \"We send our condolences tonight to the families and friends of the deceased. Our thoughts at this time also go to the injured and their relatives, as well as to others affected. \"My family and I would like to express our great appreciation for the police, rescue and medical personnel who worked intensively to save and protect human lives on this dark day.\""
    },
    {
        "title": "Trump maximises leverage over Iran by squeezing where it hurts most",
        "description": "Leverage is the most important thing in negotiations, Donald Trump said in his book The Art Of The Deal. \"Don't make deals without it.\"",
        "url": "https://news.sky.com/story/trump-maximises-leverage-over-iran-by-squeezing-where-it-hurts-most-oil-sales-13303193",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-donald_6819764.jpg?20250204203203",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-02-04 20:27:00",
        "Headline": "Iran's leaders are in a tight spot. President Donald Trump seems determined to increase their pain. He hopes that he can increase the chances of a deal on his terms.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Leverage is the most important thing in negotiations, Donald Trump said in his book The Art Of The Deal. \"Don't make deals without it.\" The US president has just maximised his leverage over Iran's government, squeezing it where it hurts most. Oil sales. The move will hurt Iran's economy, already in deep trouble, and could lead to more social unrest. The edict Mr Trump signed on Tuesday marks a return to the maximum pressure policies of his first administration that were relaxed by his successors. Joe Biden allowed Iran to export more than $50bn of oil a year. Trump is reversing that. He will target foreign ports and refineries, especially those in China that are currently handling Iranian oil. Iran may find there is nowhere left for it to sell its oil. \n                  Trump's Gaza solution betrays his ignorance of history - and could make the conflict worse\n                 \n                  Trump threatens Iran would be 'obliterated' if it assassinates him - as he signs 'tough' directive against Tehran\n                 \n                  Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'\n                 Read more: Trump says Iran will be 'obliterated' if it assassinates him That could be devastating for the ayatollahs and their government. Strapped by crippling sanctions, Iranians desperately need the hard currency receipts generated by oil sales. But the impact does not stop there. The global price of oil has already jumped on the news. This spells more trouble for the government in Tehran. Higher fuel prices add to the pain of Iran's poor. That increases the chances of social unrest. Protests led by Iranian women following the death of a Mahsa Amini more than two years ago were crushed with force but they weakened the government's standing. If the rural poor take to the streets, protesting against higher fuel and food prices on top of already crippling inflation, broader and more wide-ranging unrest could ensue. This all puts Iran's government in a bind. President Trump says he wants a deal with Iran. Its people are amazing, he says, and the country has huge potential. On one condition. It cannot have a nuclear weapon. Iran says its nuclear programme is for peaceful purposes but since Mr Trump reneged on the first Iranian nuclear deal it has been enriching uranium to levels that can have no civilian purpose. Its government is facing a choice. Enter talks with the US from a position of weakness. Or change its nuclear doctrine and accelerate its pursuit of the bomb. The latter path is fraught with danger. Israeli intelligence has infiltrated and penetrated Iran. It is likely to detect any clandestine dash to go the final mile and produce a nuclear weapon.  Read more from Sky News:Why China has not retaliated more in Trump trade spatWhat's going on with Trump and tariffs and what does it all mean? Israel is likely then to attack Iran and Mr Trump has said without a deal the US is likely to support it. Iran has never been more exposed. Over the last year it has watched its network of allies and proxies done mortal damage by Israel. In the latest round of fighting between the two countries, Israel is thought to have destroyed much of Iran's air defences. But it has other means of self-defence. Not least attacking neighbours across the gulf and their vulnerable energy infrastructure. That raises the spectre once more of an escalating war across the Middle East. Iran's diplomats are sounding defiant. Attacking its nuclear facilities would be \"crazy\", its foreign minister Abbas Aragchi told Sky News last month. It would lead, he said, to a \"very bad disaster\" for the region. Iran's leaders are in a tight spot. Mr Trump seems determined to increase their pain. He hopes that could increase the chances of a deal on his terms. Others fear it makes a devastating regional conflict more likely. The repercussions of a conflict across the Persian Gulf would be felt around the world."
    },
    {
        "title": "The mood on Canada's border with US is more a fragile truce than crisis averted",
        "description": "Stand on the riverbank in Windsor, Ontario, and Detroit is directly in front of you. It's not quite spitting distance but it's swimmable.",
        "url": "https://news.sky.com/story/the-mood-on-canadas-border-with-us-is-more-a-fragile-truce-than-crisis-averted-13303156",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-flag_6819742.jpg?20250204200057",
        "type": "World",
        "Author": "Diana Magnay",
        "Date Published": "2025-02-04 18:48:00",
        "Headline": "Donald Trump had threatened a 25% tariff on all Canadian exports, but a one-month pause has been agreed following last-minute talks.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Stand on the riverbank in Windsor, Ontario, and Detroit is directly in front of you. It's not quite spitting distance but it's swimmable. Canada's auto capital and America's motor city are divided by the Detroit River, tied by the Ambassador's Bridge which transports $323m (£260m) worth of goods between Canada and the US every day. Donald Trump's threatened 25% tariff on all Canadian exports - with a carve-out for energy at 10% - would have weighed heavy here, and that's putting it mildly. Car parts can criss-cross the border multiple times before they roll off the finish line in either Detroit or Windsor. The tariff would have put tens of thousands of jobs on the line in Ontario - in the auto industry, in agriculture, and in the energy sector too. So the one-month pause - announced on Monday after last-minute talks between Mr Trump and Canadian Prime Minister Justin Trudeau - is a huge relief.  👉 Follow Trump 100 on your podcast app 👈 Drew Dilkens, the mayor of Windsor, told Sky News: \"25% across the board is catastrophic. It's not even a hard response, it is a catastrophic response. \"We just hope not to be back in this same situation with the amount of uncertainty that we felt 30 days from now.\" The mayor announced on Monday that he would suspend funding for the cross-border tunnel bus, which transports 40,000 Canadians to Detroit each year for shopping or entertainment, or whatever it is they might choose to do there. \"If I'm under economic attack by our best friend and closest trading partner, I absolutely do not want to subsidise and support bringing transit to their community to help with their economic development,\" he said. In a liquor store in Windsor, the shelves are still stacked with American whisky and Californian wines. \"You're still selling that stuff?\" one customer asks a sheepish-looking salesman. Ontario premier Doug Ford had ordered stores to remove American liquor starting Tuesday if the tariffs went into effect. That order is now on hold, along with his announcement that he would rip up Ontario's $68m (£55m) contract with Elon Musk's Starlink to provide internet access to rural homes. But they could be reinstated in an instant. Read more from Sky News:Why China has not retaliated more in Trump trade spatWhat's going on with Trump and tariffs and what does it all mean? \"Trump's an idiot,\" says James Summerfield, who stops to chat on the street. \"He's trying to get money from every angle he possibly can, to be the 'best president' there's ever been, but most likely he's the worst president we've ever had on that side of the border. \"I don't think anyone from Canada thinks we're going to pay to ship their cars over there.\" In a local car repair workshop, a group of workers are tucking into a lunch of hummus and falafel which they generously offer around. \"We have a lot of power when it comes to them receiving electricity and energy,\" Jin tells us. \"None of this is going to be good. Like both sides are going to lose if the tariff ends up going through.\" For now, the mood feels more like a fragile truce than a crisis averted. \"No one wants to support a bully,\" mayor Dilkens says. \"We're close friends, we're close neighbours. One president of the United States is not going to disrupt centuries of friendship. It's just going to be choppy waters for the next three years and 11 months.\""
    },
    {
        "title": "Donald Trump Junior accused of killing protected species of duck on hunt in Venice lagoon",
        "description": "An Italian politician has told Sky News he's filed a criminal complaint after  Donald Trump Junior allegedly killing a protected species of duck while on a hunting trip in the Venice lagoon.",
        "url": "https://news.sky.com/story/donald-trump-junior-accused-of-killing-protected-species-of-duck-on-hunt-in-venice-lagoon-13303311",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-ruddy-shelduck-pyin-u-lwin_6819931.jpg?20250205000800",
        "type": "World",
        "Author": "Simone Baglivo, Italy producer",
        "Date Published": "2025-02-04 23:28:00",
        "Headline": "Dead birds allegedly included a ruddy shelduck, which is protected by the EU Birds Directive and Italian wildlife protection legislation.",
        "Content": "By Simone Baglivo, Italy producer  An Italian politician has told Sky News he's filed a criminal complaint after  Donald Trump Junior allegedly killing a protected species of duck while on a hunting trip in the Venice lagoon. Andrea Zanoni, from the Green Europe party, said he had notified the Carabinieri environmental crime unit in Mestre. He claimed Mr Trump hunted and killed protected species of birds in Campagna Lupia, a town in the province of Venice, last December. \"The US president's son killed a protected species in a protected natural area, and this is a serious criminal offence,\" Mr Zanoni said. \"No one should be above the law.\" Mr Zanoni is currently serving as president of the region of Veneto's justice commission. A spokesman for Mr Trump said his party had permits and were in a legally allowed area. A video posted online and reported by Italian media outlets appears to show Mr Trump Jr shooting at ducks inside a special conservation area south of Venice, and then addressing the camera and pointing to an orange-brown duck among at least six other dead waterfowl around him. The dead birds allegedly included a ruddy shelduck, which is protected by the EU Birds Directive and Italian wildlife protection legislation. In addition, it is thought Mr Trump needed to reside in an Italian region in order to be granted a hunting permit. Veneto imposes a different hunting calendar for each species. Mr Zanoni said he was \"100% sure\" the Venice Public Prosecutor's Office will soon open a probe into the case. If so, it is thought Donald Trump Jr could face both a jail sentence and a fine. A source close to the investigation told Sky News they are \"evaluating\" possible crimes following Mr Zanoni's complaint. Environment Minister Gilberto Pichetto said he was \"waiting for a report\". Sergio Costa, a former Italian environment minister, told Sky News he was \"horrified\" by the case. \"It's as if Italy became Trump Junior's backyard,\" Mr Costa said. \"I'll ask the government to report on this and I'm going to file a complaint with the Public Prosecutor's Office,\" he added. Read more:Donald Trump says Gaza residents should be resettled permanentlyWorst mass shooting in Sweden's history An animal rights NGO, LAV, expressed indignation along with other Italian political parties. Veneto governor Luca Zaia refused to comment on the case. A spokesman for Mr Trump said \"there were countless other hunting groups present\" while the hunting party had permits and were in a legally allowed area. Andy Surabian added: \"While it's unclear whether this single duck was unintentionally shot by someone in Don's hunting group, another hunting group, or killed in a different manner and retrieved by the group's hunting dog, Don takes following all rules, regulations and conservation on his hunts very seriously and plans on fully cooperating with any investigation.\""
    },
    {
        "title": "Rwanda-backed rebels declare ceasefire after deadly capture of Democratic Republic of Congo city",
        "description": "Rwanda-backed rebels who seized a major city in the Democratic Republic of Congo (DRC) have declared a unilateral ceasefire on humanitarian grounds.",
        "url": "https://news.sky.com/story/rwanda-backed-rebels-declare-ceasefire-after-deadly-capture-of-democratic-republic-of-congo-city-13302933",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-congo-goma_6819430.jpg?20250204133817",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-04 12:16:00",
        "Headline": "The announcement came after days of fighting between the M23 group and Congolese forces left around 900 people dead.",
        "Content": "Rwanda-backed rebels who seized a major city in the Democratic Republic of Congo (DRC) have declared a unilateral ceasefire on humanitarian grounds. The M23 rebel group announced on Monday that the ceasefire would come into effect on Tuesday. It came just under a week after the rebels completed their three-day capture of Goma - the regional capital of eastern DRC - after fierce battles with Congolese forces. The UN health agency has said at least 900 people died during fighting in the days that followed, while Congo's communications minister Patrick Muyaya on Monday more than 2,000 bodies are waiting to be buried in Goma. The ceasefire announcement came after foreign ministers from G7 nations, including the UK, urged both sides in the conflict to return to negotiations. In a statement on Monday, they called for a \"rapid, safe and unimpeded passage of humanitarian relief for civilians\". The fighting in Goma forced hundreds of thousands of people who had been displaced by years of conflict to carry what remained of their belongings and flee again - with many pouring into nearby Rwanda. Goma, home to two million people, is at the heart of a region home to trillions of dollars in mineral wealth and remains in rebel control despite the ceasefire announcement. Following the capture of the city, the Rwanda-backed rebels were said to be moving towards Bukavu in South Kivu, also in the east of the country. However, they appeared to be held up by Congolese troops that were supported by the army from neighbouring country Burundi. M23 had also expressed a desire to march to DRC's capital Kinshasa before the rebel group's spokesman, Lawrence Kanyuka, said on Monday: \"It must be made clear that we have no intention of capturing Bukavu or other areas. \"However, we reiterate our commitment to protecting and defending the civilian population and our positions.\" The M23 group cited \"humanitarian reasons\" for the ceasefire. There was no immediate comment from Congo's government after it was declared. The rebels' announcement came ahead of a joint summit this week by regional blocs for southern and eastern Africa, which had called for a ceasefire. Kenya's President William Ruto said the presidents of DRC and Rwanda would attend. Congolese authorities have said they are open to talks to resolve the conflict, but that such a dialogue must be done within the context of previous peace agreements. Rwanda and the rebels have accused the DR Congo government of defaulting on previous deals. Read more:EU facing pressure to drop Rwanda mineral dealWhat is the fighting in Democratic Republic of Congo about?Eyewitness account after rebels take key city The M23 rebels are backed by some 4,000 troops from Rwanda, according to UN experts, far more than in 2012 when they first briefly captured Goma then withdrew after international pressure. They are the most potent of the more than 100 armed groups vying for control in DRC's volatile eastern borderlands, which hold vast deposits of minerals critical to much of the world's technology. M23 is also the latest in a long line of Rwandan-supported rebel movements to emerge in eastern DR Congo following two successive wars stemming from Rwanda's genocide more than 30 years ago.  During the atrocity in 1994, members of Rwanda's majority Hutu population went on the rampage, murdering Tutsis and those who tried to protect them in a massacre that lasted more than 100 days. M23 now says it is defending ethnic Tutsis in DRC, whom Rwanda claims are being persecuted by Hutus and former militias responsible for the genocide. Many Hutus fled to DRC after the massacre and founded the Democratic Forces for the Liberation of Rwanda militia group. Rwanda said the group is \"fully integrated\" into the Congolese military, which it denies."
    },
    {
        "title": "Thousands flee Santorini after spike in earthquakes but few brave tourists remain",
        "description": "Thousands have fled the Greek island of Santorini after hundreds of earthquakes shook the Aegean Sea in recent days.",
        "url": "https://news.sky.com/story/thousands-flee-santorini-after-spike-in-earthquakes-but-few-brave-tourists-remain-13302891",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-santorini-greece-earthquakes_6819299.jpg?20250204112413",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-02-04 11:21:00",
        "Headline": "Hundreds of earthquakes, some as strong as magnitude 5, have shaken the Aegean Sea in recent days.",
        "Content": "Thousands have fled the Greek island of Santorini after hundreds of earthquakes shook the Aegean Sea in recent days. Schools across a number of Greek islands have been shut as a result of the tectonic activity, but a handful of tourists have enjoyed having the views to themselves. Images captured an exodus of residents and seasonal workers leaving the Cycladic Islands amid the earthquakes. Families carrying young children, tourists dragging their suitcases, and car parks full of vehicles belonging to those who had left on a ferry were all common sights. In Santorini's main town of Fira, the narrow, whitewashed streets were deserted - a rare sight even in the off-season - apart from small pockets of tour groups. Hundreds of tremors have shaken the islands, some as strong as magnitude 5, since Friday. Ferry and commercial flight operators have added additional services to accommodate the surge of people leaving. The quakes have caused cracks in some older buildings but no injuries have so far been reported. Schools on 13 islands were shut on Tuesday - up four from the previous day. Santorini previously cancelled public events, restricted travel and banned construction work in certain areas. Efthimios Lekkas, head of the state-run Earthquake Planning and Protection Organization, said the epicentre of the earthquakes was in the Aegean Sea and moving north away from Santorini. He added there was no connection to the area's dormant volcanoes. \"This may last several days or several weeks. We are not able to predict the evolution of the sequence in time,\" Mr Lekkas told state-run television. Retired police officer and ship worker Panagiotis Hatzigeorgiou, who has lived in Santorini for more than 30 years, said he turned down offers to stay with relatives in Athens. \"Older residents are used to the earthquakes... but it's different this time. It's not the same to have earthquakes every two to three minutes. The main thing is not to worry,\" he said. He added: \"Now we can listen to music alone and have coffee by ourselves.\" But tour guide Kostas Sakavaras said he and his family had fled to Athens \"as a precaution\". \"It's nerve-wracking to have every few minutes some tremor happening, even though it's not a very devastating one,\" he told Sky News. He said he had a \"feeling increasingly more people are leaving the island\". In Athens, government officials were holding daily planning and assessment meetings with briefings from island officials. Despite the quakes, not everyone was put off visiting the island. Joseph Liu, from Guangzhou in southern China, said he had spent years wanting to visit Santorini after seeing it in a documentary. Read more from Sky News:China hits back after new US tariffsGirl, 17, killed by shark while swimmingMan sentenced to nearly 500 years He added he had been warned about the earthquakes so was not surprised by them, saying: \"This place is amazing, really beautiful.\""
    },
    {
        "title": "Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'",
        "description": "The US will take over Gaza and \"own it\", Donald Trump has said.\n",
        "url": "https://news.sky.com/story/donald-trump-says-gaza-residents-should-be-resettled-or-they-will-end-up-dying-13303161",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-palestinians-nuseirat_6809287.jpg?20250124140119",
        "type": "US",
        "Author": "Andy Hayes and Claire Gilbody Dickerson, news reporters",
        "Date Published": "2025-02-04 19:02:00",
        "Headline": "Donald Trump described Gaza as \"hell\" and \"one of the meanest, toughest places on earth\" as Benjamin Netanyahu visited him at the White House. ",
        "Content": "By Andy Hayes and Claire Gilbody Dickerson, news reporters   The US will take over Gaza and \"own it\", Donald Trump has said.\n Speaking alongside Israeli Prime Minister Benjamin Netanyahu at the White House, he said the two million Palestinian people living in the territory, which he described as a \"demolition site\", would go to \"various domains\". Asked about deploying US troops to fill a potential security vacuum, the president replied: \"We'll do what is necessary.\" Expanding on plans for the territory, he said the US would \"develop it, create thousands and thousands of jobs\" and turn it into \"something the entire Middle East can be very proud of\". The president reiterated his suggestion from 25 January that Palestinians could be relocated to Egypt and Jordan - something both countries, other Arab nations including Saudi Arabia, and Palestinian leaders, have rejected. Palestinians in Gaza could go to countries beyond Jordan and Egypt too, he said. Asked whether he thought Egypt and Jordan would accept Palestinians, he said he believed they would. But, he added: \"I hope we could do something where they wouldn't want to go back. Who would want to go back? \"They've experienced nothing but death and destruction.\" However, Saudi Arabia immediately responded, stressing its rejection of attempts to displace Palestinians from Gaza, and insisted it would not establish relations with Israel without a Palestinian state. Asked on what authority the US could take control of Gaza, Mr Trump told reporters he sees a \"long term ownership position\" which would, he claimed, bring stability to that part of the Middle East. \"This was not a decision made lightly,\" he said. \"Everybody I've spoken to loves the idea of the United States owning that piece of land, developing and creating thousands of jobs.\" It would be the \"Riviera of the Middle East\". He continued: \"I've studied it. I've studied this very closely over a lot of months, and I've seen it from every different angle.\" He does not believe Palestinians should return to Gaza because it is a \"guarantee that they're going to end up dying\". He talked about finding a \"beautiful area to resettle people, permanently, in nice homes where they can be happy and not be shot and not be killed and not be knifed to death like what's happening in Gaza\".  Read more from Sky News: 'Hardest Geezer' to run full length of New ZealandWhy China has not retaliated more in Donald Trump trade spat The war, triggered by Hamas carrying out a massacre of 1,200 people and taking 250 others hostage during the 7 October 2023 attacks in Israel, has temporarily stopped since the long-sought ceasefire deal came into effect on 19 January. More than 47,000 Palestinians have been killed in Gaza since Hamas's attack, according to local authorities. Mr Netanyahu, the first world leader to meet Mr Trump since the pro-Israel president's return to the White House, sat beside the Republican as he answered questions from the press. US correspondent If President Trump is to be taken at face value then he is set to repeat history. It would end the prospect of a two-state solution - Israelis and Palestinians living side by side on the same land. It could also wreck any prospects of diplomatic normalisation between Israel and Gulf Arab states.  Nations like Saudi Arabia wouldn't stand for such a permanent resettlement and probably wouldn't trust any resettlement presented as 'temporary' - which this is conspicuously not. The two countries being told to take the people of Gaza - Egypt and Jordan - have firmly refused to do so. The American president seems convinced they will roll over. Maybe though this is part of Trump's art of the deal: to suggest something, then not follow through - and present that as a concession down the line. There’s something else too. Even if Israeli PM Netanyahu believes it's a plan that can't work and could further the cries of ethnic cleansing (it's notable that he didn't add his overt support to it alongside Trump) the president's plan will certainly help him domestically where his future is fragile. Netanyahu can dangle 'permanent relocation' in front of the real hardliners in his government who keep him in power. Whatever is at play here, the announcement today will horrify Palestinians and it will delight and embolden the hardline elements of Israeli society who have dreamt of a Jewish state free of Palestinians. 'Plans change with time' The US president hinted he would seek an independent Palestinian state as part of a broader two-state solution to the decades-long Israel-Palestine conflict. \"Well, a lot of plans change with time,\" he told reporters when he was asked if he was still committed to a plan similar to the one he spelled out in 2020 that described a possible Palestinian state. That plan proposed a series of Palestinian enclaves surrounded by an enlarged Israel, did not have the Palestinian capital in East Jerusalem, but suggested a Palestinian capital on the outskirts of the city. \"A lot of death has occurred since I left and now came back. Now we are faced with a situation that's different - in some ways better and in some ways worse. But we are faced with a very complex and difficult situation that we'll solve,\" he said. On the likelihood of getting a permanent ceasefire in Gaza, Mr Trump said: \"We are dealing with a lot of people, and we have steps to go yet, as you know, and maybe those steps go forward, and maybe they don't. \"We're dealing with a very complex group of people, situation and people, but we have the right man. We have the right leader of Israel. He's done a great job.\" Mr Trump was also asked whether he should get the Nobel Peace Prize. He said: \"They will never give me a Nobel Peace Prize. It's too bad. I deserve it, but they will never give it to me.\""
    },
    {
        "title": "Trump threatens Iran would be 'obliterated' if it assassinates him - as he signs 'tough' directive against Tehran",
        "description": "Donald Trump has reinstated his \"maximum pressure\" campaign on Iran - as he threatened Tehran it would be \"obliterated\" if it assassinates him.",
        "url": "https://news.sky.com/story/trump-threatens-iran-would-be-obliterated-if-it-assassinates-him-as-he-signs-tough-directive-against-tehran-13303201",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-executive-orders_6819773.jpg?20250204204123",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-04 20:38:00",
        "Headline": "The president has also stopped funding for the UN's relief agency for Gaza as he claims Palestinians have \"no alternative\" but to leave the strip.",
        "Content": " Donald Trump has reinstated his \"maximum pressure\" campaign on Iran - as he threatened Tehran it would be \"obliterated\" if it assassinates him. The US president signed a memorandum on Tuesday in an effort to crack down on Iran's nuclear programme and restrict oil exports - moments before he met Israel's prime minister Benjamin Netanyahu. Mr Trump said he also signed the \"tough\" directive on Iran because Tehran was \"too close\" to having a nuclear weapon.  He added he would hold talks with his counterpart in Tehran, but warned he has left \"instructions\" for his advisers that if Iran assassinated him, the US foe \"would be obliterated\". The US Justice Department announced in federal charges in November that an Iranian plot to kill Mr Trump before the presidential election had been thwarted. The department alleged Iranian officials had instructed Farhad Shakeri, 51, to focus on surveilling and ultimately assassinating Mr Trump. Shakeri is still at large in Iran. It comes as Mr Trump withdrew the US from the UN Human Rights Council in an executive order. \n                  Trump's Gaza solution betrays his ignorance of history - and could make the conflict worse\n                 \n                  Trump maximises leverage over Iran by squeezing where it hurts most\n                 \n                  Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'\n                 The president has also stopped funding of the UN's relief agency for Gaza. The order means Mr Trump has reinstated policies that were in place during his first administration. Joe Biden's administration previously paused funding to the UN Relief and Works Agency for Palestine Refugees (UNRWA) after reports its staff were involved in the 7 October attacks. Mr Trump also claimed that Palestinians have \"no alternative\" but to leave Gaza, but that he doesn't necessarily support Israelis settling in the enclave. International affairs editor Leverage is the most important thing in negotiations, Donald Trump said in his book The Art Of The Deal. \"Don't make deals without it.\" The US president has just maximised his leverage over Iran's government, squeezing it where it hurts most. Oil sales. The move will hurt Iran's economy already in deep trouble and could lead to more social unrest. But the impact does not stop there. The global price of oil has already jumped on the news. Read more here The US president also repeated previous suggestions that he would like to see Jordan and Egypt take Palestinians from Gaza. \"The Gaza thing has never worked,\" Trump told reporters. \"If we could find the right piece of land, pieces of land, and build them some really nice places...I think that would be a lot better than going back to Gaza.\" Read more:What's going on with Trump's tariffs? The Goonies cast reuniteEl Salvador agrees to take criminals from US Egypt and Jordan, as well other Arab nations, have flatly rejected calls by Trump to relocate the territory's population during post-war rebuilding of the territory. The UN estimates that 60% of structures in the enclave have been damaged or destroyed, with almost all of the 2.3 million people in Gaza having been forced to leave their homes during Israel's 15-month war to take shelter elsewhere in the territory. Meanwhile, the president said he thinks he will wind down the US Agency for International Development (USAID), in what would be a dramatic overhaul of how the world's largest single donor allocates foreign assistance. When a reporter said to Trump it sounded like he was going to \"wind down\" the agency, Trump chuckled and said \"I think so.\" Chaos has consumed the agency, which distributes billions of dollars of humanitarian aid around the world, since Trumpordered a freeze on most US foreign aid hours after taking office and tasked billionaire Elon Musk, who has falsely accused USAID of being a \"criminal\" organisation, with scaling down the agency. Mr Trump also said he would like to close the US Department of Education with executive action."
    },
    {
        "title": "Trump maximises leverage over Iran by squeezing where it hurts most",
        "description": "Leverage is the most important thing in negotiations, Donald Trump said in his book The Art Of The Deal. \"Don't make deals without it.\"",
        "url": "https://news.sky.com/story/trump-maximises-leverage-over-iran-by-squeezing-where-it-hurts-most-oil-sales-13303193",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-donald_6819764.jpg?20250204203203",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-02-04 20:27:00",
        "Headline": "Iran's leaders are in a tight spot. President Donald Trump seems determined to increase their pain. He hopes that he can increase the chances of a deal on his terms.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  Leverage is the most important thing in negotiations, Donald Trump said in his book The Art Of The Deal. \"Don't make deals without it.\" The US president has just maximised his leverage over Iran's government, squeezing it where it hurts most. Oil sales. The move will hurt Iran's economy, already in deep trouble, and could lead to more social unrest. The edict Mr Trump signed on Tuesday marks a return to the maximum pressure policies of his first administration that were relaxed by his successors. Joe Biden allowed Iran to export more than $50bn of oil a year. Trump is reversing that. He will target foreign ports and refineries, especially those in China that are currently handling Iranian oil. Iran may find there is nowhere left for it to sell its oil. \n                  Trump's Gaza solution betrays his ignorance of history - and could make the conflict worse\n                 \n                  Trump threatens Iran would be 'obliterated' if it assassinates him - as he signs 'tough' directive against Tehran\n                 \n                  Trump says US will take over 'demolition site' Gaza and make it the 'Riviera of the Middle East'\n                 Read more: Trump says Iran will be 'obliterated' if it assassinates him That could be devastating for the ayatollahs and their government. Strapped by crippling sanctions, Iranians desperately need the hard currency receipts generated by oil sales. But the impact does not stop there. The global price of oil has already jumped on the news. This spells more trouble for the government in Tehran. Higher fuel prices add to the pain of Iran's poor. That increases the chances of social unrest. Protests led by Iranian women following the death of a Mahsa Amini more than two years ago were crushed with force but they weakened the government's standing. If the rural poor take to the streets, protesting against higher fuel and food prices on top of already crippling inflation, broader and more wide-ranging unrest could ensue. This all puts Iran's government in a bind. President Trump says he wants a deal with Iran. Its people are amazing, he says, and the country has huge potential. On one condition. It cannot have a nuclear weapon. Iran says its nuclear programme is for peaceful purposes but since Mr Trump reneged on the first Iranian nuclear deal it has been enriching uranium to levels that can have no civilian purpose. Its government is facing a choice. Enter talks with the US from a position of weakness. Or change its nuclear doctrine and accelerate its pursuit of the bomb. The latter path is fraught with danger. Israeli intelligence has infiltrated and penetrated Iran. It is likely to detect any clandestine dash to go the final mile and produce a nuclear weapon.  Read more from Sky News:Why China has not retaliated more in Trump trade spatWhat's going on with Trump and tariffs and what does it all mean? Israel is likely then to attack Iran and Mr Trump has said without a deal the US is likely to support it. Iran has never been more exposed. Over the last year it has watched its network of allies and proxies done mortal damage by Israel. In the latest round of fighting between the two countries, Israel is thought to have destroyed much of Iran's air defences. But it has other means of self-defence. Not least attacking neighbours across the gulf and their vulnerable energy infrastructure. That raises the spectre once more of an escalating war across the Middle East. Iran's diplomats are sounding defiant. Attacking its nuclear facilities would be \"crazy\", its foreign minister Abbas Aragchi told Sky News last month. It would lead, he said, to a \"very bad disaster\" for the region. Iran's leaders are in a tight spot. Mr Trump seems determined to increase their pain. He hopes that could increase the chances of a deal on his terms. Others fear it makes a devastating regional conflict more likely. The repercussions of a conflict across the Persian Gulf would be felt around the world."
    },
    {
        "title": "Why China has not retaliated more in Donald Trump trade spat",
        "description": "China has, as expected, hit back at Donald Trump's imposition of a 10% tariff on its exports to the United States.",
        "url": "https://news.sky.com/story/why-china-has-not-retaliated-more-in-donald-trump-trade-spat-13302564",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-donald-trump-us_6759716.jpg?20241127220144",
        "type": "US",
        "Author": "Ian King",
        "Date Published": "2025-02-04 10:16:00",
        "Headline": "Sky's Ian King writes there are reasons why China has been spared harsher tariffs by the White House as the Trump administration imposes additional import charges on goods from China from today.",
        "Content": "\n          Business presenter\n              @iankingsky\n China has, as expected, hit back at Donald Trump's imposition of a 10% tariff on its exports to the United States. Beijing has slapped levies of between 10-15% on a range of energy products that imports from the US. But what has surprised observers - particularly when Mr Trump kicked off the trade war over the weekend - has been the president's comparatively lenient treatment of China and, moreover, Beijing's calm response. While America's two closest neighbours, Canada and Mexico, were hit with 25% tariffs (falling to 10% for Canadian energy exports) - since put on ice - China was merely hit with a 10% levy. Money blog: Now we know why Guinness tastes worse in Britain That struck many observers as curious since China is regarded as a bigger trade adversary by the US than Mexico and Canada, with the latter traditionally seen as a close friend to the US, particularly through the pair's involvement in the 'Five Eyes' security alliance along with Australia, New Zealand and the UK. The big question raised by this is what motivated Mr Trump to do this. \n                  Trump latest: President says he wants US to take ownership of Gaza so he can level it for 'jobs and housing'\n                 \n                  Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation\n                 \n                  Britain could do slimmed down trade deal with US within months, says former minister\n                 The thinking is that the president was trying to bring China to the negotiating table and that, by initially hitting a close ally like Canada harder, he was trying to send a message to China's leaders as to what they might face further down the line. That impression was reinforced by Mr Trump's overnight description of his 10% tariff on China as an \"opening salvo\". Why is China so calm? That is not the only curiosity concerning this affair. The other is the relatively calm response from Beijing. While Canada immediately responded with retaliatory measures and Mexico indicated that it would, China merely murmured in the first instance about taking \"necessary countermeasures\" and indicated that it would raise a complaint about the US with the World Trade Organisation. Since then, Beijing has of course hit back with tariffs of its own on US energy imports, as well as launching an antitrust investigation into Google and adding the parent company of Tommy Hilfiger and Calvin Klein on a blacklist of \"unreliable entities\". That gives Chinese president Xi Jinping something to take back off the table if, as expected, he speaks to Mr Trump in coming days as the pair seek to de-escalate this row. But it all feels relatively restrained and raises the question of why China has responded in this way. There is certainly a view in Beijing that, with Mr Trump's first moves, China got off rather lightly compared with the Canadians and Mexicans. That sanguine response may also indicate that Beijing knows it has other weapons it can deploy other than retaliatory measures. Cards in China's back pocket For a start, China owns $769bn worth of US Treasury bonds. Dumping some of those aggressively - while hurting the Chinese - would push up America's implied borrowing costs. Alternatively, Beijing could allow its currency, the renminbi, to weaken on the foreign exchange markets, just as it did during Mr Trump's first term of office.  Either way, Mr Trump's latest measures are unlikely to change the way Chinese businesses operate, particularly the country's manufacturers. They have become accustomed over several years, dating back to Mr Trump's first term, to aggression from the US. They have adapted the way they do business accordingly, for example by shipping a lot of their exports to the US via third countries, most notably Vietnam. Chinese businesses relieved Even Chinese companies specifically targeted by Mr Trump - the e-commerce giants Temu and Shein - may not be too badly affected. They were both singled out as the president closed the so-called \"de minimis\" loophole, dating back to 1938, which allows goods worth less than $800 to be sent directly to US consumers without incurring import duties or rigorous customs inspections. Read more:What's going on with Trump and tariffs?How UK finds itself in a strong position to avoid Trump tariffs This has been a constant thorn in the side of US retailers and its removal helps explain why, for example, shares of Walmart were on Monday spared the spanking meted out to other US stocks. Yet Shein and Temu are said to be taking the news calmly. They may even be calculating that this is a short-term squall that will soon blow over - or calculating that, such is the enormity of their buying power and supply chains, they can simply ship inventory elsewhere in the meantime or even just warehouse it. It is also worth noting that Shein, having been banned by India in 2020, has just begun selling in the country again. Overall, then, Chinese businesses have reacted with relief to what has happened. They know it could have been worse. It explains why, even though the Chinese economy is presently misfiring, the authorities in Beijing have reacted relatively calmly to what Mr Trump has done."
    },
    {
        "title": "The mood on Canada's border with US is more a fragile truce than crisis averted",
        "description": "Stand on the riverbank in Windsor, Ontario, and Detroit is directly in front of you. It's not quite spitting distance but it's swimmable.",
        "url": "https://news.sky.com/story/the-mood-on-canadas-border-with-us-is-more-a-fragile-truce-than-crisis-averted-13303156",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-canada-flag_6819742.jpg?20250204200057",
        "type": "US",
        "Author": "Diana Magnay",
        "Date Published": "2025-02-04 18:48:00",
        "Headline": "Donald Trump had threatened a 25% tariff on all Canadian exports, but a one-month pause has been agreed following last-minute talks.",
        "Content": "\n          International correspondent\n              @DiMagnaySky\n Stand on the riverbank in Windsor, Ontario, and Detroit is directly in front of you. It's not quite spitting distance but it's swimmable. Canada's auto capital and America's motor city are divided by the Detroit River, tied by the Ambassador's Bridge which transports $323m (£260m) worth of goods between Canada and the US every day. Donald Trump's threatened 25% tariff on all Canadian exports - with a carve-out for energy at 10% - would have weighed heavy here, and that's putting it mildly. Car parts can criss-cross the border multiple times before they roll off the finish line in either Detroit or Windsor. The tariff would have put tens of thousands of jobs on the line in Ontario - in the auto industry, in agriculture, and in the energy sector too. So the one-month pause - announced on Monday after last-minute talks between Mr Trump and Canadian Prime Minister Justin Trudeau - is a huge relief.  👉 Follow Trump 100 on your podcast app 👈 Drew Dilkens, the mayor of Windsor, told Sky News: \"25% across the board is catastrophic. It's not even a hard response, it is a catastrophic response. \"We just hope not to be back in this same situation with the amount of uncertainty that we felt 30 days from now.\" The mayor announced on Monday that he would suspend funding for the cross-border tunnel bus, which transports 40,000 Canadians to Detroit each year for shopping or entertainment, or whatever it is they might choose to do there. \"If I'm under economic attack by our best friend and closest trading partner, I absolutely do not want to subsidise and support bringing transit to their community to help with their economic development,\" he said. In a liquor store in Windsor, the shelves are still stacked with American whisky and Californian wines. \"You're still selling that stuff?\" one customer asks a sheepish-looking salesman. Ontario premier Doug Ford had ordered stores to remove American liquor starting Tuesday if the tariffs went into effect. That order is now on hold, along with his announcement that he would rip up Ontario's $68m (£55m) contract with Elon Musk's Starlink to provide internet access to rural homes. But they could be reinstated in an instant. Read more from Sky News:Why China has not retaliated more in Trump trade spatWhat's going on with Trump and tariffs and what does it all mean? \"Trump's an idiot,\" says James Summerfield, who stops to chat on the street. \"He's trying to get money from every angle he possibly can, to be the 'best president' there's ever been, but most likely he's the worst president we've ever had on that side of the border. \"I don't think anyone from Canada thinks we're going to pay to ship their cars over there.\" In a local car repair workshop, a group of workers are tucking into a lunch of hummus and falafel which they generously offer around. \"We have a lot of power when it comes to them receiving electricity and energy,\" Jin tells us. \"None of this is going to be good. Like both sides are going to lose if the tariff ends up going through.\" For now, the mood feels more like a fragile truce than a crisis averted. \"No one wants to support a bully,\" mayor Dilkens says. \"We're close friends, we're close neighbours. One president of the United States is not going to disrupt centuries of friendship. It's just going to be choppy waters for the next three years and 11 months.\""
    },
    {
        "title": "El Salvador 'agrees to accept US deportees of any nationality' including American criminals - Rubio ",
        "description": "The US secretary of state says El Salvador has agreed to accept US deportees of any nationality - as well as violent American criminals currently behind bars in their own country. ",
        "url": "https://news.sky.com/story/el-salvador-agrees-to-accept-us-deportees-of-any-nationality-including-american-criminals-rubio-13302735",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-marco-rubio-nayib-bukele_6819078.jpg?20250204025945",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-04 02:18:00",
        "Headline": "US Secretary of State Marco Rubio says it is the \"most unprecedented, extraordinary migratory agreement anywhere in the world\".",
        "Content": "The US secretary of state says El Salvador has agreed to accept US deportees of any nationality - as well as violent American criminals currently behind bars in their own country.  While on a visit to El Salvador, Marco Rubio said President Nayib Bukele had \"agreed to the most unprecedented, extraordinary migratory agreement anywhere in the world\". He added: \"He's also offered to do the same for dangerous criminals currently in custody and serving their sentence in the United States even though they're US citizens or legal residents.\" El Salvador is in effect being used as a \"safe third country\". Officials previously suggested such an agreement might be an option for Venezuelan gang members convicted of crimes in the United States, should Venezuela refuse to accept them. Speaking before the deal was announced, Mr Bukele said they were discussing something \"that does not have precedent in the history of the relationship, not just of the United States with El Salvador, but rather I think in Latin America\". After Mr Rubio made his comments, a US official said that while Mr Bukele's offer was significant, the Trump administration had no current plans to try to deport American citizens. The US government cannot legally deport American citizens unless they broke the law to become a citizen or have committed treason. However someone who has been granted permanent residence in the US can be deported for certain felonies. Human rights activists have claimed El Salvador does not have a consistent policy for the treatment of asylum seekers and refugees. Manuel Flores, secretary general of the leftist opposition party Farabundo Martí National Liberation Front, said any agreement would mean the region was being used as Washington's \"backyard to dump the garbage\". In 2023, El Salvador opened a \"mega prison\" as part of a crackdown on gang crime. The \"Terrorism Confinement Centre\" in Tecoluca was completed in seven months and can hold 40,000 inmates. Read more:Tariffs paused after US border commitments madeTrump threatens to cut off South Africa funding Mr Rubio - until recently a Florida senator - arrived in El Salvador after watching a US-funded deportation flight leaving Panama City for Colombia. It was carrying 43 migrants detained by Panamanian authorities after illegally crossing the Darien Gap from Colombia. The US has given Panama $2.7m (£2.2m) in flights and tickets. Such deportations send a message of deterrence, the US State Department said. \"Mass migration is one of the great tragedies in the modern era,\" Mr Rubio said. \"It impacts countries throughout the world. We recognise that many of the people who seek mass migration are often victims and victimised along the way, and it's not good for anyone.\""
    },
    {
        "title": "The Goonies cast reunite 40 years after cult movie released",
        "description": "The Goonies cast has reunited in Hollywood to celebrate one of their number being immortalised in concrete.",
        "url": "https://news.sky.com/story/the-goonies-cast-reunite-40-years-after-cult-movie-released-13303053",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-goonies-ke-quan-jonathan-ke-quan_6819543.jpg?20250204151208",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-04 15:12:00",
        "Headline": "Cast members Josh Brolin, Joe Pantoliano, Kerri Green, and Corey Feldman as well as writer Chris Columbus were all snapped with Ke Huy Quan at the ceremony.",
        "Content": "The Goonies cast has reunited in Hollywood to celebrate one of their number being immortalised in concrete. Actor Ke Huy Quan was honoured with a hand and footprint ceremony at the TCL Chinese Theatre in Los Angeles on Monday. To celebrate, much of his fellow cast from the classic 1985 film turned up, posing in pictures. Cast members Josh Brolin, Joe Pantoliano, Kerri Green, and Corey Feldman as well as writer Chris Columbus were all snapped with Quan at the ceremony. Lord Of The Rings actor Sean Astin didn't attend the ceremony but reportedly joined the others for the premiere of Quan's new movie Love Hurts, according to USA Today. At the ceremony, Dune and Marvel star Brolin also gave a speech. He said: \"I'm so honoured to be here today. It's such a wonderful story that you have. \n                  Neil Gaiman accused of sexual assault in civil lawsuits filed in US\n                 \n                  Blake Lively and Justin Baldoni's lawyers told to stop discussing cases\n                 \n                  Actor and comedian Brian Murphy dies aged 92\n                 \"I hold you in a very dear place in my heart.\" He added: \"I could not be happier for you. I know we all are, all us Goonies here - for an honour that is not only totally deserved, but celebrates all that is right in this industry. Love you, pal.\" Quan first starred in Indiana Jones And The Temple Of Doom, playing Short Round, and The Goonies, in the 80s, but after a few roles as a young adult he struggled to land anymore gigs and took a 19-year break from acting. During this he worked as a stunt choreographer and assistant director. Read more from Sky News:Actor and comedian Brian Murphy diesJoe Biden signs with Hollywood talent agencyGrammys 2025: Full list of winners He returned in 2022 in the hit mind-bending movie Everything Everywhere All At Once. During his speech, Brolin also read out a letter from Steven Spielberg. He said: \"Ke your whole life has been a dream come true, and you will be immortalised at the Grauman's Theatre which is an honour bestowed upon a very few. \"So Ke, as always, I'm proud of you for your meteoric rise as a child, and your second meteoric rise as a grown-up.\""
    },
    {
        "title": "Georgia man sentenced to nearly 500 years over dog fighting",
        "description": "A man from Dallas in Georgia has been sentenced to 475 years in prison for facilitating dog fighting and abusing animals.",
        "url": "https://news.sky.com/story/georgia-man-sentenced-to-nearly-500-years-over-dog-fighting-13302823",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-dog-fighting-georgia_6819197.jpg?20250204092808",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-02-04 09:21:00",
        "Headline": "More than 100 dogs were found on Vincent Lemark Burrell's property, lacking food, water and shelter, according to prosecutors. ",
        "Content": "A man from Dallas in Georgia has been sentenced to 475 years in prison for facilitating dog fighting and abusing animals. Vincent Lemark Burrell, 57, was given the longest possible sentence after being found guilty of 93 counts of dog fighting and 10 counts of cruelty to animals. It's the longest known sentencing involving dog fighting ever, Animal Crimes Resource Prosecutor Jessica K Rock told Sky News' US partner NBC News. The case was launched against him in November 2022, when an Amazon delivery worker reported Burrell to local police after seeing several dogs tied up with heavy chains at his property in Dallas. Police officers searched the home and found 107 dogs on the grounds with signs of abuse, prosecutors said, including some observed as underweight. They added that the grounds were lacking food, water and shelter - and many dogs were restrained with logging chains in close proximity, \"a tactic that serves to build dog aggression,\" the Paulding County district attorney's office said in a statement last week, after the sentencing. Another group of dogs among the 107 at the property was found in a basement living with urine and faeces on the ground, the sheriff's office said. Read more from Sky News:Mountain in New Zealand is now legally a personChina hits back after new US tariffs take effect The DA's office said evidence was found at Burrell's property linking him to dog fighting, including a treadmill designed for dogs, a breeding stand, a break stick \"used to pry open the jaws of a dog during a fight,\" documents linked to other \"known dog fighters,\" a first aid kit for injured dogs, veterinarian-only medication and sales contracts for dogs. A vet examined the dogs and found some with removed teeth and scars from fighting, prosecutors said. The dogs were seized by authorities and ultimately taken in by the non-profit organisation Forlorn Animal Rescue, NBC News reported, citing its affiliate WXIA of Atlanta. Dog fighting 'still prevalent' After the sentencing, US authorities said they hoped Burrell's hefty sentencing would raise awareness of dog fighting. \"The average person doesn't realise how prevalent dog fighting still is,\" said Paulding County's chief marshal Trevor Hess. \"But the more we talk about this issue and educate the public, the more people will understand that dogs aren't 'just' property, and you cannot treat them in this way.\" Prosecutor Jessica K Rock said: \"Dog fighters operate hidden in plain sight, in an organised, criminal enterprise that includes breeding and selling dogs, training dogs, hosting and spectating violent fights, and fighting dogs to the point of exhaustion or serious injury.\" \"It is a despicable activity that is incredibly cruel to the dogs,\" she continued, adding she hoped one day the crime would be \"eradicated\"."
    },
    {
        "title": "Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation",
        "description": "The Treasury Select Committee has sent a formal notice to HM Revenue & Customs demanding answers to critical questions about how it has been enforcing trade sanctions on Russia, following a Sky News investigation into the government department.",
        "url": "https://news.sky.com/story/treasury-committee-demands-hmrc-answers-on-sanctions-regime-after-sky-news-investigation-13302953",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-treasury-committee_6727393.jpg?20250204141405",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-02-04 12:38:00",
        "Headline": "HMRC does not name sanctioned firms and says it has no idea how many investigations it has into sanction-breaking. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n The Treasury Select Committee has sent a formal notice to HM Revenue & Customs demanding answers to critical questions about how it has been enforcing trade sanctions on Russia, following a Sky News investigation into the government department. Last month Sky News reported that while HMRC had issued six fines in relation to sanction-breaking since 2022, it would not name the firms sanctioned or provide any further detail on what they did wrong. HMRC also admitted it had no idea how many investigations it was currently carrying out into sanction-breaking. The admissions raised questions about the robustness of Britain's trade sanctions regime, described by government ministers as the toughest in British history. Money blog: Now we know why Guinness tastes worse in the UK   While the UK has introduced rules preventing the export of certain goods to Russia, banned items are still flowing into the country via third countries in the Caucasus and Central Asia. Some suspect that part of the reason these flows continue is that HMRC is not enforcing the rules as robustly as it could be. Following Sky News' investigation, the chair of the Treasury Select Committee (TSC), Dame Meg Hiller, has written a letter to the chief executive of HMRC, Sir Jim Harra, with 10 questions about HMRC's conduct in the enforcement of sanctions. \n                  Pro-Russian paramilitary leader killed in Moscow bomb blast\n                 \n                  US wants Ukraine to hold elections following potential ceasefire, Trump envoy says\n                 \n                  Second ship seized in Baltic Sea cable damage investigation\n                  Among the questions, the TSC chair asks: \"Why doesn't HMRC publish information on breaches in sanctions in a similar way to the Office for Financial Sanctions Implementation (OFSI), which gives the details of the company, how it breached sanctions and the amount of penalty issued?\" Many other countries around the world - most notably the United States - routinely \"name and shame\" those who break sanctions, in part as a deterrent and in part to inform other businesses about what it takes to break the rules. But HMRC instead protects the privacy of those who break sanctions. The TSC has been scrutinising the sanctions regime in recent months, examining loopholes in the legislation and its enforcement. HMRC has been asked to respond to the letter by 17 February."
    },
    {
        "title": "Britain could do slimmed down trade deal with US within months, says former minister",
        "description": "Britain could do a slimmed down trade deal with the United States within months, the last politician to oversee negotiations with Donald Trump's administration over a UK-US agreement has told Sky News.",
        "url": "https://news.sky.com/story/britain-could-do-slimmed-down-trade-deal-with-us-within-months-says-former-minister-13303143",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-white-house_6815997.jpg?20250131230434",
        "type": "Business",
        "Author": "Sam Coates",
        "Date Published": "2025-02-04 18:12:00",
        "Headline": "Britain was negotiating a full Free Trade Agreement with Mr Trump during his first presidency, but this was junked by his successor President Biden.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Britain could do a slimmed down trade deal with the United States within months, the last politician to oversee negotiations with Donald Trump's administration over a UK-US agreement has told Sky News. Last night Sky News revealed that leading members of the Trump administration believe a trade deal with the UK could be sealed in a matter of months. Mr Trump has singled out Keir Starmer for praise and suggested that he wanted to change UK trade policy. Politics latest: Billions to be spent to increase state pension Britain was negotiating a full Free Trade Agreement with Mr Trump during his first presidency, but this was junked by his successor President Biden. The negotiations were overseen by then Tory trade secretary, Anne-Marie Trevelyan, who told Sky News that a deal could even be struck with the US before the EU-UK Trade and Cooperation Agreement is concluded. Ms Trevelyan said about half the work on a deal had already been concluded under the Boris Johnson administration. \n                  Politics latest: Billions to be spent to increase state pension - as PM warned against major Trump trade deal\n                 \n                  Tougher laws on unlicensed drivers to be considered after Sky News report\n                 \n                  Labour MPs set up new group to focus on threat of Reform UK\n                 \"I was the trade secretary just at the end of the first Trump administration, and we had already, been moving discussions, probably about halfway there. In terms of the trade negotiations.\" She said that the US can work faster than the EU on trade negotiations, and that might be concluded first. \"I think absolutely that's possible. I think the challenge with anything with the EU is you're dealing with, you know, multiple countries who all have to agree. And the challenge with any trade deal, which is why TCA took a long time to negotiate to the level that we got, is that everyone's pulling a little bit differently.\" On President Trump's style, she said: \"I think, realistically, because of the way Trump works, which is transactional but very determined, he'll take decisions, big decisions.\" The negotiation between the UK and the US began in May 2020 when Liz Truss was trade secretary and lasted until the end of Mr Trump's time in office in January 2021. Ms Trevelyan was trade secretary from September 2021 to September 2022. Up to five chapters - areas of trade negotiation - had been completed but the most difficult, agriculture and trade, had not been sorted. The United States has different food standards to the UK and EU, and is not currently able to sell into our market - which has previously been a big ask. Trump latest: EU would respond 'within an hour' to Trump tariffs However Ms Trevelyan said that omitting agriculture from the deal could get it over the line, providing there were sufficient other wins for the US. She said that the UK and US trade deal could make a big difference. \"A UK-US trade move will be a big, punchy, broad ranging trade deal,\" she said. 👉Listen to Politics At Jack And Sam's on your podcast app👈 \"I think what's important is what are we good at? What's the UK good at? What do we want to be able to do more? Our financial services, second only in the world to the US, are fantastic. \"(You look for) lots of things where we don't crash into each other. Really important for success in a trade deal is where you get that complementarity. \"What is it that the US has that they want to sell to us that, you know, isn't of concern to us? So some of the conversations with California around some of their nuts and properties like that, there's all sorts of different pulls and pushes that you work together as a whole.\" She went on: \"It'll be everything from financial services through to whisky and everything in between. The market is enormous, important issues around metals, steel and aluminium are really important ones. So, we had got caught, when I had just come into post, actually an EU tariff last time round that President Trump was putting tariffs on people around steel aluminium.\" But Lord Kim Darroch, the UK's ambassador to the US during Donald Trump's first presidency, said he was sceptical about a UK-US trade deal. Speaking to Sophy Ridge on the Politics Hub, Lord Darroch said the UK's problems stem from the fact that food and agriculture standards are higher here than they are in the US. He explained that there are \"two big regulatory schemes\" in the world, one being the EU's and the other being America's. \"At the moment, we are still basically aligned with the EU,\" he said. \"One of the objectives of the Americans would be to pull us into their regulatory system,\" he adds, and - given we do more far more trade with Europe than America - \"I don't see that being in the national interest.\""
    },
    {
        "title": "Workforce data shake-up could see people obliged to take part in ONS Labour Force Survey",
        "description": "The shake-up of official employment data, used to help set interest rates and other crucial public policy, could see members of the public obliged to complete the survey to help bolster accuracy.",
        "url": "https://news.sky.com/story/ons-labour-force-survey-workforce-data-shake-up-could-see-people-obliged-to-take-part-13303006",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-jobcentre-job-centre_6757997.jpg?20241125213751",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-02-04 14:12:00",
        "Headline": "The country's national statistician tells MPs the ONS needs more money and access to government data streams as part of efforts to bolster the quality of its core reporting.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n The shake-up of official employment data, used to help set interest rates and other crucial public policy, could see members of the public obliged to complete the survey to help bolster accuracy. The country's top number cruncher, Sir Ian Diamond, told a committee of MPs that the Office for National Statistics (ONS) was still exploring ways of improving the quality of the data within the quarterly Labour Force Survey (LFS). The ONS national statistician said he was \"super hopeful\" that an improved survey would be available from early 2026, rather than in 2027, as the body had feared last year. Its accuracy has been called into question since the COVID-19 pandemic when participation rates fell sharply. Trade war latest: China hits back at Trump People are selected at random to take part in the survey, which is used to calculate key measures such as the UK's unemployment rate and wage growth. This data is crucial for government and bodies such as the Bank of England, which needs the information to determine inflationary pressures in the UK economy. \n                  UK growth outlook downgraded by leading economic forecasters in latest blow to Chancellor Rachel Reeves\n                 \n                  Can Love Island help Rachel Reeves?\n                 \n                  The big points in the chancellor's speech that won't get the headlines\n                 The Bank has been among decisionmakers to have expressed frustration with the quality of the LFS data, which deteriorated just as the world was forced to deal with a series of economic shocks. It has been a tough few years for the Bank to navigate, with interest rates rising sharply from December 2021 to cover off price increases in the economy linked to the end of the pandemic. The subsequent energy-led cost of living crisis, mostly a consequence of Russia's invasion of Ukraine, has evolved since. The data problem has forced economists to look towards private sector studies instead to help better inform policy. The Resolution Foundation thinktank has previously claimed that almost one million more people are in work than the LFS has shown. Currently, participants must be aged 16 or over and are randomly selected from a private households and other accommodation including student halls to be interviewed. The ONS is hoping the improvements will offer bigger sample sizes, shorter questionnaires and less bias towards particular types of respondents. Read more from Sky News:Why China has not retaliated more in US trade spatMillions face bumper council tax rise Sir Ian told the Treasury Select Committee he was \"encouraged\" by the progress being made in transforming the survey but said that a lack of resources and £34m of recent cuts were hampering its work more generally. On the possibility of the survey being compulsory for those selected, as happens in Australia, he said the question was \"a fine balance but one that could help potentially with some surveys\". \"We're finding very, very, very high levels of flat refusal,\" he explained, adding that it was currently taking his colleagues twice the level of effort to get interviews for the monthly LFS compared with before the pandemic. When asked if the ONS needed more cash and better data linkage with government departments to improve its overall work, Sir Ian simply said: \"Yes.\""
    },
    {
        "title": "Money Problem: 'My boss is taking a cut of our tips because they worked on the shift - is this legal?'",
        "description": "Every week in our Money blog, we answer questions about your financial problems or consumer disputes. This week, a reader asked if their boss was allowed to take a cut of their tips. ",
        "url": "https://news.sky.com/story/my-boss-is-taking-a-cut-of-our-tips-because-they-worked-on-the-shift-is-this-legal-13303071",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-money-blog-tips_6819097.jpg?20250204065620",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-04 15:38:00",
        "Headline": "A reader called Elliott got in touch with our Money team after his boss took a cut of the tips earned by staff on a shift. We talk him through what the law says about this. ",
        "Content": "Every week in our Money blog, we answer questions about your financial problems or consumer disputes. This week, a reader asked if their boss was allowed to take a cut of their tips.  Elliott asked: \"Can my boss take a cut of the tips that are shared between the staff if the boss works the shift?\" We spoke to Caroline Walker, managing director at Cavendish Employment Law, to get her thoughts. First, it's not quite clear if the boss in question is the owner of the company or an employee themselves. Caroline says if the manager is an employee and was part of service on a particular shift, it would be reasonable for the tips to be shared with them. But she adds that if they took tips not related to their service, or against the specific policy of the business, there would be grounds to raise a formal grievance. Caroline breaks down here what UK employment law says about this topic:  \n                  Trump latest: President says he wants US to take ownership of Gaza so he can level it for 'jobs and housing'\n                 \n                  Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation\n                 \n                  Britain could do slimmed down trade deal with US within months, says former minister\n                 \"Under the Employment (Allocation of Tips) Act 2023 that came in on 1 October, employers have to pass on tips to workers. This legislation prevents employers from keeping any part of the tips for their costs and aims to ensure hospitality workers receive 100% of tips, gratuities and service charges,\" she says. \"Prior to this legislation, employers could take 20-30% to cover their costs of the business, including tax, breakages or even staff parties. They also had no rules on when the payments had to be made or any obligation to be transparent over the calculation of the payments.\" Caroline describes the new legislation as a \"welcome change\". The legislation specifically says that, as of the start of October, the employer has to ensure: If the employer fails to provide these records, the workers can bring claims in the employment tribunal, Caroline says.  \"If the reader believes the employer has previously failed to account for their tips, or particularly if they have failed to comply with these obligations since 1 October, they should submit a formal grievance to the employer setting out their concerns, which the employer will be obliged to investigate and respond to,\" she says. Read more from this series:'My workplace is bringing in new clock-in system to pay us by the minute''I waited months for a delivery - then they said I needed to pay another £49 to get it''Should I top up my national insurance?' \"If their response is either not forthcoming, or confirms they have breached these obligations, they will be able to present a claim in the employment tribunal. \"By submitting the formal grievance, the reader will be able to establish whether any tips have been retained and they can include a request for the written confirmation referred to above. \"It is possible, particularly if this is a small employer, that they may not be aware of their obligations and this will provide them with an opportunity to become aware of these obligations.\" This feature is not intended as financial advice - the aim is to give an overview of the things you should think about. Submit your dilemma or consumer dispute via:"
    },
    {
        "title": "Why China has not retaliated more in Donald Trump trade spat",
        "description": "China has, as expected, hit back at Donald Trump's imposition of a 10% tariff on its exports to the United States.",
        "url": "https://news.sky.com/story/why-china-has-not-retaliated-more-in-donald-trump-trade-spat-13302564",
        "image_url": "https://e3.365dm.com/24/11/1920x1080/skynews-donald-trump-us_6759716.jpg?20241127220144",
        "type": "Business",
        "Author": "Ian King",
        "Date Published": "2025-02-04 10:16:00",
        "Headline": "Sky's Ian King writes there are reasons why China has been spared harsher tariffs by the White House as the Trump administration imposes additional import charges on goods from China from today.",
        "Content": "\n          Business presenter\n              @iankingsky\n China has, as expected, hit back at Donald Trump's imposition of a 10% tariff on its exports to the United States. Beijing has slapped levies of between 10-15% on a range of energy products that imports from the US. But what has surprised observers - particularly when Mr Trump kicked off the trade war over the weekend - has been the president's comparatively lenient treatment of China and, moreover, Beijing's calm response. While America's two closest neighbours, Canada and Mexico, were hit with 25% tariffs (falling to 10% for Canadian energy exports) - since put on ice - China was merely hit with a 10% levy. Money blog: Now we know why Guinness tastes worse in Britain That struck many observers as curious since China is regarded as a bigger trade adversary by the US than Mexico and Canada, with the latter traditionally seen as a close friend to the US, particularly through the pair's involvement in the 'Five Eyes' security alliance along with Australia, New Zealand and the UK. The big question raised by this is what motivated Mr Trump to do this. \n                  Trump latest: President says he wants US to take ownership of Gaza so he can level it for 'jobs and housing'\n                 \n                  Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation\n                 \n                  Britain could do slimmed down trade deal with US within months, says former minister\n                 The thinking is that the president was trying to bring China to the negotiating table and that, by initially hitting a close ally like Canada harder, he was trying to send a message to China's leaders as to what they might face further down the line. That impression was reinforced by Mr Trump's overnight description of his 10% tariff on China as an \"opening salvo\". Why is China so calm? That is not the only curiosity concerning this affair. The other is the relatively calm response from Beijing. While Canada immediately responded with retaliatory measures and Mexico indicated that it would, China merely murmured in the first instance about taking \"necessary countermeasures\" and indicated that it would raise a complaint about the US with the World Trade Organisation. Since then, Beijing has of course hit back with tariffs of its own on US energy imports, as well as launching an antitrust investigation into Google and adding the parent company of Tommy Hilfiger and Calvin Klein on a blacklist of \"unreliable entities\". That gives Chinese president Xi Jinping something to take back off the table if, as expected, he speaks to Mr Trump in coming days as the pair seek to de-escalate this row. But it all feels relatively restrained and raises the question of why China has responded in this way. There is certainly a view in Beijing that, with Mr Trump's first moves, China got off rather lightly compared with the Canadians and Mexicans. That sanguine response may also indicate that Beijing knows it has other weapons it can deploy other than retaliatory measures. Cards in China's back pocket For a start, China owns $769bn worth of US Treasury bonds. Dumping some of those aggressively - while hurting the Chinese - would push up America's implied borrowing costs. Alternatively, Beijing could allow its currency, the renminbi, to weaken on the foreign exchange markets, just as it did during Mr Trump's first term of office.  Either way, Mr Trump's latest measures are unlikely to change the way Chinese businesses operate, particularly the country's manufacturers. They have become accustomed over several years, dating back to Mr Trump's first term, to aggression from the US. They have adapted the way they do business accordingly, for example by shipping a lot of their exports to the US via third countries, most notably Vietnam. Chinese businesses relieved Even Chinese companies specifically targeted by Mr Trump - the e-commerce giants Temu and Shein - may not be too badly affected. They were both singled out as the president closed the so-called \"de minimis\" loophole, dating back to 1938, which allows goods worth less than $800 to be sent directly to US consumers without incurring import duties or rigorous customs inspections. Read more:What's going on with Trump and tariffs?How UK finds itself in a strong position to avoid Trump tariffs This has been a constant thorn in the side of US retailers and its removal helps explain why, for example, shares of Walmart were on Monday spared the spanking meted out to other US stocks. Yet Shein and Temu are said to be taking the news calmly. They may even be calculating that this is a short-term squall that will soon blow over - or calculating that, such is the enormity of their buying power and supply chains, they can simply ship inventory elsewhere in the meantime or even just warehouse it. It is also worth noting that Shein, having been banned by India in 2020, has just begun selling in the country again. Overall, then, Chinese businesses have reacted with relief to what has happened. They know it could have been worse. It explains why, even though the Chinese economy is presently misfiring, the authorities in Beijing have reacted relatively calmly to what Mr Trump has done."
    },
    {
        "title": "CurrentBody owner plots £350m London stock market listing",
        "description": "The owner of CurrentBody, a brand of beauty technology used by celebrities such as Kim Kardashian and Serena Williams, is plotting a &#163;350m flotation that could deliver a boost to the flagging London stock market.",
        "url": "https://news.sky.com/story/currentbody-owner-plots-163350m-london-stock-market-listing-13302965",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-currentbody-current_6819394.jpg?20250204131223",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-04 13:05:00",
        "Headline": "The Beauty Tech Group, which also owns the ZIIP Beauty and Tria Laser brands, is working with Berenberg on plans for a flotation on the main London market later this year, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of CurrentBody, a brand of beauty technology used by celebrities such as Kim Kardashian and Serena Williams, is plotting a £350m flotation that could deliver a boost to the flagging London stock market. Sky News has learnt that The Beauty Tech Group, which is run by co-founder and chief executive Laurence Newman, is working with investment bankers on a public listing of its shares that could take place later this year. City sources said on Tuesday that Berenberg had been appointed to steer the company through an initial public offering (IPO). Based in Manchester, The Beauty Tech Group comprises three brands: CurrentBody, ZIIP Beauty and Tria Laser. Trade war latest: China hits back at Trump The latter two were acquired by the parent company in 2023 and 2024 respectively. Under plans being formulated by The Beauty Tech Group and its advisers, a flotation would take plans on the main London market at some point in 2025. \n                  Trump latest: President says he wants US to take ownership of Gaza so he can level it for 'jobs and housing'\n                 \n                  Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation\n                 \n                  Britain could do slimmed down trade deal with US within months, says former minister\n                 Details, include the size of any primary share sale, have yet to be finalised, insiders said. The company is owned by its management team - led by Mr Newman but also including co-founder and chief technology officer Andrew Showman and finance chief Sam Glynn - and a group of high net worth individuals. It describes itself as a global industry leader in home-use beauty technology, and is focused on products which use LED, radio frequency, microcurrent and laser treatments. A successful stock market debut would represent a positive development for the London Stock Exchange during a period when searching questions are being posed about its attractiveness as a listing destination. A string of companies have announced plans to shift their primary listings across the Atlantic, while a large number of takeovers of London-listed companies, coupled with a dearth of new listings, have compounded the sense of gloom. The Beauty Tech Group saw a substantial increase in revenue last year, with sales passing the £100m mark for the first time, up from £80m in 2023. Its revenues comprise just under a quarter from the UK and 77% internationally. Since the beginning of this year, it has been exclusively focused on own-brand sales. The beauty technology market is projected to grow from £2.7bn in global sales in 2023 at a compound annual growth rate of up to 17% until 2026, according to a report by the professional services firm PricewaterhouseCoopers. In a statement issued to Sky News, Mr Newman said: \"2024 was another significant year financially and strategically for the Group. \"We delivered revenue of over £100m and successfully acquired Tria Laser while also completing the integration of ZIIP Beauty. \"These acquisitions have diversified and increased the Group's product offering across the rapidly growing beauty tech market and, in line with our strategic ambitions, the Group is now focused exclusively on own-brand products. Read more from Sky News:Why China has not retaliated more in US trade spatMillions face bumper council tax rise \"I am pleased that the Group's strong performance through 2024 has continued into January and I am confident that 2025 will be another record year. \"As increasing international demand and the Group's operational infrastructure provide foundations for the next stage of its global growth, the Group is considering its strategic options, which includes a London IPO later this year.\" The Beauty Tech Group counts Harrods among its retail partners, while its products are also sold on more than 20 direct-to-consumer websites around the world. It recently partnered with Manchester University's dermatology department to research opportunities for advanced beauty technologies relevant to areas of consumer demand such as hair regrowth and anti-aging."
    },
    {
        "title": "Millions face council tax rise of more than 5% after government gives green light to bigger hikes",
        "description": "Millions of people face council tax hikes over normal thresholds after the government allowed six areas to boost rates above the usual 5%.",
        "url": "https://news.sky.com/story/millions-face-council-tax-rise-of-more-than-5-after-government-gives-green-light-to-bigger-hikes-13302791",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-council-tax-council-tax_6819156.jpg?20250204081128",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-02-04 07:57:00",
        "Headline": "More than two million people will be hit by increases of between 5 and 10% - with one council asking permission to boost council tax by 25%.",
        "Content": "Millions of people face council tax hikes over normal thresholds after the government allowed six areas to boost rates above the usual 5%. More than two million people will be hit by increases of between 5 and 10%. Windsor and Maidenhead Council wanted to increase council tax by 25% but the plan was blocked - instead it will go up by 9%. Newham Council will go up by the same amount, while Bradford Council will put up taxes by 10% and Birmingham, Somerset and Trafford councils will all put up rates by 7.5%. Politics latest: Labour polling slumps behind Reform Speaking to Sky News' Kay Burley, health and social care minister Karin Smyth defended the above normal increases - saying \"many more councils\" asked for permission to hike taxes, but were refused. She said the ones given the nod \"are particularly desperate\" and need the money to keep \"basic services running\". The Labour MP was quick to blame the Conservatives, saying local government was left in a \"really, really dark state\" by the previous government. In order to keep up with demands, councils are allowed to raise council tax usually by up to 5%, broken down into 3% core spending with an additional 2% for social care.\n\n At the moment, a principle exists which prevents more than a 5% increase to council tax without a referendum, mostly to protect taxpayers from excessive increases.\n\n But if a council is already in conversation with government on exceptional financial support, and if the government agrees to allow the council to raise tax above the cap as part of this, the council doesn't necessarily have to take that to a local public vote.\n\n Deputy prime minister Angela Rayner - who is also the secretary of state for local government - confirmed the move on Monday. She said the average council tax increase across the country would not surpass last year's total of 5.1%. She also said more than £69bn in central funding would be made available to regional administrators, a rise of 6.8% compared to the 2024-25 period. Close to £4bn has also been put aside to help councils with social care. Read more on politics:Reform ahead of Labour in pollStarmer reacts to Trump's tariff threatBuilder shortage challenging growth plans The Conservatives accused Labour of \"pushing the burden on to taxpayers after they promised to freeze council tax\". Shadow communities secretary Kevin Hollinrake said: \"Their Local Government Finance Settlement will mean that councils will have to raise council tax to accommodate Labour's jobs tax. \"This means that local people will pay more for less when it comes to local services, especially in rural areas which are losing the Rural Services Delivery Grant that Labour have abolished. \"The Labour Party have made false promises to local people, promising to freeze council tax while many councils will now have to raise it due to Labour's political choice to raise council tax.\" 👉Listen to Politics At Jack And Sam's on your podcast app👈 The County Councils Network, which represents 37 administrations, said they are facing pressure from the government's decisions to increase national insurance contributions for employers, and increases to minimum wage. Barry Lewis, the network's finance spokesperson said: \"More than four in five CCN members say they are in a worse position than before the autumn budget and this finance settlement, and one-third say their service reductions next year will now be severe. \"Considering there is very little fat left to cut from many of these services already, a further reduction will have a material impact on our residents.\" Ms Rayner confirmed allocations worth £502m to assist councils with the impact of increases to employer national insurance contributions."
    },
    {
        "title": "Billionaire Ratcliffe plots sale of Ineos Hygienics arm",
        "description": "Sir Jim Ratcliffe is hoisting a 'for sale' sign over the business he set up during the COVID-19 crisis to distribute hand sanitisers to medical professionals and consumers.",
        "url": "https://news.sky.com/story/billionaire-ratcliffe-plots-sale-of-ineos-hygienics-arm-13302883",
        "image_url": "https://e3.365dm.com/23/12/1920x1080/skynews-jim-ratcliffe-ineos_6404772.jpg?20231226205319",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-02-04 11:17:00",
        "Headline": "The joint-owner of Manchester United is working with Interpath on the sale of a business he established during the pandemic to distribute hand sanitisers to NHS workers, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Sir Jim Ratcliffe is hoisting a 'for sale' sign over the business he set up during the COVID-19 crisis to distribute hand sanitisers to medical professionals and consumers. Sky News has learnt that the billionaire petrochemicals tycoon has instructed advisers to launch an auction of Ineos Hygienics, which was created during the pandemic, establishing six factories within ten days to address a global shortage of sanitising products. City sources said on Tuesday that Ineos was working with Interpath, the advisory firm, on the sale. The financial performance of Ineos Hygienics was unclear, although insiders said it was being run as a conventional sale process, rather than on a distressed basis. Money blog: Now we know why Guinness tastes worse in the UK Ineos has sought to promote the sanitisers arm by linking it to its portfolio of sporting properties, which includes a stake in the Mercedes Formula One team and a partnership with the New Zealand All Blacks. In 2021, the conglomerate struck distribution deals to sell its products through Sainsbury's supermarkets and Ocado, the online grocer. \n                  Manchester United sack manager and announce club's former striker as interim replacement\n                 \n                  Sir Jim Ratcliffe 'emails Manchester United staff about disgraceful untidiness'\n                 \n                  The challenges facing Sir Jim Ratcliffe at Manchester United - and how he plans to deal with them\n                 The proposed sale marks a comparatively rare disposal for the acquisitive Monaco-based billionaire. Ineos did not respond to a number of emailed requests to its media relations department but says on its website: \"As Europe's largest producer of high-purity synthetic ethanol, INEOS was in a unique position to respond to the global shortage of hand sanitiser when the pandemic struck in March 2020. \"Manoeuvring quickly to establish six new factories across the UK, US and Europe in just ten days, the company has distributed millions of bottles of hospital grade hand sanitiser to thousands of NHS, medical institutions and front-line health care workers around the world, for free. \"INEOS Hygienics is the official supplier of hand sanitation products to international sporting teams including Mercedes-AMG Petronas F1 Team, Tottenham Hotspur FC, INEOS Grenadiers and INEOS TEAM UK, helping to ensure that teams can continue to compete safely and with confidence.\" Interpath's role in managing the sale of Ineos Hygienics is unsurprising given its increasingly close ties to Sir Jim. The consulting firm was drafted in by the tycoon after he acquired a large minority stake in Manchester United Football Club, a deal which completed last year. Interpath has advised on a wide range of cost-cutting measures at the Premier League club, some of which have been adopted with controversial vigour. Hundreds of jobs have been lost, with further reductions to its workforce regarded as inevitable. Away from Interpath's work with the Red Devils, which has now concluded, Sir Jim has also moved to slash costs in areas of the club which were previously regarded as untouchable. These include funding provided to an association of former players and Manchester United's charitable foundation, which Sky News reported in late December was braced for substantial cuts in contributions from the club. Sir Jim's conglomerate spans a vast range of businesses in areas such as petrochemicals, energy trading and shipping. It is also building a 4x4 vehicle called the Ineos Grenadier and owns the fashion brand Belstaff. In sport, he has played a pivotal role in funding Britain's recent challenges for the America's Cup, although his partnership with Sir Ben Ainslie is reported to be descending into legal acrimony. Ineos also now has a major presence in cycling."
    },
    {
        "title": "Britain could do slimmed down trade deal with US within months, says former minister",
        "description": "Britain could do a slimmed down trade deal with the United States within months, the last politician to oversee negotiations with Donald Trump's administration over a UK-US agreement has told Sky News.",
        "url": "https://news.sky.com/story/britain-could-do-slimmed-down-trade-deal-with-us-within-months-says-former-minister-13303143",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-donald-trump-white-house_6815997.jpg?20250131230434",
        "type": "Politics",
        "Author": "Sam Coates",
        "Date Published": "2025-02-04 18:12:00",
        "Headline": "Britain was negotiating a full Free Trade Agreement with Mr Trump during his first presidency, but this was junked by his successor President Biden.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Britain could do a slimmed down trade deal with the United States within months, the last politician to oversee negotiations with Donald Trump's administration over a UK-US agreement has told Sky News. Last night Sky News revealed that leading members of the Trump administration believe a trade deal with the UK could be sealed in a matter of months. Mr Trump has singled out Keir Starmer for praise and suggested that he wanted to change UK trade policy. Politics latest: Billions to be spent to increase state pension Britain was negotiating a full Free Trade Agreement with Mr Trump during his first presidency, but this was junked by his successor President Biden. The negotiations were overseen by then Tory trade secretary, Anne-Marie Trevelyan, who told Sky News that a deal could even be struck with the US before the EU-UK Trade and Cooperation Agreement is concluded. Ms Trevelyan said about half the work on a deal had already been concluded under the Boris Johnson administration. \n                  Politics latest: Billions to be spent to increase state pension - as PM warned against major Trump trade deal\n                 \n                  Tougher laws on unlicensed drivers to be considered after Sky News report\n                 \n                  Labour MPs set up new group to focus on threat of Reform UK\n                 \"I was the trade secretary just at the end of the first Trump administration, and we had already, been moving discussions, probably about halfway there. In terms of the trade negotiations.\" She said that the US can work faster than the EU on trade negotiations, and that might be concluded first. \"I think absolutely that's possible. I think the challenge with anything with the EU is you're dealing with, you know, multiple countries who all have to agree. And the challenge with any trade deal, which is why TCA took a long time to negotiate to the level that we got, is that everyone's pulling a little bit differently.\" On President Trump's style, she said: \"I think, realistically, because of the way Trump works, which is transactional but very determined, he'll take decisions, big decisions.\" The negotiation between the UK and the US began in May 2020 when Liz Truss was trade secretary and lasted until the end of Mr Trump's time in office in January 2021. Ms Trevelyan was trade secretary from September 2021 to September 2022. Up to five chapters - areas of trade negotiation - had been completed but the most difficult, agriculture and trade, had not been sorted. The United States has different food standards to the UK and EU, and is not currently able to sell into our market - which has previously been a big ask. Trump latest: EU would respond 'within an hour' to Trump tariffs However Ms Trevelyan said that omitting agriculture from the deal could get it over the line, providing there were sufficient other wins for the US. She said that the UK and US trade deal could make a big difference. \"A UK-US trade move will be a big, punchy, broad ranging trade deal,\" she said. 👉Listen to Politics At Jack And Sam's on your podcast app👈 \"I think what's important is what are we good at? What's the UK good at? What do we want to be able to do more? Our financial services, second only in the world to the US, are fantastic. \"(You look for) lots of things where we don't crash into each other. Really important for success in a trade deal is where you get that complementarity. \"What is it that the US has that they want to sell to us that, you know, isn't of concern to us? So some of the conversations with California around some of their nuts and properties like that, there's all sorts of different pulls and pushes that you work together as a whole.\" She went on: \"It'll be everything from financial services through to whisky and everything in between. The market is enormous, important issues around metals, steel and aluminium are really important ones. So, we had got caught, when I had just come into post, actually an EU tariff last time round that President Trump was putting tariffs on people around steel aluminium.\" But Lord Kim Darroch, the UK's ambassador to the US during Donald Trump's first presidency, said he was sceptical about a UK-US trade deal. Speaking to Sophy Ridge on the Politics Hub, Lord Darroch said the UK's problems stem from the fact that food and agriculture standards are higher here than they are in the US. He explained that there are \"two big regulatory schemes\" in the world, one being the EU's and the other being America's. \"At the moment, we are still basically aligned with the EU,\" he said. \"One of the objectives of the Americans would be to pull us into their regulatory system,\" he adds, and - given we do more far more trade with Europe than America - \"I don't see that being in the national interest.\""
    },
    {
        "title": "Tougher laws on unlicensed drivers to be considered after Sky News report",
        "description": "The government will look to introduce tougher laws on unlicensed drivers as part of its forthcoming road safety strategy, Sky News understands.",
        "url": "https://news.sky.com/story/tougher-laws-on-unlicensed-drivers-to-be-considered-after-sky-news-report-13303153",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-harry-driving_6818541.jpg?20250203123413",
        "type": "Politics",
        "Author": "Amanda Akass",
        "Date Published": "2025-02-04 18:30:00",
        "Headline": "The bill would make causing death while driving without a licence or insurance a specific criminal offence after previous legislation became effectively redundant.",
        "Content": "\n          Political correspondent\n              @amandaakass\n  The government will look to introduce tougher laws on unlicensed drivers as part of its forthcoming road safety strategy, Sky News understands. It comes after Sky News reported on the story of Harry Parker, who was just 14-years-old when he was hit and killed by a car on his way to his Swindon school in November 2022. The driver of the car did not have a licence, insurance, or stop at the scene. Politics latest: Billions to be spent to increase state pension  But two years after Harry's death, the Crown Prosecution Service told his parents it was dropping the charges. It said: \"We examined this case in great detail - including obtaining the advice of a forensic collision expert - and it has become clear that there is not enough evidence to demonstrate that this collision could reasonably have been avoided, and therefore that the driving was careless.\" \n                  Britain could do slimmed down trade deal with US within months, says former minister\n                 \n                  Politics latest: Billions to be spent to increase state pension - as PM warned against major Trump trade deal\n                 \n                  Labour MPs set up new group to focus on threat of Reform UK\n                 His parents' local MP, Will Stone, received permission from the Commons on Tuesday to introduce the Road Traffic (unlicensed drivers) Bill, that he referred to in his speech in the chamber as the \"Harry Parker Bill\". The bill would make causing death while driving without a licence or insurance a specific criminal offence after previous legislation became effectively redundant. Labour MP Mr Stone made a speech setting out the case for changing the law in parliament on Tuesday as part of a Ten Minute Rule Bill - a motion to seek MPs' permission to introduce a bill to make the case for a new law. \"The law in its current form is failing,\" he said. \"A person who does not hold a valid license has no business being behind the wheel of a car. And when they do so, they put lives at risk. \"I cannot bring back Harry, nor can I give Adam and Kelly the justice that they deserve. No legislation, no speech, no court ruling will ever be able to ease their pain. What we must do is ensure that no other family has to endure what they have been through. \"The Harry Parker Bill seeks to close the dangerous gaps in our legal system and impose real world consequences on those who choose to drive without a license. Those who choose to drive without a valid license will be deemed careless.\" MPs voted to progress the bill to be debated as part of the next stage of the parliamentary process. It is rare for a backbench Ten Minute Rule Bill to become legislation. But Sky News now understands the government is going to adopt the Harry Parker Bill as part of its forthcoming new Road Safety Strategy. Harry's parents, Adam and Kelly Parker, travelled to Westminster to watch the Ten Minute Rule Bill from the public gallery. \"It was a bit surreal,\" said Mr Parker. \"When he actually read it out I just started crying, I welled up. It made it very, very real, how far we're actually taking this, and it showed that people are actually really listening. It's comforting.\" There is no current national data on the number of unlicensed drivers, though past research by the Department for Transport estimated they commit 9.3% - or nearly 1 in 10 - of all motoring offences. It was thought there could be as many as 470,000 on the roads. In 2006, the Labour government introduced a new offence of causing death while driving without a licence or insurance, punishable by up to two years in prison. But in 2013 the Supreme Court ruled that, due to the way the legislation was worded, prosecutors still had to prove the driving was at fault - thus rendering the new law fairly redundant, as a driver could then be charged by careless or dangerous driving. The judges were concerned about otherwise faultless unlicensed drivers being charged if a drunk pedestrian fell into the road in front of them, or if someone attempted suicide by jumping out into the road. The Department of Transport said: \"Every death on our roads is a tragedy and our thoughts remain with the family and friends of Harry Parker. \"The government takes road safety seriously, and we are committed to reducing the number of those killed and injured on our roads.\""
    },
    {
        "title": "Labour MPs set up new group to focus on threat of Reform UK",
        "description": "Labour MPs have set up a new pressure group to focus on the threat of Reform UK's rising popularity.",
        "url": "https://news.sky.com/story/labour-mps-set-up-new-group-to-focus-on-threat-of-reform-uk-13303209",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-nigel-farage-kemi-badenoch_6815940.jpg?20250203173612",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-02-04 20:49:00",
        "Headline": "News of the group comes after a YouGov surfor Sky News put Nigel Farage's party ahead of Labour in the polls for the first time. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n Labour MPs have set up a new pressure group to focus on the threat of Reform UK's rising popularity. The informal cohort is drawn from the 89 constituencies where Nigel Farage's party came second to Labour at the July General Election. Politics latest: Billions to be spent to increase state pension One of the MP's involved told Sky News it is an \"important signal of where things are headed\" and the members will shout about the need to do more on migration and for tangible local delivery. \"We're a fearless bunch,\" the MP said, adding the group were not afraid to \"call a spade a spade\". Some Labour MPs are worried about the government's communication strategy and fear positive things ministers are doing - like nationalising the railways and the new deal for working people - are not cutting through. The group is expected to focus on working together to get on top of Reform's threat rather than express active unhappiness with Sir Keir Starmer. \n                  Reform UK tops landmark poll for first time\n                 \n                  Nigel Farage compares Reform polling with Donald Trump election victory\n                 \n                  Could we be about to witness a seismic political shift in Wales? \n                 According to The Guardian, Downing Street has dispatched data and strategy experts to advise MPs on the sort of messages that are resonating with Reform-minded voters. A Labour Party source said: \"Groups of MPs meet all the time about lots of different issues. \"Labour MPs are rightly concerned about Nigel Farage's plans to make people pay to access NHS services and will carry on taking the fight to them and other opposition parties in parliament and at the ballot box.\" Mr Farage said recently that he is \"open to anything\" when it comes to the NHS and he is interested in the model of the French healthcare system \"where you pay in to effectively an insurance scheme\". Many Labour MPs, including health secretary Wes Streeting, have seized on the comments to draw dividing lines between Labour and Reform. While Reform's rise hit the Tories the most at the last general election, multiple polls suggest there is now a real threat to Sir Keir Starmer, despite his landslide victory just six months ago. Read More:Millions face council tax rise of more than 5% Starmer says it's 'early days' after Trump tariff threat A YouGov poll for Sky News on Monday showed Reform UK in the lead for the first time on 25%, with Labour pushed into second on 24% and the Tories on 21%. Pollsters stressed Reform's lead was \"within the margin of error\". However it comes after multiple other polls suggested Mr Farage's favourability rating is on the rise while Sir Keir Starmer's has plummeted. Many experts see change as the result of a collapse in the belief that the mainstream political parties can improve the lives of ordinary people. The first major test for Reform will come at the local elections in May, while the party is also hoping to make gains at the Welsh parliament elections next year. "
    },
    {
        "title": "Treasury Committee demands HMRC answers on sanctions regime after Sky News investigation",
        "description": "The Treasury Select Committee has sent a formal notice to HM Revenue & Customs demanding answers to critical questions about how it has been enforcing trade sanctions on Russia, following a Sky News investigation into the government department.",
        "url": "https://news.sky.com/story/treasury-committee-demands-hmrc-answers-on-sanctions-regime-after-sky-news-investigation-13302953",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-treasury-committee_6727393.jpg?20250204141405",
        "type": "Politics",
        "Author": "Ed Conway",
        "Date Published": "2025-02-04 12:38:00",
        "Headline": "HMRC does not name sanctioned firms and says it has no idea how many investigations it has into sanction-breaking. ",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n The Treasury Select Committee has sent a formal notice to HM Revenue & Customs demanding answers to critical questions about how it has been enforcing trade sanctions on Russia, following a Sky News investigation into the government department. Last month Sky News reported that while HMRC had issued six fines in relation to sanction-breaking since 2022, it would not name the firms sanctioned or provide any further detail on what they did wrong. HMRC also admitted it had no idea how many investigations it was currently carrying out into sanction-breaking. The admissions raised questions about the robustness of Britain's trade sanctions regime, described by government ministers as the toughest in British history. Money blog: Now we know why Guinness tastes worse in the UK   While the UK has introduced rules preventing the export of certain goods to Russia, banned items are still flowing into the country via third countries in the Caucasus and Central Asia. Some suspect that part of the reason these flows continue is that HMRC is not enforcing the rules as robustly as it could be. Following Sky News' investigation, the chair of the Treasury Select Committee (TSC), Dame Meg Hiller, has written a letter to the chief executive of HMRC, Sir Jim Harra, with 10 questions about HMRC's conduct in the enforcement of sanctions. \n                  Pro-Russian paramilitary leader killed in Moscow bomb blast\n                 \n                  US wants Ukraine to hold elections following potential ceasefire, Trump envoy says\n                 \n                  Second ship seized in Baltic Sea cable damage investigation\n                  Among the questions, the TSC chair asks: \"Why doesn't HMRC publish information on breaches in sanctions in a similar way to the Office for Financial Sanctions Implementation (OFSI), which gives the details of the company, how it breached sanctions and the amount of penalty issued?\" Many other countries around the world - most notably the United States - routinely \"name and shame\" those who break sanctions, in part as a deterrent and in part to inform other businesses about what it takes to break the rules. But HMRC instead protects the privacy of those who break sanctions. The TSC has been scrutinising the sanctions regime in recent months, examining loopholes in the legislation and its enforcement. HMRC has been asked to respond to the letter by 17 February."
    },
    {
        "title": "Millions face council tax rise of more than 5% after government gives green light to bigger hikes",
        "description": "Millions of people face council tax hikes over normal thresholds after the government allowed six areas to boost rates above the usual 5%.",
        "url": "https://news.sky.com/story/millions-face-council-tax-rise-of-more-than-5-after-government-gives-green-light-to-bigger-hikes-13302791",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-council-tax-council-tax_6819156.jpg?20250204081128",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-02-04 07:57:00",
        "Headline": "More than two million people will be hit by increases of between 5 and 10% - with one council asking permission to boost council tax by 25%.",
        "Content": "Millions of people face council tax hikes over normal thresholds after the government allowed six areas to boost rates above the usual 5%. More than two million people will be hit by increases of between 5 and 10%. Windsor and Maidenhead Council wanted to increase council tax by 25% but the plan was blocked - instead it will go up by 9%. Newham Council will go up by the same amount, while Bradford Council will put up taxes by 10% and Birmingham, Somerset and Trafford councils will all put up rates by 7.5%. Politics latest: Labour polling slumps behind Reform Speaking to Sky News' Kay Burley, health and social care minister Karin Smyth defended the above normal increases - saying \"many more councils\" asked for permission to hike taxes, but were refused. She said the ones given the nod \"are particularly desperate\" and need the money to keep \"basic services running\". The Labour MP was quick to blame the Conservatives, saying local government was left in a \"really, really dark state\" by the previous government. In order to keep up with demands, councils are allowed to raise council tax usually by up to 5%, broken down into 3% core spending with an additional 2% for social care.\n\n At the moment, a principle exists which prevents more than a 5% increase to council tax without a referendum, mostly to protect taxpayers from excessive increases.\n\n But if a council is already in conversation with government on exceptional financial support, and if the government agrees to allow the council to raise tax above the cap as part of this, the council doesn't necessarily have to take that to a local public vote.\n\n Deputy prime minister Angela Rayner - who is also the secretary of state for local government - confirmed the move on Monday. She said the average council tax increase across the country would not surpass last year's total of 5.1%. She also said more than £69bn in central funding would be made available to regional administrators, a rise of 6.8% compared to the 2024-25 period. Close to £4bn has also been put aside to help councils with social care. Read more on politics:Reform ahead of Labour in pollStarmer reacts to Trump's tariff threatBuilder shortage challenging growth plans The Conservatives accused Labour of \"pushing the burden on to taxpayers after they promised to freeze council tax\". Shadow communities secretary Kevin Hollinrake said: \"Their Local Government Finance Settlement will mean that councils will have to raise council tax to accommodate Labour's jobs tax. \"This means that local people will pay more for less when it comes to local services, especially in rural areas which are losing the Rural Services Delivery Grant that Labour have abolished. \"The Labour Party have made false promises to local people, promising to freeze council tax while many councils will now have to raise it due to Labour's political choice to raise council tax.\" 👉Listen to Politics At Jack And Sam's on your podcast app👈 The County Councils Network, which represents 37 administrations, said they are facing pressure from the government's decisions to increase national insurance contributions for employers, and increases to minimum wage. Barry Lewis, the network's finance spokesperson said: \"More than four in five CCN members say they are in a worse position than before the autumn budget and this finance settlement, and one-third say their service reductions next year will now be severe. \"Considering there is very little fat left to cut from many of these services already, a further reduction will have a material impact on our residents.\" Ms Rayner confirmed allocations worth £502m to assist councils with the impact of increases to employer national insurance contributions."
    },
    {
        "title": "Things really do seem better in the morning, study suggests",
        "description": "Things, generally, \"do seem better in the morning\" - that is according to scientists who suggest the earlier hours of the day are when most feel at their best.",
        "url": "https://news.sky.com/story/things-really-do-seem-better-in-the-morning-study-suggests-13302975",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-morning-alarm_6819469.jpg?20250204141112",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-04 23:30:00",
        "Headline": "Research using the University College London (UCL) COVID-19 Social Study found people also generally feel happier in the morning than they do at night..",
        "Content": "Things, generally, \"do seem better in the morning\" - that is according to scientists who suggest the earlier hours of the day are when most feel at their best. Research using the University College London (UCL) COVID-19 Social Study found people also widely feel happier in the summertime than they do during the winter months. Using survey data from 49,218 adults between March 2020 and March 2022, the researchers found people generally woke up \"feeling best\" but were \"feeling worst\" by midnight. Dr Feifei Bu, from UCL's department of behavioural science and health, said: \"Our findings suggest that on average, people's mental health and wellbeing are better in the morning and worst at midnight.\" And writing in the journal BMJ Mental Health, the team added: \"Generally, things do seem better in the morning.\" In the study, people were asked questions like: \"In the past week, how happy did you feel?\", \"How satisfied have you been with your life?\", and \"To what extent have you felt the things you are doing in your life are worthwhile?\" Taking into account factors such as age, health conditions and whether people worked, the results showed that happiness, life satisfaction, and worthwhile ratings were all higher on Mondays and Fridays than on Sundays. Happiness was also higher on Tuesdays, but there was no evidence that loneliness differed across days of the week. The researchers also suggested the changes in mental health and wellbeing across the day could be explained by physiological changes associated with the body clock. \"For example, cortisol [a hormone that regulates mood, motivation and fear] peaks shortly after waking and reaches its lowest levels around bedtime,\" they noted. Read more from Sky News:Men urged to confront mental health problemsNeil Gaiman accused of sexual assault in US civil lawsuits However, the experts noted differences in mood between weekdays and weekends could be driven by things like the changes in daily tasks. Dr Bu added: \"This pattern could reflect when people choose to respond to the survey, rather than a direct effect of time of day. \"For example, those already feeling better in the morning might be more likely to engage with the survey at that time.\" She also said the findings need \"to be replicated in other studies that fully account for this potential bias\", but suggested that if backed by other research, \"this could have important practical implications\". \"Mental health support services might consider adjusting resources to match fluctuating needs across the day - for instance, prioritising late-night availability,\" Dr Bu added."
    },
    {
        "title": "AI could drive big increase in number and speed of women being treated for breast cancer",
        "description": "A trial using artificial intelligence (AI) in breast cancer screening could lead to a dramatic rise in the number of patients being treated. ",
        "url": "https://news.sky.com/story/ai-could-drive-big-increase-in-number-and-speed-of-women-being-treated-for-breast-cancer-13302733",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-mammogram-istock_6819074.jpg?20250204101727",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-02-04 00:40:00",
        "Headline": "Almost 700,000 women are expected to take part in a trial, with some 30 testing sites across the country being enhanced with AI technology.",
        "Content": "A trial using artificial intelligence (AI) in breast cancer screening could lead to a dramatic rise in the number of patients being treated.  At present, two radiologists are needed to look at the images from mammograms to ensure accuracy. It is hoped that the AI being trialled will allow one to complete the process on their own, freeing up others to see more patients. Almost 700,000 women are expected to take part in the research, the government has announced. Those already booked in for routine NHS screenings will be invited to join the £11m Early Detection using Information Technology in Health (Edith) trial. Some 30 testing sites across the country will be enhanced with AI technology. About 55,000 women and 400 men are diagnosed with breast cancer each year in the UK, according to Breast Cancer Now. Dr Katharine Halliday, president of the Royal College of Radiologists, said AI could have a \"major impact on radiology\" given the \"volume and complexity of breast screening\". However, she said it was a \"rigorous study\" and results would \"take time\". \"With a projected 40% shortfall in consultant radiologists by 2028, the need to build radiology capacity remains urgent,\" Dr Halliday added. Claire Rowney, chief executive of Breast Cancer Now, said any changes to the breast screening programme must be supported by evidence showing that \"any new innovation or tool is safe and effective for women\". Read more:Sheffield school stabbing victim namedKate shares new portrait taken by Prince Louis The government is also requesting evidence to help shape a national cancer plan. The idea is to find ways to transform how the disease is treated and therefore reduce the number of deaths. It is hoped that research, diagnosis, screening, treatment and prevention will all be improved. There will also be specific measures for rarer forms of the disease, including those that affect children. Professor Peter Johnson, national clinical director for cancer, said: \"The NHS is diagnosing more cancers at an early stage than ever before - when treatment is most likely to be effective - but we know we need to accelerate progress further. \"A national cancer plan will give us the chance to do just that - bringing in new ideas, helping us make best practise, normal practise - and ensure the NHS is at the cutting edge of new cancer developments and innovations in the future.\" Peter Kyle, the science and technology secretary, said: \"Catching cancer weeks earlier could be the difference between life and death.\""
    },
    {
        "title": "Neil Gaiman accused of sexual assault in civil lawsuits filed in US",
        "description": "British author Neil Gaiman has been accused of sexual assault in lawsuits filed by a woman in the US.",
        "url": "https://news.sky.com/story/neil-gaiman-accused-of-sexual-assault-in-civil-lawsuits-filed-in-us-13302855",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-neil-gaiman-2024-writers-guild-awards_6819255.jpg?20250204103951",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-04 09:41:00",
        "Headline": "Best-selling author Neil Gaiman, who wrote the novel American Gods and The Sandman comic book series, as well as the children's fantasy book Coraline, has previously strenuously denied allegations of sexual abuse.",
        "Content": "British author Neil Gaiman has been accused of sexual assault in lawsuits filed by a woman in the US. The legal documents were filed in Wisconsin, Massachusetts and New York on Monday. In January, Gaiman strenuously denied allegations of sexual assault made against him by eight women featured in a New York Magazine article. In a blog post, he said he was \"far from a perfect person\" but had \"never engaged in non-consensual sexual activity with anyone. Ever\". In the lawsuits, the female complainant accuses Gaiman of sexual assault, battery, violating human trafficking laws, and inflicting emotional distress The woman is seeking at least $7m (about £5.6m) in damages. Gaiman, who wrote the novel American Gods and The Sandman comic book series, as well as the children's fantasy book Coraline, has had several works turned into films and television programmes in recent years. In July, a Tortoise Media podcast included allegations made by five women against him. Four of these women were featured in the New York Magazine article last month. Since the article, publisher Dark Horse Comics has cancelled upcoming work by Gaiman and a UK stage adaptation of Coraline has been scrapped. What has Neil Gaiman said? Writing in response to the allegations in January, Gaiman said he had watched stories about him circulating online for months with \"horror and dismay\". \"As I read through this latest collection of accounts, there are moments I half-recognise and moments I don't, descriptions of things that happened sitting beside things that emphatically did not happen,\" he wrote. \"I'm far from a perfect person, but I have never engaged in non-consensual sexual activity with anyone. Ever.\" Gaiman said he had reviewed messages exchanged with his accusers, and they read like \"two people enjoying entirely consensual sexual relationships and wanting to see one another again\". He said he now realised he \"could have and should have done so much better\", that he was \"emotionally unavailable while being sexually available, self-focused and not as thoughtful as I could or should have been\", and \"obviously careless with people's hearts and feelings\". However, \"some of the horrible stories now being told simply never happened, while others have been so distorted from what actually took place that they bear no relationship to reality\", he said. Sky News has contacted representatives for Gaiman for response to the lawsuits."
    },
    {
        "title": "The Goonies cast reunite 40 years after cult movie released",
        "description": "The Goonies cast has reunited in Hollywood to celebrate one of their number being immortalised in concrete.",
        "url": "https://news.sky.com/story/the-goonies-cast-reunite-40-years-after-cult-movie-released-13303053",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-goonies-ke-quan-jonathan-ke-quan_6819543.jpg?20250204151208",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-04 15:12:00",
        "Headline": "Cast members Josh Brolin, Joe Pantoliano, Kerri Green, and Corey Feldman as well as writer Chris Columbus were all snapped with Ke Huy Quan at the ceremony.",
        "Content": "The Goonies cast has reunited in Hollywood to celebrate one of their number being immortalised in concrete. Actor Ke Huy Quan was honoured with a hand and footprint ceremony at the TCL Chinese Theatre in Los Angeles on Monday. To celebrate, much of his fellow cast from the classic 1985 film turned up, posing in pictures. Cast members Josh Brolin, Joe Pantoliano, Kerri Green, and Corey Feldman as well as writer Chris Columbus were all snapped with Quan at the ceremony. Lord Of The Rings actor Sean Astin didn't attend the ceremony but reportedly joined the others for the premiere of Quan's new movie Love Hurts, according to USA Today. At the ceremony, Dune and Marvel star Brolin also gave a speech. He said: \"I'm so honoured to be here today. It's such a wonderful story that you have. \n                  Neil Gaiman accused of sexual assault in civil lawsuits filed in US\n                 \n                  Blake Lively and Justin Baldoni's lawyers told to stop discussing cases\n                 \n                  Actor and comedian Brian Murphy dies aged 92\n                 \"I hold you in a very dear place in my heart.\" He added: \"I could not be happier for you. I know we all are, all us Goonies here - for an honour that is not only totally deserved, but celebrates all that is right in this industry. Love you, pal.\" Quan first starred in Indiana Jones And The Temple Of Doom, playing Short Round, and The Goonies, in the 80s, but after a few roles as a young adult he struggled to land anymore gigs and took a 19-year break from acting. During this he worked as a stunt choreographer and assistant director. Read more from Sky News:Actor and comedian Brian Murphy diesJoe Biden signs with Hollywood talent agencyGrammys 2025: Full list of winners He returned in 2022 in the hit mind-bending movie Everything Everywhere All At Once. During his speech, Brolin also read out a letter from Steven Spielberg. He said: \"Ke your whole life has been a dream come true, and you will be immortalised at the Grauman's Theatre which is an honour bestowed upon a very few. \"So Ke, as always, I'm proud of you for your meteoric rise as a child, and your second meteoric rise as a grown-up.\""
    },
    {
        "title": "Actor and comedian Brian Murphy dies aged 92",
        "description": "Actor and comedian Brian Murphy has died aged 92.",
        "url": "https://news.sky.com/story/actor-and-comedian-brian-murphy-dies-aged-92-13302770",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-george-and-mildred_6819109.jpg?20250204073329",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-04 07:05:00",
        "Headline": "Brian Murphy was best known for his role in the 1970s sitcoms Man About The House and George And Mildred.",
        "Content": "Actor and comedian Brian Murphy has died aged 92. He was known for his role in the 1970s sitcoms Man About The House and George And Mildred. News of his passing was shared by his wife Hi-de-Hi! actress Linda Regan. Posting a picture of her kissing her husband, she said: \"My love for you will never die. RIP sweetheart.\" He died on Sunday morning at his home in Kent, with his wife of 35 years by his side. In a statement, she said: \"I was lucky to have in my lifetime found my soulmate. Brian who I will love forever!\" Agent and friend Thomas Bowington described Murphy as a \"truly joyful and profoundly good-hearted man\". Murphy first came to prominence playing landlord George Roper in Man About The House, starring alongside the late Yootha Joyce. The show began in 1973 and was considered controversial for the time because it featured two single women living with a man. When it ended in 1976, Murphy and Joyce starred in the spin-off, George And Mildred, which ran for five series until 1979. He also starred as Alvin Smedley in Last Of The Summer Wine. Read more from Sky News:Bereaved parents demand tougher laws on unlicensed drivingSheffield school stabbing victim named Born on the Isle of Wight, Murphy was a member of the Theatre Workshop, founded by Joan Littlewood, and was a jobbing actor before appearing in TV shows including Z-Cars. In 1993, he starred in the first major stage version of the HG Wells science fiction classic The Invisible Man. More recently, Murphy appeared in TV shows including the BBC's Holby City and ITV's Benidorm. He is survived by his wife and two sons."
    },
    {
        "title": "Joe Biden joins likes of Brad Pitt and Ariana Grande as he signs with Los Angeles talent agency",
        "description": "Joe Biden has signed with Los Angeles talent agency Creative Artists Agency (CAA), home to stars such as Brad Pitt, Ariana Grande and more.",
        "url": "https://news.sky.com/story/joe-biden-joins-likes-of-brad-pitt-and-ariana-grande-as-he-signs-with-los-angeles-talent-agency-13302815",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-pardon-joe-biden_6805271.jpg?20250120153412",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-02-04 09:08:00",
        "Headline": "The announcement comes after Joe Biden left the White House last month, succeeded by Donald Trump who won November's election.",
        "Content": "Joe Biden has signed with Los Angeles talent agency Creative Artists Agency (CAA), home to stars such as Brad Pitt, Ariana Grande and more. It follows the former US president's departure from the White House about two weeks ago. He was previously represented by CAA from 2017 to 2020, during Donald Trump's first stint as president and following Mr Biden's time as vice president. During this period he published his memoir Promise Me, Dad: A Year Of Hope, Hardship And Purpose.  CAA announced the news on social media, with Richard Lovett, its co-chairman, saying: \"President Biden is one of America's most respected and influential voices in national and global affairs. \"His lifelong commitment to public service is one of unity, optimism, dignity, and possibility. \"We are profoundly honored to partner with him again.\" The 82-year-old has so far not announced what his plans after office are and whether that will involve writing another book, or any other project. CAA also has links to Barack and Michelle Obama. The pair's production company Higher Ground is signed to the agency. Read more from Sky News:Millions face council tax rise of more than 5%Man sentenced to nearly 500 years over dog fightingAll the looks from Grammys red carpet  In his farewell speech addressing supporters and staff, Mr Biden said: \"We're leaving office, but we're not leaving the fight.\" Mr Biden's time as president ended unceremoniously after his attempt to run for a second term was curtailed by his own party. Following a series of public appearances that raised questions over his ability to work as president for four more years, he faced internal pressure to step aside. Despite initially resisting he eventually did give way and his vice president Kamala Harris became the Democratic nominee. She slumped to a punishing election defeat to Donald Trump in November."
    }
]