[
    {
        "title": "RAF carries out strikes against IS underground facility in Syria",
        "description": "British forces have bombed a suspected weapons stockpile &#8288;previously used by Islamic&#160;State in Syria.",
        "url": "https://news.sky.com/story/raf-carries-out-strikes-against-is-underground-facility-in-syria-13490152",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-eurofighter-typhoon_6229942.jpg?20230725154636",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-03 23:46:00",
        "Headline": "Typhoon FGR4 combat jets were used to bomb the target, supported by a Voyager refuelling tanker.",
        "Content": "British forces have bombed a suspected weapons stockpile ⁠previously used by Islamic State in Syria. RAF Typhoons deployed guided bombs in a joint operation with the French air force on Saturday evening. The Ministry of Defence (MoD) said several access tunnels were targeted, located in a mountainous area north of the central ancient city of Palmyra. The operation aimed to \"help prevent any attempted resurgence of the Daesh terrorist movement\". Daesh is another name for Islamic State, often shortened to ISIS or IS. The facility had been used by IS, most likely to store weapons and explosives, and the surrounding area was devoid of civilians. There was no indication of any risk to the local population, and all aircraft involved in the operation returned safely. In December, the US launched strikes in Syria to \"eliminate ISIS fighters, infrastructure, and weapons sites\". \n                  Three police officers and six militants killed in shooting in Turkey \n                 \n                  Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News\n                 \n                  US launches 'large-scale' strikes to 'eliminate' Islamic State fighters in Syria after US citizens killed in desert\n                 The MoD said RAF Typhoon FGR4s, supported by a Voyager refuelling tanker, joined French aircraft in a joint strike on the underground facility. \"Our aircraft used Paveway IV guided bombs to target a number of access tunnels down to the facility; whilst detailed assessment is now underway, initial indications are that the target was engaged successfully,\" the statement added. Read more from Sky News:Syria targets Islamic State cellsISIS resurgent in SomaliaSyria moves past Assad Foreign news reporter Able to travel at searing speeds of up to Mach 1.8 - 2,222kph - the Typhoon fighter jet can carry out a variety of roles including high-intensity combat, the RAF says. First deployed with the RAF above Libya in 2011, the Typhoon has since been used in Iraq and Syria since 2015 as Western nations have sought to strike Islamic State targets. The UK is among several countries that have stocks of the Typhoon, along with Germany, Italy and Spain. In recent years the fourth-generation Typhoon has lost ground to the fifth-generation F-35, which has advanced stealth capabilities, but the Eurofighter has remained a key part of UK defence as a multirole fighter. They are frequently called upon to intercept and shadow Russian aircraft near UK airspace.  The UK is set to replace it with the Tempest sixth-generation fighter from 2035, which is still in development. Defence Secretary John Healey said the operation was designed to \"eliminate dangerous terrorists who threaten our way of life\". \"This action shows our UK leadership, and determination to stand shoulder to shoulder with our allies, to stamp out any resurgence of Daesh and their dangerous and violent ideologies in the Middle East,\" he said in a statement. Western ​aircraft have been conducting patrols ​to stop a resurgence of the Islamist militant group that ‍ruled parts of Syria until 2019."
    },
    {
        "title": "Luke Littler wins second straight World Darts Championship defeating Dutchman Gian van Veen",
        "description": "Luke Littler has won his second straight World Darts Championship, triumphing over Dutchman Gian van Veen.",
        "url": "https://news.sky.com/story/luke-littler-wins-second-straight-world-darts-championship-13490124",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-luke-littler-darts_7125598.jpg?20260103215234",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-03 21:23:00",
        "Headline": "Littler told crowds at Alexandra Palace that \"the first time was so nice, I had to do it twice!\" as he lifted the Sid Waddell Trophy.",
        "Content": "Luke Littler has won his second straight World Darts Championship, triumphing over Dutchman Gian van Veen. Littler, 18, lost the first set at Alexandra Palace but roared back with seven straight sets to win the coveted title in back-to-back years. It was the teenager's third final in a row, having lost to Luke Humphries in 2024 when he was just 16 years old. Littler, nicknamed 'the Nuke', lost just four sets across the whole tournament in an utterly dominant display over the festive period. Littler, quoting two-time world champion boxer Anthony Joshua, said: \"The first time was so nice, I had to do it twice.\" The win means the 18-year-old becomes just the fourth back-to-back champion alongside Phil Taylor, Adrian Lewis and Gary Anderson. He is also the first man to retain his Ally Pally title since Anderson a decade ago. As a player who has lifted the Sid Waddell Trophy twice in just three attempts, he extends his advantage as world number one after making a groundbreaking impact on the sport. \n                  Luke Littler: Darts sensation reveals corrective eye surgery in childhood - 'I'm thankful parents got it sorted'\n                 \n                  Luke Littler on media attention, his meteoric rise to fame and bringing new fans to darts\n                 \n                  Luke Littler: World No 1 hopes his world title defence doesn't open with clash against Beau Greaves\n                 He is also the first winner of the £1m prize pot awarded to the victor. Van Veen becomes the new world number three, despite falling just short in his quest to follow in the footsteps of countrymen Raymond van Barneveld and Michael van Gerwen by winning the World Championship. Littler paid tribute to Anthony Joshua, who survived a fatal car crash in Nigeria on Monday. He told Sky Sports Darts: \"Everyone knows what happened with Anthony Joshua and his guys and his team, rest in peace to his friends. \"But just like AJ said: 'the first time was so nice, I had to do it twice!'\" He said he started playing better from the second set. \"I said to myself, 'give it time, you will find it'. I started off from the left of the oche and moved over to the right. It all came to plan. \"Gian, what a tournament, he can be very happy. Every set he was there and behind me. I had to take my chances.\" Read more from Sky News:Littler defends darts titlePaul Lim makes darts history Littler reeled off an incredible seven sets on the spin to become a back-to-back champion and keep himself firmly on top of the world. Van Veen was disappointed that he was unable to give Littler a real game. \"Luke wasn't in the mood to give me any more chances today. He played phenomenal. \"I would have liked to lift up the title, but I would have liked more to give Luke a game, and that's what I didn't do. \"I lost too many legs while I wasn't involved. I missed too many chances. But you know, looking back at this tournament, I'm very proud... getting even to the final.\""
    },
    {
        "title": "Managers of Swiss bar where fire killed 40 during New Year's event face criminal investigation",
        "description": "The two managers of a Swiss bar where at least 40 people were killed in a devastating fire have been put under criminal investigation.&#160;",
        "url": "https://news.sky.com/story/managers-of-swiss-bar-where-fire-killed-40-during-new-years-event-face-criminal-investigation-13490061",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-switzerland-le-constellation_7125382.jpg?20260103172443",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-03 17:45:00",
        "Headline": "The managers of Le Constellation bar in the ski resort of Crans-Montana are suspected of negligent homicide, negligent bodily harm and causing fire by negligence, police said in a statement.",
        "Content": "The two managers of a Swiss bar where at least 40 people were killed in a devastating fire have been put under criminal investigation.  The managers of Le Constellation bar in the ski resort of Crans-Montana are suspected of negligent homicide, negligent bodily harm and causing fire by negligence, police said in a statement. More than 100 people were injured in the fire which broke out in the early hours of Thursday as people celebrated the New Year. The process of identifying the dead and injured was still underway on Saturday, making it an agonising wait for family and friends wanting to know about their loved ones. It comes as an Italian 16-year-old was one of the first confirmed to have died in the fire, which prosecutors estimate reached between 400 and 600C. Chiara Costanzo's father, Andrea, told Italian newspaper Il Corriere della Sera that \"my beloved Chiara is no more\". Mr Costanzo told the news outlet earlier on Saturday that his daughter and her friends had chosen Le Constellation randomly, as other venues at the upmarket resort were full. \n                  Swiss bar fire: 'We saw terrible things - it could have happened to me'\n                 \n                  Swiss bar fire: Likely cause of resort blaze identified - as teen educated in UK named among missing\n                 \n                  How indoor fireworks keep causing deadly nightclub infernos \n                 Swiss police said four victims had been identified as two Swiss women aged 21 and 16, and two Swiss men aged 18 and 16. Their bodies have been returned to their families, police said. On Friday, Italian national Emanuele Galeppini, 17 and a golf prodigy, was the first victim to be reported dead, with news confirmed by the Italian Golf Federation. 'Bar checked thrice in 10 years' From initial investigation work, sparklers on champagne bottles are believed to be the likely cause of the fire. Switzerland's President Guy Parmelin described the deadly incident as \"one of the worst tragedies our country has ever known\". Read more:Footage shows Switzerland bar ceiling on fireSwitzerland: Witness describes moments after fire broke out A Swiss business register lists French couple Jacques and Jessica Moretti as the owners of Le Constellation. Switzerland's Tribune de Geneve reported that Mr Moretti told the newspaper the bar had been checked \"three times in 10 years\" and that \"everything was done within the standards\". The couple have two other establishments, one in Crans-Montana and another in nearby Lens. Investigators said the couple had been questioned, as have many others involved in the tragedy, as they gathered information on what happened at the New Year's event and what work was carried out on the bar in the past."
    },
    {
        "title": "Murderer among two prisoners at large after absconding on New Year's Day",
        "description": "Two prisoners are being hunted by police after absconding from jail on New Year's Day.",
        "url": "https://news.sky.com/story/murderer-among-two-prisoners-at-large-after-absonding-from-jail-on-new-years-day-13490067",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-matthew-armstrong_7125441.jpg?20260103175935",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-03 17:54:00",
        "Headline": "Police have warned members of the public who may spot the prisoners to stay away from them and call 999.",
        "Content": "Two prisoners are being hunted by police after absconding from jail on New Year's Day. Avon and Somerset Police are searching for Matthew Armstrong and Daniel Washbourne, who both have a history of violent offences, with Armstrong convicted of murder. A third prisoner, suspected of having absconded at the same time, was arrested in Bristol today. The men fled from HMP Leyhill in South Gloucestershire between 5pm and 8pm on 1 January. Police have warned anyone who may spot the prisoners to stay away from them and call 999. Armstrong, 35, and who has known links to Warwickshire, has been described as white, about 5ft 9ins, with ginger hair and scars on his forehead. He was last seen wearing a burgundy/orange coat, grey cap, grey tracksuit bottoms with blue on the side, and black boots. Armstrong was convicted in the late 2000s of a murder that occurred during a robbery in Warwickshire. Washbourne, 40, and who has known links to Herefordshire, has been described as white, about 5ft 6ins, slim, with brown hair and clean shaven. He was last seen wearing a cream fleece, blue tracksuit bottoms, blue hat and black trainers. He has previous convictions for violence and false imprisonment. Avon and Somerset Police said they were informed about the absconders on Thursday evening as they fled. The force has shared CCTV footage of what the absconders wore on the day they escaped, as it appealed to the public for information."
    },
    {
        "title": "Son of British woman detained in Iran describes 'criminal' government response",
        "description": "The son of a British woman held in an Iranian jail has described the response of the British government as \"criminal\", as he delivered a 70-thousand-strong petition to Downing Street.",
        "url": "https://news.sky.com/story/son-of-british-couple-detained-in-iran-describe-criminal-government-response-13490072",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lindsay-foreman-joe-bennett_7017195.jpg?20260103223339",
        "type": "Home",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-03 18:17:00",
        "Headline": "Speaking at a rally in London to mark one year since the couple's capture, Joe Bennett told Sky News that his mother is \"malnourished\". ",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n The son of a British woman held in an Iranian jail has described the response of the British government as \"criminal\", as he delivered a 70-thousand-strong petition to Downing Street. Lindsay and Craig Foreman were detained on 3 January 2025 while travelling through Iran for four days on a round-the-world motorbike holiday. They are accused of espionage, which they both deny. Speaking at a rally in London to mark one year since the couple's capture, Lindsay's son Joe Bennett told Sky News that while the Foreign Office has been good at communicating with the family, the overall response from the government has been \"passive\" and that he wants a response from the prime minister. \"There's almost this philosophy to let this judicial system play out, which is of course a complete circus, and the fact that they're both being accused of espionage for the British state and the state that they're being accused of spying for aren't coming out in public defending them, I think is criminal, really.\" He said the last year has been \"crazy\". \"It's gone quick, but it's been the most traumatic long time of our lives. Today is about trying to unite people.\" He said his mother is \"malnourished\" and has been putting on a \"brave face\". \"She's sleeping on a metal frame. You know, it's horrible conditions. There are rats and vermin everywhere. She's woken up with rats in her bed. \"Day by day has an effect because their body is deteriorating, right? That's the reality of it.\" Read more from Sky News: Iran threatens Trump after 'locked and loaded' warningEverything we know about US strikes on Venezuela Also attending the rally was Richard Ratcliffe, husband of Nazanin Zaghari-Ratcliffe, who was held in Iran for more than five years before being released in 2022. \"It brings back tough memories of what we went through, how long it lasted - how you need to keep going. It's nice to be here and reminded of how many people cared for us and care for Lindsay and Craig - and the importance of just keeping going and keeping alive the idea that one day it will be different.\" On government efforts to secure Linsday and Craig's release, Mr Ratcliffe said they are not doing enough. \"I think that was true in our case, that will be true in Joe's mum's case, you don't know what they're doing behind closed doors. But as years went on I got very sceptical.\" A Foreign Office spokesperson said: \"We are deeply concerned by reports that Craig and Lindsay Foreman have been charged with espionage in Iran. \"We continue to raise this case directly with the Iranian authorities. \"The FCDO are providing them with consular assistance and remain in close contact with their family members.\""
    },
    {
        "title": "Iran threatens Trump after 'locked and loaded' warning",
        "description": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports.",
        "url": "https://news.sky.com/story/iran-threatens-trump-after-locked-and-loaded-warning-13489824",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-trump_7124830.jpg?20260103034423",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-03 00:43:00",
        "Headline": "Iran's foreign ministry has accused the US president of \"escalating tensions in the region\" with his response to protests in recent days, which have turned deadly. Mr Trump had warned the US is \"locked and loaded\" to intervene.",
        "Content": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports. Iranian officials have been responding to the US president's pledge to \"rescue\" protesters if they were killed while demonstrating on the streets over a growing cost-of-living crisis. If Iran \"kills peaceful protesters, which is their custom, the United States of America will come to their rescue. We are locked and loaded and ready to go,\" Mr Trump wrote on Truth Social. In a statement on Friday evening, Iran's foreign ministry condemned the \"intimidating remarks\" and accused the US of \"escalating tensions in the region\". \"The Islamic Republic of Iran's response to any aggression will be swift, decisive, and comprehensive,\" it added. The US State Department shared a video of some of the protests on X. It said the \"courage of the Iranian people is undeniable\" and praised the demonstrators' \"resolve in the face of repression\". This week's protests are the biggest since nationwide demonstrations triggered by the death of 22-year-old Mahsa Amini in custody in 2022. The unrest has spread across the country, with deadly confrontations with security forces focused in western provinces. State-affiliated media and rights groups have reported at least 10 deaths ‌since Wednesday, including two men who authorities said were members of the Basij paramilitary force affiliated with the elite Revolutionary Guards. According to information verified by Hengaw Organisation for Human Rights, there have been 132 arrests during the recent unrest, including at least 12 women and 8 children. Protests erupted on Sunday in the capital, Tehran, with crowds largely chanting about economic grievances. Iran's economy has been battered by years of sanctions, and the country's currency has hit a record low against the US dollar as prices soar. Read more from Sky News:Trump threatens Iran if it rearmsYemen's independence planWhy is Tehran short of water? Protests turn deadly The unrest has seen students take to the streets of Tehran on Tuesday, demonstrators attempting to break into a government building on Wednesday, and then turning deadly as the violence escalated overnight into Thursday. Rights groups and social media posts reported protests in a number of cities across Iran late on ⁠Friday, including in three districts of the capital Tehran. Iran's hardliner politician Mohammad Bagher Qalibaf said in a post on X that Mr Trump's threat makes \"all American bases and forces across the region legitimate targets in response to any possible adventurism\". Mr Trump did ​not specify what sort of action the US could take in support of the protests, but America bombed Iranian nuclear facilities in June, joining an Israeli air campaign that targeted Tehran's atomic programme and military leadership."
    },
    {
        "title": "Luke Littler wins second straight World Darts Championship defeating Dutchman Gian van Veen",
        "description": "Luke Littler has won his second straight World Darts Championship, triumphing over Dutchman Gian van Veen.",
        "url": "https://news.sky.com/story/luke-littler-wins-second-straight-world-darts-championship-13490124",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-luke-littler-darts_7125598.jpg?20260103215234",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-03 21:23:00",
        "Headline": "Littler told crowds at Alexandra Palace that \"the first time was so nice, I had to do it twice!\" as he lifted the Sid Waddell Trophy.",
        "Content": "Luke Littler has won his second straight World Darts Championship, triumphing over Dutchman Gian van Veen. Littler, 18, lost the first set at Alexandra Palace but roared back with seven straight sets to win the coveted title in back-to-back years. It was the teenager's third final in a row, having lost to Luke Humphries in 2024 when he was just 16 years old. Littler, nicknamed 'the Nuke', lost just four sets across the whole tournament in an utterly dominant display over the festive period. Littler, quoting two-time world champion boxer Anthony Joshua, said: \"The first time was so nice, I had to do it twice.\" The win means the 18-year-old becomes just the fourth back-to-back champion alongside Phil Taylor, Adrian Lewis and Gary Anderson. He is also the first man to retain his Ally Pally title since Anderson a decade ago. As a player who has lifted the Sid Waddell Trophy twice in just three attempts, he extends his advantage as world number one after making a groundbreaking impact on the sport. \n                  Luke Littler: Darts sensation reveals corrective eye surgery in childhood - 'I'm thankful parents got it sorted'\n                 \n                  Luke Littler on media attention, his meteoric rise to fame and bringing new fans to darts\n                 \n                  Luke Littler: World No 1 hopes his world title defence doesn't open with clash against Beau Greaves\n                 He is also the first winner of the £1m prize pot awarded to the victor. Van Veen becomes the new world number three, despite falling just short in his quest to follow in the footsteps of countrymen Raymond van Barneveld and Michael van Gerwen by winning the World Championship. Littler paid tribute to Anthony Joshua, who survived a fatal car crash in Nigeria on Monday. He told Sky Sports Darts: \"Everyone knows what happened with Anthony Joshua and his guys and his team, rest in peace to his friends. \"But just like AJ said: 'the first time was so nice, I had to do it twice!'\" He said he started playing better from the second set. \"I said to myself, 'give it time, you will find it'. I started off from the left of the oche and moved over to the right. It all came to plan. \"Gian, what a tournament, he can be very happy. Every set he was there and behind me. I had to take my chances.\" Read more from Sky News:Littler defends darts titlePaul Lim makes darts history Littler reeled off an incredible seven sets on the spin to become a back-to-back champion and keep himself firmly on top of the world. Van Veen was disappointed that he was unable to give Littler a real game. \"Luke wasn't in the mood to give me any more chances today. He played phenomenal. \"I would have liked to lift up the title, but I would have liked more to give Luke a game, and that's what I didn't do. \"I lost too many legs while I wasn't involved. I missed too many chances. But you know, looking back at this tournament, I'm very proud... getting even to the final.\""
    },
    {
        "title": "Son of British woman detained in Iran describes 'criminal' government response",
        "description": "The son of a British woman held in an Iranian jail has described the response of the British government as \"criminal\", as he delivered a 70-thousand-strong petition to Downing Street.",
        "url": "https://news.sky.com/story/son-of-british-couple-detained-in-iran-describe-criminal-government-response-13490072",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-lindsay-foreman-joe-bennett_7017195.jpg?20260103223339",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2026-01-03 18:17:00",
        "Headline": "Speaking at a rally in London to mark one year since the couple's capture, Joe Bennett told Sky News that his mother is \"malnourished\". ",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n The son of a British woman held in an Iranian jail has described the response of the British government as \"criminal\", as he delivered a 70-thousand-strong petition to Downing Street. Lindsay and Craig Foreman were detained on 3 January 2025 while travelling through Iran for four days on a round-the-world motorbike holiday. They are accused of espionage, which they both deny. Speaking at a rally in London to mark one year since the couple's capture, Lindsay's son Joe Bennett told Sky News that while the Foreign Office has been good at communicating with the family, the overall response from the government has been \"passive\" and that he wants a response from the prime minister. \"There's almost this philosophy to let this judicial system play out, which is of course a complete circus, and the fact that they're both being accused of espionage for the British state and the state that they're being accused of spying for aren't coming out in public defending them, I think is criminal, really.\" He said the last year has been \"crazy\". \"It's gone quick, but it's been the most traumatic long time of our lives. Today is about trying to unite people.\" He said his mother is \"malnourished\" and has been putting on a \"brave face\". \"She's sleeping on a metal frame. You know, it's horrible conditions. There are rats and vermin everywhere. She's woken up with rats in her bed. \"Day by day has an effect because their body is deteriorating, right? That's the reality of it.\" Read more from Sky News: Iran threatens Trump after 'locked and loaded' warningEverything we know about US strikes on Venezuela Also attending the rally was Richard Ratcliffe, husband of Nazanin Zaghari-Ratcliffe, who was held in Iran for more than five years before being released in 2022. \"It brings back tough memories of what we went through, how long it lasted - how you need to keep going. It's nice to be here and reminded of how many people cared for us and care for Lindsay and Craig - and the importance of just keeping going and keeping alive the idea that one day it will be different.\" On government efforts to secure Linsday and Craig's release, Mr Ratcliffe said they are not doing enough. \"I think that was true in our case, that will be true in Joe's mum's case, you don't know what they're doing behind closed doors. But as years went on I got very sceptical.\" A Foreign Office spokesperson said: \"We are deeply concerned by reports that Craig and Lindsay Foreman have been charged with espionage in Iran. \"We continue to raise this case directly with the Iranian authorities. \"The FCDO are providing them with consular assistance and remain in close contact with their family members.\""
    },
    {
        "title": "Murderer among two prisoners at large after absconding on New Year's Day",
        "description": "Two prisoners are being hunted by police after absconding from jail on New Year's Day.",
        "url": "https://news.sky.com/story/murderer-among-two-prisoners-at-large-after-absonding-from-jail-on-new-years-day-13490067",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-matthew-armstrong_7125441.jpg?20260103175935",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-03 17:54:00",
        "Headline": "Police have warned members of the public who may spot the prisoners to stay away from them and call 999.",
        "Content": "Two prisoners are being hunted by police after absconding from jail on New Year's Day. Avon and Somerset Police are searching for Matthew Armstrong and Daniel Washbourne, who both have a history of violent offences, with Armstrong convicted of murder. A third prisoner, suspected of having absconded at the same time, was arrested in Bristol today. The men fled from HMP Leyhill in South Gloucestershire between 5pm and 8pm on 1 January. Police have warned anyone who may spot the prisoners to stay away from them and call 999. Armstrong, 35, and who has known links to Warwickshire, has been described as white, about 5ft 9ins, with ginger hair and scars on his forehead. He was last seen wearing a burgundy/orange coat, grey cap, grey tracksuit bottoms with blue on the side, and black boots. Armstrong was convicted in the late 2000s of a murder that occurred during a robbery in Warwickshire. Washbourne, 40, and who has known links to Herefordshire, has been described as white, about 5ft 6ins, slim, with brown hair and clean shaven. He was last seen wearing a cream fleece, blue tracksuit bottoms, blue hat and black trainers. He has previous convictions for violence and false imprisonment. Avon and Somerset Police said they were informed about the absconders on Thursday evening as they fled. The force has shared CCTV footage of what the absconders wore on the day they escaped, as it appealed to the public for information."
    },
    {
        "title": "Deal to nationalise 'ferry fiasco' harbour at 'advanced stage', says Scotland's first minister",
        "description": "Ardrossan Harbour, once a vital link to the Isle of Arran, is set to be bought by the Scottish government and upgraded so ferry services can resume.",
        "url": "https://news.sky.com/story/deal-to-nationalise-ferry-fiasco-harbour-at-advanced-stage-says-scotlands-first-minister-13489826",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-ardrossan-harbour-ayrshire_6882725.jpg?20250411110459",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-03 03:40:00",
        "Headline": "Reports suggest a price was agreed in October to buy Ardrossan Harbour from its current owner, as the site needs upgrading to dock two new ferries on the route between the mainland and the Isle of Arran.",
        "Content": "Ardrossan Harbour, once a vital link to the Isle of Arran, is set to be bought by the Scottish government and upgraded so ferry services can resume. Discussions with private operator Peel Ports about nationalising the harbour are at a \"well-advanced stage\", according to Scotland's First Minister John Swinney. Reports suggest a price was agreed in October, and it is hoped a deal could be completed before the end of 2026. The current site cannot dock two new ferries on the route between the mainland and the Isle of Arran because they are too big - just another setback for the harbour at the centre of what's been Scotland's \"ferry fiasco\". Ministers are reportedly looking to upgrade it once under public ownership. The Glen Sannox has been in service since last January, while the Glen Rosa could be delayed from entering service until early 2027. With the harbour at Ardrossan too small for the larger vessels, the Glen Sannox has been running from Troon, further down the Ayrshire coast. The MV Caledonian Isles was out of action for more than 18 months, meaning there were regularly no ferries between Ardrossan and Arran. 'Complex' deal now 'well-advanced' Mr Swinney said the Scottish government was committed to delivering ferry services for Arran from Ardrossan. \"It's a complex negotiation and a complex agreement and I would say it's at a well-advanced stage,\" he said. Asked if the deal would be sealed by the end of 2026, the first minister said it would. His comments come after the latest delay to the delivery of the Glen Rosa, one of the ferries due to run the route between Arran and the mainland. The vessel may not be in service until 2027. The Glen Rosa and the Glen Sannox were due to enter service by 2018 but went massively over budget, costing an estimated £460m despite a £97m contract price. Read more from Sky News:Snow warnings upgraded to amberScotland's 'most boring town''Butcher surgeon' evidence destroyed The further delays to the Glen Rosa will increase costs, but the first minister said there was no \"blank cheque\" for the government-owned shipyard Ferguson Marine to finish it. \"We've got to get this vessel completed, because the network requires it and we're seeing the benefits of the service of the Glen Sannox,\" he said. The first minister added: \"The Glen Rosa should have been completed much earlier, and it's a source of great frustration that's not the case. \"But the vessel is required, and we will have to complete the vessel to make sure the ferry network is strengthened as a consequence.\""
    },
    {
        "title": "US general reveals how America captured Venezuela's president",
        "description": "Months of spying, ground forces and more than 150 aircraft were involved in the daring US operation against Venezuela's President Nicolas Maduro.",
        "url": "https://news.sky.com/story/us-general-reveals-how-america-captured-venezuelas-president-13490105",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maduro-nicolas_7125309.jpg?20260103162626",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-03 19:35:00",
        "Headline": "Fair weather allowed US helicopters to sneak into Venezuela - flying at just 100ft - before descending on Maduro's compound.",
        "Content": "Months of spying, ground forces and more than 150 aircraft were involved in the daring US operation against Venezuela's President Nicolas Maduro. Key details about how the US prepared and executed its operation - known as Operation Absolute Resolve - over months were revealed in a press conference on Saturday by General Dan Caine, the highest-ranking military officer of the armed forces. Caine, who is chairman of the joint chiefs of staff, described the operation as discreet and precise and said it was the culmination of months of planning and rehearsal. Follow the latest on US actions in Venezuela He cautioned reporters that he would share more details in a way that wouldn't compromise any tactics, techniques or procedures due to the possibility that this type of operation may be used again. US intelligence agencies watched and waited Caine praised US intelligence agencies, saying the mission wouldn't have been possible without the work of various intelligence agencies, including the CIA, NSA, and NCA. \n                  Venezuelan president Maduro combined swaggering incompetence with ruthless repression\n                 \n                  President Trump may walk away from Ukraine peace process, his eldest son says\n                 \n                  Dismissal of criminal charges against opponents derails Trump's revenge tour\n                 He set out how months of intelligence work enabled Washington to locate and understand Maduro's behaviour, patterns and routines. By early December, US forces were set, he said. These forces remained poised to strike in the weeks before Christmas, through to the New Year, awaiting the right requirements. Weather conditions were crucial to the raid, Mr Caine said, as optimal weather would minimise the potential for harm to civilians and personnel - while also maximising the element of surprise. On Friday, at 10.46pm in Washington (3.46am on Saturday in London), the weather in Venezuela had broken enough for President Trump to order the mission's go-ahead. American forces strike More than 150 aircraft launched as part of the operation. Helicopters took off with the extraction force and began approaching Venezuela while just 100ft above the water. Forces, including F-22s, F-35s, F-18s, E-18s, E-2s, B-1 bombers, and support aircraft, also closed in on the South American country. As they approached Caracas, Venezuela's capital, the Joint Air Component began using weapons to dismantle and disable the air defence systems in Venezuela. Mr Caine set out how officials believe US forces \"had maintained the element of surprise\" as the helicopter force approached its target at low level. US helicopters arrived at Maduro's compound at 1.01am EST (6.04am GMT), with the apprehension force descending into the building. The general explained that US helicopters came under fire and responded with \"overwhelming force\". One of the helicopters was hit, but it remained flyable. Ground forces were provided real-time updates by air and ground intelligence teams to ensure they could navigate the compound with as much information and as little risk as possible. The seizure and extraction of Maduro and his wife Maduro and his wife, Cilia Flores, who are both indicted by the US, were described by the general as having given up and were taken into custody. CNN reported that both Maduro and his wife were dragged from their bedroom by US forces. After seizing the president and his wife, helicopters were called in to extract the force and their captives. Despite fighter aircraft and drones engaging in suppressive fire, the general said there were multiple \"self-defence engagements\" as the force began to withdraw. However, the group managed to extract successfully and was over water at 3.29am EST (8.29am GMT). Read more from Sky News:\"The State of South Arabia\": plan for independence announcedHow sanctions are boosting Russian wineBoth Maduro and his wife were transported to the US Navy's amphibious assault ship USS Iwo Jima. President Trump later uploaded a photo of a captive Maduro on board the ship. In the press conference, Trump boasted of how \"not a single American service member was killed, and not a single piece of American equipment was lost\". He added that \"many helicopters, many planes, many people\" were involved in the operation. The president described the operation as \"an assault like people have not seen since World War Two\"."
    },
    {
        "title": "Everything we know about US strikes on Venezuela",
        "description": "The US has carried out a \"large-scale strike\" against Venezuela, and its leader, Nicolas Maduro, has been flown out of the country with his wife.",
        "url": "https://news.sky.com/story/everything-we-know-about-us-strikes-on-venezuela-13489955",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-venezuela-caracas-strikes_7124889.jpg?20260103081406",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-03 14:31:00",
        "Headline": "Venezuelan president Nicolas Maduro and his wife were captured by US forces in a daring raid in Caracas overnight on Saturday. In a fast-developing situation, here's everything we know so far.",
        "Content": "The US has carried out a \"large-scale strike\" against Venezuela, and its leader, Nicolas Maduro, has been flown out of the country with his wife. The raid marks a dramatic escalation after months of tension between the two countries and a US military build-up in the region. This is what we know so far. Where and when did the US strike? Several explosions rang out in Caracas, Venezuela's capital, early on Saturday, as low-flying aircraft swept over the city. Witnesses reported smoke rising from the hangar of a military base in Caracas. Read more:US strikes Venezuela: Follow latestWhy removal of Maduro is unprecedentedHow did we get here? The explosions sent people rushing into the streets, while others posted videos of the blasts on social media. The strikes, which lasted about 30 minutes, also hit the states of Miranda, Aragua and La Guaira, according to the Venezuelan government. Donald Trump told Fox News there were a few injuries to US forces, but no deaths. How was Maduro captured? Mr Trump said Maduro and his wife were flown by helicopter to a US warship and would go on to New York to face charges. Maduro was captured by elite special forces troops, a US official told the Reuters news agency. On Saturday morning, sources inside the opposition told Sky News they believe Maduro's capture was a \"negotiated exit\". An image shared on Truth Social by Mr Trump showed Maduro blindfolded, with the caption: \"Nicolas Maduro on board the USS Imo Jima.\" According to the country's ruling party leader, Nahum Fernandez, the president and his wife were at their home within a military base when they were seized. \"That's where they bombed,\" he told The Associated Press. \"And, there, they carried out what we could call a kidnapping of the president and the first lady of the country.\" Venezuelan officials said people had been killed, but the scale of casualties was unclear.  US broadcaster CNN reported the couple were \"dragged from their bedroom\". Citing two sources, they said they were \"captured in the middle of the night as they were sleeping\". Maduro to face charges US attorney general Pam Bondi said Nicolas Maduro and Cilia Flores have been indicted in the Southern District of New York. \"They will soon face the full wrath of American justice on American soil in American courts,\" Ms Bondi wrote on X. She said the Venezuelan president faces charges of narco-terrorism conspiracy; cocaine importation conspiracy; possession of machine guns and destructive devices; and conspiracy to possess machine guns and destructive devices against the US. Maduro was indicted in March 2020 on \"narco-terrorism\" charges in the Southern District of New York. We're going to run the country, says Trump Mr Trump said the US will run Venezuela until a \"proper transition\" is made. Meanwhile, vice president Delcy Rodriguez addressed the nation, saying Venezuela would \"never be a colony\" of any country. Ms Rodriguez reiterated her call for Maduro and his wife to be released. She said the captured leader was the \"only\" president of Venezuela.  Mr Trump spoke to the media at Mar-a-Lago on Saturday about the assault on Venezuela. He told reporters \"air, land and sea was used\" for an assault \"like people have not seen since World War Two\". The US president said the goal of the attack on a \"heavily fortified military fortress in the heart of Caracas\" was \"to bring outlaw dictator Nicolas Maduro to justice\". \"This was one of the most stunning, effective and powerful displays of American military might and competence in American history,\" he added. Mr Trump said the US was \"ready to stage a second and much larger attack if we need to do so\". The armed forces assumed that a second wave would be necessary, he added, but said the first attack \"was so successful, we probably don't have to do a second\". \"But we're prepared to do a second wave, a much bigger wave, actually,\" he said. US oil firms will enter the country during the transition period, Mr Trump added. He said: \"We're going to have our very large United States oil companies, the biggest anywhere in the world, go in, spend billions of dollars, fix the badly broken infrastructure, the oil infrastructure, and start making money for the country.\" What has Keir Starmer said about the strikes?   The UK prime minister shared a statement about the US attack on Venezuela and capture of Maduro on Saturday. He said: \"The UK has long supported a transition of power in Venezuela. We regarded Maduro as an illegitimate president and we shed no tears about the end of his regime. \"I reiterated my support for international law this morning. The UK government will discuss the evolving situation with US counterparts in the days ahead as we seek a safe and peaceful transition to a legitimate government that reflects the will of the Venezuelan people.\" Earlier on Saturday, Sir Keir Starmer had said he \"will want to talk\" to the US president to \"establish the facts\" about the operation. He added the UK wasn't involved in the strikes.  National emergency declared The Venezuelan government declared a national emergency \"to protect the rights of the population, the full functioning of republican institutions, and to immediately transition to armed struggle\", adding: \"The entire country must mobilise to defeat this imperialist aggression.\" It accused the US of trying to \"seize Venezuela's strategic resources, particularly its oil and minerals, attempting to forcibly break the nation's political independence\". It said it \"rejects, repudiates, and denounces\" America's \"military aggression\". A statement added: \"Such aggression threatens international peace and stability, specifically in Latin America and the Caribbean, and seriously endangers the lives of millions of people.\" Why now? Mr Trump has escalated a pressure campaign on Maduro, threatening to order strikes on targets on Venezuelan land following months of attacks on boats that the US administration accused of carrying drugs. Maduro repeatedly said the campaign was simply the US trying to oust him from power. The Trump administration has accused Venezuela of failing to cooperate with anti-drug efforts over domestic criminal groups. "
    },
    {
        "title": "Venezuelan president Maduro combined swaggering incompetence with ruthless repression",
        "description": "Few leaders this century have done so much damage to the lives of so many as Nicolas Maduro.",
        "url": "https://news.sky.com/story/venezuelan-president-maduro-combined-swaggering-incompetence-with-ruthless-repression-13489875",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-cilia-flores-maduro_7125009.jpg?20260103133218",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-03 09:51:00",
        "Headline": "Nicolas Maduro's misrule was so chronically disastrous, seven million Venezuelans fled - but as the economy failed and the US Navy advanced, he danced, celebrated and compared himself to Taylor Swift.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Few leaders this century have done so much damage to the lives of so many as Nicolas Maduro. The Venezuelan dictator took an oil-rich nation and reduced it to utter penury and economic collapse. His misrule was so chronically disastrous, seven million Venezuelans - more than the entire population of Norway - fled. US strikes Venezuela: Follow latest His presidency will be remembered for his bizarre performances, dancing and celebrating as his economy continued to fail and the US Navy advanced. His brazen arrogance was breathtaking, joking once he was \"bigger than Taylor Swift\". Maduro failed to live up to mentor's example Maduro combined swaggering incompetence with ruthless repression. For much of his life he was in the shadow of Hugo Chavez, who upturned Venezuela with his brand of revolutionary socialism in the early 2000s, nationalising its oil industry and reducing poverty. When Chavez died, Maduro succeeded him but was despised by many in Venezuela's elites as a poor substitute. Unable to win the popularity of the charismatic strongman he had succeeded, he relied on the secret police, disappearances and persecution to keep his grip on power.In elections in 2015, Maduro lost his majority in parliament but refused to stand down.In widespread protests two years later, more than 100 people died. Opposition groups claim thousands were also killed by the secret police and in jails. In 2016, Maduro's fortunes took a turn for the worse when the man who would become his nemesis was elected US president. Donald Trump imposed swingeing sanctions. The Venezuelan economy went from bad to catastrophic - but Maduro appeared unmoved. Behind the scenes though, opponents were plotting, hoping for his downfall led by opposition figure Juan Guaido. He declared Maduro illegitimate and himself acting president instead, recognised by the US and others around the world. The Maduro regime reacted furiously, shooting at protesters in the streets, even driving over them in armoured vehicles. But Guaido had miscalculated, believing mistakenly he had enough support to remove Maduro from power. A coup attempt that looked close to toppling Maduro ended in failure. The unpopular dictator clung on. Read more:Everything we know about US strikes on VenezuelaUS strikes on Venezuela: How did we get here? In 2022, his fortunes turned again thanks to events halfway around the world. After Russia's invasion of Ukraine, the West stopping buying Russian oil. It turned to Venezuela and its vast reserves instead. Maduro was allowed back in out of the cold. He was emboldened to pull off one of the biggest election frauds in Latin America history. In elections in 2024 the opposition was considered by most observers to have won a landslide. Maduro again refused to give up power, declaring victory unconvincingly. Then in America, Donald Trump was re-elected. He branded Maduro a narco terrorist and sent a seventh of America's navy to threaten him. Trump's campaign against Maduro has been unrelenting: a massive naval deployment and continuing sanctions, designed to encourage internal dissent to bring the dictator down. 👉 Tap here to follow Trump100 wherever you get your podcasts👈  Maduro's years of rampant kleptocracy leave Venezuela racked with massive economic inequality, its resources robbed and its institutions dismantled. Most of its people are desperately poor and face a potentially stable and deeply uncertain future."
    },
    {
        "title": "US strikes on Venezuela: How did we get here?",
        "description": "After months of rising tensions, a build-up of US warships in the Caribbean and escalating threats of military action, America has struck Venezuela.",
        "url": "https://news.sky.com/story/us-strikes-on-venezuela-how-did-we-get-here-13489872",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-trump-maduro_7107044.jpg?20251211012824",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2026-01-03 09:43:00",
        "Headline": "The US strikes on Venezuela follow a lengthy period of extreme friction between the two countries. Here, we look at how things escalated to this point.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n After months of rising tensions, a build-up of US warships in the Caribbean and escalating threats of military action, America has struck Venezuela. It is a seismic move, US President Donald Trump claimed Venezuelan President ‍Nicolas Maduro has been captured and taken out of the country. US strikes Venezuela: Follow latest Much of what has happened or is still happening remains unclear, but it follows a lengthy period of extreme friction between the two countries. Here, we look at how things escalated to this point. Trump's talk of 'drug cartels' and boat strikes Tensions first started to escalate in September, when Mr Trump accused Mr Maduro of heading up a drugs cartel - without providing evidence. The following month, the Trump administration said the US was in \"armed conflict\" with drug cartels, accusing Mr Maduro of playing a major role in supplying illegal drugs that kill Americans, which Maduro denies. According to US data, Venezuela is a transit country for cocaine bound for Europe and America, and a haven for criminal groups that move drugs, but it is not a source for fentanyl, the drug linked to most US overdoses. The Trump administration has prompted outcry - both inside and outside Venezuela - for its campaign of strikes against boats in the region, which have killed 115 people. The US leader and his team claim the vessels are being used by gangs to carry drugs, but have released no evidence to support assertions those killed in the boats were \"narco-terrorists\". Read more: Everything we know about US strikes Does Trump want Venezuela's oil? Venezuela has the largest proven oil reserves of any country in the world, but corruption and underfunding go some way to explaining why it has not been able to leverage them in the way Gulf states such as Saudi Arabia have. And while some Western oil companies have remained active in the country, years of sanctions have kept Venezuela from attracting investment and obtaining the equipment and parts it needs. Mr Maduro has claimed the US wants his country's oil, which it currently sells mostly to China. Analysts say Venezuela's oil reserves may be of interest to Mr Trump, but the bigger issue could be who Venezuela allies itself with. \"The idea that you have this country, with oil, and minerals, and rare earths in our hemisphere and its main allies being China and Russia, that's something that doesn't really fit into Trump's view of the world,\" said David Smilde, a Venezuela expert at Tulane University. A more coercive America That brings us on to the Trump administration's strategy in the region, which has marked a return to a more interventionist and assertive approach. In his National Security Strategy last month, Mr Trump argued that America should revive the 19th century Monroe Doctrine, which said the Western Hemisphere is Washington's so-called zone of influence. This raised eyebrows not only in Latin America, but in Europe, where leaders worry this talk echoes what Russia has long desired in Ukraine and beyond. The build-up of US military forces in the region over the last several weeks has suggested the US is willing to take a more coercive approach to the region than in recent years - something that now looks undeniable following the strikes. Mr Trump's National Security Strategy alludes to US influence in Latin America as a way to deny Beijing access to resources such as military installations and critical minerals. Under pressure from strict US sanctions, Mr Maduro's government has signed energy and mining deals with China, as well as with Iran and Russia. Trump v Maduro Mr Trump does not recognise Mr Maduro as the leader of Venezuela. Mr Maduro has been in power since 2013, including re-elections in contests marred by accusations of fraud. He is currently serving his third term after being declared the winner of last year's presidential election, despite evidence that the opposition defeated him by a two-to-one margin. In October last year, Mr Maduro accused Mr Trump of seeking regime change and of \"fabricating a new eternal war\" against his country. He denies having any links to the illegal drug trade. He also claimed the US strikes targeting boats are illegal, amount to murder, and are acts of aggression. In a message to American citizens on 16 October, he said in English: \"Not war, yes peace. The people of the US, please.\""
    },
    {
        "title": "Why Trump's removal of Maduro is unprecedented",
        "description": "Donald Trump's removal of Nicolas Maduro as leader of Venezuela is completely unprecedented.",
        "url": "https://news.sky.com/story/why-trumps-removal-of-maduro-is-unprecedented-13489912",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maduro-trump_7096149.jpg?20251222104852",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2026-01-03 12:08:00",
        "Headline": "The details are still murky but whatever you make of Nicolas Maduro - a bad ruler and an illegitimate one by the end - the manner of his removal seems at odds with the principles of international law.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n Donald Trump's removal of Nicolas Maduro as leader of Venezuela is completely unprecedented. America has found ways of getting rid of leaders it doesn't like before, but never quite like this. Nation states do not send their armed forces into other sovereign nations to abduct their leader - least of all the United States, until recently considered the guardian of the rules-based world order. US strikes Venezuela: Follow latest The details are still murky but whatever you make of Nicolas Maduro, the manner of his removal seems at odds with the principles of international law. He was undoubtedly a very bad ruler and by the end utterly illegitimate. He rigged elections and ran Venezuela's economy so badly that a quarter of its population fled. Chief correspondent Contacts in Venezuela are telling us the mood in the country is tense and confusing, but that people are also feeling excited about what could come next.   In the capital Caracas, one person we are speaking to described the situation as \"kind of weird\" and explained that the streets are completely empty.   It is still the early morning so that may of course change.  She added that people simply \"can't believe what is happening\".   Another contact who lives outside the capital, messaged us saying this isn't just the best start to 2026, but \"the best start to my life\".  \"I have mixed feelings,\" he wrote, \"a lot of happiness, but I am also remembering my friends who died seeking freedom in 2014.\"  Many Venezuelans were killed in anti-government protests in 2014, and many more have been killed or imprisoned in the years since.  We recently spent weeks inside Venezuela, trying to understand what people thought about the growing pressure on Nicholas Maduro's government, and in Caracas, there was a veneer of normality, many didn't think the US would do anything.   Outside the capital, people were more anxious about the situation, and were worried about the economic impact any conflict may have.  Now, we are told, people are waiting to see what happens next.  But as one person messaged us:  \"The majority woke up happy.\" He used repression to stay in power at whatever the cost as his kleptocratic rule robbed a resource-rich country. Neighbouring countries will wring their hands while privately probably welcoming the end of Nicolas Maduro. But America's allies will worry where this leaves that rules-based world order. Read more:What we know so farHow did we get to this point? There are some reports Maduro was handed over by his own security forces turned by relentless American pressure. That may allow the Trump administration to present itself as enabling an internal change in power, but there is little doubt that none of this would have happened without the build-up of American firepower and whatever else it was doing behind the scenes. In the days and weeks ahead, the Trump administration will have to prove this episode does not open the door to more assaults on the principles of international law and that the ends justify the means. And the US government will have to make it clear on what terms it intends to bring Maduro to justice. Over the last year, America's allies have been increasingly alarmed by the damage done by Donald Trump to international law and the world order. They will also welcome the end of Nicolas Maduro - but will be uneasy about the way he's been removed."
    },
    {
        "title": "RAF carries out strikes against IS underground facility in Syria",
        "description": "British forces have bombed a suspected weapons stockpile &#8288;previously used by Islamic&#160;State in Syria.",
        "url": "https://news.sky.com/story/raf-carries-out-strikes-against-is-underground-facility-in-syria-13490152",
        "image_url": "https://e3.365dm.com/23/07/1920x1080/skynews-eurofighter-typhoon_6229942.jpg?20230725154636",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-03 23:46:00",
        "Headline": "Typhoon FGR4 combat jets were used to bomb the target, supported by a Voyager refuelling tanker.",
        "Content": "British forces have bombed a suspected weapons stockpile ⁠previously used by Islamic State in Syria. RAF Typhoons deployed guided bombs in a joint operation with the French air force on Saturday evening. The Ministry of Defence (MoD) said several access tunnels were targeted, located in a mountainous area north of the central ancient city of Palmyra. The operation aimed to \"help prevent any attempted resurgence of the Daesh terrorist movement\". Daesh is another name for Islamic State, often shortened to ISIS or IS. The facility had been used by IS, most likely to store weapons and explosives, and the surrounding area was devoid of civilians. There was no indication of any risk to the local population, and all aircraft involved in the operation returned safely. In December, the US launched strikes in Syria to \"eliminate ISIS fighters, infrastructure, and weapons sites\". \n                  Three police officers and six militants killed in shooting in Turkey \n                 \n                  Trump's claim US airstrikes in Nigeria hit ISIS targets 'sketchy', presidential adviser tells Sky News\n                 \n                  US launches 'large-scale' strikes to 'eliminate' Islamic State fighters in Syria after US citizens killed in desert\n                 The MoD said RAF Typhoon FGR4s, supported by a Voyager refuelling tanker, joined French aircraft in a joint strike on the underground facility. \"Our aircraft used Paveway IV guided bombs to target a number of access tunnels down to the facility; whilst detailed assessment is now underway, initial indications are that the target was engaged successfully,\" the statement added. Read more from Sky News:Syria targets Islamic State cellsISIS resurgent in SomaliaSyria moves past Assad Foreign news reporter Able to travel at searing speeds of up to Mach 1.8 - 2,222kph - the Typhoon fighter jet can carry out a variety of roles including high-intensity combat, the RAF says. First deployed with the RAF above Libya in 2011, the Typhoon has since been used in Iraq and Syria since 2015 as Western nations have sought to strike Islamic State targets. The UK is among several countries that have stocks of the Typhoon, along with Germany, Italy and Spain. In recent years the fourth-generation Typhoon has lost ground to the fifth-generation F-35, which has advanced stealth capabilities, but the Eurofighter has remained a key part of UK defence as a multirole fighter. They are frequently called upon to intercept and shadow Russian aircraft near UK airspace.  The UK is set to replace it with the Tempest sixth-generation fighter from 2035, which is still in development. Defence Secretary John Healey said the operation was designed to \"eliminate dangerous terrorists who threaten our way of life\". \"This action shows our UK leadership, and determination to stand shoulder to shoulder with our allies, to stamp out any resurgence of Daesh and their dangerous and violent ideologies in the Middle East,\" he said in a statement. Western ​aircraft have been conducting patrols ​to stop a resurgence of the Islamist militant group that ‍ruled parts of Syria until 2019."
    },
    {
        "title": "Managers of Swiss bar where fire killed 40 during New Year's event face criminal investigation",
        "description": "The two managers of a Swiss bar where at least 40 people were killed in a devastating fire have been put under criminal investigation.&#160;",
        "url": "https://news.sky.com/story/managers-of-swiss-bar-where-fire-killed-40-during-new-years-event-face-criminal-investigation-13490061",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-switzerland-le-constellation_7125382.jpg?20260103172443",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-03 17:45:00",
        "Headline": "The managers of Le Constellation bar in the ski resort of Crans-Montana are suspected of negligent homicide, negligent bodily harm and causing fire by negligence, police said in a statement.",
        "Content": "The two managers of a Swiss bar where at least 40 people were killed in a devastating fire have been put under criminal investigation.  The managers of Le Constellation bar in the ski resort of Crans-Montana are suspected of negligent homicide, negligent bodily harm and causing fire by negligence, police said in a statement. More than 100 people were injured in the fire which broke out in the early hours of Thursday as people celebrated the New Year. The process of identifying the dead and injured was still underway on Saturday, making it an agonising wait for family and friends wanting to know about their loved ones. It comes as an Italian 16-year-old was one of the first confirmed to have died in the fire, which prosecutors estimate reached between 400 and 600C. Chiara Costanzo's father, Andrea, told Italian newspaper Il Corriere della Sera that \"my beloved Chiara is no more\". Mr Costanzo told the news outlet earlier on Saturday that his daughter and her friends had chosen Le Constellation randomly, as other venues at the upmarket resort were full. \n                  Swiss bar fire: 'We saw terrible things - it could have happened to me'\n                 \n                  Swiss bar fire: Likely cause of resort blaze identified - as teen educated in UK named among missing\n                 \n                  How indoor fireworks keep causing deadly nightclub infernos \n                 Swiss police said four victims had been identified as two Swiss women aged 21 and 16, and two Swiss men aged 18 and 16. Their bodies have been returned to their families, police said. On Friday, Italian national Emanuele Galeppini, 17 and a golf prodigy, was the first victim to be reported dead, with news confirmed by the Italian Golf Federation. 'Bar checked thrice in 10 years' From initial investigation work, sparklers on champagne bottles are believed to be the likely cause of the fire. Switzerland's President Guy Parmelin described the deadly incident as \"one of the worst tragedies our country has ever known\". Read more:Footage shows Switzerland bar ceiling on fireSwitzerland: Witness describes moments after fire broke out A Swiss business register lists French couple Jacques and Jessica Moretti as the owners of Le Constellation. Switzerland's Tribune de Geneve reported that Mr Moretti told the newspaper the bar had been checked \"three times in 10 years\" and that \"everything was done within the standards\". The couple have two other establishments, one in Crans-Montana and another in nearby Lens. Investigators said the couple had been questioned, as have many others involved in the tragedy, as they gathered information on what happened at the New Year's event and what work was carried out on the bar in the past."
    },
    {
        "title": "Iran threatens Trump after 'locked and loaded' warning",
        "description": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports.",
        "url": "https://news.sky.com/story/iran-threatens-trump-after-locked-and-loaded-warning-13489824",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-trump_7124830.jpg?20260103034423",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-03 00:43:00",
        "Headline": "Iran's foreign ministry has accused the US president of \"escalating tensions in the region\" with his response to protests in recent days, which have turned deadly. Mr Trump had warned the US is \"locked and loaded\" to intervene.",
        "Content": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports. Iranian officials have been responding to the US president's pledge to \"rescue\" protesters if they were killed while demonstrating on the streets over a growing cost-of-living crisis. If Iran \"kills peaceful protesters, which is their custom, the United States of America will come to their rescue. We are locked and loaded and ready to go,\" Mr Trump wrote on Truth Social. In a statement on Friday evening, Iran's foreign ministry condemned the \"intimidating remarks\" and accused the US of \"escalating tensions in the region\". \"The Islamic Republic of Iran's response to any aggression will be swift, decisive, and comprehensive,\" it added. The US State Department shared a video of some of the protests on X. It said the \"courage of the Iranian people is undeniable\" and praised the demonstrators' \"resolve in the face of repression\". This week's protests are the biggest since nationwide demonstrations triggered by the death of 22-year-old Mahsa Amini in custody in 2022. The unrest has spread across the country, with deadly confrontations with security forces focused in western provinces. State-affiliated media and rights groups have reported at least 10 deaths ‌since Wednesday, including two men who authorities said were members of the Basij paramilitary force affiliated with the elite Revolutionary Guards. According to information verified by Hengaw Organisation for Human Rights, there have been 132 arrests during the recent unrest, including at least 12 women and 8 children. Protests erupted on Sunday in the capital, Tehran, with crowds largely chanting about economic grievances. Iran's economy has been battered by years of sanctions, and the country's currency has hit a record low against the US dollar as prices soar. Read more from Sky News:Trump threatens Iran if it rearmsYemen's independence planWhy is Tehran short of water? Protests turn deadly The unrest has seen students take to the streets of Tehran on Tuesday, demonstrators attempting to break into a government building on Wednesday, and then turning deadly as the violence escalated overnight into Thursday. Rights groups and social media posts reported protests in a number of cities across Iran late on ⁠Friday, including in three districts of the capital Tehran. Iran's hardliner politician Mohammad Bagher Qalibaf said in a post on X that Mr Trump's threat makes \"all American bases and forces across the region legitimate targets in response to any possible adventurism\". Mr Trump did ​not specify what sort of action the US could take in support of the protests, but America bombed Iranian nuclear facilities in June, joining an Israeli air campaign that targeted Tehran's atomic programme and military leadership."
    },
    {
        "title": "US general reveals how America captured Venezuela's president",
        "description": "Months of spying, ground forces and more than 150 aircraft were involved in the daring US operation against Venezuela's President Nicolas Maduro.",
        "url": "https://news.sky.com/story/us-general-reveals-how-america-captured-venezuelas-president-13490105",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maduro-nicolas_7125309.jpg?20260103162626",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-03 19:35:00",
        "Headline": "Fair weather allowed US helicopters to sneak into Venezuela - flying at just 100ft - before descending on Maduro's compound.",
        "Content": "Months of spying, ground forces and more than 150 aircraft were involved in the daring US operation against Venezuela's President Nicolas Maduro. Key details about how the US prepared and executed its operation - known as Operation Absolute Resolve - over months were revealed in a press conference on Saturday by General Dan Caine, the highest-ranking military officer of the armed forces. Caine, who is chairman of the joint chiefs of staff, described the operation as discreet and precise and said it was the culmination of months of planning and rehearsal. Follow the latest on US actions in Venezuela He cautioned reporters that he would share more details in a way that wouldn't compromise any tactics, techniques or procedures due to the possibility that this type of operation may be used again. US intelligence agencies watched and waited Caine praised US intelligence agencies, saying the mission wouldn't have been possible without the work of various intelligence agencies, including the CIA, NSA, and NCA. \n                  Venezuelan president Maduro combined swaggering incompetence with ruthless repression\n                 \n                  President Trump may walk away from Ukraine peace process, his eldest son says\n                 \n                  Dismissal of criminal charges against opponents derails Trump's revenge tour\n                 He set out how months of intelligence work enabled Washington to locate and understand Maduro's behaviour, patterns and routines. By early December, US forces were set, he said. These forces remained poised to strike in the weeks before Christmas, through to the New Year, awaiting the right requirements. Weather conditions were crucial to the raid, Mr Caine said, as optimal weather would minimise the potential for harm to civilians and personnel - while also maximising the element of surprise. On Friday, at 10.46pm in Washington (3.46am on Saturday in London), the weather in Venezuela had broken enough for President Trump to order the mission's go-ahead. American forces strike More than 150 aircraft launched as part of the operation. Helicopters took off with the extraction force and began approaching Venezuela while just 100ft above the water. Forces, including F-22s, F-35s, F-18s, E-18s, E-2s, B-1 bombers, and support aircraft, also closed in on the South American country. As they approached Caracas, Venezuela's capital, the Joint Air Component began using weapons to dismantle and disable the air defence systems in Venezuela. Mr Caine set out how officials believe US forces \"had maintained the element of surprise\" as the helicopter force approached its target at low level. US helicopters arrived at Maduro's compound at 1.01am EST (6.04am GMT), with the apprehension force descending into the building. The general explained that US helicopters came under fire and responded with \"overwhelming force\". One of the helicopters was hit, but it remained flyable. Ground forces were provided real-time updates by air and ground intelligence teams to ensure they could navigate the compound with as much information and as little risk as possible. The seizure and extraction of Maduro and his wife Maduro and his wife, Cilia Flores, who are both indicted by the US, were described by the general as having given up and were taken into custody. CNN reported that both Maduro and his wife were dragged from their bedroom by US forces. After seizing the president and his wife, helicopters were called in to extract the force and their captives. Despite fighter aircraft and drones engaging in suppressive fire, the general said there were multiple \"self-defence engagements\" as the force began to withdraw. However, the group managed to extract successfully and was over water at 3.29am EST (8.29am GMT). Read more from Sky News:\"The State of South Arabia\": plan for independence announcedHow sanctions are boosting Russian wineBoth Maduro and his wife were transported to the US Navy's amphibious assault ship USS Iwo Jima. President Trump later uploaded a photo of a captive Maduro on board the ship. In the press conference, Trump boasted of how \"not a single American service member was killed, and not a single piece of American equipment was lost\". He added that \"many helicopters, many planes, many people\" were involved in the operation. The president described the operation as \"an assault like people have not seen since World War Two\"."
    },
    {
        "title": "Iran threatens Trump after 'locked and loaded' warning",
        "description": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports.",
        "url": "https://news.sky.com/story/iran-threatens-trump-after-locked-and-loaded-warning-13489824",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-trump_7124830.jpg?20260103034423",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-03 00:43:00",
        "Headline": "Iran's foreign ministry has accused the US president of \"escalating tensions in the region\" with his response to protests in recent days, which have turned deadly. Mr Trump had warned the US is \"locked and loaded\" to intervene.",
        "Content": "Donald Trump has been threatened with a \"swift, decisive and comprehensive\" response by Iran if the US intervenes following growing unrest in the country, with at least 10 people killed and dozens of arrests, according to reports. Iranian officials have been responding to the US president's pledge to \"rescue\" protesters if they were killed while demonstrating on the streets over a growing cost-of-living crisis. If Iran \"kills peaceful protesters, which is their custom, the United States of America will come to their rescue. We are locked and loaded and ready to go,\" Mr Trump wrote on Truth Social. In a statement on Friday evening, Iran's foreign ministry condemned the \"intimidating remarks\" and accused the US of \"escalating tensions in the region\". \"The Islamic Republic of Iran's response to any aggression will be swift, decisive, and comprehensive,\" it added. The US State Department shared a video of some of the protests on X. It said the \"courage of the Iranian people is undeniable\" and praised the demonstrators' \"resolve in the face of repression\". This week's protests are the biggest since nationwide demonstrations triggered by the death of 22-year-old Mahsa Amini in custody in 2022. The unrest has spread across the country, with deadly confrontations with security forces focused in western provinces. State-affiliated media and rights groups have reported at least 10 deaths ‌since Wednesday, including two men who authorities said were members of the Basij paramilitary force affiliated with the elite Revolutionary Guards. According to information verified by Hengaw Organisation for Human Rights, there have been 132 arrests during the recent unrest, including at least 12 women and 8 children. Protests erupted on Sunday in the capital, Tehran, with crowds largely chanting about economic grievances. Iran's economy has been battered by years of sanctions, and the country's currency has hit a record low against the US dollar as prices soar. Read more from Sky News:Trump threatens Iran if it rearmsYemen's independence planWhy is Tehran short of water? Protests turn deadly The unrest has seen students take to the streets of Tehran on Tuesday, demonstrators attempting to break into a government building on Wednesday, and then turning deadly as the violence escalated overnight into Thursday. Rights groups and social media posts reported protests in a number of cities across Iran late on ⁠Friday, including in three districts of the capital Tehran. Iran's hardliner politician Mohammad Bagher Qalibaf said in a post on X that Mr Trump's threat makes \"all American bases and forces across the region legitimate targets in response to any possible adventurism\". Mr Trump did ​not specify what sort of action the US could take in support of the protests, but America bombed Iranian nuclear facilities in June, joining an Israeli air campaign that targeted Tehran's atomic programme and military leadership."
    },
    {
        "title": "London estate agent Dexters to hoist £500m 'for sale' sign",
        "description": "The private equity backers of London's biggest estate agency chain are exploring a potential sale valuing it at more than &#163;500m, despite the looming threat of Rachel Reeves' new \"mansion tax\".",
        "url": "https://news.sky.com/story/london-estate-agent-dexters-to-hoist-163500m-for-sale-sign-13489856",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-dexters-real-estate_7124910.jpg?20260103085352",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-03 08:38:00",
        "Headline": "The owner of a majority stake in the capital's biggest estate agency chain is lining up bankers at Barclays to explore a potential sale despite the looming spectre of Labour's new \"mansion tax\", Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The private equity backers of London's biggest estate agency chain are exploring a potential sale valuing it at more than £500m, despite the looming threat of Rachel Reeves' new \"mansion tax\". Sky News has learnt that Oakley Capital, which acquired a majority stake in Dexters in 2021, is close to hiring investment bankers to evaluate options for monetising its investment in the group. Dexters, which has scores of offices across the capital, including roughly 40 in Central London, was founded in 1993 by Jeff Doble. The company is now run by chief executive Andy Shepherd and chaired by Justin King, the former J Sainsbury boss who now chairs Allwyn, the National Lottery operator. In the year to 30 September 2024 - the last period for which accounts have been filed at Companies House - Dexters London reported underlying operating profit of more than £47m, up from just over £40m in the previous year. It recorded revenue during the more recent period of nearly £222m, fuelled by acquisitions and a growing market share. Lettings accounted for close to two-thirds of the company's total revenue. This weekend, banking sources said that Barclays was being lined up to advise on a potential sale of Dexters, although it was unclear whether it had been formally mandated yet. \n                  Snow warnings upgraded with bitterly cold weather expected to grip UK this weekend\n                 \n                  Search for missing third person called off after two people drown in the sea near Yorkshire\n                 \n                  Luke Littler wins second straight World Darts Championship defeating Dutchman Gian van Veen\n                 The sources added that the process was at a very preliminary stage, with no decisions taken about the timing or structure of any process. They suggested, however, that a valuation of between £500m and £600m was realistic. News of the potential sale comes just six weeks after Chancellor Ms Reeves confirmed plans for a tax on homes worth more than £2m, with a recurring levy to be imposed from 2028. Oakley Capital has backed prominent British businesses including the hospitality and media group Time Out and Thomas's London Day Schools, where a number of members of the royal family have been educated. It recently announced the purchase of a stake in Athena Racing, the British America's Cup team led by Sir Ben Ainslie, the decorated Olympian. Read more from Sky News:Hundreds of jobs to be lost in TGI Fridays insolvency planNext weighs cut-price swoop on fashion brand LK Bennett The private equity firm, headed by Peter Dubens, was reported to have invested £130m in Dexters in 2021, providing the company with a war chest to open new offices and make acquisitions. Since then, it has snapped up rivals including the London estate agent Marsh & Parsons and LiFE Residential. Industry sources said that Oakley owned a roughly 60% stake in Dexters. If it achieved a valuation in excess of £500m from a sale, that would make it worth significantly more than rival Foxtons, which is listed on the London Stock Exchange. Shares in Foxtons have fallen by more than 15% over the last year, leaving it with a market capitalisation of about £175m. Estate agency groups have generally had a poor run on the public markets in London, with Countrywide agreeing to a £130m takeover by rival Connells in 2021 following a number of profit warnings. The prospective sale of Dexters comes during a slowdown in the wider UK housing market, with house prices across the country rising last year by just 0.6%. London saw a 0.7% rise in the final quarter of the year, according to Nationwide, whose chief economist, Robert Gardner, said: \"Despite the softer end to the year, the word that best describes the housing market in 2025 overall is 'resilient'.\" The appointment of bankers at Dexters comes months after LRG, one of the UK's biggest estate agency groups, hired Rothschild to explore plans for an £800m sale. Oakley Capital declined to comment, while Dexters has been contacted for comment."
    }
]