[
    {
        "title": "Pope Francis funeral: 250,000 people bid farewell to pontiff who said 'build bridges, not walls'",
        "description": "Tens of thousands of people packed St Peter's Square for the funeral of Pope Francis before his body was carried through the streets of Rome.",
        "url": "https://news.sky.com/story/tens-of-thousands-gather-to-say-farewell-to-pope-francis-13355764",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-francis-funeral_6897206.jpg?20250426114331",
        "type": "Home",
        "Author": "Michael Drummond",
        "Date Published": "2025-04-26 06:59:00",
        "Headline": "St Peter's Square in The Vatican is packed as Pope Francis's funeral begins.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  Tens of thousands of people packed St Peter's Square for the funeral of Pope Francis before his body was carried through the streets of Rome. Royals, world leaders and cardinals joined scores of worshippers at The Vatican, as mourning of the pontiff - the 266th since St Peter - transcended wealth and social class. In keeping with Francis's life as a breaker of tradition, many of the more elaborate and expensive rituals customary for the burial of popes have been foregone in favour of simpler options. Around 250,000 people attended the funeral, with around 50,000 packing out St Peter's Square to watch the service before the coffin bearing the pontiff began its journey through the streets of the Italian capital.  Follow live: Pope Francis funeral service latest updates His body had been lying in state since his death aged 88 on Easter Monday, spending the last few days in St Peter's Basilica to allow mourners to pay their respects. The Vatican - where the funeral service took place - and Rome - where Francis has been laid to rest - have been under heavy security, with a no-fly zone overhead. President Donald Trump and Joe Biden, along with Sir Keir Starmer, President Emmanuel Macron and Ukraine's President Volodymyr Zelenskyy, headlined a huge selection of global leaders and dignitaries. Read more:How the Pope's funeral unfoldedFull order of service for Pope's funeralPope Francis's funeral in pictures Francis's coffin was taken out into St Peter's Square where 220 cardinals and 750 bishops and priests sat in rows, waiting to say goodbye to the Bishop of Rome. The pontiff eschewed the elaborate coffins used by many of his predecessors, opting instead for a simple wooden casket lined with zinc - a reflection of his efforts to reform the papacy and build \"a poor church for the poor\".  A series of sermons and prayers began with Cardinal Giovanni Battista Re reading the Penitential Act - a way for the faithful to confess their sinfulness. This was followed by the Liturgy of the Word, a part in Catholic mass where faithful gather to hear and reflect on the word of God. Cardinal Re then delivered the homily, speaking about Pope Francis' life and service to God.  The cardinal praised the pontiff as someone who \"touched the minds and hearts of people\" who was \"attentive to the signs of the times\". He added: \"Despite his frailty and suffering towards the end, Pope Francis chose to follow this path of self-giving until the last day of his earthly life.\" He said Francis \"was a pope among the people, with an open heart towards everyone\". Cardinal Re also repeated one of Francis's strongest criticisms of President Trump - who was in the audience - with a call to \"build bridges, not walls\". He also called for care for migrants and action on climate change. As the service in front of St Peter's Basilica drew to a close, Cardinal Re blessed the pope's coffin with holy water. At the end of the mass, the choir sang in Latin: \"May the angels lead you into paradise; may the martyrs come and welcome you and take you into the holy city, the new and eternal Jerusalem.\" The coffin was then carried back into St Peter's Basilica through the 'doors of death', as a 10-ton funeral bell tolled. Pope Francis's body then left the basilica aboard a white truck and was taken in procession through the streets of Rome to his final resting place at his favourite church, the Basilica of Santa Maria Maggiore. There were cheers and applause from the public on either side of the roads as the cortege passed them. Upon arrival, Pope Francis's body was ushered into the basilica - which is dedicated to the Virgin Mary - by prisoners and migrants, a last reflection of his priorities as pope. In a break with tradition, Pope Francis outlined in his will his request to be buried \"in the ground, without particular ornamentation\" but simply with the inscription \"Franciscus\". The burial ceremony itself took place in private."
    },
    {
        "title": "What Sky News correspondents witnessed at the Pope's funeral",
        "description": "Hundreds of thousands of Catholics descended on Vatican City for Pope Francis's funeral on Saturday.",
        "url": "https://news.sky.com/story/what-sky-news-correspondents-witnessed-at-the-popes-funeral-13356565",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-funeral-farncis_6897228.jpg?20250426115959",
        "type": "Home",
        "Author": "Adam Parsons, Europe correspondent, and Lisa Holland, Sky correspondent",
        "Date Published": "2025-04-26 18:42:00",
        "Headline": "Amid the formal funeral proceedings, Sky News correspondents reporting from St Peter's Square and Rome came across the unexpected - from nuns sprinting to secure their place in the queue to teenagers playing Uno as the funeral played out on big screens above them.",
        "Content": "By Adam Parsons, Europe correspondent, and Lisa Holland, Sky correspondent   Hundreds of thousands of Catholics descended on Vatican City for Pope Francis's funeral on Saturday. World leaders, including President Donald Trump and Ukraine's Volodymyr Zelenskyy, were among those who flew in to pay their respects. Follow live: Pope Francis funeral service But amid the formal proceedings, Sky News correspondents reporting from St Peter's Square and Rome witnessed the unexpected - from nuns sprinting to secure their place in the queue to teenagers playing Uno as the funeral played out on big screens above them. Here they reflect on the historic day for the Catholic Church and its faithful.  Adam Parsons, Europe correspondent in Vatican City Normally the streets around the Vatican are quiet at this time, dotted with a few rough sleepers and passing security personnel. Not this time. Via della Conciliazione is the road that runs from the Tiber all the way up to St Peter's Square and, before the sun had risen, there were long queues to get through the checkpoint in order to secure a prime viewing location. And when the gates were opened, and as more and more people came through, so the rush became greater. A trickle became a torrent - first people strolled towards the front, then they jogged and then, eventually, I saw three nuns, sprinting as fast as they could. But what I had expected to see in St Peter's Square was not, in fact, what I did see. I thought I'd bear witness to a lot of sobbing and sadness. Instead, in our section of the square, we were surrounded by dozens of teenagers; all affiliated to church youth groups, sitting on the ground and playing Uno. They stayed for the day, watching on the big screens along with the rest of the crowd. They applauded, watched patiently and then, when they saw President Volodymyr Zelenskyy, cheered their approval. Nobody, other than the Pope, got a warmer ovation than the Ukrainian president. Read moreWho was at the funeral and who wasn'tThe funeral in picturesHow will the new pope be chosen? What we didn't know at the time was that Zelenskyy had just met Donald Trump, not that Trump had had second thoughts about Vladimir Putin's reliability. But come the end of the service, the news had filtered through. So could the funeral have been a catalyst for an outbreak of peace, or at least a step or two in the right direction? As if by providence, at the very moment our team was discussing this, Michelle O'Neill, first minister of Northern Ireland, wandered past. \"Well that would be some legacy indeed from Pope Francis wouldn't it? And I hope that's the case.\" So did she worry that the Catholic Church will choose a more conservative successor to Pope Francis, I ask? Would she rather a Pope who continues Francis's path of reform and, by comparison with his predecessor, liberal thinking. She nodded, smiling. \"I think that his legacy is something that we want to be able to carry on. You know, we want him to be a living legacy. I hope the incoming Pope has the same qualities, that same approach to the leadership role they provide. \"I think Pope Francis is a lesson to so many people in terms of what we need, which is inclusion. What we need is a more unified society.\"  Lisa Holland, Sky correspondent in Rome \"He left us. He went to the sky,\" said Sister Annalisa Serra gesturing upwards. \"But surely from there he is enjoying seeing us all here since we love him a lot.\" The sentiment from the nun from Sardinia kind of encapsulated the Pope's funeral. Again and again people told us they felt Pope Francis - who was happiest among the people - would be with them, not the dignitaries, given a choice. That's not to say he wouldn't have taken the opportunity to speak his mind to the world and the Catholic Church's most powerful first. But, at heart, Francis's papacy was defined by his connection with ordinary Catholics. This weekend was originally billed as a special event in the Catholic calendar with 150,000 youngsters coming to Vatican City from around the world for a youth jubilee. Their trips were long planned and they could never have imagined that when the date came their event would be overshadowed by the funeral of Pope Francis. But the presence of the young faces gave a really youthful feel to the day - and a sense of unexpected joviality as we witnessed various groups burst into spontaneous song and applause to celebrate the former pontiff's life. Pope Francis recognised the importance of listening to the next generation. The crowd was an incredible mix of people of all nationalities and backgrounds. Part of the Pope's legacy is the growth of the Catholic Church particularly in countries like the Philippines where it makes up 80% of the population. Sister Richelle Elena - who is from the Philippines and came to watch Pope Francis's coffin pass by on the papal vehicle - said: \"We call him lolo kiko- our grandfather - and he is very close to us Filipinos because he embodies our values, the importance of families, dialogue, communion.\" Nicholas Bridges travelled with his pregnant wife Ludovica and their young children from the outskirts of Rome. It's a lot taking a one-year-old and a three-year-old to a public event attracting 400,000 people. \"It's an early start but it's such a historic event we had to come,\" said Nicholas. Elise Gascon from France wanted to share the moment with her grandparents. She said she came so she could tell them what it was like in St Peter's Square on the day the world's Catholics said goodbye to their spiritual leader."
    },
    {
        "title": "Trump criticises Putin after potentially 'historic' meeting with Zelenskyy before Pope's funeral",
        "description": "Donald Trump has criticised Vladimir Putin and suggested a shift in his stance towards the Russian president after a meeting with Volodymyr Zelenskyy before the Pope's funeral.",
        "url": "https://news.sky.com/story/trump-met-with-zelenskyy-ahead-of-popes-funeral-13355783",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-zelenskyy_6897159.jpg?20250426110945",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-26 07:57:00",
        "Headline": "The Ukrainian president said his first face-to-face meeting with Mr Trump since their public row at the White House could be \"historic\". ",
        "Content": " Donald Trump has criticised Vladimir Putin and suggested a shift in his stance towards the Russian president after a meeting with Volodymyr Zelenskyy before the Pope's funeral. The Ukrainian president said the one-on-one talks could prove to be \"historic\" after pictures showed him sitting opposite Mr Trump, around two feet apart, in the large marble hall inside St Peter's Basilica. The US president said he doubted his Russian counterpart's willingness to end the war after leaving Rome following the funeral of Pope Francis at the Vatican. Follow live updates: 200,000 mourn at Vatican In a post on his Truth Social platform, he said \"there was no reason\" for the Russian president \"to be shooting missiles into civilian areas, cities and towns, over the last few days\". He added: \"It makes me think that maybe he doesn't want to stop the war, he's just tapping me along, and has to be dealt with differently, through 'Banking' or 'Secondary Sanctions?' Too many people are dying!!!\" The meeting between the US and Ukrainian leaders was their first face-to-face encounter since a very public row in the Oval Office in February. Mr Zelenskyy said he had a good meeting with Mr Trump in which they talked about the defence of the Ukrainian people, a full and unconditional ceasefire, and a durable and lasting peace that would prevent the war restarting. Other images released by the Ukrainian president's office show Sir Keir Starmer and French President Emmanuel Macron were present for part of the talks, which were described as \"positive\" by the French presidency. Mr Zelenskyy's spokesman said the meeting lasted for around 15 minutes and he and Mr Trump had agreed to hold further discussions later on Saturday. But the US president left Rome for Washington on Air Force One soon after the funeral without any other talks having taken place. The Ukrainian president's office said there was no second meeting in Rome because of the tight schedule of both leaders, although he had separate discussions with Mr Starmer and Mr Macron. The French president said in a post on X \"Ukraine is ready for an unconditional ceasefire\" and that a so-called coalition of the willing, led by the UK and France, would continue working to achieve a lasting peace. There was applause from some of the other world leaders in attendance at the Vatican when Mr Zelenskyy walked out of St Peter's Basilica after stopping in front of the pontiff's coffin to pay his respects. Sir Tony Brenton, the former British ambassador to Russia, said the event presents diplomatic opportunities, including the \"biggest possible meeting\" between Mr Trump and the Ukrainian leader. He told Sky News it could mark \"an important step\" in starting the peace process between Russia and Ukraine. Professor Father Francesco Giordano told Sky News the meeting is being called \"Pope Francis's miracle\" by members of the clergy, adding: \"There's so many things that happened today - it was just overwhelming.\" The bilateral meeting comes after Mr Trump's peace negotiator Steve Witkoff held talks with Mr Putin at the Kremlin. They discussed \"the possibility of resuming direct negotiations between Russia and Ukraine\", Kremlin aide Yuri Ushakov said. 👉 Listen to Sky News Daily on your podcast app 👈 Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022. Mr Trump has claimed a deal to end the war is \"very close\" and has urged Mr Zelenskyy to \"get it done\" in a post on his Truth Social platform. He has previously warned both sides his administration would walk away from its efforts to achieve a peace if the two sides do not agree a deal soon. Meanwhile, the Polish armed forces said a Russian military helicopter violated its airspace over the Baltic Sea on Friday evening. \"The nature of the incident indicates that Russia is testing the readiness of our air defence systems,\" they said in a post on X."
    },
    {
        "title": "Counter-terrorism police investigating after two women injured in Leeds",
        "description": "Counter-terrorism police are investigating after an incident involving a crossbow and a firearm left two women injured in Leeds. ",
        "url": "https://news.sky.com/story/man-with-crossbow-and-firearm-detained-in-leeds-after-two-women-injured-13356479",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-leeds-police_6898173.jpg?20250426192058",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-26 17:23:00",
        "Headline": "Officers arrived at the scene to find two women injured - and a 38-year-old man with a self-inflicted injury.",
        "Content": "Counter-terrorism police are investigating after an incident involving a crossbow and a firearm left two women injured in Leeds.  Police were called to Otley Road at 2.47pm on Saturday to reports of a \"serious incident involving a man seen with weapons\", West Yorkshire Police said. Officers arrived at the scene to find two women injured - and a 38-year-old man with a self-inflicted injury. All three were taken to hospital, with the man held under arrest, but their injuries are not believed to be life-threatening. \"Two weapons have been recovered from the scene, which were a crossbow and a firearm,\" Counter Terrorism Policing North East said in a statement. The incident happened on the 'Otley Run' pub crawl, with one venue saying it was closed for the evening due to \"unforeseen circumstances\". Counter Terrorism Policing's statement added: \"Due to the circumstances surrounding the incident, Counter Terrorism Policing North East have taken responsibility for leading the investigation with the support of West Yorkshire Police. \"Extensive enquiries continue to establish the full circumstances and explore any potential motivation.\" Home Secretary Yvette Cooper described it as a \"serious violent incident\" and said she was being kept updated by police. \"Thank you to the police and emergency services for their swift response,\" she said. \"My thoughts are with the victims and all those affected by this attack.\""
    },
    {
        "title": "Chris Eubank Jr taken to hospital after defeating Conor Benn by unanimous decision in middleweight clash",
        "description": "Chris Eubank Jr has been taken to hospital after defeating Conor Benn by unanimous decision.",
        "url": "https://news.sky.com/story/chris-eubank-jr-beats-conor-benn-by-unanimous-decision-in-middleweight-clash-13356682",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-conor-benn-chris-eubank-jr_6898427.jpg?20250426232000",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-26 21:37:00",
        "Headline": "After going the full 12 rounds, all three judges unanimously gave 116-112 on the scorecards in favour of Eubank Jr.",
        "Content": "Chris Eubank Jr has been taken to hospital after defeating Conor Benn by unanimous decision. After going the full 12 rounds at London's Tottenham Hotspur Stadium, all three judges unanimously gave 116-112 on the scorecards in favour of Eubank Jr. Just before midnight, Eubank Jr's promoters, Boxxer, said the 35-year-old had been taken to hospital as a precautionary measure \"on recommendation of the onsite doctor\". In the ninth round, Eubank Jr suffered a cut above his right eye from a clash of heads. Eubank Jr said after winning the bout: \"I didn't expect Conor to be the guy to [bring it out of me]. I didn't know he had that in him, I thought I would break him early. \"I underestimated him, I didn't prepare for a fight like that.\" His father, legendary boxer Chris Eubank, said he was \"so proud\" of his son, and praised Benn as \"extraordinary\". Eubank Jr was the more experienced of the pair, going into the fight with a record of 34-3, with 25 knockouts. Benn, 28, won all 23 of his professional fights, 14 by knockouts. Benn was faster out of the gate, forcing Eubank Jr to evade power punches and leaving him weak on his feet at times. In the fifth round, Eubank Jr began beating Benn to the punch, before the fight ended in a sprint with both men landing heavy blows. Speaking in the ring after defeat, Benn said: \"I'm not going to say I deserved to win it, I have to watch it back. \"Maybe I stayed on the ropes a bit too long. Chris is a good fighter. \"All the fighting talk is fighting talk. I'd love the rematch.\" Later at a post-fight news conference, he admitted that \"I wasn't good enough... I need to do better\", before again calling for a rematch and saying \"I want my revenge\". He then wished Eubank Jr a \"speedy recovery\" and claimed \"I've heard he's got a broken jaw\". Read more from Sky News:Wrexham promoted for third season in a rowSky's Beth Rigby running London marathon in honour of 'dearest friend' Benn's father Nigel had fought with Eubank Sr twice in the 1990s. In November 1990, Eubank Sr beat Nigel Benn by a ninth-round stoppage in Birmingham to take the WBO middleweight title. The rematch was three years later at Old Trafford. It ended in a split-decision draw. Last night's match was a long time in the making - called off in 2022 when Benn tested positive for traces of fertility drug clomifene. The World Boxing Council cleared Benn of intentional doping in 2023, saying a \"highly elevated consumption of eggs\" was a reasonable explanation. Ahead of the fight, Eubank Jr was fined for being fractionally over the 160lb middleweight limit, at 160.05lbs."
    },
    {
        "title": "Fourteen dead and more than 700 injured after chemical explosion at Iran's largest port",
        "description": "Fourteen people have died and more than 700 been injured after a chemical explosion at Iran's largest port, according to state media.",
        "url": "https://news.sky.com/story/four-dead-and-more-than-500-injured-after-chemical-explosion-at-irans-largest-port-13355946",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tehran-explosion_6897400.jpg?20250426141923",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-26 13:00:00",
        "Headline": "Iran's interior minister Mostafa Mohammad Najjar told state TV that 14 people have died after the blast at Rajaei port. More than 700 have been injured, the head of the country's rescue organisation added.",
        "Content": " Fourteen people have died and more than 700 been injured after a chemical explosion at Iran's largest port, according to state media. The blast saw a huge cloud of black and orange smoke billow above Rajaei port, near the city of Bandar Abbas on Saturday. Its impact shattered windows up to 16 miles away, with social media footage showing an office block near the port with its doors blown off. Iran's interior minister Mostafa Mohammad Najjar confirmed that 14 people have died. Babak Mahmoudi, head of Iran's rescue organisation, said more than 700 people sustained injuries. Emergency workers were seen rescuing people among the debris, with footage showing the wounded crowding at the entrance of a nearby hospital. Read more from Sky NewsPope Francis's coffin arrives at resting placeKim Jong Un reveals new destroyerWhat happened in Kashmir? Hossein Zafari, a spokesperson for the Islamic Republic's crisis management organisation, told the ILNA news agency that the cause of the blast was \"the chemicals inside the containers\" but did not elaborate further. State TV reported that poor handling of flammable materials was a \"contributing factor\". Iran's interior ministry said it has launched an investigation.  Rajaei port is around 650 miles southeast of Tehran on the Strait of Hormuz. It is the largest in the country, handling 80 million tonnes of goods every year. Industrial accidents are relatively common in Iran, which suffers from ageing oil infrastructure under international sanctions. Another incident in Bandar Abbas killed one worker in 2023. Saturday's blast came as UN officials met in Oman for the third round of negotiations over Iran's rapidly advancing nuclear programme."
    },
    {
        "title": "Labour and Reform in battle for Runcorn by-election seat - but disillusionment could be eventual winner",
        "description": "On the banks of the Mersey, Runcorn and Helsby is a more complicated political picture than the apparent Labour heartland that first presents itself.",
        "url": "https://news.sky.com/story/labour-and-reform-in-battle-for-runcorn-by-election-seat-but-disillusionment-could-be-eventual-winner-13356673",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rob-runcorn_6896328.jpg?20250425124309",
        "type": "Home",
        "Author": "Rob Powell",
        "Date Published": "2025-04-26 23:01:00",
        "Headline": "Labour's first big electoral test takes place next week as voters head to the polls for the Runcorn and Helsby by-election. It comes after the resignation of former MP Mike Amesbury, convicted earlier this year of assaulting a constituent.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n On the banks of the Mersey, Runcorn and Helsby is a more complicated political picture than the apparent Labour heartland that first presents itself. Yes, there are industrial and manufacturing areas - an old town that's fallen victim to out-of-town shopping, and an out-of-town shopping centre that's fallen victim to Amazon. But there are also more middle-class new town developments, as well as Tory-facing rural swathes. One thing this area does mirror with many across the country, though, is a fed-up electorate with little confidence that politics can work for them. In the Space Cafe in Runcorn Old Town, its director Marie Moss says many in the region remember a time when a sense of community was more acute. \"People were very proud of their town… and that's why people get upset and emotional as they remember that,\" she says. It's this feeling of disenfranchisement and nostalgia-tinged yearning for the past that Reform UK is trading off in its targeting of traditional Labour voters here. \n                  Vincent Nichols: British cardinal who will be in the conclave says picking the next pope is 'intimidating'\n                 \n                  Liverpool defender Virgil van Dijk signs new contact with Premier League club\n                 \n                  Man arrested on suspicion of murder after woman stabbed in Liverpool flat\n                 Party leader Nigel Farage features heavily on leaflets in these parts, alongside spikey messaging around migration, law and order, and Labour's record in government so far. Taxi driver Mike Holland hears frequent worries about that record from those riding in the back of his cab. A Labour voter for decades, he says locals were \"made up\" at last year's election result but have been \"astonished\" since then, with benefit changes a common topic of concern. \"Getting a taxi is two things, it's either a luxury or a necessity... the necessity people are the disabled people… and a lot of the old dears are so stressed and worried about their disability allowance and whether they are going to get it or not get it,\" he says. But will that mean straight switchers to Reform UK? Mike says he agrees with some of what the party is offering but thinks a lot of people are put off by Mr Farage. He's now looking at the Liberal Democrats and Greens, both of whom have put up local politicians as candidates. Or, Mike says, he may just not vote at all. It's in places like Runcorn town that some of the political contradictions within Reform UK reveal themselves more clearly. Many here say they were brought up being told to never vote Tory. And yet, Reform, chasing their support, has chosen a former Conservative councillor as its candidate. It's no surprise Labour has been trialling attack lines in this campaign, painting Mr Farage's party as \"failed Tories\". As a response to this, look no further than Reform's recent nod to the left on industrialisation and public ownership. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Read more:Tough test for Labour after MP quitsMP jailed for late-night brawlLocal elections could re-shape politics But head 15 minutes south from Runcorn docks, and this by-election campaign changes. Rural areas like Frodsham and Helsby have, in the past, tended towards the Tories. The Conservatives, of course, have a candidate in this vote, one who stood in a neighbouring constituency last year. But Reform is now making a hard play for their supporters in these parts, with a softer message compared to the one being put out in urban areas - an attempt to reassure those anxious about too much political revolution coming to their privet-lined streets. Labour, meanwhile, is actively trying to mobilise the anti-Farage vote by presenting their candidate - another local councillor - as the only person who can stop Reform. The pitch here is aimed at voters like Frodsham makeup artist Nadine Tan, who are worried about division and anger in the community. \"I think they need to kind of come together and stop trying to divide everyone,\" she says. But like Mike the taxi driver five miles north, disillusionment could be the eventual winner as Nadine says, despite the \"thousands of leaflets\" through her door, she still thinks \"they all say the same thing\". One factor that doesn't seem to be swinging too many votes, though, is the insalubrious circumstances in which the area's former Labour MP left office. Mike Amesbury stepped down after being convicted of repeatedly punching a constituent in a late-night brawl outside a pub. But across the patch, many praise their ex-MP's local efforts, while also saying he was \"very silly\" to have acted in the way he did. That may be putting it mildly. But it's hard to find much more agreement ahead of Thursday's vote. A constituency still hungry for change, but unsure as to who can deliver it. Full list of candidates, Runcorn and Helsby by-election: Catherine Anne Blaiklock - English DemocratsDan Clarke - Liberal PartyChris Copeman - Green PartyPaul Duffy - Liberal DemocratsPeter Ford - Workers PartyHowling Laud Hope - Monster Raving Loony PartySean Houlston - ConservativesJason Philip Hughes - Volt UKAlan McKie - IndependentGraham Harry Moore - English Constitution PartyPaul Andrew Murphy - Social Democratic PartySarah Pochin - Reform UKKaren Shore - LabourJohn Stevens - Rejoin EUMichael Williams - Independent"
    },
    {
        "title": "Upskirted, assaulted, accused of faking their music skills: Why female DJs need to be 'bulletproof'",
        "description": "To see Koven's Katie Boyle perform live is beyond impressive. Hailing from Luton, she&#160;is one of the most influential women in drum 'n' bass today, an artist who pioneered the art of singing live while DJing.&#160;",
        "url": "https://news.sky.com/story/upskirted-assaulted-accused-of-faking-their-music-skills-why-female-djs-need-to-be-bulletproof-13355492",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-djs-misogyny-spencer_6897812.jpg?20250426170525",
        "type": "Home",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-26 23:01:00",
        "Headline": "As the great and the good of the dance world gathered in Ibiza for the industry's annual International Music Summit, female DJs spoke to Sky News about their experiences of misogyny.",
        "Content": "\n          Arts and entertainment correspondent\n        To see Koven's Katie Boyle perform live is beyond impressive. Hailing from Luton, she is one of the most influential women in drum 'n' bass today, an artist who pioneered the art of singing live while DJing.  Although she's now been doing it for 12 years, her vast knowledge doesn't silence the trolls online. \"There is a real bad misogyny online against women,\" she says of the industry, with plenty of critics refusing to \"believe they're doing what they say they're doing, and that's been quite a hard thing to combat\". Koven is a duo. In the studio, Boyle collaborates with producer Max Rowat; live, she performs and mixes alone. They have just released their second album, Moments In Everglow. While both Boyle and Rowat are equally involved in making tracks, a minority of very vocal fans still refuse to accept she does anything other than sing. \"I will always be accused of the male half doing more on anything to do with technology,\" says Boyle. \"The amount of comments [I get] to say, 'she didn't make this'. No explanation as to why they think that it is, just purely because [I'm] a woman, which is just mad.\" While Boyle loves performing live, there are moments, she admits, where being one of the few women on the scene can feel unsafe. \"I've had some awful incidences,\" she says. \"I had someone run on stage and completely grab me, hand down my top, down my trousers, while I was on the stage, which is crazy because you think that's happening in front of an audience. I mean, this guy literally had to be plied off me. \"That was when I did think, 'I need to bring someone with me to most places'. I didn't feel safe travelling around by myself.\" 'You get trolled for everything' Sadly, Boyle isn't alone. Over a 30-year career, DJ Paulette has scaled the heights of dance music fame, playing throughout Europe, with a residency back in the day at Manchester's Hacienda. \"Let's just say I have two towels on my rider and it's not just because I sweat a lot,\" she jokes, miming a whack for those around her. \"I've spent time in DJ booths where I've had a skirt on and people have been taking pictures up my skirt. People think upskirting is a joke... and I got fed up with it.\" Wearing shorts, she says, she still ended with \"people with their hands all over me\". Now, she sticks to trousers. \"But we shouldn't have to alter the way we look for the environment that we work in.\" She admits, in order to stick it out, she's had to bulletproof herself. \"You get trolled for everything, for the way you look - if you put on weight, if you've lost weight.\" Not only is the discourse towards female DJs different online, she says, she has also been repeatedly told by those working in the industry that because she's a woman, she has a sell-by date. \"I went for dinner with three guys... one of them said to me, 'you know Paulette there is no promoter or organiser who is ever going to employ a black female DJ with grey hair', and they all laughed. \"That was them saying to me that my career was over, and I was in my 40s. At the time, I felt crushed... I think it really does take women who have a real steel will to make their way through.\" 'I will not stop talking about it' As the great and the good of the dance world gather in Ibiza for the industry's annual International Music Summit, with dance music more popular than ever there is of course much to party about. But for BBC Radio 1 broadcaster and DJ Jaguar, one of this year's summit's cohosts, some serious conversations also need to be had. \"You can get off the plane and look at the billboards around Ibiza and it's basically white men - David Guetta, Calvin Harris, and they are incredible artists in their own right - but the women headliners, there's barely any visibility of them, it's awful.\" She adds: \"I will not stop talking about it because it is the reality.\" Trolling and safety are also big concerns. \"You're in these green rooms, there's a lot of people there, drinking and doing other things... and I've walked into green rooms where I felt incredibly uncomfortable, especially when I was a bit younger. I was on my own, it's like 2am, and you have to watch yourself.\" Male DJs don't have the same stories She says she has female friends who have had drinks spiked when they were DJing. But her male friends? \"They don't have the same stories to tell me.\" Creamfields, arguably the UK's biggest dance festival, is emblematic of the gender imbalance. It remains one of the least representative festivals in terms of female artists, with last year's line-up more than 80% male. Read more from Sky News:Why gaming still has a women problem'There is no HR department in the music industry' Laila MacKenzie, founder of Lady Of The House, a community that supports and tries to encourage more women into dance music, says the talent pipeline problem isn't helped by the current discourse online. \"There is a real damaging factor how people can be really nasty online and really nasty in the media and how that actually may discourage and demotivate women from stepping forward into their talent,\" she says. In reality, for so many women working within dance music, the trolling can be so unpleasant that it's drowning out the good. \"There is so much positivity and so many lovely and supportive people,\" says Boyle. \"But unfortunately it feels like the negative and the toxic energy is just louder sometimes.\""
    },
    {
        "title": "Direct action group Just Stop Oil holds final protest, claiming it has been 'successful'",
        "description": "\"It has been a success.\"",
        "url": "https://news.sky.com/story/direct-action-group-just-stop-oil-holds-final-protest-claiming-it-has-been-successful-13356667",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-just-stop-oil-jso_6898357.jpg?20250426220143",
        "type": "Home",
        "Author": "Rachael Venables",
        "Date Published": "2025-04-26 20:51:00",
        "Headline": "Just Stop Oil insists it's been \"successful\" - as it ceremoniously hangs up its orange high-vis vests during a march in central London on Saturday.",
        "Content": "\n          News correspondent\n              @rachaelvenables\n  \"It has been a success.\" Just Stop Oil (JSO) insists it's been \"successful\" - as its members ceremoniously hang up their orange high-vis vests during a march in central London. Since the group formed three years ago, it's drawn attention and criticism for its colourful, controversial protests, which ranged from disrupting sporting events to throwing soup on Vincent van Gogh's Sunflowers, and climbing on gantries over the M25. It sprayed orange paint over Stonehenge, and cost police forces tens of millions of pounds. Those days are now behind it; to the relief of many. Read moreJSO co-founder wins court appealActivists target grave of Charles Darwin77 year old JSO activist recalled to prison As a few hundred activists marched through London on Saturday, blocking roads as they went; taxi drivers blared their horns and football fans shouted abuse from the pavement. The PA News Agency filmed the moment a white minivan seemed to drive towards a group of protesters blocking the road. Protesters shouted \"I'm being pushed back!\" to police, while the driver could be heard shouting \"What about my right to get home?\" to the officers gathered. But JSO never set out to be popular. And it believes its tactics - though hated - have been successful; thanks to the new Labour government's commitment to not issue new oil or gas exploration licences. That's why, it says, its ceasing direct action. \"This moment marks the success of the JSO campaign - our demand was to end new oil and gas licences and that is now government policy. \"As a result of which four billion barrels of oil are being kept under the North Sea. The campaign has reached a natural end.\" Dr Oscar Berglund, senior lecturer in international public and social policy, disagrees that JSO is disappearing because it's been \"successful\". He told Sky News policing strength and public perception might have more to do with it. \"They have very low levels of popularity. About 17% of the British population are kind of broadly supportive of what Just Stop Oil do. And that's too low to recruit. \"It's difficult to recruit members to something that is that unpopular, and then that a lot of people for good reason I think have kind of stopped believing in that kind of disruption as a means to achieve meaningful change.\" Group triggers specific new protest laws One thing it did change is the law. Policing commentator Graham Wettone tells us: \"Obstruction of the highway, obstruction of rail networks for example, these are specific offences now. \"It's given the police more tactics, more methods, more offences they can consider, even stopping and searching somebody who may have something to either lock themselves on or glue themselves to something.\" Emma Smart was held in prison for her activism with both Insulate Britain and Just Stop Oil. \"The high-vis might be going away,\" she tells me, \"but we aren't.\" \"These people aren't going anywhere, we are still committed, dedicated, terrified by the failings of this government and governments around the world.\" She hopes for a time of reflection before it returns in a new form but says the need for climate activism is stronger than ever. She also believes that while most people dislike JSO tactics, it still raises awareness of the cause and might even push people to more moderate campaign groups. Just Stop Oil came behind other, similarly controversial climate campaign groups like Insulate Britain and Extinction Rebellion, and as it says goodbye, its disruptive methods have been seized upon by other organisations like the Pro-Palestinian Youth Justice. The infamous Just Stop Oil orange vests might be going away, but the individual activists, their cause and campaign tactics feel here to stay."
    },
    {
        "title": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died, her family says",
        "description": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41.",
        "url": "https://news.sky.com/story/virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-has-died-her-family-says-13355731",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-virginia-giuffre-prince-andrew_5632076.png?20220104082248",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-04-26 01:08:00",
        "Headline": "Virginia Giuffre's family has told Sky's US partner network NBC News she took her own life at her farm in Western Australia.",
        "Content": " Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41. In a statement to Sky's US partner network NBC News on Friday, her family said she took her own life in the Perth suburb of Neergabby, Australia, where she had been living for several years. \"It is with utterly broken hearts that we announce that Virginia passed away last night at her farm in Western Australia,\" her family said. \"She lost her life to suicide, after being a lifelong victim of sexual abuse and sex trafficking. \"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors. \"In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\" Police said emergency services received reports of an unresponsive woman at a property in Neergabby on Friday night. \"Police and St John Western Australia attended and provided emergency first aid. Sadly, the 41-year-old woman was declared deceased at the scene,\" a police spokeswoman said. \"The death is being investigated by Major Crime detectives; early indication is the death is not suspicious.\" Sexual assault claims Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\". 'An incredible champion' Sigrid McCawley, Ms Giuffre's attorney, said in a statement that she \"was much more than a client to me; she was a dear friend and an incredible champion for other victims\". \"Her courage pushed me to fight harder, and her strength was awe-inspiring,\" she said. \"The world has lost an amazing human being today.\" \"Rest in peace, my sweet angel,\" she added. US correspondent Of the many dozens of victims of Jeffrey Epstein, it was Virginia Giuffre who became the most high-profile. She was among the loudest and most compelling voices, urging criminal charges to be brought against Epstein, waving her right to anonymity in 2015.  She told how he and Ghislaine Maxwell groomed her and \"passed around like a platter of fruit\" to be used by rich and powerful men. But her name and face became known around the world after she accused Prince Andrew of sexually abusing her when she was 17 years old.  The picture of her together with the prince and Maxwell at the top of a staircase, his hand around her waist, is the defining image of the whole scandal. Prince Andrew said he had no memory of the occasion. But Giuffre stuck by her version of events until the end. Dini von Mueffling, Ms Giuffre's representative, also said that \"Virginia was one of the most extraordinary human beings I have ever had the honour to know\". \"Deeply loving, wise, and funny, she was a beacon to other survivors and victims,\" she added. \"She adored her children and many animals. \"She was always more concerned with me than with herself. I will miss her beyond words. \"It was the privilege of a lifetime to represent her.\" Ms Giuffre said at the end of March she had four days to live after a car accident, posting on social media that \"I've gone into kidney renal failure\". She was discharged from hospital eight days later. Raised mainly in Florida, she said she was abused by a family friend early in life, which led to her living on the streets at times as a teenager. She said that in 2000, she met Ghislaine Maxwell, a British socialite who was convicted in 2021 on federal sex trafficking and conspiracy charges and was sentenced to 20 years in prison. Ms Giuffre said Maxwell then introduced her to Epstein and hired her as his masseuse, and said she was sex trafficked and sexually abused by him and associates around the world. 'A survivor' After meeting her husband in 2002, while taking massage training in Thailand at what she said was Epstein's behest, she moved to Australia and had a family. She founded the sex trafficking victims' advocacy charity SOAR in 2015, and is quoted on its website as saying: \"I do this for victims everywhere. \"I am no longer the young and vulnerable girl who could be bullied. I am now a survivor, and nobody can ever take that away from me.\" :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Counter-terrorism police investigating after two women injured in Leeds",
        "description": "Counter-terrorism police are investigating after an incident involving a crossbow and a firearm left two women injured in Leeds. ",
        "url": "https://news.sky.com/story/man-with-crossbow-and-firearm-detained-in-leeds-after-two-women-injured-13356479",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-leeds-police_6898173.jpg?20250426192058",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-26 17:23:00",
        "Headline": "Officers arrived at the scene to find two women injured - and a 38-year-old man with a self-inflicted injury.",
        "Content": "Counter-terrorism police are investigating after an incident involving a crossbow and a firearm left two women injured in Leeds.  Police were called to Otley Road at 2.47pm on Saturday to reports of a \"serious incident involving a man seen with weapons\", West Yorkshire Police said. Officers arrived at the scene to find two women injured - and a 38-year-old man with a self-inflicted injury. All three were taken to hospital, with the man held under arrest, but their injuries are not believed to be life-threatening. \"Two weapons have been recovered from the scene, which were a crossbow and a firearm,\" Counter Terrorism Policing North East said in a statement. The incident happened on the 'Otley Run' pub crawl, with one venue saying it was closed for the evening due to \"unforeseen circumstances\". Counter Terrorism Policing's statement added: \"Due to the circumstances surrounding the incident, Counter Terrorism Policing North East have taken responsibility for leading the investigation with the support of West Yorkshire Police. \"Extensive enquiries continue to establish the full circumstances and explore any potential motivation.\" Home Secretary Yvette Cooper described it as a \"serious violent incident\" and said she was being kept updated by police. \"Thank you to the police and emergency services for their swift response,\" she said. \"My thoughts are with the victims and all those affected by this attack.\""
    },
    {
        "title": "Chris Eubank Jr taken to hospital after defeating Conor Benn by unanimous decision in middleweight clash",
        "description": "Chris Eubank Jr has been taken to hospital after defeating Conor Benn by unanimous decision.",
        "url": "https://news.sky.com/story/chris-eubank-jr-beats-conor-benn-by-unanimous-decision-in-middleweight-clash-13356682",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-conor-benn-chris-eubank-jr_6898427.jpg?20250426232000",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-26 21:37:00",
        "Headline": "After going the full 12 rounds, all three judges unanimously gave 116-112 on the scorecards in favour of Eubank Jr.",
        "Content": "Chris Eubank Jr has been taken to hospital after defeating Conor Benn by unanimous decision. After going the full 12 rounds at London's Tottenham Hotspur Stadium, all three judges unanimously gave 116-112 on the scorecards in favour of Eubank Jr. Just before midnight, Eubank Jr's promoters, Boxxer, said the 35-year-old had been taken to hospital as a precautionary measure \"on recommendation of the onsite doctor\". In the ninth round, Eubank Jr suffered a cut above his right eye from a clash of heads. Eubank Jr said after winning the bout: \"I didn't expect Conor to be the guy to [bring it out of me]. I didn't know he had that in him, I thought I would break him early. \"I underestimated him, I didn't prepare for a fight like that.\" His father, legendary boxer Chris Eubank, said he was \"so proud\" of his son, and praised Benn as \"extraordinary\". Eubank Jr was the more experienced of the pair, going into the fight with a record of 34-3, with 25 knockouts. Benn, 28, won all 23 of his professional fights, 14 by knockouts. Benn was faster out of the gate, forcing Eubank Jr to evade power punches and leaving him weak on his feet at times. In the fifth round, Eubank Jr began beating Benn to the punch, before the fight ended in a sprint with both men landing heavy blows. Speaking in the ring after defeat, Benn said: \"I'm not going to say I deserved to win it, I have to watch it back. \"Maybe I stayed on the ropes a bit too long. Chris is a good fighter. \"All the fighting talk is fighting talk. I'd love the rematch.\" Later at a post-fight news conference, he admitted that \"I wasn't good enough... I need to do better\", before again calling for a rematch and saying \"I want my revenge\". He then wished Eubank Jr a \"speedy recovery\" and claimed \"I've heard he's got a broken jaw\". Read more from Sky News:Wrexham promoted for third season in a rowSky's Beth Rigby running London marathon in honour of 'dearest friend' Benn's father Nigel had fought with Eubank Sr twice in the 1990s. In November 1990, Eubank Sr beat Nigel Benn by a ninth-round stoppage in Birmingham to take the WBO middleweight title. The rematch was three years later at Old Trafford. It ended in a split-decision draw. Last night's match was a long time in the making - called off in 2022 when Benn tested positive for traces of fertility drug clomifene. The World Boxing Council cleared Benn of intentional doping in 2023, saying a \"highly elevated consumption of eggs\" was a reasonable explanation. Ahead of the fight, Eubank Jr was fined for being fractionally over the 160lb middleweight limit, at 160.05lbs."
    },
    {
        "title": "Labour and Reform in battle for Runcorn by-election seat - but disillusionment could be eventual winner",
        "description": "On the banks of the Mersey, Runcorn and Helsby is a more complicated political picture than the apparent Labour heartland that first presents itself.",
        "url": "https://news.sky.com/story/labour-and-reform-in-battle-for-runcorn-by-election-seat-but-disillusionment-could-be-eventual-winner-13356673",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rob-runcorn_6896328.jpg?20250425124309",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-04-26 23:01:00",
        "Headline": "Labour's first big electoral test takes place next week as voters head to the polls for the Runcorn and Helsby by-election. It comes after the resignation of former MP Mike Amesbury, convicted earlier this year of assaulting a constituent.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n On the banks of the Mersey, Runcorn and Helsby is a more complicated political picture than the apparent Labour heartland that first presents itself. Yes, there are industrial and manufacturing areas - an old town that's fallen victim to out-of-town shopping, and an out-of-town shopping centre that's fallen victim to Amazon. But there are also more middle-class new town developments, as well as Tory-facing rural swathes. One thing this area does mirror with many across the country, though, is a fed-up electorate with little confidence that politics can work for them. In the Space Cafe in Runcorn Old Town, its director Marie Moss says many in the region remember a time when a sense of community was more acute. \"People were very proud of their town… and that's why people get upset and emotional as they remember that,\" she says. It's this feeling of disenfranchisement and nostalgia-tinged yearning for the past that Reform UK is trading off in its targeting of traditional Labour voters here. \n                  Vincent Nichols: British cardinal who will be in the conclave says picking the next pope is 'intimidating'\n                 \n                  Liverpool defender Virgil van Dijk signs new contact with Premier League club\n                 \n                  Man arrested on suspicion of murder after woman stabbed in Liverpool flat\n                 Party leader Nigel Farage features heavily on leaflets in these parts, alongside spikey messaging around migration, law and order, and Labour's record in government so far. Taxi driver Mike Holland hears frequent worries about that record from those riding in the back of his cab. A Labour voter for decades, he says locals were \"made up\" at last year's election result but have been \"astonished\" since then, with benefit changes a common topic of concern. \"Getting a taxi is two things, it's either a luxury or a necessity... the necessity people are the disabled people… and a lot of the old dears are so stressed and worried about their disability allowance and whether they are going to get it or not get it,\" he says. But will that mean straight switchers to Reform UK? Mike says he agrees with some of what the party is offering but thinks a lot of people are put off by Mr Farage. He's now looking at the Liberal Democrats and Greens, both of whom have put up local politicians as candidates. Or, Mike says, he may just not vote at all. It's in places like Runcorn town that some of the political contradictions within Reform UK reveal themselves more clearly. Many here say they were brought up being told to never vote Tory. And yet, Reform, chasing their support, has chosen a former Conservative councillor as its candidate. It's no surprise Labour has been trialling attack lines in this campaign, painting Mr Farage's party as \"failed Tories\". As a response to this, look no further than Reform's recent nod to the left on industrialisation and public ownership. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Read more:Tough test for Labour after MP quitsMP jailed for late-night brawlLocal elections could re-shape politics But head 15 minutes south from Runcorn docks, and this by-election campaign changes. Rural areas like Frodsham and Helsby have, in the past, tended towards the Tories. The Conservatives, of course, have a candidate in this vote, one who stood in a neighbouring constituency last year. But Reform is now making a hard play for their supporters in these parts, with a softer message compared to the one being put out in urban areas - an attempt to reassure those anxious about too much political revolution coming to their privet-lined streets. Labour, meanwhile, is actively trying to mobilise the anti-Farage vote by presenting their candidate - another local councillor - as the only person who can stop Reform. The pitch here is aimed at voters like Frodsham makeup artist Nadine Tan, who are worried about division and anger in the community. \"I think they need to kind of come together and stop trying to divide everyone,\" she says. But like Mike the taxi driver five miles north, disillusionment could be the eventual winner as Nadine says, despite the \"thousands of leaflets\" through her door, she still thinks \"they all say the same thing\". One factor that doesn't seem to be swinging too many votes, though, is the insalubrious circumstances in which the area's former Labour MP left office. Mike Amesbury stepped down after being convicted of repeatedly punching a constituent in a late-night brawl outside a pub. But across the patch, many praise their ex-MP's local efforts, while also saying he was \"very silly\" to have acted in the way he did. That may be putting it mildly. But it's hard to find much more agreement ahead of Thursday's vote. A constituency still hungry for change, but unsure as to who can deliver it. Full list of candidates, Runcorn and Helsby by-election: Catherine Anne Blaiklock - English DemocratsDan Clarke - Liberal PartyChris Copeman - Green PartyPaul Duffy - Liberal DemocratsPeter Ford - Workers PartyHowling Laud Hope - Monster Raving Loony PartySean Houlston - ConservativesJason Philip Hughes - Volt UKAlan McKie - IndependentGraham Harry Moore - English Constitution PartyPaul Andrew Murphy - Social Democratic PartySarah Pochin - Reform UKKaren Shore - LabourJohn Stevens - Rejoin EUMichael Williams - Independent"
    },
    {
        "title": "Direct action group Just Stop Oil holds final protest, claiming it has been 'successful'",
        "description": "\"It has been a success.\"",
        "url": "https://news.sky.com/story/direct-action-group-just-stop-oil-holds-final-protest-claiming-it-has-been-successful-13356667",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-just-stop-oil-jso_6898357.jpg?20250426220143",
        "type": "UK",
        "Author": "Rachael Venables",
        "Date Published": "2025-04-26 20:51:00",
        "Headline": "Just Stop Oil insists it's been \"successful\" - as it ceremoniously hangs up its orange high-vis vests during a march in central London on Saturday.",
        "Content": "\n          News correspondent\n              @rachaelvenables\n  \"It has been a success.\" Just Stop Oil (JSO) insists it's been \"successful\" - as its members ceremoniously hang up their orange high-vis vests during a march in central London. Since the group formed three years ago, it's drawn attention and criticism for its colourful, controversial protests, which ranged from disrupting sporting events to throwing soup on Vincent van Gogh's Sunflowers, and climbing on gantries over the M25. It sprayed orange paint over Stonehenge, and cost police forces tens of millions of pounds. Those days are now behind it; to the relief of many. Read moreJSO co-founder wins court appealActivists target grave of Charles Darwin77 year old JSO activist recalled to prison As a few hundred activists marched through London on Saturday, blocking roads as they went; taxi drivers blared their horns and football fans shouted abuse from the pavement. The PA News Agency filmed the moment a white minivan seemed to drive towards a group of protesters blocking the road. Protesters shouted \"I'm being pushed back!\" to police, while the driver could be heard shouting \"What about my right to get home?\" to the officers gathered. But JSO never set out to be popular. And it believes its tactics - though hated - have been successful; thanks to the new Labour government's commitment to not issue new oil or gas exploration licences. That's why, it says, its ceasing direct action. \"This moment marks the success of the JSO campaign - our demand was to end new oil and gas licences and that is now government policy. \"As a result of which four billion barrels of oil are being kept under the North Sea. The campaign has reached a natural end.\" Dr Oscar Berglund, senior lecturer in international public and social policy, disagrees that JSO is disappearing because it's been \"successful\". He told Sky News policing strength and public perception might have more to do with it. \"They have very low levels of popularity. About 17% of the British population are kind of broadly supportive of what Just Stop Oil do. And that's too low to recruit. \"It's difficult to recruit members to something that is that unpopular, and then that a lot of people for good reason I think have kind of stopped believing in that kind of disruption as a means to achieve meaningful change.\" Group triggers specific new protest laws One thing it did change is the law. Policing commentator Graham Wettone tells us: \"Obstruction of the highway, obstruction of rail networks for example, these are specific offences now. \"It's given the police more tactics, more methods, more offences they can consider, even stopping and searching somebody who may have something to either lock themselves on or glue themselves to something.\" Emma Smart was held in prison for her activism with both Insulate Britain and Just Stop Oil. \"The high-vis might be going away,\" she tells me, \"but we aren't.\" \"These people aren't going anywhere, we are still committed, dedicated, terrified by the failings of this government and governments around the world.\" She hopes for a time of reflection before it returns in a new form but says the need for climate activism is stronger than ever. She also believes that while most people dislike JSO tactics, it still raises awareness of the cause and might even push people to more moderate campaign groups. Just Stop Oil came behind other, similarly controversial climate campaign groups like Insulate Britain and Extinction Rebellion, and as it says goodbye, its disruptive methods have been seized upon by other organisations like the Pro-Palestinian Youth Justice. The infamous Just Stop Oil orange vests might be going away, but the individual activists, their cause and campaign tactics feel here to stay."
    },
    {
        "title": "Upskirted, assaulted, accused of faking their music skills: Why female DJs need to be 'bulletproof'",
        "description": "To see Koven's Katie Boyle perform live is beyond impressive. Hailing from Luton, she&#160;is one of the most influential women in drum 'n' bass today, an artist who pioneered the art of singing live while DJing.&#160;",
        "url": "https://news.sky.com/story/upskirted-assaulted-accused-of-faking-their-music-skills-why-female-djs-need-to-be-bulletproof-13355492",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-djs-misogyny-spencer_6897812.jpg?20250426170525",
        "type": "UK",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-26 23:01:00",
        "Headline": "As the great and the good of the dance world gathered in Ibiza for the industry's annual International Music Summit, female DJs spoke to Sky News about their experiences of misogyny.",
        "Content": "\n          Arts and entertainment correspondent\n        To see Koven's Katie Boyle perform live is beyond impressive. Hailing from Luton, she is one of the most influential women in drum 'n' bass today, an artist who pioneered the art of singing live while DJing.  Although she's now been doing it for 12 years, her vast knowledge doesn't silence the trolls online. \"There is a real bad misogyny online against women,\" she says of the industry, with plenty of critics refusing to \"believe they're doing what they say they're doing, and that's been quite a hard thing to combat\". Koven is a duo. In the studio, Boyle collaborates with producer Max Rowat; live, she performs and mixes alone. They have just released their second album, Moments In Everglow. While both Boyle and Rowat are equally involved in making tracks, a minority of very vocal fans still refuse to accept she does anything other than sing. \"I will always be accused of the male half doing more on anything to do with technology,\" says Boyle. \"The amount of comments [I get] to say, 'she didn't make this'. No explanation as to why they think that it is, just purely because [I'm] a woman, which is just mad.\" While Boyle loves performing live, there are moments, she admits, where being one of the few women on the scene can feel unsafe. \"I've had some awful incidences,\" she says. \"I had someone run on stage and completely grab me, hand down my top, down my trousers, while I was on the stage, which is crazy because you think that's happening in front of an audience. I mean, this guy literally had to be plied off me. \"That was when I did think, 'I need to bring someone with me to most places'. I didn't feel safe travelling around by myself.\" 'You get trolled for everything' Sadly, Boyle isn't alone. Over a 30-year career, DJ Paulette has scaled the heights of dance music fame, playing throughout Europe, with a residency back in the day at Manchester's Hacienda. \"Let's just say I have two towels on my rider and it's not just because I sweat a lot,\" she jokes, miming a whack for those around her. \"I've spent time in DJ booths where I've had a skirt on and people have been taking pictures up my skirt. People think upskirting is a joke... and I got fed up with it.\" Wearing shorts, she says, she still ended with \"people with their hands all over me\". Now, she sticks to trousers. \"But we shouldn't have to alter the way we look for the environment that we work in.\" She admits, in order to stick it out, she's had to bulletproof herself. \"You get trolled for everything, for the way you look - if you put on weight, if you've lost weight.\" Not only is the discourse towards female DJs different online, she says, she has also been repeatedly told by those working in the industry that because she's a woman, she has a sell-by date. \"I went for dinner with three guys... one of them said to me, 'you know Paulette there is no promoter or organiser who is ever going to employ a black female DJ with grey hair', and they all laughed. \"That was them saying to me that my career was over, and I was in my 40s. At the time, I felt crushed... I think it really does take women who have a real steel will to make their way through.\" 'I will not stop talking about it' As the great and the good of the dance world gather in Ibiza for the industry's annual International Music Summit, with dance music more popular than ever there is of course much to party about. But for BBC Radio 1 broadcaster and DJ Jaguar, one of this year's summit's cohosts, some serious conversations also need to be had. \"You can get off the plane and look at the billboards around Ibiza and it's basically white men - David Guetta, Calvin Harris, and they are incredible artists in their own right - but the women headliners, there's barely any visibility of them, it's awful.\" She adds: \"I will not stop talking about it because it is the reality.\" Trolling and safety are also big concerns. \"You're in these green rooms, there's a lot of people there, drinking and doing other things... and I've walked into green rooms where I felt incredibly uncomfortable, especially when I was a bit younger. I was on my own, it's like 2am, and you have to watch yourself.\" Male DJs don't have the same stories She says she has female friends who have had drinks spiked when they were DJing. But her male friends? \"They don't have the same stories to tell me.\" Creamfields, arguably the UK's biggest dance festival, is emblematic of the gender imbalance. It remains one of the least representative festivals in terms of female artists, with last year's line-up more than 80% male. Read more from Sky News:Why gaming still has a women problem'There is no HR department in the music industry' Laila MacKenzie, founder of Lady Of The House, a community that supports and tries to encourage more women into dance music, says the talent pipeline problem isn't helped by the current discourse online. \"There is a real damaging factor how people can be really nasty online and really nasty in the media and how that actually may discourage and demotivate women from stepping forward into their talent,\" she says. In reality, for so many women working within dance music, the trolling can be so unpleasant that it's drowning out the good. \"There is so much positivity and so many lovely and supportive people,\" says Boyle. \"But unfortunately it feels like the negative and the toxic energy is just louder sometimes.\""
    },
    {
        "title": "Who was at the Pope's funeral - and who wasn't",
        "description": "The Pope's funeral has taken place in St Peter's Square in the Vatican.",
        "url": "https://news.sky.com/story/who-will-be-at-the-popes-funeral-13353604",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-prince-william-pope-funeral_6896985.jpg?20250426090021",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-26 07:00:00",
        "Headline": "A huge security operation was in place as presidents and prime ministers flocked to the Vatican for Francis's funeral.",
        "Content": " The Pope's funeral has taken place in St Peter's Square in the Vatican. A pope's funeral traditionally brings a host of world leaders together, and many were in attendance today as part of a crowd of about 250,000. Here's a look at the list. Prince William The Prince of Wales attended on behalf of the King. King Charles was in Rome earlier this month and met the pontiff at the Vatican as the 88-year-old was recovering from a long hospital stay with pneumonia. Sir Keir Starmer The prime minister was at the funeral with his wife Victoria. Speaking on Tuesday, Sir Keir said there had been \"an outpouring of grief and love\" for the Pope. He added: \"I think it reflects the high esteem in which he was held, not just by millions and millions of Catholics, but by many others, across the world, myself included.\" Donald Trump The US president was joined by first lady Melania Trump and was seen shaking hands with world leaders including France's president. He also held informal talks with Ukraine's leader in St Peter's Basilica before the service. The pair were pictured sitting face-to-face in the famous church and Volodymyr Zelenskyy later said the discussion could prove to be \"historic\" if it leads to peace.  Pope Francis had been critical of Mr Trump at times during his tenure. In January, he said it would be a \"disgrace\" if the president went ahead with his crackdown on immigration. Read more:The Pope's funeral: In picturesWho could be the next pope? Volodymyr Zelenskyy  The Ukrainian president, who met the Pope three times, was there with his wife - and there was an outbreak of applause for him when he arrived. Mr Zelenskyy has said his country is grieving the Pope and recalled how he often prayed for peace in Ukraine. His spokesman said the meeting with President Trump lasted for around 15 minutes. Emmanuel Macron French President Emmanuel Macron also attended the funeral with his wife Brigitte. In his tribute on Monday, Mr Macron said of the Pope: \"In this time of war and brutality, he had a sense for the other, for the most fragile.\" Giorgia Meloni  The Italian premier, alongside Argentine leader Javier Milei (below) had pride of place in the seating order for the service. The Vatican is, of course, surrounded by the Italian capital Rome, while the Pope was born and grew up in Argentina and was once Archbishop of Buenos Aires. Javier Milei  The president of Pope Francis's native Argentina was also at the ceremony, despite attacking Francis in recent years. In December 2023, the far-right politician called him \"an imbecile, the representative of evil on Earth\". Mr Milei alluded to their \"differences\" in his tribute to the late Pope, writing: \"It is with profound sorrow that I learned this sad morning that Pope Francis, Jorge Bergoglio, passed away today and is now resting in peace. \"Despite differences that seem minor today, having been able to know him in his goodness and wisdom was a true honour for me.\" Joe Biden Former US president Joe Biden, 82, was at the funeral with his wife Jill. The couple were seen taking their places in the bright sunshine prior to the service. Mr Biden appeared to be getting some help to his seat, taking the arm of a member of the church. Lula da Silva The Brazilian president and first lady Janja Lula da Silva were also there. Brazil has also declared a seven-day mourning period for the Pope. \"Humanity is today losing a voice of respect and welcome for others,\" the president said in his tribute. \"Pope Francis lived and propagated in his daily life the love, tolerance and solidarity that are the basis of Christian teachings.\" Ursula von der Leyen The EU's top official, Commission president Ursula von der Leyen, called Francis a worldwide inspiration. \"He inspired millions, far beyond the Catholic Church, with his humility and love so pure for the less fortunate,\" she said in a tribute. Other notable attendees: • Ireland's taoiseach Micheal Martin• Spain's King Felipe and Queen Letizia• Albanian president Bajram Begaj• Angola's president Joao Lourenco• Austrian president Alexander Van der Bellen• Bangladesh's chief adviser and interim leader Muhammad Yunus• Belgium's King Philippe and Queen Mathilde, along with prime minister Bart De Wever• Canada's governor general Mary Simon• Cape Verde president Jose Maria Neves• Croatia's president Zoran Milanovic• Cyprian president Nikos Christodoulides• Czech Republic's prime minister Petr Fiala• Democratic Republic of Congo president Felix Tshisekedi• Dominican Republic's president Luis Abinader• East Timor's president Jose Ramos-Horta• Ecuador's president Daniel Noboa• Estonia's president Alar Karis• Finland's president Alexander Stubb• Gabon's president Brice Oligui Nguema• German president Frank-Walter Steinmeier and outgoing chancellor Olaf Scholz• Greece's prime minister Kyriakos Mitsotakis• Honduras president Xiomara Castro• Hungary's president Tamas Sulyok• Italy's president Sergio Mattarella• Latvian president Edgars Rinkevics• Lithuanian president Gitanas Nauseda• Moldova's president Maia Sandu• Netherlands' prime minister Dick Schoof• New Zealand's prime minister Christopher Luxon• Norway's Crown Prince Haakon and Crown Princess Mette-Marit• The Philippines' president Ferdinand Marcos Jr• Poland's president Andrzej Duda• Portugal's president Marcelo Rebelo de Sousa and prime minister Luis Montenegro• Romania's interim president Ilie Bolojan• Sweden's King Carl XVI Gustaf, Queen Silvia and prime minister Ulf Kristersson• Switzerland's president Karin Keller-Sutter Vladimir Putin The Russian president did not attend. But the controversial leader paid tribute to the Pope, writing a message to Cardinal Kevin Farrell, who is interim chief of the Catholic Church. \"Please accept my most sincere condolences on the passing of His Holiness Pope Francis,\" Mr Putin said. \"Throughout the years of his pontificate, he actively promoted the development of dialogue between the RussianOrthodox and Roman Catholic churches, as well as constructive cooperation between Russia and the Holy See.\" Benjamin Netanyahu Israeli Prime Minister Benjamin Netanyahu also did not attend, with the country's ambassador Yaron Sideman going instead. The Jewish state and the Vatican have had strong relations in the past, with Israel sending a presidential delegation to the funeral of Pope John Paul II in 2005, and Pope Francis visiting Israel in 2014. But their relationship has deteriorated since the start of the war in Gaza. A month after the conflict started in 2023, a dispute broke out over whether Pope Francis had used the word \"genocide\" to describe events in Gaza. Palestinians who met with him said he did, but the Vatican said he did not. The Pope met relatives of Israeli hostages on the same day. Israeli officials have since lobbied the Vatican to be more forceful in its condemnation of Hamas. In January, the Pope called the humanitarian situation in Gaza \"shameful\", prompting criticism from Rome's chief rabbi, Riccardo Di Segni, who accused Francis of \"selective indignation\". Rabbi Di Segni said he would be attending the funeral, despite it taking place on the Jewish sabbath."
    },
    {
        "title": "Celtic win Scottish Premiership title after Pope Francis tribute and ticket price protest at Dundee United",
        "description": "Celtic have won the Scottish Premiership for the fourth year in a row after beating Dundee United 5-0 as their fans protested against the cost of match tickets and a tribute was made to Pope Francis on the day of his funeral.",
        "url": "https://news.sky.com/story/celtic-win-scottish-premiership-title-after-pope-francis-tribute-and-ticket-price-protest-at-dundee-united-13356156",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-celtic-scotlan-football_6897656.jpg?20250426154608",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-26 14:46:00",
        "Headline": "After a well-observed tribute to Pope Francis, fans threw tangerines onto the pitch to complain about being charged up to £42 to see the game, before the Hoops wrapped up their 13th title in 14 years.",
        "Content": "Celtic have won the Scottish Premiership for the fourth year in a row after beating Dundee United 5-0 as their fans protested against the cost of match tickets and a tribute was made to Pope Francis on the day of his funeral. It's Celtic's 13th title in 14 years and manager Brendan Rodgers's 11th major trophy with the Glasgow club. The Bhoys, as the club are also known, can now complete their sixth treble in nine seasons, and Rodgers' third, when they face Aberdeen in next month's Scottish Cup final. Pope Francis funeral - latest Winger James Forrest picked up a record 26th winners' medal, one more than Bobby Lennox, who was part of the famous \"Lisbon Lions\" side that won the European Cup in 1967. Nicolas Kuhn and Adam Idah both scored twice at Tannadice, as Celtic recorded their 27th victory of the campaign, seven more than Rangers, in second place in the table, 18 points behind their cross-city rivals. Celtic manager Brendan Rodgers told Sky Sports he was \"very hungry to win. We want to be the most successful team we can be. \n                  The Godfather-style gang war gripping two major cities - with brutal attacks caught on camera\n                 \n                  Ex-snooker champion Graeme Dott in court accused of child sex abuse\n                 \n                  Woman, 72, and boy, 12, seriously assaulted during home invasion 'linked to ongoing Edinburgh-Glasgow gang feud'\n                 \"I will be here next year, 200%. I said 150% a few weeks ago. I have never been happier here. \"Leading into this game there was a little bit of negativity around the league and the competition, but we can only concentrate on ourselves. Our mentality has been so, so good. \"The competition is for everyone. When it matters, this team has produced, it's not our fault we're 18 points clear and scoring goals. \"It's important to keep the motivation and the hunger at this stage of the season and we know what we want to achieve and what records we want to beat.\" The game was held up after around 11 minutes when Celtic's fans among the crowd of more than 13,500 threw dozens of tangerines onto the pitch. They were protesting against Dundee United's decision to charge visiting adult fans up to £42 to see the game when it became clear the leaders would clinch the title with a draw. Home fans were charged as little as £10, reports said. Supporters chanted about the prices as the pieces of fruit landed on the turf and held up a banner saying: \"Enjoy the fruits of our labour\" before Celtic's players helped clear them off the pitch. Celtic had complained to the Scottish Professional Football League after the hosts set the ticket prices. Dundee United's nickname is the Tangerines, and they traditionally play in an orange kit. One Celtic fan posted a picture on X of the fruit on the pitch, joking there were \"more tangerines in this picture than [fiercest rivals] Rangers have won trophies in the last 15 years!!!!\". There was a further, shorter delay early in the second half when about 20 footballs came flying on to the pitch from the same stand behind the goal as United goalkeeper Jack Walton was about to take a goal-kick. With their team leading 4-0, Celtic fans held up a new banner which said: \"Stop pricing fans out of football.\" Before kick-off, a well-observed minute's silence was held for Pope Francis on the day of his funeral in Rome. Read more on Sky News:Prince Andrew accuser diesCage fighter murder plotters jailedUK set for summer-like temperatures Celtic fans also paid tribute with banners and Vatican flags and chanted \"Papa Francesco\" before the silence began and it was perfectly observed after a few early shouts. A Celtic delegation, including manager Brendan Rodgers, his squad, and staff, had a private audience with the Pope after a match in Rome in 2023."
    },
    {
        "title": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died, her family says",
        "description": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41.",
        "url": "https://news.sky.com/story/virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-has-died-her-family-says-13355731",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-virginia-giuffre-prince-andrew_5632076.png?20220104082248",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-04-26 01:08:00",
        "Headline": "Virginia Giuffre's family has told Sky's US partner network NBC News she took her own life at her farm in Western Australia.",
        "Content": " Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41. In a statement to Sky's US partner network NBC News on Friday, her family said she took her own life in the Perth suburb of Neergabby, Australia, where she had been living for several years. \"It is with utterly broken hearts that we announce that Virginia passed away last night at her farm in Western Australia,\" her family said. \"She lost her life to suicide, after being a lifelong victim of sexual abuse and sex trafficking. \"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors. \"In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\" Police said emergency services received reports of an unresponsive woman at a property in Neergabby on Friday night. \"Police and St John Western Australia attended and provided emergency first aid. Sadly, the 41-year-old woman was declared deceased at the scene,\" a police spokeswoman said. \"The death is being investigated by Major Crime detectives; early indication is the death is not suspicious.\" Sexual assault claims Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\". 'An incredible champion' Sigrid McCawley, Ms Giuffre's attorney, said in a statement that she \"was much more than a client to me; she was a dear friend and an incredible champion for other victims\". \"Her courage pushed me to fight harder, and her strength was awe-inspiring,\" she said. \"The world has lost an amazing human being today.\" \"Rest in peace, my sweet angel,\" she added. US correspondent Of the many dozens of victims of Jeffrey Epstein, it was Virginia Giuffre who became the most high-profile. She was among the loudest and most compelling voices, urging criminal charges to be brought against Epstein, waving her right to anonymity in 2015.  She told how he and Ghislaine Maxwell groomed her and \"passed around like a platter of fruit\" to be used by rich and powerful men. But her name and face became known around the world after she accused Prince Andrew of sexually abusing her when she was 17 years old.  The picture of her together with the prince and Maxwell at the top of a staircase, his hand around her waist, is the defining image of the whole scandal. Prince Andrew said he had no memory of the occasion. But Giuffre stuck by her version of events until the end. Dini von Mueffling, Ms Giuffre's representative, also said that \"Virginia was one of the most extraordinary human beings I have ever had the honour to know\". \"Deeply loving, wise, and funny, she was a beacon to other survivors and victims,\" she added. \"She adored her children and many animals. \"She was always more concerned with me than with herself. I will miss her beyond words. \"It was the privilege of a lifetime to represent her.\" Ms Giuffre said at the end of March she had four days to live after a car accident, posting on social media that \"I've gone into kidney renal failure\". She was discharged from hospital eight days later. Raised mainly in Florida, she said she was abused by a family friend early in life, which led to her living on the streets at times as a teenager. She said that in 2000, she met Ghislaine Maxwell, a British socialite who was convicted in 2021 on federal sex trafficking and conspiracy charges and was sentenced to 20 years in prison. Ms Giuffre said Maxwell then introduced her to Epstein and hired her as his masseuse, and said she was sex trafficked and sexually abused by him and associates around the world. 'A survivor' After meeting her husband in 2002, while taking massage training in Thailand at what she said was Epstein's behest, she moved to Australia and had a family. She founded the sex trafficking victims' advocacy charity SOAR in 2015, and is quoted on its website as saying: \"I do this for victims everywhere. \"I am no longer the young and vulnerable girl who could be bullied. I am now a survivor, and nobody can ever take that away from me.\" :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Bank chiefs to Reeves: Ditch ring-fencing to boost UK economy",
        "description": "The bosses of four of Britain's biggest banks are secretly urging the chancellor to ditch the most significant regulatory change imposed after the 2008 financial crisis, warning her its continued imposition is inhibiting UK economic growth.",
        "url": "https://news.sky.com/story/bank-chiefs-to-reeves-ditch-ring-fencing-to-boost-uk-economy-13355766",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-banks-hsbc-lloyds-santander_6896951.jpg?20250426082637",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-26 07:09:00",
        "Headline": "The bosses of HSBC, Lloyds Banking Group, NatWest Group and Santander UK have told the chancellor the moment has come to abolish bank ring-fencing in an explosive letter obtained by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The bosses of four of Britain's biggest banks are secretly urging the chancellor to ditch the most significant regulatory change imposed after the 2008 financial crisis, warning her its continued imposition is inhibiting UK economic growth. Sky News has obtained an explosive letter sent this week by the chief executives of HSBC Holdings, Lloyds Banking Group, NatWest Group and Santander UK in which they argue bank ring-fencing \"is not only a drag on banks' ability to support business and the economy, but is now redundant\". The CEOs' letter represents an unprecedented intervention by most of the UK's major lenders to abolish a reform which cost them billions of pounds to implement and which was designed to make the banking system safer by separating groups' high street retail operations from their riskier wholesale and investment banking activities. Their request to Rachel Reeves, the chancellor, to abandon ring-fencing 15 years after it was conceived will be seen as a direct challenge to the government to take drastic action to support the economy during a period when it is forcing economic regulators to scrap red tape. It will, however, ignite controversy among those who believe that ditching the UK's most radical post-crisis reform risks exacerbating the consequences of any future banking industry meltdown. In their letter to the chancellor, the quartet of bank chiefs told Ms Reeves: \"With global economic headwinds, it is crucial that, in support of its Industrial Strategy, the government's Financial Services Growth and Competitiveness Strategy removes unnecessary constraints on the ability of UK banks to support businesses across the economy and sends the clearest possible signal to investors in the UK of your commitment to reform. \"While we welcomed the recent technical adjustments to the ring-fencing regime, we believe it is now imperative to go further. \n                  Labour and Reform in battle for Runcorn by-election seat - but disillusionment could be eventual winner\n                 \n                  Eubank Jr vs Benn live\n                 \n                  Counter-terrorism police investigating after two women injured in Leeds\n                 \"Removing the ring-fencing regime is, we believe, among the most significant steps the government could take to ensure the prudential framework maximises the banking sector's ability to support UK businesses and promote economic growth.\" Work on the letter is said to have been led by HSBC, whose new chief executive, Georges Elhedery, is among the signatories. His counterparts at Lloyds, Charlie Nunn; NatWest's Paul Thwaite; and Mike Regnier, who runs Santander UK, also signed it. While Mr Thwaite in particular has been public in questioning the continued need for ring-fencing, the letter - sent on Tuesday - is the first time that such a collective argument has been put so forcefully. The only notable absentee from the signatories is CS Venkatakrishnan, the Barclays chief executive, although he has publicly said in the past that ring-fencing is not a major financial headache for his bank. Other industry executives have expressed scepticism about that stance given that ring-fencing's origination was largely viewed as being an attempt to solve the conundrum posed by Barclays' vast investment banking operations. The introduction of ring-fencing forced UK-based lenders with a deposit base of at least £25bn to segregate their retail and investment banking arms, supposedly making them easier to manage in the event that one part of the business faced insolvency. Banks spent billions of pounds designing and setting up their ring-fenced entities, with separate boards of directors appointed to each division. More recently, the Treasury has moved to increase the deposit threshold from £25bn to £35bn, amid pressure from a number of faster-growing banks. Sam Woods, the current chief executive of the main banking regulator, the Prudential Regulation Authority, was involved in formulating proposals published by the Sir John Vickers-led Independent Commission on Banking in 2011. Legislation to establish ring-fencing was passed in the Financial Services Reform (Banking) Act 2013, and the regime came into effect in 2019. In addition to ring-fencing, banks were forced to substantially increase the amount and quality of capital they held as a risk buffer, while they were also instructed to create so-called 'living wills' in the event that they ran into financial trouble. The chancellor has repeatedly spoken of the need to regulate for growth rather than risk - a phrase the four banks hope will now persuade her to abandon ring-fencing. Britain is the only major economy to have adopted such an approach to regulating its banking industry - a fact which the four bank chiefs say is now undermining UK competitiveness. \"Ring-fencing imposes significant and often overlooked costs on businesses, including SMEs, by exposing them to banking constraints not experienced by their international competitors, making it harder for them to scale and compete,\" the letter said. \"Lending decisions and pricing are distorted as the considerable liquidity trapped inside the ring-fence can only be used for limited purposes. \"Corporate customers whose financial needs become more complex as they grow larger, more sophisticated, or engage in international trade, are adversely affected given the limits on services ring-fenced banks can provide. \"Removing ring-fencing would eliminate these cliff-edge effects and allow firms to obtain the full suite of products and services from a single bank, reducing administrative costs.\" In recent months, doubts have resurfaced about the commitment of Spanish banking giant Santander to its UK operations amid complaints about the costs of regulation and supervision. The UK's fifth-largest high street lender held tentative conversations about a sale to either Barclays or NatWest, although they did not progress to a formal stage. HSBC, meanwhile, is particularly restless about the impact of ring-fencing on its business, given its sprawling international footprint. \"There has been a material decline in UK wholesale banking since ring-fencing was introduced, to the detriment of British businesses and the perception of the UK as an internationally orientated economy with a global financial centre,\" the letter said. \"The regime causes capital inefficiencies and traps liquidity, preventing it from being deployed efficiently across Group entities.\" The four bosses called on Ms Reeves to use this summer's Mansion House dinner - the City's annual set-piece event - to deliver \"a clear statement of intent…to abolish ring-fencing during this Parliament\". Doing so, they argued, would \"demonstrate the government's determination to do what it takes to promote growth and send the strongest possible signal to investors of your commitment to the City and to strengthen the UK's position as a leading international financial centre\"."
    },
    {
        "title": "Trump criticises Putin after potentially 'historic' meeting with Zelenskyy before Pope's funeral",
        "description": "Donald Trump has criticised Vladimir Putin and suggested a shift in his stance towards the Russian president after a meeting with Volodymyr Zelenskyy before the Pope's funeral.",
        "url": "https://news.sky.com/story/trump-met-with-zelenskyy-ahead-of-popes-funeral-13355783",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-zelenskyy_6897159.jpg?20250426110945",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-26 07:57:00",
        "Headline": "The Ukrainian president said his first face-to-face meeting with Mr Trump since their public row at the White House could be \"historic\". ",
        "Content": " Donald Trump has criticised Vladimir Putin and suggested a shift in his stance towards the Russian president after a meeting with Volodymyr Zelenskyy before the Pope's funeral. The Ukrainian president said the one-on-one talks could prove to be \"historic\" after pictures showed him sitting opposite Mr Trump, around two feet apart, in the large marble hall inside St Peter's Basilica. The US president said he doubted his Russian counterpart's willingness to end the war after leaving Rome following the funeral of Pope Francis at the Vatican. Follow live updates: 200,000 mourn at Vatican In a post on his Truth Social platform, he said \"there was no reason\" for the Russian president \"to be shooting missiles into civilian areas, cities and towns, over the last few days\". He added: \"It makes me think that maybe he doesn't want to stop the war, he's just tapping me along, and has to be dealt with differently, through 'Banking' or 'Secondary Sanctions?' Too many people are dying!!!\" The meeting between the US and Ukrainian leaders was their first face-to-face encounter since a very public row in the Oval Office in February. Mr Zelenskyy said he had a good meeting with Mr Trump in which they talked about the defence of the Ukrainian people, a full and unconditional ceasefire, and a durable and lasting peace that would prevent the war restarting. Other images released by the Ukrainian president's office show Sir Keir Starmer and French President Emmanuel Macron were present for part of the talks, which were described as \"positive\" by the French presidency. Mr Zelenskyy's spokesman said the meeting lasted for around 15 minutes and he and Mr Trump had agreed to hold further discussions later on Saturday. But the US president left Rome for Washington on Air Force One soon after the funeral without any other talks having taken place. The Ukrainian president's office said there was no second meeting in Rome because of the tight schedule of both leaders, although he had separate discussions with Mr Starmer and Mr Macron. The French president said in a post on X \"Ukraine is ready for an unconditional ceasefire\" and that a so-called coalition of the willing, led by the UK and France, would continue working to achieve a lasting peace. There was applause from some of the other world leaders in attendance at the Vatican when Mr Zelenskyy walked out of St Peter's Basilica after stopping in front of the pontiff's coffin to pay his respects. Sir Tony Brenton, the former British ambassador to Russia, said the event presents diplomatic opportunities, including the \"biggest possible meeting\" between Mr Trump and the Ukrainian leader. He told Sky News it could mark \"an important step\" in starting the peace process between Russia and Ukraine. Professor Father Francesco Giordano told Sky News the meeting is being called \"Pope Francis's miracle\" by members of the clergy, adding: \"There's so many things that happened today - it was just overwhelming.\" The bilateral meeting comes after Mr Trump's peace negotiator Steve Witkoff held talks with Mr Putin at the Kremlin. They discussed \"the possibility of resuming direct negotiations between Russia and Ukraine\", Kremlin aide Yuri Ushakov said. 👉 Listen to Sky News Daily on your podcast app 👈 Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022. Mr Trump has claimed a deal to end the war is \"very close\" and has urged Mr Zelenskyy to \"get it done\" in a post on his Truth Social platform. He has previously warned both sides his administration would walk away from its efforts to achieve a peace if the two sides do not agree a deal soon. Meanwhile, the Polish armed forces said a Russian military helicopter violated its airspace over the Baltic Sea on Friday evening. \"The nature of the incident indicates that Russia is testing the readiness of our air defence systems,\" they said in a post on X."
    },
    {
        "title": "What we learn from remarkable photos of Trump-Zelenskyy meeting",
        "description": "On an extraordinary day, remarkable pictures on the margins that capture what may be a turning point for the world.",
        "url": "https://news.sky.com/story/what-we-learn-from-remarkable-photos-of-trump-zelenskyy-meeting-13355865",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-zelenskyy_6897157.jpg?20250426130006",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-04-26 11:39:00",
        "Headline": "The US president has presented Ukraine and Russia with a proposal and ultimatum so one-sided it could have been written in the Kremlin.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  On an extraordinary day, remarkable pictures on the margins that capture what may be a turning point for the world. In a corner of St Peter's Basilica before the funeral of Pope Francis, the leaders of America and Ukraine sit facing each other. It looked like a confessor sitting with a penitent except in this case, of course, both men believe the other has sinned against him. Leaning forward, hands together in their laps, Donald Trump and Volodymyr Zelenskyy stare at each other in one photo. In another, the Ukrainian president seems to be remonstrating with the US president. This is their first encounter since their infamous bust-up in the Oval Office. There has been so much bad blood between them since that spectacular collision. But could the solemnity of the moment bring any healing and perhaps a hope of salvation for Ukraine? We do not know what the two presidents said in their brief meeting. But in the mind of the Ukrainian leader will be the knowledge President Trump has this week said America will reward Russia for its unprovoked brutal invasion of his country, under any peace deal. Donald Trump has presented Ukraine and Russia with a proposal and ultimatum so one sided it could have been written in the Kremlin. Kyiv must surrender the land Russia has taken by force: Crimea forever, the rest at least for now. And it must submit to an act of extortion, a proposed deal that would hand over half its mineral wealth effectively to America. There is a limit to what such a brief encounter can achieve but the signs after the meeting were encouraging. It had said Zelenskyy been a \"good meeting\" that could turn out to be historic \"if we reach results together\". They had talked, he said, about the defence of Ukraine, a full and unconditional ceasefire and a durable and lasting peace that will prevent a war starting. The Trump peace proposal includes only unspecified security guarantees for Ukraine from countries that do not include the US. It rules out any membership of NATO. Ukraine's allies are watching closely to see if Donald Trump will apply any pressure on Vladimir Putin, let alone punish him for recent bloody attacks on Ukraine. Or will he simply walk away if the proposal fails, blaming Ukrainian intransigence, however outrageously, before moving on to a rapprochement with Moscow. In his social media postings after the meeting the US president was being critical of Vladimir Putin. \"There was no reason,\" he said, \"for Putin to be shooting missiles into civilian areas, cities and towns, over the last few days. It makes me think that maybe he doesn't want to stop the war, he's just tapping me along, and has to be dealt with differently, through 'Banking' or 'Secondary Sanctions?' Too many people are dying!!!\" Donald Trump has issued warnings before to Putin to end the carnage but he has not acted to put meaningful pressure to make him stop. Former US ambassador William B Taylor told Sky News: \"President Putin has demonstrated with these attacks that he's not ready for peace. He's not to sign a ceasefire. And so President Trump, who is eager to get to a peace, as is President Zelenskyy... President Trump needs to put some pressure on President Putin, more than just telling him to stop firing weapons and missiles at Kyiv. It needs to be real pressure to bring President Putin to the table.\" Donald Trump's peace plan looks increasingly likely to fail. Some believe it was set up to fail once the US demanded Ukraine cedes sovereignty of Crimea to Russia, something Zelenskyy is politically and constitutionally unable to do. If it does fail, the fear is Donald Trump blames Ukraine and Europe and renews relations with Putin's Russia anyway, rewarding its aggression and sounding the death knell for the post-war world order as we've known it."
    },
    {
        "title": "Pope Francis funeral: 250,000 people bid farewell to pontiff who said 'build bridges, not walls'",
        "description": "Tens of thousands of people packed St Peter's Square for the funeral of Pope Francis before his body was carried through the streets of Rome.",
        "url": "https://news.sky.com/story/tens-of-thousands-gather-to-say-farewell-to-pope-francis-13355764",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-francis-funeral_6897206.jpg?20250426114331",
        "type": "World",
        "Author": "Michael Drummond",
        "Date Published": "2025-04-26 06:59:00",
        "Headline": "St Peter's Square in The Vatican is packed as Pope Francis's funeral begins.",
        "Content": "\n          Foreign news reporter\n              @MikeRDrummond\n  Tens of thousands of people packed St Peter's Square for the funeral of Pope Francis before his body was carried through the streets of Rome. Royals, world leaders and cardinals joined scores of worshippers at The Vatican, as mourning of the pontiff - the 266th since St Peter - transcended wealth and social class. In keeping with Francis's life as a breaker of tradition, many of the more elaborate and expensive rituals customary for the burial of popes have been foregone in favour of simpler options. Around 250,000 people attended the funeral, with around 50,000 packing out St Peter's Square to watch the service before the coffin bearing the pontiff began its journey through the streets of the Italian capital.  Follow live: Pope Francis funeral service latest updates His body had been lying in state since his death aged 88 on Easter Monday, spending the last few days in St Peter's Basilica to allow mourners to pay their respects. The Vatican - where the funeral service took place - and Rome - where Francis has been laid to rest - have been under heavy security, with a no-fly zone overhead. President Donald Trump and Joe Biden, along with Sir Keir Starmer, President Emmanuel Macron and Ukraine's President Volodymyr Zelenskyy, headlined a huge selection of global leaders and dignitaries. Read more:How the Pope's funeral unfoldedFull order of service for Pope's funeralPope Francis's funeral in pictures Francis's coffin was taken out into St Peter's Square where 220 cardinals and 750 bishops and priests sat in rows, waiting to say goodbye to the Bishop of Rome. The pontiff eschewed the elaborate coffins used by many of his predecessors, opting instead for a simple wooden casket lined with zinc - a reflection of his efforts to reform the papacy and build \"a poor church for the poor\".  A series of sermons and prayers began with Cardinal Giovanni Battista Re reading the Penitential Act - a way for the faithful to confess their sinfulness. This was followed by the Liturgy of the Word, a part in Catholic mass where faithful gather to hear and reflect on the word of God. Cardinal Re then delivered the homily, speaking about Pope Francis' life and service to God.  The cardinal praised the pontiff as someone who \"touched the minds and hearts of people\" who was \"attentive to the signs of the times\". He added: \"Despite his frailty and suffering towards the end, Pope Francis chose to follow this path of self-giving until the last day of his earthly life.\" He said Francis \"was a pope among the people, with an open heart towards everyone\". Cardinal Re also repeated one of Francis's strongest criticisms of President Trump - who was in the audience - with a call to \"build bridges, not walls\". He also called for care for migrants and action on climate change. As the service in front of St Peter's Basilica drew to a close, Cardinal Re blessed the pope's coffin with holy water. At the end of the mass, the choir sang in Latin: \"May the angels lead you into paradise; may the martyrs come and welcome you and take you into the holy city, the new and eternal Jerusalem.\" The coffin was then carried back into St Peter's Basilica through the 'doors of death', as a 10-ton funeral bell tolled. Pope Francis's body then left the basilica aboard a white truck and was taken in procession through the streets of Rome to his final resting place at his favourite church, the Basilica of Santa Maria Maggiore. There were cheers and applause from the public on either side of the roads as the cortege passed them. Upon arrival, Pope Francis's body was ushered into the basilica - which is dedicated to the Virgin Mary - by prisoners and migrants, a last reflection of his priorities as pope. In a break with tradition, Pope Francis outlined in his will his request to be buried \"in the ground, without particular ornamentation\" but simply with the inscription \"Franciscus\". The burial ceremony itself took place in private."
    },
    {
        "title": "What Sky News correspondents witnessed at the Pope's funeral",
        "description": "Hundreds of thousands of Catholics descended on Vatican City for Pope Francis's funeral on Saturday.",
        "url": "https://news.sky.com/story/what-sky-news-correspondents-witnessed-at-the-popes-funeral-13356565",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-pope-funeral-farncis_6897228.jpg?20250426115959",
        "type": "World",
        "Author": "Adam Parsons, Europe correspondent, and Lisa Holland, Sky correspondent",
        "Date Published": "2025-04-26 18:42:00",
        "Headline": "Amid the formal funeral proceedings, Sky News correspondents reporting from St Peter's Square and Rome came across the unexpected - from nuns sprinting to secure their place in the queue to teenagers playing Uno as the funeral played out on big screens above them.",
        "Content": "By Adam Parsons, Europe correspondent, and Lisa Holland, Sky correspondent   Hundreds of thousands of Catholics descended on Vatican City for Pope Francis's funeral on Saturday. World leaders, including President Donald Trump and Ukraine's Volodymyr Zelenskyy, were among those who flew in to pay their respects. Follow live: Pope Francis funeral service But amid the formal proceedings, Sky News correspondents reporting from St Peter's Square and Rome witnessed the unexpected - from nuns sprinting to secure their place in the queue to teenagers playing Uno as the funeral played out on big screens above them. Here they reflect on the historic day for the Catholic Church and its faithful.  Adam Parsons, Europe correspondent in Vatican City Normally the streets around the Vatican are quiet at this time, dotted with a few rough sleepers and passing security personnel. Not this time. Via della Conciliazione is the road that runs from the Tiber all the way up to St Peter's Square and, before the sun had risen, there were long queues to get through the checkpoint in order to secure a prime viewing location. And when the gates were opened, and as more and more people came through, so the rush became greater. A trickle became a torrent - first people strolled towards the front, then they jogged and then, eventually, I saw three nuns, sprinting as fast as they could. But what I had expected to see in St Peter's Square was not, in fact, what I did see. I thought I'd bear witness to a lot of sobbing and sadness. Instead, in our section of the square, we were surrounded by dozens of teenagers; all affiliated to church youth groups, sitting on the ground and playing Uno. They stayed for the day, watching on the big screens along with the rest of the crowd. They applauded, watched patiently and then, when they saw President Volodymyr Zelenskyy, cheered their approval. Nobody, other than the Pope, got a warmer ovation than the Ukrainian president. Read moreWho was at the funeral and who wasn'tThe funeral in picturesHow will the new pope be chosen? What we didn't know at the time was that Zelenskyy had just met Donald Trump, not that Trump had had second thoughts about Vladimir Putin's reliability. But come the end of the service, the news had filtered through. So could the funeral have been a catalyst for an outbreak of peace, or at least a step or two in the right direction? As if by providence, at the very moment our team was discussing this, Michelle O'Neill, first minister of Northern Ireland, wandered past. \"Well that would be some legacy indeed from Pope Francis wouldn't it? And I hope that's the case.\" So did she worry that the Catholic Church will choose a more conservative successor to Pope Francis, I ask? Would she rather a Pope who continues Francis's path of reform and, by comparison with his predecessor, liberal thinking. She nodded, smiling. \"I think that his legacy is something that we want to be able to carry on. You know, we want him to be a living legacy. I hope the incoming Pope has the same qualities, that same approach to the leadership role they provide. \"I think Pope Francis is a lesson to so many people in terms of what we need, which is inclusion. What we need is a more unified society.\"  Lisa Holland, Sky correspondent in Rome \"He left us. He went to the sky,\" said Sister Annalisa Serra gesturing upwards. \"But surely from there he is enjoying seeing us all here since we love him a lot.\" The sentiment from the nun from Sardinia kind of encapsulated the Pope's funeral. Again and again people told us they felt Pope Francis - who was happiest among the people - would be with them, not the dignitaries, given a choice. That's not to say he wouldn't have taken the opportunity to speak his mind to the world and the Catholic Church's most powerful first. But, at heart, Francis's papacy was defined by his connection with ordinary Catholics. This weekend was originally billed as a special event in the Catholic calendar with 150,000 youngsters coming to Vatican City from around the world for a youth jubilee. Their trips were long planned and they could never have imagined that when the date came their event would be overshadowed by the funeral of Pope Francis. But the presence of the young faces gave a really youthful feel to the day - and a sense of unexpected joviality as we witnessed various groups burst into spontaneous song and applause to celebrate the former pontiff's life. Pope Francis recognised the importance of listening to the next generation. The crowd was an incredible mix of people of all nationalities and backgrounds. Part of the Pope's legacy is the growth of the Catholic Church particularly in countries like the Philippines where it makes up 80% of the population. Sister Richelle Elena - who is from the Philippines and came to watch Pope Francis's coffin pass by on the papal vehicle - said: \"We call him lolo kiko- our grandfather - and he is very close to us Filipinos because he embodies our values, the importance of families, dialogue, communion.\" Nicholas Bridges travelled with his pregnant wife Ludovica and their young children from the outskirts of Rome. It's a lot taking a one-year-old and a three-year-old to a public event attracting 400,000 people. \"It's an early start but it's such a historic event we had to come,\" said Nicholas. Elise Gascon from France wanted to share the moment with her grandparents. She said she came so she could tell them what it was like in St Peter's Square on the day the world's Catholics said goodbye to their spiritual leader."
    },
    {
        "title": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died, her family says",
        "description": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41.",
        "url": "https://news.sky.com/story/virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-has-died-her-family-says-13355731",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-virginia-giuffre-prince-andrew_5632076.png?20220104082248",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-26 01:08:00",
        "Headline": "Virginia Giuffre's family has told Sky's US partner network NBC News she took her own life at her farm in Western Australia.",
        "Content": " Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41. In a statement to Sky's US partner network NBC News on Friday, her family said she took her own life in the Perth suburb of Neergabby, Australia, where she had been living for several years. \"It is with utterly broken hearts that we announce that Virginia passed away last night at her farm in Western Australia,\" her family said. \"She lost her life to suicide, after being a lifelong victim of sexual abuse and sex trafficking. \"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors. \"In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\" Police said emergency services received reports of an unresponsive woman at a property in Neergabby on Friday night. \"Police and St John Western Australia attended and provided emergency first aid. Sadly, the 41-year-old woman was declared deceased at the scene,\" a police spokeswoman said. \"The death is being investigated by Major Crime detectives; early indication is the death is not suspicious.\" Sexual assault claims Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\". 'An incredible champion' Sigrid McCawley, Ms Giuffre's attorney, said in a statement that she \"was much more than a client to me; she was a dear friend and an incredible champion for other victims\". \"Her courage pushed me to fight harder, and her strength was awe-inspiring,\" she said. \"The world has lost an amazing human being today.\" \"Rest in peace, my sweet angel,\" she added. US correspondent Of the many dozens of victims of Jeffrey Epstein, it was Virginia Giuffre who became the most high-profile. She was among the loudest and most compelling voices, urging criminal charges to be brought against Epstein, waving her right to anonymity in 2015.  She told how he and Ghislaine Maxwell groomed her and \"passed around like a platter of fruit\" to be used by rich and powerful men. But her name and face became known around the world after she accused Prince Andrew of sexually abusing her when she was 17 years old.  The picture of her together with the prince and Maxwell at the top of a staircase, his hand around her waist, is the defining image of the whole scandal. Prince Andrew said he had no memory of the occasion. But Giuffre stuck by her version of events until the end. Dini von Mueffling, Ms Giuffre's representative, also said that \"Virginia was one of the most extraordinary human beings I have ever had the honour to know\". \"Deeply loving, wise, and funny, she was a beacon to other survivors and victims,\" she added. \"She adored her children and many animals. \"She was always more concerned with me than with herself. I will miss her beyond words. \"It was the privilege of a lifetime to represent her.\" Ms Giuffre said at the end of March she had four days to live after a car accident, posting on social media that \"I've gone into kidney renal failure\". She was discharged from hospital eight days later. Raised mainly in Florida, she said she was abused by a family friend early in life, which led to her living on the streets at times as a teenager. She said that in 2000, she met Ghislaine Maxwell, a British socialite who was convicted in 2021 on federal sex trafficking and conspiracy charges and was sentenced to 20 years in prison. Ms Giuffre said Maxwell then introduced her to Epstein and hired her as his masseuse, and said she was sex trafficked and sexually abused by him and associates around the world. 'A survivor' After meeting her husband in 2002, while taking massage training in Thailand at what she said was Epstein's behest, she moved to Australia and had a family. She founded the sex trafficking victims' advocacy charity SOAR in 2015, and is quoted on its website as saying: \"I do this for victims everywhere. \"I am no longer the young and vulnerable girl who could be bullied. I am now a survivor, and nobody can ever take that away from me.\" :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Fourteen dead and more than 700 injured after chemical explosion at Iran's largest port",
        "description": "Fourteen people have died and more than 700 been injured after a chemical explosion at Iran's largest port, according to state media.",
        "url": "https://news.sky.com/story/four-dead-and-more-than-500-injured-after-chemical-explosion-at-irans-largest-port-13355946",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-tehran-explosion_6897400.jpg?20250426141923",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-26 13:00:00",
        "Headline": "Iran's interior minister Mostafa Mohammad Najjar told state TV that 14 people have died after the blast at Rajaei port. More than 700 have been injured, the head of the country's rescue organisation added.",
        "Content": " Fourteen people have died and more than 700 been injured after a chemical explosion at Iran's largest port, according to state media. The blast saw a huge cloud of black and orange smoke billow above Rajaei port, near the city of Bandar Abbas on Saturday. Its impact shattered windows up to 16 miles away, with social media footage showing an office block near the port with its doors blown off. Iran's interior minister Mostafa Mohammad Najjar confirmed that 14 people have died. Babak Mahmoudi, head of Iran's rescue organisation, said more than 700 people sustained injuries. Emergency workers were seen rescuing people among the debris, with footage showing the wounded crowding at the entrance of a nearby hospital. Read more from Sky NewsPope Francis's coffin arrives at resting placeKim Jong Un reveals new destroyerWhat happened in Kashmir? Hossein Zafari, a spokesperson for the Islamic Republic's crisis management organisation, told the ILNA news agency that the cause of the blast was \"the chemicals inside the containers\" but did not elaborate further. State TV reported that poor handling of flammable materials was a \"contributing factor\". Iran's interior ministry said it has launched an investigation.  Rajaei port is around 650 miles southeast of Tehran on the Strait of Hormuz. It is the largest in the country, handling 80 million tonnes of goods every year. Industrial accidents are relatively common in Iran, which suffers from ageing oil infrastructure under international sanctions. Another incident in Bandar Abbas killed one worker in 2023. Saturday's blast came as UN officials met in Oman for the third round of negotiations over Iran's rapidly advancing nuclear programme."
    },
    {
        "title": "Kim Jong Un unveils North Korea's new naval destroyer equipped with 'the most powerful weapons'",
        "description": "Kim Jong Un has unveiled a new naval destroyer that can apparently launch nuclear-capable ballistic missiles.",
        "url": "https://news.sky.com/story/kim-jong-un-unveils-north-koreas-new-naval-destroyer-equipped-with-the-most-powerful-weapons-13355744",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-north-korea-kim-jong-un_6896919.jpg?20250426072454",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-04-26 05:29:00",
        "Headline": "The warship, touted as the first in a series of heavily-armed vessels, can apparently launch nuclear-capable ballistic missiles.",
        "Content": "Kim Jong Un has unveiled a new naval destroyer that can apparently launch nuclear-capable ballistic missiles. The North Korean leader says the warship is a significant advancement towards his goal of expanding the operational range and pre-emptive strike capabilities of his military. Mr Kim says his country's continued arms build-up is a response to perceived threats from the US and its allies in the region, who have been holding military drills. He vowed to \"respond decisively to this geopolitical crisis and ongoing developments,\" according to his speech carried by state news agency KCNA. The new \"multi-purpose\" destroyer, weighing in at 5,000 tonnes, was touted as the first in a new class of heavily armed warships. It is equipped with the \"most powerful weapons\" and was built \"within 400-odd days,\" Jo Chun Ryong, a secretary in theruling Workers' Party, was quoted as saying. The warship is designed to handle various weapons systems, including anti-air and anti-naval weapons, as well as nuclear-capable ballistic and cruise missiles, according to Mr Kim.  Read more:Kim Jong Un test-fires 'new sniper rifle' South Korea fires at North soldiers 'crossing demarcation line'North Korea test fires new intercontinental missile A nuclear-powered submarine would be the next big step in strengthening his navy, the North Korean leader added. Some experts have questioned whether the secretive and impoverished nation could develop such advanced capabilities without foreign assistance. Regional tensions have increased as North Korea continues to flaunt its military capabilities while also assisting Russia with its war in Ukraine."
    },
    {
        "title": "Trump criticises Putin after potentially 'historic' meeting with Zelenskyy before Pope's funeral",
        "description": "Donald Trump has criticised Vladimir Putin and suggested a shift in his stance towards the Russian president after a meeting with Volodymyr Zelenskyy before the Pope's funeral.",
        "url": "https://news.sky.com/story/trump-met-with-zelenskyy-ahead-of-popes-funeral-13355783",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-zelenskyy_6897159.jpg?20250426110945",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-26 07:57:00",
        "Headline": "The Ukrainian president said his first face-to-face meeting with Mr Trump since their public row at the White House could be \"historic\". ",
        "Content": " Donald Trump has criticised Vladimir Putin and suggested a shift in his stance towards the Russian president after a meeting with Volodymyr Zelenskyy before the Pope's funeral. The Ukrainian president said the one-on-one talks could prove to be \"historic\" after pictures showed him sitting opposite Mr Trump, around two feet apart, in the large marble hall inside St Peter's Basilica. The US president said he doubted his Russian counterpart's willingness to end the war after leaving Rome following the funeral of Pope Francis at the Vatican. Follow live updates: 200,000 mourn at Vatican In a post on his Truth Social platform, he said \"there was no reason\" for the Russian president \"to be shooting missiles into civilian areas, cities and towns, over the last few days\". He added: \"It makes me think that maybe he doesn't want to stop the war, he's just tapping me along, and has to be dealt with differently, through 'Banking' or 'Secondary Sanctions?' Too many people are dying!!!\" The meeting between the US and Ukrainian leaders was their first face-to-face encounter since a very public row in the Oval Office in February. Mr Zelenskyy said he had a good meeting with Mr Trump in which they talked about the defence of the Ukrainian people, a full and unconditional ceasefire, and a durable and lasting peace that would prevent the war restarting. Other images released by the Ukrainian president's office show Sir Keir Starmer and French President Emmanuel Macron were present for part of the talks, which were described as \"positive\" by the French presidency. Mr Zelenskyy's spokesman said the meeting lasted for around 15 minutes and he and Mr Trump had agreed to hold further discussions later on Saturday. But the US president left Rome for Washington on Air Force One soon after the funeral without any other talks having taken place. The Ukrainian president's office said there was no second meeting in Rome because of the tight schedule of both leaders, although he had separate discussions with Mr Starmer and Mr Macron. The French president said in a post on X \"Ukraine is ready for an unconditional ceasefire\" and that a so-called coalition of the willing, led by the UK and France, would continue working to achieve a lasting peace. There was applause from some of the other world leaders in attendance at the Vatican when Mr Zelenskyy walked out of St Peter's Basilica after stopping in front of the pontiff's coffin to pay his respects. Sir Tony Brenton, the former British ambassador to Russia, said the event presents diplomatic opportunities, including the \"biggest possible meeting\" between Mr Trump and the Ukrainian leader. He told Sky News it could mark \"an important step\" in starting the peace process between Russia and Ukraine. Professor Father Francesco Giordano told Sky News the meeting is being called \"Pope Francis's miracle\" by members of the clergy, adding: \"There's so many things that happened today - it was just overwhelming.\" The bilateral meeting comes after Mr Trump's peace negotiator Steve Witkoff held talks with Mr Putin at the Kremlin. They discussed \"the possibility of resuming direct negotiations between Russia and Ukraine\", Kremlin aide Yuri Ushakov said. 👉 Listen to Sky News Daily on your podcast app 👈 Russia and Ukraine have not held direct talks since the early weeks of the war, which began in February 2022. Mr Trump has claimed a deal to end the war is \"very close\" and has urged Mr Zelenskyy to \"get it done\" in a post on his Truth Social platform. He has previously warned both sides his administration would walk away from its efforts to achieve a peace if the two sides do not agree a deal soon. Meanwhile, the Polish armed forces said a Russian military helicopter violated its airspace over the Baltic Sea on Friday evening. \"The nature of the incident indicates that Russia is testing the readiness of our air defence systems,\" they said in a post on X."
    },
    {
        "title": "What we learn from remarkable photos of Trump-Zelenskyy meeting",
        "description": "On an extraordinary day, remarkable pictures on the margins that capture what may be a turning point for the world.",
        "url": "https://news.sky.com/story/what-we-learn-from-remarkable-photos-of-trump-zelenskyy-meeting-13355865",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-donald-trump-zelenskyy_6897157.jpg?20250426130006",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-04-26 11:39:00",
        "Headline": "The US president has presented Ukraine and Russia with a proposal and ultimatum so one-sided it could have been written in the Kremlin.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  On an extraordinary day, remarkable pictures on the margins that capture what may be a turning point for the world. In a corner of St Peter's Basilica before the funeral of Pope Francis, the leaders of America and Ukraine sit facing each other. It looked like a confessor sitting with a penitent except in this case, of course, both men believe the other has sinned against him. Leaning forward, hands together in their laps, Donald Trump and Volodymyr Zelenskyy stare at each other in one photo. In another, the Ukrainian president seems to be remonstrating with the US president. This is their first encounter since their infamous bust-up in the Oval Office. There has been so much bad blood between them since that spectacular collision. But could the solemnity of the moment bring any healing and perhaps a hope of salvation for Ukraine? We do not know what the two presidents said in their brief meeting. But in the mind of the Ukrainian leader will be the knowledge President Trump has this week said America will reward Russia for its unprovoked brutal invasion of his country, under any peace deal. Donald Trump has presented Ukraine and Russia with a proposal and ultimatum so one sided it could have been written in the Kremlin. Kyiv must surrender the land Russia has taken by force: Crimea forever, the rest at least for now. And it must submit to an act of extortion, a proposed deal that would hand over half its mineral wealth effectively to America. There is a limit to what such a brief encounter can achieve but the signs after the meeting were encouraging. It had said Zelenskyy been a \"good meeting\" that could turn out to be historic \"if we reach results together\". They had talked, he said, about the defence of Ukraine, a full and unconditional ceasefire and a durable and lasting peace that will prevent a war starting. The Trump peace proposal includes only unspecified security guarantees for Ukraine from countries that do not include the US. It rules out any membership of NATO. Ukraine's allies are watching closely to see if Donald Trump will apply any pressure on Vladimir Putin, let alone punish him for recent bloody attacks on Ukraine. Or will he simply walk away if the proposal fails, blaming Ukrainian intransigence, however outrageously, before moving on to a rapprochement with Moscow. In his social media postings after the meeting the US president was being critical of Vladimir Putin. \"There was no reason,\" he said, \"for Putin to be shooting missiles into civilian areas, cities and towns, over the last few days. It makes me think that maybe he doesn't want to stop the war, he's just tapping me along, and has to be dealt with differently, through 'Banking' or 'Secondary Sanctions?' Too many people are dying!!!\" Donald Trump has issued warnings before to Putin to end the carnage but he has not acted to put meaningful pressure to make him stop. Former US ambassador William B Taylor told Sky News: \"President Putin has demonstrated with these attacks that he's not ready for peace. He's not to sign a ceasefire. And so President Trump, who is eager to get to a peace, as is President Zelenskyy... President Trump needs to put some pressure on President Putin, more than just telling him to stop firing weapons and missiles at Kyiv. It needs to be real pressure to bring President Putin to the table.\" Donald Trump's peace plan looks increasingly likely to fail. Some believe it was set up to fail once the US demanded Ukraine cedes sovereignty of Crimea to Russia, something Zelenskyy is politically and constitutionally unable to do. If it does fail, the fear is Donald Trump blames Ukraine and Europe and renews relations with Putin's Russia anyway, rewarding its aggression and sounding the death knell for the post-war world order as we've known it."
    },
    {
        "title": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died, her family says",
        "description": "Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41.",
        "url": "https://news.sky.com/story/virginia-giuffre-who-accused-prince-andrew-of-sexual-assault-has-died-her-family-says-13355731",
        "image_url": "https://e3.365dm.com/22/01/1920x1080/skynews-virginia-giuffre-prince-andrew_5632076.png?20220104082248",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-04-26 01:08:00",
        "Headline": "Virginia Giuffre's family has told Sky's US partner network NBC News she took her own life at her farm in Western Australia.",
        "Content": " Virginia Giuffre, who accused Prince Andrew of sexual assault, has died aged 41. In a statement to Sky's US partner network NBC News on Friday, her family said she took her own life in the Perth suburb of Neergabby, Australia, where she had been living for several years. \"It is with utterly broken hearts that we announce that Virginia passed away last night at her farm in Western Australia,\" her family said. \"She lost her life to suicide, after being a lifelong victim of sexual abuse and sex trafficking. \"Virginia was a fierce warrior in the fight against sexual abuse and sex trafficking. She was the light that lifted so many survivors. \"In the end, the toll of abuse is so heavy that it became unbearable for Virginia to handle its weight.\" Police said emergency services received reports of an unresponsive woman at a property in Neergabby on Friday night. \"Police and St John Western Australia attended and provided emergency first aid. Sadly, the 41-year-old woman was declared deceased at the scene,\" a police spokeswoman said. \"The death is being investigated by Major Crime detectives; early indication is the death is not suspicious.\" Sexual assault claims Ms Giuffre sued the Duke of York for sexual abuse in August 2021, saying Andrew had sex with her when she was 17 and had been trafficked by his friend, the billionaire paedophile Jeffrey Epstein. The duke has repeatedly denied the claims, and he has not been charged with any criminal offences. In March 2022, it was announced Ms Giuffre and Andrew had reached an out-of-court settlement - believed to include a \"substantial donation to Ms Giuffre's charity in support of victims' rights\". 'An incredible champion' Sigrid McCawley, Ms Giuffre's attorney, said in a statement that she \"was much more than a client to me; she was a dear friend and an incredible champion for other victims\". \"Her courage pushed me to fight harder, and her strength was awe-inspiring,\" she said. \"The world has lost an amazing human being today.\" \"Rest in peace, my sweet angel,\" she added. US correspondent Of the many dozens of victims of Jeffrey Epstein, it was Virginia Giuffre who became the most high-profile. She was among the loudest and most compelling voices, urging criminal charges to be brought against Epstein, waving her right to anonymity in 2015.  She told how he and Ghislaine Maxwell groomed her and \"passed around like a platter of fruit\" to be used by rich and powerful men. But her name and face became known around the world after she accused Prince Andrew of sexually abusing her when she was 17 years old.  The picture of her together with the prince and Maxwell at the top of a staircase, his hand around her waist, is the defining image of the whole scandal. Prince Andrew said he had no memory of the occasion. But Giuffre stuck by her version of events until the end. Dini von Mueffling, Ms Giuffre's representative, also said that \"Virginia was one of the most extraordinary human beings I have ever had the honour to know\". \"Deeply loving, wise, and funny, she was a beacon to other survivors and victims,\" she added. \"She adored her children and many animals. \"She was always more concerned with me than with herself. I will miss her beyond words. \"It was the privilege of a lifetime to represent her.\" Ms Giuffre said at the end of March she had four days to live after a car accident, posting on social media that \"I've gone into kidney renal failure\". She was discharged from hospital eight days later. Raised mainly in Florida, she said she was abused by a family friend early in life, which led to her living on the streets at times as a teenager. She said that in 2000, she met Ghislaine Maxwell, a British socialite who was convicted in 2021 on federal sex trafficking and conspiracy charges and was sentenced to 20 years in prison. Ms Giuffre said Maxwell then introduced her to Epstein and hired her as his masseuse, and said she was sex trafficked and sexually abused by him and associates around the world. 'A survivor' After meeting her husband in 2002, while taking massage training in Thailand at what she said was Epstein's behest, she moved to Australia and had a family. She founded the sex trafficking victims' advocacy charity SOAR in 2015, and is quoted on its website as saying: \"I do this for victims everywhere. \"I am no longer the young and vulnerable girl who could be bullied. I am now a survivor, and nobody can ever take that away from me.\" :: Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK."
    },
    {
        "title": "Bank chiefs to Reeves: Ditch ring-fencing to boost UK economy",
        "description": "The bosses of four of Britain's biggest banks are secretly urging the chancellor to ditch the most significant regulatory change imposed after the 2008 financial crisis, warning her its continued imposition is inhibiting UK economic growth.",
        "url": "https://news.sky.com/story/bank-chiefs-to-reeves-ditch-ring-fencing-to-boost-uk-economy-13355766",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-banks-hsbc-lloyds-santander_6896951.jpg?20250426082637",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-04-26 07:09:00",
        "Headline": "The bosses of HSBC, Lloyds Banking Group, NatWest Group and Santander UK have told the chancellor the moment has come to abolish bank ring-fencing in an explosive letter obtained by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The bosses of four of Britain's biggest banks are secretly urging the chancellor to ditch the most significant regulatory change imposed after the 2008 financial crisis, warning her its continued imposition is inhibiting UK economic growth. Sky News has obtained an explosive letter sent this week by the chief executives of HSBC Holdings, Lloyds Banking Group, NatWest Group and Santander UK in which they argue bank ring-fencing \"is not only a drag on banks' ability to support business and the economy, but is now redundant\". The CEOs' letter represents an unprecedented intervention by most of the UK's major lenders to abolish a reform which cost them billions of pounds to implement and which was designed to make the banking system safer by separating groups' high street retail operations from their riskier wholesale and investment banking activities. Their request to Rachel Reeves, the chancellor, to abandon ring-fencing 15 years after it was conceived will be seen as a direct challenge to the government to take drastic action to support the economy during a period when it is forcing economic regulators to scrap red tape. It will, however, ignite controversy among those who believe that ditching the UK's most radical post-crisis reform risks exacerbating the consequences of any future banking industry meltdown. In their letter to the chancellor, the quartet of bank chiefs told Ms Reeves: \"With global economic headwinds, it is crucial that, in support of its Industrial Strategy, the government's Financial Services Growth and Competitiveness Strategy removes unnecessary constraints on the ability of UK banks to support businesses across the economy and sends the clearest possible signal to investors in the UK of your commitment to reform. \"While we welcomed the recent technical adjustments to the ring-fencing regime, we believe it is now imperative to go further. \n                  Labour and Reform in battle for Runcorn by-election seat - but disillusionment could be eventual winner\n                 \n                  Eubank Jr vs Benn live\n                 \n                  Counter-terrorism police investigating after two women injured in Leeds\n                 \"Removing the ring-fencing regime is, we believe, among the most significant steps the government could take to ensure the prudential framework maximises the banking sector's ability to support UK businesses and promote economic growth.\" Work on the letter is said to have been led by HSBC, whose new chief executive, Georges Elhedery, is among the signatories. His counterparts at Lloyds, Charlie Nunn; NatWest's Paul Thwaite; and Mike Regnier, who runs Santander UK, also signed it. While Mr Thwaite in particular has been public in questioning the continued need for ring-fencing, the letter - sent on Tuesday - is the first time that such a collective argument has been put so forcefully. The only notable absentee from the signatories is CS Venkatakrishnan, the Barclays chief executive, although he has publicly said in the past that ring-fencing is not a major financial headache for his bank. Other industry executives have expressed scepticism about that stance given that ring-fencing's origination was largely viewed as being an attempt to solve the conundrum posed by Barclays' vast investment banking operations. The introduction of ring-fencing forced UK-based lenders with a deposit base of at least £25bn to segregate their retail and investment banking arms, supposedly making them easier to manage in the event that one part of the business faced insolvency. Banks spent billions of pounds designing and setting up their ring-fenced entities, with separate boards of directors appointed to each division. More recently, the Treasury has moved to increase the deposit threshold from £25bn to £35bn, amid pressure from a number of faster-growing banks. Sam Woods, the current chief executive of the main banking regulator, the Prudential Regulation Authority, was involved in formulating proposals published by the Sir John Vickers-led Independent Commission on Banking in 2011. Legislation to establish ring-fencing was passed in the Financial Services Reform (Banking) Act 2013, and the regime came into effect in 2019. In addition to ring-fencing, banks were forced to substantially increase the amount and quality of capital they held as a risk buffer, while they were also instructed to create so-called 'living wills' in the event that they ran into financial trouble. The chancellor has repeatedly spoken of the need to regulate for growth rather than risk - a phrase the four banks hope will now persuade her to abandon ring-fencing. Britain is the only major economy to have adopted such an approach to regulating its banking industry - a fact which the four bank chiefs say is now undermining UK competitiveness. \"Ring-fencing imposes significant and often overlooked costs on businesses, including SMEs, by exposing them to banking constraints not experienced by their international competitors, making it harder for them to scale and compete,\" the letter said. \"Lending decisions and pricing are distorted as the considerable liquidity trapped inside the ring-fence can only be used for limited purposes. \"Corporate customers whose financial needs become more complex as they grow larger, more sophisticated, or engage in international trade, are adversely affected given the limits on services ring-fenced banks can provide. \"Removing ring-fencing would eliminate these cliff-edge effects and allow firms to obtain the full suite of products and services from a single bank, reducing administrative costs.\" In recent months, doubts have resurfaced about the commitment of Spanish banking giant Santander to its UK operations amid complaints about the costs of regulation and supervision. The UK's fifth-largest high street lender held tentative conversations about a sale to either Barclays or NatWest, although they did not progress to a formal stage. HSBC, meanwhile, is particularly restless about the impact of ring-fencing on its business, given its sprawling international footprint. \"There has been a material decline in UK wholesale banking since ring-fencing was introduced, to the detriment of British businesses and the perception of the UK as an internationally orientated economy with a global financial centre,\" the letter said. \"The regime causes capital inefficiencies and traps liquidity, preventing it from being deployed efficiently across Group entities.\" The four bosses called on Ms Reeves to use this summer's Mansion House dinner - the City's annual set-piece event - to deliver \"a clear statement of intent…to abolish ring-fencing during this Parliament\". Doing so, they argued, would \"demonstrate the government's determination to do what it takes to promote growth and send the strongest possible signal to investors of your commitment to the City and to strengthen the UK's position as a leading international financial centre\"."
    },
    {
        "title": "Labour and Reform in battle for Runcorn by-election seat - but disillusionment could be eventual winner",
        "description": "On the banks of the Mersey, Runcorn and Helsby is a more complicated political picture than the apparent Labour heartland that first presents itself.",
        "url": "https://news.sky.com/story/labour-and-reform-in-battle-for-runcorn-by-election-seat-but-disillusionment-could-be-eventual-winner-13356673",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-rob-runcorn_6896328.jpg?20250425124309",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-04-26 23:01:00",
        "Headline": "Labour's first big electoral test takes place next week as voters head to the polls for the Runcorn and Helsby by-election. It comes after the resignation of former MP Mike Amesbury, convicted earlier this year of assaulting a constituent.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n On the banks of the Mersey, Runcorn and Helsby is a more complicated political picture than the apparent Labour heartland that first presents itself. Yes, there are industrial and manufacturing areas - an old town that's fallen victim to out-of-town shopping, and an out-of-town shopping centre that's fallen victim to Amazon. But there are also more middle-class new town developments, as well as Tory-facing rural swathes. One thing this area does mirror with many across the country, though, is a fed-up electorate with little confidence that politics can work for them. In the Space Cafe in Runcorn Old Town, its director Marie Moss says many in the region remember a time when a sense of community was more acute. \"People were very proud of their town… and that's why people get upset and emotional as they remember that,\" she says. It's this feeling of disenfranchisement and nostalgia-tinged yearning for the past that Reform UK is trading off in its targeting of traditional Labour voters here. \n                  Vincent Nichols: British cardinal who will be in the conclave says picking the next pope is 'intimidating'\n                 \n                  Liverpool defender Virgil van Dijk signs new contact with Premier League club\n                 \n                  Man arrested on suspicion of murder after woman stabbed in Liverpool flat\n                 Party leader Nigel Farage features heavily on leaflets in these parts, alongside spikey messaging around migration, law and order, and Labour's record in government so far. Taxi driver Mike Holland hears frequent worries about that record from those riding in the back of his cab. A Labour voter for decades, he says locals were \"made up\" at last year's election result but have been \"astonished\" since then, with benefit changes a common topic of concern. \"Getting a taxi is two things, it's either a luxury or a necessity... the necessity people are the disabled people… and a lot of the old dears are so stressed and worried about their disability allowance and whether they are going to get it or not get it,\" he says. But will that mean straight switchers to Reform UK? Mike says he agrees with some of what the party is offering but thinks a lot of people are put off by Mr Farage. He's now looking at the Liberal Democrats and Greens, both of whom have put up local politicians as candidates. Or, Mike says, he may just not vote at all. It's in places like Runcorn town that some of the political contradictions within Reform UK reveal themselves more clearly. Many here say they were brought up being told to never vote Tory. And yet, Reform, chasing their support, has chosen a former Conservative councillor as its candidate. It's no surprise Labour has been trialling attack lines in this campaign, painting Mr Farage's party as \"failed Tories\". As a response to this, look no further than Reform's recent nod to the left on industrialisation and public ownership. 👉 Click here to listen to Electoral Dysfunction on your podcast app 👈 Read more:Tough test for Labour after MP quitsMP jailed for late-night brawlLocal elections could re-shape politics But head 15 minutes south from Runcorn docks, and this by-election campaign changes. Rural areas like Frodsham and Helsby have, in the past, tended towards the Tories. The Conservatives, of course, have a candidate in this vote, one who stood in a neighbouring constituency last year. But Reform is now making a hard play for their supporters in these parts, with a softer message compared to the one being put out in urban areas - an attempt to reassure those anxious about too much political revolution coming to their privet-lined streets. Labour, meanwhile, is actively trying to mobilise the anti-Farage vote by presenting their candidate - another local councillor - as the only person who can stop Reform. The pitch here is aimed at voters like Frodsham makeup artist Nadine Tan, who are worried about division and anger in the community. \"I think they need to kind of come together and stop trying to divide everyone,\" she says. But like Mike the taxi driver five miles north, disillusionment could be the eventual winner as Nadine says, despite the \"thousands of leaflets\" through her door, she still thinks \"they all say the same thing\". One factor that doesn't seem to be swinging too many votes, though, is the insalubrious circumstances in which the area's former Labour MP left office. Mike Amesbury stepped down after being convicted of repeatedly punching a constituent in a late-night brawl outside a pub. But across the patch, many praise their ex-MP's local efforts, while also saying he was \"very silly\" to have acted in the way he did. That may be putting it mildly. But it's hard to find much more agreement ahead of Thursday's vote. A constituency still hungry for change, but unsure as to who can deliver it. Full list of candidates, Runcorn and Helsby by-election: Catherine Anne Blaiklock - English DemocratsDan Clarke - Liberal PartyChris Copeman - Green PartyPaul Duffy - Liberal DemocratsPeter Ford - Workers PartyHowling Laud Hope - Monster Raving Loony PartySean Houlston - ConservativesJason Philip Hughes - Volt UKAlan McKie - IndependentGraham Harry Moore - English Constitution PartyPaul Andrew Murphy - Social Democratic PartySarah Pochin - Reform UKKaren Shore - LabourJohn Stevens - Rejoin EUMichael Williams - Independent"
    },
    {
        "title": "Direct action group Just Stop Oil holds final protest, claiming it has been 'successful'",
        "description": "\"It has been a success.\"",
        "url": "https://news.sky.com/story/direct-action-group-just-stop-oil-holds-final-protest-claiming-it-has-been-successful-13356667",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-just-stop-oil-jso_6898357.jpg?20250426220143",
        "type": "Technology",
        "Author": "Rachael Venables",
        "Date Published": "2025-04-26 20:51:00",
        "Headline": "Just Stop Oil insists it's been \"successful\" - as it ceremoniously hangs up its orange high-vis vests during a march in central London on Saturday.",
        "Content": "\n          News correspondent\n              @rachaelvenables\n  \"It has been a success.\" Just Stop Oil (JSO) insists it's been \"successful\" - as its members ceremoniously hang up their orange high-vis vests during a march in central London. Since the group formed three years ago, it's drawn attention and criticism for its colourful, controversial protests, which ranged from disrupting sporting events to throwing soup on Vincent van Gogh's Sunflowers, and climbing on gantries over the M25. It sprayed orange paint over Stonehenge, and cost police forces tens of millions of pounds. Those days are now behind it; to the relief of many. Read moreJSO co-founder wins court appealActivists target grave of Charles Darwin77 year old JSO activist recalled to prison As a few hundred activists marched through London on Saturday, blocking roads as they went; taxi drivers blared their horns and football fans shouted abuse from the pavement. The PA News Agency filmed the moment a white minivan seemed to drive towards a group of protesters blocking the road. Protesters shouted \"I'm being pushed back!\" to police, while the driver could be heard shouting \"What about my right to get home?\" to the officers gathered. But JSO never set out to be popular. And it believes its tactics - though hated - have been successful; thanks to the new Labour government's commitment to not issue new oil or gas exploration licences. That's why, it says, its ceasing direct action. \"This moment marks the success of the JSO campaign - our demand was to end new oil and gas licences and that is now government policy. \"As a result of which four billion barrels of oil are being kept under the North Sea. The campaign has reached a natural end.\" Dr Oscar Berglund, senior lecturer in international public and social policy, disagrees that JSO is disappearing because it's been \"successful\". He told Sky News policing strength and public perception might have more to do with it. \"They have very low levels of popularity. About 17% of the British population are kind of broadly supportive of what Just Stop Oil do. And that's too low to recruit. \"It's difficult to recruit members to something that is that unpopular, and then that a lot of people for good reason I think have kind of stopped believing in that kind of disruption as a means to achieve meaningful change.\" Group triggers specific new protest laws One thing it did change is the law. Policing commentator Graham Wettone tells us: \"Obstruction of the highway, obstruction of rail networks for example, these are specific offences now. \"It's given the police more tactics, more methods, more offences they can consider, even stopping and searching somebody who may have something to either lock themselves on or glue themselves to something.\" Emma Smart was held in prison for her activism with both Insulate Britain and Just Stop Oil. \"The high-vis might be going away,\" she tells me, \"but we aren't.\" \"These people aren't going anywhere, we are still committed, dedicated, terrified by the failings of this government and governments around the world.\" She hopes for a time of reflection before it returns in a new form but says the need for climate activism is stronger than ever. She also believes that while most people dislike JSO tactics, it still raises awareness of the cause and might even push people to more moderate campaign groups. Just Stop Oil came behind other, similarly controversial climate campaign groups like Insulate Britain and Extinction Rebellion, and as it says goodbye, its disruptive methods have been seized upon by other organisations like the Pro-Palestinian Youth Justice. The infamous Just Stop Oil orange vests might be going away, but the individual activists, their cause and campaign tactics feel here to stay."
    },
    {
        "title": "Upskirted, assaulted, accused of faking their music skills: Why female DJs need to be 'bulletproof'",
        "description": "To see Koven's Katie Boyle perform live is beyond impressive. Hailing from Luton, she&#160;is one of the most influential women in drum 'n' bass today, an artist who pioneered the art of singing live while DJing.&#160;",
        "url": "https://news.sky.com/story/upskirted-assaulted-accused-of-faking-their-music-skills-why-female-djs-need-to-be-bulletproof-13355492",
        "image_url": "https://e3.365dm.com/25/04/1920x1080/skynews-djs-misogyny-spencer_6897812.jpg?20250426170525",
        "type": "Entertainment",
        "Author": "Katie Spencer",
        "Date Published": "2025-04-26 23:01:00",
        "Headline": "As the great and the good of the dance world gathered in Ibiza for the industry's annual International Music Summit, female DJs spoke to Sky News about their experiences of misogyny.",
        "Content": "\n          Arts and entertainment correspondent\n        To see Koven's Katie Boyle perform live is beyond impressive. Hailing from Luton, she is one of the most influential women in drum 'n' bass today, an artist who pioneered the art of singing live while DJing.  Although she's now been doing it for 12 years, her vast knowledge doesn't silence the trolls online. \"There is a real bad misogyny online against women,\" she says of the industry, with plenty of critics refusing to \"believe they're doing what they say they're doing, and that's been quite a hard thing to combat\". Koven is a duo. In the studio, Boyle collaborates with producer Max Rowat; live, she performs and mixes alone. They have just released their second album, Moments In Everglow. While both Boyle and Rowat are equally involved in making tracks, a minority of very vocal fans still refuse to accept she does anything other than sing. \"I will always be accused of the male half doing more on anything to do with technology,\" says Boyle. \"The amount of comments [I get] to say, 'she didn't make this'. No explanation as to why they think that it is, just purely because [I'm] a woman, which is just mad.\" While Boyle loves performing live, there are moments, she admits, where being one of the few women on the scene can feel unsafe. \"I've had some awful incidences,\" she says. \"I had someone run on stage and completely grab me, hand down my top, down my trousers, while I was on the stage, which is crazy because you think that's happening in front of an audience. I mean, this guy literally had to be plied off me. \"That was when I did think, 'I need to bring someone with me to most places'. I didn't feel safe travelling around by myself.\" 'You get trolled for everything' Sadly, Boyle isn't alone. Over a 30-year career, DJ Paulette has scaled the heights of dance music fame, playing throughout Europe, with a residency back in the day at Manchester's Hacienda. \"Let's just say I have two towels on my rider and it's not just because I sweat a lot,\" she jokes, miming a whack for those around her. \"I've spent time in DJ booths where I've had a skirt on and people have been taking pictures up my skirt. People think upskirting is a joke... and I got fed up with it.\" Wearing shorts, she says, she still ended with \"people with their hands all over me\". Now, she sticks to trousers. \"But we shouldn't have to alter the way we look for the environment that we work in.\" She admits, in order to stick it out, she's had to bulletproof herself. \"You get trolled for everything, for the way you look - if you put on weight, if you've lost weight.\" Not only is the discourse towards female DJs different online, she says, she has also been repeatedly told by those working in the industry that because she's a woman, she has a sell-by date. \"I went for dinner with three guys... one of them said to me, 'you know Paulette there is no promoter or organiser who is ever going to employ a black female DJ with grey hair', and they all laughed. \"That was them saying to me that my career was over, and I was in my 40s. At the time, I felt crushed... I think it really does take women who have a real steel will to make their way through.\" 'I will not stop talking about it' As the great and the good of the dance world gather in Ibiza for the industry's annual International Music Summit, with dance music more popular than ever there is of course much to party about. But for BBC Radio 1 broadcaster and DJ Jaguar, one of this year's summit's cohosts, some serious conversations also need to be had. \"You can get off the plane and look at the billboards around Ibiza and it's basically white men - David Guetta, Calvin Harris, and they are incredible artists in their own right - but the women headliners, there's barely any visibility of them, it's awful.\" She adds: \"I will not stop talking about it because it is the reality.\" Trolling and safety are also big concerns. \"You're in these green rooms, there's a lot of people there, drinking and doing other things... and I've walked into green rooms where I felt incredibly uncomfortable, especially when I was a bit younger. I was on my own, it's like 2am, and you have to watch yourself.\" Male DJs don't have the same stories She says she has female friends who have had drinks spiked when they were DJing. But her male friends? \"They don't have the same stories to tell me.\" Creamfields, arguably the UK's biggest dance festival, is emblematic of the gender imbalance. It remains one of the least representative festivals in terms of female artists, with last year's line-up more than 80% male. Read more from Sky News:Why gaming still has a women problem'There is no HR department in the music industry' Laila MacKenzie, founder of Lady Of The House, a community that supports and tries to encourage more women into dance music, says the talent pipeline problem isn't helped by the current discourse online. \"There is a real damaging factor how people can be really nasty online and really nasty in the media and how that actually may discourage and demotivate women from stepping forward into their talent,\" she says. In reality, for so many women working within dance music, the trolling can be so unpleasant that it's drowning out the good. \"There is so much positivity and so many lovely and supportive people,\" says Boyle. \"But unfortunately it feels like the negative and the toxic energy is just louder sometimes.\""
    }
]