[
    {
        "title": "Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine",
        "description": "Volodymyr Zelenskyy is ready to accept a ceasefire deal - as the US says it has immediately resumed intelligence sharing and military aid with Ukraine.",
        "url": "https://news.sky.com/story/zelenskyy-accepts-ceasefire-proposal-as-us-to-resume-intelligence-sharing-and-military-aid-with-ukraine-13326496",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zaporizhzhia-ukraine_6851856.jpg?20250310094109",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-11 18:19:00",
        "Headline": "In a post on Telegram after US and Ukrainian officials met in Saudi Arabia, Volodymyr Zelenskyy said Ukraine \"accepts\" the American proposal of a full 30-day ceasefire with Russia.",
        "Content": " Volodymyr Zelenskyy is ready to accept a ceasefire deal - as the US says it has immediately resumed intelligence sharing and military aid with Ukraine. In a post on Telegram after US and Ukrainian officials met in Saudi Arabia, Mr Zelenskyy said \"the American side understands our arguments\" and \"accepts our proposals\" - and that Kyiv \"accepts\" the US proposal of a full 30-day ceasefire with Russia. Ukraine war latest: Ball now in Russia's court, US says \"I want to thank President Trump for the constructiveness of the conversation between our teams,\" he said. \"Today, in the conversation, the American side proposed to take the first step immediately and try to establish a full ceasefire for 30 days, not only concerning rockets, drones, and bombs, not only in the Black Sea, but also along the entire front line. \"Ukraine accepts this proposal, we consider it positive, and we are ready to take this step.\"  'Ukraine is ready for peace' The Ukrainian president then said the US \"must convince Russia to do this\" and that \"if the Russians agree - that's when the silence will work\". He added: \"An important element of today's conversation is America's readiness to restore defensive assistance to Ukraine, as well as intelligence support. \"Ukraine is ready for peace. Russia must show whether it is ready to stop the war or continue it. \"The time has come for the full truth. I thank everyone who helps Ukraine.\" Meanwhile, in a joint statement with Kyiv following nine-hour-long talks in Jeddah, the US State Department said it will immediately lift the pause on intelligence-sharing and military aid. A Ukrainian source told Sky News earlier this month that the US had stopped sharing all intelligence with Kyiv.  'Ball is now in Russia's court' Marco Rubio, US secretary of state, also told reporters that \"the ball is now in Russia's court\" after meeting with the Ukrainian delegation. After the positive talks, Mr Rubio said \"we're going to take the offer\" to Russia, adding: \"We're going to tell them this is what's on the table, Ukraine is ready to stop shooting and start talking, and now it'll be up to them to say yes or no. \"I hope they're going to say yes, and if they do then I think we made great progress.\" He then said that while no deadline has been set, he hopes a deal can be reached \"as soon as possible\" and that \"this is serious stuff, this is not Mean Girls, this is not some episode of some television show\". \"The number one goodwill gesture we could see from the Russians is to see the Ukrainian offer and reciprocate it with a yes,\" Mr Rubio added. National security adviser Mike Waltz also added it is \"very clear\" that Kyiv shares Donald Trump's vision for peace and that \"they share his determination to end the fighting\". Read more from Sky News:Trump escalates Canada trade war by doubling tariffsUkraine's drone attack on Russia sent a message Over in the US, Mr Trump said that officials will meet with Russia either today or tomorrow and confirmed he would invite Mr Zelenskyy back to the White House. \"We want to get the Ukraine war over with,\" the US president said, before saying he hopes to have a total ceasefire in the coming days. He also told reporters he thinks he will talk to Russian President Vladimir Putin this week - but warned \"it takes two to tango\". Last month, Mr Trump accused Mr Zelenskyy of \"gambling with World War Three\" in an Oval Office meeting. US vice president JD Vance told the Ukrainian president \"you should be thanking\" Mr Trump \"for trying to bring an end to this conflict,\" sparking a tense 10-minute back-and-forth.  A press conference with the two leaders and the signing of an agreement was then cancelled."
    },
    {
        "title": "'Calling Moscow's bluff': Sky News correspondents' views as Ukraine accepts ceasefire deal",
        "description": "As Ukraine says it has accepted a proposal for a 30-day ceasefire, US secretary of state Marco Rubio says \"the ball is now in Russia's court\".",
        "url": "https://news.sky.com/story/calling-moscows-bluff-sky-news-correspondents-views-as-ukraine-accepts-ceasefire-deal-13326597",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zelenskyy-saudi-arabia_6852338.jpg?20250310172943",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-11 20:13:00",
        "Headline": "Ukrainian President Volodymyr Zelenskyy said he accepted a 30-day ceasefire agreement brokered by the US following talks in Saudi Arabia - but will Russia accept it?",
        "Content": " As Ukraine says it has accepted a proposal for a 30-day ceasefire, US secretary of state Marco Rubio says \"the ball is now in Russia's court\". Ukrainian President Volodymyr Zelenskyy said he accepted the proposal as his country, which has been fending off Russia's full-scale invasion for the past three years, was \"ready for peace\". Here is what Sky News correspondents think of the latest developments in the ongoing efforts to end the hostilities. Follow the latest: Trump warns Putin 'it takes two to tango'  Ivor Bennett, Moscow correspondent Will Russia accept a ceasefire? Hard to say. Because throughout the past few weeks and months, Moscow has always said it doesn't want a temporary truce. \n                  What's in the US-proposed Russia and Ukraine ceasefire deal?\n                 \n                  Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine\n                 \n                  Ukraine's drone attack on Russia sent a message - and not just to the Kremlin\n                 Instead, it's called for a long-term peace deal that tackles what it sees as the \"root causes\" of the conflict. In Moscow's mind, \"root causes\" means Western aggression and NATO's historical eastward expansion. By making that a consistent criterion for peace, Russia has been trying to ensure that its own security concerns are met in the event of a final deal being signed. I think it's also a way of legitimising its full-scale invasion, which Russia claims was done to protect Russian speakers in eastern Ukraine as a result of the Minsk agreements not being upheld. Read more:US to resume intelligence sharing and military aid with UkraineUkraine's drone attack on Russia sent a message  The Minsk agreements were ceasefire deals signed between Kyiv and Russian-backed separatists in the Donbas in 2014 and 2015. Moscow's reasoning is that Kyiv can't be trusted to stick to a truce. But this is largely posturing by the Kremlin, to reinforce its own narrative around the conflict - that it is the victim, fighting a defensive war. A more compelling reason as to why Russia favours a permanent deal over a temporary one is because Ukrainian forces are on the back foot. A pause in the fighting would give them time to regroup, so why would Moscow agree? It wants to have Kyiv begging for mercy when it comes to the negotiating table, so that a permanent deal would be entirely in Russia's favour. The problem for Vladimir Putin, though, is that he now has to put his money where his mouth is.  In order to win Donald Trump's favour, the Kremlin has been relentless in trying to cast itself as the peacemaker and Ukraine as the warmonger. It's worked up until this point, with America increasingly siding with Russia. But now, all of a sudden, Kyiv is calling Moscow's bluff. James Matthews, US correspondent, in Washington DC It looks like progress and it sounds like progress. How much it is actual progress will be a matter for the Russians. Moscow will decide if this step forward amounts to two steps back. The Americans and Ukrainians did the easy bit in Saudi Arabia. This was a diplomatic healing between both parties, a reset on relations that restores a military alliance. Clearly, Ukraine will welcome the US lifting its pause on intelligence sharing and weapons supply. It will strengthen the ties between Washington and Kyiv, even if trust remains undermined. There is deep suspicion in Kyiv surrounding the motivations of President Trump and his relationship with Mr Putin. Ukrainian president Zelenskyy called the ceasefire proposal a positive step - he's content as far as it goes, even if he'll have questions around the context. Ukraine was second behind Russia on the guest list for talks with the Americans and, while Mr Trump has courted Mr Putin, he's cold-shouldered Mr Zelenskyy. Discussions between Mr Trump and Mr Putin will surely have given the US president a guide on how the Russians will respond to offers made. Would Mr Trump have proposed a ceasefire without an assurance that Mr Putin would accept? Unlikely, given everything Moscow has to gain. The future floated for Ukraine by the Trump administration doesn't include NATO membership, doesn't reflect a desire to roll back Russian territorial gains and doesn't rule out lifting sanctions against Moscow. For Ukraine, there are difficult questions about what comes after the guns go silent. A ceasefire in the current conditions isn't the starting point that Mr Zelenskyy would have chosen but, realistically, it's the only starting point he's got. Alex Rossi, international correspondent, in Jeddah, Saudi Arabia It was a long day of negotiations but at the end it appeared that the Ukrainian and American delegations had found common ground. When they entered the talks they looked focused - there is a lot riding on the talks. When they emerged after sundown it was clear that they had achieved something - small steps on what will be a long and difficult road to achieve any sort of peace. The initial agreement saw progress on a readiness by the Ukrainians to accept an immediate interim 30-day ceasefire in theory. Whilst there are still many outstanding issues, there is now movement to end a war that has been grinding on for more than three years. For the Ukrainians, they wanted and needed to mend the relationship with the US after that now infamous diplomatic spat in the Oval Office.  They were seeking a restoration of military aid and intelligence sharing. The US has now announced it will immediately restart its assistance. What the Americans wanted to see was a Ukraine that was prepared to be flexible and make difficult decisions to reach a peace agreement. The Ukrainians were clearly persuasive on that count and the US delegation sounded convinced. But the war cannot stop without Russian agreement and whether Moscow bites and also agrees to an interim ceasefire is far from clear. They have given mixed signals. On the one hand, officials have said the Kremlin's war objectives remain the same and there will be no concessions but they have also said they are waiting to hear the details of the talks. Clearly the ball is now in Moscow's court. Mr Trump's envoy Steve Witkoff is heading to Moscow later in the week. It's reported he will discuss the diplomatic proposals with Mr Putin. But getting a lasting and sustainable peace will not be easy - Russia's leader is unlikely to accept anything that does not allow him to present his \"special military operation\" as anything other than a total victory. And until an agreement is reached, the violence and the killing will continue."
    },
    {
        "title": "The furious rise of climate whiplash",
        "description": "A phenomenon that made the recent California wildfires so damaging is spreading further afield.",
        "url": "https://news.sky.com/story/the-furious-rise-of-climate-whiplash-13326408",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-climate-whiplash-graphic_6853234.jpg?20250311160004",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-11 15:48:00",
        "Headline": "What happens when the wet weather gets wetter and then the dry weather gets drier? That's what played out in the recent Los Angeles wildfires, and the phenomenon is spreading.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A phenomenon that made the recent California wildfires so damaging is spreading further afield. Climate \"whiplash\" sees dangerous swings between very wet weather and very dry weather. Drought or extreme rain are hard enough to contend with on their own. The problem with whiplash is the severe jerk from one to the other makes them both more damaging. It bore out in Los Angeles when two very wet winters produced lots of grass and shrubs, and were then followed by a long, hot summer that dried out that vegetation, providing abundant, tinder-dry fuel ripe for a wildfire. Without this swing \"there still could have been severe fires, but this was definitely an event that was amplified by that particular sequence\", says Dr Daniel Swain, climate scientist from University of California Los Angeles. Heavy rain will slide off scorched earth more rapidly, leading to landslides and flooding. Keeping reservoirs full should help guard against drought - but sudden, heavy downpours can send them overflowing, flooding the surroundings. \n                  Drivers 'confused' by transition to electric vehicles, ministers warned\n                 \n                  More heat pumps, fewer kebabs - Is this the way to stop climate change?\n                 \n                  Heat pumps, EVs and fewer kebabs: You'll notice the next cut to emissions - but half the work is done\n                 How is whiplash changing? A little bit of this whiplash is natural. But scientists are newly talking about it as climate change is making it worse in locations all around the world. That's because the atmosphere works like a sponge: it can both soak up and release water. The hotter it is, the more water it can soak up - and unleash too. So climate change, by warming the atmosphere, is essentially growing the size of the sponge - exponentially, too. New research by the charity WaterAid has identified at least 17 major cities where climate whiplash is getting worse, out of 112 they analysed (the world's 100 largest plus 12 more where it works). While the recent Los Angeles wildfires may be burned in our memory, there are other places that are much more vulnerable. Partly because they are not fabulously wealthy like the rich and famous of Hollywood, with poorer people and infrastructure, but also because the swings are more extreme. Take Hangzhou in eastern China, for example, which topped the list of cities with intense climate whiplash. The higher and darker the spikes in the chart, the more intense the weather. Or Jakarta, second on the list - just look at how dark, wide and tall those wet and dry periods are on the right-hand side. Impacts in Indonesia's capital have been \"escalating\", with disasters on course to get more frequent and severe, says Egi Suarga, climate manager for World Resources Institute Indonesia. This threatens food security, adds Prof Cedric John from Queen Mary University London, who has been working with Indonesia's Bureau for Meteorology, Climate, and Geophysics (BMKG). \"The uncertainty in the timing and intensity of rainfall, as well as the prolonged drought, can lead to crop failure or poor harvest.\" WaterAid's chief executive Tim Wainwright says: \"It affects people's health. It affects education. It affects people's livelihoods. In extreme cases, it will take people's lives.\" Where could whiplash strike next? Partly what makes whiplash so dangerous is its unpredictability. It's hard to prepare for. But Dr Swain says there are \"early indications\" of a particularly hot and dry start to summer across much of western USA, following relatively wet periods, \"opening the door to a potential wet-to-dry whiplash event\". Whiplash isn't affecting everywhere yet. In fact, in London the extremes may have calmed for now, found WaterAid, which worked with scientists from Cardiff and Bristol Universities to produce these new metrics. And places like Cairo have 'flipped' completely, going from long-term wet to long-term dry. But eventually the whiplash phenomenon may spread everywhere as the air keeps warming due to climate change. \"We do, in fact, expect that almost every populated inhabited continent on Earth will eventually see a substantial increase in that whiplash,\" said Dr Swain. A study by him in January found whiplash has already increased by at least 31% on average across the globe. Are there solutions? The best solution would be to stop emitting greenhouse gases. But this comes at a time when the US looks to up fossil fuel energy and row back on overseas funding for climate projects. The UK has also eaten into its aid budget to pay for increased defence spending. But solutions are often \"very well known and very simple\", says Tim Wainwright. In Karachi, for example, people harvest water from the sky as it cools, and then us it to wash, farm, or refill dried up wells. Wainwright says the solution often \"does not require a huge leap forward in technology. It requires leaps forward in political leadership and investment\"."
    },
    {
        "title": "Surge in stab victims forces hospital to offer knife amnesty",
        "description": "A south London hospital has revealed the frightening results of a knife amnesty it introduced after a massive surge in stab victims it was having to treat.",
        "url": "https://news.sky.com/story/surge-in-stab-victims-forces-hospital-to-offer-knife-amnesty-13326794",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-knives-st-georges-hospital_6853727.jpg?20250311232437",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-11 23:25:00",
        "Headline": "St George's Hospital in Tooting brought in the measure after its emergency department treated more than 500 people for injuries from knives and other sharp objects last year.",
        "Content": "A south London hospital has revealed the frightening results of a knife amnesty it introduced after a massive surge in stab victims it was having to treat. St George's Hospital in Tooting brought in the measure after its emergency department treated more than 500 people for injuries from knives and other sharp objects last year - almost double the number seen in 2022. Provided by knife crime charity Words 4 Weapons, St George's installed an amnesty bin on the hospital grounds near the emergency department for people to anonymously dispose of weapons. In its first six months, 87 sharp objects were surrendered, including zombie knives and machetes, as well as other weapons such as knuckle dusters. Cleo Kenington, consultant in emergency general surgery and major trauma at the hospital, said she has had to \"physically remove knives from patients on the operating table to stop them bleeding to death\". \"These patients are young, vulnerable and scared - they have their whole lives ahead of them and they often say 'I don't want to die',\" she added. \"I've seen more and more patients being admitted with stab wounds - once they arrive at St George's we provide them with the best possible care and most survive, but tragically many patients die before they can reach hospital as their injuries are so severe.\" \n                  Bristol teenager jailed for stabbing older sister to death in 'brutal' murder\n                 \n                  Easier for children to buy knives than paracetamol, police review finds amid government crackdown\n                 \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 After the success of the scheme in London, an NHS trust said it would introduce the bins at St Helier Hospital in Carshalton and Epsom Hospital in Surrey. Jacqueline Totterdell, chief executive of St George's, Epsom and St Helier University Hospitals and Health Group, said: \"Keeping staff and patients safe is our top priority - that's why we're working with partners to keep weapons out of our hospitals.\" Read more:Sky News visits knife crime hotspotsWhat are the UK's knife crime laws? Policing minister Dame Diana Johnson added: \"Tackling violence and making our streets safer is at the heart of this government's Plan for Change and we cannot do this alone. \"I've seen first-hand how hospitals like St George's can help - they are so often at the centre of tragic incidences of knife crime. \"Last month, we announced £9.4m of funding for the London Violence Reduction Unit which will enable them to continue funding youth workers in major trauma centres across London to help young people impacted by knife crime.\""
    },
    {
        "title": "Couple fighting £1,500 fine after migrant hid on motorhome and ended up in Essex",
        "description": "A couple fined by the government after a migrant hid on their motorhome say it's unfair as they checked the vehicle before leaving France - and even border officers didn't spot him.",
        "url": "https://news.sky.com/story/couple-fighting-1631500-fine-after-migrant-hid-on-motorhome-and-ended-up-in-essex-13326742",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-motorhome-migrant-fine_6853622.jpg?20250311221616",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-11 22:19:00",
        "Headline": "The Home Office says the \"clandestine entrant civil penalty scheme is there to ensure drivers take every reasonable step to deter irregular migration\".",
        "Content": "A couple fined by the government after a migrant hid on their motorhome say it's unfair as they checked the vehicle before leaving France - and even border officers didn't spot him. Joanne and Adrian Fenton found the man when they parked up at their Essex home in October. He was zipped inside the bike rack cover - and a few weeks ago the Home Office confirmed they're getting a hefty fine.  Mr Fenton told The UK Tonight With Sarah-Jane Mee they had no idea the man was there and described the moment they finally caught sight of him. \"[I] backed up to the garage and as I walked around the rear of the vehicle and lifted up the canvas cover, I saw a pair of white trainers,\" he said. \"Then suddenly they start moving, and I lift the cover up and see a pair of legs - and look up and there's someone under there.\" Mr Fenton said he shouted to his wife to call the police and gave the man some water until officers arrived. \n                  Cranston Inquiry: Coastguard official recalls taking 'distressing' calls during Channel's deadliest small boat sinking\n                 \n                  Deadliest English Channel crossing in history 'a terrible human tragedy', inquiry hears\n                 \n                  Eurostar resumes direct Amsterdam-London services after eight-month pause\n                 \"We asked him to stay under the cover as we didn't know if he was violent, aggressive, on drugs, or anything like that,\" Mr Fenton added. He said they did \"everything reasonably practical to check our vehicle\" before heading back from France. \"When we left out last destination, the Carrefour, we walked round, we checked the vehicle,\" he said - adding that the vehicle is also fully alarmed. His wife, Joanne, said they are fighting the fine but thinks the Home Office will \"just say we didn't check properly and still fine us whatever\". She told Sky News: \"They are trying this to stop it [illegal migration], and we get that. They're saying we're negligent, we get that. \"But we're holidaymakers. The lorry drivers - they [border officers] use infrared [to check]. \"Why can't they do that with the holidaymakers, motorhomes, caravans coming through the Shuttle.\" Read more from Sky News:Triple killer will serve whole-life sentence13-year-old girl charged with murdering woman The couple said the motorhome was also checked at passport control, with an officer walking around the vehicle with Mr Fenton. \"They're the professionals,\" he said. \"If they can't spot someone how are we - as holidaymakers and tourists - supposed to do it.\" The Home Office said in a statement: \"We are fully committed to stopping people from illegally entering the country and cracking down on people smugglers, which is why the clandestine entrant civil penalty scheme is there to ensure drivers take every reasonable step to deter irregular migration.\""
    },
    {
        "title": "Man arrested on suspicion of manslaughter over North Sea ship collision is captain of cargo ship",
        "description": "A man has been arrested on suspicion of gross negligence manslaughter in connection with the ship collision in the North Sea.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-manslaughter-over-north-sea-ship-collision-13326404",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-crash-north-sea-stena_6853182.jpg?20250311151701",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-11 15:35:00",
        "Headline": "Humberside Police said the 59-year-old was arrested in connection with the collision between the Stena Immaculate and Solong in the North Sea on Monday. The cargo ship's owner Ernst Russ later said the captain was the man arrested.",
        "Content": "A man has been arrested on suspicion of gross negligence manslaughter in connection with the ship collision in the North Sea. Humberside Police said the 59-year-old is in custody to allow enquiries to take place, and officers are talking to those involved to find out what happened. The force added investigators have started a criminal probe into the cause of the collision between the Stena Immaculate and Solong off the coast of East Yorkshire on Monday, and are working with the Maritime and Coastguard Agency. Ernst Russ, the owner of Solong, later confirmed the man detained was the ship's captain. The shipping firm called him \"the master of the ship\" - which is understood to be the same as a captain.  One person remains missing and is presumed dead after emergency services stopped their search on Monday evening. The Marine Accident Investigation Branch is also involved in early work to determine what caused the two vessels to collide. Read more: What we know about the collision \n                  What the North Sea crash could mean for the environment?\n                 \n                  North Sea crash: Solong ship unlikely to stay afloat but wasn't carrying sodium cyanide, owners say\n                 \n                  Oil tanker-freighter collision could have lethal ecological impact - it depends on these three things\n                  Senior Investigating Officer, Detective Chief Superintendent Craig Nicholson, said: \"Humberside Police have taken primacy for the investigation of any potential criminal offences which arise from the collision between the two vessels. \"Extensive work has already been carried out, and we are working closely with our partners to understand what happened, and to provide support to all of those affected. \"Following enquiries undertaken by my team, we have arrested a 59-year-old man on suspicion of gross negligence manslaughter in connection with the collision, this follows the conclusion of search operations by HM Coastguard for the missing crew member of the SOLONG.\"  He added: \"Our thoughts are with the family of the missing crew member, and I have appointed family liaison officers to make contact and provide support to the family. \"The man arrested remains in custody at this time whilst enquiries are under way, and we continue speaking with all those involved to establish the full circumstances of the incident.\" Ernst Russ added in a later statement that it could confirm the master of the Solong \"has been detained by Humberside Police in the UK\". \"The master and our entire team are actively assisting with the investigations,\" the shipping firm said. \"Out of respect for the investigation and all involved we will not comment further at this time.\" Read more:Oil tanker collision could have lethal ecological impactSky News above North Sea ship collision US tanker Stena Immaculate was anchored off the coast of East Yorkshire when the Solong crashed into it at around 9.45am on Monday. Some 36 people were brought safely to the shore, but one person was reported missing from the cargo ship. At around 11.20pm, the Solong started to drift southwards away from the crash site. HM Coastguard said in an update earlier on Tuesday that the ship is still alight. Tugboats are in the vicinity to ensure it remains away from the coast Transport Secretary Heidi Alexander said the container ship is expected to stay afloat, after a minister told parliament that it could sink earlier in the day. She said she met with the Maritime and Coastguard Agency's chief executive Virginia McVea, and was \"pleased to have been informed that early indications suggest that both vessels are now expected to stay afloat\". Ernst Russ also denied reports the vessel was carrying sodium cyanide and said: \"There are four empty containers that have previously contained the hazardous chemical. \"These containers will continue to be monitored.\" Stena Immaculate was carrying 220,000 barrels of Jet-A1 fuel in 16 tanks, at least one of which was ruptured, its operator also said."
    },
    {
        "title": "13-year-old girl charged with murder of woman in Wellingborough",
        "description": "A 13-year-old girl has been charged with murder after a woman's body was found at a house in Wellingborough, Northamptonshire.",
        "url": "https://news.sky.com/story/13-year-old-girl-charged-with-murder-of-woman-in-wellingborough-13326421",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wellingborough-murder_6853524.png?20250311210902",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-11 15:56:00",
        "Headline": "The child, who cannot be named for legal reasons, is also charged with arson with an attempt to endanger life.",
        "Content": "A 13-year-old girl has been charged with murder after a woman's body was found at a house in Wellingborough, Northamptonshire. The child, who cannot be named for legal reasons, is also charged with arson with an attempt to endanger life. Formal identification has yet to be confirmed, but the woman who died is believed to be 43-year-old mother-of-three Marta Bednarczyk, Northamptonshire Police said. A forensic post-mortem investigation gave the preliminary cause of death as being a result of sharp force injury. Police and firefighters had attended the address in Newcomen Road after reports came in of a fire at the property. Inside, officers found Ms Bednarczyk's body and paramedics declared her dead at the scene shortly after 3am on Monday. Police are asking people to avoid the immediate area. The 13-year-old girl is due to appear at Northampton Magistrates' Court at 10am on Wednesday. Detective Chief Inspector Johnny Campbell said: \"This evening we have formally charged a 13-year-old Wellingborough girl with murder, and arson, and she will appear before Northampton Magistrates Court at 10am tomorrow. \"I want to take a moment to thank the many police officers and staff who are working and continue to work tirelessly on this investigation since the very tragic events of early yesterday morning. \"And, in particular, all our thoughts are with Marta's family who have been fully co-operative throughout what has been a devastating couple of days for them.\""
    },
    {
        "title": "Triple killer Kyle Clifford will serve whole-life sentence for murdering TV racing commentator's family ",
        "description": "Triple killer Kyle Clifford has been handed a whole-life sentence for murdering his ex-girlfriend, her mother and her sister.",
        "url": "https://news.sky.com/story/triple-killer-kyle-clifford-gets-whole-life-sentence-for-murdering-bbc-commentators-family-13326218",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-carol-hannah-louise_6623066.jpg?20240710233349",
        "type": "Home",
        "Author": "Henry Vaughan",
        "Date Published": "2025-03-11 09:17:00",
        "Headline": "Kyle Clifford tricked his way into the family home, carried out \"a brutal knife attack\" on Carol Hunt, 61, then raped his ex-girlfriend Louise Hunt before killing her and her sister Hannah with a crossbow.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  Triple killer Kyle Clifford has been handed a whole-life sentence for murdering his ex-girlfriend, her mother and her sister. Warning: This article contains distressing details. The sentence imposed by Mr Justice Bennathan means he will never be released. The former soldier, 26, admitted murdering TV racing commentator John Hunt's wife Carol Hunt, 61, and their daughters Louise, 25, and Hannah, 28. He also pleaded guilty to false imprisonment of his former partner Louise, as well as possession of the crossbow used to kill her and her sister, and the 10-inch butcher's knife he stabbed their mother to death with. Clifford denied raping Louise, who had broken up with him 13 days before the four-hour attack in the Hunt family home on 9 July last year. But he was found guilty by a jury last week after a trial at Cambridge Crown Court, which he refused to attend, prompting police and prosecutors to brand him a \"coward\". The judge paid tribute \"to the astonishing dignity and courage\" of the victims' family, including John Hunt and his surviving daughter Amy, who he hugged after the sentence.  They, along with Hannah's partner Alex Klein, had read emotional victim impact statements in court as Mr Hunt said hell would roll out the \"red carpet\" for him. He said the evidence showed Clifford \"to be a jealous man, soaked in self-pity - a man who holds women in utter contempt\". The court heard Clifford, from Enfield, north London, began planning the murders after Louise ended their 18-month relationship in a message on 26 June. He tricked his way inside before stabbing her mother to death in what prosecutors said was a \"brutal knife attack\", then lay in wait for an hour for Louise to enter the house. Clifford held her for more than two hours, as he restrained her with duct tape and raped her, then shot her through the chest with a crossbow moments before her sister Hannah got home and was also killed. He fled the scene and shot himself with the weapon as armed police descended and is now paralysed from the chest down. The judge told Clifford, who didn't attend his sentencing hearing, he went to the Hunt family home to launch \"a murderous attack\" on his ex-girlfriend's family. \"You first killed her mother Carol, who even on that day showed you nothing but kindness in the moments before you attacked her,\" he said. \"You raped and killed Louise who had been as gentle as she could in ending her relationship with you, after your arrogance and anger proved too much for her to stand. \"Then you murdered Hannah Hunt, who had done nothing to harm you save supporting her little sister.\" The jury wasn't told Clifford had searched for Andrew Tate's podcast less than 24 hours before the murders. Prosecutor Alison Morgan KC said \"it is no coincidence\" he turned to the \"poster boy for misogynists - a poster boy for those who view women as possessions to be controlled\" the night before committing such \"acts of violence against women\"."
    },
    {
        "title": "Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium",
        "description": "Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%.",
        "url": "https://news.sky.com/story/donald-trump-climbs-down-from-threat-to-escalate-trade-war-with-canada-by-doubling-tariffs-on-steel-and-aluminium-13326385",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6853609.jpg?20250311220856",
        "type": "Home",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-11 14:54:00",
        "Headline": "In response to the US president's measures, Canada's incoming prime minister Mark Carney said he will keep tariffs in place until Americans \"show respect\" and commit to free trade.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%. The US president stepped back from his order after the provincial government of Ontario rowed back on a plan to charge 25% more for electricity it supplies to over 1.5 million American homes and businesses. Canada's most populous province provides electricity to Minnesota, New York and Michigan. As a result, White House trade adviser Peter Navarro said Mr Trump would not double steel and aluminium tariffs - but the federal government still plans to place a 25% tariff on all steel and aluminium imports from Wednesday. Ontario's response In his initial response to Mr Trump's threat, Ontario's premier Doug Ford said he would not back down until the US leader's tariffs on Canadian imports were \"gone for good\". But he later suspended the change temporarily, saying \"cooler heads need to prevail\" and he was confident the US president would also stand down on his plans. Meanwhile, Canada's incoming prime minister Mark Carney said he will keep other tariffs in place until Americans \"show respect\" and commit to free trade. Mr Carney called the new tariffs threatened by Mr Trump an \"attack\" on Canadian workers, families and businesses. Read more:Analysis: Uncertainty index spikes amid on/off confusion over Trump tariffs  Why is Trump threatening tariffs? A worldwide 25% tariff on steel and aluminium is due to come into effect on Wednesday as a way to kickstart US domestic production. Separate tariffs on goods from Mexico and Canada covered by a previous trade agreement (the US Mexico Canada, or USMCA deal) were delayed by a month to 2 April. President Trump seems to bear a particular grudge against Canada because of what he sees as rampant fentanyl smuggling and high Canadian taxes on dairy imports, which penalise US farmers. He has called for Canada to become part of the United States as its \"cherished 51st state\" as a solution, which has angered Canadian leaders.  Economic impact Mr Trump's turnaround comes after markets fell in response to his threat of doubling tariffs. The stock market has fallen over the last two weeks and Harvard University economist Larry Summers put the odds of a recession at 50-50. \"All the emphasis on tariffs and all the ambiguity and uncertainty has both chilled demand and caused prices to go up,\" the former treasury secretary for the Clinton administration posted on X on Monday. \"We are getting the worst of both worlds - concerns about inflation and an economic downturn and more uncertainty about the future and that slows everything.\" Investment bank Goldman Sachs revised down its growth forecast for this year from 2.2% to 1.7% and moderately increased its recession probability to 20% \"because the White House has the option to pull back policy changes if downside risks begin to look more serious\". Mr Trump has tried to reassure the American public that his tariffs will cause a bit of a \"transition\" to the economy as taxes spur more companies to begin the years-long process of relocating factories to the US to avoid tariffs. 👉 Follow Trump 100 on your podcast app 👈 Trump refuses to rule out recession Mr Trump did not rule out the possibility of a recession during an interview with Fox News on Sunday, where he said: \"I hate to predict things like that.\" On Tuesday, he was asked about a potential recession and said \"I don't see it at all\" and claimed the US is \"going to boom\". On Monday, the S&P 500 stock index fell 2.7% and on Tuesday it was around 10% below its record set last month."
    },
    {
        "title": "'Shattering blow' to farmers over pause to environmental payment scheme",
        "description": "A \"shattering blow\" has been dealt to farmers with the sudden pausing for new applications for environmental payments, according to the National Farmers' Union.",
        "url": "https://news.sky.com/story/shattering-blow-to-farmers-over-pause-to-environmental-payment-scheme-13326652",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-farm-protest-farmers_6853575.png?20250311221311",
        "type": "Home",
        "Author": "Dan Whitehead",
        "Date Published": "2025-03-11 21:14:00",
        "Headline": "The agricultural community has reacted with anger over changes to the Sustainable Farming Incentive - with a union claiming it was only given half an hour's warning.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n A \"shattering blow\" has been dealt to farmers with the sudden pausing for new applications for environmental payments, according to the National Farmers' Union. The NFU says it was given just 30 minutes notice by the government that applications for the Sustainable Farming Incentive (SFI) were to close on Tuesday. The post-Brexit scheme, launched in 2022, pays farmers and land managers to take up practices that improve productivity and protect the environment and climate. Politics latest: UK set to be hit by Trump's steel tariffs There were more than 100 options for farmers to choose from, including the management of hedgerows, organic farming development and providing habitat for wildlife. The government says the budget for SFI has now been reached, adding that a \"record\" 50,000 farm businesses and more than half of all farmed land is now managed under the schemes. Both Conservatives and Liberal Democrat politicians have criticised the move and the lack of any prior warning. \n                  Labour MP goes public to oppose family farms tax - and more could follow\n                 \n                  Farmers react with 'fury' and 'anger' after Treasury meeting over inheritance tax\n                 \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 But NFU president Tom Bradshaw said the decision showed \"how little\" the Department for Environment, Food And Rural Affairs (Defra) understood the industry.  'Growing disregard for agriculture within Defra' \"This is another shattering blow to English farms, delivered yet again with no warning, no understanding of the industry and a complete lack of compassion or care,\" Mr Bradshaw said. \"Today's terrible news was delivered with only 30 minutes warning to us before ministers briefed the press, leaving us unable to inform our members. \"There has been no consultation, no communication; there has been a total lack of the 'partnership and co-design' Defra loves to talk about. It is another example of the growing disregard for agriculture within the department.\" The government has said \"every penny\" in all existing SFI agreements will be paid to farmers, and outstanding eligible applications that have been submitted will also be taken forward. It said details of a new SFI scheme will be announced following the Spending Review. Read more:What's the beef with farmers' inheritance tax?Reed apologises to farmers for tax 'shock' West of England and Wales correspondent It was only last week that thousands of farmers were protesting outside Downing Street at the inheritance tax policy that's angered so many in agriculture. But one group representing farmers said on Tuesday the SFI decision is the \"cruellest betrayal so far\".\n The scheme was introduced under the Conservatives post-Brexit, to encourage sustainable farming. It took years to develop - and was seen as world leading in a way of ensuring farming was both productive for the sector and protective of the environment. Although a new scheme after the spending review is promised, many farmers will be left wondering whether it'll be as comprehensive. The National Farmers' Union was preparing on Wednesday to release a report saying that farming confidence in England and Wales is at its lowest level ever. It's described Tuesday's news as a \"bleak irony\". In a statement, minister for food security and rural affairs Daniel Zeichner said: \"This government is proud to have set the biggest budget for sustainable food produce in history, to boost growth in rural communities and all across the UK, under our plan for change. \"More farmers are now in schemes and more money is being spent through them than ever before. That is true today and will remain true tomorrow.  \"We have now successfully allocated the SFI24 budget as promised.\" 👉 Listen to Sky News Daily on your podcast app 👈 The government claims the last administration left the scheme uncapped - and they had to put a limit on to stop it running over budget. 'Absolutely bonkers' Olly Harrison, an arable farmer on Merseyside who organised the latest farming protest in London earlier this month, said the decision showed farmers were being \"attacked from every single angle\". \"It's just absolutely bonkers. The scheme worked. It was to replace what we had when we were in Europe [the EU] and a lot of farms embraced it, they were doing real good with it.\" \"Why have we got people who don't understand and don't understand the environment in power?\" Edward Morello, the Liberal Democrat MP for West Dorset, told Sky News the decision will \"alarm farmers across the UK\" - and called for the government to \"start listening and responding\" to the agricultural community. Tim Farron, the MP for Westmorland and Lonsdale, said the decision was made with \"no warning\". Conservative shadow farming minister Robbie Moore said the change was \"absolutely scandalous\"."
    },
    {
        "title": "Man arrested on suspicion of manslaughter over North Sea ship collision is captain of cargo ship",
        "description": "A man has been arrested on suspicion of gross negligence manslaughter in connection with the ship collision in the North Sea.",
        "url": "https://news.sky.com/story/man-arrested-on-suspicion-of-manslaughter-over-north-sea-ship-collision-13326404",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-crash-north-sea-stena_6853182.jpg?20250311151701",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-11 15:35:00",
        "Headline": "Humberside Police said the 59-year-old was arrested in connection with the collision between the Stena Immaculate and Solong in the North Sea on Monday. The cargo ship's owner Ernst Russ later said the captain was the man arrested.",
        "Content": "A man has been arrested on suspicion of gross negligence manslaughter in connection with the ship collision in the North Sea. Humberside Police said the 59-year-old is in custody to allow enquiries to take place, and officers are talking to those involved to find out what happened. The force added investigators have started a criminal probe into the cause of the collision between the Stena Immaculate and Solong off the coast of East Yorkshire on Monday, and are working with the Maritime and Coastguard Agency. Ernst Russ, the owner of Solong, later confirmed the man detained was the ship's captain. The shipping firm called him \"the master of the ship\" - which is understood to be the same as a captain.  One person remains missing and is presumed dead after emergency services stopped their search on Monday evening. The Marine Accident Investigation Branch is also involved in early work to determine what caused the two vessels to collide. Read more: What we know about the collision \n                  What the North Sea crash could mean for the environment?\n                 \n                  North Sea crash: Solong ship unlikely to stay afloat but wasn't carrying sodium cyanide, owners say\n                 \n                  Oil tanker-freighter collision could have lethal ecological impact - it depends on these three things\n                  Senior Investigating Officer, Detective Chief Superintendent Craig Nicholson, said: \"Humberside Police have taken primacy for the investigation of any potential criminal offences which arise from the collision between the two vessels. \"Extensive work has already been carried out, and we are working closely with our partners to understand what happened, and to provide support to all of those affected. \"Following enquiries undertaken by my team, we have arrested a 59-year-old man on suspicion of gross negligence manslaughter in connection with the collision, this follows the conclusion of search operations by HM Coastguard for the missing crew member of the SOLONG.\"  He added: \"Our thoughts are with the family of the missing crew member, and I have appointed family liaison officers to make contact and provide support to the family. \"The man arrested remains in custody at this time whilst enquiries are under way, and we continue speaking with all those involved to establish the full circumstances of the incident.\" Ernst Russ added in a later statement that it could confirm the master of the Solong \"has been detained by Humberside Police in the UK\". \"The master and our entire team are actively assisting with the investigations,\" the shipping firm said. \"Out of respect for the investigation and all involved we will not comment further at this time.\" Read more:Oil tanker collision could have lethal ecological impactSky News above North Sea ship collision US tanker Stena Immaculate was anchored off the coast of East Yorkshire when the Solong crashed into it at around 9.45am on Monday. Some 36 people were brought safely to the shore, but one person was reported missing from the cargo ship. At around 11.20pm, the Solong started to drift southwards away from the crash site. HM Coastguard said in an update earlier on Tuesday that the ship is still alight. Tugboats are in the vicinity to ensure it remains away from the coast Transport Secretary Heidi Alexander said the container ship is expected to stay afloat, after a minister told parliament that it could sink earlier in the day. She said she met with the Maritime and Coastguard Agency's chief executive Virginia McVea, and was \"pleased to have been informed that early indications suggest that both vessels are now expected to stay afloat\". Ernst Russ also denied reports the vessel was carrying sodium cyanide and said: \"There are four empty containers that have previously contained the hazardous chemical. \"These containers will continue to be monitored.\" Stena Immaculate was carrying 220,000 barrels of Jet-A1 fuel in 16 tanks, at least one of which was ruptured, its operator also said."
    },
    {
        "title": "Surge in stab victims forces hospital to offer knife amnesty",
        "description": "A south London hospital has revealed the frightening results of a knife amnesty it introduced after a massive surge in stab victims it was having to treat.",
        "url": "https://news.sky.com/story/surge-in-stab-victims-forces-hospital-to-offer-knife-amnesty-13326794",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-knives-st-georges-hospital_6853727.jpg?20250311232437",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-11 23:25:00",
        "Headline": "St George's Hospital in Tooting brought in the measure after its emergency department treated more than 500 people for injuries from knives and other sharp objects last year.",
        "Content": "A south London hospital has revealed the frightening results of a knife amnesty it introduced after a massive surge in stab victims it was having to treat. St George's Hospital in Tooting brought in the measure after its emergency department treated more than 500 people for injuries from knives and other sharp objects last year - almost double the number seen in 2022. Provided by knife crime charity Words 4 Weapons, St George's installed an amnesty bin on the hospital grounds near the emergency department for people to anonymously dispose of weapons. In its first six months, 87 sharp objects were surrendered, including zombie knives and machetes, as well as other weapons such as knuckle dusters. Cleo Kenington, consultant in emergency general surgery and major trauma at the hospital, said she has had to \"physically remove knives from patients on the operating table to stop them bleeding to death\". \"These patients are young, vulnerable and scared - they have their whole lives ahead of them and they often say 'I don't want to die',\" she added. \"I've seen more and more patients being admitted with stab wounds - once they arrive at St George's we provide them with the best possible care and most survive, but tragically many patients die before they can reach hospital as their injuries are so severe.\" \n                  Bristol teenager jailed for stabbing older sister to death in 'brutal' murder\n                 \n                  Easier for children to buy knives than paracetamol, police review finds amid government crackdown\n                 \n                  Idris Elba on the power of football - and how it can help tackle knife crime\n                 After the success of the scheme in London, an NHS trust said it would introduce the bins at St Helier Hospital in Carshalton and Epsom Hospital in Surrey. Jacqueline Totterdell, chief executive of St George's, Epsom and St Helier University Hospitals and Health Group, said: \"Keeping staff and patients safe is our top priority - that's why we're working with partners to keep weapons out of our hospitals.\" Read more:Sky News visits knife crime hotspotsWhat are the UK's knife crime laws? Policing minister Dame Diana Johnson added: \"Tackling violence and making our streets safer is at the heart of this government's Plan for Change and we cannot do this alone. \"I've seen first-hand how hospitals like St George's can help - they are so often at the centre of tragic incidences of knife crime. \"Last month, we announced £9.4m of funding for the London Violence Reduction Unit which will enable them to continue funding youth workers in major trauma centres across London to help young people impacted by knife crime.\""
    },
    {
        "title": "Couple fighting £1,500 fine after migrant hid on motorhome and ended up in Essex",
        "description": "A couple fined by the government after a migrant hid on their motorhome say it's unfair as they checked the vehicle before leaving France - and even border officers didn't spot him.",
        "url": "https://news.sky.com/story/couple-fighting-1631500-fine-after-migrant-hid-on-motorhome-and-ended-up-in-essex-13326742",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-motorhome-migrant-fine_6853622.jpg?20250311221616",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-11 22:19:00",
        "Headline": "The Home Office says the \"clandestine entrant civil penalty scheme is there to ensure drivers take every reasonable step to deter irregular migration\".",
        "Content": "A couple fined by the government after a migrant hid on their motorhome say it's unfair as they checked the vehicle before leaving France - and even border officers didn't spot him. Joanne and Adrian Fenton found the man when they parked up at their Essex home in October. He was zipped inside the bike rack cover - and a few weeks ago the Home Office confirmed they're getting a hefty fine.  Mr Fenton told The UK Tonight With Sarah-Jane Mee they had no idea the man was there and described the moment they finally caught sight of him. \"[I] backed up to the garage and as I walked around the rear of the vehicle and lifted up the canvas cover, I saw a pair of white trainers,\" he said. \"Then suddenly they start moving, and I lift the cover up and see a pair of legs - and look up and there's someone under there.\" Mr Fenton said he shouted to his wife to call the police and gave the man some water until officers arrived. \n                  Cranston Inquiry: Coastguard official recalls taking 'distressing' calls during Channel's deadliest small boat sinking\n                 \n                  Deadliest English Channel crossing in history 'a terrible human tragedy', inquiry hears\n                 \n                  Eurostar resumes direct Amsterdam-London services after eight-month pause\n                 \"We asked him to stay under the cover as we didn't know if he was violent, aggressive, on drugs, or anything like that,\" Mr Fenton added. He said they did \"everything reasonably practical to check our vehicle\" before heading back from France. \"When we left out last destination, the Carrefour, we walked round, we checked the vehicle,\" he said - adding that the vehicle is also fully alarmed. His wife, Joanne, said they are fighting the fine but thinks the Home Office will \"just say we didn't check properly and still fine us whatever\". She told Sky News: \"They are trying this to stop it [illegal migration], and we get that. They're saying we're negligent, we get that. \"But we're holidaymakers. The lorry drivers - they [border officers] use infrared [to check]. \"Why can't they do that with the holidaymakers, motorhomes, caravans coming through the Shuttle.\" Read more from Sky News:Triple killer will serve whole-life sentence13-year-old girl charged with murdering woman The couple said the motorhome was also checked at passport control, with an officer walking around the vehicle with Mr Fenton. \"They're the professionals,\" he said. \"If they can't spot someone how are we - as holidaymakers and tourists - supposed to do it.\" The Home Office said in a statement: \"We are fully committed to stopping people from illegally entering the country and cracking down on people smugglers, which is why the clandestine entrant civil penalty scheme is there to ensure drivers take every reasonable step to deter irregular migration.\""
    },
    {
        "title": "Triple killer Kyle Clifford will serve whole-life sentence for murdering TV racing commentator's family ",
        "description": "Triple killer Kyle Clifford has been handed a whole-life sentence for murdering his ex-girlfriend, her mother and her sister.",
        "url": "https://news.sky.com/story/triple-killer-kyle-clifford-gets-whole-life-sentence-for-murdering-bbc-commentators-family-13326218",
        "image_url": "https://e3.365dm.com/24/07/1920x1080/skynews-carol-hannah-louise_6623066.jpg?20240710233349",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-03-11 09:17:00",
        "Headline": "Kyle Clifford tricked his way into the family home, carried out \"a brutal knife attack\" on Carol Hunt, 61, then raped his ex-girlfriend Louise Hunt before killing her and her sister Hannah with a crossbow.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  Triple killer Kyle Clifford has been handed a whole-life sentence for murdering his ex-girlfriend, her mother and her sister. Warning: This article contains distressing details. The sentence imposed by Mr Justice Bennathan means he will never be released. The former soldier, 26, admitted murdering TV racing commentator John Hunt's wife Carol Hunt, 61, and their daughters Louise, 25, and Hannah, 28. He also pleaded guilty to false imprisonment of his former partner Louise, as well as possession of the crossbow used to kill her and her sister, and the 10-inch butcher's knife he stabbed their mother to death with. Clifford denied raping Louise, who had broken up with him 13 days before the four-hour attack in the Hunt family home on 9 July last year. But he was found guilty by a jury last week after a trial at Cambridge Crown Court, which he refused to attend, prompting police and prosecutors to brand him a \"coward\". The judge paid tribute \"to the astonishing dignity and courage\" of the victims' family, including John Hunt and his surviving daughter Amy, who he hugged after the sentence.  They, along with Hannah's partner Alex Klein, had read emotional victim impact statements in court as Mr Hunt said hell would roll out the \"red carpet\" for him. He said the evidence showed Clifford \"to be a jealous man, soaked in self-pity - a man who holds women in utter contempt\". The court heard Clifford, from Enfield, north London, began planning the murders after Louise ended their 18-month relationship in a message on 26 June. He tricked his way inside before stabbing her mother to death in what prosecutors said was a \"brutal knife attack\", then lay in wait for an hour for Louise to enter the house. Clifford held her for more than two hours, as he restrained her with duct tape and raped her, then shot her through the chest with a crossbow moments before her sister Hannah got home and was also killed. He fled the scene and shot himself with the weapon as armed police descended and is now paralysed from the chest down. The judge told Clifford, who didn't attend his sentencing hearing, he went to the Hunt family home to launch \"a murderous attack\" on his ex-girlfriend's family. \"You first killed her mother Carol, who even on that day showed you nothing but kindness in the moments before you attacked her,\" he said. \"You raped and killed Louise who had been as gentle as she could in ending her relationship with you, after your arrogance and anger proved too much for her to stand. \"Then you murdered Hannah Hunt, who had done nothing to harm you save supporting her little sister.\" The jury wasn't told Clifford had searched for Andrew Tate's podcast less than 24 hours before the murders. Prosecutor Alison Morgan KC said \"it is no coincidence\" he turned to the \"poster boy for misogynists - a poster boy for those who view women as possessions to be controlled\" the night before committing such \"acts of violence against women\"."
    },
    {
        "title": "John Hunt's message to Kyle Clifford - as crossbow killer is sentenced for murdering BBC commentator's family",
        "description": "John Hunt has told the man convicted of murdering his two daughters and wife that hell will roll out a \"red carpet\" for him.",
        "url": "https://news.sky.com/story/john-hunts-message-to-killer-kyle-clifford-as-man-who-murdered-bbc-commentators-family-is-sentenced-13326310",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-john-hunt-carol-hunt_6853053.jpg?20250311123444",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-11 11:58:00",
        "Headline": "Mr Hunt delivered a powerful victim impact statement in court, aimed at his wife and daughters' killer Kyle Clifford, before the 26-year-old was sentenced for his crimes. ",
        "Content": "John Hunt has told the man convicted of murdering his two daughters and wife that hell will roll out a \"red carpet\" for him. Kyle Clifford, 26, was given a whole-life sentence for triple murder and rape at Cambridge Crown Court on Tuesday. He admitted shooting his ex-girlfriend Louise Hunt, 25, and her sister Hannah Hunt, 28, with a crossbow and fatally stabbing their mother, 61-year-old Carol Hunt, last July. Kyle Clifford sentencing latest: Follow live He had denied raping Louise during the attack, but was found guilty last week. Mr Hunt delivered a powerful victim impact statement in court, aimed at Clifford. Here is what he said - warning readers may find some of the content below upsetting: My name is John Hunt and I am blessed to be Carol's husband and Hannah, Louise and Amy's dad. Thank you for returning the guilty verdict today. That you had to consider the evidence was purely down to Kyle choosing to not admit responsibility. You too, are victims of his callous, cowardly, vindictive behaviours and I wish he hadn't put you through that. I so wanted to deliver these words, eye to eye with Kyle. I will continue to act as if I am doing so. 'You simply failed to be the person she needed' When I was first invited to provide a victim impact statement I initially misunderstood its purpose. Do I really need to detail the impact of having three quarters of my family murdered? But then I realised that this was my final opportunity to say what I want to say to you specifically Kyle, words that will also be directed to your family who will carry guilt forward for the rest of their lives; I know you valued them so poorly from all the conversations we had Kyle, but I suppose even they must be damaged by what you have done. I also want to confirm to the world the truth, especially how Louise conducted herself within a textbook, mature breakup on her part, understanding the conflict of saying goodbye to someone she once loved but not allowing those memories to cloud her certain knowledge that you simply failed to be the person she needed. You failed. I am so proud of all of my girls. Unlike you Kyle, at every step of their lives they made the correct choices to improve themselves as people; Louise enjoyed more success and fulfilment in one morning than you achieved in your entire miserable life. Do you recall Kyle, how kind we all were to you? Helping you and Louise enjoy trips away, do you remember how she loved a swanky hotel? You were always invited to meals out. A Sunday lunch at the pub or a special celebration, you were always made welcome. The only Christmas you spent together was at our house. Was it four or five days you spent with us? The food, the games, the laughter, the normality... what was it about that blissful existence you hated so much, Kyle? Could you not handle how pleasant it was, such a contrast to what you were used to. The trips to Italy, Disneyland and many more; Louise gave your relationship so much effort, which you were never able or willing to match. We all offered you kindness, especially Carol. She had picked up on your personal inadequacies right from the start. She sensed your immaturity but always knew Louise would work things out. Carol still displayed her compassion right up until the moment she answered the door to you on 9 July. Do you remember her kindness, Kyle; how she urged you to get some relationship help and guidance for fear that you would never be able to sustain a lasting relationship. You calmly accepted that advice on the doorstep and then seconds later, savagely stabbed her eight times and ended her life. 'You are a psychopath' When I challenge myself about how you were able to deceive us all, I simply say that you are a psychopath who, for the duration of your time together with Louise, was able to disguise yourself as an ordinary human being. You reserved your best, make-believe version of yourself for the times you were in our house. You managed to maintain that veneer of decency throughout the first year of your time with Louise, but you couldn't maintain it in the early part of 2024. Although Carol and I never witnessed any alarming behaviour, your visits became less frequent. You began the first of two affairs that we know about, your aversion to a day's hard work continued as you messed up yet another job at Reynolds. It wasn't only the Army that found you worthless. I often think of the list Louise wrote to herself to remind her of the reasons that you fell short. The racism. She was rightly disgusted by that. Your belittling language. The fact that your family is a mess. Like any woman should be allowed to do, she worked you out despite repeated deceit and said enough is enough. I hope women around the world will take Louise's bravery as a shining beacon for their lives. If you feel enough is enough, then it is. I'd like to remind you Kyle, of how gracious Louise was to you in that final text to you. This is what she said on the 26 June, the morning after she had finished with you face to face. She texted you thanking you for what was a wonderful year together, explaining how much she once loved you, that she never wanted any animosity to develop between you and that she wanted you to take care of yourself. You texted back saying: \"Thank you for the clarity Louise, so we can both start our healing process. I love you so much and I will for a very long time. I will always be here for you if you ever need me, please don't hesitate. I wish you all the best and take care of yourself too.\" The difference was, we know now, that Louise meant every word whereas you simply lied. 'You killed three beautiful mockingbirds, Kyle' You didn't love her enough to stop you having those two affairs in the spring of last year. Or to start planning to kill her and her family just days later. And that a horrific rape on her was part of the plan. Your levels of misogyny are off the scale. Louise's favourite novel from her schooldays was Harper Lee's classic, To Kill A Mockingbird. She was captivated by the goodness of Atticus Finch both as a father and a lawyer. She would often quote lines from the novel to match life's challenges. One of those quotes that comes to mind, right here in this moment is that of Miss Maudie reasserting Atticus' assertion that it's a sin to kill a mockingbird. She said: \"Your father's right. Mockingbirds don't do one thing except make music for us to enjoy. They don't eat up people's gardens, don't nest in corn cribs, they don't do one thing but sing their hearts out for us. That's why it's a sin to kill a mockingbird.\" All their lives, Carol, Hannah and Louise similarly spent their time bringing joy and colour and happiness to other people's lives. You killed three beautiful mockingbirds, Kyle. 'I can't imagine a more cowardly act' So, to remind you, over a period of four hours you brutally killed Carol, waited over an hour until Louise came into the house. You incapacitated her, raped her and when you realised Hannah was coming home, you shot Louise in the back. I can't imagine a more cowardly act. You couldn't look her in the eye. You murdered Hannah minutes later. So four hours. A few weeks later I also spent four hours with them Kyle; in the funeral director's. The usual room wasn't big enough for three bodies but they removed a partition wall so we could all be together. I sat for a while with Louise to my right, she looked so peaceful and Hannah to my left. I couldn't quite reach to hold their hands at the same time. Amy and I placed a photograph of Chester in Louise's right hand. Carol was at the top of the room. She was dressed in a beautiful orange dress she had bought for a wedding we went to a month beforehand. I stroked her hair and told her how much I loved her. I thanked her for being such a wonderful partner in life and wonderful mother. They were my four hours Kyle. 'I am lucky' And what about me? The impact of what you have done will be taken to my grave but on the way there, I want you to know that I stand strong before you today. As you are consigned to a fate far greater than death, I can draw on the love and strength that I still feel from the girls in every moment of every day. I am lucky. I have the most wonderful daughter, Amy, who gives me such focus and purpose. I have Gareth and Alex. I have my extended family, reaching far beyond my mum, brothers and sister, aunts and uncles and cousins. I have many friends who watch out for me on an hourly basis. Carol's friends are mine and I now have a renewed relationship with Hannah and Louise's best friends. I will always be there for them and they will be there for me too. So whilst I am so badly damaged, I am determined to see what my future is, surrounded by so many amazing people. And the chance to do so has been gifted to me by my incredible Hannah. I firmly believe that, had she not managed to show such amazing physical and mental strength in raising the alarm after you fatally injured her, then I would have been your fourth victim that day. Hannah handed me a second chance, one that she worked so hard to achieve for me. Do you really think after what she did for me, I will slight her memory and example by just giving up? Even though the days are difficult and feel on many occasions, impossible, I will channel my inner Atticus Finch at all times. He said: \"I want you to see what real courage is. Instead of getting the idea that courage is a man with a gun in his hand, its when you know you are licked before you begin, but you begin anyway and see it through no matter what.\" And now comes the time when your fate on this earth will be confirmed. 'Your misery will last for eternity' Every single person in the world, I'm thinking of mothers and fathers in particular, especially those daughters, now expects the formality of a life sentence. Never again to make choices of your own. To breathe fresh air only occasionally. To eat when someone else tells you to eat. But just remember one thing. Whatever sentence you are about to receive, whatever misery lies ahead for you for the next 60 years. Remember that after your days on earth are done, on your dying day, there will be no release for you. The screams of hell, Kyle, I can hear them faintly now. The red carpet will come out for you. At that point, when the person you could have been meets the person you are, you will realise your miserable fate will last for eternity. Amy Hunt - Mr Hunt's surviving daughter - also delivered a victim impact statement in court. Here is what she said: 'You are a monster'  That day you intruded into a beloved family home, where you yourself had spent lots of happy times, and attacked three defenceless women one by one, alone and out of the blue, with such hideous weapons that ensured they had no means of defending themselves. I can think of nothing more cowardly than that. That day, you had a choice, Kyle, and you chose to inflict violence of a horrific scale, all for your own selfish, sadistic aims - all the time, truly thinking of yourself alone. I can only assume that, in the days after Louise broke up with you, you created a false narrative in your head about how we had supposedly wronged you, in order to allow you to avoid confronting the pain and shame within you - and the truth, that the break-up was entirely your fault. That day, my mum, Hannah and Louise were all simply living their lives - getting on with their day in their home, working or returning home after work. Their home is a place that was, and should have continued to be, safe for them, and you made it the most unsafe place in the world for those few hours. You are a monster. What you did to Louise that day, Kyle, is nothing short of demonic. To put her through the torture you did is inexplicably horrific. And I ask again, for what? Because she dared to dump you? Something that was her right and choice? For that alone, you have earnt yourself your rightful spot in hell one day - and we can only hope that even you, who has continually denied this act, feel crippling shame every single moment for being the rapist that you are. 'Someone who put her family above all else' My mother Carol was everything to us - hysterically funny, loving, quick-witted, honest, the most caring and someone who put her family above all else her entire life. She adored her husband and her girls, and was fiercely protective of her children. She loved her home and her extended family and shared the most wonderful, loving, supportive and fun relationships with our dad, that provided me, Hannah and Louise with the perfect example of love - and our home was full of just that every single day, because of her. She and Dad gave us the most amazing childhood we could have ever asked for. My mum and I would talk for hours on end, either in person or on the phone, and she was the very best for providing advice, loving words, or comfort. I will miss the sound of her warm, reassuring voice for the rest of my life. 'Signature smile and contagious giggle' Hannah was feisty, hilarious, hard-working, eternally positive and inspiring, straight-talking and the most supportive and protective person you could ever hope to meet. She would do anything for those she loved, and whenever Hannah was in a room, she couldn't help but make it better, making everyone there smile and laugh. She had the strength of a lion and was guaranteed to greet everyone with her signature smile and contagious giggle. Her beauty clients loved and respected her hugely, treasuring their sessions with her, and she them. She loved hard and had found her soulmate in Alex - their life and future together was written in the stars. And she too adored her family more than anything. Louise 'loved passionately and fiercely, but not freely' Louise was the most gentle, kind, caring, beautiful, sweet and hard-working person there is. But more than that, she had an immensely strong, sassy side to her. In the midst of her bucketfuls of compassion and empathy, she was a values-driven woman, who loved passionately and fiercely, but not freely, and not just to anyone. She adored animals, mostly dogs, which is why her business had become so hugely successful - though it wasn't just a business for Louise, but a passion. But she was so much more than that, of the many things she adored, Louise loved to treat herself to the very best things in life, having worked hard for the privilege of doing so. As her family, we were besotted with her and she us. She had the closest group of friends who adored her - and she them. They always had the most fun together, laughing endlessly and simply being silly with each other. 'My mum and sisters were my very best friends' My mum and sisters were my very best friends and the impact of their loss is something I cannot put into words. There is nothing I do not notice their absence in. It's something I will feel every second of every day, until my own dying day. So, when the stain of Kyle Clifford begins to fade - a man who will be remembered only for his hideousness, evil and cowardice - if he is even remembered at all - the lives and egacy of Carol, Hannah and Louise Hunt will live on forever, because as I mentioned, love is the only thing that means anything in this world. And my mum, Hannah and Louise are shining beacons of exactly that."
    },
    {
        "title": "13-year-old girl charged with murder of woman in Wellingborough",
        "description": "A 13-year-old girl has been charged with murder after a woman's body was found at a house in Wellingborough, Northamptonshire.",
        "url": "https://news.sky.com/story/13-year-old-girl-charged-with-murder-of-woman-in-wellingborough-13326421",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wellingborough-murder_6853524.png?20250311210902",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-11 15:56:00",
        "Headline": "The child, who cannot be named for legal reasons, is also charged with arson with an attempt to endanger life.",
        "Content": "A 13-year-old girl has been charged with murder after a woman's body was found at a house in Wellingborough, Northamptonshire. The child, who cannot be named for legal reasons, is also charged with arson with an attempt to endanger life. Formal identification has yet to be confirmed, but the woman who died is believed to be 43-year-old mother-of-three Marta Bednarczyk, Northamptonshire Police said. A forensic post-mortem investigation gave the preliminary cause of death as being a result of sharp force injury. Police and firefighters had attended the address in Newcomen Road after reports came in of a fire at the property. Inside, officers found Ms Bednarczyk's body and paramedics declared her dead at the scene shortly after 3am on Monday. Police are asking people to avoid the immediate area. The 13-year-old girl is due to appear at Northampton Magistrates' Court at 10am on Wednesday. Detective Chief Inspector Johnny Campbell said: \"This evening we have formally charged a 13-year-old Wellingborough girl with murder, and arson, and she will appear before Northampton Magistrates Court at 10am tomorrow. \"I want to take a moment to thank the many police officers and staff who are working and continue to work tirelessly on this investigation since the very tragic events of early yesterday morning. \"And, in particular, all our thoughts are with Marta's family who have been fully co-operative throughout what has been a devastating couple of days for them.\""
    },
    {
        "title": "Four more people arrested in connection with fatal Talbot Green shooting",
        "description": "Four more people have been arrested in connection with the fatal shooting in Talbot Green on Sunday.",
        "url": "https://news.sky.com/story/four-more-people-arrested-in-connection-with-fatal-talbot-green-shooting-13326222",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wales-rhondda-cynon-taf_6853325.jpg?20250311175428",
        "type": "UK",
        "Author": "Tomos Evans",
        "Date Published": "2025-03-11 09:26:00",
        "Headline": "A 42-year-old local man who was previously arrested in connection with the investigation remains in police custody.",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n Four more people have been arrested in connection with the fatal shooting in Talbot Green on Sunday. Joanne Penney, 40, was found with serious injuries in the Talbot Green area in Rhondda Cynon Taf on Sunday. South Wales Police said it was called to the scene at 6.10pm on Sunday evening after reports of a shooting in Llys Illtyd. Ms Penney was pronounced dead at the scene, despite the efforts of emergency services. Her family have been informed and her next of kin are being supported by specialist officers. A 42-year-old man who was arrested on Sunday remains in police custody. In an update on Tuesday, police said four more people have been arrested in the Leicestershire Police force area in connection to the incident. A 21-year-old woman from Oadby, Leicestershire; a 27-year-old man from Oadby, Leicestershire; a 68-year-old man from Braunstone Town, Leicestershire, and a 39-year-old woman from Leicester are currently in custody and will be questioned. Police enquiries have confirmed two vehicles travelled from the Leicester area to South Wales sometime after 10.30am on Sunday and left shortly after the incident. Officers are now appealing to the public for any sightings of the vehicles, namely a beige Nissan Note and a black Volvo XC40. Both vehicles were seized on Monday night and will undergo forensic examinations. The investigating team are particularly keen for any dashcam or CCTV footage from Llys Illtyd and the nearby retail park between 5.30pm and 6.30pm on Sunday 9 March, which may have captured these vehicles. 'Working hard to establish a motive' Speaking at the scene in Llys Illtyd, Detective Chief Superintendent Ceri Hughes said officers were \"working hard to establish a motive\" for Ms Penney's death. She said one possibility under consideration as part of the investigation was that Ms Penney was the victim of mistaken identity. \"Whilst these arrests are a significant development, the investigation into Joanne's death is continuing and we have teams of experienced detectives and specialist staff working hard to establish the circumstances of this tragic incident,\" she added. \"I would urge anyone who has information, either about Joanne's death, or what happened at the property at Llys Illtyd on Sunday evening to do the right thing and please come forward. The smallest piece of information could be of vital importance.\" Read more from Sky News:Man arrested over North Sea crashManchester United unveil plans for new stadium Chief Superintendent Steven Jones thanked the local community for its \"support\". \"I understand how concerning this will be for local residents,\" he added. \"Increased patrols will be taking place, not only as part of the investigation into Joanne's death, but to provide wider community reassurance.\""
    },
    {
        "title": "'Shattering blow' to farmers over pause to environmental payment scheme",
        "description": "A \"shattering blow\" has been dealt to farmers with the sudden pausing for new applications for environmental payments, according to the National Farmers' Union.",
        "url": "https://news.sky.com/story/shattering-blow-to-farmers-over-pause-to-environmental-payment-scheme-13326652",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-farm-protest-farmers_6853575.png?20250311221311",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2025-03-11 21:14:00",
        "Headline": "The agricultural community has reacted with anger over changes to the Sustainable Farming Incentive - with a union claiming it was only given half an hour's warning.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n A \"shattering blow\" has been dealt to farmers with the sudden pausing for new applications for environmental payments, according to the National Farmers' Union. The NFU says it was given just 30 minutes notice by the government that applications for the Sustainable Farming Incentive (SFI) were to close on Tuesday. The post-Brexit scheme, launched in 2022, pays farmers and land managers to take up practices that improve productivity and protect the environment and climate. Politics latest: UK set to be hit by Trump's steel tariffs There were more than 100 options for farmers to choose from, including the management of hedgerows, organic farming development and providing habitat for wildlife. The government says the budget for SFI has now been reached, adding that a \"record\" 50,000 farm businesses and more than half of all farmed land is now managed under the schemes. Both Conservatives and Liberal Democrat politicians have criticised the move and the lack of any prior warning. \n                  Labour MP goes public to oppose family farms tax - and more could follow\n                 \n                  Farmers react with 'fury' and 'anger' after Treasury meeting over inheritance tax\n                 \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 But NFU president Tom Bradshaw said the decision showed \"how little\" the Department for Environment, Food And Rural Affairs (Defra) understood the industry.  'Growing disregard for agriculture within Defra' \"This is another shattering blow to English farms, delivered yet again with no warning, no understanding of the industry and a complete lack of compassion or care,\" Mr Bradshaw said. \"Today's terrible news was delivered with only 30 minutes warning to us before ministers briefed the press, leaving us unable to inform our members. \"There has been no consultation, no communication; there has been a total lack of the 'partnership and co-design' Defra loves to talk about. It is another example of the growing disregard for agriculture within the department.\" The government has said \"every penny\" in all existing SFI agreements will be paid to farmers, and outstanding eligible applications that have been submitted will also be taken forward. It said details of a new SFI scheme will be announced following the Spending Review. Read more:What's the beef with farmers' inheritance tax?Reed apologises to farmers for tax 'shock' West of England and Wales correspondent It was only last week that thousands of farmers were protesting outside Downing Street at the inheritance tax policy that's angered so many in agriculture. But one group representing farmers said on Tuesday the SFI decision is the \"cruellest betrayal so far\".\n The scheme was introduced under the Conservatives post-Brexit, to encourage sustainable farming. It took years to develop - and was seen as world leading in a way of ensuring farming was both productive for the sector and protective of the environment. Although a new scheme after the spending review is promised, many farmers will be left wondering whether it'll be as comprehensive. The National Farmers' Union was preparing on Wednesday to release a report saying that farming confidence in England and Wales is at its lowest level ever. It's described Tuesday's news as a \"bleak irony\". In a statement, minister for food security and rural affairs Daniel Zeichner said: \"This government is proud to have set the biggest budget for sustainable food produce in history, to boost growth in rural communities and all across the UK, under our plan for change. \"More farmers are now in schemes and more money is being spent through them than ever before. That is true today and will remain true tomorrow.  \"We have now successfully allocated the SFI24 budget as promised.\" 👉 Listen to Sky News Daily on your podcast app 👈 The government claims the last administration left the scheme uncapped - and they had to put a limit on to stop it running over budget. 'Absolutely bonkers' Olly Harrison, an arable farmer on Merseyside who organised the latest farming protest in London earlier this month, said the decision showed farmers were being \"attacked from every single angle\". \"It's just absolutely bonkers. The scheme worked. It was to replace what we had when we were in Europe [the EU] and a lot of farms embraced it, they were doing real good with it.\" \"Why have we got people who don't understand and don't understand the environment in power?\" Edward Morello, the Liberal Democrat MP for West Dorset, told Sky News the decision will \"alarm farmers across the UK\" - and called for the government to \"start listening and responding\" to the agricultural community. Tim Farron, the MP for Westmorland and Lonsdale, said the decision was made with \"no warning\". Conservative shadow farming minister Robbie Moore said the change was \"absolutely scandalous\"."
    },
    {
        "title": "Rupert Lowe 'keeping options open' after ousting by Reform UK",
        "description": "Ousted Reform UK MP Rupert Lowe has told Sky News he has not ruled out joining the Conservatives or a new political party, declaring: \"I'm keeping my options open.\"",
        "url": "https://news.sky.com/story/rupert-lowe-keeping-options-open-after-ousting-by-reform-uk-13326594",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-mp-reform-uk_6850693.jpg?20250308193230",
        "type": "UK",
        "Author": "Jon Craig",
        "Date Published": "2025-03-11 20:11:00",
        "Headline": "The Metropolitan Police have opened an investigation into the suspended Reform MP over claims he threatened the party chairman.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Ousted Reform UK MP Rupert Lowe has told Sky News he has not ruled out joining the Conservatives or a new political party, declaring: \"I'm keeping my options open.\" Mr Lowe answered a series of questions from Sky News after the latest twist in his feud with Nigel Farage, with a police investigation launched into claims he threatened party chairman Zia Yusuf. The Metropolitan Police announced it had launched an investigation \"into an allegation of a series of verbal threats made by a 67-year-old man\" between December 2024 and February 2025. Politics latest: UK set to be hit by Trump's steel tariffs Responding to the police statement, Mr Lowe said he had instructed lawyers, who had made contact with the Met and made them aware of his willingness to co-operate in any necessary investigation. \"My lawyers have not yet received any contact from the police,\" he said. \"It is highly unusual for the police to disclose anything to the media at this stage of an investigation. \n                  Richard Tice says Reform UK made 'right judgement' to suspend MP over allegations of bullying\n                 \n                  Nigel Farage and Rupert Lowe escalate feud with new war of words\n                 \n                  Suspended Reform UK MP Rupert Lowe, who allegedly threatened violence, invites Nigel Farage to dinner\n                 \"I remain unaware of the specific allegations, but in any event, I deny any wrongdoing. The allegations are entirely untrue.\"  Could Lowe join Tories? Later, Sky News asked the Great Yarmouth MP if he thought there was a way back into Reform UK for him or was this the end - and if he might join the Tories or a new political party. \"This has all happened over a few days,\" Mr Lowe replied. \"I have been focused on debunking these false and damaging allegations. Who knows what will happen? I'm keeping my options open.\" In an interview on Monday, Mr Lowe said: \"I was a Tory years ago. I think the Tories have got a lot of work to do. I think there's some extremely good Tory MPs. I get on with a lot of them.\" For the Conservatives, the shadow home secretary Chris Philp said: \"He hasn't applied but obviously we're a broad and welcoming political party.\" He told Times Radio: \"People have been joining the Conservatives from across the political spectrum and we always welcome new joiners.\" Read more:Reform reports Rupert Lowe to policeThe Reform row: What has happened and what has been said? New splinter group? And in a move seen as a hint of a new splinter group, another ousted Reform UK politician, former deputy leader Ben Habib, told The Daily Telegraph that Mr Lowe was a \"good friend\" and he was \"constantly in touch with\" him. Sky News also asked Mr Lowe who he blamed for the party's treatment of him, including throwing him out of the party after he criticised Mr Farage. Was Mr Farage or Mr Yusuf to blame? \"Honestly, all of them,\" he said. \"This was a team effort to blacken my name. If it wasn't for my presence on X, I would have been buried under the false allegations. For that, I have to thank Elon Musk.\" He was asked about Mr Farage quoting Labour minister Mike Kane claiming after a heated Commons clash with Mr Lowe in December: \"The anger displayed towards me clearly showed a man not in charge of his own faculties.\" In a Sunday Telegraph article, Mr Farage added: \"I never saw anything like it in the European Parliament in 2019 when I was the leader of the Brexit Party and Mr Lowe was an MEP colleague.\" In response, Mr Lowe told Sky News: \"Reform sources have been briefing that I have dementia. This is the single most appalling thing I have ever seen in politics. \"Anyone who has known someone who has suffered so hideously from dementia will understand just how offensive it is. It shows the type of people we are dealing with.\" In the same article, Mr Farage claimed there had been \"too many similar outbursts from Mr Lowe, often involving the use of inappropriate language to the despair of our chief whip, Lee Anderson\". Mr Lowe hit back, telling Sky News: \"More baseless nonsense, spouted out to tarnish my reputation. Their malicious witch-hunt has fallen apart.\" Last year, when Mr Anderson was Conservative Party deputy chairman, he apologised after parliament's watchdog on bullying and harassment found he told a security guard to \"f*** off, everyone opens the door to me\". He was found to have twice sworn at the security officer and acted in a way that \"constituted bullying and also harassment\" in breach of parliament's behaviour policy, an independent expert panel concluded."
    },
    {
        "title": "All 404 Labour MPs summoned to Downing Street to discuss benefit cuts",
        "description": "All 404 Labour MPs have been called to Downing Street to attend a \"welfare roundtable\" to discuss expected major benefit cuts.",
        "url": "https://news.sky.com/story/all-404-labour-mps-summoned-to-downing-street-to-discuss-benefit-cuts-13326706",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-police-cobra_6647833.jpg?20250311220838",
        "type": "UK",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-11 21:53:00",
        "Headline": "Many backbenchers are uneasy with radical reforms set to be made to the welfare system later this month.",
        "Content": "\n          Political reporter\n              @alixculbertson\n All 404 Labour MPs have been called to Downing Street to attend a \"welfare roundtable\" to discuss expected major benefit cuts. Number 10's policy unit is hosting the discussions on Wednesday and Thursday about the \"future of the welfare system\". The prime minister's team is hoping to win over MPs concerned about sweeping reforms to the benefits system. Politics latest: UK braces for Trump's steel tariffs Sky News has seen the slots being offered to Labour's 404 MPs, which involves three 45-minute sessions on Wednesday and three on Thursday. Inviting all Labour MPs to Downing Street briefings is an unusual move, however, Number 10 said it is \"entirely routine for MPs to come in for briefings\". Several billion pounds in spending cuts, including from the welfare budget, are expected in the spring statement on 26 March, worrying some Labour backbenchers who are concerned about the impact on some of the most vulnerable members of society. \n                  Welfare cut plans are nothing new - but government will have to fight its own backbenchers\n                 \n                  Minister Pat McFadden says welfare cuts are 'coming soon'\n                 \n                  Angela Rayner 'won't speculate' over possible changes to two-child benefit cap\n                 For some, the arguments sound very much like those made by the previous Conservative governments as they attempted to crack down on welfare spending. Sir Keir Starmer told Labour MPs on Monday night that the current welfare bill was \"unsustainable, it's indefensible and it is unfair\". \"It runs contrary to those deep British values that if you can work, you should. And if you want to work, the government should support you, not stop you,\" he added. Read more:What welfare cuts could be announced?Minister says welfare cuts are 'coming soon'  MPs deeply nervous Many Labour MPs are deeply nervous following the backlash to cuts on pensioners' winter fuel allowance by the government, announced by Chancellor Rachel Reeves less than a month after winning the election last July. Her self-imposed borrowing limits have been eaten into by months of economic downturn and geopolitical events since the October budget, with the Treasury understood to believe she must maintain £9.9bn of headroom. The Treasury is putting forward the proposed cuts to the Office for Budget Responsibility (OBR) on Wednesday ahead of the forecaster's financial prediction on the day of Ms Reeves' spring statement.  Ministers have been priming MPs and the public for welfare cuts since January, when the chancellor promised to deliver \"fundamental reform\" of the welfare system, which \"includes looking at areas that have been ducked for too long, like the rising cost of health and disability benefits\". In an interview with Sky News' political editor Beth Rigby last week on the Electoral Dysfunction podcast the chancellor argued: \"We've got to reform our welfare system, because at the moment it's letting down taxpayers because it's costing too much, letting down our economy because there's too many people trapped on out of work benefits. \"And it's letting down the people who are recipients of benefits because they are trapped on benefits rather than actively supported back into work.\" And on Sunday, Cabinet Office minister Pat McFadden told Sunday Morning With Trevor Phillips \"we cannot sit back and let this bill grow and write people off in the way that's happened for many years\", promising reforms are coming \"soon\"."
    },
    {
        "title": "Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine",
        "description": "Volodymyr Zelenskyy is ready to accept a ceasefire deal - as the US says it has immediately resumed intelligence sharing and military aid with Ukraine.",
        "url": "https://news.sky.com/story/zelenskyy-accepts-ceasefire-proposal-as-us-to-resume-intelligence-sharing-and-military-aid-with-ukraine-13326496",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zaporizhzhia-ukraine_6851856.jpg?20250310094109",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-11 18:19:00",
        "Headline": "In a post on Telegram after US and Ukrainian officials met in Saudi Arabia, Volodymyr Zelenskyy said Ukraine \"accepts\" the American proposal of a full 30-day ceasefire with Russia.",
        "Content": " Volodymyr Zelenskyy is ready to accept a ceasefire deal - as the US says it has immediately resumed intelligence sharing and military aid with Ukraine. In a post on Telegram after US and Ukrainian officials met in Saudi Arabia, Mr Zelenskyy said \"the American side understands our arguments\" and \"accepts our proposals\" - and that Kyiv \"accepts\" the US proposal of a full 30-day ceasefire with Russia. Ukraine war latest: Ball now in Russia's court, US says \"I want to thank President Trump for the constructiveness of the conversation between our teams,\" he said. \"Today, in the conversation, the American side proposed to take the first step immediately and try to establish a full ceasefire for 30 days, not only concerning rockets, drones, and bombs, not only in the Black Sea, but also along the entire front line. \"Ukraine accepts this proposal, we consider it positive, and we are ready to take this step.\"  'Ukraine is ready for peace' The Ukrainian president then said the US \"must convince Russia to do this\" and that \"if the Russians agree - that's when the silence will work\". He added: \"An important element of today's conversation is America's readiness to restore defensive assistance to Ukraine, as well as intelligence support. \"Ukraine is ready for peace. Russia must show whether it is ready to stop the war or continue it. \"The time has come for the full truth. I thank everyone who helps Ukraine.\" Meanwhile, in a joint statement with Kyiv following nine-hour-long talks in Jeddah, the US State Department said it will immediately lift the pause on intelligence-sharing and military aid. A Ukrainian source told Sky News earlier this month that the US had stopped sharing all intelligence with Kyiv.  'Ball is now in Russia's court' Marco Rubio, US secretary of state, also told reporters that \"the ball is now in Russia's court\" after meeting with the Ukrainian delegation. After the positive talks, Mr Rubio said \"we're going to take the offer\" to Russia, adding: \"We're going to tell them this is what's on the table, Ukraine is ready to stop shooting and start talking, and now it'll be up to them to say yes or no. \"I hope they're going to say yes, and if they do then I think we made great progress.\" He then said that while no deadline has been set, he hopes a deal can be reached \"as soon as possible\" and that \"this is serious stuff, this is not Mean Girls, this is not some episode of some television show\". \"The number one goodwill gesture we could see from the Russians is to see the Ukrainian offer and reciprocate it with a yes,\" Mr Rubio added. National security adviser Mike Waltz also added it is \"very clear\" that Kyiv shares Donald Trump's vision for peace and that \"they share his determination to end the fighting\". Read more from Sky News:Trump escalates Canada trade war by doubling tariffsUkraine's drone attack on Russia sent a message Over in the US, Mr Trump said that officials will meet with Russia either today or tomorrow and confirmed he would invite Mr Zelenskyy back to the White House. \"We want to get the Ukraine war over with,\" the US president said, before saying he hopes to have a total ceasefire in the coming days. He also told reporters he thinks he will talk to Russian President Vladimir Putin this week - but warned \"it takes two to tango\". Last month, Mr Trump accused Mr Zelenskyy of \"gambling with World War Three\" in an Oval Office meeting. US vice president JD Vance told the Ukrainian president \"you should be thanking\" Mr Trump \"for trying to bring an end to this conflict,\" sparking a tense 10-minute back-and-forth.  A press conference with the two leaders and the signing of an agreement was then cancelled."
    },
    {
        "title": "What's in the US-proposed Russia and Ukraine ceasefire deal?",
        "description": "Volodymyr Zelenskyy has said he is ready to agree to a ceasefire with Russia after successful talks with the US today.",
        "url": "https://news.sky.com/story/whats-in-the-us-proposed-russia-and-ukraine-ceasefire-deal-13326575",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6842484.jpg?20250228170830",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-11 19:53:00",
        "Headline": "US and Ukrainian officials met in Saudi Arabia to discuss ending the war with Russia. After nine hours of talks, Volodymyr Zelenskyy said his country is ready to support a 30-day ceasefire. But what is the US proposing?",
        "Content": " Volodymyr Zelenskyy has said he is ready to agree to a ceasefire with Russia after successful talks with the US today. The Ukrainian president said on Telegram that \"we are ready to take this step\" and said the US \"must convince Russia to do this\". Ukraine war latest: Trump warns Putin 'it takes two to tango' Following a meeting with Kyiv officials in Saudi Arabia, US secretary of state Marco Rubio told reporters \"the ball is now in Russia's court\" and the next step is for Moscow to agree to terms. US President Donald Trump said \"we want to get the Ukraine war over with\" and hopes to have a total ceasefire in the coming days. But what has been agreed by the US and Ukraine? Here's what we know so far...  Straight after the nine-hour talks in Jeddah, the US State Department said Washington would immediately lift the pause on intelligence sharing and military aid to Ukraine. \n                  'Calling Moscow's bluff': Sky News correspondents' views as Ukraine accepts ceasefire deal\n                 \n                  Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine\n                 \n                  Ukraine's drone attack on Russia sent a message - and not just to the Kremlin\n                 Mr Zelenskyy confirmed in his post that an \"important element of today's conversation is America's readiness to restore defensive assistance to Ukraine, as well as intelligence support\".  As part of their plan, the US said both sides should agree to an immediate 30-day ceasefire which could then be mutually extended. A joint statement from the US and Ukraine added that Washington \"will communicate to Russia that Russian reciprocity is the key to achieving peace\". The Ukrainian president added that the proposal was \"not only concerning rockets, drones, and bombs, not only in the Black Sea, but also along the entire front line\" - although the official statement does not mention this. The statement also makes no mention of territory - despite Ukraine previously calling for Russia to return occupied lands, and the US saying Kyiv might have to concede territory - or the foreign deployment of soldiers in Ukraine for peacekeeping. The joint statement does say officials discussed aid efforts as part of the peace process, including \"the exchange of prisoners of war, the release of civilian detainees, and the return of forcibly transferred Ukrainian children\". Ukraine also reiterated that European partners would be involved in the peace process, and both countries agreed a deal on Kyiv's minerals and rare earths should \"conclude as soon as possible\". Read more:What minerals does Ukraine have - and why does Trump want them?  What has Ukraine said? Mr Zelenskyy said Ukraine agrees to the terms, adding that \"the American side understands our arguments\" and \"accepts our proposals\". He then said he wanted \"to thank President Trump for the constructiveness of the conversation between our teams,\" before adding: \"Ukraine is ready for peace. \"Russia must show whether it is ready to stop the war or continue it. The time has come for the full truth.\" Ukraine's foreign minister Andrii Sybiha - who was in Jeddah for the talks - called the meeting a step forward \"both on the path to peace and in developing the strategic Ukraine-US partnership\" on social media. And speaking to Sky News' Mark Austin, Ukrainian MP Lesia Vasylenko added that \"we will have to wait and see what comes of it\" but that \"clearly it's good news\". \"On first glance it's amazing,\" she said. \"If we can get the Russians to agree to a ceasefire for 30 days, then our soldiers on the frontline will have a break...\" However, she said: \"In previous years [Russia has] shown an absolute inability to understand what a ceasefire is and to stick to the basic rules of a ceasefire - which means not firing any weapons.\" Read more:Ukraine's drone attack on Russia sent a messageMusk blames 'IP addresses in Ukraine' after X 'cyber attack' What has the US said? Mr Rubio said the next step is \"going to take the offer\" to Russia, adding: \"We're going to tell them this is what's on the table, Ukraine is ready to stop shooting and start talking, and now it'll be up to them to say yes or no. \"I hope they're going to say yes, and if they do then I think we made great progress.\" Mr Trump echoed this outside the White House, saying Ukraine has agreed to the \"total ceasefire\" and that \"hopefully Russia will agree to it\".  He added that he will speak to Vladimir Putin in the coming days, warning the Russian president that \"it takes two to tango\". How has Russia reacted? So far, there's been no official reaction to the proposal other than to acknowledge Mr Trump's comments about talks within the next week. But ahead of the breakthrough talks in Jeddah, Russian foreign minister Sergei Lavrov said Mr Zelenskyy does not want peace. According to state news agency TASS, Mr Lavrov added: \"Mr Zelenskyy publicly declares that he does not want any ceasefire unless the Americans provide him with assurances that they will launch a nuclear strike on Russia if necessary. \"He frames the issue in much the same manner. For now, [a peace talk] is not serious.\" Read more from Sky News:President Trump is forcing Greenlanders to confront their futureCanada vows 'firm' response if Trump goes ahead with tariffs Mr Zelenskyy has not called for the US to strike Russia with nuclear weapons, but did say last month that Ukraine should be given them if talks on joining NATO are protracted for years."
    },
    {
        "title": "'Calling Moscow's bluff': Sky News correspondents' views as Ukraine accepts ceasefire deal",
        "description": "As Ukraine says it has accepted a proposal for a 30-day ceasefire, US secretary of state Marco Rubio says \"the ball is now in Russia's court\".",
        "url": "https://news.sky.com/story/calling-moscows-bluff-sky-news-correspondents-views-as-ukraine-accepts-ceasefire-deal-13326597",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zelenskyy-saudi-arabia_6852338.jpg?20250310172943",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-11 20:13:00",
        "Headline": "Ukrainian President Volodymyr Zelenskyy said he accepted a 30-day ceasefire agreement brokered by the US following talks in Saudi Arabia - but will Russia accept it?",
        "Content": " As Ukraine says it has accepted a proposal for a 30-day ceasefire, US secretary of state Marco Rubio says \"the ball is now in Russia's court\". Ukrainian President Volodymyr Zelenskyy said he accepted the proposal as his country, which has been fending off Russia's full-scale invasion for the past three years, was \"ready for peace\". Here is what Sky News correspondents think of the latest developments in the ongoing efforts to end the hostilities. Follow the latest: Trump warns Putin 'it takes two to tango'  Ivor Bennett, Moscow correspondent Will Russia accept a ceasefire? Hard to say. Because throughout the past few weeks and months, Moscow has always said it doesn't want a temporary truce. \n                  What's in the US-proposed Russia and Ukraine ceasefire deal?\n                 \n                  Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine\n                 \n                  Ukraine's drone attack on Russia sent a message - and not just to the Kremlin\n                 Instead, it's called for a long-term peace deal that tackles what it sees as the \"root causes\" of the conflict. In Moscow's mind, \"root causes\" means Western aggression and NATO's historical eastward expansion. By making that a consistent criterion for peace, Russia has been trying to ensure that its own security concerns are met in the event of a final deal being signed. I think it's also a way of legitimising its full-scale invasion, which Russia claims was done to protect Russian speakers in eastern Ukraine as a result of the Minsk agreements not being upheld. Read more:US to resume intelligence sharing and military aid with UkraineUkraine's drone attack on Russia sent a message  The Minsk agreements were ceasefire deals signed between Kyiv and Russian-backed separatists in the Donbas in 2014 and 2015. Moscow's reasoning is that Kyiv can't be trusted to stick to a truce. But this is largely posturing by the Kremlin, to reinforce its own narrative around the conflict - that it is the victim, fighting a defensive war. A more compelling reason as to why Russia favours a permanent deal over a temporary one is because Ukrainian forces are on the back foot. A pause in the fighting would give them time to regroup, so why would Moscow agree? It wants to have Kyiv begging for mercy when it comes to the negotiating table, so that a permanent deal would be entirely in Russia's favour. The problem for Vladimir Putin, though, is that he now has to put his money where his mouth is.  In order to win Donald Trump's favour, the Kremlin has been relentless in trying to cast itself as the peacemaker and Ukraine as the warmonger. It's worked up until this point, with America increasingly siding with Russia. But now, all of a sudden, Kyiv is calling Moscow's bluff. James Matthews, US correspondent, in Washington DC It looks like progress and it sounds like progress. How much it is actual progress will be a matter for the Russians. Moscow will decide if this step forward amounts to two steps back. The Americans and Ukrainians did the easy bit in Saudi Arabia. This was a diplomatic healing between both parties, a reset on relations that restores a military alliance. Clearly, Ukraine will welcome the US lifting its pause on intelligence sharing and weapons supply. It will strengthen the ties between Washington and Kyiv, even if trust remains undermined. There is deep suspicion in Kyiv surrounding the motivations of President Trump and his relationship with Mr Putin. Ukrainian president Zelenskyy called the ceasefire proposal a positive step - he's content as far as it goes, even if he'll have questions around the context. Ukraine was second behind Russia on the guest list for talks with the Americans and, while Mr Trump has courted Mr Putin, he's cold-shouldered Mr Zelenskyy. Discussions between Mr Trump and Mr Putin will surely have given the US president a guide on how the Russians will respond to offers made. Would Mr Trump have proposed a ceasefire without an assurance that Mr Putin would accept? Unlikely, given everything Moscow has to gain. The future floated for Ukraine by the Trump administration doesn't include NATO membership, doesn't reflect a desire to roll back Russian territorial gains and doesn't rule out lifting sanctions against Moscow. For Ukraine, there are difficult questions about what comes after the guns go silent. A ceasefire in the current conditions isn't the starting point that Mr Zelenskyy would have chosen but, realistically, it's the only starting point he's got. Alex Rossi, international correspondent, in Jeddah, Saudi Arabia It was a long day of negotiations but at the end it appeared that the Ukrainian and American delegations had found common ground. When they entered the talks they looked focused - there is a lot riding on the talks. When they emerged after sundown it was clear that they had achieved something - small steps on what will be a long and difficult road to achieve any sort of peace. The initial agreement saw progress on a readiness by the Ukrainians to accept an immediate interim 30-day ceasefire in theory. Whilst there are still many outstanding issues, there is now movement to end a war that has been grinding on for more than three years. For the Ukrainians, they wanted and needed to mend the relationship with the US after that now infamous diplomatic spat in the Oval Office.  They were seeking a restoration of military aid and intelligence sharing. The US has now announced it will immediately restart its assistance. What the Americans wanted to see was a Ukraine that was prepared to be flexible and make difficult decisions to reach a peace agreement. The Ukrainians were clearly persuasive on that count and the US delegation sounded convinced. But the war cannot stop without Russian agreement and whether Moscow bites and also agrees to an interim ceasefire is far from clear. They have given mixed signals. On the one hand, officials have said the Kremlin's war objectives remain the same and there will be no concessions but they have also said they are waiting to hear the details of the talks. Clearly the ball is now in Moscow's court. Mr Trump's envoy Steve Witkoff is heading to Moscow later in the week. It's reported he will discuss the diplomatic proposals with Mr Putin. But getting a lasting and sustainable peace will not be easy - Russia's leader is unlikely to accept anything that does not allow him to present his \"special military operation\" as anything other than a total victory. And until an agreement is reached, the violence and the killing will continue."
    },
    {
        "title": "Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium",
        "description": "Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%.",
        "url": "https://news.sky.com/story/donald-trump-climbs-down-from-threat-to-escalate-trade-war-with-canada-by-doubling-tariffs-on-steel-and-aluminium-13326385",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6853609.jpg?20250311220856",
        "type": "World",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-11 14:54:00",
        "Headline": "In response to the US president's measures, Canada's incoming prime minister Mark Carney said he will keep tariffs in place until Americans \"show respect\" and commit to free trade.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%. The US president stepped back from his order after the provincial government of Ontario rowed back on a plan to charge 25% more for electricity it supplies to over 1.5 million American homes and businesses. Canada's most populous province provides electricity to Minnesota, New York and Michigan. As a result, White House trade adviser Peter Navarro said Mr Trump would not double steel and aluminium tariffs - but the federal government still plans to place a 25% tariff on all steel and aluminium imports from Wednesday. Ontario's response In his initial response to Mr Trump's threat, Ontario's premier Doug Ford said he would not back down until the US leader's tariffs on Canadian imports were \"gone for good\". But he later suspended the change temporarily, saying \"cooler heads need to prevail\" and he was confident the US president would also stand down on his plans. Meanwhile, Canada's incoming prime minister Mark Carney said he will keep other tariffs in place until Americans \"show respect\" and commit to free trade. Mr Carney called the new tariffs threatened by Mr Trump an \"attack\" on Canadian workers, families and businesses. Read more:Analysis: Uncertainty index spikes amid on/off confusion over Trump tariffs  Why is Trump threatening tariffs? A worldwide 25% tariff on steel and aluminium is due to come into effect on Wednesday as a way to kickstart US domestic production. Separate tariffs on goods from Mexico and Canada covered by a previous trade agreement (the US Mexico Canada, or USMCA deal) were delayed by a month to 2 April. President Trump seems to bear a particular grudge against Canada because of what he sees as rampant fentanyl smuggling and high Canadian taxes on dairy imports, which penalise US farmers. He has called for Canada to become part of the United States as its \"cherished 51st state\" as a solution, which has angered Canadian leaders.  Economic impact Mr Trump's turnaround comes after markets fell in response to his threat of doubling tariffs. The stock market has fallen over the last two weeks and Harvard University economist Larry Summers put the odds of a recession at 50-50. \"All the emphasis on tariffs and all the ambiguity and uncertainty has both chilled demand and caused prices to go up,\" the former treasury secretary for the Clinton administration posted on X on Monday. \"We are getting the worst of both worlds - concerns about inflation and an economic downturn and more uncertainty about the future and that slows everything.\" Investment bank Goldman Sachs revised down its growth forecast for this year from 2.2% to 1.7% and moderately increased its recession probability to 20% \"because the White House has the option to pull back policy changes if downside risks begin to look more serious\". Mr Trump has tried to reassure the American public that his tariffs will cause a bit of a \"transition\" to the economy as taxes spur more companies to begin the years-long process of relocating factories to the US to avoid tariffs. 👉 Follow Trump 100 on your podcast app 👈 Trump refuses to rule out recession Mr Trump did not rule out the possibility of a recession during an interview with Fox News on Sunday, where he said: \"I hate to predict things like that.\" On Tuesday, he was asked about a potential recession and said \"I don't see it at all\" and claimed the US is \"going to boom\". On Monday, the S&P 500 stock index fell 2.7% and on Tuesday it was around 10% below its record set last month."
    },
    {
        "title": "The furious rise of climate whiplash",
        "description": "A phenomenon that made the recent California wildfires so damaging is spreading further afield.",
        "url": "https://news.sky.com/story/the-furious-rise-of-climate-whiplash-13326408",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-climate-whiplash-graphic_6853234.jpg?20250311160004",
        "type": "World",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-11 15:48:00",
        "Headline": "What happens when the wet weather gets wetter and then the dry weather gets drier? That's what played out in the recent Los Angeles wildfires, and the phenomenon is spreading.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A phenomenon that made the recent California wildfires so damaging is spreading further afield. Climate \"whiplash\" sees dangerous swings between very wet weather and very dry weather. Drought or extreme rain are hard enough to contend with on their own. The problem with whiplash is the severe jerk from one to the other makes them both more damaging. It bore out in Los Angeles when two very wet winters produced lots of grass and shrubs, and were then followed by a long, hot summer that dried out that vegetation, providing abundant, tinder-dry fuel ripe for a wildfire. Without this swing \"there still could have been severe fires, but this was definitely an event that was amplified by that particular sequence\", says Dr Daniel Swain, climate scientist from University of California Los Angeles. Heavy rain will slide off scorched earth more rapidly, leading to landslides and flooding. Keeping reservoirs full should help guard against drought - but sudden, heavy downpours can send them overflowing, flooding the surroundings. \n                  Drivers 'confused' by transition to electric vehicles, ministers warned\n                 \n                  More heat pumps, fewer kebabs - Is this the way to stop climate change?\n                 \n                  Heat pumps, EVs and fewer kebabs: You'll notice the next cut to emissions - but half the work is done\n                 How is whiplash changing? A little bit of this whiplash is natural. But scientists are newly talking about it as climate change is making it worse in locations all around the world. That's because the atmosphere works like a sponge: it can both soak up and release water. The hotter it is, the more water it can soak up - and unleash too. So climate change, by warming the atmosphere, is essentially growing the size of the sponge - exponentially, too. New research by the charity WaterAid has identified at least 17 major cities where climate whiplash is getting worse, out of 112 they analysed (the world's 100 largest plus 12 more where it works). While the recent Los Angeles wildfires may be burned in our memory, there are other places that are much more vulnerable. Partly because they are not fabulously wealthy like the rich and famous of Hollywood, with poorer people and infrastructure, but also because the swings are more extreme. Take Hangzhou in eastern China, for example, which topped the list of cities with intense climate whiplash. The higher and darker the spikes in the chart, the more intense the weather. Or Jakarta, second on the list - just look at how dark, wide and tall those wet and dry periods are on the right-hand side. Impacts in Indonesia's capital have been \"escalating\", with disasters on course to get more frequent and severe, says Egi Suarga, climate manager for World Resources Institute Indonesia. This threatens food security, adds Prof Cedric John from Queen Mary University London, who has been working with Indonesia's Bureau for Meteorology, Climate, and Geophysics (BMKG). \"The uncertainty in the timing and intensity of rainfall, as well as the prolonged drought, can lead to crop failure or poor harvest.\" WaterAid's chief executive Tim Wainwright says: \"It affects people's health. It affects education. It affects people's livelihoods. In extreme cases, it will take people's lives.\" Where could whiplash strike next? Partly what makes whiplash so dangerous is its unpredictability. It's hard to prepare for. But Dr Swain says there are \"early indications\" of a particularly hot and dry start to summer across much of western USA, following relatively wet periods, \"opening the door to a potential wet-to-dry whiplash event\". Whiplash isn't affecting everywhere yet. In fact, in London the extremes may have calmed for now, found WaterAid, which worked with scientists from Cardiff and Bristol Universities to produce these new metrics. And places like Cairo have 'flipped' completely, going from long-term wet to long-term dry. But eventually the whiplash phenomenon may spread everywhere as the air keeps warming due to climate change. \"We do, in fact, expect that almost every populated inhabited continent on Earth will eventually see a substantial increase in that whiplash,\" said Dr Swain. A study by him in January found whiplash has already increased by at least 31% on average across the globe. Are there solutions? The best solution would be to stop emitting greenhouse gases. But this comes at a time when the US looks to up fossil fuel energy and row back on overseas funding for climate projects. The UK has also eaten into its aid budget to pay for increased defence spending. But solutions are often \"very well known and very simple\", says Tim Wainwright. In Karachi, for example, people harvest water from the sky as it cools, and then us it to wash, farm, or refill dried up wells. Wainwright says the solution often \"does not require a huge leap forward in technology. It requires leaps forward in political leadership and investment\"."
    },
    {
        "title": "Palestinian officials say Israel kills eight people in Gaza Strip and five in West Bank",
        "description": "Israel has killed eight people in the Gaza Strip and five more in the West Bank in the past 24 hours, Palestinian officials have said.",
        "url": "https://news.sky.com/story/palestinian-officials-say-israel-kills-eight-people-in-gaza-strip-and-five-in-west-bank-13326367",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hamas-israel-gaza-palestine_6853144.jpg?20250311142805",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-11 14:12:00",
        "Headline": "A fragile ceasefire in Gaza between Israel and Hamas - which started in January - has largely held.",
        "Content": "Israel has killed eight people in the Gaza Strip and five more in the West Bank in the past 24 hours, Palestinian officials have said. It comes as a fragile ceasefire in Gaza between Israel and Hamas - which came into effect on 19 January - largely holds. Four civilians, including two brothers, were killed in an Israeli airstrike in Gaza on Tuesday, according to Palestinian medics and relatives. Gaza ceasefire explained The Israeli military said its air force attacked \"terrorists who were engaged in a suspicious activity on the ground incentral Gaza and posed a threat to the force\". The strike took place near the Netzarim corridor, where Israeli forces carved out a military zone bisecting the territory before withdrawing from the area as part of the ceasefire. Another 14 people were injured over the past 24 hours and rescuers also said to have retrieved 32 bodies from under the rubble. \n                  Israel cuts power to Gaza after Hamas refuses to extend first phase of ceasefire deal\n                 \n                  Lammy and European foreign ministers back Egyptian plan for Gaza rebuild\n                 \n                  Trump envoy Steve Witkoff says Hamas has not been forthright in discussions with US\n                 Ceasefire struggles Initially, the ceasefire plan would have seen the involved parties move from phase one to phase two - which would begin an attempt to permanently end hostilities. However, Israel wanted to extend the first phase - something Hamas rejected. To try and pressure the militant group into doing so, Israel last week suspended supplies of goods and electricity to the more than two million Palestinians living there. Phase one ended on 1 March, and Israel wants Hamas to release half the remaining hostages in return for a promise to negotiate a lasting truce. Hamas, meanwhile, wants to start negotiations on the ceasefire's second phase, which would see the release of the remaining hostages from Gaza, the withdrawal of Israeli forces and a lasting peace agreed. Mediators in Doha and Cairo continued to try and hammer out a breakthrough to resolve the disputes that threaten to plunge the sides back into armed conflict. During the ceasefire, Israeli forces have killed dozens of Palestinians in Gaza who the military said had approached its troops or entered unauthorised areas. Read more from Sky News:Triple killer will serve whole-life orderUkraine peace talks begin in JeddahBritish backpacker being held in US Violence in the West Bank In the West Bank, five Palestinians, including a 60-year-old woman, have been killed by Israeli forces in the city of Jenin over the past 24 hours, the ruling Palestinian Authority said on Tuesday. It takes the number of people killed since Israeli forces launched a major operation in the West Bank at the start of the Gaza ceasefire to more than 30. Troops have swept through refugee camps in Jenin and nearby cities, demolishing houses and infrastructure, including roads and water pipes. Tens of thousands of Palestinians have fled their homes since the beginning of the operation which Israel says is aimed at hitting Iranian-backed militant groups, including Hamas and Islamic Jihad."
    },
    {
        "title": "Former Philippines president Duterte arrested over alleged crimes against humanity during drugs crackdown",
        "description": "The controversial former president of the Philippines, Rodrigo Duterte, has been arrested over claims of crimes against humanity.",
        "url": "https://news.sky.com/story/former-philippines-president-duterte-arrested-over-alleged-crimes-against-humanity-during-drugs-crackdown-13326128",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rodrigo-duterte-philippines_6852740.jpg?20250311044349",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-11 04:29:00",
        "Headline": "Mr Duterte was in defiant mood as he stepped off the plane, telling reporters: \"You would have to kill me first if you are going to ally with white foreigners.\"",
        "Content": " The controversial former president of the Philippines, Rodrigo Duterte, has been arrested over claims of crimes against humanity. The government said he was detained on an International Criminal Court (ICC) warrant when he landed in Manila on Tuesday. The case centres on thousands of killings that took place during his brutal crackdown on illegal drugs from 2011 - when he was a city mayor - to the end of his presidency in 2022. Mr Duterte won power in 2016 on the back of a policy to kill drug dealers and smash crime. It's claimed police or vigilantes working for them, such as gunmen on motorbikes, killed masses of unarmed suspects while he was in charge. Authorities have denied the claims. Mr Duterte said on Monday he was ready to be arrested when he landed back in his home country from Hong Kong. \n                  Former Philippines president Rodrigo Duterte being flown to The Hague after ICC arrest for 'crimes against humanity'\n                 \n                  Philippines village offering bounties for mosquitoes amid dengue fever outbreak\n                 \n                  13 women found guilty for selling babies for cash in Cambodia \n                 His team have already declared the arrest unlawful and vowed to fight it. The 79-year-old admitted to an inquiry last year that he had a \"death squad\" of gangsters who killed at his behest when he was mayor of Davao. However, he denied authorising police to shoot suspects when he became president. Mr Duterte withdrew the Philippines from the ICC's founding treaty, the Rome Statute, when he was leader. Asia correspondent This arrest is a huge blow for Duterte. Human rights groups estimate tens of thousands of Filipinos were summarily executed during his brutal \"War on Drugs\". Only a handful of people have ever been arrested. It could be a key step towards accountability for those who've long sought it for loved ones - many of whom were gunned down by hit men, police and vigilantes.  Campaigners say the majority were poor people, largely from cities, who had nothing to do with the drug trade.  It's unclear if Duterte will be forced to surrender to the ICC in The Hague. But it will certainly be a major test for the court, which has recently also sought the arrest of the head of Myanmar's military and Israel's prime minister. Duterte played up to his role as a strongman as he stepped off the plane, telling reporters: \"You would have to kill me first if you are going to ally with white foreigners.\"  The former leader's team has already declared the arrest unlawful and vowed to fight it. Many feared Duterte's successor was helping him continue life with impunity. The pair did both talk about the ICC threatening the Philippines' sovereignty.  But by late 2023, the government had quietly allowed investigators to enter the Philippines. It appears that was a critical step towards today's development.   Read more from Sky News:Search for missing crew member ended after collisionZelenskyy in Saudi Arabia ahead of US-Ukraine meeting The ex-president's administration also tried to suspend the ICC probe in late 2021, arguing it didn't have jurisdiction and saying domestic authorities were already looking at the claims. Judges in The Hague rejected the objections two years ago and said the investigation could continue. Current president Bongbong Marcos Jr, who took over in 2022, has not re-joined the ICC. However, he said he would cooperate if his predecessor was put under an Interpol \"red notice\" - a request for police anywhere in the world to arrest a suspect."
    },
    {
        "title": "Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium",
        "description": "Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%.",
        "url": "https://news.sky.com/story/donald-trump-climbs-down-from-threat-to-escalate-trade-war-with-canada-by-doubling-tariffs-on-steel-and-aluminium-13326385",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6853609.jpg?20250311220856",
        "type": "US",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-11 14:54:00",
        "Headline": "In response to the US president's measures, Canada's incoming prime minister Mark Carney said he will keep tariffs in place until Americans \"show respect\" and commit to free trade.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%. The US president stepped back from his order after the provincial government of Ontario rowed back on a plan to charge 25% more for electricity it supplies to over 1.5 million American homes and businesses. Canada's most populous province provides electricity to Minnesota, New York and Michigan. As a result, White House trade adviser Peter Navarro said Mr Trump would not double steel and aluminium tariffs - but the federal government still plans to place a 25% tariff on all steel and aluminium imports from Wednesday. Ontario's response In his initial response to Mr Trump's threat, Ontario's premier Doug Ford said he would not back down until the US leader's tariffs on Canadian imports were \"gone for good\". But he later suspended the change temporarily, saying \"cooler heads need to prevail\" and he was confident the US president would also stand down on his plans. Meanwhile, Canada's incoming prime minister Mark Carney said he will keep other tariffs in place until Americans \"show respect\" and commit to free trade. Mr Carney called the new tariffs threatened by Mr Trump an \"attack\" on Canadian workers, families and businesses. Read more:Analysis: Uncertainty index spikes amid on/off confusion over Trump tariffs  Why is Trump threatening tariffs? A worldwide 25% tariff on steel and aluminium is due to come into effect on Wednesday as a way to kickstart US domestic production. Separate tariffs on goods from Mexico and Canada covered by a previous trade agreement (the US Mexico Canada, or USMCA deal) were delayed by a month to 2 April. President Trump seems to bear a particular grudge against Canada because of what he sees as rampant fentanyl smuggling and high Canadian taxes on dairy imports, which penalise US farmers. He has called for Canada to become part of the United States as its \"cherished 51st state\" as a solution, which has angered Canadian leaders.  Economic impact Mr Trump's turnaround comes after markets fell in response to his threat of doubling tariffs. The stock market has fallen over the last two weeks and Harvard University economist Larry Summers put the odds of a recession at 50-50. \"All the emphasis on tariffs and all the ambiguity and uncertainty has both chilled demand and caused prices to go up,\" the former treasury secretary for the Clinton administration posted on X on Monday. \"We are getting the worst of both worlds - concerns about inflation and an economic downturn and more uncertainty about the future and that slows everything.\" Investment bank Goldman Sachs revised down its growth forecast for this year from 2.2% to 1.7% and moderately increased its recession probability to 20% \"because the White House has the option to pull back policy changes if downside risks begin to look more serious\". Mr Trump has tried to reassure the American public that his tariffs will cause a bit of a \"transition\" to the economy as taxes spur more companies to begin the years-long process of relocating factories to the US to avoid tariffs. 👉 Follow Trump 100 on your podcast app 👈 Trump refuses to rule out recession Mr Trump did not rule out the possibility of a recession during an interview with Fox News on Sunday, where he said: \"I hate to predict things like that.\" On Tuesday, he was asked about a potential recession and said \"I don't see it at all\" and claimed the US is \"going to boom\". On Monday, the S&P 500 stock index fell 2.7% and on Tuesday it was around 10% below its record set last month."
    },
    {
        "title": "Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine",
        "description": "Volodymyr Zelenskyy is ready to accept a ceasefire deal - as the US says it has immediately resumed intelligence sharing and military aid with Ukraine.",
        "url": "https://news.sky.com/story/zelenskyy-accepts-ceasefire-proposal-as-us-to-resume-intelligence-sharing-and-military-aid-with-ukraine-13326496",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-zaporizhzhia-ukraine_6851856.jpg?20250310094109",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-11 18:19:00",
        "Headline": "In a post on Telegram after US and Ukrainian officials met in Saudi Arabia, Volodymyr Zelenskyy said Ukraine \"accepts\" the American proposal of a full 30-day ceasefire with Russia.",
        "Content": " Volodymyr Zelenskyy is ready to accept a ceasefire deal - as the US says it has immediately resumed intelligence sharing and military aid with Ukraine. In a post on Telegram after US and Ukrainian officials met in Saudi Arabia, Mr Zelenskyy said \"the American side understands our arguments\" and \"accepts our proposals\" - and that Kyiv \"accepts\" the US proposal of a full 30-day ceasefire with Russia. Ukraine war latest: Ball now in Russia's court, US says \"I want to thank President Trump for the constructiveness of the conversation between our teams,\" he said. \"Today, in the conversation, the American side proposed to take the first step immediately and try to establish a full ceasefire for 30 days, not only concerning rockets, drones, and bombs, not only in the Black Sea, but also along the entire front line. \"Ukraine accepts this proposal, we consider it positive, and we are ready to take this step.\"  'Ukraine is ready for peace' The Ukrainian president then said the US \"must convince Russia to do this\" and that \"if the Russians agree - that's when the silence will work\". He added: \"An important element of today's conversation is America's readiness to restore defensive assistance to Ukraine, as well as intelligence support. \"Ukraine is ready for peace. Russia must show whether it is ready to stop the war or continue it. \"The time has come for the full truth. I thank everyone who helps Ukraine.\" Meanwhile, in a joint statement with Kyiv following nine-hour-long talks in Jeddah, the US State Department said it will immediately lift the pause on intelligence-sharing and military aid. A Ukrainian source told Sky News earlier this month that the US had stopped sharing all intelligence with Kyiv.  'Ball is now in Russia's court' Marco Rubio, US secretary of state, also told reporters that \"the ball is now in Russia's court\" after meeting with the Ukrainian delegation. After the positive talks, Mr Rubio said \"we're going to take the offer\" to Russia, adding: \"We're going to tell them this is what's on the table, Ukraine is ready to stop shooting and start talking, and now it'll be up to them to say yes or no. \"I hope they're going to say yes, and if they do then I think we made great progress.\" He then said that while no deadline has been set, he hopes a deal can be reached \"as soon as possible\" and that \"this is serious stuff, this is not Mean Girls, this is not some episode of some television show\". \"The number one goodwill gesture we could see from the Russians is to see the Ukrainian offer and reciprocate it with a yes,\" Mr Rubio added. National security adviser Mike Waltz also added it is \"very clear\" that Kyiv shares Donald Trump's vision for peace and that \"they share his determination to end the fighting\". Read more from Sky News:Trump escalates Canada trade war by doubling tariffsUkraine's drone attack on Russia sent a message Over in the US, Mr Trump said that officials will meet with Russia either today or tomorrow and confirmed he would invite Mr Zelenskyy back to the White House. \"We want to get the Ukraine war over with,\" the US president said, before saying he hopes to have a total ceasefire in the coming days. He also told reporters he thinks he will talk to Russian President Vladimir Putin this week - but warned \"it takes two to tango\". Last month, Mr Trump accused Mr Zelenskyy of \"gambling with World War Three\" in an Oval Office meeting. US vice president JD Vance told the Ukrainian president \"you should be thanking\" Mr Trump \"for trying to bring an end to this conflict,\" sparking a tense 10-minute back-and-forth.  A press conference with the two leaders and the signing of an agreement was then cancelled."
    },
    {
        "title": "What's in the US-proposed Russia and Ukraine ceasefire deal?",
        "description": "Volodymyr Zelenskyy has said he is ready to agree to a ceasefire with Russia after successful talks with the US today.",
        "url": "https://news.sky.com/story/whats-in-the-us-proposed-russia-and-ukraine-ceasefire-deal-13326575",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-volodymyr-zelenskyy_6842484.jpg?20250228170830",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-11 19:53:00",
        "Headline": "US and Ukrainian officials met in Saudi Arabia to discuss ending the war with Russia. After nine hours of talks, Volodymyr Zelenskyy said his country is ready to support a 30-day ceasefire. But what is the US proposing?",
        "Content": " Volodymyr Zelenskyy has said he is ready to agree to a ceasefire with Russia after successful talks with the US today. The Ukrainian president said on Telegram that \"we are ready to take this step\" and said the US \"must convince Russia to do this\". Ukraine war latest: Trump warns Putin 'it takes two to tango' Following a meeting with Kyiv officials in Saudi Arabia, US secretary of state Marco Rubio told reporters \"the ball is now in Russia's court\" and the next step is for Moscow to agree to terms. US President Donald Trump said \"we want to get the Ukraine war over with\" and hopes to have a total ceasefire in the coming days. But what has been agreed by the US and Ukraine? Here's what we know so far...  Straight after the nine-hour talks in Jeddah, the US State Department said Washington would immediately lift the pause on intelligence sharing and military aid to Ukraine. \n                  'Calling Moscow's bluff': Sky News correspondents' views as Ukraine accepts ceasefire deal\n                 \n                  Zelenskyy ready to accept ceasefire deal - as US to resume intelligence sharing and military aid with Ukraine\n                 \n                  Ukraine's drone attack on Russia sent a message - and not just to the Kremlin\n                 Mr Zelenskyy confirmed in his post that an \"important element of today's conversation is America's readiness to restore defensive assistance to Ukraine, as well as intelligence support\".  As part of their plan, the US said both sides should agree to an immediate 30-day ceasefire which could then be mutually extended. A joint statement from the US and Ukraine added that Washington \"will communicate to Russia that Russian reciprocity is the key to achieving peace\". The Ukrainian president added that the proposal was \"not only concerning rockets, drones, and bombs, not only in the Black Sea, but also along the entire front line\" - although the official statement does not mention this. The statement also makes no mention of territory - despite Ukraine previously calling for Russia to return occupied lands, and the US saying Kyiv might have to concede territory - or the foreign deployment of soldiers in Ukraine for peacekeeping. The joint statement does say officials discussed aid efforts as part of the peace process, including \"the exchange of prisoners of war, the release of civilian detainees, and the return of forcibly transferred Ukrainian children\". Ukraine also reiterated that European partners would be involved in the peace process, and both countries agreed a deal on Kyiv's minerals and rare earths should \"conclude as soon as possible\". Read more:What minerals does Ukraine have - and why does Trump want them?  What has Ukraine said? Mr Zelenskyy said Ukraine agrees to the terms, adding that \"the American side understands our arguments\" and \"accepts our proposals\". He then said he wanted \"to thank President Trump for the constructiveness of the conversation between our teams,\" before adding: \"Ukraine is ready for peace. \"Russia must show whether it is ready to stop the war or continue it. The time has come for the full truth.\" Ukraine's foreign minister Andrii Sybiha - who was in Jeddah for the talks - called the meeting a step forward \"both on the path to peace and in developing the strategic Ukraine-US partnership\" on social media. And speaking to Sky News' Mark Austin, Ukrainian MP Lesia Vasylenko added that \"we will have to wait and see what comes of it\" but that \"clearly it's good news\". \"On first glance it's amazing,\" she said. \"If we can get the Russians to agree to a ceasefire for 30 days, then our soldiers on the frontline will have a break...\" However, she said: \"In previous years [Russia has] shown an absolute inability to understand what a ceasefire is and to stick to the basic rules of a ceasefire - which means not firing any weapons.\" Read more:Ukraine's drone attack on Russia sent a messageMusk blames 'IP addresses in Ukraine' after X 'cyber attack' What has the US said? Mr Rubio said the next step is \"going to take the offer\" to Russia, adding: \"We're going to tell them this is what's on the table, Ukraine is ready to stop shooting and start talking, and now it'll be up to them to say yes or no. \"I hope they're going to say yes, and if they do then I think we made great progress.\" Mr Trump echoed this outside the White House, saying Ukraine has agreed to the \"total ceasefire\" and that \"hopefully Russia will agree to it\".  He added that he will speak to Vladimir Putin in the coming days, warning the Russian president that \"it takes two to tango\". How has Russia reacted? So far, there's been no official reaction to the proposal other than to acknowledge Mr Trump's comments about talks within the next week. But ahead of the breakthrough talks in Jeddah, Russian foreign minister Sergei Lavrov said Mr Zelenskyy does not want peace. According to state news agency TASS, Mr Lavrov added: \"Mr Zelenskyy publicly declares that he does not want any ceasefire unless the Americans provide him with assurances that they will launch a nuclear strike on Russia if necessary. \"He frames the issue in much the same manner. For now, [a peace talk] is not serious.\" Read more from Sky News:President Trump is forcing Greenlanders to confront their futureCanada vows 'firm' response if Trump goes ahead with tariffs Mr Zelenskyy has not called for the US to strike Russia with nuclear weapons, but did say last month that Ukraine should be given them if talks on joining NATO are protracted for years."
    },
    {
        "title": "Helicopter flights at Washington's Reagan airport should be partially banned amid 'intolerable risk' of collisions with planes - investigators",
        "description": "Some helicopter flights at Washington's Reagan National Airport should be banned amid an \"intolerable risk\" of collisions with planes, crash investigators have said.",
        "url": "https://news.sky.com/story/helicopter-flights-at-washingtons-reagan-airport-should-be-partially-banned-amid-intolerable-risk-of-collisions-with-planes-investigators-13326512",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-helicopter-crash-collision_6823706.jpg?20250209095226",
        "type": "US",
        "Author": "Claire Gilbody Dickerson, news reporter",
        "Date Published": "2025-03-11 18:16:00",
        "Headline": "The chair of the National Transportation Safety Board (NTSB) said two urgent safety recommendations were being issued to the Federal Aviation Administration (FAA) concerning the helicopter routes near the airport. It comes after 67 people were killed in a mid-air collision in January.",
        "Content": "By Claire Gilbody Dickerson, news reporter   Some helicopter flights at Washington's Reagan National Airport should be banned amid an \"intolerable risk\" of collisions with planes, crash investigators have said. It comes after 67 people were killed in a mid-air collision earlier this year between a Black Hawk military helicopter and an American Airlines flight as the plane was coming in to land at the airport. The chair of the National Transportation Safety Board (NTSB) has said helicopter operations near planes at the airport pose an \"intolerable risk\" to aviation safety. As the NTSB issued its preliminary report into January's deadly crash, chair Jennifer Homendy said the board was calling for action to prevent a similar catastrophe from reoccurring. Two urgent safety recommendations One of the board's recommendations is to prevent helicopters from flying near Ronald Reagan Washington National Airport when two lesser-used runways are operational. Ms Homendy said the current separation distance between planes and helicopters at the airport was \"insufficient\". \n                  All major pieces of plane and helicopter in mid-air collision in Washington DC have been recovered, say crash investigators\n                 \n                  Remains of all 67 victims of Washington DC plane crash recovered\n                 \n                  Captain Rebecca Lobach: Third helicopter pilot who died in Washington crash was former White House aide\n                 At the moment, helicopters and planes can be as close as 75ft apart during landing, Ms Homendy said, adding it was \"far too close\".  Ms Homendy said the NTSB was releasing a report containing two urgent safety recommendations to the Federal Aviation Administration (FAA) concerning the helicopter routes near the airport. Besides proposing the ban on certain helicopter flights, the NTSB is also recommending the FAA create an alternate route that can be used by helicopters when the two secondary runways at Reagan National are in use.  'It shouldn't take a tragedy' Speaking of how the risk hadn't been identified until the crash occurred, Ms Homendy said: \"It does make me angry but it also makes me feel incredibly devastated for families that are grieving because they lost loved ones.\" The NTSB chair added: \"It shouldn't take a tragedy to require immediate action\". Read more: Washington DC plane crash: What we know so farRemains of all 67 victims of Washington DC plane crash recovered Asked if there had been an oversight, she said \"it's stronger than an oversight\" as there was data between 2021 and 2024 the FAA \"could've used anytime\" to determine that \"we have a trend here and a problem here and looked at that route\". \"That didn't occur which is why we are taking action today but unfortunately people lost lives and loved ones are grieving.\" Inaccurate readings Investigators have said the helicopter may have had inaccurate altitude readings in the moments before the crash, and the crew may not have heard key instructions from air traffic controllers. The collision likely occurred at an altitude just under 300ft (91 metres), as the plane descended toward the helicopter, which was well above its 200ft (61-metre) limit for that location. Following the crash between the passenger jet and the Black Hawk military helicopter, the FAA temporarily barred most helicopters near the airport - located in Arlington, Virginia - until it could review the NTSB's initial findings."
    },
    {
        "title": "Boy, 5, 'incinerated' after pressurised oxygen chamber explodes in US",
        "description": "A five-year-old boy was \"incinerated\" when a pressurised oxygen chamber exploded at a medical facility in the US state of Michigan.",
        "url": "https://news.sky.com/story/boy-5-incinerated-after-pressurised-oxygen-chamber-explodes-in-us-13326446",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-oxygen-chamger_6853298.jpg?20250311170624",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-11 16:36:00",
        "Headline": "A pressurised oxygen chamber at the Oxford Centre in Michigan claimed the life of Thomas Cooper \"within seconds\" of exploding and bursting into flames. Four people have been charged over his death.",
        "Content": "A five-year-old boy was \"incinerated\" when a pressurised oxygen chamber exploded at a medical facility in the US state of Michigan. Four people have been charged over the child's death at the Oxford Centre in Detroit, Michigan's attorney general has said. Thomas Cooper, from Michigan, was pronounced dead at the scene, while his mother, who was standing next to the chamber, suffered injuries to her arms when it exploded on 31 January. \"A single spark it appears ignited into a fully involved fire that claimed Thomas's life within seconds,\" attorney general Dana Nessel said at a news conference on Tuesday. \"Fires inside a hyperbaric chamber are considered a terminal event. Every such fire is almost certainly fatal and this is why many procedures and essential safety practices have been developed to keep a fire from ever occurring.\" The centre's founder and chief executive, Tamela Peterson, has been charged with second-degree murder, according to online court records. Facility manager Gary Marken, 65, safety manager Gary Mosteller, 64, and the hyperbaric chamber's operator that day, Aleta Moffitt, 60, have also been charged. Marken and Mosteller are charged with second-degree murder and involuntary manslaughter. Moffitt is charged with involuntary manslaughter and intentionally placing false medical information on a medical records chart. Raymond Cassar, Marken's attorney, said the second-degree murder charge comes as \"a total shock\" to him and his client. \"For fairness, he is presumed innocent,\" Mr Cassar said. \"This was a tragic accident and our thoughts and our prayers go out to the family of this little boy. \"I want to remind everyone that this was an accident, not an intentional act. We're going to have to leave this up to the experts to find out what was the cause of this.\" Read more from Sky News:Who were the targets of Russian spy ring dubbed 'the Minions'?Members of Maradona's medical team go on trial for homicide Sky News' US partner network NBC News reported that according to the family's lawyer, the boy had received multiple sessions of hyperbaric therapy for sleep apnea and ADHD. The US Food and Drug Administration (FDA) has cleared hyperbaric chambers to be marketed as safe and effective for a list of 13 disorders, including severe burns, decompression sickness and non-healing wounds. But the list does not include many of the other disorders advertised by the Oxford Centre - including sleep apnea and ADHD. The FDA also recommends that consumers only use hyperbaric centres that are inspected and accredited by the Undersea and Hyperbaric Medical Society. The Oxford Centre does not appear on the society's February 2025 list of accredited facilities."
    },
    {
        "title": "Rebecca Burke: Father of British backpacker being held in US says her 'life-changing trip has turned into a nightmare'",
        "description": "The father of a British tourist being held in the US has told Sky News \"what was meant to be a life-changing trip has turned into a nightmare\". ",
        "url": "https://news.sky.com/story/rebecca-burke-father-of-british-backpacker-being-held-in-us-says-her-life-changing-trip-has-turned-into-a-nightmare-13326216",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rebecca-paul-burke_6852888.jpg?20250311093911",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-11 10:53:00",
        "Headline": "Rebecca Burke was trying to cross from the US into Canada when a visa mix-up saw her handcuffed and taken to a detention facility in the States - where she has now been held for 14 days.",
        "Content": " The father of a British tourist being held in the US has told Sky News \"what was meant to be a life-changing trip has turned into a nightmare\".  Rebecca Burke, 28, from Monmouthshire, was attempting to cross into Canada from the US when she ended up being handcuffed and taken to a detention facility due to an issue with her visa. Ms Burke, who has been travelling since January, had a tourist visa for her backpacking trip around North America, but her entry into Canada - where she was planning to stay with a host family in exchange for food and accommodation - was rejected. Canadian officials said she needed a working visa and sent Ms Burke back to the US - where she was then \"taken by homeland security in handcuffs to a large detention centre\", her father Paul Burke said. She has now been held in the Tacoma Northwest facility in Washington state for 14 days. \"We thought of all the countries in the world, two of the safest for a British tourist to go to would be the USA and Canada,\" Mr Burke said during an interview on Sky News Breakfast. \"What was meant to be life changing for her has turned into a nightmare.\" Mr Burke and his wife have been able to speak to their daughter daily, as she can make phone calls from a shared iPad. \n                  Man arrested on suspicion of manslaughter over North Sea ship collision is captain of cargo ship\n                 \n                  Surge in stab victims forces hospital to offer knife amnesty\n                 \n                  Couple fighting £1,500 fine after migrant hid on motorhome and ended up in Essex\n                 They have become worried about Ms Burke's health, as her vegan meals consist solely of cold rice and potatoes. \"We spoke to her last night and she said she had to go and see the medic because she's got digestive problems,\" Ms Burke said. \"We've got very kind people [in Washington] who have offered to visit her. They've said when they visit, she's behind a glass screen and they have to talk to her on a telephone. \"I can't believe a British tourist is being kept in these conditions.\" Ms Burke - a graphic artist - has been able to trade with other women in the centre to secure fresh fruit, her dad said. \"She's trading portraits of the other women and the other women's kids, in return for an orange or some other food,\" he said. \"In terms of how the other women are treating her, it really is a band of sisters working together. They're taking care of each other. \"They're all trying to help each other and support each other, which is one good thing.\" It is unclear when Ms Burke's case will be dealt with by US immigration and Customs Enforcement (ICE) officials, who are \"overloaded with cases\" due to the US government's blitz on immigration, her father said. \"The detention centres are being filled because of the crackdown,\" Mr Burke continued. \"Becky told us that her detention centre will be at capacity next week.\" More from Sky News:Maradona medics to go on trialFormer Philippines president arrested  \"She was told by the ICE officer, it could still be another 10 days [until her case is dealt with],\" he continued. \"Why can't it be tomorrow? We just want her home.\" A Foreign Office spokesperson said: \"We are supporting a British national detained in the USA and are in contact with the local authorities.\" A spokesperson for ICE said: \"Rebecca Burke, 28, a citizen of the United Kingdom is detained by ICE at the Northwest ICE Processing Center related to the violation of the terms and conditions of her admission. \"All aliens in violation of U.S. immigration law may be subject to arrest, detention and if found removable by final order, removal from the United States regardless of nationality.\""
    },
    {
        "title": "Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium",
        "description": "Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%.",
        "url": "https://news.sky.com/story/donald-trump-climbs-down-from-threat-to-escalate-trade-war-with-canada-by-doubling-tariffs-on-steel-and-aluminium-13326385",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6853609.jpg?20250311220856",
        "type": "Business",
        "Author": "Samuel Osborne",
        "Date Published": "2025-03-11 14:54:00",
        "Headline": "In response to the US president's measures, Canada's incoming prime minister Mark Carney said he will keep tariffs in place until Americans \"show respect\" and commit to free trade.",
        "Content": "\n          News reporter\n              @samuelosborne93\n Donald Trump briefly threatened to escalate his trade war with Canada by doubling his planned tariffs on its steel and aluminium from 25% to 50%. The US president stepped back from his order after the provincial government of Ontario rowed back on a plan to charge 25% more for electricity it supplies to over 1.5 million American homes and businesses. Canada's most populous province provides electricity to Minnesota, New York and Michigan. As a result, White House trade adviser Peter Navarro said Mr Trump would not double steel and aluminium tariffs - but the federal government still plans to place a 25% tariff on all steel and aluminium imports from Wednesday. Ontario's response In his initial response to Mr Trump's threat, Ontario's premier Doug Ford said he would not back down until the US leader's tariffs on Canadian imports were \"gone for good\". But he later suspended the change temporarily, saying \"cooler heads need to prevail\" and he was confident the US president would also stand down on his plans. Meanwhile, Canada's incoming prime minister Mark Carney said he will keep other tariffs in place until Americans \"show respect\" and commit to free trade. Mr Carney called the new tariffs threatened by Mr Trump an \"attack\" on Canadian workers, families and businesses. Read more:Analysis: Uncertainty index spikes amid on/off confusion over Trump tariffs  Why is Trump threatening tariffs? A worldwide 25% tariff on steel and aluminium is due to come into effect on Wednesday as a way to kickstart US domestic production. Separate tariffs on goods from Mexico and Canada covered by a previous trade agreement (the US Mexico Canada, or USMCA deal) were delayed by a month to 2 April. President Trump seems to bear a particular grudge against Canada because of what he sees as rampant fentanyl smuggling and high Canadian taxes on dairy imports, which penalise US farmers. He has called for Canada to become part of the United States as its \"cherished 51st state\" as a solution, which has angered Canadian leaders.  Economic impact Mr Trump's turnaround comes after markets fell in response to his threat of doubling tariffs. The stock market has fallen over the last two weeks and Harvard University economist Larry Summers put the odds of a recession at 50-50. \"All the emphasis on tariffs and all the ambiguity and uncertainty has both chilled demand and caused prices to go up,\" the former treasury secretary for the Clinton administration posted on X on Monday. \"We are getting the worst of both worlds - concerns about inflation and an economic downturn and more uncertainty about the future and that slows everything.\" Investment bank Goldman Sachs revised down its growth forecast for this year from 2.2% to 1.7% and moderately increased its recession probability to 20% \"because the White House has the option to pull back policy changes if downside risks begin to look more serious\". Mr Trump has tried to reassure the American public that his tariffs will cause a bit of a \"transition\" to the economy as taxes spur more companies to begin the years-long process of relocating factories to the US to avoid tariffs. 👉 Follow Trump 100 on your podcast app 👈 Trump refuses to rule out recession Mr Trump did not rule out the possibility of a recession during an interview with Fox News on Sunday, where he said: \"I hate to predict things like that.\" On Tuesday, he was asked about a potential recession and said \"I don't see it at all\" and claimed the US is \"going to boom\". On Monday, the S&P 500 stock index fell 2.7% and on Tuesday it was around 10% below its record set last month."
    },
    {
        "title": "All 404 Labour MPs summoned to Downing Street to discuss benefit cuts",
        "description": "All 404 Labour MPs have been called to Downing Street to attend a \"welfare roundtable\" to discuss expected major benefit cuts.",
        "url": "https://news.sky.com/story/all-404-labour-mps-summoned-to-downing-street-to-discuss-benefit-cuts-13326706",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-police-cobra_6647833.jpg?20250311220838",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-11 21:53:00",
        "Headline": "Many backbenchers are uneasy with radical reforms set to be made to the welfare system later this month.",
        "Content": "\n          Political reporter\n              @alixculbertson\n All 404 Labour MPs have been called to Downing Street to attend a \"welfare roundtable\" to discuss expected major benefit cuts. Number 10's policy unit is hosting the discussions on Wednesday and Thursday about the \"future of the welfare system\". The prime minister's team is hoping to win over MPs concerned about sweeping reforms to the benefits system. Politics latest: UK braces for Trump's steel tariffs Sky News has seen the slots being offered to Labour's 404 MPs, which involves three 45-minute sessions on Wednesday and three on Thursday. Inviting all Labour MPs to Downing Street briefings is an unusual move, however, Number 10 said it is \"entirely routine for MPs to come in for briefings\". Several billion pounds in spending cuts, including from the welfare budget, are expected in the spring statement on 26 March, worrying some Labour backbenchers who are concerned about the impact on some of the most vulnerable members of society. \n                  Welfare cut plans are nothing new - but government will have to fight its own backbenchers\n                 \n                  Minister Pat McFadden says welfare cuts are 'coming soon'\n                 \n                  Angela Rayner 'won't speculate' over possible changes to two-child benefit cap\n                 For some, the arguments sound very much like those made by the previous Conservative governments as they attempted to crack down on welfare spending. Sir Keir Starmer told Labour MPs on Monday night that the current welfare bill was \"unsustainable, it's indefensible and it is unfair\". \"It runs contrary to those deep British values that if you can work, you should. And if you want to work, the government should support you, not stop you,\" he added. Read more:What welfare cuts could be announced?Minister says welfare cuts are 'coming soon'  MPs deeply nervous Many Labour MPs are deeply nervous following the backlash to cuts on pensioners' winter fuel allowance by the government, announced by Chancellor Rachel Reeves less than a month after winning the election last July. Her self-imposed borrowing limits have been eaten into by months of economic downturn and geopolitical events since the October budget, with the Treasury understood to believe she must maintain £9.9bn of headroom. The Treasury is putting forward the proposed cuts to the Office for Budget Responsibility (OBR) on Wednesday ahead of the forecaster's financial prediction on the day of Ms Reeves' spring statement.  Ministers have been priming MPs and the public for welfare cuts since January, when the chancellor promised to deliver \"fundamental reform\" of the welfare system, which \"includes looking at areas that have been ducked for too long, like the rising cost of health and disability benefits\". In an interview with Sky News' political editor Beth Rigby last week on the Electoral Dysfunction podcast the chancellor argued: \"We've got to reform our welfare system, because at the moment it's letting down taxpayers because it's costing too much, letting down our economy because there's too many people trapped on out of work benefits. \"And it's letting down the people who are recipients of benefits because they are trapped on benefits rather than actively supported back into work.\" And on Sunday, Cabinet Office minister Pat McFadden told Sunday Morning With Trevor Phillips \"we cannot sit back and let this bill grow and write people off in the way that's happened for many years\", promising reforms are coming \"soon\"."
    },
    {
        "title": "Saudi-owned Sela strikes deal with Olympics hero Mills",
        "description": "Saudi Arabia's attempts to exert a stranglehold on elite global sports is to expand in the form of a new joint venture with the consultancy founded by Sir Keith Mills, the architect of London's bid to host the 2012 Olympic Games.",
        "url": "https://news.sky.com/story/saudis-strike-deal-with-olympics-hero-mills8217-sports-group-13326405",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-newcastle-sela_6853233.jpg?20250311155830",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-11 15:38:00",
        "Headline": "Sela and Sir Keith Mills' Origin Sports Group have agreed to form a partnership that will include the establishment of a London-based international HQ for the Saudi company, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Saudi Arabia's attempts to exert a stranglehold on elite global sports is to expand in the form of a new joint venture with the consultancy founded by Sir Keith Mills, the architect of London's bid to host the 2012 Olympic Games. Sky News has learnt that Sela, which has gained international prominence in recent years as the shirt sponsor of Saudi-owned Premier League side Newcastle United, will announce later on Tuesday the formation of a partnership with Origin Sports Group. Money latest: Trump doubles some Canadian tariffs The alliance will come soon after Sela agreed a collaboration with The Ring and TKO to form a new international boxing promotion company. The Gulf state has already made significant - and controversial - strides into sports including golf and tennis, and will host the FIFA World Cup in 2030. In recent weeks, Surj, an arm of the Saudi sovereign wealth fund PIF, has spent a reported $1bn on a minority stake in the sports streaming platform DAZN. Doubts persist, however, about the efficacy of Saudi's sports strategy, with billions of dollars having been committed to LIV Golf, the breakaway tour whose success remains clouded by uncertainty. \n                  Volodymyr Zelenskyy leaves Saudi Arabia ahead of US-Ukraine meeting - as Marco Rubio says Kyiv should be 'prepared to do difficult things'\n                 \n                  Why all roads lead through Riyadh - as Saudi Arabia emerges as key global power broker\n                 \n                  Donald Trump says he's 'disappointed' by Ukraine's reaction at being shut of out of talks on ending Russia war \n                 Sela's joint venture with Origin will include the establishment of an international headquarters in London, with a board including Sela's head of international business, Ibrahim Mohtaseb. More from Sky News:Man Utd unveils new stadium planBoohoo rebrands as high street favourite Stewart Hosford, co-founder and chief executive of Origin Sports Group, will be CEO of Sela's London-based international operation. \"Building on our strong track record of international successes, we have an exciting pipeline of events and an ambitious growth strategy for the coming years,\" said Mr Mohtaseb. Mr Hosford added: \"We are already engaging with existing clients and exploring a pipeline of potential new clients. \"Sela aims to be the world's leading operator of live sports and entertainment experiences.\""
    },
    {
        "title": "No more tax returns for side hustlers selling clothes on Vinted or making money from TikTok",
        "description": "Up to 300,000 people with side hustles selling clothes on Vinted and eBay or making money from TikTok will no longer have to report their income to HMRC.",
        "url": "https://news.sky.com/story/no-more-tax-returns-for-side-hustlers-selling-clothes-on-vinted-or-making-money-from-tiktok-13326386",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-clothes-selling-vinted_6815277.jpg?20250131093954",
        "type": "Business",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-11 14:56:00",
        "Headline": "People will still have to pay tax on side hustles earning more than £1,000 but they will not have to file a tax return until they earn £3,000.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Up to 300,000 people with side hustles selling clothes on Vinted and eBay or making money from TikTok will no longer have to report their income to HMRC. The threshold for having to file a self-assessment tax return for trading income will be lifted from £1,000 to £3,000 by the next election, set for 2029. This will include people with side hustles selling vintage clothes on websites such as Vinted and eBay, selling handcrafted gifts on Etsy, dog walking, gardening, driving a taxi, delivering food, or creating online content. However, they will still have to pay tax on anything earned over £1,000 - they just will not have to report their income until it gets to £3,000. Politics latest: Police launch investigation into suspended Reform MP Tax minister James Murray said: \"From trading old games to creating content on social media, we are changing the way HMRC works to make it easier for Brits to make the very most of their entrepreneurial spirit. \"Taking hundreds of thousands of people out of filing tax returns means less time filling out forms and more time for them to grow their side hustle. \n                  Major UK recruiters linked to tax avoidance schemes after workers hit with crippling HMRC demands\n                 \n                  Stamp duty rules are changing from April - here's what you need to know\n                 \n                  Low-paid jobs at risk from Labour's tax increases on businesses\n                 \"We are going further and faster to overhaul the way HMRC works to make sure it delivers the Plan for Change that will help put more money in people's pockets.\" The Treasury said the threshold increase will benefit about 300,000 taxpayers, with an estimated 90,000 of those not having to pay any tax or having to report their trading income to HMRC in the future. It said 98% of those 300,000 are self-employed and report small trading incomes, while 2% report income from property. Eve Williams, CEO of eBay UK, said: \"This will be welcome news for thousands of UK sellers for whom eBay is a side hustle and a means of supplementing their household income during challenging times. \"By removing the paperwork associated with selling online, hopefully we will help these side hustles grow into fully fledged small businesses.\" To simplify the complex tax return system, the government also said a new online form will be introduced to declare cash earnings up to £3,000 for self-employed work. At the beginning of the year, the government announced it was cracking down on the existing \"side hustle tax\" for people who are trading online - buying things to sell for a profit - so companies such as Vinted, Depop and eBay must now share information with HMRC. Read more:Major UK recruiters linked to tax avoidance schemesVinted boss says cost of living crisis boost for second hand industry  Any accounts selling more than 30 items a year, or who turn over more than £1,000 a year, will have that information provided to HMRC by the companies. However, people selling their own possessions, such as getting rid of old clothes, are unlikely to need to declare their earnings and pay tax as they would not be considered as \"trading\"."
    },
    {
        "title": "Boohoo rebrands as Debenhams",
        "description": "Boohoo, the struggling online fashion retailer, has renamed itself Debenhams Group.",
        "url": "https://news.sky.com/story/boohoo-draws-line-through-past-with-debenhams-rebrand-13326161",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-debenhams-boohoo-logo_6852774.jpg?20250311072100",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-11 07:21:00",
        "Headline": "Boohoo's rebrand follows a huge fall from grace. It had been among the big winners in the online fast fashion revolution - but it's worth around £340m today, down from a peak above £5bn.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Boohoo, the struggling online fashion retailer, has renamed itself Debenhams Group. The company, which has been locked in a battle with its largest shareholder Mike Ashley's Frasers Group over direction and performance, announced a strategic review last year after the departure of chief executive John Lyttle. His successor Dan Finley said on Tuesday that a turnaround of Debenhams was now complete and the online department store's updated business model now accounted for the majority of group profitability. Money latest: Airline refuses refund to nut allergy sufferer refused travel Boohoo acquired only the name and website operations from administrators after debt-laden Debenhams, which had 123 stores and 12,000 staff, collapsed in 2020 after COVID shutdowns hit the economy. Frasers had been its largest shareholder but was wiped out when its advances were spurred. Frasers built up its stake in Boohoo in the wake of that defeat and has since failed, in January this year, in its efforts to oust Boohoo's co-founder and architect of the Debenhams purchase, Mahmud Kamani, from the board. \n                  Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium\n                 \n                  All 404 Labour MPs summoned to Downing Street to discuss benefit cuts\n                 \n                  Major UK recruiters linked to tax avoidance schemes after workers hit with crippling HMRC demands\n                 Boohoo's rebrand follows a huge fall from grace on the back of several headwinds. It had been among the big winners in the online fast fashion revolution, but its market value has collapsed since it acquired the Debenhams name in 2021. It's worth around £340m today, down from a peak above £5bn. Not only has competition - and cheaper competition at that - hit demand, but Boohoo has also struggled with supply chain disruption and rising returns. It has moved to bolster profitability by cutting costs, including jobs. Boohoo said the marketplace-led, stock-lite, capital-lite Debenhams had \"transformed\" its fortunes. \"Our ongoing business review has confirmed that Debenhams, its business model and its technology is at the epicentre of our group going forward,\" Boohoo said. It added that it sees a clear path to Debenhams becoming a business in the medium term with multi-billion pound gross merchandise value and a core earnings margin on net sales of about 20%. Read more from Sky News:UK recruiters linked to tax avoidance'Seismic' planning system reforms Boohoo also confirmed that Phil Ellis, the current finance director of Debenhams and managing director of DebenhamsPay+, would become its group chief financial officer and a member of the board. He replaces Stephen Morana with immediate effect. Investors appeared to have concerns when shares fell by more than 6% at the open, though they later turned positive. Matt Britzman, senior equity analyst at Hargreaves Lansdown, said of the update: \"It's no secret that Boohoo has been struggling, and a name change doesn't change the fact that sales are falling, down 16% in the brief trading update tucked away at the bottom of today's release. \"Reviving the group's youth fashion brands is a key challenge, and it's not clear that bringing back a legacy brand name will do much to help.\" Frasers declined to comment."
    },
    {
        "title": "Digital therapeutics group Strolll lands tonic of £10m funding boost",
        "description": "A digital therapeutics start-up which uses augmented reality (AR) glasses to aid people suffering from disorders including Parkinson's disease and multiple sclerosis will this week announce a &#163;10m funding injection.",
        "url": "https://news.sky.com/story/digital-therapeutics-group-strolll-lands-tonic-of-16310m-funding-boost-13326244",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-strolll-hot-buttons_6852918.jpg?20250311100607",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-11 10:06:00",
        "Headline": "The company, which uses augmented reality glasses to assist sufferers of Parkinson’s disease and MS, will announce £10.3m of funding led by Daily Dose-backer IW Capital, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A digital therapeutics start-up which uses augmented reality (AR) glasses to aid people suffering from disorders including Parkinson's disease and multiple sclerosis will this week announce a £10m funding injection. Sky News understands that Strolll, which was founded five years ago, has secured the new capital in a round led by IW Capital, which has backed other fast-growing UK SMEs including Daily Dose and Transcend Packaging. Strolll assists patients by using specially developed games to enliven physiotherapy exercises, in both clinical and residential environments. Money latest: Airline refuses refund to nut allergy sufferer refused travel The company says that its clinical trials have shown that clinicians using its technology are able to offer up to seven times the level of treatment while utilising two-thirds less staff time, allowing healthcare services to provide patient care more effectively and efficiently. Strolll said on Tuesday that it would use its new investment to accelerate sales and marketing activities, extend its product range, and to target additional neuro-related disorders. Last year, it commenced a three-year, £2.4m project grant-funded by the National Institute for Health and Care Research with the University of Leeds, University of York and four leading NHS trusts to conduct a randomised controlled trial of Strolll as a therapeutic treatment for patients with Parkinson's disease. \n                  Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium\n                 \n                  All 404 Labour MPs summoned to Downing Street to discuss benefit cuts\n                 \n                  Major UK recruiters linked to tax avoidance schemes after workers hit with crippling HMRC demands\n                 It also entered the US market in a $3m collaboration with US healthcare provider Cleveland Clinic, with the latter becoming a shareholder in Strolll. Strolll's latest funding comes as an ageing population means that neurological disorders such as Parkinson's disease are becoming increasingly prevalent. Read more from Sky News:UK recruiters linked to tax avoidance'Seismic' planning system reformsBoohoo rebrands as Debenhams \"Strolll is transforming the physiotherapy and neurorehabilitation markets and have already helped a significant number of people with debilitating neurological disorders to live better lives,\" said Isobel Egemole, IW Capital's investment director. \"The potential impact of their software is huge and we're proud to be backing this cutting-edge business as it addresses key healthcare needs.\""
    },
    {
        "title": "CVC-backed M Group in talks to buy utility services rival Telent for £270m",
        "description": "An infrastructure services provider backed by one of the world's biggest buyout firms is in advanced talks to buy rival Telent for about &#163;270m.",
        "url": "https://news.sky.com/story/cvc-backed-m-group-in-talks-to-buy-utility-services-rival-telent-for-163270m-13326243",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-mobile-radio-5g-tower_5301943.jpg?20210312102236",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-11 10:07:00",
        "Headline": "M Group Services, which was acquired by CVC Capital Partners last year, is in exclusive negotiations to buy Telent, which was once part of industrial powerhouse Marconi, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An infrastructure services provider backed by one of the world's biggest buyout firms is in advanced talks to buy rival Telent for about £270m. Sky News has learnt that M Group Services, which was acquired by CVC Capital Partners last year, is in exclusive negotiations to buy its smaller peer. Once part of Marconi, one of Britain's most famous industrial names, Telent ended up under the control of JC Flowers, the private equity firm, as part of a deal involving Pension Insurance Corporation, the specialist insurer, several years ago. Money latest: Airline refuses refund to nut allergy sufferer refused travel It provides a range of services to telecoms and other communications providers. M Group has seen off competition from Amey, the outsourcing group backed by Lord Hammond, the former chancellor, to secure its exclusivity period, with a formal offer anticipated within days. People close to the situation cautioned, however, that there was no certainty that a deal would be reached. \n                  Donald Trump climbs down from threat to escalate trade war with Canada by doubling tariffs on steel and aluminium\n                 \n                  All 404 Labour MPs summoned to Downing Street to discuss benefit cuts\n                 \n                  Major UK recruiters linked to tax avoidance schemes after workers hit with crippling HMRC demands\n                 At least one private equity bidder also submitted an indicative offer for Telent, they added. Telent is run by Jo Gretton, who was part of its founding management team in 2006, having previously worked for Marconi. Read more from Sky News:UK recruiters linked to tax avoidance'Seismic' planning system reformsBoohoo rebrands as Debenhams Among its contracts is one it was awarded by IBM to play a role in the deployment of the new Emergency Services Network across the UK. CVC declined to comment, while Telent could not be reached for comment."
    },
    {
        "title": "Rupert Lowe 'keeping options open' after ousting by Reform UK",
        "description": "Ousted Reform UK MP Rupert Lowe has told Sky News he has not ruled out joining the Conservatives or a new political party, declaring: \"I'm keeping my options open.\"",
        "url": "https://news.sky.com/story/rupert-lowe-keeping-options-open-after-ousting-by-reform-uk-13326594",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-mp-reform-uk_6850693.jpg?20250308193230",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-03-11 20:11:00",
        "Headline": "The Metropolitan Police have opened an investigation into the suspended Reform MP over claims he threatened the party chairman.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n Ousted Reform UK MP Rupert Lowe has told Sky News he has not ruled out joining the Conservatives or a new political party, declaring: \"I'm keeping my options open.\" Mr Lowe answered a series of questions from Sky News after the latest twist in his feud with Nigel Farage, with a police investigation launched into claims he threatened party chairman Zia Yusuf. The Metropolitan Police announced it had launched an investigation \"into an allegation of a series of verbal threats made by a 67-year-old man\" between December 2024 and February 2025. Politics latest: UK set to be hit by Trump's steel tariffs Responding to the police statement, Mr Lowe said he had instructed lawyers, who had made contact with the Met and made them aware of his willingness to co-operate in any necessary investigation. \"My lawyers have not yet received any contact from the police,\" he said. \"It is highly unusual for the police to disclose anything to the media at this stage of an investigation. \n                  Richard Tice says Reform UK made 'right judgement' to suspend MP over allegations of bullying\n                 \n                  Nigel Farage and Rupert Lowe escalate feud with new war of words\n                 \n                  Suspended Reform UK MP Rupert Lowe, who allegedly threatened violence, invites Nigel Farage to dinner\n                 \"I remain unaware of the specific allegations, but in any event, I deny any wrongdoing. The allegations are entirely untrue.\"  Could Lowe join Tories? Later, Sky News asked the Great Yarmouth MP if he thought there was a way back into Reform UK for him or was this the end - and if he might join the Tories or a new political party. \"This has all happened over a few days,\" Mr Lowe replied. \"I have been focused on debunking these false and damaging allegations. Who knows what will happen? I'm keeping my options open.\" In an interview on Monday, Mr Lowe said: \"I was a Tory years ago. I think the Tories have got a lot of work to do. I think there's some extremely good Tory MPs. I get on with a lot of them.\" For the Conservatives, the shadow home secretary Chris Philp said: \"He hasn't applied but obviously we're a broad and welcoming political party.\" He told Times Radio: \"People have been joining the Conservatives from across the political spectrum and we always welcome new joiners.\" Read more:Reform reports Rupert Lowe to policeThe Reform row: What has happened and what has been said? New splinter group? And in a move seen as a hint of a new splinter group, another ousted Reform UK politician, former deputy leader Ben Habib, told The Daily Telegraph that Mr Lowe was a \"good friend\" and he was \"constantly in touch with\" him. Sky News also asked Mr Lowe who he blamed for the party's treatment of him, including throwing him out of the party after he criticised Mr Farage. Was Mr Farage or Mr Yusuf to blame? \"Honestly, all of them,\" he said. \"This was a team effort to blacken my name. If it wasn't for my presence on X, I would have been buried under the false allegations. For that, I have to thank Elon Musk.\" He was asked about Mr Farage quoting Labour minister Mike Kane claiming after a heated Commons clash with Mr Lowe in December: \"The anger displayed towards me clearly showed a man not in charge of his own faculties.\" In a Sunday Telegraph article, Mr Farage added: \"I never saw anything like it in the European Parliament in 2019 when I was the leader of the Brexit Party and Mr Lowe was an MEP colleague.\" In response, Mr Lowe told Sky News: \"Reform sources have been briefing that I have dementia. This is the single most appalling thing I have ever seen in politics. \"Anyone who has known someone who has suffered so hideously from dementia will understand just how offensive it is. It shows the type of people we are dealing with.\" In the same article, Mr Farage claimed there had been \"too many similar outbursts from Mr Lowe, often involving the use of inappropriate language to the despair of our chief whip, Lee Anderson\". Mr Lowe hit back, telling Sky News: \"More baseless nonsense, spouted out to tarnish my reputation. Their malicious witch-hunt has fallen apart.\" Last year, when Mr Anderson was Conservative Party deputy chairman, he apologised after parliament's watchdog on bullying and harassment found he told a security guard to \"f*** off, everyone opens the door to me\". He was found to have twice sworn at the security officer and acted in a way that \"constituted bullying and also harassment\" in breach of parliament's behaviour policy, an independent expert panel concluded."
    },
    {
        "title": "'Shattering blow' to farmers over pause to environmental payment scheme",
        "description": "A \"shattering blow\" has been dealt to farmers with the sudden pausing for new applications for environmental payments, according to the National Farmers' Union.",
        "url": "https://news.sky.com/story/shattering-blow-to-farmers-over-pause-to-environmental-payment-scheme-13326652",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-farm-protest-farmers_6853575.png?20250311221311",
        "type": "Politics",
        "Author": "Dan Whitehead",
        "Date Published": "2025-03-11 21:14:00",
        "Headline": "The agricultural community has reacted with anger over changes to the Sustainable Farming Incentive - with a union claiming it was only given half an hour's warning.",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n A \"shattering blow\" has been dealt to farmers with the sudden pausing for new applications for environmental payments, according to the National Farmers' Union. The NFU says it was given just 30 minutes notice by the government that applications for the Sustainable Farming Incentive (SFI) were to close on Tuesday. The post-Brexit scheme, launched in 2022, pays farmers and land managers to take up practices that improve productivity and protect the environment and climate. Politics latest: UK set to be hit by Trump's steel tariffs There were more than 100 options for farmers to choose from, including the management of hedgerows, organic farming development and providing habitat for wildlife. The government says the budget for SFI has now been reached, adding that a \"record\" 50,000 farm businesses and more than half of all farmed land is now managed under the schemes. Both Conservatives and Liberal Democrat politicians have criticised the move and the lack of any prior warning. \n                  Labour MP goes public to oppose family farms tax - and more could follow\n                 \n                  Farmers react with 'fury' and 'anger' after Treasury meeting over inheritance tax\n                 \n                  Farage says 100 Labour MPs will be 'getting scared' and putting pressure on No 10 over protests by farmers\n                 But NFU president Tom Bradshaw said the decision showed \"how little\" the Department for Environment, Food And Rural Affairs (Defra) understood the industry.  'Growing disregard for agriculture within Defra' \"This is another shattering blow to English farms, delivered yet again with no warning, no understanding of the industry and a complete lack of compassion or care,\" Mr Bradshaw said. \"Today's terrible news was delivered with only 30 minutes warning to us before ministers briefed the press, leaving us unable to inform our members. \"There has been no consultation, no communication; there has been a total lack of the 'partnership and co-design' Defra loves to talk about. It is another example of the growing disregard for agriculture within the department.\" The government has said \"every penny\" in all existing SFI agreements will be paid to farmers, and outstanding eligible applications that have been submitted will also be taken forward. It said details of a new SFI scheme will be announced following the Spending Review. Read more:What's the beef with farmers' inheritance tax?Reed apologises to farmers for tax 'shock' West of England and Wales correspondent It was only last week that thousands of farmers were protesting outside Downing Street at the inheritance tax policy that's angered so many in agriculture. But one group representing farmers said on Tuesday the SFI decision is the \"cruellest betrayal so far\".\n The scheme was introduced under the Conservatives post-Brexit, to encourage sustainable farming. It took years to develop - and was seen as world leading in a way of ensuring farming was both productive for the sector and protective of the environment. Although a new scheme after the spending review is promised, many farmers will be left wondering whether it'll be as comprehensive. The National Farmers' Union was preparing on Wednesday to release a report saying that farming confidence in England and Wales is at its lowest level ever. It's described Tuesday's news as a \"bleak irony\". In a statement, minister for food security and rural affairs Daniel Zeichner said: \"This government is proud to have set the biggest budget for sustainable food produce in history, to boost growth in rural communities and all across the UK, under our plan for change. \"More farmers are now in schemes and more money is being spent through them than ever before. That is true today and will remain true tomorrow.  \"We have now successfully allocated the SFI24 budget as promised.\" 👉 Listen to Sky News Daily on your podcast app 👈 The government claims the last administration left the scheme uncapped - and they had to put a limit on to stop it running over budget. 'Absolutely bonkers' Olly Harrison, an arable farmer on Merseyside who organised the latest farming protest in London earlier this month, said the decision showed farmers were being \"attacked from every single angle\". \"It's just absolutely bonkers. The scheme worked. It was to replace what we had when we were in Europe [the EU] and a lot of farms embraced it, they were doing real good with it.\" \"Why have we got people who don't understand and don't understand the environment in power?\" Edward Morello, the Liberal Democrat MP for West Dorset, told Sky News the decision will \"alarm farmers across the UK\" - and called for the government to \"start listening and responding\" to the agricultural community. Tim Farron, the MP for Westmorland and Lonsdale, said the decision was made with \"no warning\". Conservative shadow farming minister Robbie Moore said the change was \"absolutely scandalous\"."
    },
    {
        "title": "All 404 Labour MPs summoned to Downing Street to discuss benefit cuts",
        "description": "All 404 Labour MPs have been called to Downing Street to attend a \"welfare roundtable\" to discuss expected major benefit cuts.",
        "url": "https://news.sky.com/story/all-404-labour-mps-summoned-to-downing-street-to-discuss-benefit-cuts-13326706",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-police-cobra_6647833.jpg?20250311220838",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-11 21:53:00",
        "Headline": "Many backbenchers are uneasy with radical reforms set to be made to the welfare system later this month.",
        "Content": "\n          Political reporter\n              @alixculbertson\n All 404 Labour MPs have been called to Downing Street to attend a \"welfare roundtable\" to discuss expected major benefit cuts. Number 10's policy unit is hosting the discussions on Wednesday and Thursday about the \"future of the welfare system\". The prime minister's team is hoping to win over MPs concerned about sweeping reforms to the benefits system. Politics latest: UK braces for Trump's steel tariffs Sky News has seen the slots being offered to Labour's 404 MPs, which involves three 45-minute sessions on Wednesday and three on Thursday. Inviting all Labour MPs to Downing Street briefings is an unusual move, however, Number 10 said it is \"entirely routine for MPs to come in for briefings\". Several billion pounds in spending cuts, including from the welfare budget, are expected in the spring statement on 26 March, worrying some Labour backbenchers who are concerned about the impact on some of the most vulnerable members of society. \n                  Welfare cut plans are nothing new - but government will have to fight its own backbenchers\n                 \n                  Minister Pat McFadden says welfare cuts are 'coming soon'\n                 \n                  Angela Rayner 'won't speculate' over possible changes to two-child benefit cap\n                 For some, the arguments sound very much like those made by the previous Conservative governments as they attempted to crack down on welfare spending. Sir Keir Starmer told Labour MPs on Monday night that the current welfare bill was \"unsustainable, it's indefensible and it is unfair\". \"It runs contrary to those deep British values that if you can work, you should. And if you want to work, the government should support you, not stop you,\" he added. Read more:What welfare cuts could be announced?Minister says welfare cuts are 'coming soon'  MPs deeply nervous Many Labour MPs are deeply nervous following the backlash to cuts on pensioners' winter fuel allowance by the government, announced by Chancellor Rachel Reeves less than a month after winning the election last July. Her self-imposed borrowing limits have been eaten into by months of economic downturn and geopolitical events since the October budget, with the Treasury understood to believe she must maintain £9.9bn of headroom. The Treasury is putting forward the proposed cuts to the Office for Budget Responsibility (OBR) on Wednesday ahead of the forecaster's financial prediction on the day of Ms Reeves' spring statement.  Ministers have been priming MPs and the public for welfare cuts since January, when the chancellor promised to deliver \"fundamental reform\" of the welfare system, which \"includes looking at areas that have been ducked for too long, like the rising cost of health and disability benefits\". In an interview with Sky News' political editor Beth Rigby last week on the Electoral Dysfunction podcast the chancellor argued: \"We've got to reform our welfare system, because at the moment it's letting down taxpayers because it's costing too much, letting down our economy because there's too many people trapped on out of work benefits. \"And it's letting down the people who are recipients of benefits because they are trapped on benefits rather than actively supported back into work.\" And on Sunday, Cabinet Office minister Pat McFadden told Sunday Morning With Trevor Phillips \"we cannot sit back and let this bill grow and write people off in the way that's happened for many years\", promising reforms are coming \"soon\"."
    },
    {
        "title": "Met Police launches investigation into suspended Reform MP Rupert Lowe over 'verbal threats'",
        "description": "The Metropolitan Police has launched an investigation into suspended Reform MP Rupert Lowe. ",
        "url": "https://news.sky.com/story/met-police-launches-investigation-into-suspended-reform-mp-rupert-lowe-over-verbal-threats-13326300",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-rupert-lowe-reform-uk_6849317.jpg?20250307185645",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-03-11 11:39:00",
        "Headline": "Rupert Lowe has previously denied the claims against him, calling them \"vexatious\" after he questioned Nigel Farage's leadership ability. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n The Metropolitan Police has launched an investigation into suspended Reform MP Rupert Lowe.  It comes after the party revealed they had referred him to police and stripped him of the whip on Friday, alleging he made \"verbal threats\" against chairman Zia Yousaf - which Mr Lowe denies. Politics Live: Council to drop controversial bin collection plan A spokesperson for the Met told Sky News they have now launched an investigation \"into an allegation of a series of verbal threats made by a 67-year-old man\". They added: \"Our original statement referred to alleged threats made in December 2024. We would like to clarify that when this matter was reported to us, it referred to a series of alleged threats made between December 2024 and February 2025. \"Further enquiries are ongoing at this stage.\" In response to the update, Mr Lowe said he was unaware of the specific allegations but denied wrongdoing. \n                  Rupert Lowe 'keeping options open' after ousting by Reform UK\n                 \n                  'Shattering blow' to farmers over pause to environmental payment scheme\n                 \n                  All 404 Labour MPs summoned to Downing Street to discuss benefit cuts\n                 \"I have instructed lawyers to represent me in this matter,\" he said. \"My lawyers have made contact with the Met Police, and have made them aware of my willingness to co-operate in any necessary investigation. \"My lawyers have not yet received any contact from the police. It is highly unusual for the police to disclose anything to the media at this stage of an investigation. \"I remain unaware of the specific allegations, but in any event, I deny any wrongdoing. \"The allegations are entirely untrue.\" Why was Rupert Lowe suspended?  In a statement on Friday, Reform claimed it had received evidence from staff of \"derogatory and discriminating remarks made about women\" by Mr Lowe, 67, who was elected to his Great Yarmouth seat last year.  The statement also claimed Mr Lowe had \"on at least two occasions made threats of physical violence\" against Mr Yusuf and \"accordingly, this matter is with the police\". Mr Lowe denied the claims, describing them as \"vexatious\" and said it was \"no surprise\" that it had come a day after he raised \"reasonable and constructive questions\" about Reform leader Nigel Farage. In an interview with the Daily Mail on Thursday, Mr Lowe had said Reform remains a \"protest party led by the Messiah\" under the Clacton MP. Asked whether he thought the former UKIP leader had the potential to become prime minister, as his supporters have suggested, Mr Lowe said: \"It's too early to know whether Nigel will deliver the goods. He can only deliver if he surrounds himself with the right people.\" Read More:The Reform row: What has happened and what has been said? He also claimed that he was \"barely six months into being an MP\" himself and \"in the betting to be the next prime minister\". War of words escalates Those words could have struck a nerve with Mr Farage after Elon Musk, the Tesla and Space X billionaire who has become one of Donald Trump's closest allies, suggested the Reform leader \"doesn't have what it takes\" and that Mr Lowe should take over. The pair launched bitter personal attacks on each other in articles for the Sunday Telegraph, with Mr Farage accusing Mr Lowe of falling out with all his fellow Reform MPs due to \"outbursts\" and \"inappropriate\" language. He also quoted Labour minister Mike Kane, who said after a confrontation with Mr Lowe in the Commons that his anger \"showed a man not in charge of his own faculties\". In his article, Mr Lowe repeated his claim there is no credible evidence against him, said he was the victim of a \"witch hunt\" and the Reform UK leadership was unable even to accept the most mild constructive criticism."
    },
    {
        "title": "No more tax returns for side hustlers selling clothes on Vinted or making money from TikTok",
        "description": "Up to 300,000 people with side hustles selling clothes on Vinted and eBay or making money from TikTok will no longer have to report their income to HMRC.",
        "url": "https://news.sky.com/story/no-more-tax-returns-for-side-hustlers-selling-clothes-on-vinted-or-making-money-from-tiktok-13326386",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-clothes-selling-vinted_6815277.jpg?20250131093954",
        "type": "Politics",
        "Author": "Alix Culbertson",
        "Date Published": "2025-03-11 14:56:00",
        "Headline": "People will still have to pay tax on side hustles earning more than £1,000 but they will not have to file a tax return until they earn £3,000.",
        "Content": "\n          Political reporter\n              @alixculbertson\n Up to 300,000 people with side hustles selling clothes on Vinted and eBay or making money from TikTok will no longer have to report their income to HMRC. The threshold for having to file a self-assessment tax return for trading income will be lifted from £1,000 to £3,000 by the next election, set for 2029. This will include people with side hustles selling vintage clothes on websites such as Vinted and eBay, selling handcrafted gifts on Etsy, dog walking, gardening, driving a taxi, delivering food, or creating online content. However, they will still have to pay tax on anything earned over £1,000 - they just will not have to report their income until it gets to £3,000. Politics latest: Police launch investigation into suspended Reform MP Tax minister James Murray said: \"From trading old games to creating content on social media, we are changing the way HMRC works to make it easier for Brits to make the very most of their entrepreneurial spirit. \"Taking hundreds of thousands of people out of filing tax returns means less time filling out forms and more time for them to grow their side hustle. \n                  Major UK recruiters linked to tax avoidance schemes after workers hit with crippling HMRC demands\n                 \n                  Stamp duty rules are changing from April - here's what you need to know\n                 \n                  Low-paid jobs at risk from Labour's tax increases on businesses\n                 \"We are going further and faster to overhaul the way HMRC works to make sure it delivers the Plan for Change that will help put more money in people's pockets.\" The Treasury said the threshold increase will benefit about 300,000 taxpayers, with an estimated 90,000 of those not having to pay any tax or having to report their trading income to HMRC in the future. It said 98% of those 300,000 are self-employed and report small trading incomes, while 2% report income from property. Eve Williams, CEO of eBay UK, said: \"This will be welcome news for thousands of UK sellers for whom eBay is a side hustle and a means of supplementing their household income during challenging times. \"By removing the paperwork associated with selling online, hopefully we will help these side hustles grow into fully fledged small businesses.\" To simplify the complex tax return system, the government also said a new online form will be introduced to declare cash earnings up to £3,000 for self-employed work. At the beginning of the year, the government announced it was cracking down on the existing \"side hustle tax\" for people who are trading online - buying things to sell for a profit - so companies such as Vinted, Depop and eBay must now share information with HMRC. Read more:Major UK recruiters linked to tax avoidance schemesVinted boss says cost of living crisis boost for second hand industry  Any accounts selling more than 30 items a year, or who turn over more than £1,000 a year, will have that information provided to HMRC by the companies. However, people selling their own possessions, such as getting rid of old clothes, are unlikely to need to declare their earnings and pay tax as they would not be considered as \"trading\"."
    },
    {
        "title": "Sir Keir Starmer says welfare bill is 'indefensible' - so what cuts could be announced?",
        "description": "Sir Keir Starmer is gearing up to sell further tough choices to his MPs as he lays the ground for big changes to the UK's welfare system.",
        "url": "https://news.sky.com/story/sir-keir-starmer-says-welfare-bill-is-indefensible-so-what-cuts-could-be-announced-13326286",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-money-cash_6733368.jpg?20241030172808",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-11 11:11:00",
        "Headline": "The prime minister is laying the ground for big changes to long term sickness and disability benefits - as he warns the bill is forecast to hit £70bn by 2030.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n Sir Keir Starmer is gearing up to sell further tough choices to his MPs as he lays the ground for big changes to the UK's welfare system. The prime minister's motivation is the sheer cost of long-term sickness and disability benefits for working age people, which has risen by £20bn since the pandemic and is forecast to hit £70bn over the next five years. Ministers have stressed there are currently 2.8 million people not in work due to ill-health, while one in eight young people are not in education, training or employment - prompting fears of a \"wasted generation\". Politics latest: Council to drop controversial bin collection plan The prime minister's argument is that this must all change if the government is to grow the economy, pay for improvements to public services and increase defence spending, as was announced last week. At a meeting of Labour MPs on Monday night, he said the current welfare bill was \"unsustainable, it's indefensible and it is unfair\". \"It runs contrary to those deep British values that if you can work, you should. And if you want to work, the government should support you, not stop you,\" he added. \n                  Rupert Lowe 'keeping options open' after ousting by Reform UK\n                 \n                  'Shattering blow' to farmers over pause to environmental payment scheme\n                 \n                  All 404 Labour MPs summoned to Downing Street to discuss benefit cuts\n                 However, disability charities have warned against draconian cuts to welfare, with Scope warning that 700,000 more disabled households could be pushed into poverty if one type of benefit - personal independence payments - is cut. Here Sky News takes a look at what changes could be coming down the track - and what impact they may have. Personal Independence Payments (PIP) PIP is a tax-free payment given to people aged 16-64 to help with the extra costs caused by long-term ill-health or disability. There are two components of PIP: a daily living part designed for those who have a long-term physical or mental health condition or disability, and a mobility part, for those who have difficulty doing certain everyday tasks or getting around.  It's possible to meet the criteria for one part or both parts, and payments vary for each. Those who qualify for the daily living part are given either a lower rate of £72.65 per week or a higher rate of £108.55, and those who qualify for the mobility part either receive £28.70 or £75.75. Who is currently eligible? People aged between 16-64 can get PIP regardless of whether they work if they expect their difficulties to last for at least 12 months from when they started. What could change? Some of the changes being mooted include making it harder to qualify for PIP and freezing payments next year so they do not rise with inflation - something ex Tory chancellor George Osborne did not do under the policy of austerity. Universal Credit Universal Credit is available to those who are on a low income, out of work or cannot work. The benefit is replacing the six you can currently claim - child tax credit, housing benefit, income support, income-based job seeker's allowance, income-related employment and support allowance and working tax credits.  According to ITV News, the basic rate for Universal Credit could be increased for those who are in work or searching for work, to incentivise employment. while the rate could be cut for those who are judged unfit to work. Merging benefits Over the weekend, the Sun on Sunday reported that workers who lose their jobs will receive priority for benefits over those who have never had one, in a bid to save money. A new \"unemployment insurance\" benefit would be created by merging Jobseeker's Allowance - the benefit paid to people who are out of work but looking for a job - and the Employment and Support Allowance, used for those with a disability or health condition that affects how much they can work. The newspaper reported that the new support would be time-limited and all claimants would have to actively seek work to qualify for it. How have the proposals been received so far? The plans, which are set to be unveiled in the spring statement later this month, have divided Labour MPs. Read more:Government will have to fight its own backbenchers over welfareBenefit cheats to lose driving licence in government crackdown One backbench MP in favour of the changes told Sky News: \"There is no other choice, the system is broken and we need to reform it to help more people back to work. The cost is totally unsustainable.\" Another said: \"The welfare bill is out of control - and we need to get people back into work.\" Others said that while \"nearly everyone accepted that the system doesn't work\", they wanted to know what would happen to people who physically can't work. At a meeting of the parliamentary Labour Party on Monday night hosted by the prime minister, one MP shared an emotive story about one of his daughters who would never be able to work. When asked about how they felt about the proposals, one Labour MP on the left said: \"Unsurprised and unhappy.\""
    },
    {
        "title": "Senedd 2026: Row over Welsh-only names as new constituencies announced",
        "description": "The new constituencies for the Senedd have been given Welsh-only names, in a move criticised by the former leader of the Welsh Conservatives.",
        "url": "https://news.sky.com/story/senedd-2026-row-over-welsh-only-names-as-new-constituencies-announced-13326320",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-wales-polling-station_6853060.jpg?20250311125411",
        "type": "Politics",
        "Author": "Tomos Evans",
        "Date Published": "2025-03-11 12:25:00",
        "Headline": "When Wales heads to the polls next May, there will be changes to how Senedd members are elected - but what are they?",
        "Content": "\n          Wales reporter\n              @TomosGruffydd\n The new constituencies for the Senedd have been given Welsh-only names, in a move criticised by the former leader of the Welsh Conservatives. The number of Senedd constituencies has been slashed just as the number of members in the Welsh parliament is set to increase. Voters in Wales will head to the polls next May, but instead of the usual 40 constituencies, the country will now be split into 16 larger areas. The constituencies were confirmed on Monday, with all 16 given Welsh-only names, after a consultation process came to an end. But former leader of the Welsh Conservatives, Andrew RT Davies, said many of his constituents who expressed concerns they would be \"disenfranchised\" by the proposed names had been \"ignored\". \"Wales is bilingual and constituency names should be in both languages,\" he added. The Democracy and Boundary Commission Cymru said it assigned names to each constituency which it believed to be \"acceptable and recognisable for people across Wales\". The consultation process received more responses than ever before \"by a considerable margin\", according to the commission. 1. Bangor Conwy Môn\n2. Clwyd\n3. Fflint Wrecsam\n4. Gwynedd Maldwyn\n5. Ceredigion Penfro\n6. Sir Gaerfyrddin\n7. Gŵyr Abertawe\n8. Brycheiniog Tawe Nedd\n9. Afan Ogwr Rhondda\n10. Pontypridd Cynon Merthyr\n11. Blaenau Gwent Caerffili Rhymni\n12. Sir Fynwy Torfaen\n13. Casnewydd Islwyn\n14. Caerdydd Penarth\n15. Caerdydd Ffynnon Taf\n16. Pen-y-bont Bro Morgannwg Shereen Williams MBE, chief executive of the commission, said the changes were \"very significant\". Ms Williams acknowledged that the debate surrounding the names had been \"robust, but very constructive\". She thanked those members of the public who had responded to the consultation, which had been \"significantly strengthened due to the public's involvement\". What else is set to change? The announcement comes as the number of Senedd members is set to rise by more than 50%, rising from 60 to 96 at the next election. The way politicians get elected to Cardiff Bay will also change. Up until now, the Senedd was made up of 40 members elected through first past the post - the system used in Westminster - and a further 20 elected to represent five larger regions using the D'Hondt list method. Read more:Senedd members could lose seats under new plansWelsh budget approved - but what does it mean? Last year, the number of Welsh constituencies in a general election was cut from 40 to 32 - and those 32 have been paired to form the new Senedd constituencies. Six members will be elected from a list of candidates for each of the 16 constituencies, marking the biggest change in the way Senedd members are elected since the parliament's inception more than a quarter of a century ago."
    },
    {
        "title": "The furious rise of climate whiplash",
        "description": "A phenomenon that made the recent California wildfires so damaging is spreading further afield.",
        "url": "https://news.sky.com/story/the-furious-rise-of-climate-whiplash-13326408",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-climate-whiplash-graphic_6853234.jpg?20250311160004",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-11 15:48:00",
        "Headline": "What happens when the wet weather gets wetter and then the dry weather gets drier? That's what played out in the recent Los Angeles wildfires, and the phenomenon is spreading.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n A phenomenon that made the recent California wildfires so damaging is spreading further afield. Climate \"whiplash\" sees dangerous swings between very wet weather and very dry weather. Drought or extreme rain are hard enough to contend with on their own. The problem with whiplash is the severe jerk from one to the other makes them both more damaging. It bore out in Los Angeles when two very wet winters produced lots of grass and shrubs, and were then followed by a long, hot summer that dried out that vegetation, providing abundant, tinder-dry fuel ripe for a wildfire. Without this swing \"there still could have been severe fires, but this was definitely an event that was amplified by that particular sequence\", says Dr Daniel Swain, climate scientist from University of California Los Angeles. Heavy rain will slide off scorched earth more rapidly, leading to landslides and flooding. Keeping reservoirs full should help guard against drought - but sudden, heavy downpours can send them overflowing, flooding the surroundings. \n                  Drivers 'confused' by transition to electric vehicles, ministers warned\n                 \n                  More heat pumps, fewer kebabs - Is this the way to stop climate change?\n                 \n                  Heat pumps, EVs and fewer kebabs: You'll notice the next cut to emissions - but half the work is done\n                 How is whiplash changing? A little bit of this whiplash is natural. But scientists are newly talking about it as climate change is making it worse in locations all around the world. That's because the atmosphere works like a sponge: it can both soak up and release water. The hotter it is, the more water it can soak up - and unleash too. So climate change, by warming the atmosphere, is essentially growing the size of the sponge - exponentially, too. New research by the charity WaterAid has identified at least 17 major cities where climate whiplash is getting worse, out of 112 they analysed (the world's 100 largest plus 12 more where it works). While the recent Los Angeles wildfires may be burned in our memory, there are other places that are much more vulnerable. Partly because they are not fabulously wealthy like the rich and famous of Hollywood, with poorer people and infrastructure, but also because the swings are more extreme. Take Hangzhou in eastern China, for example, which topped the list of cities with intense climate whiplash. The higher and darker the spikes in the chart, the more intense the weather. Or Jakarta, second on the list - just look at how dark, wide and tall those wet and dry periods are on the right-hand side. Impacts in Indonesia's capital have been \"escalating\", with disasters on course to get more frequent and severe, says Egi Suarga, climate manager for World Resources Institute Indonesia. This threatens food security, adds Prof Cedric John from Queen Mary University London, who has been working with Indonesia's Bureau for Meteorology, Climate, and Geophysics (BMKG). \"The uncertainty in the timing and intensity of rainfall, as well as the prolonged drought, can lead to crop failure or poor harvest.\" WaterAid's chief executive Tim Wainwright says: \"It affects people's health. It affects education. It affects people's livelihoods. In extreme cases, it will take people's lives.\" Where could whiplash strike next? Partly what makes whiplash so dangerous is its unpredictability. It's hard to prepare for. But Dr Swain says there are \"early indications\" of a particularly hot and dry start to summer across much of western USA, following relatively wet periods, \"opening the door to a potential wet-to-dry whiplash event\". Whiplash isn't affecting everywhere yet. In fact, in London the extremes may have calmed for now, found WaterAid, which worked with scientists from Cardiff and Bristol Universities to produce these new metrics. And places like Cairo have 'flipped' completely, going from long-term wet to long-term dry. But eventually the whiplash phenomenon may spread everywhere as the air keeps warming due to climate change. \"We do, in fact, expect that almost every populated inhabited continent on Earth will eventually see a substantial increase in that whiplash,\" said Dr Swain. A study by him in January found whiplash has already increased by at least 31% on average across the globe. Are there solutions? The best solution would be to stop emitting greenhouse gases. But this comes at a time when the US looks to up fossil fuel energy and row back on overseas funding for climate projects. The UK has also eaten into its aid budget to pay for increased defence spending. But solutions are often \"very well known and very simple\", says Tim Wainwright. In Karachi, for example, people harvest water from the sky as it cools, and then us it to wash, farm, or refill dried up wells. Wainwright says the solution often \"does not require a huge leap forward in technology. It requires leaps forward in political leadership and investment\"."
    },
    {
        "title": "X outage: Who are hackers 'behind massive cyber attack' on Elon Musk's social media platform?",
        "description": "Elon Musk said his social media platform X was hit by a \"massive cyber attack\" on Monday - but who was behind it?",
        "url": "https://news.sky.com/story/x-outage-who-are-hackers-claiming-to-have-caused-massive-cyber-attack-on-elon-musks-social-media-platform-13326288",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hacker-istock_6853108.jpg?20250311133151",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-03-11 11:17:00",
        "Headline": "Dark Storm Team claimed it was behind the attack and has previously targeted Israeli hospitals and US airports, according to cyber security experts.",
        "Content": "\n          Science and Technology reporter\n       Elon Musk said his social media platform X was hit by a \"massive cyber attack\" on Monday - but who was behind it? Musk said IP addresses involved in the attack were traced to locations \"in the Ukraine area\" but a hacking group called Dark Storm Team claimed it was responsible, in now-deleted Telegram posts. \"Twitter has been taken offline by Dark Storm Team,\" a post read on the group's account, with a screenshot showing connection problems in a long list of countries. Here, Sky News looks at what we know about the hackers claiming responsibility for the attack. Who is Dark Storm Team? The hacking group was founded in 2023 and has orchestrated cyber attacks against governments and organisations known to support Israel, according to cyber security firm Check Point. \"They tend to go after those high-profile attacks,\" said Muhammad Yahya Patel, a lead security engineer at Check Point. \"Their main mantra is to cause disruption of services, largely related to government and NATO connections.\" The group has previously targeted Israeli hospitals, US airports, government websites and other critical infrastructure services, according to cyber security site SecurityScorecard. It added that Dark Storm Team does not tend to demand ransoms after attacks and the group is vocal about its political motivations. \"We will attack any country [...] that supports the occupying entity,\" the group posted on Telegram last year, in screenshots shared by SecurityScorecard. However, Dark Storm Team is not completely motivated by political beliefs - it also advertises itself as hackers-for-hire.  'We have no relationship with Ukraine' While Musk linked the cyber attack to IP addresses \"in the Ukraine area\", this is disputed. A post from an X account claiming to be connected to Dark Storm Team read: \"According to what Elon Musk said about the cyber attack on the X platform, its source is Ukraine. \"It is an accusation without any evidence, and we have no relationship with Ukraine.\" Cybersecurity experts also questioned the claim, saying it would be unusual for an attack like this to come out of one location. Read more:Musk calls US senator 'a traitor' for visiting UkraineWhat's gone wrong at Musk's Tesla? \"The IP addresses are [usually] distributed globally from different locations,\" said Mr Patel. After checking with Check Point's team of cyber analysts, he added: \"It looks like a general DDoS attack coming from different locations, different IP addresses.\" A DDoS, or denial-of-service, attack is when hackers flood a system with attacks from all angles, targeting web servers, internal networks, or anything else they can access. The idea is to disrupt services enough that they become unavailable. After scouring the dark web, Mr Patel's team also found no one else claiming responsibility for the attack on X, only Dark Storm Team. Musk, the internet and Ukraine Musk caused alarm on Sunday when he claimed Ukraine's \"entire front line would collapse if I turned it [Starlink] off\". He made the remarks during a row with Poland's foreign minister over the use of Musk's satellite internet system. Last year, Ukraine said around 42,000 of the internet terminals were in operation across its military, hospitals, businesses and aid organisations. Musk later said he would \"never turn off [Starlink's] terminals\". US negotiators pressing Kyiv for access to Ukraine's critical minerals have raised the possibility of cutting Ukraine’s access to the service, sources told Reuters in February."
    },
    {
        "title": "New planning bill could be the government's most important - but will it work in practice?",
        "description": "Could the Planning and Infrastructure Bill be the most important piece of legislation in this parliament?",
        "url": "https://news.sky.com/story/new-planning-bill-could-be-the-governments-most-important-but-will-it-work-in-practice-13326568",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-building-construction_6851336.jpg?20250309162142",
        "type": "Technology",
        "Author": "Sam Coates",
        "Date Published": "2025-03-11 19:48:00",
        "Headline": "The government introduced a new bill on Tuesday aimed at clearing blocks to building to get Britain growing again.",
        "Content": "\n          Deputy political editor\n              @SamCoatesSky\n Could the Planning and Infrastructure Bill be the most important piece of legislation in this parliament? Today is the first time we have seen the bill - which is meant to clear out the blockages and get Britain growing again. As Deputy Prime Minister and Housing Secretary Angela Rayner said today: \"Far too often, it takes years and years and years of going through these processes. We want to streamline it, make it clear what our expectations are, and then deliver for people and get that infrastructure and the houses we desperately need.\" Politics latest: UK to be hit by Trump's steel tariff tonight But, as our Battle for Growth series on Sky News has shown over recent months, when there are so many intricate and intractable blockages, this is a bold claim. Let's look at whether the Planning Bill would help with four specific projects. Firstly, there is the case of the Lower Thames Crossing. This would be a tunnel under the Thames to the east of London. But £1.2bn has been spent without a shovel in the ground, and the planning document runs to 359,070 pages. This bill looks to streamline who you have to consult. It reduces the number of public bodies developers have to consult. It also moves more council decisions away from councillors and towards council officers, meaning less local democracy, which can tie a process in knots. \n                  Grey belt planning policy 'rushed' and 'not thought through' - Lords report\n                 \n                  The builder shortage challenging the government's growth plans\n                 \n                  Construction industry 'roaring ahead' after rebound in house building\n                  Pro-growth campaigners are pretty happy with this - let's see if it works in practice. There is the carbon capture and storage facility on a new gas-fired power station in Teesside. Currently, the site in Teesworks sits empty, costing the developers £100m every three months. The bill seeks to deal with some of them, limiting from three to two the number of times \"meritless\" cases can go to court. But claimants don't deliberately bring meritless cases, so it is unclear what the impact is in practice. Meanwhile, the government has not yet found a way to deal with the international convention that allows taxpayer-funded green challenges to big projects of the sort that have delayed building in Teesworks. Sir Keir Starmer has repeatedly said he does not want to see any more bat tunnels - the £100m, one kilometre shed being built by HS2 in Buckinghamshire to protect an estimated 300 bats in nearby woodland. Ministers claim the bill would stop this from happening again, but experts cast doubt on the assertion. Read more:'Seismic' planning reforms to be 'unleashed'Developers could bypass planning committees The bill creates a Nature Recovery Fund, which allows developers to pay into funds allowing building to proceed while wider action is taken to secure the environmental improvements. While this could work for some challenges - such as housing projects - it is unlikely to help solve the issues that caused the bat tunnel. Critics say this is because the core environmental regulations about nature habitats remain on the statute books. Finally, getting Britain connected remains a major challenge for this government, and they have made clear it means covering parts of the countryside in pylons. But that's the kind of thing that generates huge local campaigns like the ones marked on the map. This planning bill offers £250 a year for those affected by new pylons, in exchange for curbing the right to protest. But this has been dismissed as \"peanuts\" by campaigners who want much more. Meanwhile, the government is mulling much bolder reforms beyond this bill: different pricing in different parts of Britain. Cheaper bills for energy intensive business that relocates to nearby wind farms and power stations. Is this the real answer to bringing down bills? These two have promised a revolution. Growth campaigners say it's a good start but not enough. Local opponents say it already goes too far. Does it really change the incentives to get Britain building again? Or when we come to judge, will it really prove to have made a difference in three or four years?"
    },
    {
        "title": "Why hay fever is worse this year - and what you can do about it",
        "description": "Almost exactly 200 years ago,&#160;a London-based doctor called John Bostock noticed he would get an itchy throat, sore watering eyes, and an irritated nose during warmer months.",
        "url": "https://news.sky.com/story/why-hay-fever-is-worse-this-year-and-what-you-can-do-about-it-13326241",
        "image_url": "https://e3.365dm.com/22/06/1920x1080/skynews-pollen-allergy-hay-fever_5798186.jpg?20220608070706",
        "type": "Technology",
        "Author": "Jake Levison",
        "Date Published": "2025-03-11 09:58:00",
        "Headline": "This year is set to be a more severe one for some hay fever sufferers, but climate change could pose a longer term threat. Here we look at how pollen causes hay fever, when the season is and why it could feel worse this year.",
        "Content": "\n          News reporter\n       Almost exactly 200 years ago, a London-based doctor called John Bostock noticed he would get an itchy throat, sore watering eyes, and an irritated nose during warmer months. He found 28 other patients suffering with the same symptoms, without explanation. He coined the term hay fever, but it wasn't until 1859 that scientist Charles Blackley, suffering from symptoms himself, correctly hypothesised that pollen was to blame. Fast forward to the modern day and it's estimated around 13 million people in the UK are suffering from hay fever - and research suggests it could get worse. Here is a look at how pollen causes hay fever, when the season is and why it could feel worse for sufferers this year. What causes hay fever? Hay fever is essentially an allergy to pollen, the fine powder plants produce as part of their reproductive cycle. Pollen contains proteins and people have an allergic reaction to these proteins - hay fever being one of those reactions, along with allergic asthma and eczema. The symptoms are caused when the immune system reacts to pollen in the body to produce histamine and other chemicals, according to the Met Office. Hay fever is most commonly caused by grass pollens, although other pollens - of which there are around 30 - can also trigger symptoms. Insects and the wind help spread pollen, and the weather hugely impacts how much pollen is released and spread around. Hay fever sufferers may hope for rainy days, when pollen can be cleared from the air, whereas it spreads easily on hot, humid and windy days. The pollen count is highest in the early evening on sunny days and that's when you are most likely to suffer from hay fever symptoms, the Met Office says. When is hay fever season? There are three different types of hay fever seasons, triggered by different types of pollen. Tree pollen comes first, typically from late March to mid-May, affecting around 25% of hay fever sufferers. Grass pollen affects the majority of hay fever sufferers due to around 150 types of grass pollen flowering simultaneously. It has two peaks, and its season typically lasts from May until July. Weed pollen is the third trigger, and it can be released at any time, though the season typically covers the end of June to September. Why is it worse this year? It is the tree pollen phase of hay fever season between March and mid-May that will be more severe for sufferers, says Dr Beverley Adams-Groom, senior palynologist and pollen forecaster at the University of Worcester. She tells Sky News people will likely suffer more severe symptoms due to a particularly high pollen count, saying that's down to two factors. \"First of all, trees that produce allergenic pollen in the UK tend to have alternating high and low years of severity - this year is a high year,\" she says. \"Secondly, there was suitable weather for high pollen production last summer when the pollen was set in the buds.\" It was a particularly warm and dry June, meaning more pollen was produced in birch, leading to a more severe tree pollen season, she explains. She says central regions of the UK are particularly affected. Southern and eastern regions are being affected less due to periods of cold winds in the spring that tend to reduce the amount of pollen released. She says grass pollen season is likely to be around average this year, but it's a bit too early to know for certain. Read more:What is the difference between a cyclone, typhoon and hurricane?How lab-grown food could be on UK shelves within two years Why it could get worse long-term Climate change could make hay fever worse in a number of ways, according to UK Health Security Agency (UKHSA) research: • Changes in temperature and rainfall may lengthen the UK pollen season and potentially make pollen concentrations higher• It could change the potency of pollen, making single pollen particles a more threatening allergy-causing agent• Climate change affecting the geographical distribution of allergenic plants, with invasive species such as ambrosia (common ragweed) being on the watch list. A single ragweed plant can produce a billion grains of pollen per season and its pollen causes strong allergic reactions. Climate change is already having an impact, according to Dr Adams-Groom, because it's leading to the sort of warmer June temperatures we saw last year, which led to a higher pollen count. How can hay fever be treated? There is unfortunately no cure for hay fever, and you can't prevent it, so the only option for sufferers is to try and manage its symptoms. Tips on easing the symptoms include: • Put Vaseline around the nostrils to trap pollen• Wear wraparound sunglasses to prevent pollen getting into the eyes• Stay indoors whenever possible• Get advice from pharmacists on treatments including antihistamine drops, tablets or nasal sprays."
    },
    {
        "title": "Hollyoaks and reality TV star Paul Danan died from cocktail of drugs, inquest hears",
        "description": "Hollyoaks star Paul Danan died from a cocktail of drugs including cocaine and heroin, an inquest has heard. ",
        "url": "https://news.sky.com/story/hollyoaks-and-reality-tv-star-paul-danan-died-from-cocktail-of-drugs-inquest-hears-13326234",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-aul-danan-obit_6801117.jpg?20250116125423",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-11 09:52:00",
        "Headline": "The 46-year-old actor was pronounced dead by emergency services at his Bristol home in January. A full inquest hearing has been scheduled for May. ",
        "Content": "Hollyoaks star Paul Danan died from a cocktail of drugs including cocaine and heroin, an inquest has heard.  Danan, 46, was found dead at his Bristol home in January. The actor and reality TV star was best known for playing bad boy Sol Patrick in the Channel 4 soap Hollyoaks from 1997 to 2001. He later appeared on the celebrity versions of Love Island and Big Brother. An inquest into Danan's death was this morning opened and adjourned at Avon Coroner's Court, Bristol. Danan was pronounced dead by emergency services at his home on 15 January and his body was identified at the scene by his partner, Melissa Crooks, the inquest heard. His provisional cause of death has been recorded as combined toxicity of heroin, methadone, codeine, pregabalin, cocaine and zopiclone, contributed to by benzodiazepine use, the court heard. \"I understand there are no family concerns,\" coroner's officer Alexis Camp said. \n                  Man arrested on suspicion of manslaughter over North Sea ship collision is captain of cargo ship\n                 \n                  Surge in stab victims forces hospital to offer knife amnesty\n                 \n                  Couple fighting £1,500 fine after migrant hid on motorhome and ended up in Essex\n                 She added: \"No note was left.\" Danan's GP and family members will be asked to provide statements, as will police officers and ambulance service members, Ms Camp said. Inquiries are also ongoing with Avon and Wiltshire Mental Health Partnership NHS Trust. The provisional date for the full inquest hearing is 28 May. Danan had been due to appear for a plea hearing on 16 January after being charged with possession of cocaine and cannabis. He had also been accused of driving while under the influence of drugs in October last year. More from Sky News:Man Utd unveils new stadium planMaradona medics go on trial over his death Danan had been open about his struggles with substance abuse, which he said began when he was a teenager. In 2019, he said on ITV's The Jeremy Kyle Show that he had to \"work hard at it every day to keep in recovery\". Paying tribute to Danan after his death, fellow Love Island star Calum Best wrote on Instagram: \"Life wasn't always easy for him, but he faced it with such heart and courage, and that inspired so many of us. \"We shared many laughs, chats, and unforgettable moments. My heart goes out to his loved ones right now. Rest easy, brother.\""
    },
    {
        "title": "Yung Filly: British YouTuber and rapper denies sexual assault charges in Australia",
        "description": "British YouTuber and rapper Yung Filly has pleaded not guilty to multiple sexual assault charges in Australia.",
        "url": "https://news.sky.com/story/yung-filly-british-youtuber-and-rapper-denies-sexual-assault-charges-in-australia-13326313",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-yung-filly-crystal-palace_6712117.jpg?20241010091357",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-03-11 12:06:00",
        "Headline": "The social media personality, whose real name is Andres Felipe Valencia Barrientos, appears before Perth Magistrates' Court.",
        "Content": "British YouTuber and rapper Yung Filly has pleaded not guilty to multiple sexual assault charges in Australia. The internet personality, whose real name is Andres Felipe Valencia Barrientos, appeared before Perth Magistrates' Court on Tuesday. According to court documents, he pleaded not guilty to three counts of assault occasioning bodily harm, one of strangulation and four counts of sexual penetration without consent. He will appear before the higher district court on 13 June. The 29-year-old has been on bail since October last year after he allegedly sexually assaulted a woman in her 20s in his hotel room, following a performance at a venue in a Perth suburb. The attack is alleged to have taken place on 28 September, when Barrientos was on tour. Read more from Sky News:Man Utd unveil plans to build UK's largest stadiumBritish backpacker being held in USBoohoo rebrands as Debenhams During a court hearing in October, Barrientos was granted bail with strict conditions and a personal undertaking of 100,000 Australian dollars (£52,000), alongside a surety of the same amount. According to court documents, Barrientos pleaded guilty to a reckless driving charge on 5 December. He was clocked driving at more than 96mph on the Roe Highway on 17 November. Barrientos rose to fame as a social media personality and rapper and has appeared on several BBC shows. He is known for working with Beta Squad - a YouTube collective. He has also featured on Soccer Aid and The Great Celebrity Bake Off For Stand Up To Cancer on Channel 4."
    }
]