[
    {
        "title": "UK special forces unit had 'deliberate policy' to 'kill fighting-aged males' in Afghanistan, inquiry told ",
        "description": "There was a \"deliberate policy\" to&#160;\"kill fighting-aged males... even when they did not pose a threat\" among some members of a British special forces unit in Afghanistan, an inquiry has heard.",
        "url": "https://news.sky.com/story/uk-special-forces-unit-had-deliberate-policy-to-kill-fighting-aged-males-in-afghanistan-inquiry-told-13477589",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-british-soldiers-afghanistan_5997562.jpg?20221215155151",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-30 17:34:00",
        "Headline": "A senior officer said he raised concerns with the director of UK special forces, but a \"conscious decision\" was made to cover it up.",
        "Content": " There was a \"deliberate policy\" to \"kill fighting-aged males... even when they did not pose a threat\" among some members of a British special forces unit in Afghanistan, an inquiry has heard. In a note dated 7 April 2011, a senior officer warned the director of UK special forces about the policy, sharing concerns from the unit's commanding officer. But the senior officer, codenamed N1466, said a \"conscious decision\" was made to cover up potential war crimes by the unit, dubbed UKSF1. The document was released by the Afghanistan Inquiry after evidence was given in closed hearings by UK special forces members. In the note, N1466 – who was assistant chief of staff for operations in UKSF headquarters – described what he'd heard from the unit's commanding officer. \"He felt that this was... possibly a deliberate policy among the current (sub-unit) to engage and kill fighting-aged males on target even when they did not pose a threat,\" the note read. \"He had been approached by some of his men who recounted separate conversations with (trained) members of UKSF1 in which such suggestions had been made.\" \n                  Man from Afghanistan appears in court charged with three sexual assaults in Southampton\n                 \n                  MoD hasn't done enough to prevent further data breaches following Afghan leak, MPs say\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 The note explained that the unit's commanding officer \"is sure that they are accurately reporting what they are hearing from colleagues\". And while N1466 conceded that the allegation could be simply a \"rumour\" or a \"wind up\", he said \"the context would not support either assertion\". 'Rumour could prove explosive' He continued: \"The very fact that this rumour is circulating is in itself distasteful and in my view unacceptable to UKSF ethos and UKSF dynamics - it could prove explosive. \"Clearly, if there is anything more than rumour behind it then elements of UKSF have strayed into indefensible ethical and legal behaviour.\" He concluded: \"My instinct is that this merits deeper investigation.\" However, the director, known to the inquiry as N1802, made a \"conscious decision\" to cover up potential war crimes, N1466 claimed. The senior officer further accused the director of controlling information about alleged murders \"in a way that I think indicated a desire to keep it low profile\". N1466 said he became concerned that data from deliberate detention operations (DDOs), including the number of weapons found compared with the number of enemies killed, \"didn't seem credible\". Read more:Ex-police chief condemns Afghanistan 'war crimes' probeEx-veterans minister gives Afghan killings inquiry 'further information.' The director shared his view, he believed, but chose to handle the information in a \"way which limited the spread of the damage outside the headquarters\". N1802 failed to \"ever talk about possible criminal activity\", the officer alleged, instead initiating a review of the tactics, techniques and procedures (TTPs) used by the sub-unit in question in April 2011. Review 'was a charade' In his witness statement, the officer recalled feeling that the TTP review was intended as a \"warning shot across the bows\" of the unit. But, he said, \"it was obvious that it was a charade\". \"I was sure at the time and I remain sure that N1802 knew what was happening on the ground,\" he said. \"The speed of N1802's response and the absence of any further mention or investigation of unlawful activity only fortified my belief that he was aware of what was going on.\" Among the documents released by the inquiry was a summary of an interview between N1466 and the Royal Military Police (RMP) in October 2018. During the exchange, the officer described an incident where members of UKSF1 went to clear a compound and found a room where people were hiding under a mosquito net. Claims incident was 'covered up' The document read: \"They did not reveal themselves, so the UKSF1 shot at the net until there was no movement. \"When the net was uncovered it was women and children. \"The incident was covered up and the individual who did the shooting was allegedly given some form of award to make it look legitimate.\" N1466 also told the inquiry why he was speaking out, saying \"it's not loyalty to your organisation to stand by and to watch it go down a sewer\". In his remarks, he referred to the alleged 2012 shooting of two children – Imran and Bilal, sons of Hussain Uzbakzai and his wife Ruqquia Haleem – who were in their beds. He said: \"I know a lot of my colleagues... didn't join UKSF for this sort of behaviour, you know, toddlers to get shot in their beds or random killing. \"It's not special, it's not elite, it's not what we stand for and most of us I don't believe would either wish to condone it or to cover it up.\" He added: \"Even if you subscribe to some sort of idea that most of the people who were killed were Taliban fighters, which I do not... Imran and Bilal, at one-and-a-half and three, certainly were not.\" Concluding, he said: \"UKSF units, not least UKSF1, stand out for their proud history; the courageous and extraordinary feats made by truly remarkable people. \"The activity that we have discussed in the last few days does not fit with that and somehow the amount of kills and the amount of trigger time have become the metric by which people judge themselves.\" News correspondent The testimony from N1466 was highly anticipated.  He was the assistant chief of staff for operations in UKSF headquarters; his testimony is crucial for any probe into whether UKSF had a pattern of killing in cold blood and whether the Royal Military Police covered it up.  But secrecy and ambiguity have plagued this inquiry, now in its third year.   Already, documents submitted to chair Sir Charles Haddon-Cave claim commanders defied an order to preserve computer evidence. Instead, an unknown quantity of data on the main computer server had been permanently deleted.  In 2023, the MoD and the RMP, which is accused of failing to investigate the unlawful killings claims, had sought sweeping restrictions over material submitted to the inquiry, citing national security and privacy. Sky News and a number of other media outlets challenged the application for restrictive orders, and the victims’ families argued such a “blanket” order was not compatible with open justice. So, we almost didn’t get to see the files released today. Even though there are few details and much of it is redacted, N1466’s testimony adds to growing allegations that British soldiers committed war crimes in Afghanistan and that officers and personnel at the MoD failed to adequately investigate the claims. In 2021, the UK enacted the Overseas Operations Act, which provides the Armed Forces with increased protection against legal scrutiny on overseas activities. It also introduced a presumption against prosecution for criminal offences five years after an alleged incident and a time limit on civil claims for torture and murder. Victims’ families may think justice is impossible.  The inquiry is under pressure to ensure truth isn’t. Afghan families claim UKSF conducted a \"campaign of murder\" against civilians, and that senior officers and personnel at the Ministry of Defence (MoD) \"sought to prevent adequate investigation\". Operation Northmoor, a £10m investigation set up in 2014 to examine allegations of executions by special forces, including those of children, resulted in no prosecutions. A RMP investigation, dubbed Operation Cestro, resulted in three soldiers being referred to the Service Prosecuting Authority, but again, none of them were prosecuted. An MoD spokesperson said: \"The government is fully committed to supporting the independent inquiry relating to Afghanistan as it continues its work, and we are hugely grateful to all former and current defence employees who have so far given evidence. \"We also remain committed to providing the support that our special forces deserve, whilst maintaining the transparency and accountability that the British people rightly expect from their armed forces. \"It is appropriate that we await the outcome of the inquiry's work before commenting further.\" The inquiry continues."
    },
    {
        "title": "'Of course I didn't' lie about budget forecasts, chancellor tells Sky News - as Badenoch calls for her to resign",
        "description": "The chancellor has insisted to Sky News that she did not lie to the public about the state of the public finances ahead of the budget.",
        "url": "https://news.sky.com/story/of-course-i-didnt-lie-about-state-of-public-finances-chancellor-rachel-reeves-insists-to-sky-news-13477380",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-trevor-phillips_7096309.jpg?20251130112033",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-30 08:27:00",
        "Headline": "The chancellor told Trevor Phillips that she was \"honest and frank\" with the country about the reasons tax rises were needed in the budget.",
        "Content": " The chancellor has insisted to Sky News that she did not lie to the public about the state of the public finances ahead of the budget. Rachel Reeves is facing widespread accusations that in a speech from Downing Street on 4 November in which she laid the groundwork for tax rises, she misled the country and led the public to believe the fiscal situation was worse than it actually was. Asked directly by Sky's Trevor Phillips if she lied, she said: \"Of course I didn't.\" Follow the latest updates from Westminster Ms Reeves said the decision by the independent Office for Budget Responsibility (OBR) to review and downgrade productivity meant the forecast for tax receipts was £16bn lower than expected. As a result, she said she needed tax rises to create more fiscal headroom (the amount by which government can increase spending or cut taxes without breaking its own fiscal rules) to reassure the financial markets and create stability in the economy. But the OBR has said it told the chancellor in its forecast on 31 October that there was a £4.2bn budget surplus, rather than a black hole following the productivity downgrade, and Trevor challenged her on why she did not say that to the nation and argue that more headroom was needed. \n                  Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances\n                 \n                  Reeves fighting claims she 'lied' about deficit - as Starmer set to back her budget\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 She replied: \"I said in that speech that I wanted to achieve three things in the budget - tackling the cost of living, which is why I took £150 off of energy bills and froze prescription charges and rail fares. \"I wanted to continue to cut NHS waiting lists, which is why I protected NHS spending. And I wanted to bring the debt and the borrowing down, which is one of the reasons why I increased the headroom. \"£4bn of headroom would not have been enough, and it would not give the Bank of England space to continue to cut interest rates.\" Ms Reeves also said: \"In the context of a downgrade in our productivity, which cost £16bn, I needed to increase taxes, and I was honest and frank about that in the speech that I gave at the beginning of November.\"  She confirmed that the prime minister was aware of the fiscal forecasts and what she was going to say in her speech on 4 November about the challenges facing the UK economy, saying: \"Keir [Starmer] and myself met regularly to discuss the budget and the choices, because these are the choices of this government. \"And I'm really proud of the choices that we made - to cut waiting lists, to cut inflation, and to build up that resilience in our economy.\"  Tax rises 'not on scale of last year' Following her budget last year, in which she raised taxes, the chancellor was explicit to Trevor that she would \"never need to do that again\" or \"come back for more\". But Ms Reeves did raise taxes by freezing income tax thresholds until 2031, and implementing a range of smaller tax rises totalling £26bn, so Trevor put to her that what she said last year was not true. She replied: \"The budget this year was not on the scale of the one last year, but as I set out in my speech at the beginning of November, the context for this budget did change and I did have to ask people to contribute more.\" 👉 Listen to Sky News Daily on your podcast app 👈 She conceded that it is \"true\" that she said she wouldn't have to raise taxes, and has now done so, but said it was \"for reasons not in my control\", pointing to the OBR's decision to conduct a productivity review. But Conservative leader Kemi Badenoch hit out at the chancellor's handling of the economy, telling Trevor: \"I think the chancellor has been doing a terrible job. She's made a mess of the economy, and [...] she has told lies. This is a woman who, in my view, should be resigning.\"  'I am choosing children' Ms Reeves also told Trevor that she is \"proud to be the chancellor that lifts half a million kids out of poverty\" through her decision to lift the two-child cap on benefits from April, which was brought in by the Conservatives in 2017 and meant parents could only claim universal credit or tax credits for their first two children. Trevor put to her polling that shows that while 84% of Labour members are in favour of scrapping the cap, just 37% of those who voted Labour in 2024 think it should be scrapped. And asked if she is choosing party over country, the chancellor replied: \"I am choosing children, Trevor. This lifts more than half a million children out of poverty, combined with our changes on free breakfast clubs, extending free school meals, 30 hours [of] free childcare for working parents of pre-school age children. \"You can put up those percentages, but the people I was thinking about were kids who I know in my constituency, who go to school hungry and go to bed in cold and damp homes. And from April next year, those parents will have a bit more support to help their kids.\" Political correspondent It’s a common characterisation of Rachel Reeves that she is a chancellor who has been dealt a bad hand but has played it poorly. The great irony of this budget is that we now know the government was dealt a relatively reasonable hand but has still managed to make a bit of a mess. For months the messaging has been of a dire fiscal picture caused by events outside of the control of ministers that would necessitate a series of difficult choices (in other words, tax rises). In reality the situation was far more rosy, with the productivity downgrade more than outweighed by a higher-than-expected tax take. Rachel Reeves was faced with those contradictions today and struggled to reach for a convincing explanation. This matters because businesses and individuals respond to the mood music coming from Downing Street. Investments may be postponed and assets moved. That has a human impact. But it also influences the economy. Then there’s the political impact. Once again, the government looked to be responding to events and behaving tactically rather than owning their decisions and defending their choices. Labour MPs were generally happy with the measures in the budget, but these political missteps may darken their mood once more. The bigger risk could be of voters – not for the first time – beginning to wonder if those at the top of the state really know what they are doing. Liberal Democrat deputy leader Daisy Cooper told Trevor that her party backs the decision, saying: \" First of all, we think it is morally the right thing to do. And secondly, because it saves money for the taxpayer in the longer term, because we know that children growing up in poverty end up costing the taxpayer more because they have worse health outcomes, worse educational outcomes as well.\" But she added that they are \"deeply concerned\" about \"this double whammy stealth tax on both households and on high streets\".  'We need growth in our economy' But the Tory leader hit out at the decision, telling Trevor that lifting the two-child benefit cap is \"not the way\" to lift children out of poverty, and saying that it means the government is \"taxing a lot of people who are struggling to pay for those on benefits\". Ms Badenoch said: \"About half a million families are going to be getting an uptick of about £5,000. Many other people don't have £5,000 lying around. \"We believe that people on benefits should have to make the same decisions about having children as everybody else. And remember, we're not talking about child benefits here. We're talking about the universal credit element of it. You get child benefit for as many children as you have. \"But at some point, someone needs to draw a line somewhere.\" Read more:Lammy says justice reforms will reduce victims' sufferingReeves accused of imposing 'stealth tax' on hospitality Ms Badenoch argued that the way to ensure children are not in poverty is to \"make sure that their parents have jobs and that those jobs pay well\", and said the level of unemployment has increased \"every single month\" since Labour came to office in July 2024. \"What we need is growth in our economy. Simply taking out from people who are struggling and giving to a different group of people is not making the economy better,\" she said."
    },
    {
        "title": "More than 600 dead in Indonesia and Thailand after floods and landslides - and Sri Lanka reporting more than 200 deaths from cyclone",
        "description": "The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone.",
        "url": "https://news.sky.com/story/more-than-600-dead-in-indonesia-and-thailand-after-floods-and-landslides-and-sri-lanka-reporting-more-than-200-deaths-from-cyclone-13477400",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tanah-datar-west-sumatra_7096282.jpg?20251130095938",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-30 09:45:00",
        "Headline": "A tropical storm that formed in the Malacca Strait has led to 435 deaths in Indonesia, 170 in southern Thailand, and three in Malaysia.",
        "Content": " The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone. Three people have also died in Malaysia, officials have said, due to the extreme weather in South Asia and Southeast Asia. In total, Indonesian officials said 442 people had died and Thai authorities reported 170 deaths in the southern part of the country, as of midday UK time on Sunday. Rescue efforts were ongoing throughout the day, with more than four million people affected - almost three million in Southern Thailand and 1.1 million in Western Indonesia - by the effects of a tropical storm formed in the Malacca Strait. Indonesian relief and rescue teams have used helicopters to deliver aid to people they could not access because of blocked roads on the western island of Sumatra. Many areas have been cut off, while damage to telecommunications infrastructure has hampered communications. Officials said on Saturday that they had received reports of people looting supply lines as they grow desperate for relief in other areas. Hat Yai, the largest city in Thailand's Songkhla province, received 335mm (13 inches) of rain on Friday last week, its highest single-day tally in 300 years. After days of rain, meteorological authorities in Malaysia lifted tropical storm and continuous rain warnings there yesterday, forecasting clear skies for most of the country. However, there are still about 18,700 people in evacuation centres, according to the country's national disaster management agency. Read more from Sky News:Surgeon may never face justice over 'botched' operationsWilliam 'moved' by severely ill Gazan children's courage More than 200 dead in Sri Lanka Across the Bay of Bengal, Sri Lanka's disaster management centre said in a situation report on Sunday that 212 people had died as a result of Cyclone Ditwah. Another 218 people have been recorded as missing across the South Asian country's 25 districts, and more than half a million people have been affected nationwide."
    },
    {
        "title": "Your Party founder Zarah Sultana hits out at party 'witch hunts' and 'bullying'",
        "description": "Zarah Sultana has hit out at the factionalism within Your Party that has been on stark display at its founding conference this weekend. She also slammed \"the sight of a Muslim woman being manhandled and dragged out of conference\".",
        "url": "https://news.sky.com/story/your-party-founder-zarah-sultana-hits-out-at-party-witch-hunts-and-bullying-13477496",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-zarah-sultana-your-party_7096554.jpg?20251130151429",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-30 15:07:00",
        "Headline": "The MP for Coventry South also slammed \"the sight of a Muslim woman being manhandled and dragged out\" of the party conference.",
        "Content": " Zarah Sultana has hit out at the factionalism within Your Party that has been on stark display at its founding conference this weekend. She also slammed \"the sight of a Muslim woman being manhandled and dragged out of conference\". Speaking on the main stage, the MP for Coventry South said there have been \"witch hunts\" and \"bullying\" at the top of the new left-wing party, and declared she \"will not stand for this\". But she also apologised for \"hiccups\" in the foundation of the party, admitting that some of it was her \"fault\". Jeremy Corbyn announced on Sunday that the party's name will remain Your Party, after a vote by members. Follow the latest updates from Westminster The conference in Liverpool has been marred by infighting and allegations of \"witch hunts\", with some members seemingly being expelled for belonging to the Socialist Workers Party. They were removed from the venue, leading to Ms Sultana boycotting the first day on Saturday. \n                  Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Sultana accused by Corbyn allies of encouraging 'ultra leftists' to disrupt Your Party conference\n                 But she attended on Sunday to give her speech from the main stage, and told the gathered members: \"Before we move forward, we have to confront what took place yesterday. \"The expulsions, the bans, the censorship on conference floor are unacceptable. It's undemocratic, it's an attack on members and this movement. \"And those decisions were made at the top, not by you.\" \"Many of those people expelled found out only after they had arrived in Liverpool. People who had travelled across the country, took time off work, booked hotels, spent hundreds of pounds that they could not easily spare, discovered at the door that they had been barred.\" She added: \"And the sight of a Muslim woman being manhandled and dragged out of conference is something that should shame any party that claims to stand for equality and justice. \"These actions come straight out of the Labour right's handbook, the same playbook we have all lived through for years - the witch hunts, the smears, the intimidation, the bullying, the legal threats and the leaks to the Murdoch press. \"Let me be absolutely clear, the members will not stand for this, the movement will not stand for this and I will not stand for this.\"  'I am sorry for the hiccups' Ms Sultana made these comments just a few metres from co-founder Jeremy Corbyn, who was sitting at a table on the stage. There have been allegations - denied by his spokesperson - that the Corbyn faction has been behind chaos. Ms Sultana later took some responsibility for the chaotic launch of the party, which assumedly included her announcing the party reportedly before Corbyn wanted her to, as well as the launch of her own membership portal that has led to difficulties around the transfer of member data to the one Mr Corbyn set up, as well as £800,000 in fees.  She said: \"You may have noticed that the process of starting up this party has had some hiccups. Some of that is my fault, and for that I am sorry. \"But I want you to know that my aim from the very start has been to ensure that this party is led by you, the members, and not MPs.\" She added: \"We have to get better at working with each other. We have to ensure that the best cure against any culture of backroom deals is people power and that's why I've been fighting for maximum member democracy.\" That reference to democracy was about a vote at the conference about whether the party should have a single leadership model, or a collective one. Members voted for a collective leadership model, by a margin of 51.6% to 48.4%, which is being seen as a blow to Mr Corbyn, but also avoids a battle between him and Ms Sultana. While the decision was celebrated by her, an ally of Mr Corbyn told our political reporter Faye Brown: \"People have voted against utilising the biggest asset the party had - Jeremy.\"  'Andrew is a parasite' In the rest of her speech, Ms Sultana hit many of the expected topics - supporting Palestine, demanding the severing of all ties with Israel, criticising wealthy people and the press, and calling for the monarchy to be abolished. She said: \"The same people who run Britain want you to believe that every refugee is a rapist while they grab £12m of taxpayers' money to protect a parasite called Andrew Mountbatten-Windsor.\" She added: \"What a sick society we live in, where our political and media class bend over backwards for the royal family, including Prince Andrew, close friends with notorious paedophile Jeffrey Epstein. \"That's our money that provided him housing, that's our money that defended him in court, that's our money that put food on his table. Well, not any more. \"We shouldn't just abolish Andrew's titles. We should abolish the monarchy itself.\" Read more:Your Party votes to be led by membersCorbyn declines to call Sultana a friend On Israel, the Coventry South MP declared to huge applause: \"I am an anti-Zionist and if we fight for it, Your Party will be an anti-Zionist party. We must sever all ties with the genocidal apartheid state of Israel. \"We must expel the ambassador and shut down the embassy, and stand with the Palestinian people until every inch of their land is free, from the river to the sea, a single democratic state with equal rights for all.\""
    },
    {
        "title": "Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances",
        "description": "Sir Keir Starmer will deliver a speech on Monday defending the decisions the government made in the budget, following criticisms of sweeping tax rises and accusations the chancellor lied to the country about the state of public finances.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-defend-budget-amid-claims-rachel-reeves-lied-about-public-finances-13477435",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-rachel-reeves_7096391.jpg?20251130132800",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-11-30 12:46:00",
        "Headline": "The prime minister will give a speech defending the budget amid claims the chancellor lied about the state of the public finances - he will also announce plans to bring in welfare reforms after a failed attempt earlier this year.",
        "Content": "Sir Keir Starmer will deliver a speech on Monday defending the decisions the government made in the budget, following criticisms of sweeping tax rises and accusations the chancellor lied to the country about the state of public finances. The prime minister is expected to set out how the budget, which saw £26bn of tax rises imposed across the economy, \"moves forward the government's programme of national renewal\", and set \"the right economic course\" for Britain, Downing Street says. He will also confirm that ministers will try again to reform the \"broken\" welfare system, after Labour MPs forced the government to U-turn on its plans to narrow the eligibility for Personal Independence Payments (PIP) earlier this year. 'Of course I didn't' lie about public finances, says Reeves \"We have to confront the reality that our welfare state is trapping people, not just in poverty, but out of work - young people especially. And that is a poverty of ambition,\" Sir Keir will say. \"And so while we will invest in apprenticeships and make sure every young person without a job has a guaranteed offer of training or work, we must also reform the welfare state itself - that is what renewal demands.\"  The prime minister will add: \"This is not about propping up a broken status quo. Nor is it because we want to look somehow politically 'tough'. The Tories played that game and the welfare bill went up by £88bn. They left children too poor to eat and young people too ill to work. A total failure.\" \n                  Reeves fighting claims she 'lied' about deficit - as Starmer set to back her budget\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 Instead, he will argue it is about \"potential\", saying: \"If you are ignored that early in your career, if you're not given the support you need to overcome your mental health issues, or if you are simply written off because you're neurodivergent or disabled, then it can trap you in a cycle of worklessness and dependency for decades, which costs the country money, is bad for our productivity, but most importantly of all - costs the country opportunity and potential. \"And any Labour Party worthy of the name cannot ignore that. That is why we have asked Alan Milburn on the whole issue of young people, inactivity and work. We need to remove the incentives which hold back the potential of our young people.\" The announcement will come after the Conservative opposition described the budget as one for \"benefits street\", following the chancellor's decision to lift the two-child benefit cap from April, at a cost of £3bn.  'Government must go further and faster on growth' The prime minister is also expected to launch a staunch defence of the budget overall, saying it will bear down on the cost of living through measures like money off energy bills and frozen rail fares; increase economic stability; and protect investment in public services and infrastructure that will drive economic growth. He will argue that \"economic growth is beating the forecasts\", but that the government must go \"further and faster\" to encourage it. He will also reiterate his vow to scrap regulation across the economy, which he will argue is not only pro-business, but also a way to deal with the cost of living.  \"Rooting out excessive costs in every corner of the economy is an essential step to lower the cost of living for good, as well as promoting more dynamic markets for business,\" the prime minister will say. He will confirm reforms to the building of nuclear power plants, after the government's nuclear regulatory taskforce found that \"pointless gold-plating, unnecessary red-tape and well-intentioned, but fundamentally misguided environmental regulation had made Britain the most expensive place to build nuclear power\". \"We urgently need to correct this,\" the prime minister will say. Business secretary Peter Kyle will be tasked with applying the same deregulatory approach to major infrastructure schemes and to accelerate the implementation of Labour's industrial strategy. In response, Tory shadow chancellor Sir Mel Stride said: \"It is frankly laughable to hear the prime minister say Rachel Reeves's Benefits Street budget has put the country on the right course and that he wants to fix the welfare system. \"His chancellor has just hiked taxes by £26bn to pay for a welfare splurge, penalising people who work hard and making them pay for those who don't work at all. And she misrepresented why she was doing it, claiming there was a fiscal black hole to fill that she knew didn't exist. \"Labour's leadership have repeatedly shown they lack the backbone to tackle welfare and instead are just acting to placate their left-wing backbenchers.\"  Chancellor accused of 'lying' Sir Mel is referring to the chancellor's speech on 4 November in which she laid the ground for tax rises due to the decision by the independent Office for Budget Responsibility (OBR) to review and downgrade productivity over recent years, at a cost of £16bn, which led to a black hole in the public finances. But the OBR revealed on Friday that it had told the Treasury days earlier that there was actually a budget surplus of £4.2bn, leading to outrage and claims that she misled the country about the state of the public finances. Rachel Reeves was asked directly by Sky's Trevor Phillips if she lied, and she replied: \"Of course I didn't.\"  She said: \"I said in that speech that I wanted to achieve three things in the budget - tackling the cost of living, which is why I took £150 off of energy bills and froze prescription charges and rail fares. \"I wanted to continue to cut NHS waiting lists, which is why I protected NHS spending. And I wanted to bring the debt and the borrowing down, which is one of the reasons why I increased the headroom. \"£4bn of headroom would not have been enough, and it would not give the Bank of England space to continue to cut interest rates.\" Ms Reeves also said: \"In the context of a downgrade in our productivity, which cost £16bn, I needed to increase taxes, and I was honest and frank about that in the speech that I gave at the beginning of November.\"  But Tory leader Kemi Badenoch said: \"I think the chancellor has been doing a terrible job. She's made a mess of the economy, and [...] she has told lies. This is a woman who, in my view, should be resigning.\" Report due on OBR breach The tumultuous run-up to the 26 November budget culminated in the OBR accidentally publishing its assessment of the chancellor's measures 45 minutes before the speech began, in what was an unprecedented breach of budget security. 👉 Listen to Sky News Daily on your podcast app 👈 The chair of the OBR, Richard Hughes, apologised for the \"error\", and announced an investigation into how it happened. The chancellor has said that she retains confidence in him, despite the \"serious breach of protocol\", and confirmed to Trevor that the investigation report will be delivered to her on Monday, although it is not clear when it will be published."
    },
    {
        "title": "UK special forces unit had 'deliberate policy' to 'kill fighting-aged males' in Afghanistan, inquiry told ",
        "description": "There was a \"deliberate policy\" to&#160;\"kill fighting-aged males... even when they did not pose a threat\" among some members of a British special forces unit in Afghanistan, an inquiry has heard.",
        "url": "https://news.sky.com/story/uk-special-forces-unit-had-deliberate-policy-to-kill-fighting-aged-males-in-afghanistan-inquiry-told-13477589",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-british-soldiers-afghanistan_5997562.jpg?20221215155151",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 17:34:00",
        "Headline": "A senior officer said he raised concerns with the director of UK special forces, but a \"conscious decision\" was made to cover it up.",
        "Content": " There was a \"deliberate policy\" to \"kill fighting-aged males... even when they did not pose a threat\" among some members of a British special forces unit in Afghanistan, an inquiry has heard. In a note dated 7 April 2011, a senior officer warned the director of UK special forces about the policy, sharing concerns from the unit's commanding officer. But the senior officer, codenamed N1466, said a \"conscious decision\" was made to cover up potential war crimes by the unit, dubbed UKSF1. The document was released by the Afghanistan Inquiry after evidence was given in closed hearings by UK special forces members. In the note, N1466 – who was assistant chief of staff for operations in UKSF headquarters – described what he'd heard from the unit's commanding officer. \"He felt that this was... possibly a deliberate policy among the current (sub-unit) to engage and kill fighting-aged males on target even when they did not pose a threat,\" the note read. \"He had been approached by some of his men who recounted separate conversations with (trained) members of UKSF1 in which such suggestions had been made.\" \n                  Man from Afghanistan appears in court charged with three sexual assaults in Southampton\n                 \n                  MoD hasn't done enough to prevent further data breaches following Afghan leak, MPs say\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 The note explained that the unit's commanding officer \"is sure that they are accurately reporting what they are hearing from colleagues\". And while N1466 conceded that the allegation could be simply a \"rumour\" or a \"wind up\", he said \"the context would not support either assertion\". 'Rumour could prove explosive' He continued: \"The very fact that this rumour is circulating is in itself distasteful and in my view unacceptable to UKSF ethos and UKSF dynamics - it could prove explosive. \"Clearly, if there is anything more than rumour behind it then elements of UKSF have strayed into indefensible ethical and legal behaviour.\" He concluded: \"My instinct is that this merits deeper investigation.\" However, the director, known to the inquiry as N1802, made a \"conscious decision\" to cover up potential war crimes, N1466 claimed. The senior officer further accused the director of controlling information about alleged murders \"in a way that I think indicated a desire to keep it low profile\". N1466 said he became concerned that data from deliberate detention operations (DDOs), including the number of weapons found compared with the number of enemies killed, \"didn't seem credible\". Read more:Ex-police chief condemns Afghanistan 'war crimes' probeEx-veterans minister gives Afghan killings inquiry 'further information.' The director shared his view, he believed, but chose to handle the information in a \"way which limited the spread of the damage outside the headquarters\". N1802 failed to \"ever talk about possible criminal activity\", the officer alleged, instead initiating a review of the tactics, techniques and procedures (TTPs) used by the sub-unit in question in April 2011. Review 'was a charade' In his witness statement, the officer recalled feeling that the TTP review was intended as a \"warning shot across the bows\" of the unit. But, he said, \"it was obvious that it was a charade\". \"I was sure at the time and I remain sure that N1802 knew what was happening on the ground,\" he said. \"The speed of N1802's response and the absence of any further mention or investigation of unlawful activity only fortified my belief that he was aware of what was going on.\" Among the documents released by the inquiry was a summary of an interview between N1466 and the Royal Military Police (RMP) in October 2018. During the exchange, the officer described an incident where members of UKSF1 went to clear a compound and found a room where people were hiding under a mosquito net. Claims incident was 'covered up' The document read: \"They did not reveal themselves, so the UKSF1 shot at the net until there was no movement. \"When the net was uncovered it was women and children. \"The incident was covered up and the individual who did the shooting was allegedly given some form of award to make it look legitimate.\" N1466 also told the inquiry why he was speaking out, saying \"it's not loyalty to your organisation to stand by and to watch it go down a sewer\". In his remarks, he referred to the alleged 2012 shooting of two children – Imran and Bilal, sons of Hussain Uzbakzai and his wife Ruqquia Haleem – who were in their beds. He said: \"I know a lot of my colleagues... didn't join UKSF for this sort of behaviour, you know, toddlers to get shot in their beds or random killing. \"It's not special, it's not elite, it's not what we stand for and most of us I don't believe would either wish to condone it or to cover it up.\" He added: \"Even if you subscribe to some sort of idea that most of the people who were killed were Taliban fighters, which I do not... Imran and Bilal, at one-and-a-half and three, certainly were not.\" Concluding, he said: \"UKSF units, not least UKSF1, stand out for their proud history; the courageous and extraordinary feats made by truly remarkable people. \"The activity that we have discussed in the last few days does not fit with that and somehow the amount of kills and the amount of trigger time have become the metric by which people judge themselves.\" News correspondent The testimony from N1466 was highly anticipated.  He was the assistant chief of staff for operations in UKSF headquarters; his testimony is crucial for any probe into whether UKSF had a pattern of killing in cold blood and whether the Royal Military Police covered it up.  But secrecy and ambiguity have plagued this inquiry, now in its third year.   Already, documents submitted to chair Sir Charles Haddon-Cave claim commanders defied an order to preserve computer evidence. Instead, an unknown quantity of data on the main computer server had been permanently deleted.  In 2023, the MoD and the RMP, which is accused of failing to investigate the unlawful killings claims, had sought sweeping restrictions over material submitted to the inquiry, citing national security and privacy. Sky News and a number of other media outlets challenged the application for restrictive orders, and the victims’ families argued such a “blanket” order was not compatible with open justice. So, we almost didn’t get to see the files released today. Even though there are few details and much of it is redacted, N1466’s testimony adds to growing allegations that British soldiers committed war crimes in Afghanistan and that officers and personnel at the MoD failed to adequately investigate the claims. In 2021, the UK enacted the Overseas Operations Act, which provides the Armed Forces with increased protection against legal scrutiny on overseas activities. It also introduced a presumption against prosecution for criminal offences five years after an alleged incident and a time limit on civil claims for torture and murder. Victims’ families may think justice is impossible.  The inquiry is under pressure to ensure truth isn’t. Afghan families claim UKSF conducted a \"campaign of murder\" against civilians, and that senior officers and personnel at the Ministry of Defence (MoD) \"sought to prevent adequate investigation\". Operation Northmoor, a £10m investigation set up in 2014 to examine allegations of executions by special forces, including those of children, resulted in no prosecutions. A RMP investigation, dubbed Operation Cestro, resulted in three soldiers being referred to the Service Prosecuting Authority, but again, none of them were prosecuted. An MoD spokesperson said: \"The government is fully committed to supporting the independent inquiry relating to Afghanistan as it continues its work, and we are hugely grateful to all former and current defence employees who have so far given evidence. \"We also remain committed to providing the support that our special forces deserve, whilst maintaining the transparency and accountability that the British people rightly expect from their armed forces. \"It is appropriate that we await the outcome of the inquiry's work before commenting further.\" The inquiry continues."
    },
    {
        "title": "'Of course I didn't' lie about budget forecasts, chancellor tells Sky News - as Badenoch calls for her to resign",
        "description": "The chancellor has insisted to Sky News that she did not lie to the public about the state of the public finances ahead of the budget.",
        "url": "https://news.sky.com/story/of-course-i-didnt-lie-about-state-of-public-finances-chancellor-rachel-reeves-insists-to-sky-news-13477380",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-trevor-phillips_7096309.jpg?20251130112033",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 08:27:00",
        "Headline": "The chancellor told Trevor Phillips that she was \"honest and frank\" with the country about the reasons tax rises were needed in the budget.",
        "Content": " The chancellor has insisted to Sky News that she did not lie to the public about the state of the public finances ahead of the budget. Rachel Reeves is facing widespread accusations that in a speech from Downing Street on 4 November in which she laid the groundwork for tax rises, she misled the country and led the public to believe the fiscal situation was worse than it actually was. Asked directly by Sky's Trevor Phillips if she lied, she said: \"Of course I didn't.\" Follow the latest updates from Westminster Ms Reeves said the decision by the independent Office for Budget Responsibility (OBR) to review and downgrade productivity meant the forecast for tax receipts was £16bn lower than expected. As a result, she said she needed tax rises to create more fiscal headroom (the amount by which government can increase spending or cut taxes without breaking its own fiscal rules) to reassure the financial markets and create stability in the economy. But the OBR has said it told the chancellor in its forecast on 31 October that there was a £4.2bn budget surplus, rather than a black hole following the productivity downgrade, and Trevor challenged her on why she did not say that to the nation and argue that more headroom was needed. \n                  Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances\n                 \n                  Reeves fighting claims she 'lied' about deficit - as Starmer set to back her budget\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 She replied: \"I said in that speech that I wanted to achieve three things in the budget - tackling the cost of living, which is why I took £150 off of energy bills and froze prescription charges and rail fares. \"I wanted to continue to cut NHS waiting lists, which is why I protected NHS spending. And I wanted to bring the debt and the borrowing down, which is one of the reasons why I increased the headroom. \"£4bn of headroom would not have been enough, and it would not give the Bank of England space to continue to cut interest rates.\" Ms Reeves also said: \"In the context of a downgrade in our productivity, which cost £16bn, I needed to increase taxes, and I was honest and frank about that in the speech that I gave at the beginning of November.\"  She confirmed that the prime minister was aware of the fiscal forecasts and what she was going to say in her speech on 4 November about the challenges facing the UK economy, saying: \"Keir [Starmer] and myself met regularly to discuss the budget and the choices, because these are the choices of this government. \"And I'm really proud of the choices that we made - to cut waiting lists, to cut inflation, and to build up that resilience in our economy.\"  Tax rises 'not on scale of last year' Following her budget last year, in which she raised taxes, the chancellor was explicit to Trevor that she would \"never need to do that again\" or \"come back for more\". But Ms Reeves did raise taxes by freezing income tax thresholds until 2031, and implementing a range of smaller tax rises totalling £26bn, so Trevor put to her that what she said last year was not true. She replied: \"The budget this year was not on the scale of the one last year, but as I set out in my speech at the beginning of November, the context for this budget did change and I did have to ask people to contribute more.\" 👉 Listen to Sky News Daily on your podcast app 👈 She conceded that it is \"true\" that she said she wouldn't have to raise taxes, and has now done so, but said it was \"for reasons not in my control\", pointing to the OBR's decision to conduct a productivity review. But Conservative leader Kemi Badenoch hit out at the chancellor's handling of the economy, telling Trevor: \"I think the chancellor has been doing a terrible job. She's made a mess of the economy, and [...] she has told lies. This is a woman who, in my view, should be resigning.\"  'I am choosing children' Ms Reeves also told Trevor that she is \"proud to be the chancellor that lifts half a million kids out of poverty\" through her decision to lift the two-child cap on benefits from April, which was brought in by the Conservatives in 2017 and meant parents could only claim universal credit or tax credits for their first two children. Trevor put to her polling that shows that while 84% of Labour members are in favour of scrapping the cap, just 37% of those who voted Labour in 2024 think it should be scrapped. And asked if she is choosing party over country, the chancellor replied: \"I am choosing children, Trevor. This lifts more than half a million children out of poverty, combined with our changes on free breakfast clubs, extending free school meals, 30 hours [of] free childcare for working parents of pre-school age children. \"You can put up those percentages, but the people I was thinking about were kids who I know in my constituency, who go to school hungry and go to bed in cold and damp homes. And from April next year, those parents will have a bit more support to help their kids.\" Political correspondent It’s a common characterisation of Rachel Reeves that she is a chancellor who has been dealt a bad hand but has played it poorly. The great irony of this budget is that we now know the government was dealt a relatively reasonable hand but has still managed to make a bit of a mess. For months the messaging has been of a dire fiscal picture caused by events outside of the control of ministers that would necessitate a series of difficult choices (in other words, tax rises). In reality the situation was far more rosy, with the productivity downgrade more than outweighed by a higher-than-expected tax take. Rachel Reeves was faced with those contradictions today and struggled to reach for a convincing explanation. This matters because businesses and individuals respond to the mood music coming from Downing Street. Investments may be postponed and assets moved. That has a human impact. But it also influences the economy. Then there’s the political impact. Once again, the government looked to be responding to events and behaving tactically rather than owning their decisions and defending their choices. Labour MPs were generally happy with the measures in the budget, but these political missteps may darken their mood once more. The bigger risk could be of voters – not for the first time – beginning to wonder if those at the top of the state really know what they are doing. Liberal Democrat deputy leader Daisy Cooper told Trevor that her party backs the decision, saying: \" First of all, we think it is morally the right thing to do. And secondly, because it saves money for the taxpayer in the longer term, because we know that children growing up in poverty end up costing the taxpayer more because they have worse health outcomes, worse educational outcomes as well.\" But she added that they are \"deeply concerned\" about \"this double whammy stealth tax on both households and on high streets\".  'We need growth in our economy' But the Tory leader hit out at the decision, telling Trevor that lifting the two-child benefit cap is \"not the way\" to lift children out of poverty, and saying that it means the government is \"taxing a lot of people who are struggling to pay for those on benefits\". Ms Badenoch said: \"About half a million families are going to be getting an uptick of about £5,000. Many other people don't have £5,000 lying around. \"We believe that people on benefits should have to make the same decisions about having children as everybody else. And remember, we're not talking about child benefits here. We're talking about the universal credit element of it. You get child benefit for as many children as you have. \"But at some point, someone needs to draw a line somewhere.\" Read more:Lammy says justice reforms will reduce victims' sufferingReeves accused of imposing 'stealth tax' on hospitality Ms Badenoch argued that the way to ensure children are not in poverty is to \"make sure that their parents have jobs and that those jobs pay well\", and said the level of unemployment has increased \"every single month\" since Labour came to office in July 2024. \"What we need is growth in our economy. Simply taking out from people who are struggling and giving to a different group of people is not making the economy better,\" she said."
    },
    {
        "title": "Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances",
        "description": "Sir Keir Starmer will deliver a speech on Monday defending the decisions the government made in the budget, following criticisms of sweeping tax rises and accusations the chancellor lied to the country about the state of public finances.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-defend-budget-amid-claims-rachel-reeves-lied-about-public-finances-13477435",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-rachel-reeves_7096391.jpg?20251130132800",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 12:46:00",
        "Headline": "The prime minister will give a speech defending the budget amid claims the chancellor lied about the state of the public finances - he will also announce plans to bring in welfare reforms after a failed attempt earlier this year.",
        "Content": "Sir Keir Starmer will deliver a speech on Monday defending the decisions the government made in the budget, following criticisms of sweeping tax rises and accusations the chancellor lied to the country about the state of public finances. The prime minister is expected to set out how the budget, which saw £26bn of tax rises imposed across the economy, \"moves forward the government's programme of national renewal\", and set \"the right economic course\" for Britain, Downing Street says. He will also confirm that ministers will try again to reform the \"broken\" welfare system, after Labour MPs forced the government to U-turn on its plans to narrow the eligibility for Personal Independence Payments (PIP) earlier this year. 'Of course I didn't' lie about public finances, says Reeves \"We have to confront the reality that our welfare state is trapping people, not just in poverty, but out of work - young people especially. And that is a poverty of ambition,\" Sir Keir will say. \"And so while we will invest in apprenticeships and make sure every young person without a job has a guaranteed offer of training or work, we must also reform the welfare state itself - that is what renewal demands.\"  The prime minister will add: \"This is not about propping up a broken status quo. Nor is it because we want to look somehow politically 'tough'. The Tories played that game and the welfare bill went up by £88bn. They left children too poor to eat and young people too ill to work. A total failure.\" \n                  Reeves fighting claims she 'lied' about deficit - as Starmer set to back her budget\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 Instead, he will argue it is about \"potential\", saying: \"If you are ignored that early in your career, if you're not given the support you need to overcome your mental health issues, or if you are simply written off because you're neurodivergent or disabled, then it can trap you in a cycle of worklessness and dependency for decades, which costs the country money, is bad for our productivity, but most importantly of all - costs the country opportunity and potential. \"And any Labour Party worthy of the name cannot ignore that. That is why we have asked Alan Milburn on the whole issue of young people, inactivity and work. We need to remove the incentives which hold back the potential of our young people.\" The announcement will come after the Conservative opposition described the budget as one for \"benefits street\", following the chancellor's decision to lift the two-child benefit cap from April, at a cost of £3bn.  'Government must go further and faster on growth' The prime minister is also expected to launch a staunch defence of the budget overall, saying it will bear down on the cost of living through measures like money off energy bills and frozen rail fares; increase economic stability; and protect investment in public services and infrastructure that will drive economic growth. He will argue that \"economic growth is beating the forecasts\", but that the government must go \"further and faster\" to encourage it. He will also reiterate his vow to scrap regulation across the economy, which he will argue is not only pro-business, but also a way to deal with the cost of living.  \"Rooting out excessive costs in every corner of the economy is an essential step to lower the cost of living for good, as well as promoting more dynamic markets for business,\" the prime minister will say. He will confirm reforms to the building of nuclear power plants, after the government's nuclear regulatory taskforce found that \"pointless gold-plating, unnecessary red-tape and well-intentioned, but fundamentally misguided environmental regulation had made Britain the most expensive place to build nuclear power\". \"We urgently need to correct this,\" the prime minister will say. Business secretary Peter Kyle will be tasked with applying the same deregulatory approach to major infrastructure schemes and to accelerate the implementation of Labour's industrial strategy. In response, Tory shadow chancellor Sir Mel Stride said: \"It is frankly laughable to hear the prime minister say Rachel Reeves's Benefits Street budget has put the country on the right course and that he wants to fix the welfare system. \"His chancellor has just hiked taxes by £26bn to pay for a welfare splurge, penalising people who work hard and making them pay for those who don't work at all. And she misrepresented why she was doing it, claiming there was a fiscal black hole to fill that she knew didn't exist. \"Labour's leadership have repeatedly shown they lack the backbone to tackle welfare and instead are just acting to placate their left-wing backbenchers.\"  Chancellor accused of 'lying' Sir Mel is referring to the chancellor's speech on 4 November in which she laid the ground for tax rises due to the decision by the independent Office for Budget Responsibility (OBR) to review and downgrade productivity over recent years, at a cost of £16bn, which led to a black hole in the public finances. But the OBR revealed on Friday that it had told the Treasury days earlier that there was actually a budget surplus of £4.2bn, leading to outrage and claims that she misled the country about the state of the public finances. Rachel Reeves was asked directly by Sky's Trevor Phillips if she lied, and she replied: \"Of course I didn't.\"  She said: \"I said in that speech that I wanted to achieve three things in the budget - tackling the cost of living, which is why I took £150 off of energy bills and froze prescription charges and rail fares. \"I wanted to continue to cut NHS waiting lists, which is why I protected NHS spending. And I wanted to bring the debt and the borrowing down, which is one of the reasons why I increased the headroom. \"£4bn of headroom would not have been enough, and it would not give the Bank of England space to continue to cut interest rates.\" Ms Reeves also said: \"In the context of a downgrade in our productivity, which cost £16bn, I needed to increase taxes, and I was honest and frank about that in the speech that I gave at the beginning of November.\"  But Tory leader Kemi Badenoch said: \"I think the chancellor has been doing a terrible job. She's made a mess of the economy, and [...] she has told lies. This is a woman who, in my view, should be resigning.\" Report due on OBR breach The tumultuous run-up to the 26 November budget culminated in the OBR accidentally publishing its assessment of the chancellor's measures 45 minutes before the speech began, in what was an unprecedented breach of budget security. 👉 Listen to Sky News Daily on your podcast app 👈 The chair of the OBR, Richard Hughes, apologised for the \"error\", and announced an investigation into how it happened. The chancellor has said that she retains confidence in him, despite the \"serious breach of protocol\", and confirmed to Trevor that the investigation report will be delivered to her on Monday, although it is not clear when it will be published."
    },
    {
        "title": "Former West Ham captain and manager Billy Bonds dies aged 79",
        "description": "Former West Ham captain and manager Billy Bonds has died at the age of 79, his family has said.",
        "url": "https://news.sky.com/story/former-west-ham-captain-and-manager-billy-bonds-dies-aged-79-13477450",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-billy-bonds-former-player_7096499.jpg?20251130144753",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 13:50:00",
        "Headline": "Bonds captained the east London side to FA Cup victories in 1975 and 1980, and also managed them from 1990 to 1994.",
        "Content": "Former West Ham captain and manager Billy Bonds has died at the age of 79, his family has said. The defender and midfielder, who played 799 games for the Hammers between 1967 and 1988, holds the club's all-time record for most appearances. As well as captaining the east London side to FA Cup victories in 1975 and 1980, he also managed them from 1990 to 1994. During his tenure, the club was promoted to England's top division, relegated, and then promoted again. In a statement on West Ham's website, his family paid tribute, saying: \"We are heartbroken to announce that we lost our beloved Dad today. \"He was devoted to his family and was the most kind, loyal, selfless, and loving person. \"Dad loved West Ham United and its wonderful supporters with all his heart and treasured every moment of his time at the club.\" \n                  Twenty-two stadiums and 4.5 million tickets - home nations submit bid for 2035 Women's World Cup\n                 \n                  Female stars may leave sport unless tech giants clamp down on online abuse, Ofcom warns\n                 \n                  Man who struck and disfigured Aberdeen player with seat could face jail time\n                 West Ham gave Bonds a show of appreciation before Sunday's Premier League home game against Liverpool, with fans participating in a minute of applause. Captain Jarrod Bowen, who held Bonds' number four shirt aloft throughout, spoke about the legacy of his predecessor before the opening whistle. “He's probably going to go down as West Ham's biggest legend and the best club captain they've had,\" he said. \"He achieved so much here and I’ll never emulate that success, but to put on the captain’s armband like he did is a big thing for me.” Head coach Nuno Espírito Santo added: \"He represents everything that West Ham is all about – the fight, the desire. “My thoughts are with his family and with our fans, and let’s use this moment to honour Billy Bonds.” On its website, West Ham described Bonds as \"an extremely private and loyal man\" who was \"completely devoted to his family\". The club said he was \"never one to crave the limelight,\" but was \"universally loved, respected and admired by his team-mates, players and supporters\". West Ham also offered its condolences to Bonds' daughters, Claire and Katie, and granddaughters, Eloise and Elissa. \"Rest in peace Billy, our courageous, inspirational, lion-hearted leader,\" their statement concluded. Charlton Athletic, where the footballer got his start in 1964, also offered its condolences. Posting on X, the club wrote: \"We are deeply saddened to learn of the passing of former player Billy Bonds MBE. \"Our thoughts are with Billy's family and friends at this extremely difficult time.\" Bonds was born in Woolwich on 17 September, 1946, to football fans Arthur and Barbara, both Charlton supporters. He had a variety of jobs as a young man, working in a propeller factory, cleaning windows with his dad, and sweeping the terraces at The Valley. But his true calling was on the field and he would join Charlton as a teenager. As a teacher at Eltham Green Comprehensive School would tell him: \"Your brains, Bonds, are all in your feet.\" The footballer had honed his skills playing in the street and he competed for his school district and a Sunday-morning side, Moatbridge. In 1960, he and his Moatbridge teammates were presented with winners' trophies by another West Ham legend, Bobby Moore. Bonds recalled: \"Being a Charlton fan, I knew that the blond, well-built fella sitting up there was a West Ham player but I didn’t really know any more than that.\" Seven years later, they would be teammates. He would take West Ham's first-ever Lifetime Achievement award in 2013, and was voted as the club's greatest ever player in 2018. Bonds was appointed an MBE (Member of the Order of the British Empire) in January 1988. He would say afterwards: \"A lot more people have done much more valuable things than play football but I’m very proud of that medal.\" The east stand at West Ham's London Stadium home was named in his honour in 2019. He used the occasion to reflect on his career. He said: \"I would’ve happily played down the local park for nothing. \"But I was fortunate enough to get paid to be a footballer and, trust me, realise just how lucky I’ve been to have had such a fantastic career.\""
    },
    {
        "title": "Your Party founder Zarah Sultana hits out at party 'witch hunts' and 'bullying'",
        "description": "Zarah Sultana has hit out at the factionalism within Your Party that has been on stark display at its founding conference this weekend. She also slammed \"the sight of a Muslim woman being manhandled and dragged out of conference\".",
        "url": "https://news.sky.com/story/your-party-founder-zarah-sultana-hits-out-at-party-witch-hunts-and-bullying-13477496",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-zarah-sultana-your-party_7096554.jpg?20251130151429",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 15:07:00",
        "Headline": "The MP for Coventry South also slammed \"the sight of a Muslim woman being manhandled and dragged out\" of the party conference.",
        "Content": " Zarah Sultana has hit out at the factionalism within Your Party that has been on stark display at its founding conference this weekend. She also slammed \"the sight of a Muslim woman being manhandled and dragged out of conference\". Speaking on the main stage, the MP for Coventry South said there have been \"witch hunts\" and \"bullying\" at the top of the new left-wing party, and declared she \"will not stand for this\". But she also apologised for \"hiccups\" in the foundation of the party, admitting that some of it was her \"fault\". Jeremy Corbyn announced on Sunday that the party's name will remain Your Party, after a vote by members. Follow the latest updates from Westminster The conference in Liverpool has been marred by infighting and allegations of \"witch hunts\", with some members seemingly being expelled for belonging to the Socialist Workers Party. They were removed from the venue, leading to Ms Sultana boycotting the first day on Saturday. \n                  Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Sultana accused by Corbyn allies of encouraging 'ultra leftists' to disrupt Your Party conference\n                 But she attended on Sunday to give her speech from the main stage, and told the gathered members: \"Before we move forward, we have to confront what took place yesterday. \"The expulsions, the bans, the censorship on conference floor are unacceptable. It's undemocratic, it's an attack on members and this movement. \"And those decisions were made at the top, not by you.\" \"Many of those people expelled found out only after they had arrived in Liverpool. People who had travelled across the country, took time off work, booked hotels, spent hundreds of pounds that they could not easily spare, discovered at the door that they had been barred.\" She added: \"And the sight of a Muslim woman being manhandled and dragged out of conference is something that should shame any party that claims to stand for equality and justice. \"These actions come straight out of the Labour right's handbook, the same playbook we have all lived through for years - the witch hunts, the smears, the intimidation, the bullying, the legal threats and the leaks to the Murdoch press. \"Let me be absolutely clear, the members will not stand for this, the movement will not stand for this and I will not stand for this.\"  'I am sorry for the hiccups' Ms Sultana made these comments just a few metres from co-founder Jeremy Corbyn, who was sitting at a table on the stage. There have been allegations - denied by his spokesperson - that the Corbyn faction has been behind chaos. Ms Sultana later took some responsibility for the chaotic launch of the party, which assumedly included her announcing the party reportedly before Corbyn wanted her to, as well as the launch of her own membership portal that has led to difficulties around the transfer of member data to the one Mr Corbyn set up, as well as £800,000 in fees.  She said: \"You may have noticed that the process of starting up this party has had some hiccups. Some of that is my fault, and for that I am sorry. \"But I want you to know that my aim from the very start has been to ensure that this party is led by you, the members, and not MPs.\" She added: \"We have to get better at working with each other. We have to ensure that the best cure against any culture of backroom deals is people power and that's why I've been fighting for maximum member democracy.\" That reference to democracy was about a vote at the conference about whether the party should have a single leadership model, or a collective one. Members voted for a collective leadership model, by a margin of 51.6% to 48.4%, which is being seen as a blow to Mr Corbyn, but also avoids a battle between him and Ms Sultana. While the decision was celebrated by her, an ally of Mr Corbyn told our political reporter Faye Brown: \"People have voted against utilising the biggest asset the party had - Jeremy.\"  'Andrew is a parasite' In the rest of her speech, Ms Sultana hit many of the expected topics - supporting Palestine, demanding the severing of all ties with Israel, criticising wealthy people and the press, and calling for the monarchy to be abolished. She said: \"The same people who run Britain want you to believe that every refugee is a rapist while they grab £12m of taxpayers' money to protect a parasite called Andrew Mountbatten-Windsor.\" She added: \"What a sick society we live in, where our political and media class bend over backwards for the royal family, including Prince Andrew, close friends with notorious paedophile Jeffrey Epstein. \"That's our money that provided him housing, that's our money that defended him in court, that's our money that put food on his table. Well, not any more. \"We shouldn't just abolish Andrew's titles. We should abolish the monarchy itself.\" Read more:Your Party votes to be led by membersCorbyn declines to call Sultana a friend On Israel, the Coventry South MP declared to huge applause: \"I am an anti-Zionist and if we fight for it, Your Party will be an anti-Zionist party. We must sever all ties with the genocidal apartheid state of Israel. \"We must expel the ambassador and shut down the embassy, and stand with the Palestinian people until every inch of their land is free, from the river to the sea, a single democratic state with equal rights for all.\""
    },
    {
        "title": "Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference",
        "description": "Anyone playing bingo with the left-wing lexicon would have been sure of a fully marked-off card by the close of Your Party's founding conference on the banks of the Mersey.",
        "url": "https://news.sky.com/story/your-party-old-infighting-habits-die-hard-at-new-left-wing-partys-acrimonious-liverpool-conference-13477626",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-your-party-zarah-sultana_7096929.jpg?20251130184424",
        "type": "UK",
        "Author": "Rob Powell",
        "Date Published": "2025-11-30 18:20:00",
        "Headline": "With its two figureheads seemingly at odds, the party's founding conference featured dated behaviour and predictable positional tensions, which nonetheless made for compelling political theatre.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Anyone playing bingo with the left-wing lexicon would have been sure of a fully marked-off card by the close of Your Party's founding conference on the banks of the Mersey. Witch hunt - check. Sabotage and intimidation - check. Faceless unelected bureaucrats - HOUSE!  Bonus points were also on offer if you spotted the right-wing newspaper reporter forced to hang around outside the conference after a mysterious and unfixable error with his accreditation stopped him from accessing the venue. For a party painting itself as the face of the new left, there was plenty of dated behaviour during this two-day jamboree. A gauntlet of leafleters awaited all attendees from an extensive range of left-wing organisations. Your correspondent ended the gathering with literature from (deep breath) - the Revolutionary Communist Group, the Socialist Workers Party, the Socialist Unity Platform, the Socialist Equality Party, the Democratic Socialists, the Democratic Bloc, the Spartacist League, Workers Hammer, the Weekly Worker and, of course, the Morning Star. Tensions make compelling politics \n                  Your Party founder Zarah Sultana hits out at party 'witch hunts' and 'bullying'\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Sultana accused by Corbyn allies of encouraging 'ultra leftists' to disrupt Your Party conference\n                 This plethora of groupings led to some predictable positional tensions. At one point the Democratic Socialists - who had already split from the more formal Your Party grouping to align with Zarah Sultana's supporters - then split again, this time from Team Sultana, and called for members to reject the founding constitution and political statement that they had spent the past 24 hours trying to amend, only to then pivot one more time and encourage their base to vote in favour.  So - beyond the fact that this has been incredibly compelling politics - why do I relay all this to you? Well, it's because Your Party's analysis of its reason for being is a good one. A threat to Labour? There is political space for a new left-wing force that could inflict severe damage to Labour at the ballot box. But based on events this weekend, I can't say with confidence that force will be Your Party. There is obviously a huge amount of tension between the two most high-profile politicians in the party. Zarah Sultana spent much of the weekend directly accusing figures around Jeremy Corbyn of trying to drum out some of her supporters, even going as far as boycotting the first day of her own conference in protest at expulsions carried out on the eve of the event.  The Coventry South MP did insist the pair were friends, saying, \"Jeremy came to my wedding.\" 'We're colleagues' But the former Labour leader seemed less sure. When asked the same question, he simply and - somewhat brutally - said \"we're colleagues\". As for where this goes now, the party is about to begin a process not of electing a leader, but a leadership committee - chaired by a rank-and-file member with four spots reserved for MPs and councillors. The idea is to hand more power over policy-making and whipping to the grassroots. The risk is that this new structure just becomes another venue for further falling out. If a camel is a horse designed by committee, could this \"pioneering\" leadership structure end up pleasing no one and angering everyone? This all matters more because the same 'modern left' electoral arena these guys are trying to occupy already has a new kid on the block in the slickly communicated and comparatively collegiate Green Party. Read more from Sky News:Why all the tension in Your Party?Committee to lead Your Party Many members in Liverpool spoke highly of Zack Polanski, with senior party figures and supporters alike open to the idea of exploring electoral pacts on a constituency-by-constituency basis. It's in this broader concept of a progressive alliance that Your Party's future may realistically lie in the long run. For as much as the comrades on the Mersey raged at Sir Keir Starmer, would they really let Nigel Farage slope into Downing Street in order to lash out at Labour? Maybe. Maybe not. Internecine warfare can come naturally to the left. And as we've learnt in Liverpool this weekend, old habits die hard."
    },
    {
        "title": "British Independent Film Awards winners revealed",
        "description": "Biker romance Pillion has picked up the top prize at the British Independent Film Awards.",
        "url": "https://news.sky.com/story/british-independent-film-awards-winners-revealed-13477464",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pillion-alexander-skarsgard_7096457.jpg?20251130143258",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 22:15:00",
        "Headline": "Pillion, The Ballad Of Wallis Island and My Father's Shadow were among the big winners at this year's BIFA ceremony in London.",
        "Content": "Biker romance Pillion has picked up the top prize at the British Independent Film Awards. The film's first-time feature writer and director Harry Lighton was also named best debut screenwriter at the ceremony, held at the Roundhouse in Camden, London, on Sunday evening. Starring Harry Melling as sweet and timid Colin, and Alexander Skarsgard as rugged biker Ray, the film picked up four prizes in total - including craft wins for best costume design and make-up and hair. Tom Basden and Tim Key took home the BIFA awards for best joint lead performance and best screenplay, for their debut feature The Ballad Of Wallis Island. Also starring Carey Mulligan, the film tells the story of a faded folk musician and his former partner who reluctantly reunite for an eccentric fan. Elsewhere in the acting categories, Robert Aramayo was honoured with the best lead performance award for his portrayal of Tourette's campaigner John Davison in I Swear, with the supporting performance award going to Jay Lycurgo for his role in pressure-cooker school drama Steve, also starring Oscar-winner Cillian Murphy. Newcomer Posy Sterling's portrayal of a mother fighting for custody of her children in Lollipop earned her the breakthrough performance award, while the best ensemble performance prize went to the cast of Warfare - including Will Poulter, Kit Connor, Joseph Quinn and Charles Melton. This year's ceremony also celebrated cinema itself, with the inaugural cinema of the year award going to The Magic Lantern Cinema in the Welsh coastal town of Tywyn. The BIFA for best international independent film was awarded to Sentimental Value, Joachim Trier's intimate exploration of family, memories and the reconciliatory power of art. Behind the camera, Akinola Davies Jr was named best director for his debut feature My Father's Shadow, a story of two brothers who first come to understand their father at a pivotal moment in both his life and Nigerian history, while The Douglas Hickox Award for best debut director went to Cal McMau for prison drama Wasteman. And in the documentary categories, Myrid Carten's exploration of mental health and addiction within her family, A Want In Her, picked up three BIFAs - best feature documentary, The Raindance Maverick Award, and best debut director for a feature documentary. Elsewhere, Emily Watson, star of films including Gosford Park, Punch-Drunk Love and War Horse, and TV series including Chernobyl and Dune: Prophecy, was awarded the outstanding contribution to British film prize. Production company Warp Films - behind films such as Dead Man's Shoes and This Is England, as well as the recent critically acclaimed series Adolescence - was honoured with the BIFA special jury prize for its \"unflinching and uncompromising\" commitment to telling \"raw and relevant stories\". Read more from Sky News entertainment:King pays tribute following death of Tom StoppardAI actress creator insists she's not out to steal jobs Founded in 1998, the BIFAs aim to celebrate, promote and support talent and creativity in British independent film. Previous winners of the best independent film award include Kneecap, the semi-autobiographical story of Irish-language rappers Kneecap, and Oscar winner The Favourite. This year's ceremony was hosted by comedians Lou Sanders and Harriet Kemsley, with Carey Mulligan, Stephen Merchant, Ruth Wilson, Billy Crudup and Celia Imrie among the star presenters."
    },
    {
        "title": "Prince William visits severely ill children evacuated to UK from Gaza",
        "description": "Prince William has visited severely ill Gazan children being treated by the NHS after they were evacuated to the UK.",
        "url": "https://news.sky.com/story/prince-william-visits-severely-ill-children-evacuated-to-uk-from-gaza-13477372",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-prince-william-gunnersbury-park_7096198.jpg?20251130080614",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-11-30 07:47:00",
        "Headline": "Fifty children and their immediate families had been brought to the UK as of 21 November, the Department of Health and Social Care confirmed.",
        "Content": "Prince William has visited severely ill Gazan children being treated by the NHS after they were evacuated to the UK. He was \"moved by the courage\" they showed after enduring experiencing things \"no child should ever face\", Kensington Palace said. In May, two children from Gaza became the first to travel to the UK for specialist medical care. Work to begin further evacuations for NHS specialist treatment started in the autumn. Fifty children and their immediate families had been brought to the UK as of 21 November, the Department of Health and Social Care (DHSC) confirmed. \"Recently His Royal Highness the Prince of Wales met a small number of children from Gaza who are currently receiving specialist care in the UK,\" a Kensington Palace spokesperson said. \"The prince wished to offer a moment of comfort to these young people who have endured experiences no child should ever face.\" William also wanted to offer \"his heartfelt gratitude to the NHS teams providing exceptional care during such a profoundly difficult time\", the statement added. \"His Royal Highness was moved by the courage shown by the children and their families and by the dedication of the team who are supporting them with such professionalism and humanity.\" In 2018, the prince visited a Palestinian refugee camp in the West Bank, becoming the first member of the Royal Family to make an official trip to the area. Read more:Hong Kong mourns those lost in fireSurgeon may never face justice over 'botched' operations A government spokesperson said 50 patients and their immediate family members \"are now receiving care in surroundings that are safe and welcoming\". Their statement continued: \"Following the ceasefire, now is the time to scale-up aid and ensure much-needed medicines and medical supplies are getting into Gaza, so that families can access the healthcare they need. \"We stand ready to continue to provide health-related support to the people of Gaza.\" Earlier this year, William paid tribute to humanitarian workers during a visit to Gunnersbury Park, west London, for the launch of the first global memorial for humanitarian workers. \"We are witnesses to the appalling suffering of those who are victims of war and violence; from Ukraine to Sudan, from Myanmar to Haiti and, indeed, throughout much of the Middle East. And, alas, in so many other places,\" he said. \"Yet, the presence of humanitarian aid workers, like those in Gaza, runs like a thread of shared humanity through even the grimmest of environments.\""
    },
    {
        "title": "More than 600 dead in Indonesia and Thailand after floods and landslides - and Sri Lanka reporting more than 200 deaths from cyclone",
        "description": "The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone.",
        "url": "https://news.sky.com/story/more-than-600-dead-in-indonesia-and-thailand-after-floods-and-landslides-and-sri-lanka-reporting-more-than-200-deaths-from-cyclone-13477400",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tanah-datar-west-sumatra_7096282.jpg?20251130095938",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-30 09:45:00",
        "Headline": "A tropical storm that formed in the Malacca Strait has led to 435 deaths in Indonesia, 170 in southern Thailand, and three in Malaysia.",
        "Content": " The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone. Three people have also died in Malaysia, officials have said, due to the extreme weather in South Asia and Southeast Asia. In total, Indonesian officials said 442 people had died and Thai authorities reported 170 deaths in the southern part of the country, as of midday UK time on Sunday. Rescue efforts were ongoing throughout the day, with more than four million people affected - almost three million in Southern Thailand and 1.1 million in Western Indonesia - by the effects of a tropical storm formed in the Malacca Strait. Indonesian relief and rescue teams have used helicopters to deliver aid to people they could not access because of blocked roads on the western island of Sumatra. Many areas have been cut off, while damage to telecommunications infrastructure has hampered communications. Officials said on Saturday that they had received reports of people looting supply lines as they grow desperate for relief in other areas. Hat Yai, the largest city in Thailand's Songkhla province, received 335mm (13 inches) of rain on Friday last week, its highest single-day tally in 300 years. After days of rain, meteorological authorities in Malaysia lifted tropical storm and continuous rain warnings there yesterday, forecasting clear skies for most of the country. However, there are still about 18,700 people in evacuation centres, according to the country's national disaster management agency. Read more from Sky News:Surgeon may never face justice over 'botched' operationsWilliam 'moved' by severely ill Gazan children's courage More than 200 dead in Sri Lanka Across the Bay of Bengal, Sri Lanka's disaster management centre said in a situation report on Sunday that 212 people had died as a result of Cyclone Ditwah. Another 218 people have been recorded as missing across the South Asian country's 25 districts, and more than half a million people have been affected nationwide."
    },
    {
        "title": "UK special forces unit had 'deliberate policy' to 'kill fighting-aged males' in Afghanistan, inquiry told ",
        "description": "There was a \"deliberate policy\" to&#160;\"kill fighting-aged males... even when they did not pose a threat\" among some members of a British special forces unit in Afghanistan, an inquiry has heard.",
        "url": "https://news.sky.com/story/uk-special-forces-unit-had-deliberate-policy-to-kill-fighting-aged-males-in-afghanistan-inquiry-told-13477589",
        "image_url": "https://e3.365dm.com/22/12/1920x1080/skynews-british-soldiers-afghanistan_5997562.jpg?20221215155151",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-30 17:34:00",
        "Headline": "A senior officer said he raised concerns with the director of UK special forces, but a \"conscious decision\" was made to cover it up.",
        "Content": " There was a \"deliberate policy\" to \"kill fighting-aged males... even when they did not pose a threat\" among some members of a British special forces unit in Afghanistan, an inquiry has heard. In a note dated 7 April 2011, a senior officer warned the director of UK special forces about the policy, sharing concerns from the unit's commanding officer. But the senior officer, codenamed N1466, said a \"conscious decision\" was made to cover up potential war crimes by the unit, dubbed UKSF1. The document was released by the Afghanistan Inquiry after evidence was given in closed hearings by UK special forces members. In the note, N1466 – who was assistant chief of staff for operations in UKSF headquarters – described what he'd heard from the unit's commanding officer. \"He felt that this was... possibly a deliberate policy among the current (sub-unit) to engage and kill fighting-aged males on target even when they did not pose a threat,\" the note read. \"He had been approached by some of his men who recounted separate conversations with (trained) members of UKSF1 in which such suggestions had been made.\" \n                  Man from Afghanistan appears in court charged with three sexual assaults in Southampton\n                 \n                  MoD hasn't done enough to prevent further data breaches following Afghan leak, MPs say\n                 \n                  At least 20 dead and 150 injured after magnitude 6.3 earthquake in north Afghanistan\n                 The note explained that the unit's commanding officer \"is sure that they are accurately reporting what they are hearing from colleagues\". And while N1466 conceded that the allegation could be simply a \"rumour\" or a \"wind up\", he said \"the context would not support either assertion\". 'Rumour could prove explosive' He continued: \"The very fact that this rumour is circulating is in itself distasteful and in my view unacceptable to UKSF ethos and UKSF dynamics - it could prove explosive. \"Clearly, if there is anything more than rumour behind it then elements of UKSF have strayed into indefensible ethical and legal behaviour.\" He concluded: \"My instinct is that this merits deeper investigation.\" However, the director, known to the inquiry as N1802, made a \"conscious decision\" to cover up potential war crimes, N1466 claimed. The senior officer further accused the director of controlling information about alleged murders \"in a way that I think indicated a desire to keep it low profile\". N1466 said he became concerned that data from deliberate detention operations (DDOs), including the number of weapons found compared with the number of enemies killed, \"didn't seem credible\". Read more:Ex-police chief condemns Afghanistan 'war crimes' probeEx-veterans minister gives Afghan killings inquiry 'further information.' The director shared his view, he believed, but chose to handle the information in a \"way which limited the spread of the damage outside the headquarters\". N1802 failed to \"ever talk about possible criminal activity\", the officer alleged, instead initiating a review of the tactics, techniques and procedures (TTPs) used by the sub-unit in question in April 2011. Review 'was a charade' In his witness statement, the officer recalled feeling that the TTP review was intended as a \"warning shot across the bows\" of the unit. But, he said, \"it was obvious that it was a charade\". \"I was sure at the time and I remain sure that N1802 knew what was happening on the ground,\" he said. \"The speed of N1802's response and the absence of any further mention or investigation of unlawful activity only fortified my belief that he was aware of what was going on.\" Among the documents released by the inquiry was a summary of an interview between N1466 and the Royal Military Police (RMP) in October 2018. During the exchange, the officer described an incident where members of UKSF1 went to clear a compound and found a room where people were hiding under a mosquito net. Claims incident was 'covered up' The document read: \"They did not reveal themselves, so the UKSF1 shot at the net until there was no movement. \"When the net was uncovered it was women and children. \"The incident was covered up and the individual who did the shooting was allegedly given some form of award to make it look legitimate.\" N1466 also told the inquiry why he was speaking out, saying \"it's not loyalty to your organisation to stand by and to watch it go down a sewer\". In his remarks, he referred to the alleged 2012 shooting of two children – Imran and Bilal, sons of Hussain Uzbakzai and his wife Ruqquia Haleem – who were in their beds. He said: \"I know a lot of my colleagues... didn't join UKSF for this sort of behaviour, you know, toddlers to get shot in their beds or random killing. \"It's not special, it's not elite, it's not what we stand for and most of us I don't believe would either wish to condone it or to cover it up.\" He added: \"Even if you subscribe to some sort of idea that most of the people who were killed were Taliban fighters, which I do not... Imran and Bilal, at one-and-a-half and three, certainly were not.\" Concluding, he said: \"UKSF units, not least UKSF1, stand out for their proud history; the courageous and extraordinary feats made by truly remarkable people. \"The activity that we have discussed in the last few days does not fit with that and somehow the amount of kills and the amount of trigger time have become the metric by which people judge themselves.\" News correspondent The testimony from N1466 was highly anticipated.  He was the assistant chief of staff for operations in UKSF headquarters; his testimony is crucial for any probe into whether UKSF had a pattern of killing in cold blood and whether the Royal Military Police covered it up.  But secrecy and ambiguity have plagued this inquiry, now in its third year.   Already, documents submitted to chair Sir Charles Haddon-Cave claim commanders defied an order to preserve computer evidence. Instead, an unknown quantity of data on the main computer server had been permanently deleted.  In 2023, the MoD and the RMP, which is accused of failing to investigate the unlawful killings claims, had sought sweeping restrictions over material submitted to the inquiry, citing national security and privacy. Sky News and a number of other media outlets challenged the application for restrictive orders, and the victims’ families argued such a “blanket” order was not compatible with open justice. So, we almost didn’t get to see the files released today. Even though there are few details and much of it is redacted, N1466’s testimony adds to growing allegations that British soldiers committed war crimes in Afghanistan and that officers and personnel at the MoD failed to adequately investigate the claims. In 2021, the UK enacted the Overseas Operations Act, which provides the Armed Forces with increased protection against legal scrutiny on overseas activities. It also introduced a presumption against prosecution for criminal offences five years after an alleged incident and a time limit on civil claims for torture and murder. Victims’ families may think justice is impossible.  The inquiry is under pressure to ensure truth isn’t. Afghan families claim UKSF conducted a \"campaign of murder\" against civilians, and that senior officers and personnel at the Ministry of Defence (MoD) \"sought to prevent adequate investigation\". Operation Northmoor, a £10m investigation set up in 2014 to examine allegations of executions by special forces, including those of children, resulted in no prosecutions. A RMP investigation, dubbed Operation Cestro, resulted in three soldiers being referred to the Service Prosecuting Authority, but again, none of them were prosecuted. An MoD spokesperson said: \"The government is fully committed to supporting the independent inquiry relating to Afghanistan as it continues its work, and we are hugely grateful to all former and current defence employees who have so far given evidence. \"We also remain committed to providing the support that our special forces deserve, whilst maintaining the transparency and accountability that the British people rightly expect from their armed forces. \"It is appropriate that we await the outcome of the inquiry's work before commenting further.\" The inquiry continues."
    },
    {
        "title": "Death toll rises to 146 in Hong Kong apartment complex fire as more bodies found in burned buildings",
        "description": "The death toll from a fire that tore through a Hong Kong apartment complex has risen.",
        "url": "https://news.sky.com/story/death-toll-rises-to-146-in-hong-kong-apartment-complex-fire-as-more-bodies-found-in-burned-buildings-13477397",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-wang-fuk-court-hong-kong_7096305.jpg?20251130110847",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-30 09:27:00",
        "Headline": "Shuk-yin Tsang, the head of the Hong Kong police casualty unit, said another 100 people remained unaccounted for.",
        "Content": " The death toll from a fire that tore through a Hong Kong apartment complex has risen. Investigators are searching for bodies in the residential towers of Wang Fuk Court, where the blaze erupted on Wednesday. Authorities say 146 bodies have now been found, rising from a previous reported total of 128. Shuk-yin Tsang, the head of the Hong Kong police casualty unit, said another 100 people remained unaccounted for, and 79 people were injured. Flames spread through seven of the eight towers of the complex, and the fire was not fully extinguished until Friday. Police said they had completed searches through four of the affected buildings. But a city official said they expected the search process to take three to four weeks. The burnt towers Cheng Ka-chun, the police officer leading the search, said bodies had been found both in apartments and on the roofs. He said: \"It is so dark inside, and because of the low light, it is very difficult to do the work, especially in places away from the windows.\" Before the fire broke out, the towers had been undergoing renovations and were clad in bamboo scaffolding, draped with nylon netting, with windows covered by polystyrene panels. Residents say they repeatedly warned about the potential flammability of the materials, but were told by the authorities that they faced \"relatively low fire risks\". Now the authorities are investigating whether fire codes were violated amid growing public anger over the blaze. Beijing has warned it will use a national security law to crack down on any \"anti-China\" protests that result. Asia correspondent Grief was not lonely today in Hong Kong. Three days after the worst fire in the history of modern Hong Kong, it feels as though it has barely sunk in. The weekend at least lent them time to pay tribute, and gave them some space to reflect. People came in droves to lay flowers, so many a queuing system was needed. Official books of condolences were also set up in multiple parts of the city. Read more... 'Give justice to the families' Over 1,000 people turned out on Sunday to pay tribute to the victims of the fire, which was Hong Kong's deadliest in more than 75 years. Mourners queued for more than a kilometre to lay flowers, some with sticky notes attached addressed to the victims. Joey Yeung, whose grandmother's apartment burned in the fire, asked for justice. The 28-year-old said: \"I can't accept it. So today I came with my father and my family to lay flowers. \"I'm not asking to get anything back but at least give some justice to the families of the deceased - to those who are still alive.\" Another mourner, Lian Shuzheng, said: \"This really serves as a wake-up call for everyone, especially with these super high-rise buildings.\" 'Serious deficiencies' in safety An online petition demanding an independent probe into possible corruption and a review of construction oversight drew over 10,000 signatures before it was closed. Another petition with similar demands attracted more than 2,700 signatures with its plea for \"explicit accountability\" from the government. Read more:Hong Kong fire: 'Even if my parents are dead, I just want to know'More arrests in deadly Hong Kong tower block blaze City officials have announced they were suspending 28 building projects undertaken by the contractor that was renovating Wang Fuk Court, the Prestige Construction & Engineering Company. They said the fire had \"exposed serious deficiencies\" in the safety of the company's sites, \"including the extensive use of foam boards to block up windows during building repairs\". The day after the fire broke out, two directors and an engineering consultant from a construction firm were arrested on suspicion of manslaughter. Police said they also suspected the company's leaders of gross negligence, without identifying the firm by name. The three men were released on bail, but then rearrested by Hong Kong’s anti-corruption authorities, who made a further eight arrests.    "
    },
    {
        "title": "Netanyahu submits request to Israeli president to pardon him",
        "description": "Israeli Prime Minister Benjamin Netanyahu, who is facing a long-running corruption trial, has submitted an official request to the country's president to pardon him.",
        "url": "https://news.sky.com/story/netanyahu-submits-request-to-israeli-president-to-pardon-him-13477405",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-israel-netanyahu_7065978.jpg?20251029160428",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-11-30 10:24:00",
        "Headline": "The Israeli prime minister is facing a long-running corruption trial. He has pleaded not guilty to all charges, which include bribery and fraud.",
        "Content": "Israeli Prime Minister Benjamin Netanyahu, who is facing a long-running corruption trial, has submitted an official request to the country's president to pardon him. In a video statement, Mr Netanyahu, who is the only sitting PM in Israeli history to stand trial, said the case had divided the country and a pardon would help restore national unity. He also said the requirement to appear in court three times a week is a distraction that makes it difficult for him to lead. President Isaac Herzog's office said it was \"an extraordinary request\" which carries \"significant implications\". The president will \"responsibly and sincerely consider the request\" after consulting with \"relevant authorities\" in the justice ministry and legal departments, his office said. It comes after Donald Trump sent a letter to Mr Herzog urging him to \"fully pardon\" Mr Netanyahu earlier this month. The US president told Mr Herzog his prime minister had \"stood tall for Israel in the face of strong adversaries\" and Mr Netanyahu's \"attention cannot be unnecessarily diverted\". Mr Netanyahu's trial, which began in 2020, has not yet concluded. He has pleaded not guilty to all charges, which include bribery and fraud. He was indicted in 2019 in three cases, including allegations of receiving nearly 700,000 shekels (£166,500) in gifts from business representatives.  The prime minister's request consists of two documents over 111 pages, the president's office said - a letter signed by Mr Netanyahu's lawyer, Amit Hadad, as well as a letter signed by Mr Netanyahu himself. They say a pardon can be issued even before conviction and argue the ongoing trial is preventing Mr Netanyahu from fully performing his duties as prime minister, particularly on critical security and diplomatic issues. The documents claim the investigation and prosecution of Mr Netanyahu suffered from irregularities, including pressure on witnesses and an effort to target the prime minister. His long record of service and leadership is also highlighted. Middle East correspondent This is a truly unprecedented situation - an Israeli prime minister, in the midst of a trial that has already been going on for years, requesting a pardon even though he hasn't been convicted. And he is doing so with the backing of the American president, whose goodwill - by contrast to growing international condemnation - now sits at the heart of Israeli government policy. Benjamin Netanyahu insists he will be exonerated, even if the trial does come to a conclusion. His argument, framed across 111 pages, is that the trial is such a distraction that it is damaging the national interest and affecting his ability to govern. He also claims that the investigation was fuelled by the malicious intent to incriminate him \"at all costs\", despite his decades of public service. But there will be others who argue the absolute reverse - that the whole structure of justice depends on holding people to account, however powerful they may be. How, the question will be asked, can you pardon someone who has not been convicted? What sort of a precedent would this set? We know Donald Trump wants Netanyahu pardoned, and has said so publicly, which leaves President Isaac Herzog in an incredibly difficult spot. He will want to show his independence, and certainly his advisers are not necessarily Netanyahu supporters. As the president, he is expected to rise above the fray of party politics and make his own decision. But will he really want to go against Trump - the will of the most powerful man in the world, who has offered such crucial diplomatic support to Israel since returning to office? And with a general election scheduled for less than a year's time, how quickly will he come to his conclusion? PM says trial 'deepens rifts' In his video statement, Mr Netanyahu said: \"The continuation of the trial tears us apart from within, stirs up this division and deepens rifts. \"I am sure, like many others in the nation, that an immediate conclusion of the trial would greatly help to lower the flames and promote the broad reconciliation that our country so desperately needs.\" Read more from Sky News:Death toll rises in Hong Kong apartment complex fireVenezuela hits out at 'colonial threat' Emi Palmor, former director general of Israel's justice ministry, said it was not possible for the trial to be stopped by the pardon request. \"You cannot claim that you're innocent while the trial is going on and come to the president and ask him to intervene,\" she said. The only way to stop the trial is to ask the attorney general to withhold the proceedings, she added. Opposition leader Yair Lapid urged the president not to give in to the request. \"You cannot grant him a pardon without an admission of guilt, an expression of remorse and an immediate retirement from political life,\" he said."
    },
    {
        "title": "Truly unprecedented situation - how can you pardon a prime minister who hasn't been convicted?",
        "description": "This is a truly unprecedented situation.",
        "url": "https://news.sky.com/story/truly-unprecedented-situation-how-can-you-pardon-a-prime-minister-who-hasnt-been-convicted-13477414",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-tel-aviv-israel_7049621.jpg?20251130115203",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-11-30 11:31:00",
        "Headline": "Israeli Prime Minister Benjamin Netanyahu is arguing his long-running corruption trial is such a distraction that it is damaging the national interest and affecting his ability to govern - but what sort of precedent would a pardon set?",
        "Content": "\n          Middle East correspondent\n              @adamparsons\n This is a truly unprecedented situation. An Israeli prime minister, in the midst of a trial that has already been going on for years, requesting a pardon even though he hasn't been convicted. And he is doing so with the backing of the American president, whose goodwill - by contrast to growing international condemnation - now sits at the heart of Israeli government policy. Benjamin Netanyahu insists he will be exonerated, even if the trial does come to a conclusion. His argument, framed across 111 pages, is that the trial is such a distraction that it is damaging the national interest and affecting his ability to govern. He also claims that the investigation was fuelled by the malicious intent to incriminate him \"at all costs\", despite his decades of public service. But there will be others who argue the absolute reverse - that the whole structure of justice depends on holding people to account, however powerful they may be. How, the question will be asked, can you pardon someone who hasn't been convicted? What sort of a precedent would this set? We know Donald Trump wants Netanyahu pardoned, and has said so publicly, which leaves President Isaac Herzog in an incredibly difficult spot. He will want to show his independence, and certainly his advisers are not necessarily Netanyahu supporters. As president, he is expected to rise above the fray of party politics and make his own decision. But will he really want to go against Trump - the will of the most powerful man in the world, who has offered such crucial diplomatic support to Israel since returning to office? And, with a general election scheduled for less than a year's time, how quickly will he come to his conclusion?"
    },
    {
        "title": "Questions over evidence used by UK police to ban Maccabi Tel Aviv fans from Aston Villa match",
        "description": "West Midlands Police is facing growing scrutiny over the information used to ban Maccabi Tel Aviv supporters from Aston Villa, with counterparts in Amsterdam disputing the evidence it provided on high-profile incidents involving the Israeli club's fan base.",
        "url": "https://news.sky.com/story/questions-over-evidence-used-by-uk-police-to-ban-maccabi-tel-aviv-fans-from-aston-villa-match-13477329",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-maccabi-villa_7089502.jpg?20251123103757",
        "type": "World",
        "Author": "Rob Harris",
        "Date Published": "2025-11-30 00:01:00",
        "Headline": "It comes as Aston Villa's Europa League game against BSC Young Boys last Thursday was classified as \"medium risk\", despite disciplinary cases against the Swiss club.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  West Midlands Police is facing growing scrutiny over the information used to ban Maccabi Tel Aviv supporters from Aston Villa, with counterparts in Amsterdam disputing the evidence it provided on high-profile incidents involving the Israeli club's fan base. The ban was imposed after the force in Birmingham concluded that the visit of Maccabi was too \"high risk\" to allow visiting fans amid inflamed community tensions over the Gaza war. And the decision will be challenged by the Home Affairs Select Committee on Monday when leaders from the force are questioned by MPs. It comes as Sky News can reveal officers only classified Thursday's Europa League match between Aston Villa and BSC Young Boys as \"medium risk\" despite three UEFA disciplinary cases against the Swiss club since 2023 for fan unrest, including partial stadium bans being imposed. And some of those Young Boys fans then fought with police and a Villa player was left bloodied by a plastic cup being thrown. West Midlands Police has not explained in any more detail about the lower classification for the Young Boys match. While Maccabi has not been hit with any UEFA disciplinary cases recently for hooliganism, the club's Europa League game at Ajax in November 2024 raised concerns in Birmingham about the ability to allow Israeli fans. \n                  Prince William visits severely ill children evacuated to UK from Gaza\n                 \n                  Two brothers killed in Israeli drone strike on Gaza\n                 \n                  Talks begin on the next phase of Gaza ceasefire deal as Hamas and Israel hand over remains\n                 Understanding it means going back to November 2024 - and the days of disorder around Maccabi's Europa League match against Ajax. It's this incident that had to be assessed by authorities in England when deciding how to police Maccabi's visit to Villa this month.  But the accuracy of this assessment has been called into question. Sky News has heard in depth from Dutch police about what they told officers in England about the threat posed by the Israeli supporters in a video call at the start of October. What's not doubted by the police or indeed Maccabi is that Israeli ultras - more violent fans - were involved in attacks and anti-Palestinian chants in Amsterdam. They armed themselves with belts and padlocks, attacking taxis and scooter-riders. Contradictions in police accounts But there are some apparent contradictions between the accounts of the two forces. In dispute are elements of a document produced by West Midlands Police to justify advice to Birmingham's Safety Advisory Group, which has been leaked. It effectively set out why Maccabi fans were deemed too dangerous to be allowed into Villa. A key claim from West Midlands Police is that 500 to 600 Maccabi fans apparently intentionally targeted Muslim communities in Amsterdam. Amsterdam police says there were 500 to 800 high-risk Maccabi supporters.  Muslims 'not targeted' by large groups of visiting fans But the force told me: \"We did not see large groups of Maccabi's (fans) going into Muslim populated areas to target Muslims.\" Asked to clarify, it added: \"Provocations came from both sides. This all happened in the city centre. That's not the same as a large group (of) Maccabi (fans) going into a Muslim populated area to target Muslims.\" Amsterdam police also made no reference in a detailed timeline provided to us of the notable claim by West Midlands Police that Maccabi fans threw \"innocent members of the public into the river\". The five people convicted in Amsterdam were all for violence against Israelis. It is not clear why no Israeli fans were prosecuted, given that the Amsterdam police cited in detail attacks by them. The Amsterdam police and the West Midlands Police spoke during a video meeting in the first week of October. The subject of the conversation was the risk of having Maccabi supporters visiting the city of Birmingham for a European football match. The Amsterdam police made clear that among Maccabi supporters there were 500-800 ultras visiting the city in November 2024. Like other European ultra groups, these fans were organised and, on some occasions, seemed willing to fight. The Amsterdam police also stated that a lot of disorder in those days were the result of different groups provoking each other.  'Offensive, racist expressions' \"Compared to other European high-risk football supporters, Amsterdam police makes the assessment that the Maccabi supporters were quite self-confident and were not afraid - neither of opponents, nor of the police,\" the timeline provided to us said. It goes on to highlight \"offensive, racist expressions\" in Hebrew shouted by Maccabi fans. It turns to the situation towards the city centre after the match. Referencing \"Maccabi Tel Aviv rioters\", it says: \"Along the way, they equip themselves with materials such as metal rods and stones. Stones are also thrown at taxis. \"At the same time, another development takes place: small groups of pro-Palestinian rioters actively search for individuals they perceive as Israeli, Jewish or Maccabi supporters. At 23.55pm, the first 'flash' attacks on Maccabi supporters begin at Dam Square. \"Several dozen violent incidents in the city centre follow. The pro-Palestinian rioters use various methods to reach their victims: some move on foot; others use scooters or taxis to move quickly through the city. \"This makes it difficult for the police to intervene quickly and effectively. This proves to be a fundamentally different form of violence compared to earlier situations, which involved clashes between groups facing each other. \"From 1.24am onward, reports of attacks decrease, but fear among Jewish residents of Amsterdam and Israeli tourists remains high. Multiple reports come in of people feeling unsafe and not daring to leave their hotels.\"  A West Midlands Police document does say there was evidence of \"incitement to attack Jewish fans\", but they largely overlook what officers in Amsterdam said was the threat posed to the Maccabi contingent. The force had to assess the resources needed for the match. It claims 5,000 officers had to be deployed in Amsterdam. But the Dutch police confirmed to us there were only 1,200 police deployed. It's raising new questions for the Aston Villa-supporting Tory MP Nick Timothy - a former Home Office special adviser - about the characterisation of Maccabi fans. \"This isn't just about a football match,\" Mr Timothy told Sky News. \"This isn't just about the rights of the Israeli supporters to come to Britain and watch their team. This is about whether we can trust the police to do their job without fear or favour, as the police oath requires them to do. And whether we can trust them to tell us the truth. \"They've presented an intelligence report that they say is based on information provided by the Dutch. The Dutch say that that information is not true\". Read more on Sky News:'False claims' fuelled fan banMaccabi chief condemns 'racist hate'Emergency measures over anti-Israeli attacks West Midlands Police said in a statement it is \"satisfied in the veracity of our information and intelligence, which put public safety at the heart of our decision-making. \"We will be giving evidence to the Home Affairs Select Committee on Monday 1 December and therefore it would be inappropriate to make further comment at this time.\" The only time the force has so far explained the decision on camera was in an interview with me on the day of the Villa match when Chief Superintendent Tom Joyce highlighted \"quite significant levels of hooliganism\" among Maccabi fans. He said banning supporters is not a \"precedent but it's one we would use rarely, clearly\". Few policing decisions have been as contentious, as scrutinised this year, with Prime Minister Sir Keir Starmer this week expressing fresh concern about the evidence used to ban by officers."
    },
    {
        "title": "Modella continues high street shopping spree with Wynsors deal",
        "description": "The investment firm which has become this year's most prolific buyer of high street chains in Britain is targeting a takeover of a privately owned footwear retailer.",
        "url": "https://news.sky.com/story/modella-continues-high-street-shopping-spree-with-wynsors-deal-13477437",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-high-street-shopping_7096374.jpg?20251130125941",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-11-30 12:57:00",
        "Headline": "The buyer of WH Smith's high street shops is in late-stage talks to add footwear chain Wynsors World of Shoes to its stable of retail brands, Sky News understands",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The investment firm which has become this year's most prolific buyer of high street chains in Britain is targeting a takeover of a privately owned footwear retailer. Sky News has learnt that Modella Capital is in advanced talks to buy Wynsors World of Shoes, which trades from approximately 50 standalone shops across the north of the country. Retail industry sources said that Modella was now the likeliest buyer of Wynsors, with a deal potentially being struck before the end of the year. Wynsors has been exploring a sale for the last two months, and hired the accountancy firm RSM to explore interest from prospective bidders. The chain also trades from about 40 concession sites, and employs roughly 440 people. It has a particular focus on the children's school shoes segment of the footwear market. Like many retailers, it is understood to have seen its recent performance adversely affected by the labour cost pressures heralded by last year's Budget. \n                  Middlemen 'cashing in on human misery' take £630m from councils desperate for housing | Money blog\n                 \n                  Netflix executive Lloyd screen-tested for top Channel 4 job\n                 \n                  Ministers line up bankers to review options for UK steel industry\n                 If the deal is completed, it would add Wynsors to a stable of brands which includes TG Jones, the new name for WH Smith's high street chain; Hobbycraft; and The Original Factory Shop. Modella was also one of the bidders for Poundland, which was sold during the summer to Gordon Brothers, another specialist retail investor. A spokesman for Modella declined to comment, while RSM has been contacted for comment, and Wynsors could not be reached for comment."
    },
    {
        "title": "'Of course I didn't' lie about budget forecasts, chancellor tells Sky News - as Badenoch calls for her to resign",
        "description": "The chancellor has insisted to Sky News that she did not lie to the public about the state of the public finances ahead of the budget.",
        "url": "https://news.sky.com/story/of-course-i-didnt-lie-about-state-of-public-finances-chancellor-rachel-reeves-insists-to-sky-news-13477380",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-rachel-reeves-trevor-phillips_7096309.jpg?20251130112033",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-30 08:27:00",
        "Headline": "The chancellor told Trevor Phillips that she was \"honest and frank\" with the country about the reasons tax rises were needed in the budget.",
        "Content": " The chancellor has insisted to Sky News that she did not lie to the public about the state of the public finances ahead of the budget. Rachel Reeves is facing widespread accusations that in a speech from Downing Street on 4 November in which she laid the groundwork for tax rises, she misled the country and led the public to believe the fiscal situation was worse than it actually was. Asked directly by Sky's Trevor Phillips if she lied, she said: \"Of course I didn't.\" Follow the latest updates from Westminster Ms Reeves said the decision by the independent Office for Budget Responsibility (OBR) to review and downgrade productivity meant the forecast for tax receipts was £16bn lower than expected. As a result, she said she needed tax rises to create more fiscal headroom (the amount by which government can increase spending or cut taxes without breaking its own fiscal rules) to reassure the financial markets and create stability in the economy. But the OBR has said it told the chancellor in its forecast on 31 October that there was a £4.2bn budget surplus, rather than a black hole following the productivity downgrade, and Trevor challenged her on why she did not say that to the nation and argue that more headroom was needed. \n                  Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances\n                 \n                  Reeves fighting claims she 'lied' about deficit - as Starmer set to back her budget\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 She replied: \"I said in that speech that I wanted to achieve three things in the budget - tackling the cost of living, which is why I took £150 off of energy bills and froze prescription charges and rail fares. \"I wanted to continue to cut NHS waiting lists, which is why I protected NHS spending. And I wanted to bring the debt and the borrowing down, which is one of the reasons why I increased the headroom. \"£4bn of headroom would not have been enough, and it would not give the Bank of England space to continue to cut interest rates.\" Ms Reeves also said: \"In the context of a downgrade in our productivity, which cost £16bn, I needed to increase taxes, and I was honest and frank about that in the speech that I gave at the beginning of November.\"  She confirmed that the prime minister was aware of the fiscal forecasts and what she was going to say in her speech on 4 November about the challenges facing the UK economy, saying: \"Keir [Starmer] and myself met regularly to discuss the budget and the choices, because these are the choices of this government. \"And I'm really proud of the choices that we made - to cut waiting lists, to cut inflation, and to build up that resilience in our economy.\"  Tax rises 'not on scale of last year' Following her budget last year, in which she raised taxes, the chancellor was explicit to Trevor that she would \"never need to do that again\" or \"come back for more\". But Ms Reeves did raise taxes by freezing income tax thresholds until 2031, and implementing a range of smaller tax rises totalling £26bn, so Trevor put to her that what she said last year was not true. She replied: \"The budget this year was not on the scale of the one last year, but as I set out in my speech at the beginning of November, the context for this budget did change and I did have to ask people to contribute more.\" 👉 Listen to Sky News Daily on your podcast app 👈 She conceded that it is \"true\" that she said she wouldn't have to raise taxes, and has now done so, but said it was \"for reasons not in my control\", pointing to the OBR's decision to conduct a productivity review. But Conservative leader Kemi Badenoch hit out at the chancellor's handling of the economy, telling Trevor: \"I think the chancellor has been doing a terrible job. She's made a mess of the economy, and [...] she has told lies. This is a woman who, in my view, should be resigning.\"  'I am choosing children' Ms Reeves also told Trevor that she is \"proud to be the chancellor that lifts half a million kids out of poverty\" through her decision to lift the two-child cap on benefits from April, which was brought in by the Conservatives in 2017 and meant parents could only claim universal credit or tax credits for their first two children. Trevor put to her polling that shows that while 84% of Labour members are in favour of scrapping the cap, just 37% of those who voted Labour in 2024 think it should be scrapped. And asked if she is choosing party over country, the chancellor replied: \"I am choosing children, Trevor. This lifts more than half a million children out of poverty, combined with our changes on free breakfast clubs, extending free school meals, 30 hours [of] free childcare for working parents of pre-school age children. \"You can put up those percentages, but the people I was thinking about were kids who I know in my constituency, who go to school hungry and go to bed in cold and damp homes. And from April next year, those parents will have a bit more support to help their kids.\" Political correspondent It’s a common characterisation of Rachel Reeves that she is a chancellor who has been dealt a bad hand but has played it poorly. The great irony of this budget is that we now know the government was dealt a relatively reasonable hand but has still managed to make a bit of a mess. For months the messaging has been of a dire fiscal picture caused by events outside of the control of ministers that would necessitate a series of difficult choices (in other words, tax rises). In reality the situation was far more rosy, with the productivity downgrade more than outweighed by a higher-than-expected tax take. Rachel Reeves was faced with those contradictions today and struggled to reach for a convincing explanation. This matters because businesses and individuals respond to the mood music coming from Downing Street. Investments may be postponed and assets moved. That has a human impact. But it also influences the economy. Then there’s the political impact. Once again, the government looked to be responding to events and behaving tactically rather than owning their decisions and defending their choices. Labour MPs were generally happy with the measures in the budget, but these political missteps may darken their mood once more. The bigger risk could be of voters – not for the first time – beginning to wonder if those at the top of the state really know what they are doing. Liberal Democrat deputy leader Daisy Cooper told Trevor that her party backs the decision, saying: \" First of all, we think it is morally the right thing to do. And secondly, because it saves money for the taxpayer in the longer term, because we know that children growing up in poverty end up costing the taxpayer more because they have worse health outcomes, worse educational outcomes as well.\" But she added that they are \"deeply concerned\" about \"this double whammy stealth tax on both households and on high streets\".  'We need growth in our economy' But the Tory leader hit out at the decision, telling Trevor that lifting the two-child benefit cap is \"not the way\" to lift children out of poverty, and saying that it means the government is \"taxing a lot of people who are struggling to pay for those on benefits\". Ms Badenoch said: \"About half a million families are going to be getting an uptick of about £5,000. Many other people don't have £5,000 lying around. \"We believe that people on benefits should have to make the same decisions about having children as everybody else. And remember, we're not talking about child benefits here. We're talking about the universal credit element of it. You get child benefit for as many children as you have. \"But at some point, someone needs to draw a line somewhere.\" Read more:Lammy says justice reforms will reduce victims' sufferingReeves accused of imposing 'stealth tax' on hospitality Ms Badenoch argued that the way to ensure children are not in poverty is to \"make sure that their parents have jobs and that those jobs pay well\", and said the level of unemployment has increased \"every single month\" since Labour came to office in July 2024. \"What we need is growth in our economy. Simply taking out from people who are struggling and giving to a different group of people is not making the economy better,\" she said."
    },
    {
        "title": "Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances",
        "description": "Sir Keir Starmer will deliver a speech on Monday defending the decisions the government made in the budget, following criticisms of sweeping tax rises and accusations the chancellor lied to the country about the state of public finances.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-defend-budget-amid-claims-rachel-reeves-lied-about-public-finances-13477435",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-keir-starmer-rachel-reeves_7096391.jpg?20251130132800",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-30 12:46:00",
        "Headline": "The prime minister will give a speech defending the budget amid claims the chancellor lied about the state of the public finances - he will also announce plans to bring in welfare reforms after a failed attempt earlier this year.",
        "Content": "Sir Keir Starmer will deliver a speech on Monday defending the decisions the government made in the budget, following criticisms of sweeping tax rises and accusations the chancellor lied to the country about the state of public finances. The prime minister is expected to set out how the budget, which saw £26bn of tax rises imposed across the economy, \"moves forward the government's programme of national renewal\", and set \"the right economic course\" for Britain, Downing Street says. He will also confirm that ministers will try again to reform the \"broken\" welfare system, after Labour MPs forced the government to U-turn on its plans to narrow the eligibility for Personal Independence Payments (PIP) earlier this year. 'Of course I didn't' lie about public finances, says Reeves \"We have to confront the reality that our welfare state is trapping people, not just in poverty, but out of work - young people especially. And that is a poverty of ambition,\" Sir Keir will say. \"And so while we will invest in apprenticeships and make sure every young person without a job has a guaranteed offer of training or work, we must also reform the welfare state itself - that is what renewal demands.\"  The prime minister will add: \"This is not about propping up a broken status quo. Nor is it because we want to look somehow politically 'tough'. The Tories played that game and the welfare bill went up by £88bn. They left children too poor to eat and young people too ill to work. A total failure.\" \n                  Reeves fighting claims she 'lied' about deficit - as Starmer set to back her budget\n                 \n                  Budget 2025: Hospitality pleads for 'lifeline' as Rachel Reeves accused of imposing 'stealth tax'\n                 \n                  New rules set to stop savers getting around reduced cash ISA limit\n                 Instead, he will argue it is about \"potential\", saying: \"If you are ignored that early in your career, if you're not given the support you need to overcome your mental health issues, or if you are simply written off because you're neurodivergent or disabled, then it can trap you in a cycle of worklessness and dependency for decades, which costs the country money, is bad for our productivity, but most importantly of all - costs the country opportunity and potential. \"And any Labour Party worthy of the name cannot ignore that. That is why we have asked Alan Milburn on the whole issue of young people, inactivity and work. We need to remove the incentives which hold back the potential of our young people.\" The announcement will come after the Conservative opposition described the budget as one for \"benefits street\", following the chancellor's decision to lift the two-child benefit cap from April, at a cost of £3bn.  'Government must go further and faster on growth' The prime minister is also expected to launch a staunch defence of the budget overall, saying it will bear down on the cost of living through measures like money off energy bills and frozen rail fares; increase economic stability; and protect investment in public services and infrastructure that will drive economic growth. He will argue that \"economic growth is beating the forecasts\", but that the government must go \"further and faster\" to encourage it. He will also reiterate his vow to scrap regulation across the economy, which he will argue is not only pro-business, but also a way to deal with the cost of living.  \"Rooting out excessive costs in every corner of the economy is an essential step to lower the cost of living for good, as well as promoting more dynamic markets for business,\" the prime minister will say. He will confirm reforms to the building of nuclear power plants, after the government's nuclear regulatory taskforce found that \"pointless gold-plating, unnecessary red-tape and well-intentioned, but fundamentally misguided environmental regulation had made Britain the most expensive place to build nuclear power\". \"We urgently need to correct this,\" the prime minister will say. Business secretary Peter Kyle will be tasked with applying the same deregulatory approach to major infrastructure schemes and to accelerate the implementation of Labour's industrial strategy. In response, Tory shadow chancellor Sir Mel Stride said: \"It is frankly laughable to hear the prime minister say Rachel Reeves's Benefits Street budget has put the country on the right course and that he wants to fix the welfare system. \"His chancellor has just hiked taxes by £26bn to pay for a welfare splurge, penalising people who work hard and making them pay for those who don't work at all. And she misrepresented why she was doing it, claiming there was a fiscal black hole to fill that she knew didn't exist. \"Labour's leadership have repeatedly shown they lack the backbone to tackle welfare and instead are just acting to placate their left-wing backbenchers.\"  Chancellor accused of 'lying' Sir Mel is referring to the chancellor's speech on 4 November in which she laid the ground for tax rises due to the decision by the independent Office for Budget Responsibility (OBR) to review and downgrade productivity over recent years, at a cost of £16bn, which led to a black hole in the public finances. But the OBR revealed on Friday that it had told the Treasury days earlier that there was actually a budget surplus of £4.2bn, leading to outrage and claims that she misled the country about the state of the public finances. Rachel Reeves was asked directly by Sky's Trevor Phillips if she lied, and she replied: \"Of course I didn't.\"  She said: \"I said in that speech that I wanted to achieve three things in the budget - tackling the cost of living, which is why I took £150 off of energy bills and froze prescription charges and rail fares. \"I wanted to continue to cut NHS waiting lists, which is why I protected NHS spending. And I wanted to bring the debt and the borrowing down, which is one of the reasons why I increased the headroom. \"£4bn of headroom would not have been enough, and it would not give the Bank of England space to continue to cut interest rates.\" Ms Reeves also said: \"In the context of a downgrade in our productivity, which cost £16bn, I needed to increase taxes, and I was honest and frank about that in the speech that I gave at the beginning of November.\"  But Tory leader Kemi Badenoch said: \"I think the chancellor has been doing a terrible job. She's made a mess of the economy, and [...] she has told lies. This is a woman who, in my view, should be resigning.\" Report due on OBR breach The tumultuous run-up to the 26 November budget culminated in the OBR accidentally publishing its assessment of the chancellor's measures 45 minutes before the speech began, in what was an unprecedented breach of budget security. 👉 Listen to Sky News Daily on your podcast app 👈 The chair of the OBR, Richard Hughes, apologised for the \"error\", and announced an investigation into how it happened. The chancellor has said that she retains confidence in him, despite the \"serious breach of protocol\", and confirmed to Trevor that the investigation report will be delivered to her on Monday, although it is not clear when it will be published."
    },
    {
        "title": "Your Party founder Zarah Sultana hits out at party 'witch hunts' and 'bullying'",
        "description": "Zarah Sultana has hit out at the factionalism within Your Party that has been on stark display at its founding conference this weekend. She also slammed \"the sight of a Muslim woman being manhandled and dragged out of conference\".",
        "url": "https://news.sky.com/story/your-party-founder-zarah-sultana-hits-out-at-party-witch-hunts-and-bullying-13477496",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-zarah-sultana-your-party_7096554.jpg?20251130151429",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-30 15:07:00",
        "Headline": "The MP for Coventry South also slammed \"the sight of a Muslim woman being manhandled and dragged out\" of the party conference.",
        "Content": " Zarah Sultana has hit out at the factionalism within Your Party that has been on stark display at its founding conference this weekend. She also slammed \"the sight of a Muslim woman being manhandled and dragged out of conference\". Speaking on the main stage, the MP for Coventry South said there have been \"witch hunts\" and \"bullying\" at the top of the new left-wing party, and declared she \"will not stand for this\". But she also apologised for \"hiccups\" in the foundation of the party, admitting that some of it was her \"fault\". Jeremy Corbyn announced on Sunday that the party's name will remain Your Party, after a vote by members. Follow the latest updates from Westminster The conference in Liverpool has been marred by infighting and allegations of \"witch hunts\", with some members seemingly being expelled for belonging to the Socialist Workers Party. They were removed from the venue, leading to Ms Sultana boycotting the first day on Saturday. \n                  Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Sultana accused by Corbyn allies of encouraging 'ultra leftists' to disrupt Your Party conference\n                 But she attended on Sunday to give her speech from the main stage, and told the gathered members: \"Before we move forward, we have to confront what took place yesterday. \"The expulsions, the bans, the censorship on conference floor are unacceptable. It's undemocratic, it's an attack on members and this movement. \"And those decisions were made at the top, not by you.\" \"Many of those people expelled found out only after they had arrived in Liverpool. People who had travelled across the country, took time off work, booked hotels, spent hundreds of pounds that they could not easily spare, discovered at the door that they had been barred.\" She added: \"And the sight of a Muslim woman being manhandled and dragged out of conference is something that should shame any party that claims to stand for equality and justice. \"These actions come straight out of the Labour right's handbook, the same playbook we have all lived through for years - the witch hunts, the smears, the intimidation, the bullying, the legal threats and the leaks to the Murdoch press. \"Let me be absolutely clear, the members will not stand for this, the movement will not stand for this and I will not stand for this.\"  'I am sorry for the hiccups' Ms Sultana made these comments just a few metres from co-founder Jeremy Corbyn, who was sitting at a table on the stage. There have been allegations - denied by his spokesperson - that the Corbyn faction has been behind chaos. Ms Sultana later took some responsibility for the chaotic launch of the party, which assumedly included her announcing the party reportedly before Corbyn wanted her to, as well as the launch of her own membership portal that has led to difficulties around the transfer of member data to the one Mr Corbyn set up, as well as £800,000 in fees.  She said: \"You may have noticed that the process of starting up this party has had some hiccups. Some of that is my fault, and for that I am sorry. \"But I want you to know that my aim from the very start has been to ensure that this party is led by you, the members, and not MPs.\" She added: \"We have to get better at working with each other. We have to ensure that the best cure against any culture of backroom deals is people power and that's why I've been fighting for maximum member democracy.\" That reference to democracy was about a vote at the conference about whether the party should have a single leadership model, or a collective one. Members voted for a collective leadership model, by a margin of 51.6% to 48.4%, which is being seen as a blow to Mr Corbyn, but also avoids a battle between him and Ms Sultana. While the decision was celebrated by her, an ally of Mr Corbyn told our political reporter Faye Brown: \"People have voted against utilising the biggest asset the party had - Jeremy.\"  'Andrew is a parasite' In the rest of her speech, Ms Sultana hit many of the expected topics - supporting Palestine, demanding the severing of all ties with Israel, criticising wealthy people and the press, and calling for the monarchy to be abolished. She said: \"The same people who run Britain want you to believe that every refugee is a rapist while they grab £12m of taxpayers' money to protect a parasite called Andrew Mountbatten-Windsor.\" She added: \"What a sick society we live in, where our political and media class bend over backwards for the royal family, including Prince Andrew, close friends with notorious paedophile Jeffrey Epstein. \"That's our money that provided him housing, that's our money that defended him in court, that's our money that put food on his table. Well, not any more. \"We shouldn't just abolish Andrew's titles. We should abolish the monarchy itself.\" Read more:Your Party votes to be led by membersCorbyn declines to call Sultana a friend On Israel, the Coventry South MP declared to huge applause: \"I am an anti-Zionist and if we fight for it, Your Party will be an anti-Zionist party. We must sever all ties with the genocidal apartheid state of Israel. \"We must expel the ambassador and shut down the embassy, and stand with the Palestinian people until every inch of their land is free, from the river to the sea, a single democratic state with equal rights for all.\""
    },
    {
        "title": "Your Party: Old infighting habits die hard at new left-wing party's acrimonious Liverpool conference",
        "description": "Anyone playing bingo with the left-wing lexicon would have been sure of a fully marked-off card by the close of Your Party's founding conference on the banks of the Mersey.",
        "url": "https://news.sky.com/story/your-party-old-infighting-habits-die-hard-at-new-left-wing-partys-acrimonious-liverpool-conference-13477626",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-your-party-zarah-sultana_7096929.jpg?20251130184424",
        "type": "Politics",
        "Author": "Rob Powell",
        "Date Published": "2025-11-30 18:20:00",
        "Headline": "With its two figureheads seemingly at odds, the party's founding conference featured dated behaviour and predictable positional tensions, which nonetheless made for compelling political theatre.",
        "Content": "\n          Political correspondent\n              @robpowellnews\n Anyone playing bingo with the left-wing lexicon would have been sure of a fully marked-off card by the close of Your Party's founding conference on the banks of the Mersey. Witch hunt - check. Sabotage and intimidation - check. Faceless unelected bureaucrats - HOUSE!  Bonus points were also on offer if you spotted the right-wing newspaper reporter forced to hang around outside the conference after a mysterious and unfixable error with his accreditation stopped him from accessing the venue. For a party painting itself as the face of the new left, there was plenty of dated behaviour during this two-day jamboree. A gauntlet of leafleters awaited all attendees from an extensive range of left-wing organisations. Your correspondent ended the gathering with literature from (deep breath) - the Revolutionary Communist Group, the Socialist Workers Party, the Socialist Unity Platform, the Socialist Equality Party, the Democratic Socialists, the Democratic Bloc, the Spartacist League, Workers Hammer, the Weekly Worker and, of course, the Morning Star. Tensions make compelling politics \n                  Your Party founder Zarah Sultana hits out at party 'witch hunts' and 'bullying'\n                 \n                  Jeremy Corbyn declines to call Zarah Sultana a friend as Your Party holds first conference\n                 \n                  Sultana accused by Corbyn allies of encouraging 'ultra leftists' to disrupt Your Party conference\n                 This plethora of groupings led to some predictable positional tensions. At one point the Democratic Socialists - who had already split from the more formal Your Party grouping to align with Zarah Sultana's supporters - then split again, this time from Team Sultana, and called for members to reject the founding constitution and political statement that they had spent the past 24 hours trying to amend, only to then pivot one more time and encourage their base to vote in favour.  So - beyond the fact that this has been incredibly compelling politics - why do I relay all this to you? Well, it's because Your Party's analysis of its reason for being is a good one. A threat to Labour? There is political space for a new left-wing force that could inflict severe damage to Labour at the ballot box. But based on events this weekend, I can't say with confidence that force will be Your Party. There is obviously a huge amount of tension between the two most high-profile politicians in the party. Zarah Sultana spent much of the weekend directly accusing figures around Jeremy Corbyn of trying to drum out some of her supporters, even going as far as boycotting the first day of her own conference in protest at expulsions carried out on the eve of the event.  The Coventry South MP did insist the pair were friends, saying, \"Jeremy came to my wedding.\" 'We're colleagues' But the former Labour leader seemed less sure. When asked the same question, he simply and - somewhat brutally - said \"we're colleagues\". As for where this goes now, the party is about to begin a process not of electing a leader, but a leadership committee - chaired by a rank-and-file member with four spots reserved for MPs and councillors. The idea is to hand more power over policy-making and whipping to the grassroots. The risk is that this new structure just becomes another venue for further falling out. If a camel is a horse designed by committee, could this \"pioneering\" leadership structure end up pleasing no one and angering everyone? This all matters more because the same 'modern left' electoral arena these guys are trying to occupy already has a new kid on the block in the slickly communicated and comparatively collegiate Green Party. Read more from Sky News:Why all the tension in Your Party?Committee to lead Your Party Many members in Liverpool spoke highly of Zack Polanski, with senior party figures and supporters alike open to the idea of exploring electoral pacts on a constituency-by-constituency basis. It's in this broader concept of a progressive alliance that Your Party's future may realistically lie in the long run. For as much as the comrades on the Mersey raged at Sir Keir Starmer, would they really let Nigel Farage slope into Downing Street in order to lash out at Labour? Maybe. Maybe not. Internecine warfare can come naturally to the left. And as we've learnt in Liverpool this weekend, old habits die hard."
    },
    {
        "title": "Your Party votes to be led by members rather than single MP - avoiding Corbyn-Sultana battle",
        "description": "Your Party will be led by its members rather than a single MP, avoiding a battle between its two co-founders, Jeremy Corbyn and Zarah Sultana.",
        "url": "https://news.sky.com/story/your-party-votes-to-be-led-by-members-rather-than-single-mp-avoiding-corbyn-sultana-battle-13477409",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-corbyn-zarah-sultana_7047989.jpg?20251010182657",
        "type": "Politics",
        "Author": "Faye Brown",
        "Date Published": "2025-11-30 10:50:00",
        "Headline": "The decision is seen as a win for Zarah Sultana, who favoured collective leadership - but allies of Jeremy Corbyn say this is a missed opportunity for him to lead the party. ",
        "Content": "\n          Political reporter\n              @fayebrownSky\n  Your Party will be led by its members rather than a single MP, avoiding a battle between its two co-founders, Jeremy Corbyn and Zarah Sultana. Members have voted for a collective leadership model rather than a single leadership model, by a margin of 51.6% to 48.4%. Politics Live: Chancellor denies lying about budget forecast  There was a big cheer as the result was announced to delegates gathered in Liverpool for the new movement's annual founding conference. However, one ally of Mr Corbyn told Sky News: \"People have voted against utilising the biggest asset the party had - Jeremy.\" Your Party has been marred by factionalism between the two figureheads from the outset and had a single leadership model been picked, a big battle for the top job was expected. But many members told Sky News at the conference that because of the squabbling, they want Your Party to be led by the people rather than \"personality icons\". \n                  'Of course I didn't' lie about budget forecasts, chancellor tells Sky News - as Badenoch calls for her to resign\n                 \n                  Sir Keir Starmer to defend budget amid claims Rachel Reeves 'lied' about public finances\n                 \n                  Your Party founder Zarah Sultana hits out at party 'witch hunts' and 'bullying'\n                 Collective leadership will see ordinary members who are not MPs elected to senior positions on a Central Executive Committee (CEC), which will decide on party strategy and organisation. Three key leadership roles will be the chair, vice chair, and spokesperson, but there will be 16 lay members of the CEC overall, who will represent regions within England. At a later date, more members will be elected to represent Wales and Scotland. And MPs will still have influence, as they will be able to sit in the public office holder section of the executive committee, as will local councillors. There will be four public office holder positions, and the CEC has the power to instruct those politicians to vote in line with party policy. This leadership model will be in place for at least a year, with a review to come in 2027. A Your Party spokesperson said: \"This vote shows that we really are doing politics differently: from the bottom-up, not the top-down. \"In Westminster, we have a professional political class increasingly disconnected from ordinary people, serving corporations and billionaires instead of the communities they are supposed to represent. \"With a truly member-led party, we will offer something different: democratic, grassroots, accountable.\" Timeline for elections  The nominations will open in the new year, with final votes taking place at the end of February. In the meantime, Your Party will be led by the independent alliance (IA) of MPs and a randomly selected group of members, who will facilitate candidate selections for the local elections in May. The IA MPs involved in Your Party are Mr Corbyn, Shockat Adam and Ayoub Khan. Ms Sultana was previously part of the group but left a WhatsApp communications channel in September after launching an unauthorised membership portal and claiming she had been sidelined by a \"sexist boys club\" - sparking a major row that the party has struggled to recover from.  A source close to her denied quitting the IA, which has been stewarding the founding process, and claimed she had been excluded. They insisted Ms Sultana would be part of the caretaker leadership. Collective leadership is seen as a win for Ms Sultana's faction, as she had backed this over the single leadership model. Many grassroots groups also supported this option as they feel that unelected officials close to Mr Corbyn from his time as Labour leader have had too much say in what is going on behind the scenes. Infighting rumbles on  Your Party members have also voted to allow membership of other parties. Current rules don't permit dual membership, but this sparked a backlash on the eve of conference as it emerged figures from the Socialist Workers Party (SWP) had been expelled, while members of other left-wing groups were barred from entering the conference venue. Ms Sultana branded this a \"witch hunt\" orchestrated by faceless bureaucrats close to Mr Corbyn, and refused to enter the conference hall yesterday in protest. The vote on the leadership model and dual membership were ratified with a vote on the party's constitution and political statement this afternoon. This vote sparked some commotion as it emerged one group - the Democratic Socialists - initially urged its hundreds of members to vote against these documents despite supporting both the outcomes. Dem Soc said that although they have won victories, voting for the constitution would \"validate\" the \"targeting of the organised left\". That led to Ms Sultana, who has long been supported by Dem Soc, to warn that \"certain people are looking to undermine the democratic vote that took place over the last 24 hours\". Dem Soc later rescinded their advice, accusing the \"Corbyn faction\" of encouraging members to vote against the constitution and warning \"the risk is now too great to prioritise principle and not pragmatism\". Mr Corbyn had favoured a single leadership model and many of his allies argued Your Party had the best chance of succeeding if led by him, given his experience as Labour leader. His spokesperson said claims that his office were telling people to vote against the constitution are \"completely false\". He has not commented on the collective leadership vote, which Ms Sultana said was \"truly exciting...and radically democratic.\" Your Party also voted on its official name, with members deciding to keep it as it is. The options on the shortlist included Our Party, Popular Alliance and For the Many - but Your Party won with 37% of the vote. "
    },
    {
        "title": "Lammy says justice reforms will reduce victims' suffering - as right to jury trial set to go in some cases",
        "description": "Victims will be put \"front and centre\" in reforms to be announced this week, Justice Secretary David Lammy has said, amid reports jury trials will be scrapped in some cases.",
        "url": "https://news.sky.com/story/lammy-says-justice-reforms-will-reduce-victims-suffering-as-right-to-jury-trial-set-to-go-in-some-cases-13477349",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-old-bailey-london-old-bailey-london_6967735.jpg?20250718122447",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-11-30 03:37:00",
        "Headline": "Shadow justice secretary Robert Jenrick hits out at the expected changes, saying Britons shouldn't lose \"ancient liberties\", but Mr Lammy insists reforms are vital to deliver for victims and cut a huge crown court backlog.",
        "Content": "Victims will be put \"front and centre\" in reforms to be announced this week, Justice Secretary David Lammy has said, amid reports jury trials will be scrapped in some cases. Sky News understands ministers have already been briefed on the changes, which would see a judge decide most cases on their own except for murder, rape or manslaughter - or those in the \"public interest\". The Ministry of Justice (MoJ) said the reforms would speed up justice and save victims from \"years of torment and delay\". Nearly 80,000 cases are currently waiting to be heard in crown courts, but a bid to limit the right to jury trial is likely to be divisive. Shadow justice secretary Robert Jenrick said Mr Lammy should \"pull his finger out\" to cut the backlog rather than \"depriving British citizens of ancient liberties\". \"The right to be tried by our peers has existed for more than 800 years - it is not to be casually discarded when the spreadsheets turn red,\" said Mr Jenrick. Full details are expected in the coming days, but in a statement on Sunday Mr Lammy said he had \"inherited a courts emergency; a justice system pushed to the brink\". \n                  Starmer avoided political heat at home during Brazil climate conference - but he returns to a prisons crisis\n                 \n                  Mistaken prison releases could be 'opportunity' for justice secretary, says Harriet Harman\n                 \n                  Why are prisoners being released by mistake?\n                 \"We will not allow victims to suffer the way they did under the last government, we must put victims front and centre of the justice system,\" he added. Mr Lammy said thousands of lives were on hold due to the case backlog, a \"rape victim being told their case won't come before a court until 2029. A mother who has lost a child at the hands of a dangerous driver, waiting to see justice done\". He said he wanted a system that \"finally gives brave survivors the justice they deserve\". However, it's been reported Mr Lammy will go further than a review conducted by Sir Brian Leveson. The retired judge backed the move for juries only in the most serious cases, but also proposed some lesser offences could go to a new intermediate court where a judge would be joined by two lay magistrates. The Times said Mr Lammy had suggested in an internal memo he would remove the lay element from many serious offences that carry sentences of up to five years. There are fears such a move could increase miscarriages of justice and racial discrimination. Read more from Sky News:Reeves fighting 'lie' claims as Starmer set to back budgetYour Party co-founder refuses to enter conference hall  Speaking to Sky News' Politics Hub programme this week, work and pensions secretary Pat McFadden did not deny the changes were on the way. The MoJ has laid the ground for the reforms by saying the court backlog could hit 100,000 by 2028 under the current system. It said just 3% of cases are currently decided by a jury, with more than 90% already dealt with by magistrates alone."
    },
    {
        "title": "More than 600 dead in Indonesia and Thailand after floods and landslides - and Sri Lanka reporting more than 200 deaths from cyclone",
        "description": "The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone.",
        "url": "https://news.sky.com/story/more-than-600-dead-in-indonesia-and-thailand-after-floods-and-landslides-and-sri-lanka-reporting-more-than-200-deaths-from-cyclone-13477400",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-tanah-datar-west-sumatra_7096282.jpg?20251130095938",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-11-30 09:45:00",
        "Headline": "A tropical storm that formed in the Malacca Strait has led to 435 deaths in Indonesia, 170 in southern Thailand, and three in Malaysia.",
        "Content": " The death toll following flooding and landslides in Indonesia and Thailand has risen to more than 600 - with nearby Sri Lanka also reporting more than 200 deaths after a cyclone. Three people have also died in Malaysia, officials have said, due to the extreme weather in South Asia and Southeast Asia. In total, Indonesian officials said 442 people had died and Thai authorities reported 170 deaths in the southern part of the country, as of midday UK time on Sunday. Rescue efforts were ongoing throughout the day, with more than four million people affected - almost three million in Southern Thailand and 1.1 million in Western Indonesia - by the effects of a tropical storm formed in the Malacca Strait. Indonesian relief and rescue teams have used helicopters to deliver aid to people they could not access because of blocked roads on the western island of Sumatra. Many areas have been cut off, while damage to telecommunications infrastructure has hampered communications. Officials said on Saturday that they had received reports of people looting supply lines as they grow desperate for relief in other areas. Hat Yai, the largest city in Thailand's Songkhla province, received 335mm (13 inches) of rain on Friday last week, its highest single-day tally in 300 years. After days of rain, meteorological authorities in Malaysia lifted tropical storm and continuous rain warnings there yesterday, forecasting clear skies for most of the country. However, there are still about 18,700 people in evacuation centres, according to the country's national disaster management agency. Read more from Sky News:Surgeon may never face justice over 'botched' operationsWilliam 'moved' by severely ill Gazan children's courage More than 200 dead in Sri Lanka Across the Bay of Bengal, Sri Lanka's disaster management centre said in a situation report on Sunday that 212 people had died as a result of Cyclone Ditwah. Another 218 people have been recorded as missing across the South Asian country's 25 districts, and more than half a million people have been affected nationwide."
    },
    {
        "title": "British Independent Film Awards winners revealed",
        "description": "Biker romance Pillion has picked up the top prize at the British Independent Film Awards.",
        "url": "https://news.sky.com/story/british-independent-film-awards-winners-revealed-13477464",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-pillion-alexander-skarsgard_7096457.jpg?20251130143258",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-11-30 22:15:00",
        "Headline": "Pillion, The Ballad Of Wallis Island and My Father's Shadow were among the big winners at this year's BIFA ceremony in London.",
        "Content": "Biker romance Pillion has picked up the top prize at the British Independent Film Awards. The film's first-time feature writer and director Harry Lighton was also named best debut screenwriter at the ceremony, held at the Roundhouse in Camden, London, on Sunday evening. Starring Harry Melling as sweet and timid Colin, and Alexander Skarsgard as rugged biker Ray, the film picked up four prizes in total - including craft wins for best costume design and make-up and hair. Tom Basden and Tim Key took home the BIFA awards for best joint lead performance and best screenplay, for their debut feature The Ballad Of Wallis Island. Also starring Carey Mulligan, the film tells the story of a faded folk musician and his former partner who reluctantly reunite for an eccentric fan. Elsewhere in the acting categories, Robert Aramayo was honoured with the best lead performance award for his portrayal of Tourette's campaigner John Davison in I Swear, with the supporting performance award going to Jay Lycurgo for his role in pressure-cooker school drama Steve, also starring Oscar-winner Cillian Murphy. Newcomer Posy Sterling's portrayal of a mother fighting for custody of her children in Lollipop earned her the breakthrough performance award, while the best ensemble performance prize went to the cast of Warfare - including Will Poulter, Kit Connor, Joseph Quinn and Charles Melton. This year's ceremony also celebrated cinema itself, with the inaugural cinema of the year award going to The Magic Lantern Cinema in the Welsh coastal town of Tywyn. The BIFA for best international independent film was awarded to Sentimental Value, Joachim Trier's intimate exploration of family, memories and the reconciliatory power of art. Behind the camera, Akinola Davies Jr was named best director for his debut feature My Father's Shadow, a story of two brothers who first come to understand their father at a pivotal moment in both his life and Nigerian history, while The Douglas Hickox Award for best debut director went to Cal McMau for prison drama Wasteman. And in the documentary categories, Myrid Carten's exploration of mental health and addiction within her family, A Want In Her, picked up three BIFAs - best feature documentary, The Raindance Maverick Award, and best debut director for a feature documentary. Elsewhere, Emily Watson, star of films including Gosford Park, Punch-Drunk Love and War Horse, and TV series including Chernobyl and Dune: Prophecy, was awarded the outstanding contribution to British film prize. Production company Warp Films - behind films such as Dead Man's Shoes and This Is England, as well as the recent critically acclaimed series Adolescence - was honoured with the BIFA special jury prize for its \"unflinching and uncompromising\" commitment to telling \"raw and relevant stories\". Read more from Sky News entertainment:King pays tribute following death of Tom StoppardAI actress creator insists she's not out to steal jobs Founded in 1998, the BIFAs aim to celebrate, promote and support talent and creativity in British independent film. Previous winners of the best independent film award include Kneecap, the semi-autobiographical story of Irish-language rappers Kneecap, and Oscar winner The Favourite. This year's ceremony was hosted by comedians Lou Sanders and Harriet Kemsley, with Carey Mulligan, Stephen Merchant, Ruth Wilson, Billy Crudup and Celia Imrie among the star presenters."
    }
]