[
    {
        "title": "Tens of thousands flee fighting in Aleppo, Syria, after evacuation order",
        "description": "Thousands have been forced from their homes in Aleppo after people were ordered to evacuate amid fighting between the Syrian army and Kurdish forces.",
        "url": "https://news.sky.com/story/tens-of-thousands-flee-fighting-in-aleppo-syria-after-evacuation-order-13492043",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-civilians-aleppo-syria_7130161.jpg?20260108114432",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-08 14:10:00",
        "Headline": "Syrian army issues no-go zone maps as it prepares \"targeted operations\" in Kurdish majority areas. Opponents suggest it is committing war crimes.",
        "Content": "Thousands have been forced from their homes in Aleppo after people were ordered to evacuate amid fighting between the Syrian army and Kurdish forces. The provincial government set a deadline of 1pm (10am UK time) on Thursday for people to leave Kurdish-majority areas using evacuation corridors. The military later issued maps showing the no-go zones. The army would begin \"targeted operations\" against Syrian Democratic Forces (SDF) in the areas of Sheikh Maqsoud, Achrafieh and Bani Zaid, the state news agency SANA warned. Shelling and drone strikes intensified on Thursday afternoon and tanks could be seen entering the neighbourhoods. The fighting - which began in the northern city on Tuesday - comes as the Kurdish-led SDF continue to resist integrating into the Syrian army following the overthrow of President Assad in late 2024. The SDF said their fighters were involved in intense clashes with factions linked to the government and that at least eight civilians had been killed in Kurdish-majority neighbourhoods. It claimed warnings of shelling could count as forced displacement and war crimes. Government officials said at least seven civilians and one soldier were dead in nearby government-controlled areas. Nearly 140,000 people have been displaced across Aleppo province, according to the provincial directorate of social affairs and labour. Faisal Ali, head of operations of the civil defence in Aleppo, said: \"Transport buses and civil defence vehicles are present, and a large number of those leaving today are children, women, and elderly men and women, many of whom are suffering from serious health conditions. \"They have been provided with medical care in ambulance vehicles and transported to hospitals as needed, while our teams continue to accompany the ambulances and monitor their health conditions in the shelters.\" The SDF controls much of northeastern Syria and for years have been the main US partner in fighting the Islamic State group in the country. It reached a deal with the Syrian government in March that envisaged full integration between the two sides' forces by the end of 2025. However, progress has been slow and the two sides have accused each other of stalling. America, which backs new President Ahmed al Sharaa, has tried to mediate and the latest talks were held as recently as Sunday. There are fears a failure to integrate the SDF into the Syrian army will mean more violence and could prompt Turkey to get involved militarily. Ankara regards the Kurdish fighters as terrorists due to links it says they have with the Kurdistan Workers Party, or PKK, which has waged a long-running insurgency in Turkey. Read more from Sky News:What happened on Iran's 'Bloody Saturday'How UK helped US seize Russian-flagged tanker International powers have urged restraint and de-escalation. A US state department official said America was \"closely monitoring the situation\", while UN spokesperson Stephane Dujarric said secretary general Antonio Guterres was \"alarmed by reports of civilian deaths and injuries\". \"We call on all actors to immediately de-escalate, exercise maximum restraint, and take all measures to prevent further harm to civilians,\" said Mr Dujarric."
    },
    {
        "title": "Watchdog to examine West Midlands Police role in Maccabi Tel Aviv fans ban",
        "description": "The police watchdog has told Sky News it will assess evidence provided by West Midlands Police to MPs and consider the findings of a review into how its intelligence assessment was used to ban Maccabi Tel Aviv fans from Aston Villa.",
        "url": "https://news.sky.com/story/watchdog-to-examine-west-midlands-police-role-in-maccabi-tel-aviv-fans-ban-13492092",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maccabi-tel-aviv-aston-villa_7128295.jpg?20260106173048",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2026-01-08 15:19:00",
        "Headline": "The IOPC will assess police evidence to MPs and consider the force's review into how intelligence was used to ban Israeli fans from an Aston Villa match.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The police watchdog has told Sky News it will assess evidence provided by West Midlands Police to MPs and consider the findings of a review into how its intelligence assessment was used to ban Maccabi Tel Aviv fans from Aston Villa. The force is accused of misrepresenting the threat to justify advocating the exclusion of the Israeli club's fans from the Europa League match in Birmingham in November. An Independent Office for Police Conduct (IOPC) spokesperson told Sky News: \"It is right for public confidence and police accountability that the force's involvement in the decision-making process is examined by all relevant organisations, including the IOPC.\" West Midlands Police (WMP) has already had to apologise for providing misleading evidence to the Home Affairs Select Committee. The force's leadership faced further scrutiny from MPs on Tuesday about why they had only just revealed details of concerns about the local community in Birmingham apparently wanting to \"arm\" themselves against Maccabi fans. Conservative leader Kemi Badenoch has called for the resignation of Chief Constable Craig Guildford, claiming he presented an \"inversion of reality and misled a parliamentary committee\". The force told MPs on 1 December that the local Jewish community backed the ban on Maccabi fans from the Europa League match in November, but it later apologised to the committee and said there was \"never any intention to mislead whatsoever\". In a rare move, Mr Guildford was recalled to face questions for the second time in two months by the Home Affairs Select Committee. \"It is important for us to assess all available evidence before we make decisions over whether we should undertake any independent conduct investigations,\" the IOPC spokesperson said. \"That includes evidence provided to the Home Affairs Select Committee, plus a review by His Majesty's Inspectorate of Constabulary, Fire & Rescue Services (HMICFRS) of the intelligence picture and risk assessment provided by West Midlands Police to the Safety Advisory Group which helped inform the decision to ban Maccabi Tel Aviv fans from the match. That report is expected to be available soon and we will consider its findings.\" 'Significant levels of hooliganism' WMP only revealed why it wanted Maccabi fans banned hours before the match in an interview with Sky News. While the threat to Israelis was a \"consideration\", Chief Superintendent Tom Joyce said it was \"not the primary driver\". He instead referenced intelligence about Maccabi's own \"significant levels of hooliganism\". Maccabi has acknowledged it has a problem with violence and anti-Palestinian racism in parts of its fan base, which led to a recent UEFA punishment. But it was only revealed by WMP this week that in early September, days after the Europa League draw by UEFA paired Villa with Maccabi, the force already had \"high confidence intelligence\" of \"elements of the community in West Midlands wanting to 'arm' themselves\". That was not clear in meetings of minutes of a safety advisory group only recently released. 'Capitulated to Islamists' WMP confirmed to MPs on Tuesday it was concerned about \"vigilante groups\" attacking Maccabi fans but also said Israelis were found online \"goading local community members\". Committee chair Dame Karen Bradley MP said: \"It feels to us, from everything we've seen, that there was a need that you felt, that you had to justify banning these fans, and that scraping was done to find a reason.\" Mr Guildford responded: \"That was absolutely not the case.\" Ms Badenoch said West Midlands Police had \"capitulated to Islamists and then collaborated with them to cover it up\". She added: \"They knew extremists were planning to attack Jews for going to a football match, and their response was to blame and remove Jewish people instead.\" The force did not respond to a fresh request for comment today. The IOPC said it had not received any conduct or complaint referrals from WMP or the West Midlands police and crime commissioner about the conduct of individuals at the force. \"We have liaised with both and will continue to monitor the situation,\" the watchdog said. \"Should we receive any referrals they will be thoroughly examined.\""
    },
    {
        "title": "Increasing numbers of women are dying during pregnancy or in the weeks after giving birth",
        "description": "Increasing numbers of women in the UK are dying during pregnancy or in the weeks after giving birth, according to new figures.",
        "url": "https://news.sky.com/story/maternal-death-rate-up-by-20-as-government-fails-to-meet-2025-target-13492085",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maternity-doctor_7130353.jpg?20260108154113",
        "type": "Home",
        "Author": "Laura Bundock, Health correspondent",
        "Date Published": "2026-01-08 15:17:00",
        "Headline": "Official data found there were 252 maternal deaths from 2022 to 2024, which is 20% higher than the rates from 2009 to 2011.",
        "Content": "By Laura Bundock, Health correspondent  Increasing numbers of women in the UK are dying during pregnancy or in the weeks after giving birth, according to new figures. The upward trend means the government has failed to meet its target to halve maternal death rates by 2025. Official data found there were 252 maternal deaths from 2022 to 2024, which is 20% higher than the rates from 2009 to 2011. This is the equivalent of 12.8 deaths for every 100,000 women giving birth. The figures are from MBRRACE-UK, the official body auditing deaths among mothers and babies. The investigation also finds inequalities, with mortality rates for women from black ethnic backgrounds in 2022 to 2024 three times higher than that of white women. That's despite the rates previously starting to fall. Women from the most deprived areas of the UK continue to have mortality rates almost twice that of women living in the least deprived areas. \n                  UK weather latest: Airport shuts runway as Storm Goretti hits UK with heavy snow and 99mph winds\n                 \n                  Snow and wind in Derbyshire is 'pretty relentless' as Storm Goretti sweeps across UK\n                 \n                  Clifftop residents told to leave because Storm Goretti could destroy their homes\n                 Blood clots are the leading cause of maternal death either during pregnancy or in the six weeks after giving birth, while suicide is the leading cause of maternal deaths happening from six weeks to a year after birth. Read more from Sky News:Delayed discharges cost NHS Scotland £440m a yearWhy you should leave heating on if you go away in winter The national target was set by the previous government in 2015, when then-health secretary Jeremy Hunt announced his ambition to reduce maternal deaths by 50%. The original target date was set for 2030, but it was later brought forward to 2025. Professor Marian Knight, director of the National Perinatal Epidemiology Unit and MBRRACE-UK programme lead, said: \"These latest data highlight the need for a renewed focus on maternal mortality and the critical actions required to ensure safe and equitable maternity care for all women in the UK.\" Kate Brintworth, chief midwifery officer for England, said: \"Every death in pregnancy and childbirth is a tragedy and these figures show how much more work is needed to prevent more deaths and address the unacceptable inequalities that persist for families across the country. \"That is why this week we have set out new best-practice standards across maternity services, including to ensure earlier and more consistent assessment for blood clots, and improved identification and care for perinatal mental health concerns. \"Alongside this, the NHS is continuing to strengthen maternity care through specialist treatment centres ensuring women with pre-existing medical conditions or high-risk pregnancies can quickly access expert care, dedicated mental health support for expectant and new mums, and closer oversight of maternity units.\" A Department of Health and Social Care (DHSE) spokesperson said that from this week, the government is rolling out guidance across the NHS to tackle the leading causes of maternal death including thrombosis, mental health, epilepsy and haemorrhage. The government is also investing over £130m to make maternity and neonatal units safer, rolling out a programme to reduce avoidable brain injuries, and backing Martha's Rule so families are always heard when they raise concerns, the spokesperson said. The DHSE spokesperson added: \"It is unacceptable that some women face far greater risks than others simply because of their ethnicity or where they live, and addressing these inequalities is a priority. \"The Secretary of State has ordered a rapid national investigation to make recommendations to urgently improve care, including identifying the drivers of inequalities, and will chair a taskforce to address these deep-rooted issues.\" If you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853, emailing news@skynews.com or using 'Your Report' on the Sky News app."
    },
    {
        "title": "Probe into police response to attack linked to Huntingdon train stabbings",
        "description": "Two police officers are being investigated for potential gross misconduct over alleged failures to properly investigate an attack potentially linked to the Huntingdon train stabbings.",
        "url": "https://news.sky.com/story/probe-into-police-response-to-attack-linked-to-huntingdon-train-stabbings-13492234",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-probe_7130670.jpg?20260108223508",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-08 22:10:00",
        "Headline": "Two Cambridgeshire police constables are being investigated for potential  misconduct, relating to alleged failures over an attack in Peterborough.",
        "Content": "Two police officers are being investigated for potential gross misconduct over alleged failures to properly investigate an attack potentially linked to the Huntingdon train stabbings. Ricky Butcher said he was outside Fletton Club in Peterborough waiting for a taxi with a group of people when he was stabbed by a man on 27 September. He previously told the BBC he required stitches for a cut to the mouth and his face is \"numb, and probably always will be, due to the cut\". Mr Butcher said he was \"fuming\" that Cambridgeshire Police stopped their investigation two days later. \"They could have taken it more seriously - I had five witnesses with me,\" he said. Read more from Sky News:Clifftop residents told to leave because storm could destroy their homesWhat is a weather bomb and how often do they affect the UK? Cambridgeshire Police said in November that it had commissioned an internal review of events, including Mr Butcher's case, prior to a mass stabbing on an LNER train service from Doncaster to King's Cross on 1 November. Anthony Williams, 32, is charged with 10 counts of attempted murder over the Huntingdon incident. An IOPC spokesperson said on Thursday: \"Our independent investigation into the police complaint from a man who was injured during a reported assault incident in Fletton, Peterborough on 27 September 2025 is progressing. \"The complaint relates to Cambridgeshire Constabulary's investigation into the incident at the time. \"In January, we notified two Cambridgeshire police constables that they are being investigated for potential gross misconduct, which relates to alleged failures to properly investigate the incident. \"This does not mean that disciplinary proceedings will necessarily follow. \"At the end of our investigation, we'll decide whether any officers should face disciplinary proceedings. \"Our investigation began following a referral from the force in November 2025.\""
    },
    {
        "title": "Internet and phone connections cut in Iran as protests intensify ",
        "description": "Internet access and phone lines were cut in Iran as anti-government protests intensified on Thursday night. ",
        "url": "https://news.sky.com/story/internet-and-phone-connections-cut-in-iran-as-protests-intensify-13492207",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-protest_7130681.png?20260108225818",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:40:00",
        "Headline": "Demonstrators marched in Tehran, Mashhad and Isfahan, chanting  \"death to the dictator\" and \"death to the Islamic Republic\".",
        "Content": "Internet access and phone lines were cut in Iran as anti-government protests intensified on Thursday night.  Protesters took to the streets in the capital Tehran and the major cities of Mashhad and Isfahan, witnesses reported. They chanted slogans against the country's clerical rulers that included \"death to the dictator\" and \"death to the Islamic Republic\". A nationwide internet blackout was reported by internet monitoring group NetBlocks, and internet firm CloudFlare, as protests over economic hardships continued around the country. Both attributed the outage to Iranian government interference. Attempts to dial landlines and mobile phones from Dubai to Iran could not be connected. Iran's economic crisis has sparked demonstrations against its theocratic government and Supreme Leader Ayatollah Ali Khamenei. The current protests, the biggest wave of dissent in three years, began last month in Tehran's ‍Grand Bazaar with shopkeepers condemning the rial currency's free fall. Unrest has since spread nationwide amid deepening distress over rocketing inflation. \n                  Inside Iran's protests: Gunfire, hospital raids and growing anger\n                 \n                  Why are people protesting in Iran? Everything you need to know\n                 \n                  Son of British woman detained in Iran describes 'criminal' government response\n                 Exiled crown prince Reza Pahlavi - whose father fled Iran just before the 1979 Islamic Revolution - has urged Iranians to protest. One chant heard on the streets praised the prince: \"This is the last battle. Pahlavi will return\". Demonstrators in Tehran erupted into chants when the clock stuck 8pm, witnesses said. \"Great nation of Iran, the eyes of the world are upon you. Take to the streets and, as a united front, shout your demands,\" Mr Pahlavi said in a statement. \"I warn the Islamic Republic, its leader and the (Revolutionary Guard) that the world and (President Donald Trump) are closely watching you. Suppression of the people will not go unanswered.\" Praising the prince could be met with a death sentence under the current regime.Iran's economy has struggled under US sanctions and in the wake of the 12-day war with Israel. In December, the rial currency collapsed to its lowest ever against the American dollar, reaching 1.4 million to $1. So far, violence from the demonstrations has killed at least 39 people and more than 2,260 people, according to the US-based Human Rights Activists News Agency. Read more:Inside Iran's protests: Gunfire, hospital raids and angerEverything you need to know about Iran protests Inflation has also skyrocketed to about 40%, intensifying the unrest and spreading fears about food insecurity. President Masoud Pezeshkian warned domestic suppliers against ⁠hoarding or overpricing goods on Thursday, according to state media. \"People should not feel any shortage in terms ‍of goods, supply and distribution,\" he said Iranian officials have offered no acknowledgment of the scale of the protests, and have not reported security officials being hurt or killed. US President Donald Trump has vowed to come to the aid of protesters if security forces opened fire on them. Some incidents have been reported by local media, including Iranian outlet Mizan news agency reporting a police colonel had suffered fatal stab wounds in a town outside of Tehran. The Fars news agency said gunmen had killed two security force members and wounded 30 others in a shooting in the city of Lordegan in Chaharmahal and Bakhtiari province. A deputy governor in Iran's Khorasan Razavi province told Iranian state television that an attack at a police station killed five people Wednesday night in Chenaran about 430 miles (700km) northeast of Tehran."
    },
    {
        "title": "Clifftop residents told to leave because Storm Goretti could destroy their homes",
        "description": "Residents of 14 clifftop homes in Hemsby, Norfolk, have been told to leave because Storm Goretti leaves them in danger of \"imminent collapse\" onto the beach below.",
        "url": "https://news.sky.com/story/clifftop-residents-told-to-leave-because-storm-goretti-could-destroy-their-homes-13492112",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-erosion-hemsby-norfolk_7130378.jpg?20260108161212",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 15:54:00",
        "Headline": "Fourteen properties in Hemsby, Norfolk, face \"imminent collapse on to the beach\". Owners told they should not be occupied on Thursday night and over the weekend.   ",
        "Content": "Residents of 14 clifftop homes in Hemsby, Norfolk, have been told to leave because Storm Goretti leaves them in danger of \"imminent collapse\" onto the beach below. The owners of properties on the Marrams and Fakes Road have been told evacuation is necessary on Thursday night and over the weekend because of the risk of cliff falls. Great Yarmouth Borough Council said: \"We have been liaising closely with people affected by erosion in Hemsby for some time, but the recent spate of storms and forecast of further damage from Storm Goretti means some properties are now in an even more precarious position. ''It is extremely traumatic for those affected, but coastal experts say there is a real risk of collapse.\" The council - the local coastal management authority - said on Thursday that more than 10m (32ft) of land had already been \"lost to erosion in recent bad weather\". The risk of \"further substantial damage from Storm Goretti\" over the coming days meant the properties faced \"imminent collapse\", it added. Storm Goretti live updates \n                  Man 'carrying handgun' shot and killed by police after crash in Norfolk\n                 \n                  Unsafe meat warning after 70 butchered geese are dumped by the  roadside \n                 \n                  Mystery foam on river in Thetford sparks Environment Agency investigation\n                 The council said that \"safe demolition\" now needed to be carried out. The warning was issued following an assessment of the cliff line and close monitoring.\"Making sure residents and the public are safe is of paramount importance so we are working closely with owners to explain the risks, offer support and advice where necessary and detail the options available to people at this very difficult time,\" a council spokesperson said. Homeowners affected by the latest demolition order have been urged to seek support and advice from council staff in the village. Hemsby has been impacted by coastal erosion for years, with other residents being forced out of their homes as the coast line receded. Read more:Storm Goretti hits EuropeWhat is a weather bomb? ''It is deeply upsetting for homeowners but doing nothing is simply not an option with the rate of erosion we face,\" the spokesperson said.''Our coastline is one of the fastest eroding in northern Europe and climate change means there will inevitably be further loss of land. \"How we plan for that and provide appropriate support and information about the options available to people is of paramount importance.\" Hemsby residents have been urged to stay clear of the dune face and pay extra attention when walking in the area. Some parts of the beach may be closed for safety, the council said."
    },
    {
        "title": "Starmer says 'more could be done to protect' the Arctic amid 'Russian aggression' in call to Trump",
        "description": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-says-more-needs-to-be-done-to-protect-the-arctic-in-call-to-trump-13492200",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7129882.jpg?20260108004851",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:19:00",
        "Headline": "The UK's prime minister has a call with the US president for a second time in two days as the pair discuss the \"need to deter an increasingly aggressive Russia in the High North\".",
        "Content": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said. Amid a flurry of diplomatic activity, Sir Keir spoke to Mr Trump about \"Euro-Atlantic security\" in the wake of fears the US president may use military force to take Greenland, having captured Venezuela's Nicola Maduro. Mr Trump has repeatedly said that the US needs Greenland, the largest island in the Arctic, as \"Greenland is very important for the national security of the United States, Europe, and other parts of the free world\". US officials have said they could use \"military means\" to \"acquire\" the semi-autonomous Danish territory. This is despite Danish Prime Minister Mette Frederiksen warning that NATO would be under threat in the event of a US invasion of the territory. Sir Keir has said previously said that decisions about Greenland's future should be made solely by its people and Denmark. On Wednesday, he reiterated that view to Mr Trump in a call described by Downing Street sources as \"positive\" and \"friendly\". But in a second conversation on Thursday, the two leaders discussed deterring Russia in the High North, which includes Greenland. A statement from Downing Street about the call said: \"The leaders discussed Euro-Atlantic security and agreed on the need to deter an increasingly aggressive Russia in the High North. \"European Allies had stepped up in recent months to defend Euro-Atlantic interests, but more could be done to protect the area, the Prime Minister said. \"The leaders looked forward to speaking again soon.\" It came as Sir Keir also spoke to NATO chief Mark Rutte about the \"High North\". In a Downing Street statement about Sir Keir's call with Mr Rutte, No 10 said: \"They agreed that more needed to be done to deter Russia in the High North and welcomed discussions on how Allies could further protect the region from increasing Russian threats.\" Sir Keir also spoke to the Danish prime minister, reiterating his position that Britain \"stood\" with Denmark. Reuters reported that Sir Keir told Ms Frederickson that ‌Britain stood with Denmark ​in its defence of Greenland, and the ⁠leaders also ‌discussed Ukraine. Sir Keir had been criticised by Conservative leader Kemi Badenoch in the last few days for failing to talk to the US president after the US carried out its raid to seize Mr Maduro and subsequent seizure of two oil tankers - one of which involved UK forces in the North Atlantic. In a joint statement, widely seen as a message to the US, the UK and European allies vowed earlier this week that they would \"not stop defending\" Greenland's territorial integrity. Sir Keir has also faced pressure to rule out any US use of UK bases to support an attack on Greenland. Read more from Sky News:Tens of thousands flee fighting in Aleppo, SyriaProtests spread across Iran Deputy Prime Minister David Lammy was set to underline the closeness of the \"special relationship\" between the UK and the US during a meeting with US vice president JD Vance in Washington on Thursday. Mr Lammy's visit to the US marks the 250th anniversary of America's declaration of independence from Britain. Speaking at the White House earlier on Thursday, Mr Vance said the US president's words on Greenland should be taken seriously. \"Greenland is really important not just to America's missile defence, but to the world's missile defence,\" the vice president said. \"So what we're asking our European friends to do is to take the security of that landmass more seriously, because if they're not, the United States is going to have to do something about it. \"What that is, I'll leave that to the president as we continue to engage in diplomacy with our European friends and everybody on this particular topic.\" Danish and Greenland envoys to Washington have been involved in a furious effort over the last few days to urge key Trump administration officials to step back from Mr Trump's call for a takeover of the strategic island. Denmark's ambassador to the US, Jesper Moller Sorensen, and Jacob Isbosethsen, Greenland's chief representative to Washington, met on Thursday with White House National Security Council officials, Associated Press reported. Sky News understands the pair also met with White House officials to seek a better understanding of US policy on Greenland but sources declined to say who from the Trump Administration participated in the discussions. While military force was one option to achieve Mr Trump's stated aim, the purchase of the territory is another, US officals have said, and US secretary of state ‌Marco Rubio is expected to meet with ⁠Danish officials next week in Washington."
    },
    {
        "title": "Probe into police response to attack linked to Huntingdon train stabbings",
        "description": "Two police officers are being investigated for potential gross misconduct over alleged failures to properly investigate an attack potentially linked to the Huntingdon train stabbings.",
        "url": "https://news.sky.com/story/probe-into-police-response-to-attack-linked-to-huntingdon-train-stabbings-13492234",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-police-probe_7130670.jpg?20260108223508",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 22:10:00",
        "Headline": "Two Cambridgeshire police constables are being investigated for potential  misconduct, relating to alleged failures over an attack in Peterborough.",
        "Content": "Two police officers are being investigated for potential gross misconduct over alleged failures to properly investigate an attack potentially linked to the Huntingdon train stabbings. Ricky Butcher said he was outside Fletton Club in Peterborough waiting for a taxi with a group of people when he was stabbed by a man on 27 September. He previously told the BBC he required stitches for a cut to the mouth and his face is \"numb, and probably always will be, due to the cut\". Mr Butcher said he was \"fuming\" that Cambridgeshire Police stopped their investigation two days later. \"They could have taken it more seriously - I had five witnesses with me,\" he said. Read more from Sky News:Clifftop residents told to leave because storm could destroy their homesWhat is a weather bomb and how often do they affect the UK? Cambridgeshire Police said in November that it had commissioned an internal review of events, including Mr Butcher's case, prior to a mass stabbing on an LNER train service from Doncaster to King's Cross on 1 November. Anthony Williams, 32, is charged with 10 counts of attempted murder over the Huntingdon incident. An IOPC spokesperson said on Thursday: \"Our independent investigation into the police complaint from a man who was injured during a reported assault incident in Fletton, Peterborough on 27 September 2025 is progressing. \"The complaint relates to Cambridgeshire Constabulary's investigation into the incident at the time. \"In January, we notified two Cambridgeshire police constables that they are being investigated for potential gross misconduct, which relates to alleged failures to properly investigate the incident. \"This does not mean that disciplinary proceedings will necessarily follow. \"At the end of our investigation, we'll decide whether any officers should face disciplinary proceedings. \"Our investigation began following a referral from the force in November 2025.\""
    },
    {
        "title": "Anthony Joshua pays tribute to 'special' friends killed in Nigeria crash",
        "description": "Anthony Joshua has paid tribute to his two close friends killed in a car crash in Nigeria, which also injured the star boxer.",
        "url": "https://news.sky.com/story/anthony-joshua-pays-tribute-to-special-friends-killed-in-nigeria-crash-13491880",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-anthony-joshua-boxer_7080597.jpg?20251112230721",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 13:50:00",
        "Headline": "Latif Ayodele and Sina Ghami died when an SUV, also carrying the 36-year-old boxer, hit a stationary truck on a road near Lagos.",
        "Content": "Anthony Joshua has paid tribute to his two close friends killed in a car crash in Nigeria, which also injured the star boxer. In a post on Instagram, the 36-year-old said: \"Thank you for all the love and care you have shown my brothers. I didn't even realise how special they are. \"I'll just be walking with them and cracking jokes with them, not even knowing God kept me in the presence of great men. 100% it's tough for me, but I know it's even tougher for their parents ❤️ I have a strong mind, and I believe God knows their hearts. May God have mercy on my brothers 🙏🏾.\" Joshua, a two-time world champion, was travelling in the back of a black SUV when it struck a stationary truck on a major road near Lagos on 29 December, killing his friends Latif Ayodele and Sina Ghami. The son of ‍British-Nigerian parents, Joshua had been on holiday with his friends following his knockout victory over US YouTuber turned-boxer Jake Paul in Miami on 19 December. Joshua suffered minor injuries in the crash and was taken to hospital for treatment. He was discharged on New Year's Eve. Mr Ghami, who had been part of Joshua's team for more than a decade, was a qualified sports and exercise rehabilitator specialising in musculoskeletal injuries and corrective exercise. Mr Ayodele, an old friend of the boxer, was a personal trainer. The driver of the Lexus SUV, Adeniyi Mobolaji Kayode, has been charged on four counts including dangerous driving causing death and driving without a valid national licence. Read more:Anthony Joshua gives first public update since Nigeria crashAnthony Joshua's driver charged over Nigeria crash that killed two The case has been adjourned to 20 January for trial. The defendant was granted bail in the sum of 5,000,000 Naira (£2,578) and was remanded pending his bail conditions being met."
    },
    {
        "title": "Attempted murderer who escaped from 23 year prison sentence is recaptured",
        "description": "A man who absconded from prison while serving a 23-year sentence for attempted murder has been taken back into custody, police have said.",
        "url": "https://news.sky.com/story/man-serving-23-year-sentence-for-attempted-murder-who-absconded-from-prison-recaptured-13492178",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-kieran-cameron-cheshire-police_7129810.jpg?20260108193107",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 19:22:00",
        "Headline": "Kieran Cameron, 43, was reported missing from HMP Thorn Cross, an open prison in Warrington, Cheshire, on Tuesday evening.",
        "Content": "A man who absconded from prison while serving a 23-year sentence for attempted murder has been taken back into custody, police have said. Kieran Cameron, 43, was reported missing from HMP Thorn Cross, an open prison in Warrington, Cheshire, at 9.20pm on Tuesday. Cameron was handed his prison sentence for an attempted murder in Dorset in 2016. Read more from Sky News:Bodies of man and boy discovered at separate homes in DublinMan pleads guilty to attempted murder of soldier near barracks He is known to have extensive links to Manchester, Liverpool and Dorset, Cheshire Police said. The force said on Thursday evening that Cameron had been arrested in the Hulme area of Manchester by officers from the Cheshire Police Serious and Organised Crime unit. In an appeal on Wednesday, members of the public were warned not approach him and to call 999 immediately if they came into contact with him."
    },
    {
        "title": "Increasing numbers of women are dying during pregnancy or in the weeks after giving birth",
        "description": "Increasing numbers of women in the UK are dying during pregnancy or in the weeks after giving birth, according to new figures.",
        "url": "https://news.sky.com/story/maternal-death-rate-up-by-20-as-government-fails-to-meet-2025-target-13492085",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maternity-doctor_7130353.jpg?20260108154113",
        "type": "UK",
        "Author": "Laura Bundock, Health correspondent",
        "Date Published": "2026-01-08 15:17:00",
        "Headline": "Official data found there were 252 maternal deaths from 2022 to 2024, which is 20% higher than the rates from 2009 to 2011.",
        "Content": "By Laura Bundock, Health correspondent  Increasing numbers of women in the UK are dying during pregnancy or in the weeks after giving birth, according to new figures. The upward trend means the government has failed to meet its target to halve maternal death rates by 2025. Official data found there were 252 maternal deaths from 2022 to 2024, which is 20% higher than the rates from 2009 to 2011. This is the equivalent of 12.8 deaths for every 100,000 women giving birth. The figures are from MBRRACE-UK, the official body auditing deaths among mothers and babies. The investigation also finds inequalities, with mortality rates for women from black ethnic backgrounds in 2022 to 2024 three times higher than that of white women. That's despite the rates previously starting to fall. Women from the most deprived areas of the UK continue to have mortality rates almost twice that of women living in the least deprived areas. \n                  UK weather latest: Airport shuts runway as Storm Goretti hits UK with heavy snow and 99mph winds\n                 \n                  Snow and wind in Derbyshire is 'pretty relentless' as Storm Goretti sweeps across UK\n                 \n                  Clifftop residents told to leave because Storm Goretti could destroy their homes\n                 Blood clots are the leading cause of maternal death either during pregnancy or in the six weeks after giving birth, while suicide is the leading cause of maternal deaths happening from six weeks to a year after birth. Read more from Sky News:Delayed discharges cost NHS Scotland £440m a yearWhy you should leave heating on if you go away in winter The national target was set by the previous government in 2015, when then-health secretary Jeremy Hunt announced his ambition to reduce maternal deaths by 50%. The original target date was set for 2030, but it was later brought forward to 2025. Professor Marian Knight, director of the National Perinatal Epidemiology Unit and MBRRACE-UK programme lead, said: \"These latest data highlight the need for a renewed focus on maternal mortality and the critical actions required to ensure safe and equitable maternity care for all women in the UK.\" Kate Brintworth, chief midwifery officer for England, said: \"Every death in pregnancy and childbirth is a tragedy and these figures show how much more work is needed to prevent more deaths and address the unacceptable inequalities that persist for families across the country. \"That is why this week we have set out new best-practice standards across maternity services, including to ensure earlier and more consistent assessment for blood clots, and improved identification and care for perinatal mental health concerns. \"Alongside this, the NHS is continuing to strengthen maternity care through specialist treatment centres ensuring women with pre-existing medical conditions or high-risk pregnancies can quickly access expert care, dedicated mental health support for expectant and new mums, and closer oversight of maternity units.\" A Department of Health and Social Care (DHSE) spokesperson said that from this week, the government is rolling out guidance across the NHS to tackle the leading causes of maternal death including thrombosis, mental health, epilepsy and haemorrhage. The government is also investing over £130m to make maternity and neonatal units safer, rolling out a programme to reduce avoidable brain injuries, and backing Martha's Rule so families are always heard when they raise concerns, the spokesperson said. The DHSE spokesperson added: \"It is unacceptable that some women face far greater risks than others simply because of their ethnicity or where they live, and addressing these inequalities is a priority. \"The Secretary of State has ordered a rapid national investigation to make recommendations to urgently improve care, including identifying the drivers of inequalities, and will chair a taskforce to address these deep-rooted issues.\" If you have suffered from birth trauma and would like to share your story, contact Sky News by messaging us on WhatsApp +44 7583 000853, emailing news@skynews.com or using 'Your Report' on the Sky News app."
    },
    {
        "title": "'Get a grip' on Grok, Starmer tells X after AI tool is used for child sex images",
        "description": "An artificial intelligence (AI) tool producing sexualised images of children will not be tolerated and is \"disgusting\" and \"unlawful\", the prime minister has said.",
        "url": "https://news.sky.com/story/get-a-grip-on-grok-starmer-tells-x-after-ai-tool-is-used-for-child-sex-images-13492111",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-grok_7130381.png?20260108174350",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 15:37:00",
        "Headline": "PM says the \"disgusting\" unlawful use of Grok will not be tolerated. He warns action will be taken by Ofcom and that all options are on the table.",
        "Content": "An artificial intelligence (AI) tool producing sexualised images of children will not be tolerated and is \"disgusting\" and \"unlawful\", the prime minister has said. Sir Keir Starmer said social media platform X has \"got to get a grip of\" its AI tool, Grok, and that he's asked media regulator, Ofcom, for \"all options to be on the table\". It follows reports from the Internet Watch Foundation (IWF) that criminals have been using Grok to create child sexual abuse imagery. Politics live - follow latest Grok is an AI tool that X users can instruct to find out information, answer questions and create images. The IWF revealed this week it had discovered criminal sexualised imagery of children aged between 11 and 13 that had been created by Grok. Speaking to Greatest Hits Radio on Thursday, the prime minister said: \"This is disgraceful. It's disgusting. And it's not to be tolerated. \"X has got to get a grip of this. And Ofcom has our full support to take action in relation to this. This is wrong.\" X and xAI - which produces Grok - are both owned by tech billionaire Elon Musk, and have been under fire for a number of days after a new feature led to users seeing AI-generated sexualised images of themselves on X. Sir Keir added: \"It's unlawful. We're not going to tolerate it. I've asked for all options to be on the table. \"It's disgusting. And X need to get their act together and get this material down. And we will take action on this because it's simply not tolerable.\" Earlier in the day, former Labour cabinet minister Louise Haigh urged the PM and the rest of government to quit the social media platform. She said: \"I call on my party and my government to remove themselves entirely from X and communicate with the public where they actually participate online and can be protected from such illegality.\" Asked whether the government could stop using X on Wednesday, a Downing Street spokesperson said: \"All options are on the table.\" They replied the same way when asked whether the prime minister was accepting images like this by continuing to use X. But the spokesperson added that Ofcom had their \"full backing to take action on failings by firms\". Ofcom has asked X to clarify how it is complying with data protection law over the AI images. Technology Secretary Liz Kendall called on X to take \"urgent\" action earlier this week. Sky News has contacted X for comment. The site's Safety account earlier this week read: \"We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. \"Anyone using or prompting Grok to make illegal content will suffer the same consequences as if they upload illegal content.\""
    },
    {
        "title": "Watchdog to examine West Midlands Police role in Maccabi Tel Aviv fans ban",
        "description": "The police watchdog has told Sky News it will assess evidence provided by West Midlands Police to MPs and consider the findings of a review into how its intelligence assessment was used to ban Maccabi Tel Aviv fans from Aston Villa.",
        "url": "https://news.sky.com/story/watchdog-to-examine-west-midlands-police-role-in-maccabi-tel-aviv-fans-ban-13492092",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-maccabi-tel-aviv-aston-villa_7128295.jpg?20260106173048",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2026-01-08 15:19:00",
        "Headline": "The IOPC will assess police evidence to MPs and consider the force's review into how intelligence was used to ban Israeli fans from an Aston Villa match.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n The police watchdog has told Sky News it will assess evidence provided by West Midlands Police to MPs and consider the findings of a review into how its intelligence assessment was used to ban Maccabi Tel Aviv fans from Aston Villa. The force is accused of misrepresenting the threat to justify advocating the exclusion of the Israeli club's fans from the Europa League match in Birmingham in November. An Independent Office for Police Conduct (IOPC) spokesperson told Sky News: \"It is right for public confidence and police accountability that the force's involvement in the decision-making process is examined by all relevant organisations, including the IOPC.\" West Midlands Police (WMP) has already had to apologise for providing misleading evidence to the Home Affairs Select Committee. The force's leadership faced further scrutiny from MPs on Tuesday about why they had only just revealed details of concerns about the local community in Birmingham apparently wanting to \"arm\" themselves against Maccabi fans. Conservative leader Kemi Badenoch has called for the resignation of Chief Constable Craig Guildford, claiming he presented an \"inversion of reality and misled a parliamentary committee\". The force told MPs on 1 December that the local Jewish community backed the ban on Maccabi fans from the Europa League match in November, but it later apologised to the committee and said there was \"never any intention to mislead whatsoever\". In a rare move, Mr Guildford was recalled to face questions for the second time in two months by the Home Affairs Select Committee. \"It is important for us to assess all available evidence before we make decisions over whether we should undertake any independent conduct investigations,\" the IOPC spokesperson said. \"That includes evidence provided to the Home Affairs Select Committee, plus a review by His Majesty's Inspectorate of Constabulary, Fire & Rescue Services (HMICFRS) of the intelligence picture and risk assessment provided by West Midlands Police to the Safety Advisory Group which helped inform the decision to ban Maccabi Tel Aviv fans from the match. That report is expected to be available soon and we will consider its findings.\" 'Significant levels of hooliganism' WMP only revealed why it wanted Maccabi fans banned hours before the match in an interview with Sky News. While the threat to Israelis was a \"consideration\", Chief Superintendent Tom Joyce said it was \"not the primary driver\". He instead referenced intelligence about Maccabi's own \"significant levels of hooliganism\". Maccabi has acknowledged it has a problem with violence and anti-Palestinian racism in parts of its fan base, which led to a recent UEFA punishment. But it was only revealed by WMP this week that in early September, days after the Europa League draw by UEFA paired Villa with Maccabi, the force already had \"high confidence intelligence\" of \"elements of the community in West Midlands wanting to 'arm' themselves\". That was not clear in meetings of minutes of a safety advisory group only recently released. 'Capitulated to Islamists' WMP confirmed to MPs on Tuesday it was concerned about \"vigilante groups\" attacking Maccabi fans but also said Israelis were found online \"goading local community members\". Committee chair Dame Karen Bradley MP said: \"It feels to us, from everything we've seen, that there was a need that you felt, that you had to justify banning these fans, and that scraping was done to find a reason.\" Mr Guildford responded: \"That was absolutely not the case.\" Ms Badenoch said West Midlands Police had \"capitulated to Islamists and then collaborated with them to cover it up\". She added: \"They knew extremists were planning to attack Jews for going to a football match, and their response was to blame and remove Jewish people instead.\" The force did not respond to a fresh request for comment today. The IOPC said it had not received any conduct or complaint referrals from WMP or the West Midlands police and crime commissioner about the conduct of individuals at the force. \"We have liaised with both and will continue to monitor the situation,\" the watchdog said. \"Should we receive any referrals they will be thoroughly examined.\""
    },
    {
        "title": "Gabby Logan pays tribute to her father, Welsh football legend Terry Yorath",
        "description": "Gabby Logan has paid tribute to her father, former Leeds United and Wales midfielder Terry Yorath, who died at the age of 75 following a short illness.",
        "url": "https://news.sky.com/story/terry-yorath-former-leeds-footballer-and-father-of-gabby-logan-dies-aged-75-13491929",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gabby-logan-glasgow_7130106.jpg?20260108103434",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2026-01-08 09:21:00",
        "Headline": "\"To us he was Dad; a quiet, kind and gentle man,\" Yorath's children have said in a joint statement. \"Our hearts are broken.\" ",
        "Content": "Gabby Logan has paid tribute to her father, former Leeds United and Wales midfielder Terry Yorath, who died at the age of 75 following a short illness. The BBC Sport presenter posted a picture of her father playing for Wales on Instagram today, saying: \"Rest in Peace Dad. \"Our hearts are broken. Your love and legacy lives on.\" The post also included other images from his football career. Yorath made close to 200 appearances for Leeds during a nine-year spell in the 1960s and 70s and was a member of the team that won the 1974 First Division title. A year later, he became the first Welshman to play in a European Cup final. He also had spells as a player with Coventry City, Tottenham Hotspur and Bradford City. Yorath also made 59 appearances for Wales. In a statement, his children said: \"To most he was a revered footballing hero, but to us he was Dad; a quiet, kind and gentle man. Our hearts are broken but we take comfort knowing that he will be reunited with our brother, Daniel.\" Read more from Sky News:How UK helped US seize tanker - and how it tried to escapeWhat is a weather bomb and how often do they affect the UK? In addition to Gabby Logan, Yorath had three other children - Daniel, Louise and Jordan. Daniel died from the genetic heart condition hypertrophic cardiomyopathy aged 15 in 1992 while playing football at home with his father. Logan left Wednesday's Match of the Day programme part-way through and was replaced by Mark Chapman, who confirmed it was due to \"a family emergency\". Yorath moved into management in 1986 after retiring from playing, with spells in charge of clubs including Swansea City, Bradford City and Cardiff City. He was a player-coach at Bradford in May 1985 and in the dugout at the Valley Parade fire, which killed 56 fans and injured 270 during a match against Lincoln City. Yorath also had stints in charge of the Wales and Lebanon national teams in the 1980s and 90s, and guided his country to the brink of the World Cup finals."
    },
    {
        "title": "Starmer says 'more could be done to protect' the Arctic amid 'Russian aggression' in call to Trump",
        "description": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-says-more-needs-to-be-done-to-protect-the-arctic-in-call-to-trump-13492200",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7129882.jpg?20260108004851",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:19:00",
        "Headline": "The UK's prime minister has a call with the US president for a second time in two days as the pair discuss the \"need to deter an increasingly aggressive Russia in the High North\".",
        "Content": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said. Amid a flurry of diplomatic activity, Sir Keir spoke to Mr Trump about \"Euro-Atlantic security\" in the wake of fears the US president may use military force to take Greenland, having captured Venezuela's Nicola Maduro. Mr Trump has repeatedly said that the US needs Greenland, the largest island in the Arctic, as \"Greenland is very important for the national security of the United States, Europe, and other parts of the free world\". US officials have said they could use \"military means\" to \"acquire\" the semi-autonomous Danish territory. This is despite Danish Prime Minister Mette Frederiksen warning that NATO would be under threat in the event of a US invasion of the territory. Sir Keir has said previously said that decisions about Greenland's future should be made solely by its people and Denmark. On Wednesday, he reiterated that view to Mr Trump in a call described by Downing Street sources as \"positive\" and \"friendly\". But in a second conversation on Thursday, the two leaders discussed deterring Russia in the High North, which includes Greenland. A statement from Downing Street about the call said: \"The leaders discussed Euro-Atlantic security and agreed on the need to deter an increasingly aggressive Russia in the High North. \"European Allies had stepped up in recent months to defend Euro-Atlantic interests, but more could be done to protect the area, the Prime Minister said. \"The leaders looked forward to speaking again soon.\" It came as Sir Keir also spoke to NATO chief Mark Rutte about the \"High North\". In a Downing Street statement about Sir Keir's call with Mr Rutte, No 10 said: \"They agreed that more needed to be done to deter Russia in the High North and welcomed discussions on how Allies could further protect the region from increasing Russian threats.\" Sir Keir also spoke to the Danish prime minister, reiterating his position that Britain \"stood\" with Denmark. Reuters reported that Sir Keir told Ms Frederickson that ‌Britain stood with Denmark ​in its defence of Greenland, and the ⁠leaders also ‌discussed Ukraine. Sir Keir had been criticised by Conservative leader Kemi Badenoch in the last few days for failing to talk to the US president after the US carried out its raid to seize Mr Maduro and subsequent seizure of two oil tankers - one of which involved UK forces in the North Atlantic. In a joint statement, widely seen as a message to the US, the UK and European allies vowed earlier this week that they would \"not stop defending\" Greenland's territorial integrity. Sir Keir has also faced pressure to rule out any US use of UK bases to support an attack on Greenland. Read more from Sky News:Tens of thousands flee fighting in Aleppo, SyriaProtests spread across Iran Deputy Prime Minister David Lammy was set to underline the closeness of the \"special relationship\" between the UK and the US during a meeting with US vice president JD Vance in Washington on Thursday. Mr Lammy's visit to the US marks the 250th anniversary of America's declaration of independence from Britain. Speaking at the White House earlier on Thursday, Mr Vance said the US president's words on Greenland should be taken seriously. \"Greenland is really important not just to America's missile defence, but to the world's missile defence,\" the vice president said. \"So what we're asking our European friends to do is to take the security of that landmass more seriously, because if they're not, the United States is going to have to do something about it. \"What that is, I'll leave that to the president as we continue to engage in diplomacy with our European friends and everybody on this particular topic.\" Danish and Greenland envoys to Washington have been involved in a furious effort over the last few days to urge key Trump administration officials to step back from Mr Trump's call for a takeover of the strategic island. Denmark's ambassador to the US, Jesper Moller Sorensen, and Jacob Isbosethsen, Greenland's chief representative to Washington, met on Thursday with White House National Security Council officials, Associated Press reported. Sky News understands the pair also met with White House officials to seek a better understanding of US policy on Greenland but sources declined to say who from the Trump Administration participated in the discussions. While military force was one option to achieve Mr Trump's stated aim, the purchase of the territory is another, US officals have said, and US secretary of state ‌Marco Rubio is expected to meet with ⁠Danish officials next week in Washington."
    },
    {
        "title": "'Catastrophic' Australian bushfires force evacuations and school closures ",
        "description": "Uncontrolled bushfires raged in the Australian state of Victoria on Thursday, forcing communities to evacuate and hundreds of schools to close. ",
        "url": "https://news.sky.com/story/catastrophic-australian-bushfires-force-evacuations-and-school-closures-13492211",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-bushfire-australia_7130655.jpg?20260108221712",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:56:00",
        "Headline": "One fire in Victoria is so big it has created its own weather system. The \"dire\" conditions come as heatwave temperatures soar past 40C.",
        "Content": "Uncontrolled bushfires raged in the Australian state of Victoria on Thursday, forcing communities to evacuate and hundreds of schools to close.  The fire danger rating for tomorrow will be \"catastrophic\", the highest level, and both fires pose a significant risk of loss of life and property, authorities said. Two large bushfires burned near the towns of Longwood and Walwa as temperatures soared past 40C (104F) in parts of the state. The bushfires come amid an intense summer heatwave in Australia's south. Meteorologists have said conditions are on par with 2019, when bushfires destroyed large swathes of southeastern Australia, killing 33 people in what became known as the Black Summer. Read more from Sky News:Inside Iran's protests: Gunfire, hospital raids and growing angerVote to curb Trump's ability to take more Venezuela action Some 450 schools in Victoria are set to close on Friday and many regional train services will be cancelled. The Longwood fire now covers more than 25,000 hectares (61,776 acres), while the Walwa fire is 10,000 hectares (24,710 acres) and has created its own weather system, with a pyrocumulonimbus cloud causing lightning and thunder. Residents in dozens of neighbouring towns have been told to evacuate. \"Tomorrow is a very, very dire bushfire day in the state of Victoria,\" Country Fire Authority Chief Officer Jason Heffernan told a news conference. The fires have destroyed at least two structures and are expected to spread further on Friday as the wind and heat pick up. Total fire bans were issued in several districts on Thursday. A total fire ban will be imposed across the whole state on Friday. In New Zealand, MetService, the nation's weather provider, also warned of record warm temperatures over the weekend as the heatwave moves across the Tasman Sea. It has issued heat alerts for parts of the eastern coast of New Zealand and the north of the South Island."
    },
    {
        "title": "US senators vote to curb Trump's ability to take more Venezuela military action",
        "description": "The US Senate has voted for legislation that would bar Donald Trump from taking further military action against Venezuela without authorisation from Congress. ",
        "url": "https://news.sky.com/story/us-senators-vote-to-curb-trumps-ability-to-take-more-venezuela-military-action-13492164",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-republicans_7128175.jpg?20260106151650",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-08 18:10:00",
        "Headline": "Republicans are among those backing a resolution to stop the US president using more force in the South American country without Congress approval.",
        "Content": "The US Senate has voted for legislation that would bar Donald Trump from taking further military action against Venezuela without authorisation from Congress.  The war powers resolution was carried with 52 to 47 votes, as five Republicans joined the Democrats to back it. Another Republican declined to vote. Their decision ensures a vote on the final passage of the legislation next week. But it has virtually no chance of becoming law because it would also need to be passed by the Republican majority House of Representatives. It would also need to get two-thirds ‍majorities in both the House and the Senate to survive an expected veto from Mr Trump. The president has criticised the Republican senators who voted to support the motion on Thursday. \"Susan Collins, Lisa Murkowski, Rand Paul, ‌Josh Hawley, and Todd Young ‌should never ‍be elected to office again,\" Mr Trump said in a social media post. He added Republicans should be \"ashamed of the Senators that just voted with Democrats in ‌attempting to take away our powers to fight and defend the United States of America\". \n                  'Extremely dangerous situation': Ex-Danish PM reacts to US 'act of aggression' over Greenland\n                 \n                  Trump's Greenland claim is preposterous. My visit shows why\n                 \n                  Three reasons why Trump wants Greenland - and how he might achieve it\n                 The vote came after US forces seized Venezuelan president Nicolas Maduro in a military operation in Caracas on Saturday. Following Maduro's capture, the Trump administration came under criticism from Democrats for misleading Congress on plans for regime change in Venezuela. Thursday's vote was a significant victory for lawmakers who have argued that Congress rather than the president should have the power to declare war, as set out in the US constitution. Kentucky Republican Senator Rand Paul, who co-sponsored the resolution, said the resolution had gained increasing support among Republicans \"It's interesting to see that more people, at least on my side, now are interested in who has the war prerogative, who was the prerogative to initiate or declare war,\" he said after Thursday's vote. But Senator Jim Risch of Idaho, the Republican chairman of the foreign relations panel, said in a ‍Senate speech before the vote that it would achieve little. \"The purpose of this resolution is to slap the president in the face,\" he said. \"It will do nothing that it purports to do because it can't stop something that isn't going on right now.\" 👉 Tap here to follow Trump100 wherever you get your podcasts👈  Meanwhile on Thursday, Venezuela's top lawmaker, Jorge Rodriguez, said significant number of prisoners would be released during the day as a gesture of peace. The move follows repeated requests from Venezuelan opposition figures to release political prisoners held under the Maduro regime. Venezuelan rights group Foro Penal estimated there were 863 political prisoners in the country, including political figures,human rights activists, protesters and journalists. Read more:US to control Venezuela oil sales 'indefinitely'What we know about 'ghost' tankers seized by US Republicans blocked two previous attempts to push similar resolutions in the Senate last year, as the Trump administration ramped up military pressure on Venezuela. The vote blocking the last resolution in November was passed with only 51 to 49 votes. This came soon after Trump advisers told lawmakers they did not plan to change the government or conduct strikes on Venezuelan territory. Trump's rhetoric and recent events in Venezuela have also raised concerns ‌that he might take military action to capture Greenland. Maduro will stand trial on drugs and weapons charges in New York, to which he has pleaded not guilty."
    },
    {
        "title": "NASA will bring astronauts home early from ISS over medical issue",
        "description": "NASA will bring back a crew from the ISS earlier than planned because of a medical issues.",
        "url": "https://news.sky.com/story/nasa-considering-bringing-astronauts-home-early-from-iss-over-medical-issue-13492010",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iss-space-crew-11_7130227.jpg?20260108130824",
        "type": "World",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-08 12:48:00",
        "Headline": "Crew-11 has been on the International Space Station since August last year and was due to return around May this year, but will now come home in the coming days. ",
        "Content": "\n          Science and technology reporter\n       NASA will bring back a crew from the ISS earlier than planned because of a medical issues. Hours before, the space agency cancelled a spacewalk that was scheduled for Thursday. A NASA spokeswoman said the astronaut, who wasn't named for medical privacy reasons, was ‌in a stable condition on the ISS. \"It's not an emergency evacuation, but we are erring on the side of caution for the crew member,\" said Dr James Polk, NASA's chief health and medical officer. Crew-11 has been on the ISS since August last year and was due to return around May this year. The station's designated commander, Mike Fincke, and Zena Cardman, the flight engineer, were supposed to conduct a 6.5-hour spacewalk on Thursday to install hardware outside the station. A NASA spokeswoman told Sky News earlier on Thursday that safety was the \"highest priority\", and the agency \"was actively evaluating ‍all options, including the possibility of an earlier end to Crew-11's mission\". \n                   From bone damage to solar radiation - inside the lab trying to protect the astronauts of the future\n                 \n                  SpaceX brings new crew to International Space Station in just 15 hours - but it's still short of Russian record\n                 \n                  Oldest serving US astronaut returns from space on 70th birthday\n                 Spacewalks are dangerous and take a lot of planning. It's not uncommon for NASA to cancel them if something isn't quite right. In 2024, a spacewalk was cancelled last-minute because an astronaut experienced \"spacesuit discomfort\". In 2021, astronaut Mark Vande Hei called off his spacewalk over a pinched nerve. The four-person Crew-11 crew includes the US astronauts Cardman and Fincke, as well as Japanese astronaut Kimiya Yui and Russian cosmonaut Oleg Platonov. Read more about space:Inside the lab trying to protect the astronauts of the futureRacing to replace the International Space Station Some of the crew had volunteered to take part in experiments to address health challenges astronauts may face on deep space missions, according to NASA - although there is no suggestion this is linked. The crew are taking part in simulated moon landings, as well as eye and brain tests, MRI scans and other medical exams. There's been a constant presence on the ISS for over 25 years, with astronauts rotating in and out on missions that can last over a year. Generally, though, missions last between six and eight months. In order to bring a crew home early, the space agency will need to coordinate its replacement."
    },
    {
        "title": "Internet and phone connections cut in Iran as protests intensify ",
        "description": "Internet access and phone lines were cut in Iran as anti-government protests intensified on Thursday night. ",
        "url": "https://news.sky.com/story/internet-and-phone-connections-cut-in-iran-as-protests-intensify-13492207",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iran-protest_7130681.png?20260108225818",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:40:00",
        "Headline": "Demonstrators marched in Tehran, Mashhad and Isfahan, chanting  \"death to the dictator\" and \"death to the Islamic Republic\".",
        "Content": "Internet access and phone lines were cut in Iran as anti-government protests intensified on Thursday night.  Protesters took to the streets in the capital Tehran and the major cities of Mashhad and Isfahan, witnesses reported. They chanted slogans against the country's clerical rulers that included \"death to the dictator\" and \"death to the Islamic Republic\". A nationwide internet blackout was reported by internet monitoring group NetBlocks, and internet firm CloudFlare, as protests over economic hardships continued around the country. Both attributed the outage to Iranian government interference. Attempts to dial landlines and mobile phones from Dubai to Iran could not be connected. Iran's economic crisis has sparked demonstrations against its theocratic government and Supreme Leader Ayatollah Ali Khamenei. The current protests, the biggest wave of dissent in three years, began last month in Tehran's ‍Grand Bazaar with shopkeepers condemning the rial currency's free fall. Unrest has since spread nationwide amid deepening distress over rocketing inflation. \n                  Inside Iran's protests: Gunfire, hospital raids and growing anger\n                 \n                  Why are people protesting in Iran? Everything you need to know\n                 \n                  Son of British woman detained in Iran describes 'criminal' government response\n                 Exiled crown prince Reza Pahlavi - whose father fled Iran just before the 1979 Islamic Revolution - has urged Iranians to protest. One chant heard on the streets praised the prince: \"This is the last battle. Pahlavi will return\". Demonstrators in Tehran erupted into chants when the clock stuck 8pm, witnesses said. \"Great nation of Iran, the eyes of the world are upon you. Take to the streets and, as a united front, shout your demands,\" Mr Pahlavi said in a statement. \"I warn the Islamic Republic, its leader and the (Revolutionary Guard) that the world and (President Donald Trump) are closely watching you. Suppression of the people will not go unanswered.\" Praising the prince could be met with a death sentence under the current regime.Iran's economy has struggled under US sanctions and in the wake of the 12-day war with Israel. In December, the rial currency collapsed to its lowest ever against the American dollar, reaching 1.4 million to $1. So far, violence from the demonstrations has killed at least 39 people and more than 2,260 people, according to the US-based Human Rights Activists News Agency. Read more:Inside Iran's protests: Gunfire, hospital raids and angerEverything you need to know about Iran protests Inflation has also skyrocketed to about 40%, intensifying the unrest and spreading fears about food insecurity. President Masoud Pezeshkian warned domestic suppliers against ⁠hoarding or overpricing goods on Thursday, according to state media. \"People should not feel any shortage in terms ‍of goods, supply and distribution,\" he said Iranian officials have offered no acknowledgment of the scale of the protests, and have not reported security officials being hurt or killed. US President Donald Trump has vowed to come to the aid of protesters if security forces opened fire on them. Some incidents have been reported by local media, including Iranian outlet Mizan news agency reporting a police colonel had suffered fatal stab wounds in a town outside of Tehran. The Fars news agency said gunmen had killed two security force members and wounded 30 others in a shooting in the city of Lordegan in Chaharmahal and Bakhtiari province. A deputy governor in Iran's Khorasan Razavi province told Iranian state television that an attack at a police station killed five people Wednesday night in Chenaran about 430 miles (700km) northeast of Tehran."
    },
    {
        "title": "What does the footage of the fatal Minneapolis ICE shooting show?  ",
        "description": "Renee Nicole Good, 37, was shot dead by an Immigration and Customs Enforcement (ICE) agent in Minneapolis on Wednesday. ",
        "url": "https://news.sky.com/story/what-does-the-footage-of-the-fatal-minneapolis-ice-shooting-show-13492129",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-teaser-dxf_7130466.jpg?20260108174307",
        "type": "US",
        "Author": "Freya Gibson,  Sophia Massam, and Annoa Abekah-Mensah, Data and Forensics team",
        "Date Published": "2026-01-08 16:51:00",
        "Headline": "Sky News has been reviewing footage from before, during and after Renee Nicole Good was shot dead to determine how the incident unfolded.",
        "Content": "By Freya Gibson,  Sophia Massam, and Annoa Abekah-Mensah, Data and Forensics team  Renee Nicole Good, 37, was shot dead by an Immigration and Customs Enforcement (ICE) agent in Minneapolis on Wednesday.  The Sky News Data and Forensics team has been reviewing footage from before, during and after the incident to determine what happened and how it unfolded. The shooting took place on Portland Avenue in south Minneapolis, just blocks away from the city's central business district. Protesters were already on the streets that morning, demonstrating against the large-scale deployment of ICE agents in Minnesota. Shortly before 9.30am, someone filming the protest captured footage that has now been seen by millions. Whistling can be heard in the background. Protesters blocking access to ICE agents and blowing whistles to alert people that they are in the area has become a community tactic used across the US. The ICE agent who shoots the gun is initially seen here in front of a protester. They appear to be filming each other. At the same time Renee, who is reported to be a mother of three who had recently moved to the city, is seen waving cars past. The camera then pans round to two ICE agents as they get out of their car and approach Renee's car. As one tries to open the driver's door, the other follows. Renee reverses the car and moves away from the ICE agents. We then see the first ICE agent come round to the front near side of the car and draw his gun. Within moments, gunshots ring out. President Donald Trump posted on Truth Social on the same day that the shooting was in self-defence and that an ICE agent was taken to hospital after being \"violently\" run over. But as Renee starts to slowly pull away, the wheels of her car turn to the right and the ICE officer's feet appear to be on the left of her car wheels. President Trump posted a video on Truth Social of another angle of the incident that shows the ICE agent pulling his gun. It is unclear if the ICE agent sustained any injuries and we have not seen any evidence to suggest any agents were run over during this incident. Sky News analysis suggests that the agent is not in front of the car when the shots are fired. In the footage, three shots are heard and it appears that one shot is discharged through the windscreen and two through the open car window. Photos of the car from later that morning show a single bullet hole through the car's windscreen. Renee's car comes to a halt on the other side of the road, after crashing into parked cars. Just after 9.30am, Minneapolis police officers responded to the reports of shots fired and found a woman with life-threatening gunshot wounds. A video filmed directly across from the passenger door shows Renee slumped at the wheel. Someone identifying themselves as a physician asks agents for permission to go to her to check for a pulse, but his path is blocked by ICE agents. The Minneapolis Police Department released a statement later that day, saying city firefighters removed Renee from the vehicle and began lifesaving measures until paramedics could respond. Video posted on social media shows first responders attempting to give CPR. A video posted online and verified by Sky News shows ambulances leaving Portland Avenue at 9.50am. She was transported to Hennepin County Medical Center, where she later died. At 10.19am, a livestream picked up the immediate aftermath reaction from witnesses who were expressing anger towards the ICE agents. They can be heard screaming \"murderers\"; Renee's car was still present on the scene. At 10.46am, just over an hour after the shooting, Minnesota Governor Tim Walz posted a statement on X, saying that his public safety team was working to gather information on an ICE related shooting this morning and would share information as we learn more. He also urged people to remain calm. Eight minutes after that, Minneapolis mayor Jacob Frey posted the following on X: At 11.14am, footage posted on social media shows protesters on E34th street, which adjoins Portland Avenue, just under 160m from the shooting. Law enforcement can be seen pushing people and throwing an unknown substance extremely close to their faces. An unknown white powder residue can be seen alongside an unknown orange substance. Bystanders can be heard saying their skin is burning. ICE operations have ramped up significantly as part of the Trump administration's immigration crackdown. On Tuesday, one day before the shooting, ICE had announced plans to send over 2,000 agents to the city in its \"largest ever\" operation in Minneapolis. In footage before the shooting, people are heard whistling and honking car horns. As ICE operations have increased, reactions against them have grown. The shooting prompted Mayor Frey to send a strong message to ICE, telling them to: \"Get the f*** out of Minneapolis.\" The Data and Forensics team is a multi-skilled unit dedicated to providing transparent journalism from Sky News. We gather, analyse and visualise data to tell data-driven stories. We combine traditional reporting skills with advanced analysis of satellite images, social media and other open source information. Through multimedia storytelling we aim to better explain the world while also showing how our journalism is done."
    },
    {
        "title": "US senators vote to curb Trump's ability to take more Venezuela military action",
        "description": "The US Senate has voted for legislation that would bar Donald Trump from taking further military action against Venezuela without authorisation from Congress. ",
        "url": "https://news.sky.com/story/us-senators-vote-to-curb-trumps-ability-to-take-more-venezuela-military-action-13492164",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-donald-trump-republicans_7128175.jpg?20260106151650",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-08 18:10:00",
        "Headline": "Republicans are among those backing a resolution to stop the US president using more force in the South American country without Congress approval.",
        "Content": "The US Senate has voted for legislation that would bar Donald Trump from taking further military action against Venezuela without authorisation from Congress.  The war powers resolution was carried with 52 to 47 votes, as five Republicans joined the Democrats to back it. Another Republican declined to vote. Their decision ensures a vote on the final passage of the legislation next week. But it has virtually no chance of becoming law because it would also need to be passed by the Republican majority House of Representatives. It would also need to get two-thirds ‍majorities in both the House and the Senate to survive an expected veto from Mr Trump. The president has criticised the Republican senators who voted to support the motion on Thursday. \"Susan Collins, Lisa Murkowski, Rand Paul, ‌Josh Hawley, and Todd Young ‌should never ‍be elected to office again,\" Mr Trump said in a social media post. He added Republicans should be \"ashamed of the Senators that just voted with Democrats in ‌attempting to take away our powers to fight and defend the United States of America\". \n                  'Extremely dangerous situation': Ex-Danish PM reacts to US 'act of aggression' over Greenland\n                 \n                  Trump's Greenland claim is preposterous. My visit shows why\n                 \n                  Three reasons why Trump wants Greenland - and how he might achieve it\n                 The vote came after US forces seized Venezuelan president Nicolas Maduro in a military operation in Caracas on Saturday. Following Maduro's capture, the Trump administration came under criticism from Democrats for misleading Congress on plans for regime change in Venezuela. Thursday's vote was a significant victory for lawmakers who have argued that Congress rather than the president should have the power to declare war, as set out in the US constitution. Kentucky Republican Senator Rand Paul, who co-sponsored the resolution, said the resolution had gained increasing support among Republicans \"It's interesting to see that more people, at least on my side, now are interested in who has the war prerogative, who was the prerogative to initiate or declare war,\" he said after Thursday's vote. But Senator Jim Risch of Idaho, the Republican chairman of the foreign relations panel, said in a ‍Senate speech before the vote that it would achieve little. \"The purpose of this resolution is to slap the president in the face,\" he said. \"It will do nothing that it purports to do because it can't stop something that isn't going on right now.\" 👉 Tap here to follow Trump100 wherever you get your podcasts👈  Meanwhile on Thursday, Venezuela's top lawmaker, Jorge Rodriguez, said significant number of prisoners would be released during the day as a gesture of peace. The move follows repeated requests from Venezuelan opposition figures to release political prisoners held under the Maduro regime. Venezuelan rights group Foro Penal estimated there were 863 political prisoners in the country, including political figures,human rights activists, protesters and journalists. Read more:US to control Venezuela oil sales 'indefinitely'What we know about 'ghost' tankers seized by US Republicans blocked two previous attempts to push similar resolutions in the Senate last year, as the Trump administration ramped up military pressure on Venezuela. The vote blocking the last resolution in November was passed with only 51 to 49 votes. This came soon after Trump advisers told lawmakers they did not plan to change the government or conduct strikes on Venezuelan territory. Trump's rhetoric and recent events in Venezuela have also raised concerns ‌that he might take military action to capture Greenland. Maduro will stand trial on drugs and weapons charges in New York, to which he has pleaded not guilty."
    },
    {
        "title": "NASA will bring astronauts home early from ISS over medical issue",
        "description": "NASA will bring back a crew from the ISS earlier than planned because of a medical issues.",
        "url": "https://news.sky.com/story/nasa-considering-bringing-astronauts-home-early-from-iss-over-medical-issue-13492010",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iss-space-crew-11_7130227.jpg?20260108130824",
        "type": "US",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-08 12:48:00",
        "Headline": "Crew-11 has been on the International Space Station since August last year and was due to return around May this year, but will now come home in the coming days. ",
        "Content": "\n          Science and technology reporter\n       NASA will bring back a crew from the ISS earlier than planned because of a medical issues. Hours before, the space agency cancelled a spacewalk that was scheduled for Thursday. A NASA spokeswoman said the astronaut, who wasn't named for medical privacy reasons, was ‌in a stable condition on the ISS. \"It's not an emergency evacuation, but we are erring on the side of caution for the crew member,\" said Dr James Polk, NASA's chief health and medical officer. Crew-11 has been on the ISS since August last year and was due to return around May this year. The station's designated commander, Mike Fincke, and Zena Cardman, the flight engineer, were supposed to conduct a 6.5-hour spacewalk on Thursday to install hardware outside the station. A NASA spokeswoman told Sky News earlier on Thursday that safety was the \"highest priority\", and the agency \"was actively evaluating ‍all options, including the possibility of an earlier end to Crew-11's mission\". \n                   From bone damage to solar radiation - inside the lab trying to protect the astronauts of the future\n                 \n                  SpaceX brings new crew to International Space Station in just 15 hours - but it's still short of Russian record\n                 \n                  Oldest serving US astronaut returns from space on 70th birthday\n                 Spacewalks are dangerous and take a lot of planning. It's not uncommon for NASA to cancel them if something isn't quite right. In 2024, a spacewalk was cancelled last-minute because an astronaut experienced \"spacesuit discomfort\". In 2021, astronaut Mark Vande Hei called off his spacewalk over a pinched nerve. The four-person Crew-11 crew includes the US astronauts Cardman and Fincke, as well as Japanese astronaut Kimiya Yui and Russian cosmonaut Oleg Platonov. Read more about space:Inside the lab trying to protect the astronauts of the futureRacing to replace the International Space Station Some of the crew had volunteered to take part in experiments to address health challenges astronauts may face on deep space missions, according to NASA - although there is no suggestion this is linked. The crew are taking part in simulated moon landings, as well as eye and brain tests, MRI scans and other medical exams. There's been a constant presence on the ISS for over 25 years, with astronauts rotating in and out on missions that can last over a year. Generally, though, missions last between six and eight months. In order to bring a crew home early, the space agency will need to coordinate its replacement."
    },
    {
        "title": "Starmer says 'more could be done to protect' the Arctic amid 'Russian aggression' in call to Trump",
        "description": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-says-more-needs-to-be-done-to-protect-the-arctic-in-call-to-trump-13492200",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7129882.jpg?20260108004851",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:19:00",
        "Headline": "The UK's prime minister has a call with the US president for a second time in two days as the pair discuss the \"need to deter an increasingly aggressive Russia in the High North\".",
        "Content": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said. Amid a flurry of diplomatic activity, Sir Keir spoke to Mr Trump about \"Euro-Atlantic security\" in the wake of fears the US president may use military force to take Greenland, having captured Venezuela's Nicola Maduro. Mr Trump has repeatedly said that the US needs Greenland, the largest island in the Arctic, as \"Greenland is very important for the national security of the United States, Europe, and other parts of the free world\". US officials have said they could use \"military means\" to \"acquire\" the semi-autonomous Danish territory. This is despite Danish Prime Minister Mette Frederiksen warning that NATO would be under threat in the event of a US invasion of the territory. Sir Keir has said previously said that decisions about Greenland's future should be made solely by its people and Denmark. On Wednesday, he reiterated that view to Mr Trump in a call described by Downing Street sources as \"positive\" and \"friendly\". But in a second conversation on Thursday, the two leaders discussed deterring Russia in the High North, which includes Greenland. A statement from Downing Street about the call said: \"The leaders discussed Euro-Atlantic security and agreed on the need to deter an increasingly aggressive Russia in the High North. \"European Allies had stepped up in recent months to defend Euro-Atlantic interests, but more could be done to protect the area, the Prime Minister said. \"The leaders looked forward to speaking again soon.\" It came as Sir Keir also spoke to NATO chief Mark Rutte about the \"High North\". In a Downing Street statement about Sir Keir's call with Mr Rutte, No 10 said: \"They agreed that more needed to be done to deter Russia in the High North and welcomed discussions on how Allies could further protect the region from increasing Russian threats.\" Sir Keir also spoke to the Danish prime minister, reiterating his position that Britain \"stood\" with Denmark. Reuters reported that Sir Keir told Ms Frederickson that ‌Britain stood with Denmark ​in its defence of Greenland, and the ⁠leaders also ‌discussed Ukraine. Sir Keir had been criticised by Conservative leader Kemi Badenoch in the last few days for failing to talk to the US president after the US carried out its raid to seize Mr Maduro and subsequent seizure of two oil tankers - one of which involved UK forces in the North Atlantic. In a joint statement, widely seen as a message to the US, the UK and European allies vowed earlier this week that they would \"not stop defending\" Greenland's territorial integrity. Sir Keir has also faced pressure to rule out any US use of UK bases to support an attack on Greenland. Read more from Sky News:Tens of thousands flee fighting in Aleppo, SyriaProtests spread across Iran Deputy Prime Minister David Lammy was set to underline the closeness of the \"special relationship\" between the UK and the US during a meeting with US vice president JD Vance in Washington on Thursday. Mr Lammy's visit to the US marks the 250th anniversary of America's declaration of independence from Britain. Speaking at the White House earlier on Thursday, Mr Vance said the US president's words on Greenland should be taken seriously. \"Greenland is really important not just to America's missile defence, but to the world's missile defence,\" the vice president said. \"So what we're asking our European friends to do is to take the security of that landmass more seriously, because if they're not, the United States is going to have to do something about it. \"What that is, I'll leave that to the president as we continue to engage in diplomacy with our European friends and everybody on this particular topic.\" Danish and Greenland envoys to Washington have been involved in a furious effort over the last few days to urge key Trump administration officials to step back from Mr Trump's call for a takeover of the strategic island. Denmark's ambassador to the US, Jesper Moller Sorensen, and Jacob Isbosethsen, Greenland's chief representative to Washington, met on Thursday with White House National Security Council officials, Associated Press reported. Sky News understands the pair also met with White House officials to seek a better understanding of US policy on Greenland but sources declined to say who from the Trump Administration participated in the discussions. While military force was one option to achieve Mr Trump's stated aim, the purchase of the territory is another, US officals have said, and US secretary of state ‌Marco Rubio is expected to meet with ⁠Danish officials next week in Washington."
    },
    {
        "title": "What we know about Minneapolis shooting victim Renee Nicole Good",
        "description": "The woman shot dead by a federal immigration officer in Minneapolis has been named as Renee Nicole Good. ",
        "url": "https://news.sky.com/story/what-we-know-about-minneapolis-shooting-victim-renee-nicole-good-13492110",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minnesota-shooting-victim_7130077.jpg?20260108100517",
        "type": "US",
        "Author": "Lauren Russell, news reporter and Annoa Abekah-Mensah, OSINT producer",
        "Date Published": "2026-01-08 15:42:00",
        "Headline": "Renee Nicola Good, 37 had recently moved to Minnesota and is believed to have never been charged with anything involving law enforcement beyond a traffic ticket.",
        "Content": "By Lauren Russell, news reporter and Annoa Abekah-Mensah, OSINT producer  The woman shot dead by a federal immigration officer in Minneapolis has been named as Renee Nicole Good.  The 37-year-old mother-of-three had recently moved to Minnesota and is believed to have never been charged with anything involving law enforcement beyond a traffic ticket, the Associated Press reported. Renee described herself on Instagram as a \"poet, writer, wife, and mom.\" The account is now private, but the bio offers a brief snapshot of her life. The Trump administration has called her a \"domestic terrorist\", with President Donald Trump adding on Wednesday that she had \"behaved horribly\", defending the Immigration and Customs Enforcement (ICE) agent who killed her. Here's what we know about Ms Good so far. Minneapolis shooting live updates A prize-winning poet Ms Good was born in Colorado Springs, a city in Colorado, and attended Virginia's Old Dominion University (ODU), where she graduated in 2020 with a degree in English, the school's president, Brian Hemphill, confirmed in a statement. While at ODU, she won an undergraduate prize from the Academy of American Poets, according to the website poets.org. In the university's commencement video for that semester, she appears under the name Renee Nicole Macklin - a name linked to her former husband, Timmy Ray Macklin Jr., who passed away in 2023, according to his obituary. A Facebook post by ODU's English department also said she co-hosted a podcast with her husband. He died in 2023 at the age of 36, according to the Minnesota Star Tribune. It is believed Ms Good had three children, a 15-year-old daughter and two sons aged 12 and 6, according to the Washington Post. On her private Instagram account, she described herself as a \"poet and writer and wife and mum\", who was \"experiencing Minneapolis\". Her current Instagram profile picture features a series of polaroids showing a woman identified by Sky News as her wife. 'One of the kindest people I've ever known' A woman identified by the Minnesota Star Tribune as Ms Good's mother, Donna Ganger, told the paper her daughter was not part of ICE-related protests. She went on to describe Ms Good as \"one of the kindest people I've ever known\". \"She was extremely compassionate,\" she told the Tribune. \"She's taken care of people all her life. She was loving, forgiving and affectionate. She was an amazing human being.\" A fundraiser for Ms Good's family, which was set up with a target of $50,000 (£37,000), raised more than $580,000 (£430,000). Mary Radford, 27, who lived next to Ms Good also spoke to the Tribune. She said she often saw Ms Good and her young son when walking her dog - an Australian shepherd called Hazelnut - who she said got excited every time they walked past Ms Good's house. \"It's a beautiful family. They have a son. He's very sweet. He loves our dog. He always has to go run up and pet and play with her,\" she said. \"They're always outside playing.\" She described having \"wonderful conversations\" with the family, adding, \"we're going to miss seeing them - forever\". Why was she at the scene? While it's unclear when she moved to Minnesota, her Instagram bio notes she is \"experiencing Minneapolis\" and lists Colorado as her home state. Department of Homeland Security spokesperson Tricia McLaughlin said Ms Good was shot after people began blocking ICE agents while they were conducting an immigration-related operation in the city. Ms McLaughlin claimed she had ignored commands to get out of the car she was driving and tried to run over an ICE officer in an \"attempt to kill or to cause bodily harm to agents\". Police described Ms Good as a \"middle-aged white woman\" who did not appear to be the target of any law enforcement investigation or activity, while the Minneapolis City Council added that the mother was out \"caring for her neighbours\" when she was killed. Minnesota state governor Tim Walz and Minneapolis mayor Jacob Frey, have both disputed the federal government's account of the shooting and blamed Mr Trump for what they called an unnecessary provocation by deploying federal law enforcement. Colorado governor Jared Polis, a democrat, also called for an investigation into Ms Good's death, calling what happened \"deeply disturbing\" and \"tragic\". Read more:Why ICE agents were in MinneapolisThis could be a moment of reckoning for America Anti-ICE protests are becoming a more frequent sight in the US since Mr Trump significantly increased the scope and power of agents, including their ability to stop and search individuals. Last year, demonstrations broke out in various cities across the country, including Los Angeles, after a string of ICE raids. A GoFundMe page created after the fatal shooting asks for support for Renée's wife and son. \"Renée was pure sunshine, pure love. She will be desperately missed,\" the page reads."
    },
    {
        "title": "Why were ICE agents in Minneapolis?",
        "description": "The shooting of Renee Nicole Good by an Immigration and Customs Enforcement (ICE) agent is not only significant due to its context but because of where it happened. ",
        "url": "https://news.sky.com/story/why-ice-agents-were-in-minneapolis-and-what-we-know-about-renee-nicole-good-13491917",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-minneapolis-minnesota_7130273.png?20260108135252",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2026-01-08 12:32:00",
        "Headline": "Days before the shooting of Renee Nicole Good, thousands of ICE agents were deployed to Minneapolis. Here is what you need to know.",
        "Content": "The shooting of Renee Nicole Good by an Immigration and Customs Enforcement (ICE) agent is not only significant due to its context but because of where it happened.  The 37-year-old poet was shot in her vehicle in Minneapolis after Homeland Security (DHS) claimed she allegedly tried to run over an ICE officer, who US President Donald Trump said acted in \"self-defence\". That narrative has been strongly rejected by both Minnesota state governor Tim Walz and Minneapolis mayor Jacob Frey, with the latter telling ICE officers to \"get the f*** out\" of the US city. Minneapolis shooting live updates It is an escalation of tensions in a city that has long been at odds with the Trump administration, tension which was deepened when 2,000 ICE agents were deployed to Minneapolis in recent weeks. Here is all you need to know. Why is ICE in Minneapolis? Thousands of ICE agents started to be deployed to the city, the largest in the state of Minnesota, on 5 January to conduct what Homeland Security called the \"largest DHS operation ever\". The aim, according to the government department, was to arrest \"fraudsters, murderers, rapists, and gang members\". The rush of enforcement comes after a right-wing online influencer alleged a number of childcare facilities run by Somali residents in Minnesota had committed welfare fraud. The FBI launched investigations into the allegations, with Homeland Security Investigations knocking on the doors of Somali businesses since last week. In response, the Trump administration said it would freeze all federal child care payments to the state. Minnesota receives $185m in child care funds from the government every year. ICE is the federal US Immigration and Customs Enforcement agency responsible for homeland security investigations and removal operations against people the US decides are in the country illegally. Its operations have ramped up significantly as part of the Trump administration's immigration crackdown. Sky News has previously witnessed people being taken off the streets by officers and bundled into vehicles, including in Washington DC. The Minnesota Department of Children, Youth and Families investigated the allegations and said all the facilities were operating normally and children were found at all but one that closed in 2022. Minnesota has the largest Somali population in the US, according to Sky News' US partner network, NBC. The community has been subject to widespread criticism from Mr Trump, who has called them \"garbage\". Secretary of homeland security, Kristi Noem, insisted after Wednesday's shooting that ICE operations will continue in Minneapolis, while the FBI has launched an investigation. What we know about Renee Nicole Good Ms Good, 37, was a mother of three who grew up in Colorado. Her youngest child is believed to be six years old. She was shot after people began blocking ICE agents while they were conducting an immigration-related operation in the city, Department of Homeland Security spokesperson Tricia McLaughlin said. Police described Ms Good as a \"middle-aged white woman\" who did not appear to be the target of any law enforcement investigation or activity, while the Minneapolis City Council added that the mother was out \"caring for her neighbours\" when she was killed. A woman identified by the Minnesota Star Tribune as Ms Good's mother, Donna Ganger, told the paper her daughter was not part of ICE-related protests. Why is Minnesota significant? Minnesota was one of a list of sanctuary jurisdictions that Mr Trump targeted at the beginning of his second term in the White House. A sanctuary jurisdiction is a state or city that limits cooperation with ICE, often by restricting local law enforcement from sharing information about immigrants' status or honouring federal requests for detention. Local police also do not question residents' immigration status or enforce immigration law. In August last year, the Department of Justice (DOJ) published a list of states, cities and counties identified as having these policies, claiming that by design they are \"putting American citizens at risk\". It followed Mr Trump's signing of an executive order stating that sanctuary jurisdictions could have federal grants and contracts suspended or terminated as a consequence. The scene of the shooting is about one mile from where George Floyd was murdered in 2020 by a city police officer, sparking worldwide anti-racism protests. Read more:This could be a moment of reckoning for America Protests were also organised in the aftermath of Ms Good's shooting, including in other US cities, including New Orleans, Miami, Seattle and New York City. Minneapolis Public Schools also announced that classes were cancelled for the rest of the week, \"due to safety concerns\". How about Tim Walz? In addition to being a democratic state, Minnesota is led by governor Tim Walz, who was Kamala Harris's candidate for vice president in the 2024 election. Along with mayor Jacob Frey, who is also a democrat, the pair have disputed the federal government's account of the shooting and blamed Mr Trump for what they called an unnecessary provocation by deploying federal law enforcement. Tension between Mr Trump and Mr Walz is nothing new, with the US president having criticised the governor's handling of the riots that followed the death of George Floyd, as well as the pair exchanging insults while on the campaign trail."
    },
    {
        "title": "Glencore and Rio Tinto in talks that could create world's largest mining firm",
        "description": "Glencore is in talks with rival Rio Tinto that could lead to merger and the creation of the world's largest mining firm.",
        "url": "https://news.sky.com/story/glencore-and-rio-tinto-resume-talks-on-mining-mega-merger-13492203",
        "image_url": "https://e3.365dm.com/23/01/1920x1080/skynews-australia-mining_6039421.jpg?20230128212523",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:10:00",
        "Headline": "The merger discussions come as pressure grows on mining firms to bulk up at a time of record prices for many in-demand commodities.",
        "Content": "Glencore is in talks with rival Rio Tinto that could lead to merger and the creation of the world's largest mining firm. Glencore issued a statement to the market soon after the Financial Times (FT) reported that discussions over a tie-up had resumed, almost a year after a previous round of talks broke down. There have been several attempts to secure a deal over more than a decade. Money latest: Top chef slams pub support package Glencore said it was working with its larger rival to explore a possible combination of some or all of their businesses. \"Glencore notes recent media speculation and confirms that it is in preliminary discussions with Rio Tinto... about a possible combination of some or all of their businesses, which could include an all-share merger between Rio Tinto and Glencore,\" a statement said. \"The parties' current expectation is that any merger transaction would be effected through the acquisition of Glencore by Rio Tinto by way of a Court-sanctioned scheme of arrangement. \n                  Reviving Venezuela's oil industry may be harder than Trump thinks - and this is why\n                 \n                  Politics latest: U-turn over business rates hike for pubs expected in coming days, Sky News understands\n                 \n                  Top TV chef labels government's pub support package 'crazy' - and pinpoints real problem | Money blog\n                 \"There is no certainty that the terms of any transaction or offer will be agreed, nor as to the terms or structure of any such transaction or offer, if agreed.\" It said that under the code, Rio Tinto was required, by not later than 5pm on 5 February, to either announce a firm intention to make an offer for Glencore or walk away. The FT reported that pressure to do a deal had intensified since the merger of Anglo American and Teck Resources, which raised industry stakes in the race to secure record-priced copper, amid rising prices for many commodities including rare earth minerals. Rio Tinto also confirmed \"preliminary discussions\" shortly after US markets had closed and also said that there was no certainty of a deal."
    },
    {
        "title": "Online retailer Very Group plots launch of £2bn auction ",
        "description": "The owner of The Very Group, one of Britain's biggest online shopping platforms, is to launch a &#163;2bn auction of the company just months after taking control.",
        "url": "https://news.sky.com/story/very-13492131",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-very-group-verygroup_6985453.jpg?20250808104049",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-08 16:57:00",
        "Headline": "Documents filed by administrators at PwC say the online fashion, toys and electrical retailer plans an \"immediate\" sale process after taking control in November, Sky News can reveal.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owner of The Very Group, one of Britain's biggest online shopping platforms, is to launch a £2bn auction of the company just months after taking control. Sky News has learnt that Carlyle, the American private equity giant, is lining up Barclays and JP Morgan to handle a sale of Very, which sells a wide range of fashion, toys and electrical goods. An auction is expected to kick off shortly and will come after a series of earlier sale plans drawn up under the ownership of the financially troubled Barclay family were put on hold. Money latest: New parking rule announced by government The proposal to launch an \"immediate\" sale process was disclosed in a filing at Companies House by administrators to VGL Holdco, a corporate entity which now has no connection to Very's operations. PricewaterhouseCoopers (PwC) was appointed to oversee the insolvency of VGL Holdco in November, enabling Carlyle - a long-standing creditor - to take control for the token sum of £1. Very, which boasts annual revenue of more than £2bn and is chaired by Nadhim Zahawi, the former Conservative chancellor, is expected to report strong sales next week for the Christmas and Black Friday period. \n                  Reviving Venezuela's oil industry may be harder than Trump thinks - and this is why\n                 \n                  Glencore and Rio Tinto in talks that could create world's largest mining firm\n                 \n                  Politics latest: U-turn over business rates hike for pubs expected in coming days, Sky News understands\n                 The change of control last autumn brought to an end more than 20 years of Barclay family involvement with the business, which was known as Littlewoods when it last changed hands in 2002 in a £750m deal. Nasdaq-listed Carlyle had injected several hundred million pounds into Very Group's capital structure, initially to support it through the Covid pandemic in 2021. This support, which included a further £85m from Carlyle in 2024, paved the way for it to take ownership control under the terms of the financing. In documents filed at Companies House this week, PwC said an M&A process would be \"run on a basis and timescale consistent with what would be expected for a business the size of the operating group\". One insider said Carlyle's ownership had always been intended to be on a transitional basis, with an onward sale timed to maximise value for all stakeholders. IMI, the Abu Dhabi-based media group which had also been part of efforts to take control of The Daily Telegraph from the Barclays, is also a lender to Very. Previously known as Shop Direct, Very Group employs thousands of people, and sells general merchandise under the Very and Littlewoods brands, encompassing electrical goods, homewares, fashion and toys. It has 4.4 million customers and operates a major consumer finance business to help shoppers manage their payments. Last year, the company also borrowed £600m from Arini, a Mayfair-based fund, as it sought to stave off a cash crunch and buy itself breathing space. Retail industry insiders believe the business is likely to be valued in the region of £2bn-£2.5bn - below the valuation which the Barclay family was holding out for in an auction which took place several years ago. People close to the situation refused to be drawn on the likely value of a sale, saying it would be determined by the level of interest from bidders. Very's most recent quarterly figures showed flagship brand Very UK growing 3.7% year-on-year, while revenue from the group's Very Finance arm grew by 5.7% to £113m. The Barclays, who used to own London's Ritz hotel, have already lost control of other corporate assets including the Yodel parcel delivery service, as well as the Telegraph newspapers. In recent weeks, the implosion of their business affairs appears to have accelerated after it was reported that HSBC, another long-standing lender to them, had filed bankruptcy petitions against senior members of the family. The Telegraph also reported that IMI had hired advisers to sell the Barclays' property assets to recoup some of the debt it was owed. A spokesman for Very Group declined to comment."
    },
    {
        "title": "Winners and losers of Christmas as Tesco reveals busiest ever days",
        "description": "The UK's largest supermarket chain had its busiest days ever over Christmas, reporting \"strong\" growth thanks to sales of fresh food as customers sought to eat more healthily. ",
        "url": "https://news.sky.com/story/winners-and-losers-of-christmas-as-tesco-reveals-busiest-ever-days-13491898",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-primark-tesco-m-and-s_7129989.jpg?20260108081302",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2026-01-08 07:10:00",
        "Headline": "Grocers and food sales did well, while others struggled with clothes, home and beauty products sales.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The UK's largest supermarket chain had its busiest days ever over Christmas, reporting \"strong\" growth thanks to sales of fresh food as customers sought to eat more healthily.  Tesco's busiest ever days were 22 and 23 December, the group said. Behind the recorded 3.7% UK sales growth in the 19 weeks to 3 January was a further shift towards low and no-alcohol drinks, people buying alternative Christmas meats like beef joints, AI-powered deliveries and a \"standout\" performance in fresh food. Money blog: House prices unexpectedly fall  In a potential sign of the impact of weight-loss jabs, UK fresh food sales rose 6.6% compared with a year earlier and 250,000 bottles of alcohol-free prosecco were bought. Chief executive Ken Murphy would not comment on whether injections like Wegovy and Ozempic will be \"a material factor\" to Tesco or not, saying he didn't want to make predictions at this stage, \"but we are seeing a continuation of trends of people wanting to eat more healthy generally\". Such jabs, containing a class of medication called GLP-1s, can make users less inclined to drink alcohol, avoid eating processed foods and seek fresher foods like lean meats and fruit and vegetables. \n                  Reviving Venezuela's oil industry may be harder than Trump thinks - and this is why\n                 \n                  Glencore and Rio Tinto in talks that could create world's largest mining firm\n                 \n                  Politics latest: U-turn over business rates hike for pubs expected in coming days, Sky News understands\n                 For now, the retailer is watching the trend \"very closely\" and not launching a dedicated line of items for people on the drugs, as Mr Murphy said, \"we already have a wide range of products that I would describe as GLP-1 friendly\". Also boosting the grocer's overall sales was online sales growth of more than 11% as Tesco said it used artificial intelligence (AI) scheduling tools to offer more delivery slots and help optimise deliveries. Lower inflation amid a hot price war In a market with \"extraordinary\" and \"relentless\" competition, in the words of Mr Murphy, Tesco said its price rises were below the industry average of 4.3%, as judged by consumer insight company Worldpanel by Numerator. He declined to give the exact rate of price rises. Read more:Claire's and The Original Factory Shop on brink of administrationMajor FTSE record as much about companies not in index as ones that are In an upbeat update, Mr Murphy said he was \"pleased\" and that \"customer spending and resilience was good over Christmas\". Only sales data is released in the update, with guidance issued on profits, currently expected to be \"the upper end\" of between £2.9 and £3.1bn. Lukewarm Not all corporate Christmas updates were as positive about the economy and how consumers were feeling. Britain's biggest fast food chain, Greggs, said it had \"good progress\" but it was \"a challenging year where subdued consumer confidence impacted the food-to-go market\". Despite challenges, the sausage roll maker reported sales were up 2.9% when adjusted to account for the 121 new shop openings, and market share increased. About 120 new Greggs will open this year, the company said. High street department store Marks and Spencer reported it had still been impacted by the Easter cyberattack, in which online systems were out of action into the summer. The attack had a \"long tail impact on stock data and management\", M&S said on Thursday. This impact, as well as reduced high street footfall, contributed to fashion, home and beauty sales dropping 2.9% in the 13 weeks to December when the same shops are compared. But at the same time, a record number of customers shopped at M&S as food sales were strong. Italian ready meals, the in-store bakery and deli helped up food sales as more shoppers bought food more regularly. Value ranges grew by 20% as M&S expanded its range. Cold In clear contrast to the record Christmas for supermarkets, according to data from Worldpanel by Numerator, Primark parent company Associated British Foods (ABF) said trading conditions were \"tough\" and expected to continue in the short term. The UK fared better than continental Europe, said George Weston, ABF's CEO. \"Primark has had a challenging start to the financial year, with a mixed performance.\" The clothing market was said to be \"difficult... particularly over Christmas\", though like-for-like sales rose 1.7%."
    },
    {
        "title": "Aviva-backed altnet Truespeed in merger talks with rival",
        "description": "A fibre broadband network provider backed by an arm of Aviva, the FTSE-100 insurer, is in merger talks with a rival amid growing financial pressure on the heavily indebted industry.",
        "url": "https://news.sky.com/story/aviva-backed-altnet-truespeed-in-merger-talks-with-rival-13491961",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-broadband-wifi-internet_6977790.jpg?20250730115106",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2026-01-08 10:16:00",
        "Headline": "Truespeed, which has received £175m from the insurer's investment arm, is negotiating a tie-up with Freedom Fibre which underlines the growing consolidation pressure on the fibre broadband sector, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n A fibre broadband network provider backed by an arm of Aviva, the FTSE-100 insurer, is in merger talks with a rival amid growing financial pressure on the heavily indebted industry. Sky News has learnt that Truespeed, which has received £175m of funding from Aviva Investors, is in discussions about a tie-up with Freedom Fibre. Negotiations between the two companies and their respective shareholders are said to be underway, although it was unclear on Thursday how likely they were to result in a deal. Money blog: House prices unexpectedly fall If successfully concluded, the merger would create a network with access to more than 400,000 premises, according to industry analysts. Truespeed, which is concentrated in the west of England, in areas such as Bath, Somerset and south Gloucestershire, had connected 28,000 customers to its network as of last summer. Last year, Truespeed merged with County Broadband, an altnet focused on East Anglia, to create an operator covering more than 175,000 homes. \n                  Altnet Zzoomm accelerates hunt for merger partners\n                 \n                  UK's worst areas for broadband outages revealed - and what to do if yours goes down\n                 \n                  Fibre frenzy gathers pace as InfraBridge eyes merger of UK arm\n                 Freedom Fibre, which was launched in 2020, has built a presence in Cheshire and Greater Manchester. In late 2023, it reached an agreement to merge with VX UK Holdings, establishing a combined business with more than 285,000 premises passed. Freedom Fibre is backed by blue-chip infrastructure investors such as Equitix and InfraBridge, which is part of New York-listed DigitalBridge Group. A merger of Truespeed and Freedom Fibre would represent another step in the consolidation of an industry which has begun to show signs of serious financial strain. A number of altnets have put themselves up for sale in recent months after struggling to raise the new financing required to deliver their standalone delivery plans. The largest player in the sector, behind BT Group's Openreach arm, CityFibre, completed a £2.3bn refinancing last year, which has left it well-placed to spearhead industry consolidation. CityFibre, which has a commercial relationship with Sky, the immediate owner of Sky News, had more than 730,000 customer connections as of last autumn. The financial strains on the sector are typified by the plight of companies such as G.Network, which had raised hundreds of millions of pounds in debt and equity funding. This week, the Financial Times reported that it had been sold to Fitzwalter Capital, a distressed debt fund. Spokespeople for Aviva Investors and Equitix declined to comment. Neither Truespeed nor Freedom Fibre could be reached for comment."
    },
    {
        "title": "Starmer says 'more could be done to protect' the Arctic amid 'Russian aggression' in call to Trump",
        "description": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said.",
        "url": "https://news.sky.com/story/starmer-says-more-needs-to-be-done-to-protect-the-arctic-in-call-to-trump-13492200",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-starmer-trump_7129882.jpg?20260108004851",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-08 20:19:00",
        "Headline": "The UK's prime minister has a call with the US president for a second time in two days as the pair discuss the \"need to deter an increasingly aggressive Russia in the High North\".",
        "Content": "Sir Keir Starmer has said \"more could be done to protect\" the Arctic region and agreed with Donald Trump on the \"need to deter an increasingly aggressive Russia in the High North\" during his second call in two days with the US president, Downing Street has said. Amid a flurry of diplomatic activity, Sir Keir spoke to Mr Trump about \"Euro-Atlantic security\" in the wake of fears the US president may use military force to take Greenland, having captured Venezuela's Nicola Maduro. Mr Trump has repeatedly said that the US needs Greenland, the largest island in the Arctic, as \"Greenland is very important for the national security of the United States, Europe, and other parts of the free world\". US officials have said they could use \"military means\" to \"acquire\" the semi-autonomous Danish territory. This is despite Danish Prime Minister Mette Frederiksen warning that NATO would be under threat in the event of a US invasion of the territory. Sir Keir has said previously said that decisions about Greenland's future should be made solely by its people and Denmark. On Wednesday, he reiterated that view to Mr Trump in a call described by Downing Street sources as \"positive\" and \"friendly\". But in a second conversation on Thursday, the two leaders discussed deterring Russia in the High North, which includes Greenland. A statement from Downing Street about the call said: \"The leaders discussed Euro-Atlantic security and agreed on the need to deter an increasingly aggressive Russia in the High North. \"European Allies had stepped up in recent months to defend Euro-Atlantic interests, but more could be done to protect the area, the Prime Minister said. \"The leaders looked forward to speaking again soon.\" It came as Sir Keir also spoke to NATO chief Mark Rutte about the \"High North\". In a Downing Street statement about Sir Keir's call with Mr Rutte, No 10 said: \"They agreed that more needed to be done to deter Russia in the High North and welcomed discussions on how Allies could further protect the region from increasing Russian threats.\" Sir Keir also spoke to the Danish prime minister, reiterating his position that Britain \"stood\" with Denmark. Reuters reported that Sir Keir told Ms Frederickson that ‌Britain stood with Denmark ​in its defence of Greenland, and the ⁠leaders also ‌discussed Ukraine. Sir Keir had been criticised by Conservative leader Kemi Badenoch in the last few days for failing to talk to the US president after the US carried out its raid to seize Mr Maduro and subsequent seizure of two oil tankers - one of which involved UK forces in the North Atlantic. In a joint statement, widely seen as a message to the US, the UK and European allies vowed earlier this week that they would \"not stop defending\" Greenland's territorial integrity. Sir Keir has also faced pressure to rule out any US use of UK bases to support an attack on Greenland. Read more from Sky News:Tens of thousands flee fighting in Aleppo, SyriaProtests spread across Iran Deputy Prime Minister David Lammy was set to underline the closeness of the \"special relationship\" between the UK and the US during a meeting with US vice president JD Vance in Washington on Thursday. Mr Lammy's visit to the US marks the 250th anniversary of America's declaration of independence from Britain. Speaking at the White House earlier on Thursday, Mr Vance said the US president's words on Greenland should be taken seriously. \"Greenland is really important not just to America's missile defence, but to the world's missile defence,\" the vice president said. \"So what we're asking our European friends to do is to take the security of that landmass more seriously, because if they're not, the United States is going to have to do something about it. \"What that is, I'll leave that to the president as we continue to engage in diplomacy with our European friends and everybody on this particular topic.\" Danish and Greenland envoys to Washington have been involved in a furious effort over the last few days to urge key Trump administration officials to step back from Mr Trump's call for a takeover of the strategic island. Denmark's ambassador to the US, Jesper Moller Sorensen, and Jacob Isbosethsen, Greenland's chief representative to Washington, met on Thursday with White House National Security Council officials, Associated Press reported. Sky News understands the pair also met with White House officials to seek a better understanding of US policy on Greenland but sources declined to say who from the Trump Administration participated in the discussions. While military force was one option to achieve Mr Trump's stated aim, the purchase of the territory is another, US officals have said, and US secretary of state ‌Marco Rubio is expected to meet with ⁠Danish officials next week in Washington."
    },
    {
        "title": "'Get a grip' on Grok, Starmer tells X after AI tool is used for child sex images",
        "description": "An artificial intelligence (AI) tool producing sexualised images of children will not be tolerated and is \"disgusting\" and \"unlawful\", the prime minister has said.",
        "url": "https://news.sky.com/story/get-a-grip-on-grok-starmer-tells-x-after-ai-tool-is-used-for-child-sex-images-13492111",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-sir-keir-starmer-grok_7130381.png?20260108174350",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-08 15:37:00",
        "Headline": "PM says the \"disgusting\" unlawful use of Grok will not be tolerated. He warns action will be taken by Ofcom and that all options are on the table.",
        "Content": "An artificial intelligence (AI) tool producing sexualised images of children will not be tolerated and is \"disgusting\" and \"unlawful\", the prime minister has said. Sir Keir Starmer said social media platform X has \"got to get a grip of\" its AI tool, Grok, and that he's asked media regulator, Ofcom, for \"all options to be on the table\". It follows reports from the Internet Watch Foundation (IWF) that criminals have been using Grok to create child sexual abuse imagery. Politics live - follow latest Grok is an AI tool that X users can instruct to find out information, answer questions and create images. The IWF revealed this week it had discovered criminal sexualised imagery of children aged between 11 and 13 that had been created by Grok. Speaking to Greatest Hits Radio on Thursday, the prime minister said: \"This is disgraceful. It's disgusting. And it's not to be tolerated. \"X has got to get a grip of this. And Ofcom has our full support to take action in relation to this. This is wrong.\" X and xAI - which produces Grok - are both owned by tech billionaire Elon Musk, and have been under fire for a number of days after a new feature led to users seeing AI-generated sexualised images of themselves on X. Sir Keir added: \"It's unlawful. We're not going to tolerate it. I've asked for all options to be on the table. \"It's disgusting. And X need to get their act together and get this material down. And we will take action on this because it's simply not tolerable.\" Earlier in the day, former Labour cabinet minister Louise Haigh urged the PM and the rest of government to quit the social media platform. She said: \"I call on my party and my government to remove themselves entirely from X and communicate with the public where they actually participate online and can be protected from such illegality.\" Asked whether the government could stop using X on Wednesday, a Downing Street spokesperson said: \"All options are on the table.\" They replied the same way when asked whether the prime minister was accepting images like this by continuing to use X. But the spokesperson added that Ofcom had their \"full backing to take action on failings by firms\". Ofcom has asked X to clarify how it is complying with data protection law over the AI images. Technology Secretary Liz Kendall called on X to take \"urgent\" action earlier this week. Sky News has contacted X for comment. The site's Safety account earlier this week read: \"We take action against illegal content on X, including Child Sexual Abuse Material (CSAM), by removing it, permanently suspending accounts, and working with local governments and law enforcement as necessary. \"Anyone using or prompting Grok to make illegal content will suffer the same consequences as if they upload illegal content.\""
    },
    {
        "title": "U-turn over business rates hike for pubs expected in coming days, Sky News understands",
        "description": "A package for pubs which could help with business rates is coming in the next few days, Sky News understands. ",
        "url": "https://news.sky.com/story/pubs-could-get-help-on-business-rates-but-not-hotels-13491935",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-beer-pub_7118054.jpg?20251223022532",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2026-01-08 10:21:00",
        "Headline": "An announcement could be coming that would help pubs, Sky News deputy political editor Sam Coates said, adding this might be because pubs are \"more politically sensitive\".",
        "Content": "A package for pubs which could help with business rates is coming in the next few days, Sky News understands.  It comes after House of Commons leader Sir Alan Campbell addressed backbench concerns over the hospitality sector, which is facing the end of COVID-era support and a hike in business rates following Rachel Reeves' November budget. He said: \"The prime minister has been absolutely clear on this, [we are] listening and that he's actively, we are actively looking at, further measures, to help pubs and the hospitality industry, whether these are in rural areas or in, urban areas.\" Sky's deputy political editor Sam Coates has now heard that a rescue package that could help with this is coming in the next few days - but only for pubs. The climbdown includes a change to the methodology of the business rates calculation, plus \"regulatory measures\", it is understood. This leaves others, like hotels, restaurants and music venues, potentially exposed to the uplifts. A source representing the wider hospitality industry said the climbdown \"is not touching the sides\" . Conservative leader Kemi Badenoch, who has vowed to scrap business rates entirely, said the U-turn was \"too little too late\". She posted on X: \"Yesterday Keir Starmer told us Labour had 'turned a corner.' Well, it looks like they've turned the corner straight into their first U-turn of 2026. \"Labour are killing Britain's pubs. This rumoured U-turn is too little too late. It's time to back our local pubs.\" Emma McClarkin, CEO of the British Beer & Pub Association, said news of a row back \"is potentially a huge win for pubs across the country and shows government have not only listened to our concerns but acted\". She added: \"This could save locals, jobs, and means publicans can breathe a huge sigh of relief.\" A variety of factors mean hospitality venues could potentially see their bills rise by more than 100%, Sam told Anne in Thursday morning's Politics at Sam and Anne's. Both pubs and hotels are also looking down the barrel of massive business rate hikes. On the podcast this morning, Sam said only a few hours after Wednesday's Prime Minister's Questions - where the topic came up - he picked up rumours in the industry that some sort of announcement could be coming that would help pubs, but not hotels. He said this could be because pubs are \"more politically sensitive\". Sam added: \"But talking to a lot of people, if you do a one-off grant, then that's expensive and doesn't make the ultimate problem - which bites in three years' time, go away. \"And hotels are amongst the worst affected and get the biggest increase in business rates in three years' time - so there's still big issues there. \"But the politics and the economics of rolling over the treasury on this are just so hard - and to my ear, a couple of days ago, they sounded like they pretty much wanted to stick and were being quite stubborn.\" 👉Listen to Politics at Sam and Anne's on your podcast app👈 Case for business rates relief has 'fallen on deaf ears' If the wider hospitality sector does not receive a similar relief package to pubs, business rates could \"slaughter venues\", one arena boss has warned. Martin Ingham, the chief executive of the Motorpoint Arena in Nottingham told Sky News while it's \"fantastic that the pub industry will get respite, it's disastrous for our industry that we're not being viewed the same way\". Asked why he thinks this is the case, Mr Ingham said: \"We've been lobbying very hard. It's particularly disappointing that a cogent case [to spare venues] has been made and fallen on deaf ears.\" He also warned that business rates are an \"indiscriminate tax\" with \"unintended consequences\" and that \"there's no way to mitigate it\", unlike other pressures, such as a rising energy bills and the hike in the minimum wage. Jon Collins, the chief executive of LIVE (Live music Industry Venues and Entertainment), has told Sky News that while \"it's good to know that the government is listening\", business owners other than landlords have now been left \"just waiting to see the detail\" of any potential reform. Asked what the impact of business rates being hiked without any further support will be, Mr Collins replied: \"It's black and white. \"It will close small venues, it will threaten the existence of larger venues, and it will make going to gigs more expensive.\" Why are business rates rising? In November's budget, Chancellor Rachel Reeves announced changes to how business rates are calculated, with a new band for retail, hospitality and leisure - bringing an end to the relief scheme first introduced in 2020 during the pandemic. The sector argues that the new business rates, while lower than before COVID, do not go far enough. They say that because the tax is based on rateable property values, which is an official estimate of a commercial property's annual rental value, they are disproportionately affected because they have physical stores, restaurants and pubs - unlike online giants. Read more from Sky News:MPs would vote on troops deployment to UkraineThe MP who tabled 342 questions in a single day Several pubs have already barred Labour MPs in protest at the changes. As Sky News previously reported, a cabinet revolt is brewing over the matter.  However, Sky News understands the government has been warning businesses not to protest over the changes if they want to get any concessions."
    },
    {
        "title": "NASA will bring astronauts home early from ISS over medical issue",
        "description": "NASA will bring back a crew from the ISS earlier than planned because of a medical issues.",
        "url": "https://news.sky.com/story/nasa-considering-bringing-astronauts-home-early-from-iss-over-medical-issue-13492010",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-iss-space-crew-11_7130227.jpg?20260108130824",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2026-01-08 12:48:00",
        "Headline": "Crew-11 has been on the International Space Station since August last year and was due to return around May this year, but will now come home in the coming days. ",
        "Content": "\n          Science and technology reporter\n       NASA will bring back a crew from the ISS earlier than planned because of a medical issues. Hours before, the space agency cancelled a spacewalk that was scheduled for Thursday. A NASA spokeswoman said the astronaut, who wasn't named for medical privacy reasons, was ‌in a stable condition on the ISS. \"It's not an emergency evacuation, but we are erring on the side of caution for the crew member,\" said Dr James Polk, NASA's chief health and medical officer. Crew-11 has been on the ISS since August last year and was due to return around May this year. The station's designated commander, Mike Fincke, and Zena Cardman, the flight engineer, were supposed to conduct a 6.5-hour spacewalk on Thursday to install hardware outside the station. A NASA spokeswoman told Sky News earlier on Thursday that safety was the \"highest priority\", and the agency \"was actively evaluating ‍all options, including the possibility of an earlier end to Crew-11's mission\". \n                   From bone damage to solar radiation - inside the lab trying to protect the astronauts of the future\n                 \n                  SpaceX brings new crew to International Space Station in just 15 hours - but it's still short of Russian record\n                 \n                  Oldest serving US astronaut returns from space on 70th birthday\n                 Spacewalks are dangerous and take a lot of planning. It's not uncommon for NASA to cancel them if something isn't quite right. In 2024, a spacewalk was cancelled last-minute because an astronaut experienced \"spacesuit discomfort\". In 2021, astronaut Mark Vande Hei called off his spacewalk over a pinched nerve. The four-person Crew-11 crew includes the US astronauts Cardman and Fincke, as well as Japanese astronaut Kimiya Yui and Russian cosmonaut Oleg Platonov. Read more about space:Inside the lab trying to protect the astronauts of the futureRacing to replace the International Space Station Some of the crew had volunteered to take part in experiments to address health challenges astronauts may face on deep space missions, according to NASA - although there is no suggestion this is linked. The crew are taking part in simulated moon landings, as well as eye and brain tests, MRI scans and other medical exams. There's been a constant presence on the ISS for over 25 years, with astronauts rotating in and out on missions that can last over a year. Generally, though, missions last between six and eight months. In order to bring a crew home early, the space agency will need to coordinate its replacement."
    },
    {
        "title": "Gabby Logan pays tribute to her father, Welsh football legend Terry Yorath",
        "description": "Gabby Logan has paid tribute to her father, former Leeds United and Wales midfielder Terry Yorath, who died at the age of 75 following a short illness.",
        "url": "https://news.sky.com/story/terry-yorath-former-leeds-footballer-and-father-of-gabby-logan-dies-aged-75-13491929",
        "image_url": "https://e3.365dm.com/26/01/1920x1080/skynews-gabby-logan-glasgow_7130106.jpg?20260108103434",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2026-01-08 09:21:00",
        "Headline": "\"To us he was Dad; a quiet, kind and gentle man,\" Yorath's children have said in a joint statement. \"Our hearts are broken.\" ",
        "Content": "Gabby Logan has paid tribute to her father, former Leeds United and Wales midfielder Terry Yorath, who died at the age of 75 following a short illness. The BBC Sport presenter posted a picture of her father playing for Wales on Instagram today, saying: \"Rest in Peace Dad. \"Our hearts are broken. Your love and legacy lives on.\" The post also included other images from his football career. Yorath made close to 200 appearances for Leeds during a nine-year spell in the 1960s and 70s and was a member of the team that won the 1974 First Division title. A year later, he became the first Welshman to play in a European Cup final. He also had spells as a player with Coventry City, Tottenham Hotspur and Bradford City. Yorath also made 59 appearances for Wales. In a statement, his children said: \"To most he was a revered footballing hero, but to us he was Dad; a quiet, kind and gentle man. Our hearts are broken but we take comfort knowing that he will be reunited with our brother, Daniel.\" Read more from Sky News:How UK helped US seize tanker - and how it tried to escapeWhat is a weather bomb and how often do they affect the UK? In addition to Gabby Logan, Yorath had three other children - Daniel, Louise and Jordan. Daniel died from the genetic heart condition hypertrophic cardiomyopathy aged 15 in 1992 while playing football at home with his father. Logan left Wednesday's Match of the Day programme part-way through and was replaced by Mark Chapman, who confirmed it was due to \"a family emergency\". Yorath moved into management in 1986 after retiring from playing, with spells in charge of clubs including Swansea City, Bradford City and Cardiff City. He was a player-coach at Bradford in May 1985 and in the dugout at the Valley Parade fire, which killed 56 fans and injured 270 during a match against Lincoln City. Yorath also had stints in charge of the Wales and Lebanon national teams in the 1980s and 90s, and guided his country to the brink of the World Cup finals."
    }
]