[
    {
        "title": "Key takeaways from White House talks between Trump, Zelenskyy and EU leaders",
        "description": "These are the key takeaways from the talks between US President Donald Trump, Ukrainian leader Volodymyr Zelenskyy and other European leaders, including Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/key-takeaways-from-white-house-talks-between-trump-zelenskyy-and-eu-leaders-13414380",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-zelenskyy-ukraine_6994947.jpg?20250819000844",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-18 21:47:00",
        "Headline": "The meeting involved Donald Trump, Volodymyr Zelensky, PM Keir Starmer, France's Emmanuel Macron, Italy's Giorgia Meloni, Germany's Friedrich Merz, Finland's Alexander Stubb, NATO Secretary General Mark Rutte and Ursula von der Leyen, the president of the EU Commission.",
        "Content": " These are the key takeaways from the talks between US President Donald Trump, Ukrainian leader Volodymyr Zelenskyy and other European leaders, including Prime Minister Sir Keir Starmer. Security guarantees In an important step towards a deal, Mr Trump has promised that the US would be involved in providing security guarantees for Ukraine. The US leader said that there would be some form of security guarantees for Ukraine, but did not reveal whether this would involve US troops. Mr Trump said Mr Putin \"agreed that Russia would accept security guarantees for Ukraine\". He added: \"I think that the European nations are going to take a lot of the burden. We're going to help them, and we're going to make it very secure.\" His comments were welcomed by the European leaders, with Ursula von der Leyen, president of the European Commission, saying it was \"good to hear\" the nations were working on \"Article Five-like security guarantees\". NATO's Article Five is the principle that an attack on one member is considered an attack on all of them. \n                  Why does Putin want Ukraine's Donbas region?\n                 \n                  Trump's meeting with Zelenskyy will be no repeat of Oval Office meltdown - here's why\n                 \n                  Donald Trump says Volodymyr Zelenskyy 'can end war with Russia if he wants to' - ahead of crucial White House meeting\n                 \"When we speak about security guarantees, we speak about the whole security of the European continent,\" French President Emmanuel Macron said. He added that one guarantee he would want to come out of any deals is that Ukraine should be able to have a \"credible\" army for \"the years and decades to come\". No ceasefire needed for peace deal Mr Trump said there did not need to be a ceasefire in Ukraine, because a peace deal could be worked out while Ukraine and Russia are at war. \"I don't think you need a ceasefire. You know, if you look at the six deals that I settled this year, they were all at war, I didn't do any ceasefires,\" he said. \"I know that it might be good to have, but I can also understand, strategically, why one country or the other wouldn't want it. You have a ceasefire and they rebuild and rebuild and rebuild and maybe they don't want that.\" He said he liked the \"concept of a ceasefire\", because people would stop being killed, but \"we can work a deal where we're working on a peace deal while they're fighting\". But German Chancellor Friedrich Merz said \"we would all like to see a ceasefire\". He told the media in the White House: \"I can't imagine that the next meeting would take place without a ceasefire, so let's work on that and let's try to put pressure on Russia.\" Mr Trump later pushed back, saying he had not needed a ceasefire in ending any other wars, but he would welcome one if needed. The US leader said: \"So if we can do the ceasefire, great, and, if we don't do a ceasefire... many other points were given to us, many, many points were given to us, great points.\" Trilateral meeting The US president said that \"if everything works out well today\", there will be a trilateral meeting between himself, Mr Putin and Mr Zelenskyy. The latter said he was ready for such a meeting and Mr Trump confirmed that Mr Putin was as well. Mr Macron said that while a trilateral meeting is important, a \"quadrilateral\" summit would also need to take place after. It was not clear whether Mr Macron meant a meeting in which just France takes part, or whether he meant NATO, the EU, or the \"coalition of the willing\" should be the fourth member. At first, Mr Trump said he would call Mr Putin \"right after\" the White House meetings, but he ended up interrupting the talk with the European leaders to call his Russian counterpart in the middle of the meeting, according to an EU diplomat. 'Discuss exchanges of territory' \"We also need to discuss the possible exchanges of territory,\" the US president said ahead of the multilateral talks with Mr Zelenskyy and European leaders. He said such exchanges would need to take \"into consideration the current line of contact\". Mr Trump added: \"That means the war zone, the war lines that are now, pretty obvious, very sad, actually, to look at them and negotiating positions.\" This comes after Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine during the Alaska summit with Mr Trump as a condition for ending the war. Read more:Zelensky has learned his lesson from last timeTrump: Europeans 'to take burden' of security guarantees In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Mr Zelensky previously ruled out handing any territory to Moscow."
    },
    {
        "title": "Trump summit: Volodymyr Zelenskyy has learned his lesson from the last visit to the White House",
        "description": "Volodymyr Zelenskyy has learned his lesson from the last time he was in the Oval Office.",
        "url": "https://news.sky.com/story/trump-summit-volodymyr-zelenskyy-has-learned-his-lesson-from-the-last-visit-to-the-white-house-13414314",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zelenskyy-trump_6994948.jpg?20250819002320",
        "type": "Home",
        "Author": "Mark Stone",
        "Date Published": "2025-08-18 19:53:00",
        "Headline": "There was no repeat of the heated exchanges seen six months ago, after their disastrous meeting.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Volodymyr Zelenskyy has learned his lesson from the last time he was in the Oval Office. When the Ukrainian leader was at the White House in February, he didn't wear a suit and was berated by Donald Trump and JD Vance over alleged disrespect. Trump-Zelenskyy latest: NATO-style security guarantees Zelenskyy's learned from that moment six months ago and he's taken on board what other European and world leaders have done with these Oval Office moments - that the best policy is to say as little as possible.  Such was the contrast that the right-wing reporter Brian Glenn, who questioned Zelenskyy over not wearing a suit in February, told the Ukrainian leader: \"You look fabulous in that suit.\" The best tactic for dealing with Trump in front of reporters is to not answer the question, don't rise to the bait. Get in there and out as soon and as quickly as you can. And this time, that is precisely what Zelenskyy did. \n                  Trump's meeting with Zelenskyy will be no repeat of Oval Office meltdown - here's why\n                 \n                  Donald Trump says Volodymyr Zelenskyy 'can end war with Russia if he wants to' - ahead of crucial White House meeting\n                 \n                  The stakes are high - and the unity of the alliance against Putin has never been so threatened\n                 Did Vance learn his lesson too? The vice president berated Zelenskyy last time but this time, while the US president's key advisers were there, JD Vance sat quietly to Trump's side, saying nothing altogether. It was a marked contrast from six months ago, but some sort of \"gulf between the two sides in terms of any peace deal\" continues. Read more from Sky News:'Ketamine Queen' admits drug chargePutin 'demands key regions of Ukraine' Melania's influence The influence of Melania Trump seems apparent again. The US first lady sent a letter to Vladimir Putin via Trump at the Alaska summit on Friday, calling for the war to end. And on Monday, Zelenskyy gave Trump a letter from his own wife for Melania."
    },
    {
        "title": "TikTok and Instagram accused of targeting teens with suicide and self-harm content",
        "description": "TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago.",
        "url": "https://news.sky.com/story/tiktok-and-instagram-accused-of-targeting-teens-with-suicide-and-self-harm-content-13414289",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-molly-russell-instagram-suicide_5914739.jpg?20250818203938",
        "type": "Home",
        "Author": "Tamara Cohen",
        "Date Published": "2025-08-18 18:50:00",
        "Headline": "The findings were made in advance of new regulation coming into force as part of the Online Safety Act, which the government says will protect children online.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago. The Molly Rose Foundation - set up by Ian Russell after his 14-year-old daughter took her own life after viewing harmful content on social media - commissioned analysis of hundreds of posts on the platforms, using accounts of a 15-year-old girl based in the UK. Politics Hub: Follow latest updates The charity claimed videos recommended by algorithms on the For You pages continued to feature a \"tsunami\" of clips containing \"suicide, self-harm and intense depression\" to under-16s who have previously engaged with similar material. One in 10 of the harmful posts had been liked at least a million times. The average number of likes was 226,000, the researchers said. Mr Russell told Sky News the results were \"horrifying\" and showed online safety laws are not fit for purpose. 'This is happening on PM's watch' He said: \"It is staggering that eight years after Molly's death, incredibly harmful suicide, self-harm, and depression content like she saw is still pervasive across social media. \"Ofcom's recent child safety codes do not match the sheer scale of harm being suggested to vulnerable users and ultimately do little to prevent more deaths like Molly's. \"The situation has got worse rather than better, despite the actions of governments and regulators and people like me. The report shows that if you strayed into the rabbit hole of harmful suicide self-injury content, it's almost inescapable. \"For over a year, this entirely preventable harm has been happening on the prime minister's watch and where Ofcom have been timid it is time for him to be strong and bring forward strengthened, life-saving legislation without delay.\" After Molly's death in 2017, a coroner ruled she had been suffering from depression, and the material she had viewed online contributed to her death \"in a more than minimal way\". Researchers at Bright Data looked at 300 Instagram Reels and 242 TikToks to determine if they \"promoted and glorified suicide and self-harm\", referenced ideation or methods, or \"themes of intense hopelessness, misery, and despair\". They were gathered between November 2024 and March 2025, before new children's codes for tech companies under the Online Safety Act came into force in July.  Instagram The Molly Rose Foundation claimed Instagram \"continues to algorithmically recommend appallingly high volumes of harmful material\". The researchers said 97% of the videos recommended on Instagram Reels for the account of a teenage girl, who had previously looked at this content, were judged to be harmful. Some 44% actively referenced suicide and self-harm, they said. They also claimed harmful content was sent in emails containing recommended content for users. A spokesperson for Meta, which owns Instagram, said: \"We disagree with the assertions of this report and the limited methodology behind it. \"Tens of millions of teens are now in Instagram Teen Accounts, which offer built-in protections that limit who can contact them, the content they see, and the time they spend on Instagram. \"We continue to use automated technology to remove content encouraging suicide and self-injury, with 99% proactively actioned before being reported to us. We developed Teen Accounts to help protect teens online and continue to work tirelessly to do just that.\" TikTok TikTok was accused of recommending \"an almost uninterrupted supply of harmful material\", with 96% of the videos judged to be harmful, the report said. Over half (55%) of the For You posts were found to be suicide and self-harm related; a single search yielding posts promoting suicide behaviours, dangerous stunts and challenges, it was claimed. The number of problematic hashtags had increased since 2023; with many shared on highly-followed accounts which compiled 'playlists' of harmful content, the report alleged. A TikTok spokesperson said: \"Teen accounts on TikTok have 50+ features and settings designed to help them safely express themselves, discover and learn, and parents can further customise 20+ content and privacy settings through Family Pairing. \"With over 99% of violative content proactively removed by TikTok, the findings don't reflect the real experience of people on our platform which the report admits.\" According to TikTok, they not do not allow content showing or promoting suicide and self-harm, and say that banned hashtags lead users to support helplines. Read more:Backlash against new online safety rulesMusk's X wants 'significant' changes to OSA  'A brutal reality' Both platforms allow young users to provide negative feedback on harmful content recommended to them. But the researchers found they can also provide positive feedback on this content and be sent it for the next 30 days. Technology Secretary Peter Kyle said: \"These figures show a brutal reality - for far too long, tech companies have stood by as the internet fed vile content to children, devastating young lives and even tearing some families to pieces. \"But companies can no longer pretend not to see. The Online Safety Act, which came into effect earlier this year, requires platforms to protect all users from illegal content and children from the most harmful content, like promoting or encouraging suicide and self-harm. 45 sites are already under investigation.\" An Ofcom spokesperson said: \"Since this research was carried out, our new measures to protect children online have come into force. \"These will make a meaningful difference to children - helping to prevent exposure to the most harmful content, including suicide and self-harm material. And for the first time, services will be required by law to tame toxic algorithms. \"Tech firms that don't comply with the protection measures set out in our codes can expect enforcement action.\" 'A snapshot of rock bottom' A separate report out today from the Children's Commissioner found the proportion of children who have seen pornography online has risen in the past two years - also driven by algorithms. Rachel de Souza described the content young people are seeing as \"violent, extreme and degrading\", and often illegal, and said her office's findings must be seen as a \"snapshot of what rock bottom looks like\". More than half (58%) of respondents to the survey said that, as children, they had seen pornography involving strangulation, while 44% reported seeing a depiction of rape - specifically someone who was asleep. The survey of 1,020 people aged between 16 and 21 found that they were on average aged 13 when they first saw pornography. More than a quarter (27%) said they were 11, and some reported being six or younger. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK. "
    },
    {
        "title": "There's one thing scarier than markets lurching around - and it's happening right now",
        "description": "There is one thing scarier than markets lurching around. And that's markets lurching around without a very compelling explanation.",
        "url": "https://news.sky.com/story/theres-one-thing-scarier-than-markets-lurching-around-and-its-happening-right-now-13414361",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bond-yields-markets_6994928.jpg?20250818224848",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-08-18 21:09:00",
        "Headline": "In normal circumstances, with the Bank of England having just cut interest rates, you would expect measures of borrowing costs to be falling across the board. But clearly these are not normal times.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n There is one thing scarier than markets lurching around. And that's markets lurching around without a very compelling explanation. Just yesterday, the yield on the government's 30-year bonds - the best measure out there of the UK government's long-term cost of borrowing - closed at the highest level since 1998, not long after Oasis released the album Be Here Now. Indeed, the yields on pretty much all UK government debt has been creeping up in recent weeks, though not all are back to Britpop era levels. Follow the latest in the Money blog In some senses, this looks very odd indeed. After all, the Bank of England just cut interest rates. In normal circumstances, you would expect measures of borrowing costs to be falling across the board. But clearly these are not normal times.  All of which raises the question: is this a UK-specific phenomenon? Are markets singling out Britain for particular concern, much as they did after Liz Truss's notorious mini-budget? Actually, there are more questions on top of that one. For instance, is this all about Rachel Reeves's recent woes, and her need to find another £20bn, give or take, to make her sums add up? Are investors fretting about the Bank of England's inflation-fighting credibility, given its cutting rates even as prices rise? The short answer, I'm afraid, is that no one really knows. But a glance at a few metrics can at least provide a bit of context. The first thing to note is that while government borrowing costs in the UK are up, they have also been rising in other leading economies. The UK, it's worth saying, is a bit of an outlier with higher yields than in fellow G7 nations. But that's not exactly a new thing: it's been the case since the mini-budget. But the UK is a particularly ugly duckling in a lake full of them.  Indeed, look at other nations, and you see that Britain's budgetary challenges are hardly unique. The US and France have ballooning budget deficits which are rising rapidly. Most European nations have pledged enormous increases in military spending to satisfy Donald Trump's demands of NATO. And over the Atlantic, the US administration has just committed to a sweeping set of generous fiscal measures, under its One Big Beautiful Bill Act. Even Elon Musk has voiced concerns about what this means for the deficit (which is set to continue rising ad infinitum, at least on paper). Read more from Sky News:Customers could join water boardsPub closures 'heartbreaking' trendBlackRock backs Gupta's steel ambition All of which brings us to the broader, possibly scarier, lesson. There are signs afoot that while G7 nations could depend for decades on other surplus countries - most notably China and other Asian countries - buying vast amounts of their debt in recent years, that might no longer be the case. In short, even as rich countries borrow like crazy, it's becoming less clear who will lend them the money. That's an enormous conundrum, and not good news for anyone."
    },
    {
        "title": "Revealed: The roads set to face worst bank holiday traffic",
        "description": "Drivers are being warned they could face long delays on major routes over the August bank holiday period, while train journeys will be impacted by rail engineering works.",
        "url": "https://news.sky.com/story/revealed-the-roads-set-to-face-worst-bank-holiday-traffic-13414068",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-traffic-cars_6987817.jpg?20250811073623",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-18 11:51:00",
        "Headline": "The RAC said some three million journeys for holidays or day trips are expected to be made on Friday, rising to 3.4 million on Saturday, 2.4 million on Sunday and 2.7 million on Monday.",
        "Content": "Drivers are being warned they could face long delays on major routes over the August bank holiday period, while train journeys will be impacted by rail engineering works. Issuing the alert, the RAC urged motorists to set off as early as possible or \"be prepared to spend longer in traffic\". The RAC said some three million journeys for holidays or day trips are expected to be made on Friday, rising to 3.4 million on Saturday, 2.4 million on Sunday and 2.7 million on Monday, with an additional 6.1 million drivers planning a leisure trip at some point between Friday and Monday. With over 17.6 million getaway trips by car expected, these are the roads with the worst-expected congestion, as well as the train lines that will be closed. Which roads are likely to be the worst affected? Transport analytics company Inrix has predicted the M5 between Bristol and Devon will have the most severe getaway traffic. It said the stretch from junction 15 north of Bristol to junction 23 for Bridgwater is likely to see delays of more than 40 minutes on Friday and Saturday. Delays exceeding half an hour are forecast on Friday on the M20 in Kent, as the route is taken by a large proportion of vehicles making Channel crossings via Dover or Folkestone. The warning covers journeys from junction seven near Maidstone to junction three (Addington Interchange), as well as from junction one at Swanley to junction five at Aylesford. Major rail lines closed Rail passengers are being warned that some major routes will be closed for engineering work, as Network Rail undertakes 261 projects across Britain. There will be no long-distance services between London King's Cross and Peterborough on Saturday, which will disrupt Anglo-Scottish journeys by LNER and Lumo on the East Coast Main Line. Avanti West Coast will operate a reduced and amended service to and from London Euston. No services will operate between Birmingham New Street and Birmingham International between Saturday and Monday. Affected Avanti West Coast and CrossCountry services will be diverted, increasing journey times. London Northwestern services will run to and from Birmingham International only."
    },
    {
        "title": "Redundancies begin at UK's largest bioethanol plant after government rejects bailout",
        "description": "Redundancies are to begin on Tuesday at the UK's largest bioethanol plant, which is to close after the government refused to offer the owners a bailout.",
        "url": "https://news.sky.com/story/redundancies-begin-at-uks-largest-bioethanol-plant-after-government-rejects-bailout-13414125",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vivergo-fuels-bioethanol_6994568.jpg?20250818155453",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-18 13:52:00",
        "Headline": "Vivergo has begun an orderly wind-down of the business, which is set to close at the end of the year.",
        "Content": "Redundancies are to begin on Tuesday at the UK's largest bioethanol plant, which is to close after the government refused to offer the owners a bailout. Around 60 staff, just over a third of the total, are to receive redundancy letters on Tuesday and leave the site. The remaining workers will go in phases over the coming months, as part of an orderly wind-down of the business. On Friday, owners Vivergo Fuels, a subsidiary of Associated British Foods (ABF), said the government's decision not to offer financial support to the facility in Lincolnshire was \"deeply regrettable\" and blamed the UK's trade deal with the United States. The plant converts wheat into bioethanol, a component of petrol used to reduce carbon emissions. The facility was already losing £3m a month, partly due to high energy prices. But now the company has also been left competing with cheaper imports after the 19% tariff on American bioethanol was scrapped following the recent UK-US trade deal. Vivergo described the government's decision not to offer financial support as \"a flagrant act of economic self-harm that will have far-reaching consequences\", pushing the sector \"to the point of collapse\". The company added that the closure would be a \"massive blow\" to the local area and supply chain. More than 160 staff at the site, who were consulted about a potential wind-down process in June, will have left by the end of the year, when the plant will be ready for demolition. The factory is also the UK's largest single production site for animal feed, a byproduct of the production process for ethanol. The NFU farming union described the imminent closure as \"terrible news\" for workers who will lose their jobs, but also \"thousands of people whose livelihoods depend on this supply chain\". Read more from Sky News:Pub closures are 'heartbreaking' trendBlackRock backs Gupta's steel empire The company, near Hull, warned earlier this year that it was in financial trouble as crisis talks continued with the government. In a statement, the government said it made the \"difficult decision not to offer direct funding as it would not provide value for the taxpayer or solve the long-term problems the industry faces\". But Unite general secretary Sharon Graham called the government's decision \"short-sighted\" while the GMB union's Charlotte Brumpton-Childs blamed \"the impact of tariffs and trade deals\" for \"working people losing their livelihoods\"."
    },
    {
        "title": "'Ketamine Queen' to plead guilty to supplying dose of drug that killed Matthew Perry",
        "description": "A woman who was charged with selling Friends star Matthew Parry the dose of the drug that killed him has agreed to plead guilty. ",
        "url": "https://news.sky.com/story/ketamine-queen-to-plead-guilty-to-supplying-dose-of-drug-that-killed-matthew-perry-13414322",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-jasveen-sangha_6658017.jpg?20240816125917",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-18 20:14:00",
        "Headline": "No subtitle found",
        "Content": "A woman who was charged with selling Friends star Matthew Parry the dose of the drug that killed him has agreed to plead guilty.  Jasveen Sangha, known as the \"Ketamine Queen\", is the fifth and final defendant to strike a plea deal with prosecutors, avoiding a trial that was set to take place in September. The 42-year-old agreed to plead guilty to five federal criminal charges, including providing the Ketamine that led to Perry's death, federal prosecutors said in a statement. Prosecutors had cast Sangha, a dual US and UK national, as a prolific drug dealer known to her customers as the \"Ketamine Queen\", often using the term in court documents and even including it in the official name of the case. She agreed to plead guilty to one count of maintaining a drug-involved premises, three counts of distribution of ketamine, and one count of distribution of ketamine resulting in death or serious bodily injury. Sangha will officially change her plea to guilty at an upcoming hearing, where sentencing will be scheduled, prosecutors said. She is facing up to 45 years in prison. Read more from Sky News: Man injured after tractor falls on to motorwayDrug dealer on e-bike who killed great-grandfather jailed Sangha and a doctor named Salvador Plasencia, who signed his own plea deal in June, had been the primary targets of the investigation. Three other defendants - Mark Chavez, who it was claimed bought the drug from Sangha, Kenneth Iwamasa, and Erik Flemin - agreed to plead guilty last year in exchange for their cooperation, which included statements implicating Sangha and Plasencia. Prosecutors allege Chavez funnelled ketamine to Plasencia, securing some of the drug from a wholesale distributor through a fraudulent prescription. In one instance, prosecutors allege that Plasencia \"charged Perry $2,000 (£1,500) a vial that cost Dr Chavez approximately $12 (£9)\". Perry died in his home in October 2023, aged 54, after getting ketamine from his regular doctor for treatment of depression, which is an increasingly common use for the surgical anaesthetic. The actor was taking ketamine six to eight times a day before he died, according to court documents."
    },
    {
        "title": "Trump says US will give Ukraine security guarantees - but Europe will 'take a lot of the burden'",
        "description": "Volodymyr Zelenskyy has said he's ready to meet with Vladimir Putin after Donald Trump said the Russian president had agreed to let Ukraine have security guarantees from its allies.",
        "url": "https://news.sky.com/story/zelenskyy-arrives-at-white-house-for-talks-with-trump-and-eu-leaders-13414188",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-macron_6994784.jpg?20250818201538",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-18 17:26:00",
        "Headline": "Donald Trump said Vladimir Putin \"agreed that Russia would accept security guarantees for Ukraine\", and the US would play a role. But he said Kyiv's European allies should play the leading role.",
        "Content": "Volodymyr Zelenskyy has said he's ready to meet with Vladimir Putin after Donald Trump said the Russian president had agreed to let Ukraine have security guarantees from its allies. A meeting between the two men could happen before the end of the month, followed by a trilateral summit which includes their US counterpart. Follow the latest: Trump vows to stop war It comes after Mr Trump hosted the Ukrainian president and a host of other European leaders at the White House on Monday, just days after he met Mr Putin in Alaska last week. Among those in attendance were Prime Minister Sir Keir Starmer, France's Emmanuel Macron, Italy's Giorgia Meloni, Germany's Friedrich Merz, Finland's Alexander Stubb, as well as NATO Secretary General Mark Rutte and Ursula von der Leyen, the president of the European Commission. Mr Trump said Mr Putin \"agreed that Russia would accept security guarantees for Ukraine\". He added: \"I think that the European nations are going to take a lot of the burden. We're going to help them, and we're going to make it very secure.\" 'Article-Five-like' The mention of US involvement in security guarantees was welcomed by the European leaders. Ms Von der Leyen said it was \"good to hear\" the nations were working on \"Article Five-like security guarantees\". NATO's Article Five is the principle that an attack on one member is considered an attack on all of them. Sir Keir said the guarantees would help ensure a \"lasting deal\", and one for which there would be consequences if Russia breached it. Mr Macron said it was not just about Ukraine, but \"the whole security of the European continent\". He added that one guarantee he would want to come out of any deals is that Ukraine should be able to have a \"credible\" army for \"the years and decades to come\". But there remained signs of some strain between Mr Trump and Europe. His belief that a ceasefire isn't required to strike a peace deal was challenged Mr Merz, who said he \"can't imagine\" a Zelenskyy-Putin meeting taking place without one. Sky News understands that European leaders and Mr Zelenskyy will stay in Washington for now to continue talks. The talks including the European leaders came after a Trump-Zelenskyy summit in the Oval Office. It was their first since their infamous sparring match back in February, but this time was far more cordial. Mr Zelenskyy was complimented on his suit and evoked a few hearty laughs from Mr Trump, who said the US would provide \"very good protection\" for Ukraine. Read more: Zelenskyy learned his lesson from last time Mr Trump revealed during the Oval Office talks that he would have a call with Mr Putin later in the day. He broke up his talks with the Europeans to do so, before returning to update them on what they had discussed. A Kremlin official, Kirill Dmitriev, later hailed the talks as an \"important day for democracy\", but didn't comment on the issue of security guarantees or possible changes of territory. At the Alaska summit last Friday, Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine as a condition for ending the war. In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Read more: Putin's demands would be bitter blow to Ukraine Trump talks up possible land swaps Mr Trump is said to be planning to urge Mr Zelenskyy to agree to the conditions as part of a peace deal to end the war - despite the Ukrainian president previously ruling out handing any territory to Moscow. \"We also need to discuss the possible exchanges of territory,\" the US president said ahead of the multilateral talks with Mr Zelenskyy and European leaders. He said such exchanges would need to take \"into consideration the current line of contact\". He added: \"That means the war zone, the war lines that are now, pretty obvious, very sad, actually, to look at them and negotiating positions.\" What happens next? Mr Zelenskyy and Germany's Mr Merz both suggested a Zelenskyy-Putin summit could take place within two weeks. A location has not yet been determined. A meeting that includes Mr Trump would likely follow in the weeks after."
    },
    {
        "title": "Man seriously injured after tractor falls off bridge on to M20",
        "description": "A man has been seriously injured after his tractor fell off a bridge and on to the M20.",
        "url": "https://news.sky.com/story/man-seriously-injured-after-tractor-falls-off-bridge-on-to-m20-13414137",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tractor-m20_6994532.jpg?20250818151156",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-08-18 15:10:00",
        "Headline": "South East Coast Ambulance Service said it was called to a collision involving a tractor and a lorry on the A227 overbridge near Wrotham at 11.20am.",
        "Content": "A man has been seriously injured after his tractor fell off a bridge and on to the M20. South East Coast Ambulance Service said it was called to a collision involving a tractor and a lorry on the A227 overbridge near Wrotham at 11.20am on Monday. The tractor fell on to the central reservation between junctions two and three of the M20 after the crash. The driver of the tractor was airlifted to King's College Hospital with serious injuries. Read more from Sky News:Man guilty over gangland shootingDozens evacuated over seaside town blaze Multiple ambulance crews, a critical care paramedic and the air ambulance attended the scene alongside Kent police and fire services. Large queues formed on either side of the overbridge following the collision, which left the impacted section of the M20 closed until around 11.30pm while resurfacing works and barrier repairs were carried out."
    },
    {
        "title": "TikTok and Instagram accused of targeting teens with suicide and self-harm content",
        "description": "TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago.",
        "url": "https://news.sky.com/story/tiktok-and-instagram-accused-of-targeting-teens-with-suicide-and-self-harm-content-13414289",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-molly-russell-instagram-suicide_5914739.jpg?20250818203938",
        "type": "UK",
        "Author": "Tamara Cohen",
        "Date Published": "2025-08-18 18:50:00",
        "Headline": "The findings were made in advance of new regulation coming into force as part of the Online Safety Act, which the government says will protect children online.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago. The Molly Rose Foundation - set up by Ian Russell after his 14-year-old daughter took her own life after viewing harmful content on social media - commissioned analysis of hundreds of posts on the platforms, using accounts of a 15-year-old girl based in the UK. Politics Hub: Follow latest updates The charity claimed videos recommended by algorithms on the For You pages continued to feature a \"tsunami\" of clips containing \"suicide, self-harm and intense depression\" to under-16s who have previously engaged with similar material. One in 10 of the harmful posts had been liked at least a million times. The average number of likes was 226,000, the researchers said. Mr Russell told Sky News the results were \"horrifying\" and showed online safety laws are not fit for purpose. 'This is happening on PM's watch' He said: \"It is staggering that eight years after Molly's death, incredibly harmful suicide, self-harm, and depression content like she saw is still pervasive across social media. \"Ofcom's recent child safety codes do not match the sheer scale of harm being suggested to vulnerable users and ultimately do little to prevent more deaths like Molly's. \"The situation has got worse rather than better, despite the actions of governments and regulators and people like me. The report shows that if you strayed into the rabbit hole of harmful suicide self-injury content, it's almost inescapable. \"For over a year, this entirely preventable harm has been happening on the prime minister's watch and where Ofcom have been timid it is time for him to be strong and bring forward strengthened, life-saving legislation without delay.\" After Molly's death in 2017, a coroner ruled she had been suffering from depression, and the material she had viewed online contributed to her death \"in a more than minimal way\". Researchers at Bright Data looked at 300 Instagram Reels and 242 TikToks to determine if they \"promoted and glorified suicide and self-harm\", referenced ideation or methods, or \"themes of intense hopelessness, misery, and despair\". They were gathered between November 2024 and March 2025, before new children's codes for tech companies under the Online Safety Act came into force in July.  Instagram The Molly Rose Foundation claimed Instagram \"continues to algorithmically recommend appallingly high volumes of harmful material\". The researchers said 97% of the videos recommended on Instagram Reels for the account of a teenage girl, who had previously looked at this content, were judged to be harmful. Some 44% actively referenced suicide and self-harm, they said. They also claimed harmful content was sent in emails containing recommended content for users. A spokesperson for Meta, which owns Instagram, said: \"We disagree with the assertions of this report and the limited methodology behind it. \"Tens of millions of teens are now in Instagram Teen Accounts, which offer built-in protections that limit who can contact them, the content they see, and the time they spend on Instagram. \"We continue to use automated technology to remove content encouraging suicide and self-injury, with 99% proactively actioned before being reported to us. We developed Teen Accounts to help protect teens online and continue to work tirelessly to do just that.\" TikTok TikTok was accused of recommending \"an almost uninterrupted supply of harmful material\", with 96% of the videos judged to be harmful, the report said. Over half (55%) of the For You posts were found to be suicide and self-harm related; a single search yielding posts promoting suicide behaviours, dangerous stunts and challenges, it was claimed. The number of problematic hashtags had increased since 2023; with many shared on highly-followed accounts which compiled 'playlists' of harmful content, the report alleged. A TikTok spokesperson said: \"Teen accounts on TikTok have 50+ features and settings designed to help them safely express themselves, discover and learn, and parents can further customise 20+ content and privacy settings through Family Pairing. \"With over 99% of violative content proactively removed by TikTok, the findings don't reflect the real experience of people on our platform which the report admits.\" According to TikTok, they not do not allow content showing or promoting suicide and self-harm, and say that banned hashtags lead users to support helplines. Read more:Backlash against new online safety rulesMusk's X wants 'significant' changes to OSA  'A brutal reality' Both platforms allow young users to provide negative feedback on harmful content recommended to them. But the researchers found they can also provide positive feedback on this content and be sent it for the next 30 days. Technology Secretary Peter Kyle said: \"These figures show a brutal reality - for far too long, tech companies have stood by as the internet fed vile content to children, devastating young lives and even tearing some families to pieces. \"But companies can no longer pretend not to see. The Online Safety Act, which came into effect earlier this year, requires platforms to protect all users from illegal content and children from the most harmful content, like promoting or encouraging suicide and self-harm. 45 sites are already under investigation.\" An Ofcom spokesperson said: \"Since this research was carried out, our new measures to protect children online have come into force. \"These will make a meaningful difference to children - helping to prevent exposure to the most harmful content, including suicide and self-harm material. And for the first time, services will be required by law to tame toxic algorithms. \"Tech firms that don't comply with the protection measures set out in our codes can expect enforcement action.\" 'A snapshot of rock bottom' A separate report out today from the Children's Commissioner found the proportion of children who have seen pornography online has risen in the past two years - also driven by algorithms. Rachel de Souza described the content young people are seeing as \"violent, extreme and degrading\", and often illegal, and said her office's findings must be seen as a \"snapshot of what rock bottom looks like\". More than half (58%) of respondents to the survey said that, as children, they had seen pornography involving strangulation, while 44% reported seeing a depiction of rape - specifically someone who was asleep. The survey of 1,020 people aged between 16 and 21 found that they were on average aged 13 when they first saw pornography. More than a quarter (27%) said they were 11, and some reported being six or younger. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK. "
    },
    {
        "title": "There's one thing scarier than markets lurching around - and it's happening right now",
        "description": "There is one thing scarier than markets lurching around. And that's markets lurching around without a very compelling explanation.",
        "url": "https://news.sky.com/story/theres-one-thing-scarier-than-markets-lurching-around-and-its-happening-right-now-13414361",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bond-yields-markets_6994928.jpg?20250818224848",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-08-18 21:09:00",
        "Headline": "In normal circumstances, with the Bank of England having just cut interest rates, you would expect measures of borrowing costs to be falling across the board. But clearly these are not normal times.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n There is one thing scarier than markets lurching around. And that's markets lurching around without a very compelling explanation. Just yesterday, the yield on the government's 30-year bonds - the best measure out there of the UK government's long-term cost of borrowing - closed at the highest level since 1998, not long after Oasis released the album Be Here Now. Indeed, the yields on pretty much all UK government debt has been creeping up in recent weeks, though not all are back to Britpop era levels. Follow the latest in the Money blog In some senses, this looks very odd indeed. After all, the Bank of England just cut interest rates. In normal circumstances, you would expect measures of borrowing costs to be falling across the board. But clearly these are not normal times.  All of which raises the question: is this a UK-specific phenomenon? Are markets singling out Britain for particular concern, much as they did after Liz Truss's notorious mini-budget? Actually, there are more questions on top of that one. For instance, is this all about Rachel Reeves's recent woes, and her need to find another £20bn, give or take, to make her sums add up? Are investors fretting about the Bank of England's inflation-fighting credibility, given its cutting rates even as prices rise? The short answer, I'm afraid, is that no one really knows. But a glance at a few metrics can at least provide a bit of context. The first thing to note is that while government borrowing costs in the UK are up, they have also been rising in other leading economies. The UK, it's worth saying, is a bit of an outlier with higher yields than in fellow G7 nations. But that's not exactly a new thing: it's been the case since the mini-budget. But the UK is a particularly ugly duckling in a lake full of them.  Indeed, look at other nations, and you see that Britain's budgetary challenges are hardly unique. The US and France have ballooning budget deficits which are rising rapidly. Most European nations have pledged enormous increases in military spending to satisfy Donald Trump's demands of NATO. And over the Atlantic, the US administration has just committed to a sweeping set of generous fiscal measures, under its One Big Beautiful Bill Act. Even Elon Musk has voiced concerns about what this means for the deficit (which is set to continue rising ad infinitum, at least on paper). Read more from Sky News:Customers could join water boardsPub closures 'heartbreaking' trendBlackRock backs Gupta's steel ambition All of which brings us to the broader, possibly scarier, lesson. There are signs afoot that while G7 nations could depend for decades on other surplus countries - most notably China and other Asian countries - buying vast amounts of their debt in recent years, that might no longer be the case. In short, even as rich countries borrow like crazy, it's becoming less clear who will lend them the money. That's an enormous conundrum, and not good news for anyone."
    },
    {
        "title": "Revealed: The roads set to face worst bank holiday traffic",
        "description": "Drivers are being warned they could face long delays on major routes over the August bank holiday period, while train journeys will be impacted by rail engineering works.",
        "url": "https://news.sky.com/story/revealed-the-roads-set-to-face-worst-bank-holiday-traffic-13414068",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-traffic-cars_6987817.jpg?20250811073623",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-18 11:51:00",
        "Headline": "The RAC said some three million journeys for holidays or day trips are expected to be made on Friday, rising to 3.4 million on Saturday, 2.4 million on Sunday and 2.7 million on Monday.",
        "Content": "Drivers are being warned they could face long delays on major routes over the August bank holiday period, while train journeys will be impacted by rail engineering works. Issuing the alert, the RAC urged motorists to set off as early as possible or \"be prepared to spend longer in traffic\". The RAC said some three million journeys for holidays or day trips are expected to be made on Friday, rising to 3.4 million on Saturday, 2.4 million on Sunday and 2.7 million on Monday, with an additional 6.1 million drivers planning a leisure trip at some point between Friday and Monday. With over 17.6 million getaway trips by car expected, these are the roads with the worst-expected congestion, as well as the train lines that will be closed. Which roads are likely to be the worst affected? Transport analytics company Inrix has predicted the M5 between Bristol and Devon will have the most severe getaway traffic. It said the stretch from junction 15 north of Bristol to junction 23 for Bridgwater is likely to see delays of more than 40 minutes on Friday and Saturday. Delays exceeding half an hour are forecast on Friday on the M20 in Kent, as the route is taken by a large proportion of vehicles making Channel crossings via Dover or Folkestone. The warning covers journeys from junction seven near Maidstone to junction three (Addington Interchange), as well as from junction one at Swanley to junction five at Aylesford. Major rail lines closed Rail passengers are being warned that some major routes will be closed for engineering work, as Network Rail undertakes 261 projects across Britain. There will be no long-distance services between London King's Cross and Peterborough on Saturday, which will disrupt Anglo-Scottish journeys by LNER and Lumo on the East Coast Main Line. Avanti West Coast will operate a reduced and amended service to and from London Euston. No services will operate between Birmingham New Street and Birmingham International between Saturday and Monday. Affected Avanti West Coast and CrossCountry services will be diverted, increasing journey times. London Northwestern services will run to and from Birmingham International only."
    },
    {
        "title": "Redundancies begin at UK's largest bioethanol plant after government rejects bailout",
        "description": "Redundancies are to begin on Tuesday at the UK's largest bioethanol plant, which is to close after the government refused to offer the owners a bailout.",
        "url": "https://news.sky.com/story/redundancies-begin-at-uks-largest-bioethanol-plant-after-government-rejects-bailout-13414125",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vivergo-fuels-bioethanol_6994568.jpg?20250818155453",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-18 13:52:00",
        "Headline": "Vivergo has begun an orderly wind-down of the business, which is set to close at the end of the year.",
        "Content": "Redundancies are to begin on Tuesday at the UK's largest bioethanol plant, which is to close after the government refused to offer the owners a bailout. Around 60 staff, just over a third of the total, are to receive redundancy letters on Tuesday and leave the site. The remaining workers will go in phases over the coming months, as part of an orderly wind-down of the business. On Friday, owners Vivergo Fuels, a subsidiary of Associated British Foods (ABF), said the government's decision not to offer financial support to the facility in Lincolnshire was \"deeply regrettable\" and blamed the UK's trade deal with the United States. The plant converts wheat into bioethanol, a component of petrol used to reduce carbon emissions. The facility was already losing £3m a month, partly due to high energy prices. But now the company has also been left competing with cheaper imports after the 19% tariff on American bioethanol was scrapped following the recent UK-US trade deal. Vivergo described the government's decision not to offer financial support as \"a flagrant act of economic self-harm that will have far-reaching consequences\", pushing the sector \"to the point of collapse\". The company added that the closure would be a \"massive blow\" to the local area and supply chain. More than 160 staff at the site, who were consulted about a potential wind-down process in June, will have left by the end of the year, when the plant will be ready for demolition. The factory is also the UK's largest single production site for animal feed, a byproduct of the production process for ethanol. The NFU farming union described the imminent closure as \"terrible news\" for workers who will lose their jobs, but also \"thousands of people whose livelihoods depend on this supply chain\". Read more from Sky News:Pub closures are 'heartbreaking' trendBlackRock backs Gupta's steel empire The company, near Hull, warned earlier this year that it was in financial trouble as crisis talks continued with the government. In a statement, the government said it made the \"difficult decision not to offer direct funding as it would not provide value for the taxpayer or solve the long-term problems the industry faces\". But Unite general secretary Sharon Graham called the government's decision \"short-sighted\" while the GMB union's Charlotte Brumpton-Childs blamed \"the impact of tariffs and trade deals\" for \"working people losing their livelihoods\"."
    },
    {
        "title": "UK weather: Country set for one of the hottest summers on record, Met Office says",
        "description": "The UK is on track for one of its hottest summers on record, the Met Office has said.",
        "url": "https://news.sky.com/story/uk-weather-country-set-for-one-of-the-hottest-summers-on-record-met-office-says-13414228",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-weather-sunny-sunshine_6994783.jpg?20250818201514",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-18 16:51:00",
        "Headline": "Provisional Met Office figures show the UK's average temperature from 1 June to 17 August was 16.2C, some 1.6C above the average temperature.",
        "Content": "The UK is on track for one of its hottest summers on record, the Met Office has said. With two weeks remaining in the meteorological summer, there is still time for changes in the weather, but the season's persistent warmth and consistent above-average temperatures suggest it could be one of the country's warmest summers since records began in 1884. Provisional figures from the Met Office show that the UK's average temperature from 1 June to 17 August was 16.2C, some 1.6C above the average temperature. Met Office scientist Emily Carlisle said: \"It's looking like this summer is on track to be one of the warmest, if not 'the' warmest, since the series began in 1884. \"What's striking is the consistency of the warmth. June and July were both well above average and even outside of heatwaves, temperatures have remained on the warmer side.\" The persistent warmth is driven by a combination of factors, including dry ground from spring, high-pressure systems, and unusually warm seas around the UK, she said. The scientist added: \"These conditions have created an environment where heat builds quickly and lingers. \n                  TikTok and Instagram accused of targeting teens with suicide and self-harm content\n                 \n                  There's one thing scarier than markets lurching around - and it's happening right now\n                 \n                  Revealed: The roads set to face worst bank holiday traffic\n                 \"While we haven't seen record-breaking highs - 35.8C is the peak so far this year - the overall trend in consistently above-average temperatures is what matters.\"  The Met Office has said that climate change is contributing to rising summer temperatures, with the UK experiencing an average warming of about 0.25C per decade. The UK's warmest summer on record is 2018, followed by 2006, 2003, 2022 and 1976. The Met Office said both June and July delivered consistently above-average temperatures, with England experiencing its hottest June on record. There have been four heatwaves so far this summer. And the Met Office said that while that was unusual, each has been short-lived and interspersed with near-average conditions. And the hottest day of the year, at 35.8C in Faversham, Kent, is well below the all-time high for the UK of 40.3C in 2022. Read more:Homes evacuated as firefighters tackle huge blaze in seaside townMore than 200 pub closures in six months in 'heartbreaking' trend East and West Midlands in drought The East and West Midlands were officially in drought in mid-July, after the driest start to a year since 1976. Eight million people faced water use restrictions, with many more potentially affected under a worst-case scenario outlined by the Environment Agency. The two regions joined the North West of England and Yorkshire, which had been under drought status for several weeks. Reservoir and river levels in the Midlands were well below normal, with no substantial rain in the forecast, government experts, water companies and the Met Office said. Nationally, reservoirs were on average only 76% full, falling below the levels seen during the severe drought of 2022."
    },
    {
        "title": "Man guilty over Dalston gangland shooting that left nine-year-old girl with bullet lodged in brain",
        "description": "A man has been found guilty of his role in a gangland shooting that left a nine-year-old girl with a bullet lodged in her brain.",
        "url": "https://news.sky.com/story/man-guilty-over-dalston-gangland-shooting-that-left-nine-year-old-girl-with-bullet-lodged-in-brain-13411992",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-javon-riley-dalston_6991303.jpg?20250815084016",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-08-18 11:15:00",
        "Headline": "Javon Riley, 33, had denied three charges of attempted murder, relating to three men, and causing grievous bodily harm with intent to the girl at the Old Bailey.",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  A man has been found guilty of his role in a gangland shooting that left a nine-year-old girl with a bullet lodged in her brain. Javon Riley, 33, helped the motorbike-riding gunman escape from the scene after he fired six times at the Evin Restaurant in Dalston, east London, on 29 May last year. Prosecutors said the Tottenham Turks gang had ordered the planned assassination of members of the rival Hackney Turks, who were sitting at a table outside. But the first bullet missed, hitting the child - who was inside eating ice cream with her family - in the head. Police said it was a \"miracle\" she survived and were just \"millimetres\" away from launching a murder investigation. The girl, who cannot be identified, spent more than three months in hospital, where she had her skull rebuilt with titanium, and has made a good recovery. But she still has the bullet lodged in her brain and is expected to have physical and cognitive difficulties for the rest of her life. Her mother said in a statement: \"In a single moment, the future we had imagined for our daughter was torn away. She was once an energetic, adventurous child - everything that celebrated movement, energy, and life. \"Now, weakness on her left side means she can only watch from the sidelines, living with a titanium plate in her skull and a bullet still in her brain. \"As parents, we are shattered - emotionally, physically, mentally, and financially. Each day brings new challenges, from her slower growth on one side to the emotional and mental scars that cannot be seen. \"The world we once believed was safe for our child now feels frightening and uncertain. This was not just an accident - even if our daughter was not the intended target, those responsible were still attempting to take lives, it is brutal and inhumane. We live with this pain every day, knowing nothing will ever be the same for our family.\" Footage caught on the helmet camera of an off-duty policeman shows the gunman, who was riding a powerful Ducati Monster motorbike, shoot six bullets in two seconds. Read more: The Turkish gang war behind the shooting The men targeted scrambled to get inside but Nasser Ali, 43, suffered a wound to his backbone, Kenan Aydogdu, 45, was shot in the leg and Mustafa Kiziltan, 35, was hit in the thigh. Riley, from the Tottenham area, claimed he had been contacted by a \"third party\" and offered around £40,000 to be involved in a \"smash and grab\" robbery of 60kg of drugs. He denied three charges of attempted murder and causing grievous bodily harm with intent to the girl, but was found guilty after a trial at the Old Bailey on Monday. Prosecutors said he was not a member of the Tottenham Turks, but played \"a key role\" before, during and after the shooting. The court heard he carried out surveillance in the weeks before, once sipping pina coladas at a bar across the road from the restaurant. £15,000 reward After the shooting, the gunman ditched his motorbike and was driven away by Riley, who disposed of the weapon and arranged for cars used in the plot to be set on fire. Riley told the jury he had never met the gunman and refused to name the person who had hired him, telling jurors he feared for his and his family’s safety. Police are offering a reward of up to £15,000 for information to help catch the gunman, who is believed to have links to south London, and those involved in orchestrating the shooting. \"This isn't a regular case, this is a completely innocent individual, a child, that's been shot and if you can't bring yourself to come forward with information… we need your help,\" Detective Inspector Ben Dalloway told Sky News. \"You can see from the fact that the gunman here shot six rounds into a busy restaurant where diners were sat, minding their own business, they don't care,\" added DI Dalloway. \"As long as they send a message, as long as they seek to harm the opposition, they'll stop at nothing.\" The judge, Mark Lucraft KC, said he will sentence Riley on 12 September when he faces a \"lengthy\" prison sentence."
    },
    {
        "title": "The Turkish gang war behind the shooting of a nine-year-old girl",
        "description": "When a gunman riding a powerful motorbike pulled up outside a busy restaurant in north London and fired six shots in two seconds, the first bullet shattered the glass and hit a nine-year-old girl in the head. ",
        "url": "https://news.sky.com/story/the-turkish-gang-war-behind-the-shooting-of-a-nine-year-old-girl-13412051",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dalston-shooting_6991584.png?20250815135902",
        "type": "UK",
        "Author": "Henry Vaughan",
        "Date Published": "2025-08-18 11:22:00",
        "Headline": "Police believe the feud between the Tottenham Turks and the Hackney Turks is behind more than 20 murders over the last two decades. ",
        "Content": "\n          Home affairs reporter and feature writer\n              @Henry_Vaughan\n  When a gunman riding a powerful motorbike pulled up outside a busy restaurant in north London and fired six shots in two seconds, the first bullet shattered the glass and hit a nine-year-old girl in the head.  Police say it came just millimetres from killing her and it is a \"miracle\" she survived, making a good recovery after spending more than three months in hospital, where her skull was rebuilt with titanium. The girl, who was eating ice cream at the time of the shooting, still has the bullet lodged in her brain and is expected to have physical and cognitive difficulties for the rest of her life. The intended targets of what prosecutors called an \"assassination\" attempt at Evin restaurant in Kingsland High Street, Dalston, on 29 May last year were a group of men sat eating and drinking at an outside table, who can be seen scrambling to the door in CCTV footage as the shots were fired. Nasser Ali, 43, suffered a wound to his backbone. Kenan Aydogdu, 45, was shot in the leg - and Mustafa Kiziltan, 35, was hit in the thigh. They were members of the Hackney Turks gang and the hit was organised by their fierce rivals, the Tottenham Turks, in a bitter tit-for-tat feud police believe is behind more than 20 murders over the past two decades. The war escalated after Kemal Armagan, a leading figure in the Hackney Turks, swore revenge after he was beaten up at the Manor Club snooker hall in north London in the early hours of 24 January 2009. \n                  Man guilty over Dalston gangland shooting that left nine-year-old girl with bullet lodged in brain\n                 \n                  Chadwell Heath: Three arrested after death of woman in east London\n                 \n                  Cara Delevingne reveals how Topshop inspired her fashion sense - as brand relaunches in London\n                 Izzet Eren and his cousin Kemal Eren, whose family ran the rival Tottenham Turks, were among those involved in the fight believed to have sparked the war, which has seen members of the two organised crime groups, their families and members of the public murdered and maimed on the streets of London and across Europe. Javon Riley, 33, has been found guilty of three charges of attempted murder and causing grievous bodily harm with intent after a trial at the Old Bailey over his role in helping to carry out the Dalston shooting. The gunman, who was riding a stolen Ducati Monster, got away and Riley refused to name the person who had hired him, telling jurors he feared for his and his family's safety. Police are offering a reward of up to £15,000 for information to help catch him and those involved in orchestrating the shooting, who are believed to be among the higher echelons of the Tottenham Turks. Detective Inspector Ben Dalloway told Sky News it fits the pattern of \"tit-for-tat violent incidents\" between the gangs. \"You'll have one member of one OCG [organised crime group] shot, stabbed, murdered, and then within months, sometimes even less, there'll be retaliation,\" he said. Beytullah Gunduz, who had left the restaurant just 17 minutes before the attack, was allegedly the subject of a £200,000 contract hit taken out in Turkey by Kemal Eren over his alleged role in the 2013 murder of his cousin, and Izzet Eren's brother, Zafer Eren. Gunduz was acquitted of the murder. Gunduz avoided the execution of the contract but was shot in the neck in August 2020 at close range by a motorcyclist before arriving at his solicitor's office carrying his passport, a court heard. One of the three men injured in the Dalston shooting, Kenan Aydogdu, who was described by prosecutors as a \"high ranking\" member of the Hackney Turks in a previous murder trial, had also been targeted before. He was shot in the leg while in the same car as his close associate Ali Armagan in 2009 and suffered gunshot wounds to his legs when a gunman fired 10 shots as he was driving the following year. Ali Armagan was shot dead in his car parked outside Turnpike Lane Tube station on 1 February 2012. Three men were later convicted of informing Kemal Eren - nicknamed \"No Fingers\" because of his missing digits - about his whereabouts at the time. Kemal Eren is still wanted in the UK for the murder after he fled to Turkey, where he was himself shot and left paralysed in December 2012. Police believe he is now the de facto leader of the Tottenham Turks after Izzet Eren, 41, was murdered in Moldova - where he fled after escaping from prison in Turkey - on 10 July last year. Kemal Armagan, wearing a camouflage outfit and riding an electric bike, allegedly fired seven shots with a 9mm gun at his back and head, killing him instantly as he sat outside a café in Moldovan capital Chisinau in revenge for the murder of his brother. When he was arrested carrying a false identity document in the ancient Turkish port city of Izmir on 10 March this year, Kemal Armagan was also wanted on suspicion of the murder of a shopkeeper in London and two other members of the Eren family in Turkey. The rise of Turkish organised crime Former head of drugs threat and intelligence for the National Crime Agency (NCA), Tony Saggers, says Turkish organised crime groups filled the demand for heroin from the 1970s as the UK grew into Europe's largest market for the drug. Legitimate trade routes set up by immigrants were \"mirrored and matched\" by the gangs, who brought heroin from Afghanistan through Iran and into Europe, he says. Among those to get a foothold in the 1990s were the Hackney Turks, who are also known as the Bombacilars (Bombers), an ethnically Kurdish group run by Huseyin Baybasin, who was known as \"The Emperor\". He was dubbed Europe's Pablo Escobar, said to be responsible for importing some 90% of all heroin into the UK, before he was jailed for life in the Netherlands in 2001. When his younger brother Abdullah Baybasin - who is in a wheelchair after being shot in 1986 - took over, police likened watching him while he was under surveillance in the early 2000s to a scene in The Godfather. Those who met him kissed his hand and he spoke in quiet whispers so only those close could hear. He was jailed for importing heroin and blackmail in what the judge described as a \"mafia type\" extortion racket in 2006 but the conviction was quashed and he was deported to Turkey in 2010 after a retrial collapsed. Baybasin served a sentence for setting up and directing a criminal network and drug trafficking but is now free. It started with a slap By 2009, Kemal Armagan, and his brother Ali, were among those leading the Hackney Turks. Along with the Tottenham Turks - also known as the Tottenham Boys - and a third north London gang with Turkish links, they were responsible for importing most of the UK's heroin, according to police. Izzet Eren, his cousin Kemal Eren and Mehmet Senpalit arrived at the Manor Club, a snooker hall near Manor House Tube station, at around 1am on 24 January 2009 before Kemal Armagan approached their group and a fight broke out, according to a police intelligence report. \"I'm old school, I'll sort it out myself,\" Kemal Armagan told police after the incident. The fight was directly linked to 31 shootings, four arsons, five stabbings, and three murders that year as the gangs attacked each other in retaliatory violence. The Hackney Turks' E5 social club was sprayed with machinegun fire in March before Ahmet Paytak, 50, was shot and killed in a convenience shop then linked to Senpalit in Hornsey Road, Holloway, by helmet-wearing gunmen, in what prosecutors described as an \"act of immediate revenge\". The two men convicted over the shooting were said by the prosecution to have been hired by the Hackney Turks leadership \"to do their dirty work\", while Kemal Armagan is still wanted for the murder. Izzet Eren was shot at 12 times, but escaped uninjured, in September in an attempted hit, while fellow Tottenham Turk Oktay Erbasli was shot dead by a man on a motorbike on 2 October while driving a Range Rover rented by Kemal Eren. Three days later, 21-year-old Cem Duzgan, who was not thought to be the intended target, was killed when a gunman opened fire with a submachine gun at the E5 social club, where Erdal Armagan was also inside. Prosecutors described the murder as a \"hit\" likely ordered by Kemal Eren as revenge for the shooting of Erbasli. Ali Armagan was murdered in February 2012, while Kemal Eren, who is still wanted in the UK over the murder, was shot in Elbistan, southeastern Turkey in December 2012 and left paralysed. Zafer Eren, then the leader of the Tottenham Turks, was shot dead in Southgate on 18 April 2013, when his younger brother Izzet Eren took over the gang. Prison escapes Izzet Eren shot and killed one man and left another in a wheelchair in a revenge shooting in Bodrum, Turkey, in 2014. He was deported to Turkey, where he was wanted for the murder, after serving a drugs sentence in the UK in 2015. On 18 April that year, his cousin and Kemal Armagan's brother, Beyzat Eren, was shot and killed in Turkey on the second anniversary of the murder of Zafer Eren. Izzet Eren escaped from prison and smuggled himself back into the UK, where he was stopped by police on a stolen motorbike with another man on 13 October 2015, armed with a pistol and a Skorpion submachine gun. Both guns were loaded with the safety catches off and police believed they were on their way to avenge the murder of Izzet's brother, Zafer. The pair admitted firearms offences but while being taken to Wood Green Crown Court in a prison van for sentencing, the Tottenham Turks made a bid to free Izzet. The Metropolitan Police had received intelligence his gang were planning to help him escape and Jermaine Baker, one of the those recruited to help, was fatally shot by a police marksman. Izzet Eren was jailed for 14 years and transferred to serve the rest of his sentence in Turkey on 26 August 2019 but escaped a month later on 26 September 2019. His younger brother Huseyin Eren was murdered on a holiday to Turkey in 2020, sparking a new wave of violence. In evidence given to the Jermaine Baker inquiry, police said the Tottenham Turks were behind three fatal shootings and four threat to life warnings in 2020 alone, which appeared to be linked to the murder of Huseyin. There was also intelligence that Izzet Eren planned to return to the UK to seek revenge on multiple targets. The Tottenham Turks were linked by a judge the murder of DJ Koray Alpergin, 43, who was stripped naked and tortured to death after being kidnapped with his girlfriend Gozde Dalbudak as they returned home from an Italian restaurant in Mayfair, central London, in October 2022. One of those convicted over the plot was also found guilty of conspiracy to murder another man who was shot in Enfield, but survived, in another Tottenham Turks-ordered hit on 7 January 2023. Leaders killed and arrested Izzet Eren is understood to have travelled to Ukraine, from where he crossed the border to Moldova along with refugees fleeing the war with Russia. An arrest warrant was issued from the UK to Moldova in 2022 to extradite Izzet Eren, who was suspected of being behind the importation of 156kg of heroin from Iran to Heathrow Airport and escaping lawful custody. He was remanded in custody for around 18 months before being shot dead after being granted bail pending an appeal of his asylum claim. London-based former lawyer, Toper Hassan, 58, who is married to Kemal Armagan's sister, solicitor Reyhan Armagan, was allegedly recruited by his brother-in-law to organise logistics for Izzet Eren's murder, a court heard during a court hearing, where he was fighting extradition to Moldova. Turkish police confirmed to Sky News that Kemal Armagan was arrested on 10 March this year. Dr Mahmut Cengiz, an adjunct faculty at the Department of Criminology, Law and Society of George Mason University, says targeting and killing the Tottenham Turks leader sends a \"strong message\" and further reprisals are likely. \"If you are ... able to kill a group leader, it means that you are the most powerful organisation,\" he said, adding that he expects a \"strong response\". He said the Tottenham Turks are \"fighting for the criminal markets, so to be able to give a strong message\" that they are still active they will have to attack the Hackney Bombers and target \"the high-level people from this organisation\"."
    },
    {
        "title": "Drug dealer on e-bike who killed great-grandfather is jailed",
        "description": "A drug dealer who killed an 86-year-old man when he crashed into him on an e-bike has been jailed.",
        "url": "https://news.sky.com/story/drug-dealer-on-e-bike-who-killed-great-grandfather-is-jailed-13414154",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-dylan-gree-court-institution_6994504.jpg?20250818143339",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-18 15:01:00",
        "Headline": "Dylan Green was riding an e-bike in Burnley, Lancashire, when he hit great-grandfather Bart O'Hare, who had been on his way to a chip shop.",
        "Content": "A drug dealer who killed an 86-year-old man when he crashed into him on an e-bike has been jailed. Dylan Green, 20, collided with great-grandfather Bart O'Hare, who was on his way to a chip shop in Burnley, Lancashire. Green's girlfriend was a pillion passenger on the bike - and he had been pulling a wheelie in the moments before the crash. Mr O'Hare, who had two granddaughters and five great-grandchildren, later died in hospital having sustained head and chest injuries, including a fractured skull. His daughter told Green, who was sentenced to eight years and three months' detention, that his actions had \"broken my family\". Footage played in Preston Crown Court showed Green, of Burnley, who was on bail for drugs offences at the time, pulling the wheelie in Accrington Road shortly after 4.15pm on 22 March last year. The wheelie lasted for 37 metres, the court heard. Philip Astbury, prosecuting, told the court Mr O'Hare was thrown into the air following the collision, which happened when he was less than three metres into the road. 'Not once did you show any concern' Tyre marks showed Green's bike had returned to two wheels shortly before the crash but Mr Astbury said the wheelie had \"entirely compromised Dylan Green's view of the road ahead of him\". He said the e-bike had \"never been recovered\" - but analysis of CCTV found it was travelling 41% faster than all other vehicles in the area at the time. Mr O'Hare's daughter Marika Mausolf addressed Green from the witness box in court and said: \"Not once did you show any thought or concern for him after taking your girlfriend out on an illegal bike and pulling wheelies on the road with no consideration for my dad. \"Your selfish attitude was to try and diminish your actions by leaving my dad to suffer so you could get rid of the bike. \"You've broken my family in so many ways that I cannot begin to explain.\" Kristian Cavanagh, defending, said Green had demonstrated remorse \"in his own way\" and night terrors and panic attacks which he suffered were a reflection of how he felt. Recorder of Preston Judge Robert Altham told Green: \"Whilst you are undoubtedly sorry to be caught, I do not detect any real remorse.\" Read more from Sky News:Sharp rise in disabled people facing homelessnessNearly 2,000 soldiers fighting wildfires in Spain Green pleaded guilty at an earlier hearing to causing death by dangerous driving and causing death by driving while uninsured. He also pleaded guilty to one count of supplying MDMA between July and October 2023, for which he was given a concurrent sentence of 12 months in a young offender institute. He was disqualified from driving for 12 years and four months."
    },
    {
        "title": "Man seriously injured after tractor falls off bridge on to M20",
        "description": "A man has been seriously injured after his tractor fell off a bridge and on to the M20.",
        "url": "https://news.sky.com/story/man-seriously-injured-after-tractor-falls-off-bridge-on-to-m20-13414137",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-tractor-m20_6994532.jpg?20250818151156",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-18 15:10:00",
        "Headline": "South East Coast Ambulance Service said it was called to a collision involving a tractor and a lorry on the A227 overbridge near Wrotham at 11.20am.",
        "Content": "A man has been seriously injured after his tractor fell off a bridge and on to the M20. South East Coast Ambulance Service said it was called to a collision involving a tractor and a lorry on the A227 overbridge near Wrotham at 11.20am on Monday. The tractor fell on to the central reservation between junctions two and three of the M20 after the crash. The driver of the tractor was airlifted to King's College Hospital with serious injuries. Read more from Sky News:Man guilty over gangland shootingDozens evacuated over seaside town blaze Multiple ambulance crews, a critical care paramedic and the air ambulance attended the scene alongside Kent police and fire services. Large queues formed on either side of the overbridge following the collision, which left the impacted section of the M20 closed until around 11.30pm while resurfacing works and barrier repairs were carried out."
    },
    {
        "title": "Ozzy Osbourne documentary pulled from BBC's schedule - without explanation",
        "description": "An Ozzy Osbourne documentary has disappeared from the BBC's schedule without explanation.",
        "url": "https://news.sky.com/story/ozzy-osbourne-documentary-pulled-from-bbcs-schedule-without-explanation-13414083",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne-black-sabbath_6976617.jpg?20250729094452",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-08-18 12:22:00",
        "Headline": "Ozzy Osbourne: Coming Home is said to reveal the \"extraordinary rollercoaster\" of his family's life as they return to Britain and the singer tries to get fit enough to perform again.",
        "Content": "An Ozzy Osbourne documentary has disappeared from the BBC's schedule without explanation. The film was billed by producers as \"a moving and inspirational account\" of the last chapter of the metal legend's life. It was meant to air at 9pm on Monday on BBC One - as well as be available on iPlayer - but an episode of Fake Or Fortune? has replaced it. Sky News has contacted the BBC for comment on why the programme, called Ozzy Osbourne: Coming Home, has been pulled. The project was filmed over three years as Ozzy and his family returned to the UK, and was initially conceived as a series entitled Home to Roost. However, as the singer's health got worse it morphed into a one-off. Read more from Sky News:Homes evacuated amid huge fire in Essex seaside townScammers using AI to impersonate Sir Billy Connolly \n                  Yungblud pays tribute to his hero Ozzy Osbourne as he opens up about 'raw' documentary Are You Ready, Boy?\n                 \n                  Man charged with theft of flowers from Ozzy Osbourne tribute\n                 \n                  Ozzy Osbourne is given final tour of Birmingham - with thousands of fans flooding streets to pay their respects\n                  The BBC reported the show would reveal the \"extraordinary rollercoaster\" of the Osbournes' lives as Ozzy tries \"heroically\" to get fit enough to perform again. It's said to feature \"unique and intimate access\" to the family, including Ozzy's children, Jack and Kelly, who appeared in the reality series that made them household names in the early 2000s. The Black Sabbath frontman, who had Parkinson's disease, died last month - just a few weeks after his final all-star gig at Birmingham's Villa Park. Fans packed the city centre and chanted his name when his hearse passed through on 30 July. His wife, Sharon, was in tears as she got out to see the mass of flowers left for him at \"Sabbath Bridge\". The New York Times said his death certificate gave the cause as cardiac arrest, but the family hasn't commented."
    },
    {
        "title": "Trump says US will give Ukraine security guarantees - but Europe will 'take a lot of the burden'",
        "description": "Volodymyr Zelenskyy has said he's ready to meet with Vladimir Putin after Donald Trump said the Russian president had agreed to let Ukraine have security guarantees from its allies.",
        "url": "https://news.sky.com/story/zelenskyy-arrives-at-white-house-for-talks-with-trump-and-eu-leaders-13414188",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-macron_6994784.jpg?20250818201538",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-18 17:26:00",
        "Headline": "Donald Trump said Vladimir Putin \"agreed that Russia would accept security guarantees for Ukraine\", and the US would play a role. But he said Kyiv's European allies should play the leading role.",
        "Content": "Volodymyr Zelenskyy has said he's ready to meet with Vladimir Putin after Donald Trump said the Russian president had agreed to let Ukraine have security guarantees from its allies. A meeting between the two men could happen before the end of the month, followed by a trilateral summit which includes their US counterpart. Follow the latest: Trump vows to stop war It comes after Mr Trump hosted the Ukrainian president and a host of other European leaders at the White House on Monday, just days after he met Mr Putin in Alaska last week. Among those in attendance were Prime Minister Sir Keir Starmer, France's Emmanuel Macron, Italy's Giorgia Meloni, Germany's Friedrich Merz, Finland's Alexander Stubb, as well as NATO Secretary General Mark Rutte and Ursula von der Leyen, the president of the European Commission. Mr Trump said Mr Putin \"agreed that Russia would accept security guarantees for Ukraine\". He added: \"I think that the European nations are going to take a lot of the burden. We're going to help them, and we're going to make it very secure.\" 'Article-Five-like' The mention of US involvement in security guarantees was welcomed by the European leaders. Ms Von der Leyen said it was \"good to hear\" the nations were working on \"Article Five-like security guarantees\". NATO's Article Five is the principle that an attack on one member is considered an attack on all of them. Sir Keir said the guarantees would help ensure a \"lasting deal\", and one for which there would be consequences if Russia breached it. Mr Macron said it was not just about Ukraine, but \"the whole security of the European continent\". He added that one guarantee he would want to come out of any deals is that Ukraine should be able to have a \"credible\" army for \"the years and decades to come\". But there remained signs of some strain between Mr Trump and Europe. His belief that a ceasefire isn't required to strike a peace deal was challenged Mr Merz, who said he \"can't imagine\" a Zelenskyy-Putin meeting taking place without one. Sky News understands that European leaders and Mr Zelenskyy will stay in Washington for now to continue talks. The talks including the European leaders came after a Trump-Zelenskyy summit in the Oval Office. It was their first since their infamous sparring match back in February, but this time was far more cordial. Mr Zelenskyy was complimented on his suit and evoked a few hearty laughs from Mr Trump, who said the US would provide \"very good protection\" for Ukraine. Read more: Zelenskyy learned his lesson from last time Mr Trump revealed during the Oval Office talks that he would have a call with Mr Putin later in the day. He broke up his talks with the Europeans to do so, before returning to update them on what they had discussed. A Kremlin official, Kirill Dmitriev, later hailed the talks as an \"important day for democracy\", but didn't comment on the issue of security guarantees or possible changes of territory. At the Alaska summit last Friday, Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine as a condition for ending the war. In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Read more: Putin's demands would be bitter blow to Ukraine Trump talks up possible land swaps Mr Trump is said to be planning to urge Mr Zelenskyy to agree to the conditions as part of a peace deal to end the war - despite the Ukrainian president previously ruling out handing any territory to Moscow. \"We also need to discuss the possible exchanges of territory,\" the US president said ahead of the multilateral talks with Mr Zelenskyy and European leaders. He said such exchanges would need to take \"into consideration the current line of contact\". He added: \"That means the war zone, the war lines that are now, pretty obvious, very sad, actually, to look at them and negotiating positions.\" What happens next? Mr Zelenskyy and Germany's Mr Merz both suggested a Zelenskyy-Putin summit could take place within two weeks. A location has not yet been determined. A meeting that includes Mr Trump would likely follow in the weeks after."
    },
    {
        "title": "Hamas 'agrees to ceasefire deal' with hostage-prisoner exchange, say officials",
        "description": "Hamas has agreed to a ceasefire deal, in which half the hostages being held in Gaza will be freed in return for Israel releasing some Palestinian prisoners, according to senior diplomats.",
        "url": "https://news.sky.com/story/hamas-agrees-to-ceasefire-hostage-deal-with-israel-senior-official-says-13414166",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-israel-tanks-gaza_6994755.jpg?20250818194610",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-18 15:22:00",
        "Headline": "Israel has announced plans to reoccupy Gaza City, putting Hamas under pressure to reach a ceasefire deal. But there has been no formal response about whether Israel will agree to the terms.",
        "Content": "Hamas has agreed to a ceasefire deal, in which half the hostages being held in Gaza will be freed in return for Israel releasing some Palestinian prisoners, according to senior diplomats. Egyptian and Qatari mediators have been holding talks with Hamas in their latest effort to broker a ceasefire with Israel. The agreement appears to be similar to a previous plan put forward by Donald Trump's Middle East envoy, Steve Witkoff, which included a 60-day ceasefire deal. That plan had previously been accepted by Israel. Senior Hamas official Basem Naim confirmed the proposal on Facebook: \"The movement has handed over its approval to the new proposal presented by the mediators.\" There has been no official response from Israel, although Israeli Prime Minister Benjamin Netanyahu said in a video: \"I, like you, hear the reports in the media, and from them you can get one impression - Hamas is under immense pressure.\"  According to officials briefed on the negotiations, the proposal includes \"a path toward a comprehensive agreement to end the war\". The plans include a ceasefire in Gaza, during which Israeli forces would be redeployed and humanitarian aid increased. A number of Palestinian prisoners would also be exchanged for half of the Israeli hostages being held in Gaza. \n                  Hamas may have agreed to a ceasefire - but is Netanyahu ready to negotiate?\n                 \n                  'Not in our name': Israelis protest against Gaza war - but Netanyahu seems unmoved\n                 \n                  Remaining hospitals in Gaza overwhelmed with malnutrition cases\n                 Israel announced plans to reoccupy Gaza City after ceasefire talks appeared to break down last month. The humanitarian crisis in Gaza has led experts to warn that the territory is sliding into famine. Sky's International Correspondent Diana Magnay in Jerusalem said it is clear that mediators from Egypt and Qatar, potentially along with Hamas, felt under pressure because of Mr Netanyahu's plan to push further into Gaza City, \"and that's why you've had mediators over the weekend in Cairo trying to get some kind of plan on the table\". \"So the big question is, will Benjamin Netanyahu agree to this? We shall have to see whether it is his intention at any point to agree to a ceasefire or whether this is just too late now and he will use the opportunity to push on in Gaza,\" she added.  Israel's plans to seize control of Gaza City triggered protests from tens of thousands of Israelis on Sunday, some of the largest demonstrations since the war began. by Adam Parsons, Middle East correspondent There is a sizeable gap between the deal that Hamas has agreed to, and the demands laid down by the Israeli government. The question is whether Benjamin Netanyahu is ready to negotiate. Netanyahu has been clear that he wants all the hostages back in one go, Israeli security control of the Gaza Strip and the installation of a new government that is neither Hamas nor - crucially - the Palestinian Authority (PA). And on that point, as well as the others, a row looms. The PA, which is the governing body of the Palestinian-controlled areas of the West Bank, seems to have been far more closely involved in these negotiations than Hamas.  The ceasefire proposal is likely to suggest that, after the removal of Hamas, Gaza would be controlled by a committee overseen by the PA. \n For Israel to agree that would require a significant political change of heart - not something that has been Netanyahu's speciality. His decision now rests between competing forces - the chunk of the Israeli public that has just held a nationwide strike, calling for the war to the end, and those, including members of his cabinet, who think that Israel needs to wholly subjugate, if not entirely occupy, Gaza in order to either maintain its safety or fulfill its historic destiny. Read more from Sky News:Israelis protest against Gaza warIsrael's PM and the propaganda warUN: Reporters must have access Protesters urged a deal to end the fighting and free the remaining 50 hostages held in Gaza since the Hamas attack in October 2023. Israeli officials believe 20 are alive. Thousands of Palestinians, fearing an imminent Israeli ground offensive, have left their homes in eastern areas of Gaza City, now under constant Israeli bombardment, for points to the west and south in the territory. The last round of indirect ceasefire talks ended in deadlock in late July, with the sides trading blame for its collapse. Earlier on Monday, Donald Trump appeared to cast doubt on peace talks. \"We will only see the return of the remaining hostages when Hamas is confronted and destroyed!!! The sooner this takes place, the better the chances of success will be,\" he posted on his Truth Social site. The Hamas-run Gaza Health Ministry said the Palestinian death toll from 22 months of war has now passed 62,000, although the ministry does not distinguish between civilians and members of Palestinian armed groups."
    },
    {
        "title": "Trump summit: Volodymyr Zelenskyy has learned his lesson from the last visit to the White House",
        "description": "Volodymyr Zelenskyy has learned his lesson from the last time he was in the Oval Office.",
        "url": "https://news.sky.com/story/trump-summit-volodymyr-zelenskyy-has-learned-his-lesson-from-the-last-visit-to-the-white-house-13414314",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zelenskyy-trump_6994948.jpg?20250819002320",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-08-18 19:53:00",
        "Headline": "There was no repeat of the heated exchanges seen six months ago, after their disastrous meeting.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Volodymyr Zelenskyy has learned his lesson from the last time he was in the Oval Office. When the Ukrainian leader was at the White House in February, he didn't wear a suit and was berated by Donald Trump and JD Vance over alleged disrespect. Trump-Zelenskyy latest: NATO-style security guarantees Zelenskyy's learned from that moment six months ago and he's taken on board what other European and world leaders have done with these Oval Office moments - that the best policy is to say as little as possible.  Such was the contrast that the right-wing reporter Brian Glenn, who questioned Zelenskyy over not wearing a suit in February, told the Ukrainian leader: \"You look fabulous in that suit.\" The best tactic for dealing with Trump in front of reporters is to not answer the question, don't rise to the bait. Get in there and out as soon and as quickly as you can. And this time, that is precisely what Zelenskyy did. \n                  Trump's meeting with Zelenskyy will be no repeat of Oval Office meltdown - here's why\n                 \n                  Donald Trump says Volodymyr Zelenskyy 'can end war with Russia if he wants to' - ahead of crucial White House meeting\n                 \n                  The stakes are high - and the unity of the alliance against Putin has never been so threatened\n                 Did Vance learn his lesson too? The vice president berated Zelenskyy last time but this time, while the US president's key advisers were there, JD Vance sat quietly to Trump's side, saying nothing altogether. It was a marked contrast from six months ago, but some sort of \"gulf between the two sides in terms of any peace deal\" continues. Read more from Sky News:'Ketamine Queen' admits drug chargePutin 'demands key regions of Ukraine' Melania's influence The influence of Melania Trump seems apparent again. The US first lady sent a letter to Vladimir Putin via Trump at the Alaska summit on Friday, calling for the war to end. And on Monday, Zelenskyy gave Trump a letter from his own wife for Melania."
    },
    {
        "title": "Swatch apologises for 'slanted eye' ad after backlash",
        "description": "Watchmaker Swatch has apologised and pulled ads featuring an Asian male model pulling the corners of his eyes backwards following accusations of racism.",
        "url": "https://news.sky.com/story/swatch-apologises-for-slanted-eye-ad-after-backlash-13414010",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-swatch-china_6994330.jpg?20250818111438",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-18 10:02:00",
        "Headline": "Images for the Swatch Essentials collection were criticised for the \"slanted eye\" pose, especially in China, with many commentators saying they appeared to mimic racist taunts.",
        "Content": "Watchmaker Swatch has apologised and pulled ads featuring an Asian male model pulling the corners of his eyes backwards following accusations of racism. Images for the Swatch Essentials collection were criticised for the \"slanted eye\" pose, especially in China, with many commentators saying they appeared to mimic racist taunts. The Swiss company has apologised in both English and Chinese on the social media platforms Weibo and Instagram - saying it had \"taken note of the recent concerns\" and removed all related materials worldwide. \"We sincerely apologise for any distress or misunderstanding this may have caused,\" it said. Shares in the company fell by as much as 2.7% in early trading on Monday. Read more:Jimmy Lai's son says father will 'most likely die in jail' unless UK govt intervenesNew words added to dictionary: Are you down with the kids? It is the latest setback for the company, whose shares have dropped by more than half since early 2023 and now faces a 39% tariff on its exports to the US. Swatch - which also makes Omega, Longines and Tissot watches - relied on China, Hong Kong and Macau for about 27% of its sales last year. The company's revenue fell 14.6% to 6.74 billion Swiss francs (£6.2bn) in 2024 after a drop in demand in China. Swatch blamed this on \"persistently difficult market conditions and weak demand for consumer goods overall\"."
    },
    {
        "title": "Key takeaways from White House talks between Trump, Zelenskyy and EU leaders",
        "description": "These are the key takeaways from the talks between US President Donald Trump, Ukrainian leader Volodymyr Zelenskyy and other European leaders, including Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/key-takeaways-from-white-house-talks-between-trump-zelenskyy-and-eu-leaders-13414380",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-zelenskyy-ukraine_6994947.jpg?20250819000844",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-08-18 21:47:00",
        "Headline": "The meeting involved Donald Trump, Volodymyr Zelensky, PM Keir Starmer, France's Emmanuel Macron, Italy's Giorgia Meloni, Germany's Friedrich Merz, Finland's Alexander Stubb, NATO Secretary General Mark Rutte and Ursula von der Leyen, the president of the EU Commission.",
        "Content": " These are the key takeaways from the talks between US President Donald Trump, Ukrainian leader Volodymyr Zelenskyy and other European leaders, including Prime Minister Sir Keir Starmer. Security guarantees In an important step towards a deal, Mr Trump has promised that the US would be involved in providing security guarantees for Ukraine. The US leader said that there would be some form of security guarantees for Ukraine, but did not reveal whether this would involve US troops. Mr Trump said Mr Putin \"agreed that Russia would accept security guarantees for Ukraine\". He added: \"I think that the European nations are going to take a lot of the burden. We're going to help them, and we're going to make it very secure.\" His comments were welcomed by the European leaders, with Ursula von der Leyen, president of the European Commission, saying it was \"good to hear\" the nations were working on \"Article Five-like security guarantees\". NATO's Article Five is the principle that an attack on one member is considered an attack on all of them. \n                  Why does Putin want Ukraine's Donbas region?\n                 \n                  Trump's meeting with Zelenskyy will be no repeat of Oval Office meltdown - here's why\n                 \n                  Donald Trump says Volodymyr Zelenskyy 'can end war with Russia if he wants to' - ahead of crucial White House meeting\n                 \"When we speak about security guarantees, we speak about the whole security of the European continent,\" French President Emmanuel Macron said. He added that one guarantee he would want to come out of any deals is that Ukraine should be able to have a \"credible\" army for \"the years and decades to come\". No ceasefire needed for peace deal Mr Trump said there did not need to be a ceasefire in Ukraine, because a peace deal could be worked out while Ukraine and Russia are at war. \"I don't think you need a ceasefire. You know, if you look at the six deals that I settled this year, they were all at war, I didn't do any ceasefires,\" he said. \"I know that it might be good to have, but I can also understand, strategically, why one country or the other wouldn't want it. You have a ceasefire and they rebuild and rebuild and rebuild and maybe they don't want that.\" He said he liked the \"concept of a ceasefire\", because people would stop being killed, but \"we can work a deal where we're working on a peace deal while they're fighting\". But German Chancellor Friedrich Merz said \"we would all like to see a ceasefire\". He told the media in the White House: \"I can't imagine that the next meeting would take place without a ceasefire, so let's work on that and let's try to put pressure on Russia.\" Mr Trump later pushed back, saying he had not needed a ceasefire in ending any other wars, but he would welcome one if needed. The US leader said: \"So if we can do the ceasefire, great, and, if we don't do a ceasefire... many other points were given to us, many, many points were given to us, great points.\" Trilateral meeting The US president said that \"if everything works out well today\", there will be a trilateral meeting between himself, Mr Putin and Mr Zelenskyy. The latter said he was ready for such a meeting and Mr Trump confirmed that Mr Putin was as well. Mr Macron said that while a trilateral meeting is important, a \"quadrilateral\" summit would also need to take place after. It was not clear whether Mr Macron meant a meeting in which just France takes part, or whether he meant NATO, the EU, or the \"coalition of the willing\" should be the fourth member. At first, Mr Trump said he would call Mr Putin \"right after\" the White House meetings, but he ended up interrupting the talk with the European leaders to call his Russian counterpart in the middle of the meeting, according to an EU diplomat. 'Discuss exchanges of territory' \"We also need to discuss the possible exchanges of territory,\" the US president said ahead of the multilateral talks with Mr Zelenskyy and European leaders. He said such exchanges would need to take \"into consideration the current line of contact\". Mr Trump added: \"That means the war zone, the war lines that are now, pretty obvious, very sad, actually, to look at them and negotiating positions.\" This comes after Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine during the Alaska summit with Mr Trump as a condition for ending the war. Read more:Zelensky has learned his lesson from last timeTrump: Europeans 'to take burden' of security guarantees In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Mr Zelensky previously ruled out handing any territory to Moscow."
    },
    {
        "title": "Trump says US will give Ukraine security guarantees - but Europe will 'take a lot of the burden'",
        "description": "Volodymyr Zelenskyy has said he's ready to meet with Vladimir Putin after Donald Trump said the Russian president had agreed to let Ukraine have security guarantees from its allies.",
        "url": "https://news.sky.com/story/zelenskyy-arrives-at-white-house-for-talks-with-trump-and-eu-leaders-13414188",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-donald-trump-macron_6994784.jpg?20250818201538",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-18 17:26:00",
        "Headline": "Donald Trump said Vladimir Putin \"agreed that Russia would accept security guarantees for Ukraine\", and the US would play a role. But he said Kyiv's European allies should play the leading role.",
        "Content": "Volodymyr Zelenskyy has said he's ready to meet with Vladimir Putin after Donald Trump said the Russian president had agreed to let Ukraine have security guarantees from its allies. A meeting between the two men could happen before the end of the month, followed by a trilateral summit which includes their US counterpart. Follow the latest: Trump vows to stop war It comes after Mr Trump hosted the Ukrainian president and a host of other European leaders at the White House on Monday, just days after he met Mr Putin in Alaska last week. Among those in attendance were Prime Minister Sir Keir Starmer, France's Emmanuel Macron, Italy's Giorgia Meloni, Germany's Friedrich Merz, Finland's Alexander Stubb, as well as NATO Secretary General Mark Rutte and Ursula von der Leyen, the president of the European Commission. Mr Trump said Mr Putin \"agreed that Russia would accept security guarantees for Ukraine\". He added: \"I think that the European nations are going to take a lot of the burden. We're going to help them, and we're going to make it very secure.\" 'Article-Five-like' The mention of US involvement in security guarantees was welcomed by the European leaders. Ms Von der Leyen said it was \"good to hear\" the nations were working on \"Article Five-like security guarantees\". NATO's Article Five is the principle that an attack on one member is considered an attack on all of them. Sir Keir said the guarantees would help ensure a \"lasting deal\", and one for which there would be consequences if Russia breached it. Mr Macron said it was not just about Ukraine, but \"the whole security of the European continent\". He added that one guarantee he would want to come out of any deals is that Ukraine should be able to have a \"credible\" army for \"the years and decades to come\". But there remained signs of some strain between Mr Trump and Europe. His belief that a ceasefire isn't required to strike a peace deal was challenged Mr Merz, who said he \"can't imagine\" a Zelenskyy-Putin meeting taking place without one. Sky News understands that European leaders and Mr Zelenskyy will stay in Washington for now to continue talks. The talks including the European leaders came after a Trump-Zelenskyy summit in the Oval Office. It was their first since their infamous sparring match back in February, but this time was far more cordial. Mr Zelenskyy was complimented on his suit and evoked a few hearty laughs from Mr Trump, who said the US would provide \"very good protection\" for Ukraine. Read more: Zelenskyy learned his lesson from last time Mr Trump revealed during the Oval Office talks that he would have a call with Mr Putin later in the day. He broke up his talks with the Europeans to do so, before returning to update them on what they had discussed. A Kremlin official, Kirill Dmitriev, later hailed the talks as an \"important day for democracy\", but didn't comment on the issue of security guarantees or possible changes of territory. At the Alaska summit last Friday, Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine as a condition for ending the war. In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Read more: Putin's demands would be bitter blow to Ukraine Trump talks up possible land swaps Mr Trump is said to be planning to urge Mr Zelenskyy to agree to the conditions as part of a peace deal to end the war - despite the Ukrainian president previously ruling out handing any territory to Moscow. \"We also need to discuss the possible exchanges of territory,\" the US president said ahead of the multilateral talks with Mr Zelenskyy and European leaders. He said such exchanges would need to take \"into consideration the current line of contact\". He added: \"That means the war zone, the war lines that are now, pretty obvious, very sad, actually, to look at them and negotiating positions.\" What happens next? Mr Zelenskyy and Germany's Mr Merz both suggested a Zelenskyy-Putin summit could take place within two weeks. A location has not yet been determined. A meeting that includes Mr Trump would likely follow in the weeks after."
    },
    {
        "title": "Trump summit: Volodymyr Zelenskyy has learned his lesson from the last visit to the White House",
        "description": "Volodymyr Zelenskyy has learned his lesson from the last time he was in the Oval Office.",
        "url": "https://news.sky.com/story/trump-summit-volodymyr-zelenskyy-has-learned-his-lesson-from-the-last-visit-to-the-white-house-13414314",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-zelenskyy-trump_6994948.jpg?20250819002320",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-08-18 19:53:00",
        "Headline": "There was no repeat of the heated exchanges seen six months ago, after their disastrous meeting.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Volodymyr Zelenskyy has learned his lesson from the last time he was in the Oval Office. When the Ukrainian leader was at the White House in February, he didn't wear a suit and was berated by Donald Trump and JD Vance over alleged disrespect. Trump-Zelenskyy latest: NATO-style security guarantees Zelenskyy's learned from that moment six months ago and he's taken on board what other European and world leaders have done with these Oval Office moments - that the best policy is to say as little as possible.  Such was the contrast that the right-wing reporter Brian Glenn, who questioned Zelenskyy over not wearing a suit in February, told the Ukrainian leader: \"You look fabulous in that suit.\" The best tactic for dealing with Trump in front of reporters is to not answer the question, don't rise to the bait. Get in there and out as soon and as quickly as you can. And this time, that is precisely what Zelenskyy did. \n                  Trump's meeting with Zelenskyy will be no repeat of Oval Office meltdown - here's why\n                 \n                  Donald Trump says Volodymyr Zelenskyy 'can end war with Russia if he wants to' - ahead of crucial White House meeting\n                 \n                  The stakes are high - and the unity of the alliance against Putin has never been so threatened\n                 Did Vance learn his lesson too? The vice president berated Zelenskyy last time but this time, while the US president's key advisers were there, JD Vance sat quietly to Trump's side, saying nothing altogether. It was a marked contrast from six months ago, but some sort of \"gulf between the two sides in terms of any peace deal\" continues. Read more from Sky News:'Ketamine Queen' admits drug chargePutin 'demands key regions of Ukraine' Melania's influence The influence of Melania Trump seems apparent again. The US first lady sent a letter to Vladimir Putin via Trump at the Alaska summit on Friday, calling for the war to end. And on Monday, Zelenskyy gave Trump a letter from his own wife for Melania."
    },
    {
        "title": "'Ketamine Queen' to plead guilty to supplying dose of drug that killed Matthew Perry",
        "description": "A woman who was charged with selling Friends star Matthew Parry the dose of the drug that killed him has agreed to plead guilty. ",
        "url": "https://news.sky.com/story/ketamine-queen-to-plead-guilty-to-supplying-dose-of-drug-that-killed-matthew-perry-13414322",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-jasveen-sangha_6658017.jpg?20240816125917",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-18 20:14:00",
        "Headline": "No subtitle found",
        "Content": "A woman who was charged with selling Friends star Matthew Parry the dose of the drug that killed him has agreed to plead guilty.  Jasveen Sangha, known as the \"Ketamine Queen\", is the fifth and final defendant to strike a plea deal with prosecutors, avoiding a trial that was set to take place in September. The 42-year-old agreed to plead guilty to five federal criminal charges, including providing the Ketamine that led to Perry's death, federal prosecutors said in a statement. Prosecutors had cast Sangha, a dual US and UK national, as a prolific drug dealer known to her customers as the \"Ketamine Queen\", often using the term in court documents and even including it in the official name of the case. She agreed to plead guilty to one count of maintaining a drug-involved premises, three counts of distribution of ketamine, and one count of distribution of ketamine resulting in death or serious bodily injury. Sangha will officially change her plea to guilty at an upcoming hearing, where sentencing will be scheduled, prosecutors said. She is facing up to 45 years in prison. Read more from Sky News: Man injured after tractor falls on to motorwayDrug dealer on e-bike who killed great-grandfather jailed Sangha and a doctor named Salvador Plasencia, who signed his own plea deal in June, had been the primary targets of the investigation. Three other defendants - Mark Chavez, who it was claimed bought the drug from Sangha, Kenneth Iwamasa, and Erik Flemin - agreed to plead guilty last year in exchange for their cooperation, which included statements implicating Sangha and Plasencia. Prosecutors allege Chavez funnelled ketamine to Plasencia, securing some of the drug from a wholesale distributor through a fraudulent prescription. In one instance, prosecutors allege that Plasencia \"charged Perry $2,000 (£1,500) a vial that cost Dr Chavez approximately $12 (£9)\". Perry died in his home in October 2023, aged 54, after getting ketamine from his regular doctor for treatment of depression, which is an increasingly common use for the surgical anaesthetic. The actor was taking ketamine six to eight times a day before he died, according to court documents."
    },
    {
        "title": "Key takeaways from White House talks between Trump, Zelenskyy and EU leaders",
        "description": "These are the key takeaways from the talks between US President Donald Trump, Ukrainian leader Volodymyr Zelenskyy and other European leaders, including Prime Minister Sir Keir Starmer.",
        "url": "https://news.sky.com/story/key-takeaways-from-white-house-talks-between-trump-zelenskyy-and-eu-leaders-13414380",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-trump-zelenskyy-ukraine_6994947.jpg?20250819000844",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-08-18 21:47:00",
        "Headline": "The meeting involved Donald Trump, Volodymyr Zelensky, PM Keir Starmer, France's Emmanuel Macron, Italy's Giorgia Meloni, Germany's Friedrich Merz, Finland's Alexander Stubb, NATO Secretary General Mark Rutte and Ursula von der Leyen, the president of the EU Commission.",
        "Content": " These are the key takeaways from the talks between US President Donald Trump, Ukrainian leader Volodymyr Zelenskyy and other European leaders, including Prime Minister Sir Keir Starmer. Security guarantees In an important step towards a deal, Mr Trump has promised that the US would be involved in providing security guarantees for Ukraine. The US leader said that there would be some form of security guarantees for Ukraine, but did not reveal whether this would involve US troops. Mr Trump said Mr Putin \"agreed that Russia would accept security guarantees for Ukraine\". He added: \"I think that the European nations are going to take a lot of the burden. We're going to help them, and we're going to make it very secure.\" His comments were welcomed by the European leaders, with Ursula von der Leyen, president of the European Commission, saying it was \"good to hear\" the nations were working on \"Article Five-like security guarantees\". NATO's Article Five is the principle that an attack on one member is considered an attack on all of them. \n                  Why does Putin want Ukraine's Donbas region?\n                 \n                  Trump's meeting with Zelenskyy will be no repeat of Oval Office meltdown - here's why\n                 \n                  Donald Trump says Volodymyr Zelenskyy 'can end war with Russia if he wants to' - ahead of crucial White House meeting\n                 \"When we speak about security guarantees, we speak about the whole security of the European continent,\" French President Emmanuel Macron said. He added that one guarantee he would want to come out of any deals is that Ukraine should be able to have a \"credible\" army for \"the years and decades to come\". No ceasefire needed for peace deal Mr Trump said there did not need to be a ceasefire in Ukraine, because a peace deal could be worked out while Ukraine and Russia are at war. \"I don't think you need a ceasefire. You know, if you look at the six deals that I settled this year, they were all at war, I didn't do any ceasefires,\" he said. \"I know that it might be good to have, but I can also understand, strategically, why one country or the other wouldn't want it. You have a ceasefire and they rebuild and rebuild and rebuild and maybe they don't want that.\" He said he liked the \"concept of a ceasefire\", because people would stop being killed, but \"we can work a deal where we're working on a peace deal while they're fighting\". But German Chancellor Friedrich Merz said \"we would all like to see a ceasefire\". He told the media in the White House: \"I can't imagine that the next meeting would take place without a ceasefire, so let's work on that and let's try to put pressure on Russia.\" Mr Trump later pushed back, saying he had not needed a ceasefire in ending any other wars, but he would welcome one if needed. The US leader said: \"So if we can do the ceasefire, great, and, if we don't do a ceasefire... many other points were given to us, many, many points were given to us, great points.\" Trilateral meeting The US president said that \"if everything works out well today\", there will be a trilateral meeting between himself, Mr Putin and Mr Zelenskyy. The latter said he was ready for such a meeting and Mr Trump confirmed that Mr Putin was as well. Mr Macron said that while a trilateral meeting is important, a \"quadrilateral\" summit would also need to take place after. It was not clear whether Mr Macron meant a meeting in which just France takes part, or whether he meant NATO, the EU, or the \"coalition of the willing\" should be the fourth member. At first, Mr Trump said he would call Mr Putin \"right after\" the White House meetings, but he ended up interrupting the talk with the European leaders to call his Russian counterpart in the middle of the meeting, according to an EU diplomat. 'Discuss exchanges of territory' \"We also need to discuss the possible exchanges of territory,\" the US president said ahead of the multilateral talks with Mr Zelenskyy and European leaders. He said such exchanges would need to take \"into consideration the current line of contact\". Mr Trump added: \"That means the war zone, the war lines that are now, pretty obvious, very sad, actually, to look at them and negotiating positions.\" This comes after Mr Putin has reportedly made demands to take control of the eastern Donetsk and Luhansk regions of Ukraine during the Alaska summit with Mr Trump as a condition for ending the war. Read more:Zelensky has learned his lesson from last timeTrump: Europeans 'to take burden' of security guarantees In exchange, Russia would give up other Ukrainian territories held by its troops, according to several news reports citing sources close to the matter. Russian troops currently occupy large parts of the two regions and, in September 2022, Moscow announced it was officially annexing them, alongside the Kherson and Zaporizhia regions, in a move rejected and condemned as illegal by the West. Mr Zelensky previously ruled out handing any territory to Moscow."
    },
    {
        "title": "There's one thing scarier than markets lurching around - and it's happening right now",
        "description": "There is one thing scarier than markets lurching around. And that's markets lurching around without a very compelling explanation.",
        "url": "https://news.sky.com/story/theres-one-thing-scarier-than-markets-lurching-around-and-its-happening-right-now-13414361",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-bond-yields-markets_6994928.jpg?20250818224848",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-08-18 21:09:00",
        "Headline": "In normal circumstances, with the Bank of England having just cut interest rates, you would expect measures of borrowing costs to be falling across the board. But clearly these are not normal times.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n There is one thing scarier than markets lurching around. And that's markets lurching around without a very compelling explanation. Just yesterday, the yield on the government's 30-year bonds - the best measure out there of the UK government's long-term cost of borrowing - closed at the highest level since 1998, not long after Oasis released the album Be Here Now. Indeed, the yields on pretty much all UK government debt has been creeping up in recent weeks, though not all are back to Britpop era levels. Follow the latest in the Money blog In some senses, this looks very odd indeed. After all, the Bank of England just cut interest rates. In normal circumstances, you would expect measures of borrowing costs to be falling across the board. But clearly these are not normal times.  All of which raises the question: is this a UK-specific phenomenon? Are markets singling out Britain for particular concern, much as they did after Liz Truss's notorious mini-budget? Actually, there are more questions on top of that one. For instance, is this all about Rachel Reeves's recent woes, and her need to find another £20bn, give or take, to make her sums add up? Are investors fretting about the Bank of England's inflation-fighting credibility, given its cutting rates even as prices rise? The short answer, I'm afraid, is that no one really knows. But a glance at a few metrics can at least provide a bit of context. The first thing to note is that while government borrowing costs in the UK are up, they have also been rising in other leading economies. The UK, it's worth saying, is a bit of an outlier with higher yields than in fellow G7 nations. But that's not exactly a new thing: it's been the case since the mini-budget. But the UK is a particularly ugly duckling in a lake full of them.  Indeed, look at other nations, and you see that Britain's budgetary challenges are hardly unique. The US and France have ballooning budget deficits which are rising rapidly. Most European nations have pledged enormous increases in military spending to satisfy Donald Trump's demands of NATO. And over the Atlantic, the US administration has just committed to a sweeping set of generous fiscal measures, under its One Big Beautiful Bill Act. Even Elon Musk has voiced concerns about what this means for the deficit (which is set to continue rising ad infinitum, at least on paper). Read more from Sky News:Customers could join water boardsPub closures 'heartbreaking' trendBlackRock backs Gupta's steel ambition All of which brings us to the broader, possibly scarier, lesson. There are signs afoot that while G7 nations could depend for decades on other surplus countries - most notably China and other Asian countries - buying vast amounts of their debt in recent years, that might no longer be the case. In short, even as rich countries borrow like crazy, it's becoming less clear who will lend them the money. That's an enormous conundrum, and not good news for anyone."
    },
    {
        "title": "Redundancies begin at UK's largest bioethanol plant after government rejects bailout",
        "description": "Redundancies are to begin on Tuesday at the UK's largest bioethanol plant, which is to close after the government refused to offer the owners a bailout.",
        "url": "https://news.sky.com/story/redundancies-begin-at-uks-largest-bioethanol-plant-after-government-rejects-bailout-13414125",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-vivergo-fuels-bioethanol_6994568.jpg?20250818155453",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-18 13:52:00",
        "Headline": "Vivergo has begun an orderly wind-down of the business, which is set to close at the end of the year.",
        "Content": "Redundancies are to begin on Tuesday at the UK's largest bioethanol plant, which is to close after the government refused to offer the owners a bailout. Around 60 staff, just over a third of the total, are to receive redundancy letters on Tuesday and leave the site. The remaining workers will go in phases over the coming months, as part of an orderly wind-down of the business. On Friday, owners Vivergo Fuels, a subsidiary of Associated British Foods (ABF), said the government's decision not to offer financial support to the facility in Lincolnshire was \"deeply regrettable\" and blamed the UK's trade deal with the United States. The plant converts wheat into bioethanol, a component of petrol used to reduce carbon emissions. The facility was already losing £3m a month, partly due to high energy prices. But now the company has also been left competing with cheaper imports after the 19% tariff on American bioethanol was scrapped following the recent UK-US trade deal. Vivergo described the government's decision not to offer financial support as \"a flagrant act of economic self-harm that will have far-reaching consequences\", pushing the sector \"to the point of collapse\". The company added that the closure would be a \"massive blow\" to the local area and supply chain. More than 160 staff at the site, who were consulted about a potential wind-down process in June, will have left by the end of the year, when the plant will be ready for demolition. The factory is also the UK's largest single production site for animal feed, a byproduct of the production process for ethanol. The NFU farming union described the imminent closure as \"terrible news\" for workers who will lose their jobs, but also \"thousands of people whose livelihoods depend on this supply chain\". Read more from Sky News:Pub closures are 'heartbreaking' trendBlackRock backs Gupta's steel empire The company, near Hull, warned earlier this year that it was in financial trouble as crisis talks continued with the government. In a statement, the government said it made the \"difficult decision not to offer direct funding as it would not provide value for the taxpayer or solve the long-term problems the industry faces\". But Unite general secretary Sharon Graham called the government's decision \"short-sighted\" while the GMB union's Charlotte Brumpton-Childs blamed \"the impact of tariffs and trade deals\" for \"working people losing their livelihoods\"."
    },
    {
        "title": "Consumers could get new roles in effort to rebuild trust in water companies",
        "description": "Consumers could be allowed to attend water company board meetings under new rules proposed by the regulator.",
        "url": "https://news.sky.com/story/consumers-could-get-new-roles-in-effort-to-rebuild-trust-and-transparency-in-water-companies-13414021",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-blog-water-company_6955550.jpg?20250702161729",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-18 10:45:00",
        "Headline": "The public has been outraged by record sewage outflows and polluted waterways at a time when senior executives are receiving bonuses and bills are rising.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Consumers could be allowed to attend water company board meetings under new rules proposed by the regulator. Companies may survey and research customers to understand their views, involve them in decision-making and seek feedback on consumers' experience. Under the suggested reforms by regulator Ofwat, customer voices could be heard by making changes to a company's governing body, the board of directors. Money latest: Michelin-guide restaurant launches water menu The obligation to hear billpayers' views could be met by boards allocating time for consumer matters, arranging for consumer experts to attend, holding open board meetings for the public, or by having an independent director with a consumer focus. Boards could also comply by arranging for independent consumer experts, such as the Consumer Council for Water (CCW), to regularly attend. Topics that consumers will have to be consulted on include the cost of bills, performance of key water services, support when things go wrong - like water outages - and the company's investment priorities. \n                  Thames Water crisis: Ministers line up administrator for utility giant\n                 \n                  Does water's 'Great Stink' moment pass the sniff test? \n                 \n                  Thames Water turnaround will take 'at least a decade', boss warns\n                 When decisions likely to materially impact consumers are made, the water company needs to have clear processes to ensure consumers are involved, Ofwat said.  As well as including water users in decision-making, utilities will have to work to understand how decisions impact consumers so those views are taken into account in future decisions. Seeking this feedback must involve engaging with the new consumer panels being developed by the CCW to hold companies to account, Ofwat's rules outline. Why's this being done? It's all part of the government's aim to rebuild trust in the water sector and to improve accountability, transparency and performance in water firms. The public has been outraged by record sewage outflows and polluted waterways at a time when senior executives are receiving bonuses and bills are rising. New powers were granted to regulator Ofwat to clean up the sector, and rules on pay and bonuses were developed and took effect in June. They've already been used to claw back bonuses. What next? Stakeholders have until 1 October to respond to the consultation, with Ofwat intending the rules take effect on existing water utilities in April. Consultations already took place to make the suggested rules with 11,000 responses received from businesses, groups and individuals. Not all of the replies made their way into the rules. The idea of having MPs and local authorities involved in decision-making, received from \"several respondents\", appears not to have been included. It comes despite the recent announcement of Ofwat being scrapped, as part of a once-in-a-generation review of the sector. It and the other regulators are to be replaced by one single body. Ofwat said it was working until new arrangements were in place and continuing to implement rules on remuneration and governance. How's it been received? Environmental charity River Action said to rebuild trust in the industry, the government \"needs to go a lot further than tinkering around the edges\". \"We need a complete overhaul of how water companies are owned, financed and governed. That means ending privatisation and instead operating for public benefit,\" chief executive James Wallace said. Industry group Water UK said: \"It is important customers are involved in water companies' decision-making. \"We will continue to work with government on these proposed rules and other vital reforms to secure our water supplies, support economic growth and end sewage entering our rivers and seas.\""
    },
    {
        "title": "More than 200 pub closures in six months in 'heartbreaking' trend, figures show",
        "description": "More than 200 UK pubs closed in the first half of the year as part of a \"heartbreaking\" trend which industry bosses fear is set to accelerate.",
        "url": "https://news.sky.com/story/more-than-200-pub-closures-in-six-months-in-heartbreaking-trend-figures-show-13414000",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pub-closures-generic_6994472.jpg?20250818133859",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-18 09:46:00",
        "Headline": "Eight pubs are closing in the UK every week amid fears the trend will accelerate as the industry struggles to cope with rising costs and taxes.",
        "Content": "More than 200 UK pubs closed in the first half of the year as part of a \"heartbreaking\" trend which industry bosses fear is set to accelerate. Analysis of government figures revealed 209 pubs were demolished or converted for other uses over the opening six months of 2025 - around eight every week. The South East was hit the hardest, losing 31 pubs during the period. It means 2,283 pubs have vanished from communities across England and Wales since the start of 2020. Industry bosses said the \"really sad pattern\" is being driven by the high costs faced by pubs - and called for government reforms to business rates and beer duty. Many pubs have been hit by changes to discounts on business rates, the property tax affecting high street businesses. Hospitality businesses received a 60% discount on their business rates up to a cap of £110,000 - but this was cut to only 25% in April.  Pub owners had warned such a move would place significant pressure on their industry. Last month, the owner of a pub told Sky News \"you can't make money anymore\" and \"it's not surprising so many pubs are closing at an alarming rate\". 'Staying open becomes impossible' A rise in the national minimum wage and national insurance payments have also increased bills for pubs. Alex Probyn, of commercial real estate specialists Ryan, which analysed the government data, said the higher costs are \"all quietly draining profits until staying open becomes impossible\". He added: \"Slashing business rates relief for pubs from 75% to 40% this year has landed the sector with an extra £215m in tax bills. \"For a small pub, that's a leap in the average bill from £3,938 to £9,451 - a 140% increase.\" Read more from Sky News:Sharp rise in disabled people facing homelessness Nearly 2,000 soldiers fighting Spain fires  'A lot of these pubs never come back' Emma McClarkin, chief executive of the British Beer And Pub Association, said: \"It's absolutely heartbreaking and there is a direct link between pubs closing for good and the huge jump in costs they have just endured. \"Pubs and brewers are important employers, drivers of economic growth, but are also really valuable to local communities across the country and have real social value. \"This is a really sad pattern, and unfortunately a lot of these pubs never come back. \"The government needs to act at the budget, with major reforms to business rates and beer duty.\""
    },
    {
        "title": "Soho House returning to private ownership - and picks up a celebrity investor ",
        "description": "Soho House, the global network of private members' clubs, is being bought by a group led by hotel owners MCR - valuing the business at $2.7bn (&#163;1.99bn). ",
        "url": "https://news.sky.com/story/soho-house-returning-to-private-ownership-and-picks-up-a-celebrity-investor-13414071",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-soho-house-club_6994509.jpg?20250818143654",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-18 12:04:00",
        "Headline": "It was founded in London in 1995 by restaurateur Nick Jones as a meeting place for creative people. The brand has since gone global - and is known for stylish interiors and exclusivity.",
        "Content": "Soho House, the global network of private members' clubs, is being bought by a group led by hotel owners MCR - valuing the business at $2.7bn (£1.99bn).  The deal will take the London-based hospitality group back into private ownership, meaning it will no longer be listed on the New York Stock Exchange. Actor-turned-investor Ashton Kutcher will lead a consortium providing new funding to the business - and will join Soho House's board of directors once the transaction is complete. Money latest: Michelin restaurant launches water menu MCR is the third-largest hotel owner-operator in the US and owner of the BT Tower in London. But current shareholders - billionaire executive chairman Ron Burkle and his private equity company Yucaipa - will retain their majority controlling stakes, as will founder Nick Jones. Private equity firms acquire businesses, invest to improve financial performance, and seek to then sell them for a profit. \n                  Ashton Kutcher resigns from anti-child sex abuse organisation after backlash over Danny Masterson letter\n                 \n                  Ashton Kutcher and Mila Kunis post California beach house on Airbnb offering 'unforgettable summer stay'\n                 \n                  Ashton Kutcher 'lucky to be alive' after rare vasculitis disease affected his ability to see, hear and walk\n                 Holders of common stock of the company will receive $9 cash per share, far above the closing price on Friday afternoon. Soho House's share price rose 16% in pre-market trading to $8.86. It was founded in London in 1995 by Mr Jones, a restaurateur, as a meeting place for creative people. The club developed operations in Europe, North America and Asia and is known for stylish interiors and exclusivity. Despite only going public in 2021 the company appointed a committee to explore taking the company private as it struggled to turn a profit. An offer had been received in December."
    },
    {
        "title": "BlackRock backs Gupta's bid to retain grip on UK steel empire",
        "description": "BlackRock, the world's biggest asset manager, is backing a controversial bid by the metals tycoon Sanjeev Gupta to retain control of his faltering UK steel empire.",
        "url": "https://news.sky.com/story/blackrock-backs-guptas-bid-to-retain-grip-on-uk-steel-empire-13414079",
        "image_url": "https://e3.365dm.com/21/03/1920x1080/skynews-sanjeev-gupta-liberty-steel_5298847.jpg?20210309165518",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-18 12:14:00",
        "Headline": "The world's biggest asset manager has provided a financing support letter to the controversial owner of Britain's third-biggest steel producer, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n BlackRock, the world's biggest asset manager, is backing a controversial bid by the metals tycoon Sanjeev Gupta to retain control of his faltering UK steel empire. Sky News has learnt that executives at BlackRock have authorised the issuance of a financing support letter which could enable Mr Gupta to continue to exert a grip on Liberty Steel's Speciality Steels UK (SSUK) arm - which employs nearly 1,500 people in South Yorkshire. Money latest: Michelin-guide restaurant launches water menu - with bottles costing up to £19 People close to the situation said on Monday that private capital funds managed by BlackRock had expressed a willingness to provide tens of millions of pounds to Liberty Steel UK. One source suggested the figure could be as high as £75m. Sky News revealed at the weekend that Mr Gupta was lining up a so-called connected pre-pack administration of SSUK that would result in it ridding itself of hundreds of millions of pounds of tax and other liabilities. BlackRock, which declined to comment, is already understood to have provided funds to Liberty Steel in the US and Australia. \n                  There's one thing scarier than markets lurching around - and it's happening right now\n                 \n                  Redundancies begin at UK's largest bioethanol plant after government rejects bailout\n                 \n                  Consumers could get new roles in effort to rebuild trust in water companies\n                 Mr Gupta is racing to finalise a deal ahead of a winding-up petition hearing scheduled for Wednesday which could result in the compulsory liquidation of SSUK. One source close to the tycoon expressed a belief that the hearing would be adjourned, as it had been in May and July. Begbies Traynor, the accountancy firm, is working on efforts to progress the pre-pack deal. Whitehall sources said at the weekend that government officials had stepped up planning for the collapse of SSUK if the winding-up petition is approved. If that were to happen, SSUK would enter compulsory liquidation within days, with a special manager appointed by the Official Receiver to run the operations. Mr Gupta's UK business operates steel plants at Sheffield and Rotherham in South Yorkshire, with a combined workforce of more than 1,400 people. A connected pre-pack risks stiff opposition from Liberty Steel's creditors, which include HM Revenue and Customs. UBS, the investment bank which rescued Credit Suisse, a major backer of the collapsed finance firm Greensill Capital - which itself had a multibillion dollar exposure to Liberty Steel's parent, GFG Alliance - is also a creditor of the company. Grant Thornton, the accountancy firm handling Greensill's administration, is also watching the legal proceedings with interest. A Liberty Steel spokesperson said at the weekend: \"Discussions are ongoing to finalise options for SSUK. \"We remain committed to identifying a solution that preserves electric arc furnace steelmaking in the UK--a critical national capability supporting strategic supply chains. \"We continue to work towards an outcome that best serves the interests of creditors, employees, and the broader community.\" Last month, The Guardian reported that Jonathan Reynolds, the business secretary, was monitoring events at Liberty Steel's SSUK arm, and had not ruled out stepping in to provide support to the company. Such a move is still thought to be an option, although it is not said to be imminent. The Department for Business and Trade said: \"We continue to closely monitor developments around Liberty Steel, including any public hearings, which are a matter for the company. Other parts of Mr Gupta's empire have been showing signs of financial stress for years. Mr Gupta is said to have explored whether he could persuade the government to step in and support SSUK using the legislation enacted to take control of British Steel's operations. Whitehall insiders told Sky News in May that Mr Gupta's overtures had been rebuffed. He had previously sought government aid during the pandemic but that plea was also rejected by ministers. SSUK, which also operates from a site in Bolton, Lancashire, makes highly engineered steel products for use in sectors such as aerospace, automotive and oil and gas. The company said earlier this year that it had invested nearly £200m in the last five years into the UK steel industry, but had faced \"significant challenges due to soaring energy costs and an over-reliance on cheap imports, negatively impacting the performance of all UK steel companies\". Liberty Steel declined to comment on BlackRock's support."
    },
    {
        "title": "Swatch apologises for 'slanted eye' ad after backlash",
        "description": "Watchmaker Swatch has apologised and pulled ads featuring an Asian male model pulling the corners of his eyes backwards following accusations of racism.",
        "url": "https://news.sky.com/story/swatch-apologises-for-slanted-eye-ad-after-backlash-13414010",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-swatch-china_6994330.jpg?20250818111438",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-08-18 10:02:00",
        "Headline": "Images for the Swatch Essentials collection were criticised for the \"slanted eye\" pose, especially in China, with many commentators saying they appeared to mimic racist taunts.",
        "Content": "Watchmaker Swatch has apologised and pulled ads featuring an Asian male model pulling the corners of his eyes backwards following accusations of racism. Images for the Swatch Essentials collection were criticised for the \"slanted eye\" pose, especially in China, with many commentators saying they appeared to mimic racist taunts. The Swiss company has apologised in both English and Chinese on the social media platforms Weibo and Instagram - saying it had \"taken note of the recent concerns\" and removed all related materials worldwide. \"We sincerely apologise for any distress or misunderstanding this may have caused,\" it said. Shares in the company fell by as much as 2.7% in early trading on Monday. Read more:Jimmy Lai's son says father will 'most likely die in jail' unless UK govt intervenesNew words added to dictionary: Are you down with the kids? It is the latest setback for the company, whose shares have dropped by more than half since early 2023 and now faces a 39% tariff on its exports to the US. Swatch - which also makes Omega, Longines and Tissot watches - relied on China, Hong Kong and Macau for about 27% of its sales last year. The company's revenue fell 14.6% to 6.74 billion Swiss francs (£6.2bn) in 2024 after a drop in demand in China. Swatch blamed this on \"persistently difficult market conditions and weak demand for consumer goods overall\"."
    },
    {
        "title": "Guardian-backed research firm Streetbees on brink of collapse",
        "description": "An AI-powered market research firm which has counted Unilever and Vodafone among its clients is on the brink of collapse.",
        "url": "https://news.sky.com/story/guardian-backed-research-firm-streetbees-on-brink-of-collapse-13414012",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-streetbees-ap-google-play_6994331.jpg?20250818112109",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-08-18 10:12:00",
        "Headline": "Streetbees, which took funding from The Guardian's venture capital arm and other blue-chip investors, has filed a notice of intention to appoint FRP as administrator, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n An AI-powered market research firm which has counted Unilever and Vodafone among its clients is on the brink of collapse. Sky News understands that Streetbees, which was founded in 2015, has filed a notice of intention to appoint the professional services firm FRP Advisory as administrator. Sources said that a buyer was being lined up to take control of the business in the coming days. Streetbees' impending collapse follows efforts to find a solvent buyer - in a process also run by FRP - over the last couple of months. Staff are understood to have been briefed on the insolvency filing late last week. Streetbees, which has also worked with Heineken, Ferrero and Avon, has raised tens of millions of pounds in funding from blue-chip backers. It raised a $40m Series B funding round from investors including Lakestar, LocalGlobe and GMG Ventures - the early-stage investment arm of Guardian Media Group - in 2020. \n                  There's one thing scarier than markets lurching around - and it's happening right now\n                 \n                  Redundancies begin at UK's largest bioethanol plant after government rejects bailout\n                 \n                  Consumers could get new roles in effort to rebuild trust in water companies\n                 GMG Ventures has since rebranded as Mercuri. A spokesperson for Streetbees said: \"Streetbees has engaged advisors to oversee a process aiming to secure investment or sell the business and its assets. \"We have filed a notice of intention to appoint administrators, as a protective measure, to provide the time necessary to progress discussions that are at an advanced stage. \"We will not comment further on any market speculation.\""
    },
    {
        "title": "TikTok and Instagram accused of targeting teens with suicide and self-harm content",
        "description": "TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago.",
        "url": "https://news.sky.com/story/tiktok-and-instagram-accused-of-targeting-teens-with-suicide-and-self-harm-content-13414289",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-molly-russell-instagram-suicide_5914739.jpg?20250818203938",
        "type": "Politics",
        "Author": "Tamara Cohen",
        "Date Published": "2025-08-18 18:50:00",
        "Headline": "The findings were made in advance of new regulation coming into force as part of the Online Safety Act, which the government says will protect children online.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago. The Molly Rose Foundation - set up by Ian Russell after his 14-year-old daughter took her own life after viewing harmful content on social media - commissioned analysis of hundreds of posts on the platforms, using accounts of a 15-year-old girl based in the UK. Politics Hub: Follow latest updates The charity claimed videos recommended by algorithms on the For You pages continued to feature a \"tsunami\" of clips containing \"suicide, self-harm and intense depression\" to under-16s who have previously engaged with similar material. One in 10 of the harmful posts had been liked at least a million times. The average number of likes was 226,000, the researchers said. Mr Russell told Sky News the results were \"horrifying\" and showed online safety laws are not fit for purpose. 'This is happening on PM's watch' He said: \"It is staggering that eight years after Molly's death, incredibly harmful suicide, self-harm, and depression content like she saw is still pervasive across social media. \"Ofcom's recent child safety codes do not match the sheer scale of harm being suggested to vulnerable users and ultimately do little to prevent more deaths like Molly's. \"The situation has got worse rather than better, despite the actions of governments and regulators and people like me. The report shows that if you strayed into the rabbit hole of harmful suicide self-injury content, it's almost inescapable. \"For over a year, this entirely preventable harm has been happening on the prime minister's watch and where Ofcom have been timid it is time for him to be strong and bring forward strengthened, life-saving legislation without delay.\" After Molly's death in 2017, a coroner ruled she had been suffering from depression, and the material she had viewed online contributed to her death \"in a more than minimal way\". Researchers at Bright Data looked at 300 Instagram Reels and 242 TikToks to determine if they \"promoted and glorified suicide and self-harm\", referenced ideation or methods, or \"themes of intense hopelessness, misery, and despair\". They were gathered between November 2024 and March 2025, before new children's codes for tech companies under the Online Safety Act came into force in July.  Instagram The Molly Rose Foundation claimed Instagram \"continues to algorithmically recommend appallingly high volumes of harmful material\". The researchers said 97% of the videos recommended on Instagram Reels for the account of a teenage girl, who had previously looked at this content, were judged to be harmful. Some 44% actively referenced suicide and self-harm, they said. They also claimed harmful content was sent in emails containing recommended content for users. A spokesperson for Meta, which owns Instagram, said: \"We disagree with the assertions of this report and the limited methodology behind it. \"Tens of millions of teens are now in Instagram Teen Accounts, which offer built-in protections that limit who can contact them, the content they see, and the time they spend on Instagram. \"We continue to use automated technology to remove content encouraging suicide and self-injury, with 99% proactively actioned before being reported to us. We developed Teen Accounts to help protect teens online and continue to work tirelessly to do just that.\" TikTok TikTok was accused of recommending \"an almost uninterrupted supply of harmful material\", with 96% of the videos judged to be harmful, the report said. Over half (55%) of the For You posts were found to be suicide and self-harm related; a single search yielding posts promoting suicide behaviours, dangerous stunts and challenges, it was claimed. The number of problematic hashtags had increased since 2023; with many shared on highly-followed accounts which compiled 'playlists' of harmful content, the report alleged. A TikTok spokesperson said: \"Teen accounts on TikTok have 50+ features and settings designed to help them safely express themselves, discover and learn, and parents can further customise 20+ content and privacy settings through Family Pairing. \"With over 99% of violative content proactively removed by TikTok, the findings don't reflect the real experience of people on our platform which the report admits.\" According to TikTok, they not do not allow content showing or promoting suicide and self-harm, and say that banned hashtags lead users to support helplines. Read more:Backlash against new online safety rulesMusk's X wants 'significant' changes to OSA  'A brutal reality' Both platforms allow young users to provide negative feedback on harmful content recommended to them. But the researchers found they can also provide positive feedback on this content and be sent it for the next 30 days. Technology Secretary Peter Kyle said: \"These figures show a brutal reality - for far too long, tech companies have stood by as the internet fed vile content to children, devastating young lives and even tearing some families to pieces. \"But companies can no longer pretend not to see. The Online Safety Act, which came into effect earlier this year, requires platforms to protect all users from illegal content and children from the most harmful content, like promoting or encouraging suicide and self-harm. 45 sites are already under investigation.\" An Ofcom spokesperson said: \"Since this research was carried out, our new measures to protect children online have come into force. \"These will make a meaningful difference to children - helping to prevent exposure to the most harmful content, including suicide and self-harm material. And for the first time, services will be required by law to tame toxic algorithms. \"Tech firms that don't comply with the protection measures set out in our codes can expect enforcement action.\" 'A snapshot of rock bottom' A separate report out today from the Children's Commissioner found the proportion of children who have seen pornography online has risen in the past two years - also driven by algorithms. Rachel de Souza described the content young people are seeing as \"violent, extreme and degrading\", and often illegal, and said her office's findings must be seen as a \"snapshot of what rock bottom looks like\". More than half (58%) of respondents to the survey said that, as children, they had seen pornography involving strangulation, while 44% reported seeing a depiction of rape - specifically someone who was asleep. The survey of 1,020 people aged between 16 and 21 found that they were on average aged 13 when they first saw pornography. More than a quarter (27%) said they were 11, and some reported being six or younger. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK. "
    },
    {
        "title": "Will Labour get better marks on education next term?",
        "description": " <a href=' https://podfollow.com/politics-at-sam-and-annes'>👉Listen to Politics at Sam and Anne's on your podcast app👈</a>&#8239;&#8239;&#8239;&#8239;&#8239;&#8239;&#8239; ",
        "url": "https://news.sky.com/story/will-labour-get-better-marks-on-education-next-term-13412209",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-pasaa-podcast_6987939.jpg?20250811102744",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-18 06:00:00",
        "Headline": "No subtitle found",
        "Content": " 👉Listen to Politics at Sam and Anne's on your podcast app👈         \"Education, education, education\" was how Tony Blair set out New Labour's priorities in the early noughties. A quarter of a century on, what story is Sir Keir Starmer trying to tell about schools under his premiership? In this episode, Sam and Anne are joined by Laura McInerney, a former teacher and co-founder of Teacher Tapp, to break down the government's plan for education as we head into a new school year. They ask: • What will be included in the education white paper?• Can there be further devolution within the education system?• Will Bridget Phillipson remain as education secretary? Sam and Anne are getting a lie-in over summer recess, but they'll be in your feed with special episodes every Monday before normal services resumes on 1 September."
    },
    {
        "title": "Scotland, Wales and N Ireland party leaders unite to criticise Starmer over Israel-Gaza stance",
        "description": "Party leaders in the UK's devolved nations have called on Sir Keir Starmer to impose immediate sanctions on Israel and said waiting until September to recognise a Palestinian state is \"far too late\".",
        "url": "https://news.sky.com/story/scotland-wales-and-n-ireland-party-leaders-unite-to-criticise-starmer-over-israel-gaza-stance-13414087",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-gaza-famine-malnutrition_6992568.jpg?20250816134431",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-08-18 12:39:00",
        "Headline": "In an unusual unified stance, the politicians said they had \"deep concern and opposition to your government's ongoing support for the actions of the Israeli government in Gaza\".",
        "Content": "Party leaders in the UK's devolved nations have called on Sir Keir Starmer to impose immediate sanctions on Israel and said waiting until September to recognise a Palestinian state is \"far too late\". The leaders and senior politicians from parties in Northern Ireland, Scotland and Wales said they are \"united in our deep concern and opposition to your government's ongoing support for the actions of the Israeli government in Gaza\". In a letter sent to Sir Keir on Monday, they urged him to recall parliament so MPs could vote to impose \"immediate sanctions\" on Israel and to \"immediately end all arms sales\" to the country. Politics latest: Stephen Kinnock's message to dad over wealth tax demands Claire Hanna, SDLP leader, Sinn Fein's vice president Michelle O'Neill, Stephen Flynn, the SNP's Westminster leader and Rhun ap Iorwerth, Plaid Cymru's leader in Wales, are among the politicians to have signed the letter, in an unusual joint agreement. They also called on the PM to support a ceasefire and \"meaningful diplomatic intervention\" to protect civilians and secure a just, lasting peace, and to back an independent, international investigation into alleged war crimes, genocide and crimes against humanity in Gaza. The group of leaders urged him to use the UK's diplomatic influence to press for the \"unimpeded\" delivery of food, water, medicine and humanitarian aid to the people of Gaza. \n                  Hamas may have agreed to a ceasefire - but is Netanyahu ready to negotiate?\n                 \n                  Hamas 'agrees to ceasefire deal' with hostage-prisoner exchange, say officials\n                 \n                  'Not in our name': Israelis protest against Gaza war - but Netanyahu seems unmoved\n                 They called Hamas' killing of about 1,200 people in Israel and taking more than 250 hostages on 7 October 2023 \"indefensible\" and said they support all \"legitimate diplomatic\" efforts to secure their safe and unconditional return. However, they criticised Sir Keir for saying his government will recognise Palestine as a state in September, unless Israel takes \"substantive steps to end the appalling situation in Gaza\". \"Given the urgency of the crisis, this is far too late,\" they wrote. \"Every day of delay means more children starve, more families are torn apart, and more lives are lost. \"You must act now. The UK cannot be complicit in prolonging this tragedy.\" A spokesperson for the Foreign Office said: \"Since day one, this Government has been clear that we need to see an immediate ceasefire, the release of all hostages cruelly detained by Hamas, better protection of civilians, significantly more aid consistently entering Gaza, and a path to long-term peace and stability. \"We are working with partners to ensure there is a framework in place for what comes next in Gaza, and to turn a ceasefire into lasting security and peace for both Palestinians and Israelis. \"The framework is centred on creating the conditions for a lasting peace in Gaza, as the basis for a wider process to find a long-term political solution in the Middle East.\" The group of leaders said as a signatory to the Genocide Convention, the UK has a binding obligation to prevent acts that may amount to genocide and ensure accountability. They warned that continued \"political, diplomatic and military support\" to a government accused of committing such acts risks placing the UK in breach of its international legal duties. The politicians \"unequivocally\" condemned the recent killing of Al Jazeera journalists in Gaza. They also criticised the government's attempts to \"restrict, criminalise or delegitimise\" peaceful protest against government policy in Gaza, after hundreds of people supporting the recently proscribed group Palestine Action were arrested earlier in August.  Other signatories of the letter are: Matthew O'Toole, SDLP opposition leader in the NI AssemblyNaomi Long, Northern Ireland's Alliance Party leaderGerry Carroll, Northern Ireland's People Before Profit party leaderStuart McMillan, convener of the Holyrood SNP GroupLorna Slater, co-leader of the Scottish GreensAlistair Carmichael, Scottish Lib DemsChristine Jardine, Scottish Lib Dems"
    },
    {
        "title": "Consumers could get new roles in effort to rebuild trust in water companies",
        "description": "Consumers could be allowed to attend water company board meetings under new rules proposed by the regulator.",
        "url": "https://news.sky.com/story/consumers-could-get-new-roles-in-effort-to-rebuild-trust-and-transparency-in-water-companies-13414021",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-blog-water-company_6955550.jpg?20250702161729",
        "type": "Politics",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-08-18 10:45:00",
        "Headline": "The public has been outraged by record sewage outflows and polluted waterways at a time when senior executives are receiving bonuses and bills are rising.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n Consumers could be allowed to attend water company board meetings under new rules proposed by the regulator. Companies may survey and research customers to understand their views, involve them in decision-making and seek feedback on consumers' experience. Under the suggested reforms by regulator Ofwat, customer voices could be heard by making changes to a company's governing body, the board of directors. Money latest: Michelin-guide restaurant launches water menu The obligation to hear billpayers' views could be met by boards allocating time for consumer matters, arranging for consumer experts to attend, holding open board meetings for the public, or by having an independent director with a consumer focus. Boards could also comply by arranging for independent consumer experts, such as the Consumer Council for Water (CCW), to regularly attend. Topics that consumers will have to be consulted on include the cost of bills, performance of key water services, support when things go wrong - like water outages - and the company's investment priorities. \n                  Thames Water crisis: Ministers line up administrator for utility giant\n                 \n                  Does water's 'Great Stink' moment pass the sniff test? \n                 \n                  Thames Water turnaround will take 'at least a decade', boss warns\n                 When decisions likely to materially impact consumers are made, the water company needs to have clear processes to ensure consumers are involved, Ofwat said.  As well as including water users in decision-making, utilities will have to work to understand how decisions impact consumers so those views are taken into account in future decisions. Seeking this feedback must involve engaging with the new consumer panels being developed by the CCW to hold companies to account, Ofwat's rules outline. Why's this being done? It's all part of the government's aim to rebuild trust in the water sector and to improve accountability, transparency and performance in water firms. The public has been outraged by record sewage outflows and polluted waterways at a time when senior executives are receiving bonuses and bills are rising. New powers were granted to regulator Ofwat to clean up the sector, and rules on pay and bonuses were developed and took effect in June. They've already been used to claw back bonuses. What next? Stakeholders have until 1 October to respond to the consultation, with Ofwat intending the rules take effect on existing water utilities in April. Consultations already took place to make the suggested rules with 11,000 responses received from businesses, groups and individuals. Not all of the replies made their way into the rules. The idea of having MPs and local authorities involved in decision-making, received from \"several respondents\", appears not to have been included. It comes despite the recent announcement of Ofwat being scrapped, as part of a once-in-a-generation review of the sector. It and the other regulators are to be replaced by one single body. Ofwat said it was working until new arrangements were in place and continuing to implement rules on remuneration and governance. How's it been received? Environmental charity River Action said to rebuild trust in the industry, the government \"needs to go a lot further than tinkering around the edges\". \"We need a complete overhaul of how water companies are owned, financed and governed. That means ending privatisation and instead operating for public benefit,\" chief executive James Wallace said. Industry group Water UK said: \"It is important customers are involved in water companies' decision-making. \"We will continue to work with government on these proposed rules and other vital reforms to secure our water supplies, support economic growth and end sewage entering our rivers and seas.\""
    },
    {
        "title": "TikTok and Instagram accused of targeting teens with suicide and self-harm content",
        "description": "TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago.",
        "url": "https://news.sky.com/story/tiktok-and-instagram-accused-of-targeting-teens-with-suicide-and-self-harm-content-13414289",
        "image_url": "https://e3.365dm.com/22/09/1920x1080/skynews-molly-russell-instagram-suicide_5914739.jpg?20250818203938",
        "type": "Technology",
        "Author": "Tamara Cohen",
        "Date Published": "2025-08-18 18:50:00",
        "Headline": "The findings were made in advance of new regulation coming into force as part of the Online Safety Act, which the government says will protect children online.",
        "Content": "\n          Political correspondent\n              @tamcohen\n  TikTok and Instagram have been accused of targeting teenagers with suicide and self-harm content - at a higher rate than two years ago. The Molly Rose Foundation - set up by Ian Russell after his 14-year-old daughter took her own life after viewing harmful content on social media - commissioned analysis of hundreds of posts on the platforms, using accounts of a 15-year-old girl based in the UK. Politics Hub: Follow latest updates The charity claimed videos recommended by algorithms on the For You pages continued to feature a \"tsunami\" of clips containing \"suicide, self-harm and intense depression\" to under-16s who have previously engaged with similar material. One in 10 of the harmful posts had been liked at least a million times. The average number of likes was 226,000, the researchers said. Mr Russell told Sky News the results were \"horrifying\" and showed online safety laws are not fit for purpose. 'This is happening on PM's watch' He said: \"It is staggering that eight years after Molly's death, incredibly harmful suicide, self-harm, and depression content like she saw is still pervasive across social media. \"Ofcom's recent child safety codes do not match the sheer scale of harm being suggested to vulnerable users and ultimately do little to prevent more deaths like Molly's. \"The situation has got worse rather than better, despite the actions of governments and regulators and people like me. The report shows that if you strayed into the rabbit hole of harmful suicide self-injury content, it's almost inescapable. \"For over a year, this entirely preventable harm has been happening on the prime minister's watch and where Ofcom have been timid it is time for him to be strong and bring forward strengthened, life-saving legislation without delay.\" After Molly's death in 2017, a coroner ruled she had been suffering from depression, and the material she had viewed online contributed to her death \"in a more than minimal way\". Researchers at Bright Data looked at 300 Instagram Reels and 242 TikToks to determine if they \"promoted and glorified suicide and self-harm\", referenced ideation or methods, or \"themes of intense hopelessness, misery, and despair\". They were gathered between November 2024 and March 2025, before new children's codes for tech companies under the Online Safety Act came into force in July.  Instagram The Molly Rose Foundation claimed Instagram \"continues to algorithmically recommend appallingly high volumes of harmful material\". The researchers said 97% of the videos recommended on Instagram Reels for the account of a teenage girl, who had previously looked at this content, were judged to be harmful. Some 44% actively referenced suicide and self-harm, they said. They also claimed harmful content was sent in emails containing recommended content for users. A spokesperson for Meta, which owns Instagram, said: \"We disagree with the assertions of this report and the limited methodology behind it. \"Tens of millions of teens are now in Instagram Teen Accounts, which offer built-in protections that limit who can contact them, the content they see, and the time they spend on Instagram. \"We continue to use automated technology to remove content encouraging suicide and self-injury, with 99% proactively actioned before being reported to us. We developed Teen Accounts to help protect teens online and continue to work tirelessly to do just that.\" TikTok TikTok was accused of recommending \"an almost uninterrupted supply of harmful material\", with 96% of the videos judged to be harmful, the report said. Over half (55%) of the For You posts were found to be suicide and self-harm related; a single search yielding posts promoting suicide behaviours, dangerous stunts and challenges, it was claimed. The number of problematic hashtags had increased since 2023; with many shared on highly-followed accounts which compiled 'playlists' of harmful content, the report alleged. A TikTok spokesperson said: \"Teen accounts on TikTok have 50+ features and settings designed to help them safely express themselves, discover and learn, and parents can further customise 20+ content and privacy settings through Family Pairing. \"With over 99% of violative content proactively removed by TikTok, the findings don't reflect the real experience of people on our platform which the report admits.\" According to TikTok, they not do not allow content showing or promoting suicide and self-harm, and say that banned hashtags lead users to support helplines. Read more:Backlash against new online safety rulesMusk's X wants 'significant' changes to OSA  'A brutal reality' Both platforms allow young users to provide negative feedback on harmful content recommended to them. But the researchers found they can also provide positive feedback on this content and be sent it for the next 30 days. Technology Secretary Peter Kyle said: \"These figures show a brutal reality - for far too long, tech companies have stood by as the internet fed vile content to children, devastating young lives and even tearing some families to pieces. \"But companies can no longer pretend not to see. The Online Safety Act, which came into effect earlier this year, requires platforms to protect all users from illegal content and children from the most harmful content, like promoting or encouraging suicide and self-harm. 45 sites are already under investigation.\" An Ofcom spokesperson said: \"Since this research was carried out, our new measures to protect children online have come into force. \"These will make a meaningful difference to children - helping to prevent exposure to the most harmful content, including suicide and self-harm material. And for the first time, services will be required by law to tame toxic algorithms. \"Tech firms that don't comply with the protection measures set out in our codes can expect enforcement action.\" 'A snapshot of rock bottom' A separate report out today from the Children's Commissioner found the proportion of children who have seen pornography online has risen in the past two years - also driven by algorithms. Rachel de Souza described the content young people are seeing as \"violent, extreme and degrading\", and often illegal, and said her office's findings must be seen as a \"snapshot of what rock bottom looks like\". More than half (58%) of respondents to the survey said that, as children, they had seen pornography involving strangulation, while 44% reported seeing a depiction of rape - specifically someone who was asleep. The survey of 1,020 people aged between 16 and 21 found that they were on average aged 13 when they first saw pornography. More than a quarter (27%) said they were 11, and some reported being six or younger. Anyone feeling emotionally distressed or suicidal can call Samaritans for help on 116 123 or email jo@samaritans.org in the UK. In the US, call the Samaritans branch in your area or 1 (800) 273-TALK. "
    },
    {
        "title": "Scammers using AI to impersonate Sir Billy Connolly",
        "description": "Sir Billy Connolly has warned fans that scammers are using artificial intelligence to impersonate him online.",
        "url": "https://news.sky.com/story/scammers-using-ai-to-impersonate-sir-billy-connolly-13413973",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sir-billy-connolly_6994274.jpg?20250818095322",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-08-18 08:37:00",
        "Headline": "The Scottish comic and actor - affectionately known as The Big Yin - said his wife Pamela Stephenson had also been targeted.",
        "Content": "Sir Billy Connolly has warned fans that scammers are using artificial intelligence to impersonate him online. The Scottish comedian and actor - affectionately known as The Big Yin - said his wife Pamela Stephenson had also been targeted. In a message on his website, the 82-year-old said: \"Dear friends, I have learned that, unfortunately, online scam artists are targeting my fans and supporters. \"They are impersonating me, often reaching out to fans soliciting direct messaging. \"They create multiple deceptive social media and email accounts, and there could well be criminal intent.\" Sir Billy, who was diagnosed with Parkinson's disease in 2013, said his official Facebook page is his only social media account - alongside his website, billyconnolly.com. He warned: \"I do not have an Instagram, X, Snapchat, Telegram or any other social media account. \n                  Fife sex predator who raped teenage girls jailed for 10 years\n                 \n                  Fresh case launched after gender ruling - amid claims policies in schools and prisons are 'in clear breach of the law'\n                 \n                  Body found in search for man missing in River Tay in Perth\n                 \"I never interact directly with fans or supporters, and would never suggest they direct message me, meet me, send me money or purchase goods directly. \"I do not sell memberships, fan cards, meetings. I will never suggest meeting personally or ask for personal information. \"If you are asked for any of the above, it is a scam. My likeness and the sound of my voice can be created by AI... so beware!\" Read more from Sky News:British actor Terence Stamp has diedBBC pins hopes for culture shift on mugs and lanyards  Criminals can use cloning technology to replicate a person's voice from just a few seconds of audio, which can be easily captured from a video someone has uploaded online or to social media. Deepfake images of celebrities are often used in scams - and fake adverts featuring public figures were the most reported scam adverts reported to the Advertising Standards Authority in 2024. Sir Billy, who was knighted in 2017 for services to entertainment and charity, announced his retirement from live performances in 2018. As well as his stand-up shows, he has starred in a number of films - including Mrs Brown alongside Judi Dench, The Last Samurai with Tom Cruise, and Gulliver's Travels with Jack Black. He has also voiced a number of animated characters, including King Fergus in Pixar's Brave. Despite his medical condition, the comic has continued to record programmes and make TV appearances. His most recent projects include TV shows such as 2018's Billy Connolly: Made In Scotland, Billy Connolly's Great American Trail in 2019 and Billy Connolly Does... which began airing in 2022."
    },
    {
        "title": "'Ketamine Queen' to plead guilty to supplying dose of drug that killed Matthew Perry",
        "description": "A woman who was charged with selling Friends star Matthew Parry the dose of the drug that killed him has agreed to plead guilty. ",
        "url": "https://news.sky.com/story/ketamine-queen-to-plead-guilty-to-supplying-dose-of-drug-that-killed-matthew-perry-13414322",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-matthew-perry-jasveen-sangha_6658017.jpg?20240816125917",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-18 20:14:00",
        "Headline": "No subtitle found",
        "Content": "A woman who was charged with selling Friends star Matthew Parry the dose of the drug that killed him has agreed to plead guilty.  Jasveen Sangha, known as the \"Ketamine Queen\", is the fifth and final defendant to strike a plea deal with prosecutors, avoiding a trial that was set to take place in September. The 42-year-old agreed to plead guilty to five federal criminal charges, including providing the Ketamine that led to Perry's death, federal prosecutors said in a statement. Prosecutors had cast Sangha, a dual US and UK national, as a prolific drug dealer known to her customers as the \"Ketamine Queen\", often using the term in court documents and even including it in the official name of the case. She agreed to plead guilty to one count of maintaining a drug-involved premises, three counts of distribution of ketamine, and one count of distribution of ketamine resulting in death or serious bodily injury. Sangha will officially change her plea to guilty at an upcoming hearing, where sentencing will be scheduled, prosecutors said. She is facing up to 45 years in prison. Read more from Sky News: Man injured after tractor falls on to motorwayDrug dealer on e-bike who killed great-grandfather jailed Sangha and a doctor named Salvador Plasencia, who signed his own plea deal in June, had been the primary targets of the investigation. Three other defendants - Mark Chavez, who it was claimed bought the drug from Sangha, Kenneth Iwamasa, and Erik Flemin - agreed to plead guilty last year in exchange for their cooperation, which included statements implicating Sangha and Plasencia. Prosecutors allege Chavez funnelled ketamine to Plasencia, securing some of the drug from a wholesale distributor through a fraudulent prescription. In one instance, prosecutors allege that Plasencia \"charged Perry $2,000 (£1,500) a vial that cost Dr Chavez approximately $12 (£9)\". Perry died in his home in October 2023, aged 54, after getting ketamine from his regular doctor for treatment of depression, which is an increasingly common use for the surgical anaesthetic. The actor was taking ketamine six to eight times a day before he died, according to court documents."
    },
    {
        "title": "Ozzy Osbourne documentary pulled from BBC's schedule - without explanation",
        "description": "An Ozzy Osbourne documentary has disappeared from the BBC's schedule without explanation.",
        "url": "https://news.sky.com/story/ozzy-osbourne-documentary-pulled-from-bbcs-schedule-without-explanation-13414083",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-ozzy-osbourne-black-sabbath_6976617.jpg?20250729094452",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-18 12:22:00",
        "Headline": "Ozzy Osbourne: Coming Home is said to reveal the \"extraordinary rollercoaster\" of his family's life as they return to Britain and the singer tries to get fit enough to perform again.",
        "Content": "An Ozzy Osbourne documentary has disappeared from the BBC's schedule without explanation. The film was billed by producers as \"a moving and inspirational account\" of the last chapter of the metal legend's life. It was meant to air at 9pm on Monday on BBC One - as well as be available on iPlayer - but an episode of Fake Or Fortune? has replaced it. Sky News has contacted the BBC for comment on why the programme, called Ozzy Osbourne: Coming Home, has been pulled. The project was filmed over three years as Ozzy and his family returned to the UK, and was initially conceived as a series entitled Home to Roost. However, as the singer's health got worse it morphed into a one-off. Read more from Sky News:Homes evacuated amid huge fire in Essex seaside townScammers using AI to impersonate Sir Billy Connolly \n                  Yungblud pays tribute to his hero Ozzy Osbourne as he opens up about 'raw' documentary Are You Ready, Boy?\n                 \n                  Man charged with theft of flowers from Ozzy Osbourne tribute\n                 \n                  Ozzy Osbourne is given final tour of Birmingham - with thousands of fans flooding streets to pay their respects\n                  The BBC reported the show would reveal the \"extraordinary rollercoaster\" of the Osbournes' lives as Ozzy tries \"heroically\" to get fit enough to perform again. It's said to feature \"unique and intimate access\" to the family, including Ozzy's children, Jack and Kelly, who appeared in the reality series that made them household names in the early 2000s. The Black Sabbath frontman, who had Parkinson's disease, died last month - just a few weeks after his final all-star gig at Birmingham's Villa Park. Fans packed the city centre and chanted his name when his hearse passed through on 30 July. His wife, Sharon, was in tears as she got out to see the mass of flowers left for him at \"Sabbath Bridge\". The New York Times said his death certificate gave the cause as cardiac arrest, but the family hasn't commented."
    },
    {
        "title": "Sally Rooney risks committing terror offence under UK law if she funds Palestine Action, No 10 says",
        "description": "Normal People author Sally Rooney risks committing a terror offence under UK law if she funds the banned group Palestine Action, Downing Street has said.",
        "url": "https://news.sky.com/story/sally-rooney-risks-committing-terror-offence-under-uk-law-if-she-funds-palestine-action-no-10-says-13414084",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sally-rooney-author_6994490.jpg?20250818162218",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-18 12:18:00",
        "Headline": "The award-winning Irish author earlier said she will donate her earnings from her BBC adaptions to support the group which is banned in the UK.",
        "Content": "Normal People author Sally Rooney risks committing a terror offence under UK law if she funds the banned group Palestine Action, Downing Street has said. The award-winning Irish author had earlier said she will donate her earnings from her books and BBC adaptions to support the group, which was proscribed as a terrorist organisation in the UK on 5 July. More than 700 people have been arrested in relation to alleged support of the group since it was banned - including 522 during a protest in central London on 9 July. Palestine Action was proscribed after the group claimed responsibility for damage to jets at RAF Brize Norton and was also linked to \"allegations of a serious assault on staff and police officers at a business premises in South Gloucestershire\", the Met Police said. Writing in the Irish Times over the weekend, Rooney said that if backing the group \"makes me a 'supporter of terror' under UK law, so be it\". The 34-year-old added that she will use the proceeds of her work and her public platform to continue her support for Palestine Action and \"direct action against genocide in whatever way I can\". Palestine Action was banned under terrorism legislation in the UK, but not under Irish law. \n                  Sixty more people to be prosecuted for 'showing support' for proscribed Palestine Action, Met Police says\n                 \n                  Yvette Cooper defends arrest of more than 500 people at Palestine Action protests\n                 \n                  More than 500 people arrested after Palestine Action protest - with almost half aged 60 and above\n                 Rooney currently lives in the west of Ireland. The BBC has broadcast adaptations of Rooney's novels Normal People and Conversations With Friends in recent years. However, the corporation said that Rooney has never been a member of their staff, adding that what novelists say and do with money previously received is a matter for them. In a statement, a BBC spokesperson said: \"Matters relating to proscribed organisations are for the relevant authorities.\" It is understood the BBC said it is not currently working with Rooney on any upcoming projects. Read more from Sky News:Why Putin's demands make it difficult for Zelenskyy to agree a dealDozens evacuated from homes after seaside town fireOzzy Osbourne documentary pulled from BBC schedule  In Westminster, the prime minister's official spokesman would not comment specifically on the author's remarks, but said on Monday: \"There is a difference between showing support for a proscribed organisation, which is an offence under the Terrorism Act, and legitimate protest in support of a cause.\" Asked what message Number 10 would give to people considering giving money to the group, the spokesman added: \"Support for a proscribed organisation is an offence under the Terrorism Act and obviously the police will, as they have set out, they will obviously implement the law within the law as you'd expect.\" The spokesman said Palestine Action was proscribed \"based on security advice following serious attacks the group has committed, following an assessment made by the Joint Terrorism Analysis Centre\". Dr Jilan Wahba Abdalmajid, the ambassador of the state of Palestine in Ireland, said on Monday: \"Sally Rooney is using her voice to call out international law and human rights violations in Palestine. \"I hope these calls result in practical actions that will stop the horrors we're witnessing carried out by Israel in Palestine; to stop the genocide and forced displacement and end the Israeli occupation.\""
    },
    {
        "title": "Scammers using AI to impersonate Sir Billy Connolly",
        "description": "Sir Billy Connolly has warned fans that scammers are using artificial intelligence to impersonate him online.",
        "url": "https://news.sky.com/story/scammers-using-ai-to-impersonate-sir-billy-connolly-13413973",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-sir-billy-connolly_6994274.jpg?20250818095322",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-08-18 08:37:00",
        "Headline": "The Scottish comic and actor - affectionately known as The Big Yin - said his wife Pamela Stephenson had also been targeted.",
        "Content": "Sir Billy Connolly has warned fans that scammers are using artificial intelligence to impersonate him online. The Scottish comedian and actor - affectionately known as The Big Yin - said his wife Pamela Stephenson had also been targeted. In a message on his website, the 82-year-old said: \"Dear friends, I have learned that, unfortunately, online scam artists are targeting my fans and supporters. \"They are impersonating me, often reaching out to fans soliciting direct messaging. \"They create multiple deceptive social media and email accounts, and there could well be criminal intent.\" Sir Billy, who was diagnosed with Parkinson's disease in 2013, said his official Facebook page is his only social media account - alongside his website, billyconnolly.com. He warned: \"I do not have an Instagram, X, Snapchat, Telegram or any other social media account. \n                  Fife sex predator who raped teenage girls jailed for 10 years\n                 \n                  Fresh case launched after gender ruling - amid claims policies in schools and prisons are 'in clear breach of the law'\n                 \n                  Body found in search for man missing in River Tay in Perth\n                 \"I never interact directly with fans or supporters, and would never suggest they direct message me, meet me, send me money or purchase goods directly. \"I do not sell memberships, fan cards, meetings. I will never suggest meeting personally or ask for personal information. \"If you are asked for any of the above, it is a scam. My likeness and the sound of my voice can be created by AI... so beware!\" Read more from Sky News:British actor Terence Stamp has diedBBC pins hopes for culture shift on mugs and lanyards  Criminals can use cloning technology to replicate a person's voice from just a few seconds of audio, which can be easily captured from a video someone has uploaded online or to social media. Deepfake images of celebrities are often used in scams - and fake adverts featuring public figures were the most reported scam adverts reported to the Advertising Standards Authority in 2024. Sir Billy, who was knighted in 2017 for services to entertainment and charity, announced his retirement from live performances in 2018. As well as his stand-up shows, he has starred in a number of films - including Mrs Brown alongside Judi Dench, The Last Samurai with Tom Cruise, and Gulliver's Travels with Jack Black. He has also voiced a number of animated characters, including King Fergus in Pixar's Brave. Despite his medical condition, the comic has continued to record programmes and make TV appearances. His most recent projects include TV shows such as 2018's Billy Connolly: Made In Scotland, Billy Connolly's Great American Trail in 2019 and Billy Connolly Does... which began airing in 2022."
    }
]