[
    {
        "title": "Nuclear threat wasn't the only reason Israel attacked Iran",
        "description": "Why did Israel attack Iran? Certainly, it was worried about the threat of a nuclear weapon being developed. ",
        "url": "https://news.sky.com/story/nuclear-threat-wasnt-the-only-reason-israel-attacked-iran-13383624",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tehran-iran_6940984.jpg?20250613110448",
        "type": "Home",
        "Author": "Adam Parsons",
        "Date Published": "2025-06-14 13:27:00",
        "Headline": "Hours after Israel launched its first, surprise attack, the message from Benjamin Netanyahu couldn't be clearer - Iranians, he said, should overthrow their \"evil and oppressive regime\". ",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Why did Israel attack Iran? Certainly, it was worried about the threat of a nuclear weapon being developed.  But it's also becoming clearer that there was a second reason - that this is about laying the ground for regime change in Tehran. Follow latest: Israel warns 'Tehran will burn' if it continues Because, hours after his country launched its first, surprise attack, the message from Benjamin Netanyahu couldn't be clearer - Iranians, he said, should overthrow their \"evil and oppressive regime\". He said Israel's attack would \"pave the way for you to achieve your freedom\". On the one hand, he would say that, wouldn't he? The Iranian government does not recognise the legitimacy of the Israeli state and has called for its destruction, while funding proxy groups that have attacked Israel - including Hamas, Lebanese Hezbollah, and the Houthis in Yemen. But perhaps this time there is more than just wishful thinking. Although it's very hard to gauge the level of opposition in Iran, it seems likely the majority of the population of 90 million are at least disenchanted with the regime.  Living standards have fallen and supplies are running short. While tens of billions of dollars have been spent on a nuclear programme, electricity is being rationed and cooking gas is running low. Priority is being given to those who are close to the regime, notably the members of the Islamic Revolutionary Guard Corps (IRGC), a branch of the Iranian army that is fiercely loyal to the ruling regime. The IRGC are crucial in propping up Ayatollah Ali Khamenei, the country's 86-year-old supreme leader. Not only do they offer military power, but also domestic surveillance, intimidation and secret policing in order to stifle dissent. So for any opposition to emerge, let alone flourish, the IRGC would need to be degraded - and that is precisely what Israel has done, targeting its senior leaders as well as bases. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The regular army, so far, has been left alone. Israel's gamble is that a majority of the rest of the military harbour the same dislike of the IRGC as the wider population. It was no coincidence that Netanyahu quoted the expression \"woman, life, freedom\", which was a rallying call during the 2022 protests in Iran - eventually suppressed by the IRGC. It is very hard to believe that a coherent, public opposition movement will burst into life any time soon. Iranians are well aware their regime will respond with brutality against any attempted uprising.  Instead, dissidents seem to be biding their time and waiting to see if Israel continues its assaults, and whether they can sense genuine signs that the regime is starting to struggle to maintain control. If the cracks emerge, then regime change - or at least an attempt - is possible. Possible, but not certain. \"They will do anything to stay in power, and when other uprisings have happened, they've been successfully suppressed,\" one Middle East diplomat tells me. \"And there is no unifying leader ready to step in. Even if there is regime change, it could be a military takeover rather than a popular uprising.\" Read more:All we know about military chiefs killed by IsraelWhat are Iran's military capabilities? And that leaves one final question - if Khamenei did feel his grip on power was failing, might he still have the time, desire and power to resort to final, desperate military actions? The truth is, we don't know. At the moment, the Middle East is a region full of unanswerable, high-risk questions."
    },
    {
        "title": "Minnesota: US politician shot dead and another wounded - as suspect named",
        "description": "A manhunt is under way after a US politician and her husband were shot dead in their home in a \"politically motivated assassination\" - and another politician and his wife were also shot.",
        "url": "https://news.sky.com/story/manhunt-after-us-politician-and-husband-shot-dead-in-politically-motivated-assassination-second-politician-also-targeted-13383649",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-melissa-hortman-vance-boelter_6942275.jpg?20250614221019",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-14 14:17:00",
        "Headline": "A manhunt is under way for 57-year-old suspect Vance Boelter - who was reportedly posing as a police officer.",
        "Content": "A manhunt is under way after a US politician and her husband were shot dead in their home in a \"politically motivated assassination\" - and another politician and his wife were also shot. Minnesota state representative Melissa Hortman and her husband were killed at their home, Tim Walz, the governor of Minnesota, confirmed. State senator John Hoffman and his wife were also shot in their home but are expected to survive. The senator, according to officials, is in a stable condition after emergency surgery. Authorities have confirmed that the suspect they are looking for is 57-year-old Vance Boelter - who, in a press conference, was described as a 6ft 1in white male, with brown hair and brown eyes. Members of the public have been urged not to approach him as he may be armed. The suspect was reportedly posing as a police officer, and officials said the alleged attacker escaped after an exchange of gunfire. Both politicians are members of the Minnesota Democratic-Farmer-Labor Party.  US President Donald Trump, in a statement, said: \"I have been briefed on the terrible shooting that took place in Minnesota, which appears to be a targeted attack against State Lawmakers. \"Our Attorney General, Pam Bondi, and the FBI, are investigating the situation, and they will be prosecuting anyone involved to the fullest extent of the law. \"Such horrific violence will not be tolerated in the United States of America.\" Authorities have urged residents of the Champlin and Brooklyn Park areas to stay in their homes. In an earlier Facebook post, Mr Walz said: \"I've been briefed this morning on an ongoing situation involving targeted shootings in Champlin and Brooklyn Park. \"The Minnesota Department of Public Safety and local law enforcement are on the scene. We will share more information soon.\" At a subsequent news conference, Mr Walz said: \"We must all, in Minnesota and across the country, stand against all forms of political violence. \"Those responsible for this will be held accountable.\" He has also urged those in Minnesota not to attend political rallies until the suspect is caught. Police evacuated the Texas State Capitol and grounds in Austin ahead of an anti-Trump protest on Saturday - citing a credible threat to politicians. Read more on Sky News:'Tehran will burn' if it keeps firing missiles, Israel warnsSee the best pictures from Trooping the Colour30,000 lightning strikes hit UK Post-mortem examinations will be conducted to determine the extent of their injuries. However, it is clear that both Ms Hortman and her spouse died from gunshot wounds, Drew Evans, superintendent of the Bureau of Criminal Apprehension, said. Ms Hortman, a mother of two, was first elected in 2004 - and was the top house Democratic leader in the state legislature. She also served as speaker of the Minnesota House of Representatives. Mr Hoffman, also a Democrat, was first elected in 2012 - and ran a consulting firm called Hoffman Strategic Advisors. Hakeem Jeffries, House Democratic leader, has described the shootings as \"deeply disturbing\" on X, adding that \"violence is never acceptable\", and that he is \"praying hard\" for the victims. Former Arizona representative, Gabby Giffords, described her friend Ms Hortman as a \"true public servant\", who \"dedicated her life building a better, safer Minnesota\". Nancy Pelosi, former speaker of the US House of Representatives, said she was \"heartbroken\" by the news. She added: \"Unfortunately, we know the tragedy of when political violence hits home very well. \"All of us must remember that it’s not only the act of violence, but also the reaction to it, that can normalise it. This climate of politically-motivated violence must end.\" In a tribute, Democratic National Committee chair Ken Martin said: \"Melissa, Mark, John, and Yvette - these are not just names, and this is not just politics. \"These are people. They’re longtime friends to me and Jenn and so many others in Minnesota. They have children, loved ones, neighbors, and friends.\" Mr Martin added: \"Today, we recommit ourselves to fight harder for the values that Melissa and Mark embodied - building a kinder, more just, and loving world. If this murderer thinks we will be silenced, he’s wrong.\""
    },
    {
        "title": "Sir Keir Starmer to launch new national inquiry into grooming gangs",
        "description": "Sir Keir Starmer is to launch a new national inquiry into grooming gangs.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-launch-new-national-inquiry-into-grooming-gangs-13383695",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-downing-street_6939164.jpg?20250611115140",
        "type": "Home",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-14 15:48:00",
        "Headline": "Ahead of the G7 summit in Canada, Sir Keir Starmer tells reporters he will commission a national inquiry into grooming gangs on the recommendation of Baroness Casey.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer is to launch a new national inquiry into grooming gangs. It comes after a government-requested audit into the scale of grooming gangs across the country concluded a nationwide probe was necessary. The prime minister previously argued a national inquiry was not necessary, but has changed his view following an audit into group-based child sexual abuse led by Baroness Casey, which is set to be published next week. \"[Baroness Casey's] position when she started the audit was that there was not a real need for a national inquiry over and above what was going on,\" he told reporters travelling with him to the G7 summit in Canada. \"She has looked at the material... and she has come to the view that there should be a national inquiry on the basis of what she has seen. \"I have read every single word of her report, and I am going to accept her recommendation. That is the right thing to do on the basis of what she has put in her audit. \"I asked her to do that job to double check on this; she has done that job for me, and having read her report... I shall now implement her recommendations.\" Grooming gangs timeline: What happened, what inquiries there were and how Starmer was involved  The near 200-page report is to be published next week and is expected to warn that white British girls were \"institutionally ignored for fear of racism\". One person familiar with the report said it details the institutional failures in treating young girls and cites a decade of lost action from the Jay Review, set up in 2014 to investigate grooming gangs in Rotherham. The report is also expected to link illegal immigration with the exploitation of young girls. The government had initially resisted a new inquiry, insisting that it first wanted to implement recommendations from previous inquiries, such as the Jay Review, into child sexual exploitation. It also allowed five councils to set up their own investigations into their communities rather than hold a national inquiry.  The grooming gang scandal came back into the headlines at the beginning of the year after Elon Musk attacked Sir Keir and safeguarding minister Jess Philips for failing children. The prime minister and Ms Phillips hit back, with Sir Keir citing his record of prosecuting abusers as director of public prosecutions, while Ms Phillips has long been a campaigner against domestic violence. At the time, she told Sky News that Mr Musk's claims were \"ridiculous\" and that she would be led by what victims have to say, not him. Following the row between the tech billionaire and the UK government, the prime minister asked Baroness Casey to conduct an audit of all the evidence to see if a national inquiry was required. Read more on this story:Telford child abuse victims speak outWhat we know about grooming gangs, from the dataThe women who blew whistle on Rotherham Kemi Badenoch, the Conservative leader, said: \"Keir Starmer doesn't know what he thinks unless an official report has told him so. \"Just like he dismissed concerns about the winter fuel payment and then had to U-turn, just like he needed the Supreme Court to tell him what a woman is, he had to be led by the nose to make this correct decision here. \"I've been repeatedly calling for a full national inquiry since January. It's about time he recognised he made a mistake and apologise for six wasted months. \"But this must not be the end of the matter. There are many, many more questions that need answering to ensure this inquiry is done properly and quickly. \"Many survivors of the grooming gangs will be relieved that this is finally happening, but they need a resolution soon, not in 10 years' time. Justice delayed is justice denied.\""
    },
    {
        "title": "The bodies of more than 1,000 Ukrainian soldiers returned to Kyiv after prisoner swap",
        "description": "More than 1,000 Ukrainian bodies have been handed back to Kyiv after a prisoner-of-war exchange - as Volodymyr Zelenskyy renews calls for sanctions.",
        "url": "https://news.sky.com/story/the-bodies-of-more-than-1000-ukrainian-soldiers-returned-to-kyiv-after-prisoner-swap-13383619",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukraine-russia-prisoner-of-war_6941963.jpg?20250614155822",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-14 13:09:00",
        "Headline": "It comes after a prisoner exchange was agreed at talks in Istanbul earlier this month.",
        "Content": " More than 1,000 Ukrainian bodies have been handed back to Kyiv after a prisoner-of-war exchange - as Volodymyr Zelenskyy renews calls for sanctions. The Ukrainian president said on social media that many of those released by Russia had been \"held captive since 2022\". \"It is our absolute duty to free them all,\" he added. \"And we are working toward exactly that - to leave no one behind in the enemy's hands. I thank everyone who is helping.\"   Russia's defence ministry said it had handed over the bodies of 1,200 dead Ukrainian soldiers on Friday, but state media reported on Saturday that Moscow had not received any of its war dead back from Kyiv. The ministry added that its soldiers are in Belarus, where they are receiving medical treatment before being transferred back to Russia. It comes after both sides agreed to exchange those held captive at talks in Istanbul earlier this month. However, the talks failed to lead to a ceasefire. In a post on X, Mr Zelenskyy renewed calls for sanctions on Russia, saying that \"no one has been able to stop Putin\" and that \"he must lose money\" to end the war. \"Capping the price of Russian energy is critical, because oil is their main source of income,\" Mr Zelenskyy added. \"What happens in the Middle East is now driving oil prices up, and that, in turn, affects Europe's security. \"That's why oil price caps are such a powerful tool.\" He went on to say talks between the US and Russia \"feels too warm\", adding: \"Putin must understand clearly: America will stand with Ukraine, including by imposing sanctions and supporting our army. \"Any signals of reduced aid, or of treating Ukraine and Russia as equals, are deeply unfair. Russia is the aggressor. They started this war. They do not want to end it.\" Read more from Sky News:Ex-CIA director calls Trump's Ukraine plan 'naive'Politician faces deportation from Egypt after trying to cross into GazaFamilies endure agonising wait for Air India crash victims' bodies It comes as the Ukrainian president dismissed claims that Russian troops had crossed into the central Ukrainian region of Dnipropetrovsk - which had remained under Ukrainian control since the war started in February 2022. Mr Zelenskyy also said Ukrainian troops had stopped Russian troops from advancing in the northeastern Sumy region, and are fighting to regain control of the border. He said: \"You should understand that the enemy has been stopped there. And the maximum depth at which the fighting takes place is 7km from the border.\""
    },
    {
        "title": "Trump and Putin agree Iran-Israel conflict 'should end' in hour-long phone call",
        "description": "US President Donald Trump has revealed details of a one-hour phone call with his Russian counterpart, in which they agreed the conflict between Israel and Iran should end.",
        "url": "https://news.sky.com/story/trump-and-putin-agree-iran-israel-conflict-should-end-in-hour-long-phone-call-13383778",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-14 19:02:00",
        "Headline": "The US president says the Russian leader \"called this morning to very nicely wish me a Happy Birthday\" and to discuss tensions in the Middle East.",
        "Content": "US President Donald Trump has revealed details of a one-hour phone call with his Russian counterpart, in which they agreed the conflict between Israel and Iran should end. Posting on his Truth Social platform, Mr Trump added that he told Vladimir Putin that \"his war [in Ukraine] should also end\". Iran has retaliated following Israel's attack on its nuclear sites on Friday - which killed senior army officers and nuclear scientists. Israel-Iran latest: Follow live updates   The Iranian response has resulted in at least three people killed and dozens of injuries in Israel, according to medics. Iranian state TV, meanwhile, has reported that 20 children are among the 60 killed in a strike on a Tehran neighbourhood on Saturday. Iranian missiles were seen entering Israeli airspace on Saturday evening. Meanwhile, RAF jets and military assets are being sent to the Middle East after Tehran warned the UK and other allies their regional bases would be targeted if they helped defend Israel in the growing conflict between the two heavily armed countries.  In his post, Mr Trump said: \"President Putin called this morning to very nicely wish me a Happy Birthday, but to more importantly, talk about Iran, a country he knows very well. We talked at length. \"Much less time was spent talking about Russia/Ukraine, but that will be for next week. He is doing the planned prisoner swaps - large numbers of prisoners are being exchanged, immediately, from both sides. \"The call lasted approximately 1 hour. He feels, as do I, this war in Israel-Iran should end, to which I explained, his war should also end.\" Read more on Sky News:Nuclear threat wasn't the only reason Israel attacked IranUS politician shot dead and another wounded - as suspect named  Kremlin aide Yuri Ushakov said President Putin condemned Israel's military operation in Iran and expressed concerns about the risk of escalation. During the conversation, the Russian leader briefed President Trump on his recent talks with the leaders of Israel and Iran - reiterating Russia's hopes to seek mutually acceptable solutions on Iran's growing nuclear issue. Meanwhile, the latest round of US-Iran nuclear talks scheduled for Sunday in Muscat will not take place, a senior US administration official has told Sky's US partner network NBC News. However, the official said the US is \"not shutting the door to future discussions\". \"While there will be no meeting on Sunday, we remain committed to talks and hope the Iranians will come to the table soon,\" the official said."
    },
    {
        "title": "Air India plane crash victim's son says he'll relive his mother's last moments 'to the day I die'",
        "description": "The son of an Air India plane crash victim, who was sitting one row behind the man who survived, has told Sky News he will relive \"her last moments\" until the day he dies.",
        "url": "https://news.sky.com/story/air-india-plane-crash-victims-son-says-hell-relive-his-mothers-last-moments-to-the-day-i-die-13383642",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chirag-mahesh-patel_6941938.jpg?20250614153422",
        "type": "Home",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-14 14:14:00",
        "Headline": "Manju Mahesh Patel had been staying in Ahmedabad to do charity work at a temple, and had been looking forward to returning to the UK to see her grandchildren.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The son of an Air India plane crash victim, who was sitting one row behind the man who survived, has told Sky News he will relive \"her last moments\" until the day he dies.  Manju Mahesh Patel, 79, was on the London Gatwick-bound plane when it crashed in Ahmedabad shortly after take-off on Thursday. She was sitting in seat 12D on flight AI 171, the row behind the only person to survive the crash who was sitting in 11A. In an interview with Sky News, Chirag Mahesh Patel, Manju's son, said he hopes his mother's death was \"instant\" and \"painless\". \"To the day I die I will think, 'what were her last moments?',\" he said. Pointing to a framed family photograph of Ms Patel at the family home, he added: \"I want to remember mum like this. \n                  Air India plane crash: Families in Ahmedabad endure agonising wait for victims' bodies\n                 \n                  Air India plane crash: Sole survivor recounts moments before deadly impact\n                 \n                  Air India crash survivor told me he's okay - his escape is nothing short of a miracle\n                 \"I don't want to have to go and identify a burnt corpse, your own parent. How does someone, how do you ever get over that? That will be with me, that's with me for life.\" Ms Patel had been staying in Ahmedabad for the past few months doing charity work at a temple. She was due to be picked up by her son at Gatwick on Thursday night. Read more on Air India crash:Air India's lone survivor is nothing short of miracleGloucester family among deadEverything we know about the crash In tears, Mr Patel described his mother as \"very strong\" and a woman \"who really loved her family\". \"The thing about my mum,\" he said, \"is her bond with her faith. It's unbreakable. \"She had ultimate faith… and in times of stress she would always say God's name… So, I know that upon take-off, I know that she was saying his name.\"  Mr Patel said that when he realised his mother was on the flight it was just \"a normal day\" and \"it didn't seem real\". He said the last time he had spoken to her he had reminded her to take her diabetes medicine and had then missed a call from her at 4am to say she had arrived at the airport. He described \"the most heartbreaking thing\" was how much Ms Patel was looking forward to seeing her grandchildren, saying \"it was everything to her\". She had told him she packed her suitcase with lollipops for her six-year-old grandson, and special crisps for her 15-year-old older grandchild. \"It's unimaginable even in my worst nightmare,\" he said. \"And the thing that kills me… is she was so looking forward to seeing us… she kept saying I bought this for you, I bought that, I bought the things for the kids.\" Mr Patel and his wife are due to fly to India on Saturday night to provide a DNA sample to help identify his mother's remains. He expressed his anger at what he called a \"disgusting\" and \"appalling\" lack of communication from Air India - which he said passed his details to a hospital but never contacted him personally. He described feeling \"neglected\" by the airline, which he said would only offer him an Air India flight - and no help organising accommodation. Mr Patel said he refused to get on the Gatwick flight back to Ahmedabad and has booked with another provider to travel to India instead. \"I said [to the airline] all of this happened on Thursday, you're telling me on Friday afternoon, do you want that flight this evening? That one crashed? The one coming back where 172 goes out? They asked do you want Air India 172? I said how can you ask me that. My mum just died on Air India.\" Mr Patel said he wanted \"answers\" and transparency in any air accident investigation. Air India said in a statement: \"Air India stands in solidarity with the families of the passengers who tragically lost their lives in the recent accident. Our teams on the ground are doing everything possible to extend care and support during this incredibly difficult time. \"As part of our continued efforts, Air India will be providing an interim payment of ₹25 lakh or approximately £21,000 each to the families of the deceased and to the survivor, to help address immediate financial needs. This is in addition to the ₹1 crore or approximately £85,000 support already announced by Tata Sons. \"All of us at Air India are deeply saddened by this loss. We mourn with the families, loved ones, and everyone affected.\"  The company's chief executive and managing director Campbell Wilson said in a video message posted on social media that over 200 \"trained caregivers\" were now in place to offer dedicated assistance to families, along with counselling and other services. He said Air India was in the process of completing precautionary safety checks on Boeing 787 aircraft as directed by regulator the Directorate General of Civil Aviation (DGCA), which would \"be completed within the timelines prescribed by the regulator\". 👉 Listen to Sky News Daily on your podcast app 👈 Mr Wilson said he had also visited the crash site and said other members of the management team would remain present \"for as long as it takes\". The aircraft's data recorder, often referred to as a black box, has been recovered and will form part of the investigation into the worst aviation crash in a decade. By Lisa Dowd, Midlands correspondent, in Derby It was an emotional service at Derby's Geeta Bhawan Hindu temple, as dozens of friends, colleagues and neighbours gathered to remember Dr Prateek Joshi, his wife Komi, their daughter Miraya, and twin sons Nakul and Pradyut. Some wiped tears from their eyes, as a colleague was asked spontaneously to pay tribute to Dr Joshi, who had been bringing his family to live in the city, when the Air India flight they were on crashed seconds after take-off. \"He was too young, too much still to give, too much still to be done, too much to offer,\" his friend told worshippers. \"He was taken from us in a very cruel and abrupt way, and his family as well, and we all think about his family back in India who is missing a son, missing a daughter-in-law and missing all their grandchildren who they'll never see growing up.\" Derby South MP Catherine Atkinson said Dr Joshi, who was a radiologist at the Royal Derby hospital, had been \"contributing to our NHS and the health of so many in our city and beyond\". She said his wife was a pathologist who had resigned from her job in India. \"I won't forget the photograph of them on the plane, full of optimism about their new adventure,\" she said, as her voice broke. \"The losses make us all hug our families and loved ones a little closer and remind us how precious our time together is.\" Dr Joshi was described as a \"warm, smiling man, full of joy\" who enjoyed walking in the Peak District and who had discovered \"a love of fish and chips\". His neighbour and colleague Manoj Ramtohal told Sky News Dr Joshi always had time for people. \"He was very caring and very polite, very friendly, you couldn't meet a better man than Prateek,\" he said. \"We lost a very, very talented doctor.\""
    },
    {
        "title": "Nigeria: At least 100 killed in gun attack in Benue state village, Amnesty International claims",
        "description": "At least 100 people have been killed in a gun attack in a village in north-central Nigeria, Amnesty International has claimed.",
        "url": "https://news.sky.com/story/nigeria-at-least-100-killed-in-gun-attack-in-benue-state-village-amnesty-international-claims-13383814",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-benue-nigeria_6942279.jpg?20250614221356",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-14 20:43:00",
        "Headline": "The human rights group said the attack took place between late Friday and early Saturday in a village in Nigeria's Benue state.",
        "Content": "At least 100 people have been killed in a gun attack in a village in north-central Nigeria, Amnesty International has claimed. The human rights group's branch in Nigeria said the attack occurred between Friday evening and Saturday morning in Yelewata, a community in the Guma area of Benue state. \"Many families were locked up and burnt inside their bedrooms,\" the group said in a post on X. \"So many bodies were burnt beyond recognition.\" It said hundreds of people were injured and were without adequate medical care, while dozens of others were missing. A police spokesperson in Benue confirmed that an attack took place in Yelewata but did not specify how many people had died. Amnesty noted in a statement that there had been an \"alarming escalation of attacks across Benue state where gunmen have been on a killing spree with utter impunity\". \"The Nigerian authorities' failure to stem the violence is costing people's lives and livelihoods, and without immediate action many more lives may be lost,\" it added. \n                  At least 150 killed after heavy flooding in Nigeria\n                 \n                  Nigeria floods: At least 110 dead as heavy flooding submerges thousands of houses\n                 \n                  Shell in court over claims of oil pollution in Nigeria\n                 Last month, gunmen, believed to be herders, killed at least 20 people in the Gwer West area of Benue. In April, at least 40 people were killed in the neighbouring state of Plateau. Benue is in Nigeria's 'middle belt', a region where the majority Muslim north meets the largely Christian south. Read more from Sky News:Why Ballymena became the site of anti-immigration riotsWhy many victims will welcome a national inquiry into grooming gangsNuclear threat wasn't the only reason Israel attacked Iran Attacks are common in Nigeria's northern regions, where local herders and farmers often clash over limited access to land and water. Farmers accuse the herders, mostly of Fulani origin, of grazing their livestock on their farms and destroying their produce. The herders insist that the lands are grazing routes that were first backed by law in 1965, five years after the country gained its independence."
    },
    {
        "title": "See the best pictures from Trooping the Colour - as King pays tribute to plane crash victims",
        "description": "The King has marked his official birthday at the Trooping the Colour parade, wearing a black armband&#160;in tribute to those killed in the Air India plane crash.",
        "url": "https://news.sky.com/story/see-the-best-pictures-from-trooping-the-colour-as-king-pays-tribute-to-plane-crash-victims-13383565",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trooping-the-colour_6941851.jpg?20250614131835",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-06-14 10:00:00",
        "Headline": "Prince George, Princess Charlotte and Prince Louis appeared with their mother in a carriage, while more than 1,300 soldiers took part in the parade. ",
        "Content": " The King has marked his official birthday at the Trooping the Colour parade, wearing a black armband in tribute to those killed in the Air India plane crash. More than 1,300 soldiers took part in the ceremony at Horse Guards Parade in Whitehall. The event has marked the official birthday of the UK monarch on the second Saturday of June for more than 260 years. The King previously said he was \"desperately shocked\" at the aviation disaster that claimed the lives of 270 people, including more than 50 British nationals. The 76-year-old King will lead the nation in a minute's silence, with black armbands worn by senior royals, including the Prince of Wales, the Princess Royal and the Duke of Edinburgh. The Queen, the Princess of Wales and the Duchess of Edinburgh were among the royal party watching the event with Prince George, Princess Charlotte and Prince Louis. The Prime Minister, Keir Starmer, and his wife, Victoria watched the event, as did singer-songwriter Matt Goss, who rose to fame in the mid-1980s.  A Buckingham Palace spokesperson said the King requested amendments to the Trooping the Colour programme \"as a mark of respect for the lives lost, the families in mourning and all the communities affected by this awful tragedy\". In 2017, Trooping was held a few days after the Grenfell Tower blaze and the loss of life was marked by a minute's silence, a decision taken by Queen Elizabeth II. Away from performing ceremonial duties, the soldiers taking part in the military display are fighting soldiers. The stands around Horse Guards Parade were filled with around 8,000 wives, girlfriends and the parents of the guardsmen and officers on parade. The colour, or regimental flag, trooped this year was the King's Colour of Number 7 Company, Coldstream Guards, a prestigious regiment known as the sovereign's bodyguard. It celebrates its 375th anniversary this year. Royal correspondent As the carriages left Buckingham Palace, and you looked closely, the difference in this parade was immediately apparent.  Black armbands on all of the senior royals in military uniforms, including the King, a request from the monarch as a mark of respect to those who died in the Air India crash and those who mourn them. Another alteration was made after they’d inspected the guard on Horse Guards parade with a minute’s silence. We know that King Charles can be an emotional and empathic man, but this was a reminder of how much he appreciates the role the royal family can play in those moments when it’s right that the nation takes time to remember. The rest of the parade stepped off as normal, only right after the months of rehearsals the soldiers and musicians go through.  The traditional fly past also still took place along with the annual balcony moment. After the horror of world events this week it felt like a lighter moment of distraction, for those who enjoy this kind of pageantry.  Prince Louis with the final wave, from a family mindful of their position and what they can do in more challenging times. The day ended with the royal family gathering on Buckingham Palace's balcony for the gun salutes in Green Park and the traditional RAF flypast. Led by the Red Arrows, this year for the first time, the flypast used more sustainable aviation fuels for its tricolour smoke trails in red, white and blue. The thousands-strong crowd cheered \"Hooray\" as the King waved to the crowd. The King's real birthday is on 14 November."
    },
    {
        "title": "Why many victims will welcome a national inquiry into grooming gangs",
        "description": "In 2019, nine men were jailed for raping and abusing two teenage girls living in a children's home in Bradford.",
        "url": "https://news.sky.com/story/why-many-victims-will-welcome-a-national-inquiry-into-grooming-gangs-13383713",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jason-farrell-fiona-goddard_6942070.png?20250614183142",
        "type": "Home",
        "Author": "Jason Farrell",
        "Date Published": "2025-06-14 16:39:00",
        "Headline": "Victims will want to understand why, so often, authorities fail to protect vulnerable girls, writes Sky's Jason Farrell.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n In 2019, nine men were jailed for raping and abusing two teenage girls living in a children's home in Bradford. One of the victims, Fiona Goddard, says more than 50 men raped her. When the government began to talk about offering councils money for local inquiries, Fiona hoped Bradford would be one of the first to take up the offer. But there didn't seem to be much enthusiasm.  The council was quick to point out that there had already been an independent case review into Fiona's case, along with four other victims. This, then, was Fiona's first reasoning for wanting a national inquiry: The council felt it had done all that needed to be done. Fiona didn't. The Independent review, published in July 2021, found that while in the children's home, Fiona \"went missing almost on a daily basis\". The police attitude was that she could look after herself - she was \"street-wise\". There was \"agreement by all agencies that Fiona was either at risk of Child Sexual Exploitation (CSE) or actively being sexually abused and exploited\". But \"this was not addressed by any single agency\". And \"when Fiona became pregnant at the age of 15, there was little curiosity or enquiry who the father was\". So, obvious failings were discovered. The predictable response was that lessons had been learned and new processes put in place. But no one seemed to be held accountable. Grooming gangs timeline: What happened, what inquiries there were and how Starmer was involved  Ms Goddard told Sky News: \"In my serious case review she [Jane Booth, the independent chair] found seven incidences at least, in them records that she found, of them not reporting sexual abuse or rape or assault, from as young as eight years old, and one of the incidences I literally turned up covered in blood and they didn't report it. \"That is not just misunderstanding a crime, that is making intentional decisions not to report the sexual abuse of a child.\" She adds: \"Let's not forget, these people still work within social services and the police force.\" Not only did this Independent review not satisfy Fiona, but it also didn't begin to reflect the levels and scale of abuse Fiona had experienced outside of Bradford. Asked where she was trafficked to, Fiona rattles off a list of cities. \"Blackburn, Rotherham, Rochdale, Birmingham, Edinburgh, Oldham - never Telford, I'd never even heard of Telford until it all came out if I'm honest - Nottingham, Oxford.\" Then she remembers she didn't go to Oxford - men from Oxford came to her - but the point is made. Local enquiries can't possibly begin to explore the networks of men who traffic women, often down routes of drug trafficking being done by the same gangs. Bradford Council told Sky News it contributed to the national Independent Inquiry into Child Sexual Abuse (IICSA) and published more than 70 reports where child sexual exploitation was discussed and has implemented findings from the independent local review which included Fiona's case. Fiona believes there are numerous connections leading back to Bradford - but victims from each city often believe their abusers are at the centre of it. We've spoken to grooming victims across the country, and in 2022, a case was reopened in Humberside after a Sky News investigation, where we found diary entries, texts, photos, and school reports all indicating that teenage victims had been abused. Read more on this story:Telford child abuse victims speak outWhat we know about grooming gangs, from the dataThe women who blew whistle on Rotherham One of them was \"Anna\", who also wants a national inquiry. She believes there is a national pattern of police forces not believing victims or even criminalising them instead. Obtaining her own police records using a Subject Access Request (SAR), Anna found officers' attitudes towards her were similar to what we heard with Fiona in Bradford, blaming her abuse and injuries on \"lifestyle choices of her own\". Anna said: \"Every time I look at my Subject Access Request, I still think it's shocking. \"It was the same sort of terminology - lifestyle choices, liar, attention seeker, and the majority of it was negative. \"It was really rare that I'd come across something where they were actually listening or they were concerned.\" Humberside Police told us: \"As the investigation is active, it is imperative we protect its integrity; as such are unable to comment on aspects of the investigation as this could impact or jeopardise any criminal or judicial proceedings.\" But it is years now since Anna first reported her abuse, and she believes the police have left it too late to gather evidence. She told Sky News: \"I think it's either happening everywhere, or young people have been taken everywhere. \"I think the attitudes of the professionals, the police, social services, from what I've heard and seen, they seem very similar in every area.\" The government-commissioned rapid review by Baroness Casey is due to be published next week and is expected to call for a national inquiry into grooming gangs. Like Anna and Fiona, many victims will welcome Sir Keir Starmer's early response accepting the recommendation. They will want the inquiry to probe into the operations of the perpetrators - who they are and how they are connected. But they will also want clear accountability of the people and organisations who failed to act when they reported their abuse - and an understanding of why, so often, authorities fail to protect these vulnerable girls."
    },
    {
        "title": "Sir Keir Starmer to launch new national inquiry into grooming gangs",
        "description": "Sir Keir Starmer is to launch a new national inquiry into grooming gangs.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-launch-new-national-inquiry-into-grooming-gangs-13383695",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-downing-street_6939164.jpg?20250611115140",
        "type": "UK",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-14 15:48:00",
        "Headline": "Ahead of the G7 summit in Canada, Sir Keir Starmer tells reporters he will commission a national inquiry into grooming gangs on the recommendation of Baroness Casey.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer is to launch a new national inquiry into grooming gangs. It comes after a government-requested audit into the scale of grooming gangs across the country concluded a nationwide probe was necessary. The prime minister previously argued a national inquiry was not necessary, but has changed his view following an audit into group-based child sexual abuse led by Baroness Casey, which is set to be published next week. \"[Baroness Casey's] position when she started the audit was that there was not a real need for a national inquiry over and above what was going on,\" he told reporters travelling with him to the G7 summit in Canada. \"She has looked at the material... and she has come to the view that there should be a national inquiry on the basis of what she has seen. \"I have read every single word of her report, and I am going to accept her recommendation. That is the right thing to do on the basis of what she has put in her audit. \"I asked her to do that job to double check on this; she has done that job for me, and having read her report... I shall now implement her recommendations.\" Grooming gangs timeline: What happened, what inquiries there were and how Starmer was involved  The near 200-page report is to be published next week and is expected to warn that white British girls were \"institutionally ignored for fear of racism\". One person familiar with the report said it details the institutional failures in treating young girls and cites a decade of lost action from the Jay Review, set up in 2014 to investigate grooming gangs in Rotherham. The report is also expected to link illegal immigration with the exploitation of young girls. The government had initially resisted a new inquiry, insisting that it first wanted to implement recommendations from previous inquiries, such as the Jay Review, into child sexual exploitation. It also allowed five councils to set up their own investigations into their communities rather than hold a national inquiry.  The grooming gang scandal came back into the headlines at the beginning of the year after Elon Musk attacked Sir Keir and safeguarding minister Jess Philips for failing children. The prime minister and Ms Phillips hit back, with Sir Keir citing his record of prosecuting abusers as director of public prosecutions, while Ms Phillips has long been a campaigner against domestic violence. At the time, she told Sky News that Mr Musk's claims were \"ridiculous\" and that she would be led by what victims have to say, not him. Following the row between the tech billionaire and the UK government, the prime minister asked Baroness Casey to conduct an audit of all the evidence to see if a national inquiry was required. Read more on this story:Telford child abuse victims speak outWhat we know about grooming gangs, from the dataThe women who blew whistle on Rotherham Kemi Badenoch, the Conservative leader, said: \"Keir Starmer doesn't know what he thinks unless an official report has told him so. \"Just like he dismissed concerns about the winter fuel payment and then had to U-turn, just like he needed the Supreme Court to tell him what a woman is, he had to be led by the nose to make this correct decision here. \"I've been repeatedly calling for a full national inquiry since January. It's about time he recognised he made a mistake and apologise for six wasted months. \"But this must not be the end of the matter. There are many, many more questions that need answering to ensure this inquiry is done properly and quickly. \"Many survivors of the grooming gangs will be relieved that this is finally happening, but they need a resolution soon, not in 10 years' time. Justice delayed is justice denied.\""
    },
    {
        "title": "Air India plane crash victim's son says he'll relive his mother's last moments 'to the day I die'",
        "description": "The son of an Air India plane crash victim, who was sitting one row behind the man who survived, has told Sky News he will relive \"her last moments\" until the day he dies.",
        "url": "https://news.sky.com/story/air-india-plane-crash-victims-son-says-hell-relive-his-mothers-last-moments-to-the-day-i-die-13383642",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chirag-mahesh-patel_6941938.jpg?20250614153422",
        "type": "UK",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-14 14:14:00",
        "Headline": "Manju Mahesh Patel had been staying in Ahmedabad to do charity work at a temple, and had been looking forward to returning to the UK to see her grandchildren.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The son of an Air India plane crash victim, who was sitting one row behind the man who survived, has told Sky News he will relive \"her last moments\" until the day he dies.  Manju Mahesh Patel, 79, was on the London Gatwick-bound plane when it crashed in Ahmedabad shortly after take-off on Thursday. She was sitting in seat 12D on flight AI 171, the row behind the only person to survive the crash who was sitting in 11A. In an interview with Sky News, Chirag Mahesh Patel, Manju's son, said he hopes his mother's death was \"instant\" and \"painless\". \"To the day I die I will think, 'what were her last moments?',\" he said. Pointing to a framed family photograph of Ms Patel at the family home, he added: \"I want to remember mum like this. \n                  Air India plane crash: Families in Ahmedabad endure agonising wait for victims' bodies\n                 \n                  Air India plane crash: Sole survivor recounts moments before deadly impact\n                 \n                  Air India crash survivor told me he's okay - his escape is nothing short of a miracle\n                 \"I don't want to have to go and identify a burnt corpse, your own parent. How does someone, how do you ever get over that? That will be with me, that's with me for life.\" Ms Patel had been staying in Ahmedabad for the past few months doing charity work at a temple. She was due to be picked up by her son at Gatwick on Thursday night. Read more on Air India crash:Air India's lone survivor is nothing short of miracleGloucester family among deadEverything we know about the crash In tears, Mr Patel described his mother as \"very strong\" and a woman \"who really loved her family\". \"The thing about my mum,\" he said, \"is her bond with her faith. It's unbreakable. \"She had ultimate faith… and in times of stress she would always say God's name… So, I know that upon take-off, I know that she was saying his name.\"  Mr Patel said that when he realised his mother was on the flight it was just \"a normal day\" and \"it didn't seem real\". He said the last time he had spoken to her he had reminded her to take her diabetes medicine and had then missed a call from her at 4am to say she had arrived at the airport. He described \"the most heartbreaking thing\" was how much Ms Patel was looking forward to seeing her grandchildren, saying \"it was everything to her\". She had told him she packed her suitcase with lollipops for her six-year-old grandson, and special crisps for her 15-year-old older grandchild. \"It's unimaginable even in my worst nightmare,\" he said. \"And the thing that kills me… is she was so looking forward to seeing us… she kept saying I bought this for you, I bought that, I bought the things for the kids.\" Mr Patel and his wife are due to fly to India on Saturday night to provide a DNA sample to help identify his mother's remains. He expressed his anger at what he called a \"disgusting\" and \"appalling\" lack of communication from Air India - which he said passed his details to a hospital but never contacted him personally. He described feeling \"neglected\" by the airline, which he said would only offer him an Air India flight - and no help organising accommodation. Mr Patel said he refused to get on the Gatwick flight back to Ahmedabad and has booked with another provider to travel to India instead. \"I said [to the airline] all of this happened on Thursday, you're telling me on Friday afternoon, do you want that flight this evening? That one crashed? The one coming back where 172 goes out? They asked do you want Air India 172? I said how can you ask me that. My mum just died on Air India.\" Mr Patel said he wanted \"answers\" and transparency in any air accident investigation. Air India said in a statement: \"Air India stands in solidarity with the families of the passengers who tragically lost their lives in the recent accident. Our teams on the ground are doing everything possible to extend care and support during this incredibly difficult time. \"As part of our continued efforts, Air India will be providing an interim payment of ₹25 lakh or approximately £21,000 each to the families of the deceased and to the survivor, to help address immediate financial needs. This is in addition to the ₹1 crore or approximately £85,000 support already announced by Tata Sons. \"All of us at Air India are deeply saddened by this loss. We mourn with the families, loved ones, and everyone affected.\"  The company's chief executive and managing director Campbell Wilson said in a video message posted on social media that over 200 \"trained caregivers\" were now in place to offer dedicated assistance to families, along with counselling and other services. He said Air India was in the process of completing precautionary safety checks on Boeing 787 aircraft as directed by regulator the Directorate General of Civil Aviation (DGCA), which would \"be completed within the timelines prescribed by the regulator\". 👉 Listen to Sky News Daily on your podcast app 👈 Mr Wilson said he had also visited the crash site and said other members of the management team would remain present \"for as long as it takes\". The aircraft's data recorder, often referred to as a black box, has been recovered and will form part of the investigation into the worst aviation crash in a decade. By Lisa Dowd, Midlands correspondent, in Derby It was an emotional service at Derby's Geeta Bhawan Hindu temple, as dozens of friends, colleagues and neighbours gathered to remember Dr Prateek Joshi, his wife Komi, their daughter Miraya, and twin sons Nakul and Pradyut. Some wiped tears from their eyes, as a colleague was asked spontaneously to pay tribute to Dr Joshi, who had been bringing his family to live in the city, when the Air India flight they were on crashed seconds after take-off. \"He was too young, too much still to give, too much still to be done, too much to offer,\" his friend told worshippers. \"He was taken from us in a very cruel and abrupt way, and his family as well, and we all think about his family back in India who is missing a son, missing a daughter-in-law and missing all their grandchildren who they'll never see growing up.\" Derby South MP Catherine Atkinson said Dr Joshi, who was a radiologist at the Royal Derby hospital, had been \"contributing to our NHS and the health of so many in our city and beyond\". She said his wife was a pathologist who had resigned from her job in India. \"I won't forget the photograph of them on the plane, full of optimism about their new adventure,\" she said, as her voice broke. \"The losses make us all hug our families and loved ones a little closer and remind us how precious our time together is.\" Dr Joshi was described as a \"warm, smiling man, full of joy\" who enjoyed walking in the Peak District and who had discovered \"a love of fish and chips\". His neighbour and colleague Manoj Ramtohal told Sky News Dr Joshi always had time for people. \"He was very caring and very polite, very friendly, you couldn't meet a better man than Prateek,\" he said. \"We lost a very, very talented doctor.\""
    },
    {
        "title": "See the best pictures from Trooping the Colour - as King pays tribute to plane crash victims",
        "description": "The King has marked his official birthday at the Trooping the Colour parade, wearing a black armband&#160;in tribute to those killed in the Air India plane crash.",
        "url": "https://news.sky.com/story/see-the-best-pictures-from-trooping-the-colour-as-king-pays-tribute-to-plane-crash-victims-13383565",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-trooping-the-colour_6941851.jpg?20250614131835",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-14 10:00:00",
        "Headline": "Prince George, Princess Charlotte and Prince Louis appeared with their mother in a carriage, while more than 1,300 soldiers took part in the parade. ",
        "Content": " The King has marked his official birthday at the Trooping the Colour parade, wearing a black armband in tribute to those killed in the Air India plane crash. More than 1,300 soldiers took part in the ceremony at Horse Guards Parade in Whitehall. The event has marked the official birthday of the UK monarch on the second Saturday of June for more than 260 years. The King previously said he was \"desperately shocked\" at the aviation disaster that claimed the lives of 270 people, including more than 50 British nationals. The 76-year-old King will lead the nation in a minute's silence, with black armbands worn by senior royals, including the Prince of Wales, the Princess Royal and the Duke of Edinburgh. The Queen, the Princess of Wales and the Duchess of Edinburgh were among the royal party watching the event with Prince George, Princess Charlotte and Prince Louis. The Prime Minister, Keir Starmer, and his wife, Victoria watched the event, as did singer-songwriter Matt Goss, who rose to fame in the mid-1980s.  A Buckingham Palace spokesperson said the King requested amendments to the Trooping the Colour programme \"as a mark of respect for the lives lost, the families in mourning and all the communities affected by this awful tragedy\". In 2017, Trooping was held a few days after the Grenfell Tower blaze and the loss of life was marked by a minute's silence, a decision taken by Queen Elizabeth II. Away from performing ceremonial duties, the soldiers taking part in the military display are fighting soldiers. The stands around Horse Guards Parade were filled with around 8,000 wives, girlfriends and the parents of the guardsmen and officers on parade. The colour, or regimental flag, trooped this year was the King's Colour of Number 7 Company, Coldstream Guards, a prestigious regiment known as the sovereign's bodyguard. It celebrates its 375th anniversary this year. Royal correspondent As the carriages left Buckingham Palace, and you looked closely, the difference in this parade was immediately apparent.  Black armbands on all of the senior royals in military uniforms, including the King, a request from the monarch as a mark of respect to those who died in the Air India crash and those who mourn them. Another alteration was made after they’d inspected the guard on Horse Guards parade with a minute’s silence. We know that King Charles can be an emotional and empathic man, but this was a reminder of how much he appreciates the role the royal family can play in those moments when it’s right that the nation takes time to remember. The rest of the parade stepped off as normal, only right after the months of rehearsals the soldiers and musicians go through.  The traditional fly past also still took place along with the annual balcony moment. After the horror of world events this week it felt like a lighter moment of distraction, for those who enjoy this kind of pageantry.  Prince Louis with the final wave, from a family mindful of their position and what they can do in more challenging times. The day ended with the royal family gathering on Buckingham Palace's balcony for the gun salutes in Green Park and the traditional RAF flypast. Led by the Red Arrows, this year for the first time, the flypast used more sustainable aviation fuels for its tricolour smoke trails in red, white and blue. The thousands-strong crowd cheered \"Hooray\" as the King waved to the crowd. The King's real birthday is on 14 November."
    },
    {
        "title": "Weather warnings: 30,000 lightning strikes hit UK - with roads flooded and landslip disrupting trains",
        "description": "Roads have been flooded and a landslip has disrupted trains as the UK was hit by tens of thousands of lightning strikes during thunderstorms.",
        "url": "https://news.sky.com/story/thunderstorms-and-flooding-expected-to-follow-hottest-day-of-the-year-13383515",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-thunderstorm-lightning_6936212.jpg?20250607025921",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-14 06:30:00",
        "Headline": "Scientists say they expect more heavy downpours as the climate changes.",
        "Content": " Roads have been flooded and a landslip has disrupted trains as the UK was hit by tens of thousands of lightning strikes during thunderstorms. It follows the hottest day of the year on Friday, which saw a high of 29.4C (84.9F) in Santon Downham in Suffolk. The Met Office had issued an amber weather warning - across the South West, North East and North of England, Wales and much of Scotland - which expired at 6pm on Saturday. Check the weather forecast where you are It said there had been more than 30,000 lightning strikes during the night, with the \"vast majority\" over the sea. The Met Office had warned some areas could see 30-50mm of rain within a few hours, while a few locations could reach up to 80mm. At the same time, strong wind gusts and hail accompanying the storms had the potential to bring road flooding, difficult driving conditions, power cuts, and flooding to homes and businesses. The Environment Agency urged the public not to drive through flood water, reminding drivers that \"just 30cm of flowing water is enough to move your car\". A further yellow warning was in force across the eastern half of Northern Ireland from 6am to 6pm on Saturday, while a similar warning had been in place across the South East of England overnight, following an amber alert on Friday. Kent experienced heavy rainfall overnight, with flooded roads in parts of Dover, while a fire in a residential building in St Leonards-on-Sea on Friday night was likely caused by a lightning strike, the East Sussex Fire and Rescue Service said. Devon had received five flood warnings overnight from the Environment Agency, alongside 46 flood alerts in the South West, South East, and Midlands. These are now no longer in place. A further six flood alerts were in place by Natural Resources Wales in South Wales - but these have since been lifted. National Rail said a landslip had stopped all services between Exeter St Davids and Okehampton, with the weather conditions meaning it was not safe for engineers to reach the site in the afternoon. Other rail operators also warned customers to check for updates on services on Saturday morning. Heathrow Airport apologised to passengers late on Friday night for flights delayed by \"adverse weather conditions\". Sky News weather producer Steff Gaulter said: \"The most active thunderstorms are over parts of Wales, Northern Ireland, Northern England and Scotland, and some are still bringing localised downpours and strong winds. \"The storms will continue northwards, becoming largely confined to Northern Ireland and Scotland by the afternoon. Elsewhere will see a mixture of sunshine and showers, with the showers tending to ease during the day. \"Then from tomorrow an area of high pressure will start to stretch towards us, and the weather next week is looking far calmer and quieter.\" Read more from Sky News:Is Ibiza at breaking point?Why is Ballymena the site of riots? Despite the risk of heavy showers and thunderstorms, not everyone will see rain during the day, with the driest and brightest weather expected in the South East, which will remain very warm. The UK Health Security Agency (UKHSA) has issued its first yellow heat-health alert of the year, active until 8am on Sunday in the east of England, East Midlands, London, and the South East. Under the UKHSA and the Met Office's weather-health alerting system, a yellow alert means there could be an increased use of healthcare services by vulnerable people. A yellow alert warns of a possible spike in vulnerable people accessing healthcare, and health risks for the over-65s and those with conditions such as respiratory and cardiovascular diseases. While scientists have not assessed the role of global warming in this short-term event, in general they expect more heavy downpours as the climate changes. That's largely because hotter air can hold more moisture and so releases more water when it rains."
    },
    {
        "title": "Two skydivers die in 'tragic accident' at Devon airfield",
        "description": "Two skydivers have died at an airfield in Devon.",
        "url": "https://news.sky.com/story/two-skydivers-die-in-tragic-accident-at-devon-airfield-13383625",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-dunkeswell-aerodrome_6941908.jpg?20250614144419",
        "type": "UK",
        "Author": "Megan Harwood-Baynes, news reporter",
        "Date Published": "2025-06-14 13:28:00",
        "Headline": "Two people were confirmed dead at the scene after emergency services were called to Dunkeswell Aerodrome.",
        "Content": "By Megan Harwood-Baynes, news reporter  Two skydivers have died at an airfield in Devon. Emergency services were called to the area of Dunkeswell Aerodrome at around 1pm on Friday 13 June. Two people were confirmed dead at the scene, and their families have been informed. \"Scene guards remain in place at the airfield and inquiries are ongoing by the relevant agencies,\" a spokesperson for Devon and Cornwall Police told Sky News, urging anyone who may have information that could help to come forward. The Civil Aviation Authority said it was aware of the incident, but could not comment further. The Air Accident Investigation Branch said the incident would be the matter for British Skydiving, which has not responded to a request for comment. But in a statement sent to its members, and seen by DevonLive, chief executive Robert Gibson confirmed it had been \"notified of a tragic accident in which two jumpers lost their lives\". \"Our deepest condolences go to their families, friends and the entire skydiving community,\" it said. A British Skydiving board of inquiry will investigate the accident, it added."
    },
    {
        "title": "Why many victims will welcome a national inquiry into grooming gangs",
        "description": "In 2019, nine men were jailed for raping and abusing two teenage girls living in a children's home in Bradford.",
        "url": "https://news.sky.com/story/why-many-victims-will-welcome-a-national-inquiry-into-grooming-gangs-13383713",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jason-farrell-fiona-goddard_6942070.png?20250614183142",
        "type": "UK",
        "Author": "Jason Farrell",
        "Date Published": "2025-06-14 16:39:00",
        "Headline": "Victims will want to understand why, so often, authorities fail to protect vulnerable girls, writes Sky's Jason Farrell.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n In 2019, nine men were jailed for raping and abusing two teenage girls living in a children's home in Bradford. One of the victims, Fiona Goddard, says more than 50 men raped her. When the government began to talk about offering councils money for local inquiries, Fiona hoped Bradford would be one of the first to take up the offer. But there didn't seem to be much enthusiasm.  The council was quick to point out that there had already been an independent case review into Fiona's case, along with four other victims. This, then, was Fiona's first reasoning for wanting a national inquiry: The council felt it had done all that needed to be done. Fiona didn't. The Independent review, published in July 2021, found that while in the children's home, Fiona \"went missing almost on a daily basis\". The police attitude was that she could look after herself - she was \"street-wise\". There was \"agreement by all agencies that Fiona was either at risk of Child Sexual Exploitation (CSE) or actively being sexually abused and exploited\". But \"this was not addressed by any single agency\". And \"when Fiona became pregnant at the age of 15, there was little curiosity or enquiry who the father was\". So, obvious failings were discovered. The predictable response was that lessons had been learned and new processes put in place. But no one seemed to be held accountable. Grooming gangs timeline: What happened, what inquiries there were and how Starmer was involved  Ms Goddard told Sky News: \"In my serious case review she [Jane Booth, the independent chair] found seven incidences at least, in them records that she found, of them not reporting sexual abuse or rape or assault, from as young as eight years old, and one of the incidences I literally turned up covered in blood and they didn't report it. \"That is not just misunderstanding a crime, that is making intentional decisions not to report the sexual abuse of a child.\" She adds: \"Let's not forget, these people still work within social services and the police force.\" Not only did this Independent review not satisfy Fiona, but it also didn't begin to reflect the levels and scale of abuse Fiona had experienced outside of Bradford. Asked where she was trafficked to, Fiona rattles off a list of cities. \"Blackburn, Rotherham, Rochdale, Birmingham, Edinburgh, Oldham - never Telford, I'd never even heard of Telford until it all came out if I'm honest - Nottingham, Oxford.\" Then she remembers she didn't go to Oxford - men from Oxford came to her - but the point is made. Local enquiries can't possibly begin to explore the networks of men who traffic women, often down routes of drug trafficking being done by the same gangs. Bradford Council told Sky News it contributed to the national Independent Inquiry into Child Sexual Abuse (IICSA) and published more than 70 reports where child sexual exploitation was discussed and has implemented findings from the independent local review which included Fiona's case. Fiona believes there are numerous connections leading back to Bradford - but victims from each city often believe their abusers are at the centre of it. We've spoken to grooming victims across the country, and in 2022, a case was reopened in Humberside after a Sky News investigation, where we found diary entries, texts, photos, and school reports all indicating that teenage victims had been abused. Read more on this story:Telford child abuse victims speak outWhat we know about grooming gangs, from the dataThe women who blew whistle on Rotherham One of them was \"Anna\", who also wants a national inquiry. She believes there is a national pattern of police forces not believing victims or even criminalising them instead. Obtaining her own police records using a Subject Access Request (SAR), Anna found officers' attitudes towards her were similar to what we heard with Fiona in Bradford, blaming her abuse and injuries on \"lifestyle choices of her own\". Anna said: \"Every time I look at my Subject Access Request, I still think it's shocking. \"It was the same sort of terminology - lifestyle choices, liar, attention seeker, and the majority of it was negative. \"It was really rare that I'd come across something where they were actually listening or they were concerned.\" Humberside Police told us: \"As the investigation is active, it is imperative we protect its integrity; as such are unable to comment on aspects of the investigation as this could impact or jeopardise any criminal or judicial proceedings.\" But it is years now since Anna first reported her abuse, and she believes the police have left it too late to gather evidence. She told Sky News: \"I think it's either happening everywhere, or young people have been taken everywhere. \"I think the attitudes of the professionals, the police, social services, from what I've heard and seen, they seem very similar in every area.\" The government-commissioned rapid review by Baroness Casey is due to be published next week and is expected to call for a national inquiry into grooming gangs. Like Anna and Fiona, many victims will welcome Sir Keir Starmer's early response accepting the recommendation. They will want the inquiry to probe into the operations of the perpetrators - who they are and how they are connected. But they will also want clear accountability of the people and organisations who failed to act when they reported their abuse - and an understanding of why, so often, authorities fail to protect these vulnerable girls."
    },
    {
        "title": "Man arrested in UK after two people shot dead in Spain",
        "description": "A man has been arrested in the UK over two fatal shootings in Spain.",
        "url": "https://news.sky.com/story/man-arrested-in-uk-after-two-people-shot-dead-in-spain-13383513",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-monaghans-fuengirola_6933209.jpg?20250603191317",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-06-14 06:20:00",
        "Headline": "A 44-year-old man could be extradited to Spain after he was arrested in the Liverpool area on behalf of Spanish authorities.",
        "Content": "A man has been arrested in the UK over two fatal shootings in Spain. Merseyside Police said the 44-year-old man was detained on Friday and appeared at Westminster Magistrates' Court this morning. He was arrested in the Liverpool area on behalf of Spanish authorities and the extradition process could see him returned to Spain. The suspect, from Merseyside, has been remanded in custody to appear in court at a later date, the force said. Police said the arrest was in connection with a double shooting on 31 May. On that date, two Scottish men - Eddie Lyons Jnr and Ross Monaghan - were shot dead by a hooded gunman outside an Irish pub in Fuengirola. The attack took place around 11pm, when a car pulled up outside the bar and a masked man got out, before shooting two men inside. The gunman then fled in the car and both men died at the scene. Earlier this month, Police Scotland said there was \"no intelligence to suggest\" the double shooting was linked to recent criminal attacks in Scotland being investigated as part of Operation Portaledge. The operation is investigating a suspected gang feud linked with a number of shootings, firebombings and assaults in the Glasgow and Edinburgh areas since March. More than 40 people have been arrested in connection with the incidents."
    },
    {
        "title": "Harrods plots legal action against estate of former owner al-Fayed",
        "description": "Harrods is preparing to take legal action against the estate of its former owner, Mohamed al-Fayed, as the multimillion-pound legal bill for compensating his sexual abuse victims continues to escalate.",
        "url": "https://news.sky.com/story/harrods-plots-legal-action-against-estate-of-former-owner-al-fayed-13383546",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-fayed-harrods_6941750.jpg?20250614092013",
        "type": "UK",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-14 08:22:00",
        "Headline": "The Knightsbridge department store, which has been owned by Qatari royals since 2010, plans to go to the High Court next week to replace the executors of Mohamed al-Fayed’s estate, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods is preparing to take legal action against the estate of its former owner, Mohamed al-Fayed, as the multimillion-pound legal bill for compensating his sexual abuse victims continues to escalate. Sky News has learnt that the Knightsbridge department store, which has been owned by a Qatari sovereign wealth fund since 2010, plans to file a so-called passing-over application in the High Court as early as next week. The intention of the application is to secure the removal of Mr al-Fayed's estate's current executors, and replace them with professional executors to administer it instead. Professional executors would be expected to investigate the assets and liabilities of the estate, while Harrods insiders claimed that the current executors - thought to be close family members of the deceased billionaire - had \"ignored\" correspondence from its lawyers. Sources close to Harrods said the passing-over application paved the way for it to potentially seek to recover substantial sums from the estate of the Egyptian tycoon as it contends with a compensation bill likely to run to tens of millions of pounds. In a statement issued to Sky News on Saturday, a Harrods spokesperson said: \"We are considering legal options that would ensure that no doors are closed on any future action and that a route to compensation and accountability from the Fayed estate remains open to all.\" Mr al-Fayed is believed to have raped or sexually abused hundreds of women during his 25-year tenure as the owner of Harrods. \n                  Harrods challenges survivors' law firm's compensation cut\n                 \n                  Harrods revises compensation payouts for al Fayed abuse victims\n                 \n                  Harrods proposes six-figure payouts to victims of al Fayed abuse\n                 He died in 2023, since when a torrent of details of his abuse have been made public by many of his victims. Earlier this year, Sky News revealed details of the compensation scheme designed by Harrods to award six-figure sums to women he abused. In a form outlining the details of the Harrods redress scheme overseen by MPL Legal, which is advising the department store, it referred to the potential \"for Harrods to recover compensation paid out under this Scheme from Mohamed Fayed's estate\". \"You are not obliged to assist with any such claim for recovery,\" the form told potential claimants. \"However, if you would be willing to assist Harrods including potentially by giving evidence against Fayed's estate, please indicate below.\" This weekend, there appeared to be confusion about the legal representation of Mr al-Fayed's estate. In March, the BBC reported that Fladgate, a UK-based law firm, was representing it in an article which said that women who worked for him as nannies and private air stewards were preparing to file legal claims against the estate. This weekend, however, a spokesman for Fladgate declined to comment on whether it was acting for Mr al-Fayed's estate, citing confidentiality restrictions. A source close to the law firm, meanwhile, insisted that it was not acting for the estate. KP Law, another law firm acting for some al-Fayed abuse survivors, has criticised the Harrods-orchestrated process, but has itself faced questions over proposals to take up to 25% of compensation awards in exchange for handling their cases. Harrods insiders said there was a growing risk that Mr al-Fayed's estate would not be responsibly administered given that the second anniversary of his death was now approaching. They added that as well as Harrods itself seeking contribution for compensation paid out for Mr al-Fayed's abuse, its legal action would also potentially open way for survivors to claim directly against the estate. Victims with no direct connection to Harrods are not eligible for any compensation through the store's own redress scheme. Even if Harrods' passing-over application was approved by the High Court, any financial recovery for the department store would be subject to a number of additional legal steps, sources said. \"The passing-over action would achieve the goals of acknowledgement and accountability from the estate for survivors who don't have the resource to undertake a passing-over application themselves,\" an insider said this weekend."
    },
    {
        "title": "Nuclear threat wasn't the only reason Israel attacked Iran",
        "description": "Why did Israel attack Iran? Certainly, it was worried about the threat of a nuclear weapon being developed. ",
        "url": "https://news.sky.com/story/nuclear-threat-wasnt-the-only-reason-israel-attacked-iran-13383624",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-tehran-iran_6940984.jpg?20250613110448",
        "type": "World",
        "Author": "Adam Parsons",
        "Date Published": "2025-06-14 13:27:00",
        "Headline": "Hours after Israel launched its first, surprise attack, the message from Benjamin Netanyahu couldn't be clearer - Iranians, he said, should overthrow their \"evil and oppressive regime\". ",
        "Content": "\n          Europe correspondent\n              @adamparsons\n  Why did Israel attack Iran? Certainly, it was worried about the threat of a nuclear weapon being developed.  But it's also becoming clearer that there was a second reason - that this is about laying the ground for regime change in Tehran. Follow latest: Israel warns 'Tehran will burn' if it continues Because, hours after his country launched its first, surprise attack, the message from Benjamin Netanyahu couldn't be clearer - Iranians, he said, should overthrow their \"evil and oppressive regime\". He said Israel's attack would \"pave the way for you to achieve your freedom\". On the one hand, he would say that, wouldn't he? The Iranian government does not recognise the legitimacy of the Israeli state and has called for its destruction, while funding proxy groups that have attacked Israel - including Hamas, Lebanese Hezbollah, and the Houthis in Yemen. But perhaps this time there is more than just wishful thinking. Although it's very hard to gauge the level of opposition in Iran, it seems likely the majority of the population of 90 million are at least disenchanted with the regime.  Living standards have fallen and supplies are running short. While tens of billions of dollars have been spent on a nuclear programme, electricity is being rationed and cooking gas is running low. Priority is being given to those who are close to the regime, notably the members of the Islamic Revolutionary Guard Corps (IRGC), a branch of the Iranian army that is fiercely loyal to the ruling regime. The IRGC are crucial in propping up Ayatollah Ali Khamenei, the country's 86-year-old supreme leader. Not only do they offer military power, but also domestic surveillance, intimidation and secret policing in order to stifle dissent. So for any opposition to emerge, let alone flourish, the IRGC would need to be degraded - and that is precisely what Israel has done, targeting its senior leaders as well as bases. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 The regular army, so far, has been left alone. Israel's gamble is that a majority of the rest of the military harbour the same dislike of the IRGC as the wider population. It was no coincidence that Netanyahu quoted the expression \"woman, life, freedom\", which was a rallying call during the 2022 protests in Iran - eventually suppressed by the IRGC. It is very hard to believe that a coherent, public opposition movement will burst into life any time soon. Iranians are well aware their regime will respond with brutality against any attempted uprising.  Instead, dissidents seem to be biding their time and waiting to see if Israel continues its assaults, and whether they can sense genuine signs that the regime is starting to struggle to maintain control. If the cracks emerge, then regime change - or at least an attempt - is possible. Possible, but not certain. \"They will do anything to stay in power, and when other uprisings have happened, they've been successfully suppressed,\" one Middle East diplomat tells me. \"And there is no unifying leader ready to step in. Even if there is regime change, it could be a military takeover rather than a popular uprising.\" Read more:All we know about military chiefs killed by IsraelWhat are Iran's military capabilities? And that leaves one final question - if Khamenei did feel his grip on power was failing, might he still have the time, desire and power to resort to final, desperate military actions? The truth is, we don't know. At the moment, the Middle East is a region full of unanswerable, high-risk questions."
    },
    {
        "title": "Nigeria: At least 100 killed in gun attack in Benue state village, Amnesty International claims",
        "description": "At least 100 people have been killed in a gun attack in a village in north-central Nigeria, Amnesty International has claimed.",
        "url": "https://news.sky.com/story/nigeria-at-least-100-killed-in-gun-attack-in-benue-state-village-amnesty-international-claims-13383814",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-benue-nigeria_6942279.jpg?20250614221356",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-14 20:43:00",
        "Headline": "The human rights group said the attack took place between late Friday and early Saturday in a village in Nigeria's Benue state.",
        "Content": "At least 100 people have been killed in a gun attack in a village in north-central Nigeria, Amnesty International has claimed. The human rights group's branch in Nigeria said the attack occurred between Friday evening and Saturday morning in Yelewata, a community in the Guma area of Benue state. \"Many families were locked up and burnt inside their bedrooms,\" the group said in a post on X. \"So many bodies were burnt beyond recognition.\" It said hundreds of people were injured and were without adequate medical care, while dozens of others were missing. A police spokesperson in Benue confirmed that an attack took place in Yelewata but did not specify how many people had died. Amnesty noted in a statement that there had been an \"alarming escalation of attacks across Benue state where gunmen have been on a killing spree with utter impunity\". \"The Nigerian authorities' failure to stem the violence is costing people's lives and livelihoods, and without immediate action many more lives may be lost,\" it added. \n                  At least 150 killed after heavy flooding in Nigeria\n                 \n                  Nigeria floods: At least 110 dead as heavy flooding submerges thousands of houses\n                 \n                  Shell in court over claims of oil pollution in Nigeria\n                 Last month, gunmen, believed to be herders, killed at least 20 people in the Gwer West area of Benue. In April, at least 40 people were killed in the neighbouring state of Plateau. Benue is in Nigeria's 'middle belt', a region where the majority Muslim north meets the largely Christian south. Read more from Sky News:Why Ballymena became the site of anti-immigration riotsWhy many victims will welcome a national inquiry into grooming gangsNuclear threat wasn't the only reason Israel attacked Iran Attacks are common in Nigeria's northern regions, where local herders and farmers often clash over limited access to land and water. Farmers accuse the herders, mostly of Fulani origin, of grazing their livestock on their farms and destroying their produce. The herders insist that the lands are grazing routes that were first backed by law in 1965, five years after the country gained its independence."
    },
    {
        "title": "Air India plane crash victim's son says he'll relive his mother's last moments 'to the day I die'",
        "description": "The son of an Air India plane crash victim, who was sitting one row behind the man who survived, has told Sky News he will relive \"her last moments\" until the day he dies.",
        "url": "https://news.sky.com/story/air-india-plane-crash-victims-son-says-hell-relive-his-mothers-last-moments-to-the-day-i-die-13383642",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-chirag-mahesh-patel_6941938.jpg?20250614153422",
        "type": "World",
        "Author": "Adele Robinson",
        "Date Published": "2025-06-14 14:14:00",
        "Headline": "Manju Mahesh Patel had been staying in Ahmedabad to do charity work at a temple, and had been looking forward to returning to the UK to see her grandchildren.",
        "Content": "\n          News correspondent\n              @SkyNewsAdele\n The son of an Air India plane crash victim, who was sitting one row behind the man who survived, has told Sky News he will relive \"her last moments\" until the day he dies.  Manju Mahesh Patel, 79, was on the London Gatwick-bound plane when it crashed in Ahmedabad shortly after take-off on Thursday. She was sitting in seat 12D on flight AI 171, the row behind the only person to survive the crash who was sitting in 11A. In an interview with Sky News, Chirag Mahesh Patel, Manju's son, said he hopes his mother's death was \"instant\" and \"painless\". \"To the day I die I will think, 'what were her last moments?',\" he said. Pointing to a framed family photograph of Ms Patel at the family home, he added: \"I want to remember mum like this. \n                  Air India plane crash: Families in Ahmedabad endure agonising wait for victims' bodies\n                 \n                  Air India plane crash: Sole survivor recounts moments before deadly impact\n                 \n                  Air India crash survivor told me he's okay - his escape is nothing short of a miracle\n                 \"I don't want to have to go and identify a burnt corpse, your own parent. How does someone, how do you ever get over that? That will be with me, that's with me for life.\" Ms Patel had been staying in Ahmedabad for the past few months doing charity work at a temple. She was due to be picked up by her son at Gatwick on Thursday night. Read more on Air India crash:Air India's lone survivor is nothing short of miracleGloucester family among deadEverything we know about the crash In tears, Mr Patel described his mother as \"very strong\" and a woman \"who really loved her family\". \"The thing about my mum,\" he said, \"is her bond with her faith. It's unbreakable. \"She had ultimate faith… and in times of stress she would always say God's name… So, I know that upon take-off, I know that she was saying his name.\"  Mr Patel said that when he realised his mother was on the flight it was just \"a normal day\" and \"it didn't seem real\". He said the last time he had spoken to her he had reminded her to take her diabetes medicine and had then missed a call from her at 4am to say she had arrived at the airport. He described \"the most heartbreaking thing\" was how much Ms Patel was looking forward to seeing her grandchildren, saying \"it was everything to her\". She had told him she packed her suitcase with lollipops for her six-year-old grandson, and special crisps for her 15-year-old older grandchild. \"It's unimaginable even in my worst nightmare,\" he said. \"And the thing that kills me… is she was so looking forward to seeing us… she kept saying I bought this for you, I bought that, I bought the things for the kids.\" Mr Patel and his wife are due to fly to India on Saturday night to provide a DNA sample to help identify his mother's remains. He expressed his anger at what he called a \"disgusting\" and \"appalling\" lack of communication from Air India - which he said passed his details to a hospital but never contacted him personally. He described feeling \"neglected\" by the airline, which he said would only offer him an Air India flight - and no help organising accommodation. Mr Patel said he refused to get on the Gatwick flight back to Ahmedabad and has booked with another provider to travel to India instead. \"I said [to the airline] all of this happened on Thursday, you're telling me on Friday afternoon, do you want that flight this evening? That one crashed? The one coming back where 172 goes out? They asked do you want Air India 172? I said how can you ask me that. My mum just died on Air India.\" Mr Patel said he wanted \"answers\" and transparency in any air accident investigation. Air India said in a statement: \"Air India stands in solidarity with the families of the passengers who tragically lost their lives in the recent accident. Our teams on the ground are doing everything possible to extend care and support during this incredibly difficult time. \"As part of our continued efforts, Air India will be providing an interim payment of ₹25 lakh or approximately £21,000 each to the families of the deceased and to the survivor, to help address immediate financial needs. This is in addition to the ₹1 crore or approximately £85,000 support already announced by Tata Sons. \"All of us at Air India are deeply saddened by this loss. We mourn with the families, loved ones, and everyone affected.\"  The company's chief executive and managing director Campbell Wilson said in a video message posted on social media that over 200 \"trained caregivers\" were now in place to offer dedicated assistance to families, along with counselling and other services. He said Air India was in the process of completing precautionary safety checks on Boeing 787 aircraft as directed by regulator the Directorate General of Civil Aviation (DGCA), which would \"be completed within the timelines prescribed by the regulator\". 👉 Listen to Sky News Daily on your podcast app 👈 Mr Wilson said he had also visited the crash site and said other members of the management team would remain present \"for as long as it takes\". The aircraft's data recorder, often referred to as a black box, has been recovered and will form part of the investigation into the worst aviation crash in a decade. By Lisa Dowd, Midlands correspondent, in Derby It was an emotional service at Derby's Geeta Bhawan Hindu temple, as dozens of friends, colleagues and neighbours gathered to remember Dr Prateek Joshi, his wife Komi, their daughter Miraya, and twin sons Nakul and Pradyut. Some wiped tears from their eyes, as a colleague was asked spontaneously to pay tribute to Dr Joshi, who had been bringing his family to live in the city, when the Air India flight they were on crashed seconds after take-off. \"He was too young, too much still to give, too much still to be done, too much to offer,\" his friend told worshippers. \"He was taken from us in a very cruel and abrupt way, and his family as well, and we all think about his family back in India who is missing a son, missing a daughter-in-law and missing all their grandchildren who they'll never see growing up.\" Derby South MP Catherine Atkinson said Dr Joshi, who was a radiologist at the Royal Derby hospital, had been \"contributing to our NHS and the health of so many in our city and beyond\". She said his wife was a pathologist who had resigned from her job in India. \"I won't forget the photograph of them on the plane, full of optimism about their new adventure,\" she said, as her voice broke. \"The losses make us all hug our families and loved ones a little closer and remind us how precious our time together is.\" Dr Joshi was described as a \"warm, smiling man, full of joy\" who enjoyed walking in the Peak District and who had discovered \"a love of fish and chips\". His neighbour and colleague Manoj Ramtohal told Sky News Dr Joshi always had time for people. \"He was very caring and very polite, very friendly, you couldn't meet a better man than Prateek,\" he said. \"We lost a very, very talented doctor.\""
    },
    {
        "title": "Children orphaned as father killed in Air India plane crash days after mother dies",
        "description": "A father returning home after scattering his wife's ashes was among the victims of the Air India crash, leaving his two young children suddenly orphaned.",
        "url": "https://news.sky.com/story/father-returning-home-after-scattering-wifes-ashes-among-air-india-victims-13383517",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-india-plane-crash-arjun-patoliya_6941704.jpg?20250614034153",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-14 06:34:00",
        "Headline": "Two children have been left suddenly orphaned after their father died in the Air India crash. Arjun Patoliya had been visiting India to fulfil his wife Bharti's \"final wish\" to be laid to rest in her hometown.",
        "Content": "A father returning home after scattering his wife's ashes was among the victims of the Air India crash, leaving his two young children suddenly orphaned. Flight 171 was carrying 242 people when it struck a medical college hostel less than a minute after taking off from Ahmedabad airport, in western India. Twenty-nine people on the ground were killed, taking the total number of victims to 270. A hospital official confirmed 270 bodies have been recovered from the crash site, but DNA testing is being conducted to identify the bodies. Just one passenger, a British man from Leicester, survived what has become the worst aviation crash in a decade. Among the victims, 37-year-old Arjun Patoliya had been visiting India to fulfil his wife Bharti's \"final wish\" to be laid to rest in her hometown of Gujarat. Bharti had died just over two weeks ago, following a \"courageous battle with cancer\". A GoFundMe page, set up to raise funds for their two children, says: \"Arjun left to bid farewell to his wife, never returned to the children they both raised. \"Now, these two beautiful young girls have been left without parents - their world turned upside down in just over two weeks.\" A fundraiser, which has topped more than a quarter of a million pounds, confirms all money raised will go directly into a legal trust, \"to ensure every penny is dedicated to the girls' needs\". Airline offers additional £21k payment Air India had initially said it would pay £85,000 to the families of each passenger killed in the crash. However, it said on Saturday it would now offer an additional \"interim payment\" of £21,000 to \"help address immediate financial needs\". This brings the total amount of compensation being offered to families to £106,000. \"Air India stands in solidarity with the families of the passengers who tragically lost their lives in the recent accident,\" the airline said. \"Our teams on the ground are doing everything possible to extend care and support during this incredibly difficult time.  Read more on Air India crash:Air India's lone survivor is nothing short of miracleGloucester family among deadEverything we know about the crash Investigation will take three months India's aviation minister has said a government panel reviewing the crash will complete its assessment in three months. Ram Mohan Naidu said the government has also ordered \"extended surveillance\" of Boeing 787 planes. Air India operates 33 Boeing 787s, while rival airline IndiGo has one, according to data from Flightradar24. Mr Naidu said the plane started descending after reaching 650 feet. Every theory as to what happened will be looked into, he said. But in the meantime, he has instructed the airline to assist the families of passengers to ensure there is no delay in handing over the bodies of those who died. Black box has been found India's aviation ministry says workers have recovered the digital flight data recorder - one of two black boxes on the plane, from the rooftop of the building where it crashed. This box has data on engine and control settings, so will be able to show if there was a loss of engine power or lift after takeoff. The investigation will initially focus on the engine, flaps and landing gear, a source told Reuters on Friday. A possible bird-hit is not among the key areas of focus, the source said, adding that teams of anti-terror experts were part of the investigation process. There is no information yet on the cockpit voice recorder, the other black box, which will be a crucial part of understanding what caused the plane to crash."
    },
    {
        "title": "The bodies of more than 1,000 Ukrainian soldiers returned to Kyiv after prisoner swap",
        "description": "More than 1,000 Ukrainian bodies have been handed back to Kyiv after a prisoner-of-war exchange - as Volodymyr Zelenskyy renews calls for sanctions.",
        "url": "https://news.sky.com/story/the-bodies-of-more-than-1000-ukrainian-soldiers-returned-to-kyiv-after-prisoner-swap-13383619",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-ukraine-russia-prisoner-of-war_6941963.jpg?20250614155822",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-14 13:09:00",
        "Headline": "It comes after a prisoner exchange was agreed at talks in Istanbul earlier this month.",
        "Content": " More than 1,000 Ukrainian bodies have been handed back to Kyiv after a prisoner-of-war exchange - as Volodymyr Zelenskyy renews calls for sanctions. The Ukrainian president said on social media that many of those released by Russia had been \"held captive since 2022\". \"It is our absolute duty to free them all,\" he added. \"And we are working toward exactly that - to leave no one behind in the enemy's hands. I thank everyone who is helping.\"   Russia's defence ministry said it had handed over the bodies of 1,200 dead Ukrainian soldiers on Friday, but state media reported on Saturday that Moscow had not received any of its war dead back from Kyiv. The ministry added that its soldiers are in Belarus, where they are receiving medical treatment before being transferred back to Russia. It comes after both sides agreed to exchange those held captive at talks in Istanbul earlier this month. However, the talks failed to lead to a ceasefire. In a post on X, Mr Zelenskyy renewed calls for sanctions on Russia, saying that \"no one has been able to stop Putin\" and that \"he must lose money\" to end the war. \"Capping the price of Russian energy is critical, because oil is their main source of income,\" Mr Zelenskyy added. \"What happens in the Middle East is now driving oil prices up, and that, in turn, affects Europe's security. \"That's why oil price caps are such a powerful tool.\" He went on to say talks between the US and Russia \"feels too warm\", adding: \"Putin must understand clearly: America will stand with Ukraine, including by imposing sanctions and supporting our army. \"Any signals of reduced aid, or of treating Ukraine and Russia as equals, are deeply unfair. Russia is the aggressor. They started this war. They do not want to end it.\" Read more from Sky News:Ex-CIA director calls Trump's Ukraine plan 'naive'Politician faces deportation from Egypt after trying to cross into GazaFamilies endure agonising wait for Air India crash victims' bodies It comes as the Ukrainian president dismissed claims that Russian troops had crossed into the central Ukrainian region of Dnipropetrovsk - which had remained under Ukrainian control since the war started in February 2022. Mr Zelenskyy also said Ukrainian troops had stopped Russian troops from advancing in the northeastern Sumy region, and are fighting to regain control of the border. He said: \"You should understand that the enemy has been stopped there. And the maximum depth at which the fighting takes place is 7km from the border.\""
    },
    {
        "title": "Trump's Iran remarks let him still play 'good cop' to Netanyahu's 'bad cop'",
        "description": "Reading between the lines of President Trump's social media posts is an art, not a science.",
        "url": "https://news.sky.com/story/trumps-iran-remarks-let-him-still-play-good-cop-to-netanyahus-bad-cop-13383745",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-white-house_6942117.jpg?20250614192043",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-06-14 17:58:00",
        "Headline": "The president is claiming the Israeli attacks make a deal more, not less, likely because of the pressure Iran will now be under. Maybe, but many regional watchers are very unconvinced.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Reading between the lines of President Trump's social media posts is an art, not a science. But whether by intention or not, there is always insight in his posts. His Truth Social words reacting to the Israeli attack on Iran are intentionally ambiguous. When was he told by Israel that they would strike Iran? Did he give them a green light, or was it more amber? Israel-Iran live: Missile from Iran and Yemen 'hitting Israel' Was his insistence, as recently as 48 hours ago, that a strike would \"blow\" the chances of a deal with Iran actually just a ruse to afford Israel the element of surprise? That's what the Israelis are claiming. Clearly, President Trump does not want to give the impression that his 'don't strike' advice was ignored by Netanyahu. His social posts are filled with enough ambiguity to allow him to maintain his good cop stance alongside Netanyahu, the bad cop: \"I gave Iran chance after chance to make a deal. I told them, in the strongest of words, to 'just do it'...\" \n                  Washington parade celebrates US Army's 250th anniversary - and Donald Trump's 79th birthday\n                 \n                  Trump and Putin agree Iran-Israel conflict 'should end' in hour-long phone call\n                 \n                  Donald Trump urged Benjamin Netanyahu not to attack Iran, but give talks a chance\n                 Trump's 'art of the deal', whether it be in real estate or nuclear weapon negotiations, requires unpredictability and ambiguity. Both of those, as it happens, are useful to hide ineptitude too. The line between diplomatic masterstroke and disastrous diplomacy is thin. The president is claiming that the Israeli attacks make a deal more, not less, likely because of the pressure Iran will now be under. Maybe, but many regional watchers are very unconvinced. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 An alternative path to negotiations for Iran would be to go fully down the North Korea route, comforted in the knowledge that China - as a big Iranian oil customer - and Russia - as a weapons customer - will be on side. Trump may think that the pressure of bombardment will force Iran to heel. But the other pressure the Iranian supreme leader is under is the pressure of survival. Self-preservation necessitates the Iranian response that we're now seeing before any prospect of renewed negotiations can come.  The Israelis and the Americans are calculating that Iran and its proxies are now sufficiently degraded, and so the response will be limp and containable. They might be right in terms of conventional attacks, but asymmetrical operations are another fear - against Israeli targets or more broadly, softer Western targets in the region or beyond. Step back from the chaos of the past 24 hours. The broader picture here is regime change. Netanyahu said as much in his Friday speech, calling for an internal uprising. He ignored history - which suggests people tend to rally round their flag - but more than that, that foreign air strikes alone don't work. Look at Libya in 1986, Iraq in 1991, or Yugoslavia in 1999. Read more:Nuclear threat wasn't only reason Israel attacked IranHow the attacks could impact global economy Netanyahu wants to go further. Will he take out the supreme leader? Trump does not want another full-scale conflict in the Middle East. Of all the things he is accused of being, a hawkish warmonger he is not. But there are plenty of politicians on Capitol Hill - on both sides of the divide - who support regime change in Iran. I was at an event in Congress in December organised by Iranian exiled opposition leaders. I was struck by the cross-party support for regime change in one form or another. Israel this weekend announced that its military had achieved total air superiority from western Iran to the capital Tehran. That's remarkable. Could Trump be persuaded to pursue regime change? Peace, eventually, through strength? His motto adapted. We are at yet another unsettlingly tense moment for the region."
    },
    {
        "title": "Trump and Putin agree Iran-Israel conflict 'should end' in hour-long phone call",
        "description": "US President Donald Trump has revealed details of a one-hour phone call with his Russian counterpart, in which they agreed the conflict between Israel and Iran should end.",
        "url": "https://news.sky.com/story/trump-and-putin-agree-iran-israel-conflict-should-end-in-hour-long-phone-call-13383778",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-14 19:02:00",
        "Headline": "The US president says the Russian leader \"called this morning to very nicely wish me a Happy Birthday\" and to discuss tensions in the Middle East.",
        "Content": "US President Donald Trump has revealed details of a one-hour phone call with his Russian counterpart, in which they agreed the conflict between Israel and Iran should end. Posting on his Truth Social platform, Mr Trump added that he told Vladimir Putin that \"his war [in Ukraine] should also end\". Iran has retaliated following Israel's attack on its nuclear sites on Friday - which killed senior army officers and nuclear scientists. Israel-Iran latest: Follow live updates   The Iranian response has resulted in at least three people killed and dozens of injuries in Israel, according to medics. Iranian state TV, meanwhile, has reported that 20 children are among the 60 killed in a strike on a Tehran neighbourhood on Saturday. Iranian missiles were seen entering Israeli airspace on Saturday evening. Meanwhile, RAF jets and military assets are being sent to the Middle East after Tehran warned the UK and other allies their regional bases would be targeted if they helped defend Israel in the growing conflict between the two heavily armed countries.  In his post, Mr Trump said: \"President Putin called this morning to very nicely wish me a Happy Birthday, but to more importantly, talk about Iran, a country he knows very well. We talked at length. \"Much less time was spent talking about Russia/Ukraine, but that will be for next week. He is doing the planned prisoner swaps - large numbers of prisoners are being exchanged, immediately, from both sides. \"The call lasted approximately 1 hour. He feels, as do I, this war in Israel-Iran should end, to which I explained, his war should also end.\" Read more on Sky News:Nuclear threat wasn't the only reason Israel attacked IranUS politician shot dead and another wounded - as suspect named  Kremlin aide Yuri Ushakov said President Putin condemned Israel's military operation in Iran and expressed concerns about the risk of escalation. During the conversation, the Russian leader briefed President Trump on his recent talks with the leaders of Israel and Iran - reiterating Russia's hopes to seek mutually acceptable solutions on Iran's growing nuclear issue. Meanwhile, the latest round of US-Iran nuclear talks scheduled for Sunday in Muscat will not take place, a senior US administration official has told Sky's US partner network NBC News. However, the official said the US is \"not shutting the door to future discussions\". \"While there will be no meeting on Sunday, we remain committed to talks and hope the Iranians will come to the table soon,\" the official said."
    },
    {
        "title": "Irish politician faces deportation from Egypt after trying to cross into Gaza",
        "description": "An Irish politician who was detained in Egypt trying to cross into Gaza says the police were violent towards the group after seizing his phone.",
        "url": "https://news.sky.com/story/irish-politician-facing-deportation-from-egypt-after-trying-to-cross-into-gaza-13383559",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-paul-murphy-ireland_6941774.jpg?20250614104417",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-06-14 09:30:00",
        "Headline": "The Irish opposition politician said his phone and passport were confiscated on Friday before he was put on a bus to Cairo airport for deportation. ",
        "Content": "An Irish politician who was detained in Egypt trying to cross into Gaza says the police were violent towards the group after seizing his phone. People Before Profit-Solidarity TD (MP) Paul Murphy was part of a large demonstration attempting to march to the Rafah crossing in a bid to get aid into the region. The opposition politician said his phone and passport were confiscated on Friday before he was put on a bus to Cairo airport for deportation. Israel-Iran live: 'Tehran will burn' if it keeps firing missiles Footage of the seconds before his phone was seized shows authorities forcibly dragging protesters away from the sit-down demonstration. Ireland's deputy premier said several Irish citizens who were detained have now been released. Mr Murphy confirmed he was among the released protesters, posting a photo on his Facebook page saying he was back in Cairo and \"meeting shortly to decide next steps\". In a message from Mr Murphy after he was detained, posted online by his social media team, he said: \"I'm ok, but they still have my phone. \"Egyptian police say we're going to airport but this isn't the road we came on because there are 1000s of marchers on the streets. They're taking us south past a lake, then west towards Cairo. \"Violence got worse after they seized my phone. \"One American woman in my group was badly kicked & beaten, and had her hijab torn off.\" Sky News has contacted Egypt's police regarding Mr Murphy's claims of violence towards the group. Mr Murphy previously said other Irish citizen were among those who had been stopped from entering Gaza. \"The world has watched a horrific genocide for the past 20 months. Since March, a total attempt of starvation,\" he added. \"And that this is a peaceful march to demand that it be ended and demand that western governments stop their complicity.\" Appeal to foreign affairs minister Mr Murphy's partner, Councillor Jess Spear, had previously appealed to Ireland's Foreign Affairs Minister and deputy premier Simon Harris to make a public statement on Mr Murphy's detention. She expressed \"relief\" that the group had been released from detention.  She said: \"However, they still want to reach Rafah to try and get humanitarian aid into Gaza. That has been the sole purpose of being in Egypt. \"Paul has appealed to Tanaiste Simon Harris to put pressure on the Egyptian authorities to let the marchers reach Rafah. The situation of the people of Gaza worsens by the day as they suffer starvation imposed by Israel.\""
    },
    {
        "title": "Minnesota: US politician shot dead and another wounded - as suspect named",
        "description": "A manhunt is under way after a US politician and her husband were shot dead in their home in a \"politically motivated assassination\" - and another politician and his wife were also shot.",
        "url": "https://news.sky.com/story/manhunt-after-us-politician-and-husband-shot-dead-in-politically-motivated-assassination-second-politician-also-targeted-13383649",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-melissa-hortman-vance-boelter_6942275.jpg?20250614221019",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-14 14:17:00",
        "Headline": "A manhunt is under way for 57-year-old suspect Vance Boelter - who was reportedly posing as a police officer.",
        "Content": "A manhunt is under way after a US politician and her husband were shot dead in their home in a \"politically motivated assassination\" - and another politician and his wife were also shot. Minnesota state representative Melissa Hortman and her husband were killed at their home, Tim Walz, the governor of Minnesota, confirmed. State senator John Hoffman and his wife were also shot in their home but are expected to survive. The senator, according to officials, is in a stable condition after emergency surgery. Authorities have confirmed that the suspect they are looking for is 57-year-old Vance Boelter - who, in a press conference, was described as a 6ft 1in white male, with brown hair and brown eyes. Members of the public have been urged not to approach him as he may be armed. The suspect was reportedly posing as a police officer, and officials said the alleged attacker escaped after an exchange of gunfire. Both politicians are members of the Minnesota Democratic-Farmer-Labor Party.  US President Donald Trump, in a statement, said: \"I have been briefed on the terrible shooting that took place in Minnesota, which appears to be a targeted attack against State Lawmakers. \"Our Attorney General, Pam Bondi, and the FBI, are investigating the situation, and they will be prosecuting anyone involved to the fullest extent of the law. \"Such horrific violence will not be tolerated in the United States of America.\" Authorities have urged residents of the Champlin and Brooklyn Park areas to stay in their homes. In an earlier Facebook post, Mr Walz said: \"I've been briefed this morning on an ongoing situation involving targeted shootings in Champlin and Brooklyn Park. \"The Minnesota Department of Public Safety and local law enforcement are on the scene. We will share more information soon.\" At a subsequent news conference, Mr Walz said: \"We must all, in Minnesota and across the country, stand against all forms of political violence. \"Those responsible for this will be held accountable.\" He has also urged those in Minnesota not to attend political rallies until the suspect is caught. Police evacuated the Texas State Capitol and grounds in Austin ahead of an anti-Trump protest on Saturday - citing a credible threat to politicians. Read more on Sky News:'Tehran will burn' if it keeps firing missiles, Israel warnsSee the best pictures from Trooping the Colour30,000 lightning strikes hit UK Post-mortem examinations will be conducted to determine the extent of their injuries. However, it is clear that both Ms Hortman and her spouse died from gunshot wounds, Drew Evans, superintendent of the Bureau of Criminal Apprehension, said. Ms Hortman, a mother of two, was first elected in 2004 - and was the top house Democratic leader in the state legislature. She also served as speaker of the Minnesota House of Representatives. Mr Hoffman, also a Democrat, was first elected in 2012 - and ran a consulting firm called Hoffman Strategic Advisors. Hakeem Jeffries, House Democratic leader, has described the shootings as \"deeply disturbing\" on X, adding that \"violence is never acceptable\", and that he is \"praying hard\" for the victims. Former Arizona representative, Gabby Giffords, described her friend Ms Hortman as a \"true public servant\", who \"dedicated her life building a better, safer Minnesota\". Nancy Pelosi, former speaker of the US House of Representatives, said she was \"heartbroken\" by the news. She added: \"Unfortunately, we know the tragedy of when political violence hits home very well. \"All of us must remember that it’s not only the act of violence, but also the reaction to it, that can normalise it. This climate of politically-motivated violence must end.\" In a tribute, Democratic National Committee chair Ken Martin said: \"Melissa, Mark, John, and Yvette - these are not just names, and this is not just politics. \"These are people. They’re longtime friends to me and Jenn and so many others in Minnesota. They have children, loved ones, neighbors, and friends.\" Mr Martin added: \"Today, we recommit ourselves to fight harder for the values that Melissa and Mark embodied - building a kinder, more just, and loving world. If this murderer thinks we will be silenced, he’s wrong.\""
    },
    {
        "title": "Trump and Putin agree Iran-Israel conflict 'should end' in hour-long phone call",
        "description": "US President Donald Trump has revealed details of a one-hour phone call with his Russian counterpart, in which they agreed the conflict between Israel and Iran should end.",
        "url": "https://news.sky.com/story/trump-and-putin-agree-iran-israel-conflict-should-end-in-hour-long-phone-call-13383778",
        "image_url": "https://e3.365dm.com/25/05/1920x1080/skynews-donald-trump-vladimir-putin_6921976.jpg?20250520080739",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-06-14 19:02:00",
        "Headline": "The US president says the Russian leader \"called this morning to very nicely wish me a Happy Birthday\" and to discuss tensions in the Middle East.",
        "Content": "US President Donald Trump has revealed details of a one-hour phone call with his Russian counterpart, in which they agreed the conflict between Israel and Iran should end. Posting on his Truth Social platform, Mr Trump added that he told Vladimir Putin that \"his war [in Ukraine] should also end\". Iran has retaliated following Israel's attack on its nuclear sites on Friday - which killed senior army officers and nuclear scientists. Israel-Iran latest: Follow live updates   The Iranian response has resulted in at least three people killed and dozens of injuries in Israel, according to medics. Iranian state TV, meanwhile, has reported that 20 children are among the 60 killed in a strike on a Tehran neighbourhood on Saturday. Iranian missiles were seen entering Israeli airspace on Saturday evening. Meanwhile, RAF jets and military assets are being sent to the Middle East after Tehran warned the UK and other allies their regional bases would be targeted if they helped defend Israel in the growing conflict between the two heavily armed countries.  In his post, Mr Trump said: \"President Putin called this morning to very nicely wish me a Happy Birthday, but to more importantly, talk about Iran, a country he knows very well. We talked at length. \"Much less time was spent talking about Russia/Ukraine, but that will be for next week. He is doing the planned prisoner swaps - large numbers of prisoners are being exchanged, immediately, from both sides. \"The call lasted approximately 1 hour. He feels, as do I, this war in Israel-Iran should end, to which I explained, his war should also end.\" Read more on Sky News:Nuclear threat wasn't the only reason Israel attacked IranUS politician shot dead and another wounded - as suspect named  Kremlin aide Yuri Ushakov said President Putin condemned Israel's military operation in Iran and expressed concerns about the risk of escalation. During the conversation, the Russian leader briefed President Trump on his recent talks with the leaders of Israel and Iran - reiterating Russia's hopes to seek mutually acceptable solutions on Iran's growing nuclear issue. Meanwhile, the latest round of US-Iran nuclear talks scheduled for Sunday in Muscat will not take place, a senior US administration official has told Sky's US partner network NBC News. However, the official said the US is \"not shutting the door to future discussions\". \"While there will be no meeting on Sunday, we remain committed to talks and hope the Iranians will come to the table soon,\" the official said."
    },
    {
        "title": "Trump's Iran remarks let him still play 'good cop' to Netanyahu's 'bad cop'",
        "description": "Reading between the lines of President Trump's social media posts is an art, not a science.",
        "url": "https://news.sky.com/story/trumps-iran-remarks-let-him-still-play-good-cop-to-netanyahus-bad-cop-13383745",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-donald-trump-white-house_6942117.jpg?20250614192043",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-06-14 17:58:00",
        "Headline": "The president is claiming the Israeli attacks make a deal more, not less, likely because of the pressure Iran will now be under. Maybe, but many regional watchers are very unconvinced.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Reading between the lines of President Trump's social media posts is an art, not a science. But whether by intention or not, there is always insight in his posts. His Truth Social words reacting to the Israeli attack on Iran are intentionally ambiguous. When was he told by Israel that they would strike Iran? Did he give them a green light, or was it more amber? Israel-Iran live: Missile from Iran and Yemen 'hitting Israel' Was his insistence, as recently as 48 hours ago, that a strike would \"blow\" the chances of a deal with Iran actually just a ruse to afford Israel the element of surprise? That's what the Israelis are claiming. Clearly, President Trump does not want to give the impression that his 'don't strike' advice was ignored by Netanyahu. His social posts are filled with enough ambiguity to allow him to maintain his good cop stance alongside Netanyahu, the bad cop: \"I gave Iran chance after chance to make a deal. I told them, in the strongest of words, to 'just do it'...\" \n                  Washington parade celebrates US Army's 250th anniversary - and Donald Trump's 79th birthday\n                 \n                  Trump and Putin agree Iran-Israel conflict 'should end' in hour-long phone call\n                 \n                  Donald Trump urged Benjamin Netanyahu not to attack Iran, but give talks a chance\n                 Trump's 'art of the deal', whether it be in real estate or nuclear weapon negotiations, requires unpredictability and ambiguity. Both of those, as it happens, are useful to hide ineptitude too. The line between diplomatic masterstroke and disastrous diplomacy is thin. The president is claiming that the Israeli attacks make a deal more, not less, likely because of the pressure Iran will now be under. Maybe, but many regional watchers are very unconvinced. 👉Listen to The World with Richard Engel and Yalda Hakim on your podcast app👈 An alternative path to negotiations for Iran would be to go fully down the North Korea route, comforted in the knowledge that China - as a big Iranian oil customer - and Russia - as a weapons customer - will be on side. Trump may think that the pressure of bombardment will force Iran to heel. But the other pressure the Iranian supreme leader is under is the pressure of survival. Self-preservation necessitates the Iranian response that we're now seeing before any prospect of renewed negotiations can come.  The Israelis and the Americans are calculating that Iran and its proxies are now sufficiently degraded, and so the response will be limp and containable. They might be right in terms of conventional attacks, but asymmetrical operations are another fear - against Israeli targets or more broadly, softer Western targets in the region or beyond. Step back from the chaos of the past 24 hours. The broader picture here is regime change. Netanyahu said as much in his Friday speech, calling for an internal uprising. He ignored history - which suggests people tend to rally round their flag - but more than that, that foreign air strikes alone don't work. Look at Libya in 1986, Iraq in 1991, or Yugoslavia in 1999. Read more:Nuclear threat wasn't only reason Israel attacked IranHow the attacks could impact global economy Netanyahu wants to go further. Will he take out the supreme leader? Trump does not want another full-scale conflict in the Middle East. Of all the things he is accused of being, a hawkish warmonger he is not. But there are plenty of politicians on Capitol Hill - on both sides of the divide - who support regime change in Iran. I was at an event in Congress in December organised by Iranian exiled opposition leaders. I was struck by the cross-party support for regime change in one form or another. Israel this weekend announced that its military had achieved total air superiority from western Iran to the capital Tehran. That's remarkable. Could Trump be persuaded to pursue regime change? Peace, eventually, through strength? His motto adapted. We are at yet another unsettlingly tense moment for the region."
    },
    {
        "title": "Harrods plots legal action against estate of former owner al-Fayed",
        "description": "Harrods is preparing to take legal action against the estate of its former owner, Mohamed al-Fayed, as the multimillion-pound legal bill for compensating his sexual abuse victims continues to escalate.",
        "url": "https://news.sky.com/story/harrods-plots-legal-action-against-estate-of-former-owner-al-fayed-13383546",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-fayed-harrods_6941750.jpg?20250614092013",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-14 08:22:00",
        "Headline": "The Knightsbridge department store, which has been owned by Qatari royals since 2010, plans to go to the High Court next week to replace the executors of Mohamed al-Fayed’s estate, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Harrods is preparing to take legal action against the estate of its former owner, Mohamed al-Fayed, as the multimillion-pound legal bill for compensating his sexual abuse victims continues to escalate. Sky News has learnt that the Knightsbridge department store, which has been owned by a Qatari sovereign wealth fund since 2010, plans to file a so-called passing-over application in the High Court as early as next week. The intention of the application is to secure the removal of Mr al-Fayed's estate's current executors, and replace them with professional executors to administer it instead. Professional executors would be expected to investigate the assets and liabilities of the estate, while Harrods insiders claimed that the current executors - thought to be close family members of the deceased billionaire - had \"ignored\" correspondence from its lawyers. Sources close to Harrods said the passing-over application paved the way for it to potentially seek to recover substantial sums from the estate of the Egyptian tycoon as it contends with a compensation bill likely to run to tens of millions of pounds. In a statement issued to Sky News on Saturday, a Harrods spokesperson said: \"We are considering legal options that would ensure that no doors are closed on any future action and that a route to compensation and accountability from the Fayed estate remains open to all.\" Mr al-Fayed is believed to have raped or sexually abused hundreds of women during his 25-year tenure as the owner of Harrods. \n                  Harrods challenges survivors' law firm's compensation cut\n                 \n                  Harrods revises compensation payouts for al Fayed abuse victims\n                 \n                  Harrods proposes six-figure payouts to victims of al Fayed abuse\n                 He died in 2023, since when a torrent of details of his abuse have been made public by many of his victims. Earlier this year, Sky News revealed details of the compensation scheme designed by Harrods to award six-figure sums to women he abused. In a form outlining the details of the Harrods redress scheme overseen by MPL Legal, which is advising the department store, it referred to the potential \"for Harrods to recover compensation paid out under this Scheme from Mohamed Fayed's estate\". \"You are not obliged to assist with any such claim for recovery,\" the form told potential claimants. \"However, if you would be willing to assist Harrods including potentially by giving evidence against Fayed's estate, please indicate below.\" This weekend, there appeared to be confusion about the legal representation of Mr al-Fayed's estate. In March, the BBC reported that Fladgate, a UK-based law firm, was representing it in an article which said that women who worked for him as nannies and private air stewards were preparing to file legal claims against the estate. This weekend, however, a spokesman for Fladgate declined to comment on whether it was acting for Mr al-Fayed's estate, citing confidentiality restrictions. A source close to the law firm, meanwhile, insisted that it was not acting for the estate. KP Law, another law firm acting for some al-Fayed abuse survivors, has criticised the Harrods-orchestrated process, but has itself faced questions over proposals to take up to 25% of compensation awards in exchange for handling their cases. Harrods insiders said there was a growing risk that Mr al-Fayed's estate would not be responsibly administered given that the second anniversary of his death was now approaching. They added that as well as Harrods itself seeking contribution for compensation paid out for Mr al-Fayed's abuse, its legal action would also potentially open way for survivors to claim directly against the estate. Victims with no direct connection to Harrods are not eligible for any compensation through the store's own redress scheme. Even if Harrods' passing-over application was approved by the High Court, any financial recovery for the department store would be subject to a number of additional legal steps, sources said. \"The passing-over action would achieve the goals of acknowledgement and accountability from the estate for survivors who don't have the resource to undertake a passing-over application themselves,\" an insider said this weekend."
    },
    {
        "title": "High street lender Metro Bank receives takeover approach",
        "description": "The high street lender Metro Bank has been approached about a private equity-backed takeover in a move that could lead to the disappearance of another company from the London Stock Exchange.",
        "url": "https://news.sky.com/story/high-street-lender-metro-bank-receives-takeover-approach-13383562",
        "image_url": "https://e3.365dm.com/23/10/1920x1080/skynews-metro-bank_6314058.jpg?20231008155956",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-06-14 09:44:00",
        "Headline": "The prominent retail bank has been approached in the last fortnight about a takeover bid spearheaded by the private equity firm Pollen Street Capital, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The high street lender Metro Bank has been approached about a private equity-backed takeover in a move that could lead to the disappearance of another company from the London Stock Exchange. Sky News has learnt that Metro Bank was approached in the last fortnight about an offer to take it private spearheaded by the financial services-focused buyout firm Pollen Street Capital. Pollen Street is one of the major shareholders in Shawbrook, the mid-sized bank which in the past has approached Metro Bank about a merger of the two companies. In recent months, Shawbrook's owners have stepped up efforts to identify a prospective corporate combination, holding tentative talks with Starling Bank about a £5bn tie-up, while also drawing up plans for a stock market listing. The takeover approach to Metro Bank comes as it puts a traumatic period in which it came close to insolvency firmly behind it. In November 2023, the lender was rescued through a £925m deal comprising £325m of equity - a third of which was contributed by Jaime Gilinski Bacal, a Colombian billionaire - and £600m of new debt. Mr Gilinski now holds a near-53% stake through his investment vehicle, Spaldy Investments, and sits on the company's board. \n                  Harrods plots legal action against estate of former owner al-Fayed\n                 \n                  Money blog: 'I don't feel safe living here' - UK residents sound alarm about freehold estates\n                 \n                  How the Israel-Iran attacks could impact the global economy\n                 Since the bailout deal, Metro Bank has cut hundreds of jobs and sold portfolios of loan assets, at the same time as chief executive Daniel Frumkin has improved its operating performance. Shares in Metro Bank have more than trebled in the last year as its recovery has gathered pace. On Friday, the stock closed at 112.2p, giving it a market capitalisation of just over £750m. At one point in 2018, the lender - which promised to revolutionise retail banking when it opened its first branch in London in 2010 - had a market capitalisation of £3.5bn. Metro Bank became the first new lender to open on Britain's high streets in over 100 years when it launched in the wake of the 2008 financial crisis. Its branch-based model, which included gimmicks such as offering dog biscuits, proved costly, however, at a time when many rivals have been shifting to digital banking. Reporting first-quarter results last month, Mr Frumkin said: \"During the first quarter of 2025, we have continued to deliver the strategic repositioning of Metro Bank's business, maintaining strong cost control while driving higher net interest margin by changing the mix of assets and remaining disciplined about deposits.\" \"We have seen further growth in our corporate and commercial lending, with Metro Bank's relationship banking and breadth of services creating differentiation for us in the market.\" Metro Bank operates from about 75 branches across the country, and saw roughly 30,000 new personal and business current accounts opened during the last quarter. In 2019, customers formed sizeable queues at some of its branches after suggestions circulated on social media that it was in financial distress. Days later, it unveiled a £350m share placing in a move designed to allay such concerns. The company has had a chequered history with City regulators, despite its relatively brief existence. In 2022, it was fined £10m by the Financial Conduct Authority for publishing incorrect information to investors, while the PRA slapped it with a £5.4m penalty for similar infringements a year earlier. The lender was founded in 2009 by Anthony Thompson, a financial services entrepreneur, and Vernon Hill, an American who eventually left in controversial circumstances in 2019. Last month, it sailed through a shareholder vote unscathed after drawing opposition to a proposal which could see top executives paid up to £60m apiece. Metro Bank and Pollen Street both declined to comment on Saturday"
    },
    {
        "title": "Sir Keir Starmer to launch new national inquiry into grooming gangs",
        "description": "Sir Keir Starmer is to launch a new national inquiry into grooming gangs.",
        "url": "https://news.sky.com/story/sir-keir-starmer-to-launch-new-national-inquiry-into-grooming-gangs-13383695",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-keir-starmer-downing-street_6939164.jpg?20250611115140",
        "type": "Politics",
        "Author": "Beth Rigby",
        "Date Published": "2025-06-14 15:48:00",
        "Headline": "Ahead of the G7 summit in Canada, Sir Keir Starmer tells reporters he will commission a national inquiry into grooming gangs on the recommendation of Baroness Casey.",
        "Content": "\n          Political editor\n              @BethRigby\n  Sir Keir Starmer is to launch a new national inquiry into grooming gangs. It comes after a government-requested audit into the scale of grooming gangs across the country concluded a nationwide probe was necessary. The prime minister previously argued a national inquiry was not necessary, but has changed his view following an audit into group-based child sexual abuse led by Baroness Casey, which is set to be published next week. \"[Baroness Casey's] position when she started the audit was that there was not a real need for a national inquiry over and above what was going on,\" he told reporters travelling with him to the G7 summit in Canada. \"She has looked at the material... and she has come to the view that there should be a national inquiry on the basis of what she has seen. \"I have read every single word of her report, and I am going to accept her recommendation. That is the right thing to do on the basis of what she has put in her audit. \"I asked her to do that job to double check on this; she has done that job for me, and having read her report... I shall now implement her recommendations.\" Grooming gangs timeline: What happened, what inquiries there were and how Starmer was involved  The near 200-page report is to be published next week and is expected to warn that white British girls were \"institutionally ignored for fear of racism\". One person familiar with the report said it details the institutional failures in treating young girls and cites a decade of lost action from the Jay Review, set up in 2014 to investigate grooming gangs in Rotherham. The report is also expected to link illegal immigration with the exploitation of young girls. The government had initially resisted a new inquiry, insisting that it first wanted to implement recommendations from previous inquiries, such as the Jay Review, into child sexual exploitation. It also allowed five councils to set up their own investigations into their communities rather than hold a national inquiry.  The grooming gang scandal came back into the headlines at the beginning of the year after Elon Musk attacked Sir Keir and safeguarding minister Jess Philips for failing children. The prime minister and Ms Phillips hit back, with Sir Keir citing his record of prosecuting abusers as director of public prosecutions, while Ms Phillips has long been a campaigner against domestic violence. At the time, she told Sky News that Mr Musk's claims were \"ridiculous\" and that she would be led by what victims have to say, not him. Following the row between the tech billionaire and the UK government, the prime minister asked Baroness Casey to conduct an audit of all the evidence to see if a national inquiry was required. Read more on this story:Telford child abuse victims speak outWhat we know about grooming gangs, from the dataThe women who blew whistle on Rotherham Kemi Badenoch, the Conservative leader, said: \"Keir Starmer doesn't know what he thinks unless an official report has told him so. \"Just like he dismissed concerns about the winter fuel payment and then had to U-turn, just like he needed the Supreme Court to tell him what a woman is, he had to be led by the nose to make this correct decision here. \"I've been repeatedly calling for a full national inquiry since January. It's about time he recognised he made a mistake and apologise for six wasted months. \"But this must not be the end of the matter. There are many, many more questions that need answering to ensure this inquiry is done properly and quickly. \"Many survivors of the grooming gangs will be relieved that this is finally happening, but they need a resolution soon, not in 10 years' time. Justice delayed is justice denied.\""
    },
    {
        "title": "Why many victims will welcome a national inquiry into grooming gangs",
        "description": "In 2019, nine men were jailed for raping and abusing two teenage girls living in a children's home in Bradford.",
        "url": "https://news.sky.com/story/why-many-victims-will-welcome-a-national-inquiry-into-grooming-gangs-13383713",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-jason-farrell-fiona-goddard_6942070.png?20250614183142",
        "type": "Politics",
        "Author": "Jason Farrell",
        "Date Published": "2025-06-14 16:39:00",
        "Headline": "Victims will want to understand why, so often, authorities fail to protect vulnerable girls, writes Sky's Jason Farrell.",
        "Content": "\n          Home editor\n              @JasonFarrellSky\n In 2019, nine men were jailed for raping and abusing two teenage girls living in a children's home in Bradford. One of the victims, Fiona Goddard, says more than 50 men raped her. When the government began to talk about offering councils money for local inquiries, Fiona hoped Bradford would be one of the first to take up the offer. But there didn't seem to be much enthusiasm.  The council was quick to point out that there had already been an independent case review into Fiona's case, along with four other victims. This, then, was Fiona's first reasoning for wanting a national inquiry: The council felt it had done all that needed to be done. Fiona didn't. The Independent review, published in July 2021, found that while in the children's home, Fiona \"went missing almost on a daily basis\". The police attitude was that she could look after herself - she was \"street-wise\". There was \"agreement by all agencies that Fiona was either at risk of Child Sexual Exploitation (CSE) or actively being sexually abused and exploited\". But \"this was not addressed by any single agency\". And \"when Fiona became pregnant at the age of 15, there was little curiosity or enquiry who the father was\". So, obvious failings were discovered. The predictable response was that lessons had been learned and new processes put in place. But no one seemed to be held accountable. Grooming gangs timeline: What happened, what inquiries there were and how Starmer was involved  Ms Goddard told Sky News: \"In my serious case review she [Jane Booth, the independent chair] found seven incidences at least, in them records that she found, of them not reporting sexual abuse or rape or assault, from as young as eight years old, and one of the incidences I literally turned up covered in blood and they didn't report it. \"That is not just misunderstanding a crime, that is making intentional decisions not to report the sexual abuse of a child.\" She adds: \"Let's not forget, these people still work within social services and the police force.\" Not only did this Independent review not satisfy Fiona, but it also didn't begin to reflect the levels and scale of abuse Fiona had experienced outside of Bradford. Asked where she was trafficked to, Fiona rattles off a list of cities. \"Blackburn, Rotherham, Rochdale, Birmingham, Edinburgh, Oldham - never Telford, I'd never even heard of Telford until it all came out if I'm honest - Nottingham, Oxford.\" Then she remembers she didn't go to Oxford - men from Oxford came to her - but the point is made. Local enquiries can't possibly begin to explore the networks of men who traffic women, often down routes of drug trafficking being done by the same gangs. Bradford Council told Sky News it contributed to the national Independent Inquiry into Child Sexual Abuse (IICSA) and published more than 70 reports where child sexual exploitation was discussed and has implemented findings from the independent local review which included Fiona's case. Fiona believes there are numerous connections leading back to Bradford - but victims from each city often believe their abusers are at the centre of it. We've spoken to grooming victims across the country, and in 2022, a case was reopened in Humberside after a Sky News investigation, where we found diary entries, texts, photos, and school reports all indicating that teenage victims had been abused. Read more on this story:Telford child abuse victims speak outWhat we know about grooming gangs, from the dataThe women who blew whistle on Rotherham One of them was \"Anna\", who also wants a national inquiry. She believes there is a national pattern of police forces not believing victims or even criminalising them instead. Obtaining her own police records using a Subject Access Request (SAR), Anna found officers' attitudes towards her were similar to what we heard with Fiona in Bradford, blaming her abuse and injuries on \"lifestyle choices of her own\". Anna said: \"Every time I look at my Subject Access Request, I still think it's shocking. \"It was the same sort of terminology - lifestyle choices, liar, attention seeker, and the majority of it was negative. \"It was really rare that I'd come across something where they were actually listening or they were concerned.\" Humberside Police told us: \"As the investigation is active, it is imperative we protect its integrity; as such are unable to comment on aspects of the investigation as this could impact or jeopardise any criminal or judicial proceedings.\" But it is years now since Anna first reported her abuse, and she believes the police have left it too late to gather evidence. She told Sky News: \"I think it's either happening everywhere, or young people have been taken everywhere. \"I think the attitudes of the professionals, the police, social services, from what I've heard and seen, they seem very similar in every area.\" The government-commissioned rapid review by Baroness Casey is due to be published next week and is expected to call for a national inquiry into grooming gangs. Like Anna and Fiona, many victims will welcome Sir Keir Starmer's early response accepting the recommendation. They will want the inquiry to probe into the operations of the perpetrators - who they are and how they are connected. But they will also want clear accountability of the people and organisations who failed to act when they reported their abuse - and an understanding of why, so often, authorities fail to protect these vulnerable girls."
    },
    {
        "title": "PR-savvy and now finally a knight - Beckham always knew how to turn on the charm",
        "description": "A sporting icon courted by prime ministers past and present, newly knighted Sir David Beckham is renowned for being extremely media savvy.",
        "url": "https://news.sky.com/story/pr-savvy-and-now-finally-a-knight-beckham-always-knew-how-to-turn-on-the-charm-13383496",
        "image_url": "https://e3.365dm.com/25/06/1920x1080/skynews-david-beckham-beckham_6941696.jpg?20250614022811",
        "type": "Politics",
        "Author": "Jon Craig",
        "Date Published": "2025-06-14 02:00:00",
        "Headline": "For politicians and prime ministers, sports stars like Beckham are pure gold. David Cameron was also a fan and was photographed sitting alongside Becks at the London Olympics.",
        "Content": "\n          Chief political correspondent\n              @joncraig\n A sporting icon courted by prime ministers past and present, newly knighted Sir David Beckham is renowned for being extremely media savvy. Never more so than when I interviewed him for Sky News at the 2008 Beijing Olympics, after he took part in the closing ceremony having played a key role in London's winning bid to host the 2012 Games. Speaking about Sir Alex Ferguson in the interview, canny Sir Becks heaped praise on his old boss in our interview. But he'd been less complimentary about his old boss in a conversation with prime minister Gordon Brown, I later learned. I'd travelled to Beijing with Mr Brown, via Afghanistan, and we spent the final evening of the Games at the handover party, when Boris Johnson - then London mayor - famously spoke in his speech about \"wiff waff\" (table tennis) coming home. During his Beijing visit, Mr Brown had been promoting the idea of a Great Britain football team competing at the 2012 Games and there was speculation about Sir Alex being the team's coach. \"Aah, Sir Alex,\" Becks said wistfully and apparently affectionately when I asked him about being re-united with his former Manchester United manager during the interview. \"Like a father to me.\" Later, on the flight home to the UK, when I told Gordon Brown about the interview, the prime minister laughed. \"That's funny,\" he said. \n                  David Beckham says knighthood 'truly humbling' - as rock star and acting great also honoured\n                 \n                  David Beckham to be knighted in King's Birthday Honours list\n                 \n                  David Beckham meets King and Queen at Chelsea Flower Show\n                 \"Why?\" I asked him. He replied: \"He told me 'If Sir Alex is manager, he won't pick me!'\" Beckham played for Fergie at Manchester United from 1995 until 2003, when he joined Real Madrid amid claims that Ferguson disapproved of the player's showbiz lifestyle. By 2008 he was playing for LA Galaxy in the US. But despite his canny, PR-savvy answers in my interview, I saw him work the room that night in Beijing and glad-hand relentlessly. He gave every interview asked of him and turned on the charm on behalf of UK PLC to everyone present. For politicians and prime ministers, sportsmen and women like Beckham are pure gold. David Cameron was also a fan and was photographed sitting alongside Becks at the London Games. When \"Goldenballs\", as wife Victoria called him, retired from football a year later, a No 10 spokesman gushed: \"The prime minister's view is that David Beckham has been an outstanding footballer throughout his career. \"But not only that, he has been a brilliant ambassador for this country, not least if we remember all the work he did on helping us win London 2012.\" Read more from Sky News:Men jailed for their roles in theft of £4.75m gold toiletPolice issue mosh pit warning ahead of Download festival There was indeed a Great Britain men's football team at the Olympics, but it was coached by former England legend Stuart Pearce, not Sir Alex. And Pearce, nicknamed \"psycho\" for his aggressive style on the pitch, didn't pick Becks either, though he claimed he'd faced pressure from Downing Street to include him. Then in 2017, David Cameron's former spin doctor Craig Oliver claimed a senior Tory cabinet minister - thought to have been George Osborne - suggested giving Becks a peerage and appointing him sports minister in a 2013 cabinet reshuffle. That never happened either, obviously, though at least now David Beckham is also a knight - just like his \"father figure\" Sir Alex."
    }
]