[
    {
        "title": "Ukraine 'a lot closer' to peace deal after talks, Donald Trump says - but 'one or two thorny issues' remain",
        "description": "Donald Trump and Volodymyr Zelenskyy say they have made \"a lot of progress\" towards finalising a peace agreement to end Russia's war in Ukraine - although \"one or two very thorny issues\" remain.",
        "url": "https://news.sky.com/story/ukraine-a-lot-closer-to-peace-deal-after-talks-donald-trump-says-but-one-or-two-thorny-issues-remain-13488138",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_7121109.jpg?20251228224534",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 21:37:00",
        "Headline": "Donald Trump and Volodymyr Zelenskyy spoke for around two hours during their latest meeting, held at the US leader's residence in Mar-a-Lago, Florida.",
        "Content": "Donald Trump and Volodymyr Zelenskyy say they have made \"a lot of progress\" towards finalising a peace agreement to end Russia's war in Ukraine - although \"one or two very thorny issues\" remain. At a news conference following around two hours of talks at Mr Trump's residence in Mar-a-Lago, Florida, the two leaders hailed an \"excellent\" meeting during which they discussed \"all aspects\" of a 20-point peace framework. The US president said the outcome of the talks would be known in a few weeks, saying Ukraine is \"a lot closer\" to a deal and that the pair had \"made a lot of progress on ending that war\". Russia \"wants to see Ukraine succeed\", he maintained at the news conference, during which he repeatedly praised the Ukrainian leader as \"brave\". Mr Zelenskyy said the 20-point peace plan was \"90% agreed\", with US-Ukraine security guarantees 100% agreed - although Mr Trump put the security agreements at 95%. \"We agreed that security guarantees are a key milestone in achieving lasting peace and our teams will continue working on all aspects,\" Mr Zelenskyy said. Opening the floor to questions from the media, which started with the issue of security, Mr Trump said: \"I just think we're doing very well. We could be very close or one or two very thorny issues, very tough issues. But I think we're doing very well. \"We've made a lot of progress today, but really we've made it over the last month. This is not a one-day process deal. There's very complicated stuff.\" Asked which thorny issues remain unsolved, Trump said the issue of some Ukrainian land. The Donbas issue Russian leader Vladimir Putin wants to take control of Ukraine's eastern Donbas region as a condition for ending the war, despite not controlling the entire area. Ukraine has previously ruled out accepting this. Speaking about the Donbas region, Mr Zelenskyy said he had to \"respect our law and our people\", as well as the territory controlled by Ukraine. \"And of course, our attitude is very clear,\" he said. \"That's why President Trump said this is a very tough question.\" Ukraine has \"a different position to Russia\" on the matter, he added. Mr Trump was also asked about Ukraine's Zaporizhzhia nuclear plant, which has been under Russian control since the war began in February 2022. Mr Putin is \"working with Ukraine on getting it open\", the US president said. \"He's been very good in that sense. He wants to see that open.\" \"He hasn't hit it with missiles,\" Mr Trump added. The US president, who spoke with Mr Putin earlier in the day, insisted the Russian leader is \"very serious\" about peace in Ukraine, despite Moscow launching attacks on Kyiv ahead of the talks. The meeting in Florida was the latest stage in Mr Trump's year-long effort to secure a ceasefire, after previously saying he would end the war on the first day of his term in office. UK 'committed to sustaining momentum' Following the discussion, Mr Trump and Mr Zelenskyy spoke with European leaders, including Sir Keir Starmer. A Downing Street spokesperson said the UK prime minister was eager to sustain the momentum of the peace talks. \"The discussion focused on ongoing efforts to secure a just and lasting peace in Ukraine, with leaders commending President Trump for the progress achieved so far,\" a statement said. \"They underlined the importance of robust security guarantees and reaffirmed the urgency of ending this barbaric war as soon as possible.\" Read more from Sky News:The pictures that defined 2025Man discovers architect of the Holocaust was his grandfather The spokesperson said Sir Keir had emphasised the UK's \"commitment to working closely with partners to sustain momentum in the coming days - with President Trump highlighting his leadership in driving coordinated international support for Ukraine as talks continue\". Earlier on Sunday, Mr Putin's foreign affairs adviser Yuri Ushakov said the Trump-Putin call before the talks had been \"friendly, benevolent and businesslike\". The US and Russian leaders were due to speak again \"promptly\" after Mr Trump's meeting with Mr Zelenskyy. Attacks over the weekend Mr Ushakov said a \"bold, responsible, political decision\" would have to be made by Ukraine on the Donbas region and other matters in dispute for there to be a \"complete cessation\" of hostilities. In overnight developments, three guided aerial bombs launched by Russia struck private homes in the eastern city of Sloviansk, according to the head of the local military administration, Vadym Lakh. Three people were injured and one man died, Mr Lakh said in a post on the Telegram messenger app."
    },
    {
        "title": "Brigitte Bardot: The bombshell and style icon who walked away from fame and glamour",
        "description": "Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career.",
        "url": "https://news.sky.com/story/brigitte-bardot-film-siren-who-helped-ignite-a-sexual-revolution-13488006",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brigitte-bardot-france_7120715.jpg?20251228113655",
        "type": "Home",
        "Author": "Katie Spencer, arts and entertainment correspondent and Gemma Peplow, entertainment reporter",
        "Date Published": "2025-12-28 10:47:00",
        "Headline": "Brigitte Bardot, who has died aged 91, embodied a new kind of female sexuality on screen - until she walked away from cinema to become an animal rights activist.",
        "Content": "By Katie Spencer, arts and entertainment correspondent and Gemma Peplow, entertainment reporter  Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career. The French star, who has died aged 91, came to embody a new kind of female sexuality on screen that was bold and unapologetic. She was so famous that she became known simply by her initials. Emmanuel Macron said Bardot \"embodied a life of freedom\". Paying tribute, the French president said: \"Her films, her voice, her dazzling glory, her initials, her sorrows, her generous passion for animals, her face that became Marianne\" - referring to the national symbol of France. \"French existence, universal brilliance. She touched us. We mourn a legend of the century.\" The famous faces we said goodbye to in 2025 As a singer, she also released several records during her time in the spotlight, and was famously the muse for Serge Gainsbourg's erotic single Je T'aime... Moi Non Plus. Despite her success, she retired from acting before she had even turned 40, instead choosing to dedicate her time to helping animals. Born in Paris in 1934, Bardot rebelled against a strict upbringing to break into film. She started as a model in the early 1950s, and, after some minor parts, the role that made her a household name came in 1956 - … And God Created Woman. Directed by her then husband Roger Vadim, the film was considered scandalous at the time for its frank depiction of sensuality, daring to challenge conservative post-war norms about women's behaviour and desire. Bardot instantly became a symbol of youthful rebellion, a sex symbol and a style icon - an influence that would be felt for decades, seen in the soft, eye-skimming fringes and cat eyeliner many women still turn to today. Often compared to Marilyn Monroe but with a distinctively European cool, her femininity redefined post-war cinema, captivating audiences. But while she starred in more than 40 films - and proved she could play much more than the seductive ingenue - by 1973, aged only 39, she walked away from the big screen. \"I gave my youth and my beauty to men,\" she said of her retirement. \"I am going to give my wisdom and experience to animals.\" In 1986, Bardot founded the Brigitte Bardot Foundation dedicated to combatting animal cruelty, funding sanctuaries and numerous wildlife rescue operations. Paying tribute to her memory, the foundation called her \"an exceptional woman who gave everything and sacrificed everything for a world more respectful of animals.\" They went on: \"Her legacy lives on through the actions and campaigns that the Foundation pursues with the same passion and unwavering commitment to her ideals.\" In later years, she spoke of feeling \"used\" by the film industry and the media, saying she'd felt increasingly uncomfortable with the constant public scrutiny and the intense objectification she was subjected to. But Bardot was also a controversial figure herself, with her image tarnished in more recent years following a book she published in 2003 entitled A Cry In Silence, for which she was prosecuted for incitement to racial hatred against Muslims. She went on to receive several fines over the years for alleged racism in various statements she made, often in the context of her animal campaigning, and most recently in 2021. But she remained a popular figure to many. While activism and animal welfare were her real passions, she will be best remembered for her lasting influence on international cinema."
    },
    {
        "title": "Cold temperatures forecast for new year, with health alerts issued",
        "description": "Those celebrating the arrival of the new year will have to brave cold temperatures, with an amber health alert in place across parts of the UK.",
        "url": "https://news.sky.com/story/cold-temperatures-forecast-for-new-year-with-health-alerts-issued-13488040",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-richmond-park-freezing_7082310.jpg?20251114202317",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 15:12:00",
        "Headline": "Forecasters warned the end of 2025 will not be \"particularly fantastic\", with temperatures around 7-8C, but things will take a turn for the worse as 2026 arrives.",
        "Content": "Those celebrating the arrival of the new year will have to brave cold temperatures, with an amber health alert in place across parts of the UK. Forecasters warned the end of 2025 will not be \"particularly fantastic\", with temperatures around 7-8C, but things will take a turn for the worse as 2026 arrives. The next few days will be cold and cloudy overall, according to Sky News meteorologist Dr Christopher England, although there will be clearer spells, bringing a threat of overnight frost and fog. It will be breezy in the south, Dr England added, while the north should expect some hard frosts. Find out the forecast for your area Northern areas are expected to be subjected to the worst of the chillier conditions from New Year's Day onwards. Met Office forecaster Dan Stroud said: \"We're losing this sort of settled but chilly conditions, and bringing in something a little bit more showery with more wintry hazards in the forecast, particularly for the north of the country.\" Amber cold health alert issued The UK Health Security Agency (UKHSA) has issued an amber cold health alert for the North East and North West of England - where temperatures are expected to fall to around 3-5C - from 8pm on Sunday to 12pm on 5 January. The agency said the weather is \"likely\" to cause significant impacts across health and social care settings, including a \"rise in deaths\" among those with health conditions or aged 65 or over. It added that the UK may also see \"impacts on younger people\" and said there will likely be an \"increase in demand for health services\" across the regions. Impact from cold temperatures Other impacts include \"temperatures inside places like hospitals and care homes dropping below the levels recommended for assessing health risks\" and \"challenges keeping indoor temperatures at the recommended 18C leading to more risk to vulnerable people\", the UKHSA said. It also warned of staffing issues due to external factors such as travel delays, and said other sectors such as transport and energy could start to see the impacts. The agency also issued a yellow cold health alert for the East Midlands, West Midlands, South East, South West, East of England, Yorkshire and the Humber, and London. Temperatures are expected to fall to around 4-6C from New Year's Day in areas covered by the yellow health alert. Warning of 'serious' health impact Dr Agostinho Sousa, head of extreme events and health protection at UKHSA, said: \"As the colder weather sets in it is vital to check in on friends, family and neighbours that are most vulnerable. \"The forecasted temperatures can have a serious impact on the health of some people, leading to increased risk of heart attacks, strokes and chest infections, particularly for individuals over the age of 65 and those with pre-existing health conditions.\" It comes after a state of emergency was declared in New York as a powerful winter storm disrupted one of the busiest travel weekends of the year."
    },
    {
        "title": "Child dies after 'intense' house fire in Kent",
        "description": "A child has died and another has been taken to hospital after a house fire in Kent.",
        "url": "https://news.sky.com/story/child-dies-after-intense-house-fire-in-kent-13488089",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ashford-kent-fire_7121010.jpg?20251228193921",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 18:04:00",
        "Headline": "An investigation into the cause of the fire has been launched.",
        "Content": "A child has died and another has been taken to hospital after a house fire in Kent. Six fire engines and a height vehicle were sent to a property in the village of Hamstreet, near Ashford, shortly after midday, after an \"intense fire\" spread throughout the home, Kent Fire and Rescue Service (KFRS) said. Ann Millington, KFRS chief executive, said: \"Our thoughts and deepest condolences are with everyone affected by this tragic incident, especially the child's loved ones.\" The fire service said two fire engines and crews remain on the scene to \"dampen down\" the property. Earlier, it urged people living or travelling near the area to close their windows and doors due to the smoke and to stay away. People living or travelling nearby are no longer being advised to close their windows and doors. An investigation into the cause of the fire is ongoing."
    },
    {
        "title": "Hospitals are using AI to slash A&E wait times",
        "description": "Hospitals are using artificial intelligence to slash wait times in emergency departments this winter.",
        "url": "https://news.sky.com/story/hospitals-are-using-ai-to-slash-ae-wait-times-13488070",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hospital-elderly_7066855.jpg?20251030121933",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 22:30:00",
        "Headline": "About 50 organisations in the National Health Service have adopted the technology.",
        "Content": "Hospitals are using artificial intelligence to slash wait times in emergency departments this winter. The technology pinpoints when Accident and Emergency (A&E) demand will be high, allowing hospitals to better plan for shifts and bed space. About 50 organisations in the National Health Service have already adopted the technology \"to do the things that they're trained to do, rather than having to be bound down by bureaucratic processes\", officials said. The forecasting tool relies on historical data such as weather trends to estimate how many patients are likely to visit A&E. Ian Murray, minister for digital government and data, said the hospitals were already seeing \"great results\". \"You've no idea how many people will come through the door, although you can have some analytical evidence that Saturday nights might be busier than a Tuesday night, for example, and the winter might be busier than the summer, unless you have a heatwave, of course,\" he said. \"It helps us to predict how busy their A&E departments are going to be. \n                  The children and families spending a 'different' Christmas in hospital \n                 \n                  What are nicotine pouches and are they safer than smoking?\n                 \n                  'Irresponsible' ads for Chequp and MedExpress weight loss drugs banned\n                 \"If you put that into context and see seasonal trends, along with how busy days are going to be, you can then put your resources in the right place.\" Mr Murray said the tool was focused on \"concentrating what the NHS needs\" to improve efficiency. \"So you can have more consultants of a particular variety on. You can have more nursing staff on,\" he said. \"You can maybe then see about freeing up beds further down the pipeline, maybe see how you might need to get more people out of the hospital quicker, and free up those beds.\" The rollout of the tool forms part of Prime Minister Sir Keir Starmer's AI Exemplars programme, which aims to improve efficiencies in the public service using AI technology. Mr Murray added: \"It's about modernising the NHS, using the tools to allow clinicians and professionals to do the things that they're trained to do, rather than having to be bound down by bureaucratic processes, allowing resources to be targeted where they need to be targeted.\" Read more from Sky News:Wrong body cremated at Glasgow hospitalThe children spending Christmas in hospital 👉Tap here to follow Patient 11 wherever you get your podcasts👈 Secretary of State for Science, Innovation and Technology Liz Kendall said the uptake of the tool took the health system's embrace of AI a \"step further\", with the technology already being utilised in diagnosis and unlocking new treatments. \"By helping to predict demand, this AI forecasting tool is getting patients the care they need faster while supporting our incredible NHS staff,\" she said. \"That means easing pressure by ensuring the NHS is at the forefront of the latest technology during the busiest time of year.\" National medical director for urgent and emergency care at NHS England, professor Julian Redhead, said: \"Early and efficient planning is key to managing busy periods like winter, and new tech like the AI tool has the potential to make a real difference to the way we manage care for patients.\""
    },
    {
        "title": "'Massive numbers' of police to be deployed for Sydney New Year's Eve celebrations",
        "description": "People in Sydney have been urged to show \"defiance\" and celebrate New Year's Eve in the wake of the deadly terror attack in Bondi Beach earlier this month.",
        "url": "https://news.sky.com/story/massive-numbers-of-police-to-be-deployed-for-sydney-new-years-eve-celebrations-13488128",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-bondi-beach_7121114.jpg?20251228225259",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 20:34:00",
        "Headline": "The premier of New South Wales, Chris Minns, called on the public to \"thumb your nose at the terrorists\" and attend 31 December fireworks, according to Sky News Australia.",
        "Content": "People in Sydney have been urged to show \"defiance\" and celebrate New Year's Eve in the wake of the deadly terror attack in Bondi Beach earlier this month. Chris Minns, the premier of New South Wales (NSW), where the coastal city is located, called on the public to \"thumb your nose at the terrorists\" and attend 31 December fireworks and other events, according to Sky News Australia. He also said police will be deployed \"in massive numbers\" and some will be carrying weapons that residents have not seen before, in what is being reported as an unprecedented display of firepower by officers. Fifteen people were killed and more than 40 others were injured in the 14 December shooting, which targeted a Jewish Hanukkah celebration. 'Thumb your nose at the terrorists' According to Sky News Australia, Mr Minns said: \"We have to show defiance by going out and spending time with family and friends over the New Year period. \"Because of the weird ideology of some of these terrorists, what they want is for us to crawl up into a ball and not have fun with our family and friends. \n                  Australian PM booed at Bondi Beach vigil a week after deadly terror attack\n                 \n                  'What they've seen, few people have ever seen': Lifeguards honour Bondi Beach victims\n                 \n                  Australia plans gun buyback scheme in response to Bondi Beach killings \n                 \"I'm calling on the people of Sydney to step out, to do what you would ordinarily do, to thumb your nose at the terrorists.\" Mr Minns said police would be out \"in massive numbers\", with officers carrying a level of firepower never before seen in the state, according to Sky News Australia. Read more about the attack:Suspect trained with father before attack, police sayInside hotel where alleged gunmen stayed during tripPiecing together full story of attack The gun reforms, which passed through the NSW state legislature on Christmas Eve, include limiting individual gun ownership to four and reclassifying high-risk weapons like pump-action firearms. The legislation also tightens licensing by reducing permit terms to two years, restricting ownership to Australian citizens, and removing the review pathway for licence denials. Other new laws will ban the public display of terrorist symbols and grant police expanded powers to restrict public gatherings in specific areas following terrorist incidents. Police said the Bondi Beach attack was allegedly carried out by father and son Sajid and Naveed Akram, inspired by the militant group Islamic ‌State. Sajid Akram was killed by police during the shooting, while his 24-year-old son was taken to hospital and later moved to prison. It was Australia's worst massacre since 1996."
    },
    {
        "title": "One killed in mid-air helicopter crash in New Jersey",
        "description": "Two helicopters crashed into each other in the air in New Jersey, killing one person and critically injuring another.",
        "url": "https://news.sky.com/story/one-killed-in-mid-air-helicopter-crash-in-new-jersey-13488126",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-helicopter-crash-new-jersey_7121038.jpg?20251228204938",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 20:23:00",
        "Headline": "Police and fire crews extinguished flames that engulfed one of the aircraft. Video from the scene showed a helicopter spinning rapidly to the ground.",
        "Content": "Two helicopters crashed into each other in the air in New Jersey, killing one person and critically injuring another. Rescuers responded to a report of an aviation crash around 11.25am local time on Sunday, Hammonton police chief Kevin Friel said. Police and fire crews extinguished flames that engulfed one of the aircraft. One person was killed and another was transported to a nearby hospital with life-threatening injuries. Video from the scene showed a helicopter spinning rapidly to the ground. The Federal Aviation Administration described the scene as a mid-air collision between an Enstrom F-28A helicopter and an Enstrom 280C helicopter over Hammonton Municipal Airport. Only the pilots were on board each aircraft. Read more from Sky News:State of emergency declared in New York as storm disrupts flights $400,000 worth of lobster stolen en route to US wholesale stores The FAA and National Transportation Safety Board will be investigating the crash, Mr Friel said."
    },
    {
        "title": "Nick Kyrgios defeats Aryna Sabalenka to win 'Battle of the Sexes' tennis match",
        "description": "Nick Kyrgios has defeated Aryna Sabalenka to win the latest \"Battle of the Sexes\" tennis exhibition match.",
        "url": "https://news.sky.com/story/nick-kyrgios-defeats-aryna-sabalenka-to-win-battle-of-the-sexes-tennis-match-13488078",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-kyrgios-aryna-sabalenka_7120980.jpg?20251228185850",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-12-28 17:26:00",
        "Headline": "The match in Dubai had modified rules where each player was restricted to one serve rather than two, and Sabalenka's side of the court was reduced in size by 9%.",
        "Content": "Nick Kyrgios has defeated Aryna Sabalenka to win the latest \"Battle of the Sexes\" tennis exhibition match. The injury-wracked Australian maverick, currently ranked 671 in the world, beat the women's world number one in straight sets 6-3 6-3. Sunday's event in Dubai had modified rules where each player was restricted to one serve rather than two, and Sabalenka's side of the court was reduced in size by 9% to compensate for the difference in speed between men and women. A 10-point deciding tiebreak would have been implemented if required, but Kyrgios needed around 70 minutes to defeat the 27-year-old Belarusian. There was laughing and joking between the players, some under-arm serves, and even dancing from Sabalenka during a timeout to entertain the crowd at the 17,000-seat Coca-Cola Arena. The pair are represented by the same agency, which arranged the exhibition match. Kyrgios, 30, negotiated the slightly smaller \"equaliser\" court to break his opponent to love in the third game. \n                  Ukraine 'a lot closer' to peace deal after talks, Donald Trump says - but 'one or two thorny issues' remain\n                 \n                  At least 13 people dead and dozens injured after train derails in Mexico, authorities say\n                 \n                  Vladimir Putin has barely shifted on Ukraine - and any Russian reluctance to peace plan will be a test for Donald Trump\n                 The next four games went against serve before the Australian held to love to move 5-3 ahead, where he broke Sabalenka again on his way to closing out the opening set. Sabalenka threatened to force a comeback when she won three consecutive games to go 3-1 up in the second set, where she used her 60-second timeout to dance to the Macarena, before Kyrgios won the next five games and clinched victory on his third match point. 'Really tough match' After his win, Kyrgios, the 2022 Wimbledon runner-up, said it was a \"really tough match, she is a hell of a player and such a great champion\". He added: \"I didn't really know what to expect. She broke my serve numerous times. Honestly, I had to strap in because she was putting the pressure on. She was hitting some amazing shots.\" \"I would love to play her again and showcase her talent and what I have left in the tank. Ultimately, it was a really hard-fought battle. There were breaks back and forth.\" Before the Dubai event, Kyrgios, who had a career-high ranking of 13 in 2016, was limited to just six tour-level singles matches since 2023 because of wrist and knee injuries. His most recent match was in March this year. Sabalenka won the US Open in August and reached the semi-finals or better in all four Grand Slam tournaments in 2025, with the Belarusian keen to take positives from her loss into the new season. 'A lot of great shots' She said: \"I felt great. I think I put up a great fight and he was struggling. I think it was a great level. I made a lot of great shots, moved a lot to the net, had great drop shots. \"I really enjoyed the show and I feel like next time - when I play him - I already know the tactics. I know his strengths, his weaknesses and it's going to be a better match for sure.\" Read more from Sky News:Tributes to 'devoted family man'Child dies after house fire in Kent The Dubai event had divided opinion in the tennis world. Before the clash, former British number one Greg Rusedski called the event \"a gimmick\" but said it would be a success if it brings non-tennis fans to the sport. The so-called \"Battle of the Sexes\" was a name borrowed from a 1973 match, when Billie Jean King defeated Bobby Riggs at the Houston Astrodome. King won in straight sets and the match took place amid her efforts to start a female tour and get equal pay in tennis. That exhibition followed Riggs beating Margaret Court earlier that year, while other contests dubbed \"Battle of the Sexes\" include Jimmy Connors defeating Martina Navratilova in 1992. Prior to the Dubai event, King said the match was far removed from the classic she played in, but it's \"good\" that it's being talked about."
    },
    {
        "title": "Starmer criticised for celebrating activist's return from Egypt",
        "description": "Sir Keir&#160;Starmer&#160;is facing criticism for celebrating the return of a British activist from detention in Egypt in light of his past social media posts.",
        "url": "https://news.sky.com/story/starmer-criticised-for-celebrating-activists-return-from-egypt-13487984",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-alaa-abd-el-fattah_7028623.jpg?20250922154849",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-28 09:22:00",
        "Headline": "Alaa Abd El-Fattah has been accused of sharing \"extremist\" views on social media.",
        "Content": "Sir Keir Starmer is facing criticism for celebrating the return of a British activist from detention in Egypt in light of his past social media posts. The prime minister said on Friday that he was \"delighted\" that Alaa Abd El-Fattah had been reunited with his loved ones in the UK. Historic posts have since emerged of Mr Abd El-Fattah calling for Zionists to be killed. Shadow justice secretary Robert Jenrick said Sir Keir's \"endorsement\" of him showed poor judgment, claiming he had a \"record of extremist statements about violence, Jews and the police\". It is understood that Sir Keir was not aware of the posts when he welcomed Mr Abd El-Fattah's return. Mr Jenrick said if that is the case, then the prime minister should retract his previous comments welcoming his return, revoke his citizenship and deport him. The Foreign Office said it had been \"a long-standing priority under successive governments\" to work for his release but that it considered the posts \"abhorrent\". \n                  Angola and Namibia agree to take back illegal migrants and criminals\n                 \n                  Afghan veterans should be allowed to plug recruitment gaps in British Army, campaigners say\n                 \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 Mr Abd El-Fattah, a British-Egyptian dual national, was detained in Egypt in 2019 and was later sentenced to five years in prison on charges of spreading false news. His imprisonment was branded a breach of international law by UN investigators and he was freed after being pardoned by Egyptian President Abdel-Fattah el-Sisi in September. The Conservatives had also lobbied for his release. Mr Abd El-Fattah was a leading voice in Egypt's 2011 Arab Spring uprising and went on hunger strikes behind bars. Sir Keir wrote on X: \"I'm delighted that Alaa Abd El-Fattah is back in the UK and has been reunited with his loved ones, who must be feeling profound relief. \"I want to pay tribute to Alaa's family, and to all those that have worked and campaigned for this moment. \"Alaa's case has been a top priority for my government since we came to office. I'm grateful to President Sisi for his decision to grant the pardon.\" Mr Jenrick said the remarks constitute a \"personal, public endorsement\" from the prime minister. In a letter to Sir Keir he wrote: \"Given Mr Abd El-Fattah's record of extremist statements about violence, Jews and the police, it was a serious error of judgment.\" Mr Jenrick referred to posts online going back as far as 2010 that appeared to be from Mr Abd El-Fattah's X account. They include several posts that appear to call for violence towards \"zionists\" and the police. In 2014, his posts on Twitter cost him a nomination for the European Parliament's Sakharov Prize. The group backing him withdrew the nomination for the human rights award, saying they had discovered a tweet from 2012 in which he called for the murder of Israelis. Mr Jenrick later told Sky News that Sir Keir should revoke Mr Abd El-Fattah's citizenship. He also posted on X: \"If the prime minister really was unaware that El Fattah was an extremist, he should immediately retract his comments expressing 'delight' at his arrival and begin proceedings to revoke his citizenship and deport him.\" Read More:Starmer makes cost-of-living promise in Christmas messageFarmers celebrate U-turn on inheritance tax The Jewish Leadership Council also voiced concerns in the wake of recent antisemitic attacks in Manchester and at Australia's Bondi Beach. The council said: \"We are appalled by the effusive welcome Alaa Abd El-Fattah has received from the UK government. \"The prime minister recently reiterated his determination to root out antisemitism from our country but has now shared his delight that someone who has advocated for killing Zionists has arrived in the UK. \"We know from Heaton Park, Manchester and Bondi Beach that there are those who hear such words as a call to action. \"The government has celebrated Mr Abd El-Fattah's arrival as a victory, British Jews will see it as yet another reminder of the danger we face.\" A Foreign Office spokesperson said: \"Mr El-Fattah is a British citizen. It has been a long-standing priority under successive governments to work for his release from detention, and to see him reunited with his family in the UK. \"The government condemns Mr El-Fattah's historic tweets and considers them to be abhorrent.\""
    },
    {
        "title": "Cold temperatures forecast for new year, with health alerts issued",
        "description": "Those celebrating the arrival of the new year will have to brave cold temperatures, with an amber health alert in place across parts of the UK.",
        "url": "https://news.sky.com/story/cold-temperatures-forecast-for-new-year-with-health-alerts-issued-13488040",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-richmond-park-freezing_7082310.jpg?20251114202317",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-28 15:12:00",
        "Headline": "Forecasters warned the end of 2025 will not be \"particularly fantastic\", with temperatures around 7-8C, but things will take a turn for the worse as 2026 arrives.",
        "Content": "Those celebrating the arrival of the new year will have to brave cold temperatures, with an amber health alert in place across parts of the UK. Forecasters warned the end of 2025 will not be \"particularly fantastic\", with temperatures around 7-8C, but things will take a turn for the worse as 2026 arrives. The next few days will be cold and cloudy overall, according to Sky News meteorologist Dr Christopher England, although there will be clearer spells, bringing a threat of overnight frost and fog. It will be breezy in the south, Dr England added, while the north should expect some hard frosts. Find out the forecast for your area Northern areas are expected to be subjected to the worst of the chillier conditions from New Year's Day onwards. Met Office forecaster Dan Stroud said: \"We're losing this sort of settled but chilly conditions, and bringing in something a little bit more showery with more wintry hazards in the forecast, particularly for the north of the country.\" Amber cold health alert issued The UK Health Security Agency (UKHSA) has issued an amber cold health alert for the North East and North West of England - where temperatures are expected to fall to around 3-5C - from 8pm on Sunday to 12pm on 5 January. The agency said the weather is \"likely\" to cause significant impacts across health and social care settings, including a \"rise in deaths\" among those with health conditions or aged 65 or over. It added that the UK may also see \"impacts on younger people\" and said there will likely be an \"increase in demand for health services\" across the regions. Impact from cold temperatures Other impacts include \"temperatures inside places like hospitals and care homes dropping below the levels recommended for assessing health risks\" and \"challenges keeping indoor temperatures at the recommended 18C leading to more risk to vulnerable people\", the UKHSA said. It also warned of staffing issues due to external factors such as travel delays, and said other sectors such as transport and energy could start to see the impacts. The agency also issued a yellow cold health alert for the East Midlands, West Midlands, South East, South West, East of England, Yorkshire and the Humber, and London. Temperatures are expected to fall to around 4-6C from New Year's Day in areas covered by the yellow health alert. Warning of 'serious' health impact Dr Agostinho Sousa, head of extreme events and health protection at UKHSA, said: \"As the colder weather sets in it is vital to check in on friends, family and neighbours that are most vulnerable. \"The forecasted temperatures can have a serious impact on the health of some people, leading to increased risk of heart attacks, strokes and chest infections, particularly for individuals over the age of 65 and those with pre-existing health conditions.\" It comes after a state of emergency was declared in New York as a powerful winter storm disrupted one of the busiest travel weekends of the year."
    },
    {
        "title": "Child dies after 'intense' house fire in Kent",
        "description": "A child has died and another has been taken to hospital after a house fire in Kent.",
        "url": "https://news.sky.com/story/child-dies-after-intense-house-fire-in-kent-13488089",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-ashford-kent-fire_7121010.jpg?20251228193921",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-28 18:04:00",
        "Headline": "An investigation into the cause of the fire has been launched.",
        "Content": "A child has died and another has been taken to hospital after a house fire in Kent. Six fire engines and a height vehicle were sent to a property in the village of Hamstreet, near Ashford, shortly after midday, after an \"intense fire\" spread throughout the home, Kent Fire and Rescue Service (KFRS) said. Ann Millington, KFRS chief executive, said: \"Our thoughts and deepest condolences are with everyone affected by this tragic incident, especially the child's loved ones.\" The fire service said two fire engines and crews remain on the scene to \"dampen down\" the property. Earlier, it urged people living or travelling near the area to close their windows and doors due to the smoke and to stay away. People living or travelling nearby are no longer being advised to close their windows and doors. An investigation into the cause of the fire is ongoing."
    },
    {
        "title": "Hospitals are using AI to slash A&E wait times",
        "description": "Hospitals are using artificial intelligence to slash wait times in emergency departments this winter.",
        "url": "https://news.sky.com/story/hospitals-are-using-ai-to-slash-ae-wait-times-13488070",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hospital-elderly_7066855.jpg?20251030121933",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-28 22:30:00",
        "Headline": "About 50 organisations in the National Health Service have adopted the technology.",
        "Content": "Hospitals are using artificial intelligence to slash wait times in emergency departments this winter. The technology pinpoints when Accident and Emergency (A&E) demand will be high, allowing hospitals to better plan for shifts and bed space. About 50 organisations in the National Health Service have already adopted the technology \"to do the things that they're trained to do, rather than having to be bound down by bureaucratic processes\", officials said. The forecasting tool relies on historical data such as weather trends to estimate how many patients are likely to visit A&E. Ian Murray, minister for digital government and data, said the hospitals were already seeing \"great results\". \"You've no idea how many people will come through the door, although you can have some analytical evidence that Saturday nights might be busier than a Tuesday night, for example, and the winter might be busier than the summer, unless you have a heatwave, of course,\" he said. \"It helps us to predict how busy their A&E departments are going to be. \n                  The children and families spending a 'different' Christmas in hospital \n                 \n                  What are nicotine pouches and are they safer than smoking?\n                 \n                  'Irresponsible' ads for Chequp and MedExpress weight loss drugs banned\n                 \"If you put that into context and see seasonal trends, along with how busy days are going to be, you can then put your resources in the right place.\" Mr Murray said the tool was focused on \"concentrating what the NHS needs\" to improve efficiency. \"So you can have more consultants of a particular variety on. You can have more nursing staff on,\" he said. \"You can maybe then see about freeing up beds further down the pipeline, maybe see how you might need to get more people out of the hospital quicker, and free up those beds.\" The rollout of the tool forms part of Prime Minister Sir Keir Starmer's AI Exemplars programme, which aims to improve efficiencies in the public service using AI technology. Mr Murray added: \"It's about modernising the NHS, using the tools to allow clinicians and professionals to do the things that they're trained to do, rather than having to be bound down by bureaucratic processes, allowing resources to be targeted where they need to be targeted.\" Read more from Sky News:Wrong body cremated at Glasgow hospitalThe children spending Christmas in hospital 👉Tap here to follow Patient 11 wherever you get your podcasts👈 Secretary of State for Science, Innovation and Technology Liz Kendall said the uptake of the tool took the health system's embrace of AI a \"step further\", with the technology already being utilised in diagnosis and unlocking new treatments. \"By helping to predict demand, this AI forecasting tool is getting patients the care they need faster while supporting our incredible NHS staff,\" she said. \"That means easing pressure by ensuring the NHS is at the forefront of the latest technology during the busiest time of year.\" National medical director for urgent and emergency care at NHS England, professor Julian Redhead, said: \"Early and efficient planning is key to managing busy periods like winter, and new tech like the AI tool has the potential to make a real difference to the way we manage care for patients.\""
    },
    {
        "title": "Former England striker Andy Carroll set to appear in court after arrest",
        "description": "Former Newcastle United and Liverpool striker Andy Carroll is set to appear in court next week after being charged with breaching a non-molestation order.",
        "url": "https://news.sky.com/story/former-england-striker-andy-carroll-set-to-appear-in-court-after-arrest-13488071",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-andy-carroll-newcastle_7120876.jpg?20251228170614",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-12-28 16:56:00",
        "Headline": "The ex-Newcastle and Liverpool footballer, who now plays for National League South club Dagenham and Redbridge, was detained in April.",
        "Content": "Former Newcastle United and Liverpool striker Andy Carroll is set to appear in court next week after being charged with breaching a non-molestation order. The ex-England footballer, who now plays for National League South club Dagenham and Redbridge, was arrested in April this year following an alleged incident the previous month. Carroll, 36, is due to appear at Chelmsford Magistrates' Court on Tuesday. In a statement, Essex Police said: \"A man has been charged with breaching a non-molestation order. \"Andrew Carroll, 36, of Epping, was arrested on 27 April and the alleged offences relate to an incident in March this year. \"He is due to appear at Chelmsford Magistrates' Court on 30 December.\" A non-molestation order is a UK court injunction, normally to stop a person from contacting another individual. \n                  Tributes paid to 'devoted family man' following death of 66-year-old punched outside village pub\n                 \n                  Starmer criticised for celebrating activist's return from Egypt\n                 \n                  Christmas Day shooting leaves man fighting for life\n                 The punishment for breaching the order ranges from a fine to up to five years in jail to the most serious of cases. Carroll played for England nine times between 2010 and 2012. Read more from Sky News:Tributes paid to 'devoted family man'Starmer accused of endorsing 'extremist' In 2011, he moved from Newcastle to Liverpool for a then Anfield record of £35m. He has also previously played for West Ham, Reading and West Brom. After a spell in France with Amiens and Bordeaux, he signed for Dagenham and Redbridge in July."
    },
    {
        "title": "Ukraine 'a lot closer' to peace deal after talks, Donald Trump says - but 'one or two thorny issues' remain",
        "description": "Donald Trump and Volodymyr Zelenskyy say they have made \"a lot of progress\" towards finalising a peace agreement to end Russia's war in Ukraine - although \"one or two very thorny issues\" remain.",
        "url": "https://news.sky.com/story/ukraine-a-lot-closer-to-peace-deal-after-talks-donald-trump-says-but-one-or-two-thorny-issues-remain-13488138",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-donald-trump-volodymyr-zelenskyy_7121109.jpg?20251228224534",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-28 21:37:00",
        "Headline": "Donald Trump and Volodymyr Zelenskyy spoke for around two hours during their latest meeting, held at the US leader's residence in Mar-a-Lago, Florida.",
        "Content": "Donald Trump and Volodymyr Zelenskyy say they have made \"a lot of progress\" towards finalising a peace agreement to end Russia's war in Ukraine - although \"one or two very thorny issues\" remain. At a news conference following around two hours of talks at Mr Trump's residence in Mar-a-Lago, Florida, the two leaders hailed an \"excellent\" meeting during which they discussed \"all aspects\" of a 20-point peace framework. The US president said the outcome of the talks would be known in a few weeks, saying Ukraine is \"a lot closer\" to a deal and that the pair had \"made a lot of progress on ending that war\". Russia \"wants to see Ukraine succeed\", he maintained at the news conference, during which he repeatedly praised the Ukrainian leader as \"brave\". Mr Zelenskyy said the 20-point peace plan was \"90% agreed\", with US-Ukraine security guarantees 100% agreed - although Mr Trump put the security agreements at 95%. \"We agreed that security guarantees are a key milestone in achieving lasting peace and our teams will continue working on all aspects,\" Mr Zelenskyy said. Opening the floor to questions from the media, which started with the issue of security, Mr Trump said: \"I just think we're doing very well. We could be very close or one or two very thorny issues, very tough issues. But I think we're doing very well. \"We've made a lot of progress today, but really we've made it over the last month. This is not a one-day process deal. There's very complicated stuff.\" Asked which thorny issues remain unsolved, Trump said the issue of some Ukrainian land. The Donbas issue Russian leader Vladimir Putin wants to take control of Ukraine's eastern Donbas region as a condition for ending the war, despite not controlling the entire area. Ukraine has previously ruled out accepting this. Speaking about the Donbas region, Mr Zelenskyy said he had to \"respect our law and our people\", as well as the territory controlled by Ukraine. \"And of course, our attitude is very clear,\" he said. \"That's why President Trump said this is a very tough question.\" Ukraine has \"a different position to Russia\" on the matter, he added. Mr Trump was also asked about Ukraine's Zaporizhzhia nuclear plant, which has been under Russian control since the war began in February 2022. Mr Putin is \"working with Ukraine on getting it open\", the US president said. \"He's been very good in that sense. He wants to see that open.\" \"He hasn't hit it with missiles,\" Mr Trump added. The US president, who spoke with Mr Putin earlier in the day, insisted the Russian leader is \"very serious\" about peace in Ukraine, despite Moscow launching attacks on Kyiv ahead of the talks. The meeting in Florida was the latest stage in Mr Trump's year-long effort to secure a ceasefire, after previously saying he would end the war on the first day of his term in office. UK 'committed to sustaining momentum' Following the discussion, Mr Trump and Mr Zelenskyy spoke with European leaders, including Sir Keir Starmer. A Downing Street spokesperson said the UK prime minister was eager to sustain the momentum of the peace talks. \"The discussion focused on ongoing efforts to secure a just and lasting peace in Ukraine, with leaders commending President Trump for the progress achieved so far,\" a statement said. \"They underlined the importance of robust security guarantees and reaffirmed the urgency of ending this barbaric war as soon as possible.\" Read more from Sky News:The pictures that defined 2025Man discovers architect of the Holocaust was his grandfather The spokesperson said Sir Keir had emphasised the UK's \"commitment to working closely with partners to sustain momentum in the coming days - with President Trump highlighting his leadership in driving coordinated international support for Ukraine as talks continue\". Earlier on Sunday, Mr Putin's foreign affairs adviser Yuri Ushakov said the Trump-Putin call before the talks had been \"friendly, benevolent and businesslike\". The US and Russian leaders were due to speak again \"promptly\" after Mr Trump's meeting with Mr Zelenskyy. Attacks over the weekend Mr Ushakov said a \"bold, responsible, political decision\" would have to be made by Ukraine on the Donbas region and other matters in dispute for there to be a \"complete cessation\" of hostilities. In overnight developments, three guided aerial bombs launched by Russia struck private homes in the eastern city of Sloviansk, according to the head of the local military administration, Vadym Lakh. Three people were injured and one man died, Mr Lakh said in a post on the Telegram messenger app."
    },
    {
        "title": "Vladimir Putin has barely shifted on Ukraine - and any Russian reluctance to peace plan will be a test for Donald Trump",
        "description": "Amid the forward momentum, it's telling that Trump touched the brakes.",
        "url": "https://news.sky.com/story/vladimir-putin-has-barely-shifted-on-ukraine-and-any-russian-reluctance-to-peace-plan-will-be-a-test-for-donald-trump-13487952",
        "image_url": "https://e3.365dm.com/25/11/1920x1080/skynews-putin-trump-zelenskyy_7092050.jpg?20251126000820",
        "type": "World",
        "Author": "James Matthews",
        "Date Published": "2025-12-28 02:21:00",
        "Headline": "Volodymyr Zelenskyy is due to meet Donald Trump in Florida later today, to discuss a new 20-point peace plan for ending the war in Ukraine.",
        "Content": "\n          US correspondent\n              @jamesmatthewsky\n Amid the forward momentum, it's telling that Trump touched the brakes. \"He doesn't have anything until I approve it,\" is how he trailed Volodymyr Zelenskyy's upcoming visit to Mar-a-Lago. The Ukrainian leader has spoken of a peace plan that's \"90% ready\" but, as the guest markets its potential, the host isn't buying - yet, at least. Any breakthrough breaks down on Russian refusal and Donald Trump needs no reminding - it's the evergreen reality that has undermined peace efforts and tested his diplomatic muscle with Moscow, often with unflattering results. Zelenskyy and coalition allies have talked him back from the brink - a sell-out, as they saw it, when the US floated a 28-point plan that read like a Russian wish list. The 20-point version crafted in Kyiv includes compromise and Zelenskyy talks of a \"good conversation\" with Trump's envoy Steve Witkoff and son-in-law Jared Kushner, in teeing up a tete-a-tete with the man himself. 👉 Listen to Sky News Daily on your podcast app 👈 So far, so promising - but relative silence from Moscow screams otherwise. Russian officials have made some optimistic noises but they have been measured and minimal. Vladimir Putin has barely shifted from his original position on Ukraine and there's limited expectation that will change this weekend. Why would it? This is a Russian leader basking in the bonhomie of a president reshaping US relations to Moscow's advantage and he senses opportunity to pursue territorial ambitions. Antagonism between the US and European allies is but another benefit to Putin of things as they are. Read more:Peace talks: What are the main issues remaining? In such circumstances, a framework proposal that locks down his ambition, long-term, won't necessarily land well in Moscow. Is that why he played down the significance of the Zelenskyy plan? Not for the first time, any Russian reluctance will be a test for Donald Trump - of strength, diplomacy, and of where his loyalties lie."
    },
    {
        "title": "Brigitte Bardot: The bombshell and style icon who walked away from fame and glamour",
        "description": "Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career.",
        "url": "https://news.sky.com/story/brigitte-bardot-film-siren-who-helped-ignite-a-sexual-revolution-13488006",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brigitte-bardot-france_7120715.jpg?20251228113655",
        "type": "World",
        "Author": "Katie Spencer, arts and entertainment correspondent and Gemma Peplow, entertainment reporter",
        "Date Published": "2025-12-28 10:47:00",
        "Headline": "Brigitte Bardot, who has died aged 91, embodied a new kind of female sexuality on screen - until she walked away from cinema to become an animal rights activist.",
        "Content": "By Katie Spencer, arts and entertainment correspondent and Gemma Peplow, entertainment reporter  Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career. The French star, who has died aged 91, came to embody a new kind of female sexuality on screen that was bold and unapologetic. She was so famous that she became known simply by her initials. Emmanuel Macron said Bardot \"embodied a life of freedom\". Paying tribute, the French president said: \"Her films, her voice, her dazzling glory, her initials, her sorrows, her generous passion for animals, her face that became Marianne\" - referring to the national symbol of France. \"French existence, universal brilliance. She touched us. We mourn a legend of the century.\" The famous faces we said goodbye to in 2025 As a singer, she also released several records during her time in the spotlight, and was famously the muse for Serge Gainsbourg's erotic single Je T'aime... Moi Non Plus. Despite her success, she retired from acting before she had even turned 40, instead choosing to dedicate her time to helping animals. Born in Paris in 1934, Bardot rebelled against a strict upbringing to break into film. She started as a model in the early 1950s, and, after some minor parts, the role that made her a household name came in 1956 - … And God Created Woman. Directed by her then husband Roger Vadim, the film was considered scandalous at the time for its frank depiction of sensuality, daring to challenge conservative post-war norms about women's behaviour and desire. Bardot instantly became a symbol of youthful rebellion, a sex symbol and a style icon - an influence that would be felt for decades, seen in the soft, eye-skimming fringes and cat eyeliner many women still turn to today. Often compared to Marilyn Monroe but with a distinctively European cool, her femininity redefined post-war cinema, captivating audiences. But while she starred in more than 40 films - and proved she could play much more than the seductive ingenue - by 1973, aged only 39, she walked away from the big screen. \"I gave my youth and my beauty to men,\" she said of her retirement. \"I am going to give my wisdom and experience to animals.\" In 1986, Bardot founded the Brigitte Bardot Foundation dedicated to combatting animal cruelty, funding sanctuaries and numerous wildlife rescue operations. Paying tribute to her memory, the foundation called her \"an exceptional woman who gave everything and sacrificed everything for a world more respectful of animals.\" They went on: \"Her legacy lives on through the actions and campaigns that the Foundation pursues with the same passion and unwavering commitment to her ideals.\" In later years, she spoke of feeling \"used\" by the film industry and the media, saying she'd felt increasingly uncomfortable with the constant public scrutiny and the intense objectification she was subjected to. But Bardot was also a controversial figure herself, with her image tarnished in more recent years following a book she published in 2003 entitled A Cry In Silence, for which she was prosecuted for incitement to racial hatred against Muslims. She went on to receive several fines over the years for alleged racism in various statements she made, often in the context of her animal campaigning, and most recently in 2021. But she remained a popular figure to many. While activism and animal welfare were her real passions, she will be best remembered for her lasting influence on international cinema."
    },
    {
        "title": "'Massive numbers' of police to be deployed for Sydney New Year's Eve celebrations",
        "description": "People in Sydney have been urged to show \"defiance\" and celebrate New Year's Eve in the wake of the deadly terror attack in Bondi Beach earlier this month.",
        "url": "https://news.sky.com/story/massive-numbers-of-police-to-be-deployed-for-sydney-new-years-eve-celebrations-13488128",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-police-bondi-beach_7121114.jpg?20251228225259",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-28 20:34:00",
        "Headline": "The premier of New South Wales, Chris Minns, called on the public to \"thumb your nose at the terrorists\" and attend 31 December fireworks, according to Sky News Australia.",
        "Content": "People in Sydney have been urged to show \"defiance\" and celebrate New Year's Eve in the wake of the deadly terror attack in Bondi Beach earlier this month. Chris Minns, the premier of New South Wales (NSW), where the coastal city is located, called on the public to \"thumb your nose at the terrorists\" and attend 31 December fireworks and other events, according to Sky News Australia. He also said police will be deployed \"in massive numbers\" and some will be carrying weapons that residents have not seen before, in what is being reported as an unprecedented display of firepower by officers. Fifteen people were killed and more than 40 others were injured in the 14 December shooting, which targeted a Jewish Hanukkah celebration. 'Thumb your nose at the terrorists' According to Sky News Australia, Mr Minns said: \"We have to show defiance by going out and spending time with family and friends over the New Year period. \"Because of the weird ideology of some of these terrorists, what they want is for us to crawl up into a ball and not have fun with our family and friends. \n                  Australian PM booed at Bondi Beach vigil a week after deadly terror attack\n                 \n                  'What they've seen, few people have ever seen': Lifeguards honour Bondi Beach victims\n                 \n                  Australia plans gun buyback scheme in response to Bondi Beach killings \n                 \"I'm calling on the people of Sydney to step out, to do what you would ordinarily do, to thumb your nose at the terrorists.\" Mr Minns said police would be out \"in massive numbers\", with officers carrying a level of firepower never before seen in the state, according to Sky News Australia. Read more about the attack:Suspect trained with father before attack, police sayInside hotel where alleged gunmen stayed during tripPiecing together full story of attack The gun reforms, which passed through the NSW state legislature on Christmas Eve, include limiting individual gun ownership to four and reclassifying high-risk weapons like pump-action firearms. The legislation also tightens licensing by reducing permit terms to two years, restricting ownership to Australian citizens, and removing the review pathway for licence denials. Other new laws will ban the public display of terrorist symbols and grant police expanded powers to restrict public gatherings in specific areas following terrorist incidents. Police said the Bondi Beach attack was allegedly carried out by father and son Sajid and Naveed Akram, inspired by the militant group Islamic ‌State. Sajid Akram was killed by police during the shooting, while his 24-year-old son was taken to hospital and later moved to prison. It was Australia's worst massacre since 1996."
    },
    {
        "title": "Nick Kyrgios defeats Aryna Sabalenka to win 'Battle of the Sexes' tennis match",
        "description": "Nick Kyrgios has defeated Aryna Sabalenka to win the latest \"Battle of the Sexes\" tennis exhibition match.",
        "url": "https://news.sky.com/story/nick-kyrgios-defeats-aryna-sabalenka-to-win-battle-of-the-sexes-tennis-match-13488078",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-nick-kyrgios-aryna-sabalenka_7120980.jpg?20251228185850",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-12-28 17:26:00",
        "Headline": "The match in Dubai had modified rules where each player was restricted to one serve rather than two, and Sabalenka's side of the court was reduced in size by 9%.",
        "Content": "Nick Kyrgios has defeated Aryna Sabalenka to win the latest \"Battle of the Sexes\" tennis exhibition match. The injury-wracked Australian maverick, currently ranked 671 in the world, beat the women's world number one in straight sets 6-3 6-3. Sunday's event in Dubai had modified rules where each player was restricted to one serve rather than two, and Sabalenka's side of the court was reduced in size by 9% to compensate for the difference in speed between men and women. A 10-point deciding tiebreak would have been implemented if required, but Kyrgios needed around 70 minutes to defeat the 27-year-old Belarusian. There was laughing and joking between the players, some under-arm serves, and even dancing from Sabalenka during a timeout to entertain the crowd at the 17,000-seat Coca-Cola Arena. The pair are represented by the same agency, which arranged the exhibition match. Kyrgios, 30, negotiated the slightly smaller \"equaliser\" court to break his opponent to love in the third game. \n                  Ukraine 'a lot closer' to peace deal after talks, Donald Trump says - but 'one or two thorny issues' remain\n                 \n                  At least 13 people dead and dozens injured after train derails in Mexico, authorities say\n                 \n                  Vladimir Putin has barely shifted on Ukraine - and any Russian reluctance to peace plan will be a test for Donald Trump\n                 The next four games went against serve before the Australian held to love to move 5-3 ahead, where he broke Sabalenka again on his way to closing out the opening set. Sabalenka threatened to force a comeback when she won three consecutive games to go 3-1 up in the second set, where she used her 60-second timeout to dance to the Macarena, before Kyrgios won the next five games and clinched victory on his third match point. 'Really tough match' After his win, Kyrgios, the 2022 Wimbledon runner-up, said it was a \"really tough match, she is a hell of a player and such a great champion\". He added: \"I didn't really know what to expect. She broke my serve numerous times. Honestly, I had to strap in because she was putting the pressure on. She was hitting some amazing shots.\" \"I would love to play her again and showcase her talent and what I have left in the tank. Ultimately, it was a really hard-fought battle. There were breaks back and forth.\" Before the Dubai event, Kyrgios, who had a career-high ranking of 13 in 2016, was limited to just six tour-level singles matches since 2023 because of wrist and knee injuries. His most recent match was in March this year. Sabalenka won the US Open in August and reached the semi-finals or better in all four Grand Slam tournaments in 2025, with the Belarusian keen to take positives from her loss into the new season. 'A lot of great shots' She said: \"I felt great. I think I put up a great fight and he was struggling. I think it was a great level. I made a lot of great shots, moved a lot to the net, had great drop shots. \"I really enjoyed the show and I feel like next time - when I play him - I already know the tactics. I know his strengths, his weaknesses and it's going to be a better match for sure.\" Read more from Sky News:Tributes to 'devoted family man'Child dies after house fire in Kent The Dubai event had divided opinion in the tennis world. Before the clash, former British number one Greg Rusedski called the event \"a gimmick\" but said it would be a success if it brings non-tennis fans to the sport. The so-called \"Battle of the Sexes\" was a name borrowed from a 1973 match, when Billie Jean King defeated Bobby Riggs at the Houston Astrodome. King won in straight sets and the match took place amid her efforts to start a female tour and get equal pay in tennis. That exhibition followed Riggs beating Margaret Court earlier that year, while other contests dubbed \"Battle of the Sexes\" include Jimmy Connors defeating Martina Navratilova in 1992. Prior to the Dubai event, King said the match was far removed from the classic she played in, but it's \"good\" that it's being talked about."
    },
    {
        "title": "$400,000 worth of lobster stolen en route to Costco wholesale stores in US",
        "description": "A $400,000 (&#163;295,000) shipment of lobster was stolen in transit to Costco wholesale stores in the US, a freight company's president has said.",
        "url": "https://news.sky.com/story/400000-worth-of-lobster-stolen-en-route-to-costco-wholesale-stores-in-us-13487953",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-lobster-ice_7120559.jpg?20251228034307",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-28 03:26:00",
        "Headline": "Dylan Rexing, president and chief executive of logistics firm Rexing Companies, said he believes the seafood was stolen by a driver impersonating a legitimate carrier.",
        "Content": "A $400,000 (£295,000) shipment of lobster was stolen in transit to Costco wholesale stores in the US, a freight company's president has said. The lobsters, which were not alive, were being transported by Rexing Companies to stores in Illinois and Minnesota, Sky News' US partner NBC reported. The shipment was reportedly picked up in Taunton, Massachusetts, but never reached its destination. Dylan Rexing, Rexing's president and chief executive, said in a statement that he believes the seafood was stolen by a driver impersonating a legitimate carrier. \"This theft wasn't random,\" he said. \"It followed a pattern we're seeing more and more, where criminals impersonate legitimate carriers using spoofed emails and burner phones to hijack high-value freight while it's in transit.\" He said the loss was \"significant\" for the company, which is based in Indiana. \"It forces tough decisions and ultimately drives up costs across the supply chain - costs consumers ultimately end up paying.\" Costco did not immediately return NBC's request for comment. The theft is being investigated by the FBI, according to US media reports. \"Brokers are on the front lines of this problem, but we need federal agencies to have modern enforcement tools to keep pace with organised criminal networks,\" Mr Rexing said. \"Until that happens, these thefts will continue to disrupt businesses and impact everyday prices.\""
    },
    {
        "title": "One killed in mid-air helicopter crash in New Jersey",
        "description": "Two helicopters crashed into each other in the air in New Jersey, killing one person and critically injuring another.",
        "url": "https://news.sky.com/story/one-killed-in-mid-air-helicopter-crash-in-new-jersey-13488126",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-helicopter-crash-new-jersey_7121038.jpg?20251228204938",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-12-28 20:23:00",
        "Headline": "Police and fire crews extinguished flames that engulfed one of the aircraft. Video from the scene showed a helicopter spinning rapidly to the ground.",
        "Content": "Two helicopters crashed into each other in the air in New Jersey, killing one person and critically injuring another. Rescuers responded to a report of an aviation crash around 11.25am local time on Sunday, Hammonton police chief Kevin Friel said. Police and fire crews extinguished flames that engulfed one of the aircraft. One person was killed and another was transported to a nearby hospital with life-threatening injuries. Video from the scene showed a helicopter spinning rapidly to the ground. The Federal Aviation Administration described the scene as a mid-air collision between an Enstrom F-28A helicopter and an Enstrom 280C helicopter over Hammonton Municipal Airport. Only the pilots were on board each aircraft. Read more from Sky News:State of emergency declared in New York as storm disrupts flights $400,000 worth of lobster stolen en route to US wholesale stores The FAA and National Transportation Safety Board will be investigating the crash, Mr Friel said."
    },
    {
        "title": "Starmer criticised for celebrating activist's return from Egypt",
        "description": "Sir Keir&#160;Starmer&#160;is facing criticism for celebrating the return of a British activist from detention in Egypt in light of his past social media posts.",
        "url": "https://news.sky.com/story/starmer-criticised-for-celebrating-activists-return-from-egypt-13487984",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-alaa-abd-el-fattah_7028623.jpg?20250922154849",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-12-28 09:22:00",
        "Headline": "Alaa Abd El-Fattah has been accused of sharing \"extremist\" views on social media.",
        "Content": "Sir Keir Starmer is facing criticism for celebrating the return of a British activist from detention in Egypt in light of his past social media posts. The prime minister said on Friday that he was \"delighted\" that Alaa Abd El-Fattah had been reunited with his loved ones in the UK. Historic posts have since emerged of Mr Abd El-Fattah calling for Zionists to be killed. Shadow justice secretary Robert Jenrick said Sir Keir's \"endorsement\" of him showed poor judgment, claiming he had a \"record of extremist statements about violence, Jews and the police\". It is understood that Sir Keir was not aware of the posts when he welcomed Mr Abd El-Fattah's return. Mr Jenrick said if that is the case, then the prime minister should retract his previous comments welcoming his return, revoke his citizenship and deport him. The Foreign Office said it had been \"a long-standing priority under successive governments\" to work for his release but that it considered the posts \"abhorrent\". \n                  Angola and Namibia agree to take back illegal migrants and criminals\n                 \n                  Afghan veterans should be allowed to plug recruitment gaps in British Army, campaigners say\n                 \n                  TUC leader: Sir Keir Starmer must tackle cost of living crisis to counter 'real danger' of Reform\n                 Mr Abd El-Fattah, a British-Egyptian dual national, was detained in Egypt in 2019 and was later sentenced to five years in prison on charges of spreading false news. His imprisonment was branded a breach of international law by UN investigators and he was freed after being pardoned by Egyptian President Abdel-Fattah el-Sisi in September. The Conservatives had also lobbied for his release. Mr Abd El-Fattah was a leading voice in Egypt's 2011 Arab Spring uprising and went on hunger strikes behind bars. Sir Keir wrote on X: \"I'm delighted that Alaa Abd El-Fattah is back in the UK and has been reunited with his loved ones, who must be feeling profound relief. \"I want to pay tribute to Alaa's family, and to all those that have worked and campaigned for this moment. \"Alaa's case has been a top priority for my government since we came to office. I'm grateful to President Sisi for his decision to grant the pardon.\" Mr Jenrick said the remarks constitute a \"personal, public endorsement\" from the prime minister. In a letter to Sir Keir he wrote: \"Given Mr Abd El-Fattah's record of extremist statements about violence, Jews and the police, it was a serious error of judgment.\" Mr Jenrick referred to posts online going back as far as 2010 that appeared to be from Mr Abd El-Fattah's X account. They include several posts that appear to call for violence towards \"zionists\" and the police. In 2014, his posts on Twitter cost him a nomination for the European Parliament's Sakharov Prize. The group backing him withdrew the nomination for the human rights award, saying they had discovered a tweet from 2012 in which he called for the murder of Israelis. Mr Jenrick later told Sky News that Sir Keir should revoke Mr Abd El-Fattah's citizenship. He also posted on X: \"If the prime minister really was unaware that El Fattah was an extremist, he should immediately retract his comments expressing 'delight' at his arrival and begin proceedings to revoke his citizenship and deport him.\" Read More:Starmer makes cost-of-living promise in Christmas messageFarmers celebrate U-turn on inheritance tax The Jewish Leadership Council also voiced concerns in the wake of recent antisemitic attacks in Manchester and at Australia's Bondi Beach. The council said: \"We are appalled by the effusive welcome Alaa Abd El-Fattah has received from the UK government. \"The prime minister recently reiterated his determination to root out antisemitism from our country but has now shared his delight that someone who has advocated for killing Zionists has arrived in the UK. \"We know from Heaton Park, Manchester and Bondi Beach that there are those who hear such words as a call to action. \"The government has celebrated Mr Abd El-Fattah's arrival as a victory, British Jews will see it as yet another reminder of the danger we face.\" A Foreign Office spokesperson said: \"Mr El-Fattah is a British citizen. It has been a long-standing priority under successive governments to work for his release from detention, and to see him reunited with his family in the UK. \"The government condemns Mr El-Fattah's historic tweets and considers them to be abhorrent.\""
    },
    {
        "title": "Brigitte Bardot: The bombshell and style icon who walked away from fame and glamour",
        "description": "Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career.",
        "url": "https://news.sky.com/story/brigitte-bardot-film-siren-who-helped-ignite-a-sexual-revolution-13488006",
        "image_url": "https://e3.365dm.com/25/12/1920x1080/skynews-brigitte-bardot-france_7120715.jpg?20251228113655",
        "type": "Entertainment",
        "Author": "Katie Spencer, arts and entertainment correspondent and Gemma Peplow, entertainment reporter",
        "Date Published": "2025-12-28 10:47:00",
        "Headline": "Brigitte Bardot, who has died aged 91, embodied a new kind of female sexuality on screen - until she walked away from cinema to become an animal rights activist.",
        "Content": "By Katie Spencer, arts and entertainment correspondent and Gemma Peplow, entertainment reporter  Brigitte Bardot was the sultry film siren who helped ignite a sexual revolution, a woman whose cultural significance extended beyond her acting career. The French star, who has died aged 91, came to embody a new kind of female sexuality on screen that was bold and unapologetic. She was so famous that she became known simply by her initials. Emmanuel Macron said Bardot \"embodied a life of freedom\". Paying tribute, the French president said: \"Her films, her voice, her dazzling glory, her initials, her sorrows, her generous passion for animals, her face that became Marianne\" - referring to the national symbol of France. \"French existence, universal brilliance. She touched us. We mourn a legend of the century.\" The famous faces we said goodbye to in 2025 As a singer, she also released several records during her time in the spotlight, and was famously the muse for Serge Gainsbourg's erotic single Je T'aime... Moi Non Plus. Despite her success, she retired from acting before she had even turned 40, instead choosing to dedicate her time to helping animals. Born in Paris in 1934, Bardot rebelled against a strict upbringing to break into film. She started as a model in the early 1950s, and, after some minor parts, the role that made her a household name came in 1956 - … And God Created Woman. Directed by her then husband Roger Vadim, the film was considered scandalous at the time for its frank depiction of sensuality, daring to challenge conservative post-war norms about women's behaviour and desire. Bardot instantly became a symbol of youthful rebellion, a sex symbol and a style icon - an influence that would be felt for decades, seen in the soft, eye-skimming fringes and cat eyeliner many women still turn to today. Often compared to Marilyn Monroe but with a distinctively European cool, her femininity redefined post-war cinema, captivating audiences. But while she starred in more than 40 films - and proved she could play much more than the seductive ingenue - by 1973, aged only 39, she walked away from the big screen. \"I gave my youth and my beauty to men,\" she said of her retirement. \"I am going to give my wisdom and experience to animals.\" In 1986, Bardot founded the Brigitte Bardot Foundation dedicated to combatting animal cruelty, funding sanctuaries and numerous wildlife rescue operations. Paying tribute to her memory, the foundation called her \"an exceptional woman who gave everything and sacrificed everything for a world more respectful of animals.\" They went on: \"Her legacy lives on through the actions and campaigns that the Foundation pursues with the same passion and unwavering commitment to her ideals.\" In later years, she spoke of feeling \"used\" by the film industry and the media, saying she'd felt increasingly uncomfortable with the constant public scrutiny and the intense objectification she was subjected to. But Bardot was also a controversial figure herself, with her image tarnished in more recent years following a book she published in 2003 entitled A Cry In Silence, for which she was prosecuted for incitement to racial hatred against Muslims. She went on to receive several fines over the years for alleged racism in various statements she made, often in the context of her animal campaigning, and most recently in 2021. But she remained a popular figure to many. While activism and animal welfare were her real passions, she will be best remembered for her lasting influence on international cinema."
    }
]