[
    {
        "title": "Hamas releases more bodies of hostages - as Trump threatens 'violent' disarmament",
        "description": "Israel has received the bodies of four hostages taken by Hamas during the October 7 attacks, as pressure grows on the group to locate the remaining victims as part of the Gaza ceasefire deal.",
        "url": "https://news.sky.com/story/hamas-releases-more-bodies-of-hostages-as-trump-threatens-violent-disarmament-13450311",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-hostages_7051249.jpg?20251014234954",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-14 22:12:00",
        "Headline": "Donald Trump has suggested Hamas \"misrepresented\" the number of hostages it could free during ceasefire negotiations - and also threatened the group with consequences should it not disarm.",
        "Content": " Israel has received the bodies of four hostages taken by Hamas during the October 7 attacks, as pressure grows on the group to locate the remaining victims as part of the Gaza ceasefire deal. After all 20 remaining living Israelis kidnapped two years ago were returned on Monday, attention has turned to the victims who have died in captivity. Catch on the latest from Gaza Of the 28 dead hostages, only eight have so far been returned. The four returned late on Tuesday, via the Red Cross, are yet to be formally identified. The four handed over by Hamas on Monday are Guy Illouz, Bipin Joshi, Yossi Sharabi, and Daniel Peretz. Sky's Middle East correspondent Adam Parsons said it's \"clear Hamas doesn't know where all these bodies are\", with fears they could be under rubble in parts of Gaza devastated by Israel's two-year bombardment. Some of the fighters who had been guarding them have been killed. The return of all the hostages, living and dead, is a key pillar of the deal agreed to by Israel and Hamas, heralded by US President Donald Trump as having brought \"peace in the Middle East\". Israel - which has freed hundreds of Palestinian prisoners - said it would keep the Rafah crossing between Gaza and Egypt closed on Wednesday, and limit aid entering Gaza, due to Hamas's failure to return all the dead. Hostage families have urged their government to \"finish the job\" and get the remaining bodies home. Two far-right ministers in Benjamin Netanyahu's government, Bezalel Smotrich and Itamar Ben-Gvir, said Israel should limit aid and use \"military pressure\" to ensure their return.  Trump: Hamas must disarm, or we will disarm them Hamas is also facing questions over whether it's willing to comply with a longer-term requirement of the Gaza peace plan: that the group must disarm. Photos and videos have emerged on social media in the past few days of Hamas fighters appearing to kill other Palestinians, whom they accused of collaborating with Israel. Mr Trump told reporters that if the group didn't disarm, \"we will disarm them\". \"It will happen quickly and perhaps violently,\" he said in a meeting with Argentina's Javier Milei at the White House. Mr Trump said he had received assurances from Hamas \"through my people\" that the group would disarm. From our experts:Will Trump stay the course?There is a catch to Trump's deal  Starmer: Hamas must honour ceasefire But the president also appeared to suggest Hamas had \"misrepresented\" the number of hostages it will be able to return during ceasefire negotiations. \"We were told they had 26, 24 [bodies] of dead hostages, if we can use those terms,\" he added. \"And it seems they don't have that number because we're talking about a much lesser number. \"I want them back. That's what they said. I want them back.\" Hamas had agreed to a Monday deadline to return all the hostages. Britain's Sir Keir Starmer has also called on Hamas to \"honour the terms of the ceasefire\" and release the remaining hostages, as he paid tribute to one of those returned to Israel on Monday. The loss of Yossi Sharabi, who has British family, \"will be felt deeply by his family after Hamas so cruelly drew out their horror and denied them the right to grieve\", the prime minister said."
    },
    {
        "title": "UK must prepare for 2C of warming by 2050, government told for first time",
        "description": "Britain must prepare for at least 2C of warming within just 25 years, the government has been advised by its top climate advisers.",
        "url": "https://news.sky.com/story/uk-must-prepare-for-2c-of-warming-by-2050-government-told-for-first-time-13450092",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-climate-rain-northern-ireland_6860427.jpg?20250318123411",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-14 13:39:00",
        "Headline": "The goal is hotter and sooner than most official previous advice, and is a nod to the high chance of breaching the ambitious Paris Agreement limit. National advisers on the Climate Change Committee hope a target would kickstart efforts to make hospitals, homes, and schools more resilient.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Britain must prepare for at least 2C of warming within just 25 years, the government has been advised by its top climate advisers. That limit is hotter and sooner than most of the previous official advice, and is worse than the 1.5C level most of the world has been trying to stick to. What is the 1.5C temperature threshold? Under the 2015 Paris Agreement, countries agreed to try to limit warming to \"well below\" 2C - and ideally 1.5C. But with global average temperatures already nearing 1.4C, warnings that we may have blown our chances of staying at 1.5C have been growing. This new warning from the government's top advisers, the independent Climate Change Committee (CCC), spells out the risk to the UK in the starkest terms yet. In a letter today, the CCC said ministers should \"at a minimum, prepare the country for the weather extremes that will be experienced if global warming levels reach 2C above pre-industrial levels by 2050\". It is the first time the committee has recommended such a target, in the hopes of kickstarting efforts to make everything from flooded train tracks to sweltering classrooms more resilient in a hotter world - after years of warnings the country is woefully unprepared. How climate change affects the UK The UK is already struggling to cope with the drought, flooding, and heat brought by the current 1.4C - \"let alone\" what is to come, the advisers said. Just this year, the country battled the second-worst harvest on record and hottest summer ever, which saw an extra 300 Londoners die. \"Though the change from 1.5C and 2C may sound small, the difference in impacts would be substantial,\" CCC adviser Professor Richard Betts told Sky News. It would mean twice as many people at risk of flooding in some areas, and in southern England, 10 times as many days with a very high risk of wildfires - an emerging risk for Britain. The experts said the mass building the government is currently pushing, including new nuclear power stations and homes, should even be adaptable for 4C of warming in the future - a level unlikely, but which cannot be ruled out. Is it too late to stop climate change or limit to 1.5C? The CCC's Baroness Brown said in a briefing: \"We continue to believe 1.5C is achievable as a long-term goal. \"But clearly the risk it will not be achieved is getting higher, and for risk management we do believe we have to plan for 2C.\" World leaders will discuss their plans to adapt to hotter temperatures at the COP30 climate summit in Brazil in November. Professor Eric Wolff, who advises the Royal Society, said leaders needed to wake up. \"It is now very challenging even to stay below two degrees,\" he told Sky News. \"This is a wake-up call both to continue reducing emissions, but at the same time to prepare our infrastructure and economy for the inevitable climate changes that we are already committed to.\""
    },
    {
        "title": "Deadline day for firm linked to Tory peer to pay back millions over COVID contract scandal",
        "description": "Today is the High Court's deadline for a firm linked to Baroness Michelle Mone to repay &#163;122m for supplying defective PPE at the height of the pandemic, with no indication the Department of Health and Social Care (DHSC) will be paid in full.",
        "url": "https://news.sky.com/story/deadline-day-for-firm-linked-to-tory-peer-to-pay-back-millions-over-covid-contract-scandal-13450074",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-michelle-mone-doug-barrowman_7048089.jpg?20251010212504",
        "type": "Home",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-14 13:08:00",
        "Headline": "The government appears set for a protracted and costly effort to secure the money as PPR Medpro is said to have assets worth less than £700k.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Today is the High Court's deadline for a firm linked to Baroness Michelle Mone to repay £122m for supplying defective PPE at the height of the pandemic, with no indication the Department of Health and Social Care (DHSC) will be paid in full. PPE Medpro, the company founded by her husband Doug Barrowman and introduced to a \"VIP lane\" for providers by the Conservative peer, has until 4pm to make the payment. While Mr Barrowman has described himself as the \"ultimate beneficial owner\" of PPE Medpro, and says £29m of profit from the deal was paid into a trust benefitting his family, including Baroness Mone and her children, he was never a director and the couple are not personally liable for the money. PPE Medpro filed for insolvency the day before Mrs Justice Cockerill's finding of breach of contract was published, and the company's most recent accounts show assets of just £666,000. Court-appointed administrators will now be responsible for recovering as much money as possible on behalf of creditors, principally the DHSC. Last week, Mr Barrowman's spokesman said \"consortium partners\" of PPE Medpro are \"prepared to enter into a dialogue with the administrators of the company to discuss a possible settlement with the government\". Read more:The PPE scandal surrounding Michelle Mone explained Sky News understands the consortium met last week and has contacted the administrators to request they facilitate a negotiation with the government. Mr Barrowman's spokesman did not specify how much they would be willing to offer by way of settlement, but in June PPE Medpro offered to settle the case for £23m. The DHSC rejected that offer, but with the company in administration and potentially limited avenues to recover funds, there is a risk the government may recover nothing while incurring further legal expenses.  What happened during the pandemic? In June 2020, PPE Medpro won contracts worth a total of £203m to provide 210 million masks and 25 million surgical gowns after Baroness Mone contacted ministers, including Michael Gove, on the company's behalf. While the £81m mask contract was fulfilled, the gowns were rejected for failing sterility standards, and in 2022 the DHSC sued. Earlier this month, Mrs Justice Cockerill ruled PPE Medpro was in breach of contract and liable to repay the full amount. Mr Barrowman has previously named several other companies as part of the gown supply, including two registered in the UK, and last week his spokesman said there was a \"strong case\" for the administrator to pursue them for the money. One of the companies named has denied any connection to PPE Medpro and two others have not responded to requests for comment. What could government do about it? Insolvency experts say administrators and creditors, in this case the government, may have some recourse to pursue individuals and entities beyond the liable company, but any process is likely to be lengthy and expensive. Julie Palmer, a partner at Begbies Traynor, told Sky News: \"The administrators will want to look at what's happened to what look like significant profits made on these contracts. \"If I was looking at this, I would want to establish the exact timeline, at what point were the profits taken out. \"They may also want to consider whether there is a claim for wrongful trading, because that effectively pierces the corporate veil of protection of a limited company, and can allow proceedings against company officers personally. \"The net of a director can also be expanded to shadow directors, people sitting in the background quite clearly with a degree of control of the management of the company, in which case some claims may rest against them.\" A spokesman for Forvis Mazars, one of the joint administrators of PPE Medpro, did not comment other than to confirm the firm's appointment. The DHSC was approached for comment."
    },
    {
        "title": "Premier League boss on how football is tackling racism after Sky News reveals surge in abuse",
        "description": "Premier League chief executive Richard Masters has told Sky News players will take the knee at this weekend's matches amid ongoing discussions about whether the anti-racism move is still effective.",
        "url": "https://news.sky.com/story/premier-league-boss-on-how-football-is-tackling-racism-after-sky-news-reveals-surge-in-abuse-13450305",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-pl-richard-masters_7051244.jpg?20251014232320",
        "type": "Home",
        "Author": "Rob Harris",
        "Date Published": "2025-10-14 21:41:00",
        "Headline": "Richard Masters speaks to Sky News after we revealed there has been a surge in abuse targeting footballers online this season.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Premier League chief executive Richard Masters has told Sky News players will take the knee at this weekend's matches amid ongoing discussions about whether the anti-racism move is still effective. Captains of the 20 clubs are understood to back the move, although players could decide individually to opt out. The majority of Women's Super League teams recently decided against taking the knee in games marking Black History Month, feeling it was no longer meaningful amid a rise in racism. Sky News revealed last week that online racism cases in English football have quadrupled this season. And in his exclusive interview, Mr Masters raised concerns about the anonymity of social media users posting abuse and questioned whether identity checks were now necessary. The Premier League wants platforms to do more to change algorithms to stop players seeing the abuse, and to introduce additional protections to stop it reaching their inboxes. Football frames racism as a societal problem - requiring education - and Sky News accompanied Mr Masters on a school visit in west London, where the Premier League linked up with Brentford. Taking the knee This weekend's matches will highlight the league's \"No Room for Racism\" campaign to combat discrimination and promote equality. It was in 2020, inspired by the Black Lives Matter movement, that Premier League players started to take the knee before kick-off. But questions about the effectiveness of the gesture have grown. \"It's always been their choice,\" Mr Masters told Sky News of the players. \"It's never been something that has been forced upon them, either collectively or individually. They had another discussion in the summer. \"They're going to do it really at the No Room for Racism match rounds. We then decide whether they want to continue or stop. So I think they want to make sure whatever they do, it's effective.\" 'You'll be dealt with' This is a season that began with Bournemouth's Antoine Semenyo reporting being racially abused at Liverpool, although Mr Masters said \"the protocols worked\". He added: \"A lot of our players and participants, managers, referees are subject to abuse, a lot of it racism. \"And we're trying our best to deal with that, working with our stakeholders and working with the social media companies to try to solve those issues.\" For the league, that is not symptomatic of racist abuse becoming more prevalent in stadiums. \"The Premier League is a very permissive environment,\" Mr Masters said. \"Very few other places you can come and scream and shout and support your team. \"But I think that fans know where that line is. No violence, no threatened intimidation, and no discrimination. If you do, then you'll be dealt with.\" Polarised society The political climate can become problematic, although Mr Masters does not directly reference the summer's anti-immigration protests when asked. \"Those are political issues, and I think that football's role is to provide that distraction,\" he said. \"Football stands slightly to the side to where society is at the moment, where we are seeing a little bit of polarisation of views. Football, I think, can help in that aspect.\" Social media anonymity Too many feel they can hurl racist abuse at footballers on social media - and Mr Masters insists the league is \"very restless\" about eradicating that. Greater identity checks could help. Mr Masters said: \"There's an anonymity to it, I think, which, perhaps wrongly, in my view, gives people the view that they can pretty much say and do what they want. \"And I just simply don't think it should be part of a professional footballer's life to have to put up with this sort of stuff, which is why we're taking what action we can. \"Obviously, anything that makes it easier [to find the perpetrators] I would be in principle supportive of, but I think it goes to a lot of other issues around freedom of information.\"  AI and algorithms There is a unit at the Premier League dedicated to pursuing social media firms over racist abuse, which has no complaints publicly about the conduct of the tech giants. But the league's director of content protection, Tim Cooper, told Sky News: \"The platforms can do more by changing their algorithms, looking at the opting in to see abuse rather than perhaps opting out of seeing it. That would be a step in the right direction. \"And ultimately, it's for us to keep trying to push cases through and get good real-world deterrent actions, alongside law enforcement and other enforcement bodies around the world.\" There are concerns about the use of AI to create racist images and abusers using phrases or jumbled letters to circumvent algorithms. Read more from Sky News:England qualify for 2026 World CupWhy has the weather been gloomy recently \"It's very much gone beyond just a text rant now, which is obviously bad enough, but now we're seeing that people are using images to create some of the most offensive things that you could imagine,\" Mr Cooper said. \"I think video will be something in the future going forward that could be a problem, and we have seen that with deepfakes.\" Instagram owner Meta and Elon Musk's X both said they would not provide detail about any work to eradicate racism - declining months of requests for interviews.  Being on social media means children are more aware than ever of incidents of racist abuse across football. After leading the class in west London, Premier League Primary Stars coordinator Benjamin Abrahams said: \"Having to speak to young pupils about things they've heard, things they know about, can sometimes be tough. \"But actually, it's a great chance to speak to them and have those open conversations. To discuss why things are said, why things happen, but [why] it's not right, and be able to discuss what is correct and what should we all hope for.\""
    },
    {
        "title": "Four big themes as IMF takes aim at UK growth and inflation",
        "description": "Six months ago the International Monetary Fund (IMF) warned that the world economy was heading for a serious slowdown, in the face of Donald Trump's tariffs.",
        "url": "https://news.sky.com/story/four-big-themes-as-imf-takes-aim-at-uk-growth-and-inflation-13450072",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-economy-bank_6965901.png?20250716091522",
        "type": "Home",
        "Author": "Ed Conway",
        "Date Published": "2025-10-14 13:04:00",
        "Headline": "Sky's economics and data editor writes that the latest World Economic Outlook actually contains little for the UK to smile about, as big risks continue to loom large globally.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Six months ago the International Monetary Fund (IMF) warned that the world economy was heading for a serious slowdown, in the face of Donald Trump's tariffs. It slashed its forecasts for economic growth both in the US and predicted that global economic growth would slow to 2.8% this year. Today the Fund has resurfaced with a markedly different message. It upgraded growth in both the US and elsewhere. Global economic growth this year will actually be 3.2%, it added. So, has the Fund conceded victory to Donald Trump? Is it no longer fretting about the economic impact of tariffs? Money latest: Shock over retirement age  Either way, the World Economic Outlook (WEO), the IMF's six-monthly analysis of economic trends, is well worth a look. This document is perhaps the ultimate synthesis of what economists are feeling about the state of the world, so there's plenty of insights in there, both about the US, about far-reaching trends like artificial intelligence, about smaller economies like the UK and plenty else besides. Here, then, are four things you need to know from today's WEO. The tariff impact is much smaller than expected… so far The key bit there is the final two words. The Fund upgraded US and global growth, saying: \"The global economy has shown resilience to the trade policy shocks\", but added: \"The unexpected resilience in activity and muted inflation response reflect - in addition to the fact that the tariff shock has turned out to be smaller than originally announced - a range of factors that provide temporary relief, rather than underlying strength in economic fundamentals.\" In short, the Fund still thinks those things it was worried about six months ago - higher inflation, lower trade flows and weaker income growth - will still kick in. It just now thinks it might take longer than expected. The UK faces the highest inflation in the industrialised world  One of the standard exercises each time one of these reports come out is for the Treasury to pick out a flattering statistic they can then go back home and talk about for the following months. This time around the thing they will most likely focus on is that Britain is forecast to have one of the strongest economic growth rates in the G7 (second only to the US) this year, and the third strongest next year. But there are a couple of less flattering prisms through which one can look at the UK economy. First, if you look not at gross domestic product but (as you really ought to) at GDP per head (which adjusts for the growing population), in fact UK growth next year is poised to be the weakest in the G7 (at just 0.5 per cent). Second, and perhaps more worryingly, UK inflation remains stubbornly high in comparison to most other economies, the highest in the G7 both this year and next. Why is Britain such an outlier? This is a question both Chancellor Rachel Reeves and Bank of England governor Andrew Bailey will have to explain while in Washington this week for the Fund's annual meeting. What happens if the Artificial Intelligence bubble bursts?  Few, even inside the world of AI, doubt that the extraordinary ramp up in tech share prices in recent months has some of the traits of a financial bubble. But what happens if that bubble goes pop? The Fund has the following, somewhat scary, passage: \"Excessively optimistic growth expectations about AI could be revised in light of incoming data from early adopters and could trigger a market correction. Elevated valuations in tech and AI-linked sectors have been fuelled by expectations of transformative productivity gains. If these gains fail to materialize, the resulting earnings disappointment could lead to a reassessment of the sustainability of AI-driven valuations and a drop in tech stock prices, with systemic implications. \"A potential bust of the AI boom could rival the dot-com crash of 2000 in severity, especially considering the dominance of a few tech firms in market indices and involvement of less-regulated private credit loans funding much of the industry's expansion. Such a correction could erode household wealth and dampen consumption.\" Pay attention to what's happening in less developed countries For many years, one of the main focuses at each IMF meeting was about the state of finances in many of the world's poorest nations. Rich countries lined up in Washington with generous policies to provide donations and trim developing world debt. But since the financial crisis, rich world attention has turned inwards - for understandable reasons. One of the upshots of this is that the amount of aid going to poor countries has fallen, year by year. At the same time, the amount these countries are having to pay in their annual debt interest has been creeping up (as have global interest rates). The upshot is something rather disturbing. For the first time in a generation, poor countries' debt interest payments are now higher than their aid receipts. I'm not sure what this spells. But what we do know is that when poor countries in the Middle East and Sub-Saharan Africa face financial problems, they often face instability. And when they face instability, that often has knock on consequences for everyone else. All of which is to say, this is something to watch, with concern. The IMF's report is strictly speaking the starting gun for a week of meetings in Washington. So there'll be more to come in the next few days, as finance ministers from around the world meet to discuss the state of the global economy."
    },
    {
        "title": "Freed Palestinian prisoner alleges torture and deaths in Israeli detention",
        "description": "A freed Palestinian prisoner, one of about 1,700 detainees from Gaza who had been held by Israel without charge, has described scenes of systematic torture, humiliation and death inside Israeli detention. ",
        "url": "https://news.sky.com/story/freed-palestinian-prisoner-alleges-torture-and-deaths-in-israeli-detention-13450233",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-akram-al-basyouni-palestinian-prisoners_7051191.jpg?20251014212316",
        "type": "Home",
        "Author": "Celine Alkhaldi, Middle East producer",
        "Date Published": "2025-10-14 19:11:00",
        "Headline": "Akram al Basyouni, who spent nearly two years in custody, tells Sky News that prisoners were beaten \"so savagely our ribs were shattered\". ",
        "Content": "By Celine Alkhaldi, Middle East producer  A freed Palestinian prisoner, one of about 1,700 detainees from Gaza who had been held by Israel without charge, has described scenes of systematic torture, humiliation and death inside Israeli detention.  Akram al Basyouni, 45, from northern Gaza, says he was detained on 10 December 2023 at a shelter school in Jabalia and spent nearly two years in custody, including at the Sde Teiman military base. \"Many of our fellow prisoners were beaten to the point of death,\" he told Sky News. \"When we cried out to the guards for help, they would answer coldly, 'Let him die'. Five minutes later they would take the body away, wrap it in a bag, and shut the door.\" Al Basyouni said detainees were routinely tortured, beaten with batons and fists, attacked by dogs and gassed during what guards called a \"reception ceremony\". \"They beat us so savagely our ribs were shattered. They poured boiling water over the faces and backs of young men until their skin peeled away. We sat on cold metal floors for days, punished even for asking for help.\" Sky News has contacted the Israel Prison Service (IPS) and the Israel Defense Forces for comment but has not yet received a response. Al Basyouni claimed prisoners were forced to remain on their knees for long hours, deprived of clothing and blankets, and subjected to religious and psychological abuse. \n                  Hamas releases more bodies of hostages - as Trump threatens 'violent' disarmament\n                 \n                  Is Hamas ready to give up Gaza?\n                 \n                  Bodies of four hostages returned to Israel - and why finding others will be 'massive challenge'\n                 \"They cursed the Prophet, tore up the Koran in front of us, and insulted our mothers and sisters in the foulest language,\" he said. \"They told us our families were dead. 'There is no Gaza,' they said. 'We killed your children.'\"  Palestinians freed from Israeli prisons in past exchanges have reported frequent beatings, insufficient food and deprivation of medical care. A 2024 UN report said that since 7 October 2023, thousands of Palestinians have been held arbitrarily and incommunicado by Israel, often shackled, subject to torture and deprived of food, water, sleep and medical care. Israel has maintained that it follows international and domestic legal standards for the treatment of prisoners and that any prison personnel violations are investigated. Its National Security Minister Itamar Ben-Gvir, who oversees the country's prisons, has on multiple occasions boasted about making conditions for Palestinians as harsh as possible while remaining within the law. Al Basyouni claimed many detainees, including doctors, died from beatings or medical neglect. \"I heard about Dr Adnan al-Bursh, may God have mercy on him,\" he said. \"He was struck in the chest by a prison guard, over his heart. He lost consciousness immediately and died five minutes later.\" Read more from Sky News:Trump warned his plan for Gaza 'doesn't make sense'Hamas official says Blair isn't welcome in Gaza role Sky News' own investigation found that Dr al-Bursh, one of Gaza's most respected surgeons, died after being tortured in Israeli custody, sustaining broken ribs and severe injuries while being held at Ofer Prison. Al Basyouni said he also met Dr Hossam Abu Safiya at Ofer and heard that Dr Akram Abu Ouda had been \"subjected to severe and repeated torture.\" \"Even the doctors were beaten and denied treatment,\" he said. \"Many reached the brink of death.\" In response to our investigation into Dr al-Bursh's death, a spokesman for the Israel Prison Service said at the time: \"We are not aware of the claims you described and as far as we know, no such events have occurred under IPS responsibility.\""
    },
    {
        "title": "Grammy-winning R&B and soul star D'Angelo dies after 'prolonged battle with cancer'",
        "description": "Grammy-award winning R&B and soul singer D'Angelo has died following a battle with pancreatic cancer, his family has said.",
        "url": "https://news.sky.com/story/grammy-winning-singer-dangelo-dies-after-prolonged-battle-with-cancer-13450168",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dangelo-rb-dangelo_7051076.jpg?20251014181029",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-14 16:50:00",
        "Headline": "The 51-year-old died on Tuesday following a \"prolonged and courageous battle with cancer,\" his family said.",
        "Content": "Grammy-award winning R&B and soul singer D'Angelo has died following a battle with pancreatic cancer, his family has said. He died on Tuesday, leaving behind a \"legacy of extraordinarily moving music\" following a \"prolonged and courageous battle with cancer,\" his family said in a statement. The prominent musician, born Michael D'Angelo Archer, was 51 years old. A family statement said: \"We are saddened that he can only leave dear memories with his family, but we are eternally grateful for the legacy of extraordinarily moving music he leaves behind. \"We ask that you respect our privacy during this difficult time, but invite you all join us in mourning his passing while also celebrating the gift of song that he has left for the world.\" The singer rose to prominence in the 1990s with his first album, Brown Sugar. The track \"Lady\" from that album reached No. 10 in March 1996 and remained on Billboard's Hot 100 chart for 20 weeks."
    },
    {
        "title": "Why the weather has been gloomy in the UK recently",
        "description": "If the weather in your part of the country has been grey and dull, then it may be because of a meteorological phenomenon known as anticyclonic gloom.",
        "url": "https://news.sky.com/story/why-the-weather-has-been-gloomy-in-the-uk-recently-13450252",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cloud-weather-grey_7051218.jpg?20251014221812",
        "type": "Home",
        "Author": "Jo Robinson",
        "Date Published": "2025-10-14 19:52:00",
        "Headline": "The UK can often experience anticyclonic gloom in late autumn, winter or early spring, sometimes lasting for many days and even weeks.",
        "Content": "\n          Weather producer\n              @SkyJoRobinson\n If the weather in your part of the country has been grey and dull, then it may be because of a meteorological phenomenon known as anticyclonic gloom. The Great Smog of 1952 was an extreme example. This week, while conditions are mostly settled, with high pressure in charge, there is a lack of blue sky and sun. The UK can often experience anticyclonic gloom in late autumn, winter or early spring, sometimes lasting for many days and even weeks. What happens is that high pressure allows air to sink, causing warming and compression, with the sinking motion trapping moisture and cloud near the surface. A temperature inversion can occur, when colder air exists near the surface of the earth with a layer of warmer air above, acting as an atmospheric lid. When the sun isn't as strong, it limits the breakup of cloud, along with a lack of wind from the area of high pressure. Overnight, the cloud can often thicken, too, as moisture condenses, with drizzly outbreaks possible. Anticyclonic gloom can often lead to higher levels of pollution, as that becomes trapped as well. Read more:'Many mistakes' made over COVID school closuresUK's 'most remote pub' cancels Harry Potter-themed party The first half of November 2024 was the last notable instance of anticyclonic gloom, with virtually no sunshine recorded in many locations across the UK. For now, it looks like things will change from Sunday, with wet and windy weather moving in from the west."
    },
    {
        "title": "England qualify for 2026 World Cup after convincing win over Latvia",
        "description": "England are through to next summer's World Cup thanks to a convincing 5-0 win over Latvia in their latest qualifier. ",
        "url": "https://news.sky.com/story/england-qualify-for-2026-world-cup-after-convincing-win-over-latvia-13450126",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-england-kane-eze_7051200.jpg?20251014214229",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-14 15:32:00",
        "Headline": "Thomas Tuchel's side have dominated their group in the qualifying games and tonight's 5-0 win means they are through to next summer's main tournament with two matches to spare.",
        "Content": "England are through to next summer's World Cup thanks to a convincing 5-0 win over Latvia in their latest qualifier.  Thomas Tuchel's side have dominated their group in the qualifying games and the win in Riga means they are through to next summer's main tournament with two matches to spare. England is the first European team to qualify for the 2026 World Cup after winning their six Group K matches so far, without conceding a single goal. The Three Lions were already up 3-0 at half-time in the Daugava Stadium thanks to Anthony Gordon scoring once and Harry Kane twice, including a penalty. The fourth goal came early in the second half when Djed Spence's shot bounced off the leg of Latvia's Maksims Tonisev. And in the 86th minute, substitute Eberechi Eze scored the final goal for the Three Lions. There are two games left to play for Tuchel's team, against Serbia on 13 November at Wembley Stadium and Albania on 16 November in the country's capital, Tirana. England already beat Serbia 5-0 and Albania 2-0 in earlier qualifiers. \n                  Lionesses stumbled at start of Euros but want to feel like 'Proper England' again\n                 \n                  Ex-Man Utd and England star Jesse Lingard gives evidence at grandfather's sex assault trial\n                 \n                  World Cup 2026 qualifying draw: Who are the home nations facing?\n                 Next year's men's World Cup will take place from June to July. The 23rd edition of the tournament will take place across 16 cities in the United States, Canada and Mexico. Read more from Sky News:Why the UK weather has been gloomy recentlyRemote pub axes Harry Potter party after backlash The draw for the group stage fixtures will take place in Washington on 5 December, with US President Donald Trump set to join FIFA president Gianni Infantino to decide the match-ups. The 2026 World Cup final will be the first ever to have a half-time show, in a move inspired by the NFL's Super Bowl."
    },
    {
        "title": "Charlie Kirk posthumously awarded Presidential Medal of Freedom by Donald Trump",
        "description": "Charlie Kirk has been posthumously awarded the Presidential Medal of Freedom by Donald Trump.",
        "url": "https://news.sky.com/story/charlie-kirk-posthumously-awarded-presidential-medal-of-freedom-by-donald-trump-13450211",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-erika-kirk-charlie-kirk_7051223.jpg?20251014223251",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-10-14 20:40:00",
        "Headline": "Trump described Charlie Kirk as an \"American patriot of the deepest conviction, the finest quality and the highest calibre\".",
        "Content": " Charlie Kirk has been posthumously awarded the Presidential Medal of Freedom by Donald Trump. The USA's highest civilian honour was received by the conservative activist's widow, Erika, at the White House. Kirk, 31, was fatally shot on 10 September while speaking at an event at Utah Valley University. He founded Turning Point USA and toured American university campuses, debating students about current affairs. Addressing those attending the ceremony in the White House rose garden, the US president said they were there to \"honour and remember a fearless warrior for liberty\" and a \"beloved leader who galvanised the next generation\". He said Kirk's name was being entered \"forever into the eternal roster of true American heroes\". Trump described Charlie Kirk as an \"American patriot of the deepest conviction, the finest quality and the highest calibre\". He said his nation had been \"robbed\" of an \"extraordinary champion\". And Trump said Kirk was assassinated in the \"prime of his life for boldly speaking the truth, for living his faith, and relentlessly fighting for a better and stronger America\". Read more from Sky News:Migrant with AK-47 face tattoo who threatened to kill Farage jailedEx-Premier League referee admits making indecent image of child Today was Charlie Kirk's birthday, the president said. He described Erika Kirk as someone who had \"endured unspeakable hardship with unbelievable strength\". A 22-year-old man, Tyler Robinson, from the city of Washington in Utah has been charged with Kirk's murder. Prosecutors said they would seek the death penalty. At a memorial event held at a stadium in Arizona, Erika Kirk told an enormous crowd she forgave her husband's killer. \"The answer to hate is not hate,\" she said."
    },
    {
        "title": "UK must prepare for 2C of warming by 2050, government told for first time",
        "description": "Britain must prepare for at least 2C of warming within just 25 years, the government has been advised by its top climate advisers.",
        "url": "https://news.sky.com/story/uk-must-prepare-for-2c-of-warming-by-2050-government-told-for-first-time-13450092",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-climate-rain-northern-ireland_6860427.jpg?20250318123411",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-14 13:39:00",
        "Headline": "The goal is hotter and sooner than most official previous advice, and is a nod to the high chance of breaching the ambitious Paris Agreement limit. National advisers on the Climate Change Committee hope a target would kickstart efforts to make hospitals, homes, and schools more resilient.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Britain must prepare for at least 2C of warming within just 25 years, the government has been advised by its top climate advisers. That limit is hotter and sooner than most of the previous official advice, and is worse than the 1.5C level most of the world has been trying to stick to. What is the 1.5C temperature threshold? Under the 2015 Paris Agreement, countries agreed to try to limit warming to \"well below\" 2C - and ideally 1.5C. But with global average temperatures already nearing 1.4C, warnings that we may have blown our chances of staying at 1.5C have been growing. This new warning from the government's top advisers, the independent Climate Change Committee (CCC), spells out the risk to the UK in the starkest terms yet. In a letter today, the CCC said ministers should \"at a minimum, prepare the country for the weather extremes that will be experienced if global warming levels reach 2C above pre-industrial levels by 2050\". It is the first time the committee has recommended such a target, in the hopes of kickstarting efforts to make everything from flooded train tracks to sweltering classrooms more resilient in a hotter world - after years of warnings the country is woefully unprepared. How climate change affects the UK The UK is already struggling to cope with the drought, flooding, and heat brought by the current 1.4C - \"let alone\" what is to come, the advisers said. Just this year, the country battled the second-worst harvest on record and hottest summer ever, which saw an extra 300 Londoners die. \"Though the change from 1.5C and 2C may sound small, the difference in impacts would be substantial,\" CCC adviser Professor Richard Betts told Sky News. It would mean twice as many people at risk of flooding in some areas, and in southern England, 10 times as many days with a very high risk of wildfires - an emerging risk for Britain. The experts said the mass building the government is currently pushing, including new nuclear power stations and homes, should even be adaptable for 4C of warming in the future - a level unlikely, but which cannot be ruled out. Is it too late to stop climate change or limit to 1.5C? The CCC's Baroness Brown said in a briefing: \"We continue to believe 1.5C is achievable as a long-term goal. \"But clearly the risk it will not be achieved is getting higher, and for risk management we do believe we have to plan for 2C.\" World leaders will discuss their plans to adapt to hotter temperatures at the COP30 climate summit in Brazil in November. Professor Eric Wolff, who advises the Royal Society, said leaders needed to wake up. \"It is now very challenging even to stay below two degrees,\" he told Sky News. \"This is a wake-up call both to continue reducing emissions, but at the same time to prepare our infrastructure and economy for the inevitable climate changes that we are already committed to.\""
    },
    {
        "title": "Premier League boss on how football is tackling racism after Sky News reveals surge in abuse",
        "description": "Premier League chief executive Richard Masters has told Sky News players will take the knee at this weekend's matches amid ongoing discussions about whether the anti-racism move is still effective.",
        "url": "https://news.sky.com/story/premier-league-boss-on-how-football-is-tackling-racism-after-sky-news-reveals-surge-in-abuse-13450305",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-pl-richard-masters_7051244.jpg?20251014232320",
        "type": "UK",
        "Author": "Rob Harris",
        "Date Published": "2025-10-14 21:41:00",
        "Headline": "Richard Masters speaks to Sky News after we revealed there has been a surge in abuse targeting footballers online this season.",
        "Content": "\n          Sports correspondent\n              @RobHarris\n  Premier League chief executive Richard Masters has told Sky News players will take the knee at this weekend's matches amid ongoing discussions about whether the anti-racism move is still effective. Captains of the 20 clubs are understood to back the move, although players could decide individually to opt out. The majority of Women's Super League teams recently decided against taking the knee in games marking Black History Month, feeling it was no longer meaningful amid a rise in racism. Sky News revealed last week that online racism cases in English football have quadrupled this season. And in his exclusive interview, Mr Masters raised concerns about the anonymity of social media users posting abuse and questioned whether identity checks were now necessary. The Premier League wants platforms to do more to change algorithms to stop players seeing the abuse, and to introduce additional protections to stop it reaching their inboxes. Football frames racism as a societal problem - requiring education - and Sky News accompanied Mr Masters on a school visit in west London, where the Premier League linked up with Brentford. Taking the knee This weekend's matches will highlight the league's \"No Room for Racism\" campaign to combat discrimination and promote equality. It was in 2020, inspired by the Black Lives Matter movement, that Premier League players started to take the knee before kick-off. But questions about the effectiveness of the gesture have grown. \"It's always been their choice,\" Mr Masters told Sky News of the players. \"It's never been something that has been forced upon them, either collectively or individually. They had another discussion in the summer. \"They're going to do it really at the No Room for Racism match rounds. We then decide whether they want to continue or stop. So I think they want to make sure whatever they do, it's effective.\" 'You'll be dealt with' This is a season that began with Bournemouth's Antoine Semenyo reporting being racially abused at Liverpool, although Mr Masters said \"the protocols worked\". He added: \"A lot of our players and participants, managers, referees are subject to abuse, a lot of it racism. \"And we're trying our best to deal with that, working with our stakeholders and working with the social media companies to try to solve those issues.\" For the league, that is not symptomatic of racist abuse becoming more prevalent in stadiums. \"The Premier League is a very permissive environment,\" Mr Masters said. \"Very few other places you can come and scream and shout and support your team. \"But I think that fans know where that line is. No violence, no threatened intimidation, and no discrimination. If you do, then you'll be dealt with.\" Polarised society The political climate can become problematic, although Mr Masters does not directly reference the summer's anti-immigration protests when asked. \"Those are political issues, and I think that football's role is to provide that distraction,\" he said. \"Football stands slightly to the side to where society is at the moment, where we are seeing a little bit of polarisation of views. Football, I think, can help in that aspect.\" Social media anonymity Too many feel they can hurl racist abuse at footballers on social media - and Mr Masters insists the league is \"very restless\" about eradicating that. Greater identity checks could help. Mr Masters said: \"There's an anonymity to it, I think, which, perhaps wrongly, in my view, gives people the view that they can pretty much say and do what they want. \"And I just simply don't think it should be part of a professional footballer's life to have to put up with this sort of stuff, which is why we're taking what action we can. \"Obviously, anything that makes it easier [to find the perpetrators] I would be in principle supportive of, but I think it goes to a lot of other issues around freedom of information.\"  AI and algorithms There is a unit at the Premier League dedicated to pursuing social media firms over racist abuse, which has no complaints publicly about the conduct of the tech giants. But the league's director of content protection, Tim Cooper, told Sky News: \"The platforms can do more by changing their algorithms, looking at the opting in to see abuse rather than perhaps opting out of seeing it. That would be a step in the right direction. \"And ultimately, it's for us to keep trying to push cases through and get good real-world deterrent actions, alongside law enforcement and other enforcement bodies around the world.\" There are concerns about the use of AI to create racist images and abusers using phrases or jumbled letters to circumvent algorithms. Read more from Sky News:England qualify for 2026 World CupWhy has the weather been gloomy recently \"It's very much gone beyond just a text rant now, which is obviously bad enough, but now we're seeing that people are using images to create some of the most offensive things that you could imagine,\" Mr Cooper said. \"I think video will be something in the future going forward that could be a problem, and we have seen that with deepfakes.\" Instagram owner Meta and Elon Musk's X both said they would not provide detail about any work to eradicate racism - declining months of requests for interviews.  Being on social media means children are more aware than ever of incidents of racist abuse across football. After leading the class in west London, Premier League Primary Stars coordinator Benjamin Abrahams said: \"Having to speak to young pupils about things they've heard, things they know about, can sometimes be tough. \"But actually, it's a great chance to speak to them and have those open conversations. To discuss why things are said, why things happen, but [why] it's not right, and be able to discuss what is correct and what should we all hope for.\""
    },
    {
        "title": "Deadline day for firm linked to Tory peer to pay back millions over COVID contract scandal",
        "description": "Today is the High Court's deadline for a firm linked to Baroness Michelle Mone to repay &#163;122m for supplying defective PPE at the height of the pandemic, with no indication the Department of Health and Social Care (DHSC) will be paid in full.",
        "url": "https://news.sky.com/story/deadline-day-for-firm-linked-to-tory-peer-to-pay-back-millions-over-covid-contract-scandal-13450074",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-michelle-mone-doug-barrowman_7048089.jpg?20251010212504",
        "type": "UK",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-14 13:08:00",
        "Headline": "The government appears set for a protracted and costly effort to secure the money as PPR Medpro is said to have assets worth less than £700k.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Today is the High Court's deadline for a firm linked to Baroness Michelle Mone to repay £122m for supplying defective PPE at the height of the pandemic, with no indication the Department of Health and Social Care (DHSC) will be paid in full. PPE Medpro, the company founded by her husband Doug Barrowman and introduced to a \"VIP lane\" for providers by the Conservative peer, has until 4pm to make the payment. While Mr Barrowman has described himself as the \"ultimate beneficial owner\" of PPE Medpro, and says £29m of profit from the deal was paid into a trust benefitting his family, including Baroness Mone and her children, he was never a director and the couple are not personally liable for the money. PPE Medpro filed for insolvency the day before Mrs Justice Cockerill's finding of breach of contract was published, and the company's most recent accounts show assets of just £666,000. Court-appointed administrators will now be responsible for recovering as much money as possible on behalf of creditors, principally the DHSC. Last week, Mr Barrowman's spokesman said \"consortium partners\" of PPE Medpro are \"prepared to enter into a dialogue with the administrators of the company to discuss a possible settlement with the government\". Read more:The PPE scandal surrounding Michelle Mone explained Sky News understands the consortium met last week and has contacted the administrators to request they facilitate a negotiation with the government. Mr Barrowman's spokesman did not specify how much they would be willing to offer by way of settlement, but in June PPE Medpro offered to settle the case for £23m. The DHSC rejected that offer, but with the company in administration and potentially limited avenues to recover funds, there is a risk the government may recover nothing while incurring further legal expenses.  What happened during the pandemic? In June 2020, PPE Medpro won contracts worth a total of £203m to provide 210 million masks and 25 million surgical gowns after Baroness Mone contacted ministers, including Michael Gove, on the company's behalf. While the £81m mask contract was fulfilled, the gowns were rejected for failing sterility standards, and in 2022 the DHSC sued. Earlier this month, Mrs Justice Cockerill ruled PPE Medpro was in breach of contract and liable to repay the full amount. Mr Barrowman has previously named several other companies as part of the gown supply, including two registered in the UK, and last week his spokesman said there was a \"strong case\" for the administrator to pursue them for the money. One of the companies named has denied any connection to PPE Medpro and two others have not responded to requests for comment. What could government do about it? Insolvency experts say administrators and creditors, in this case the government, may have some recourse to pursue individuals and entities beyond the liable company, but any process is likely to be lengthy and expensive. Julie Palmer, a partner at Begbies Traynor, told Sky News: \"The administrators will want to look at what's happened to what look like significant profits made on these contracts. \"If I was looking at this, I would want to establish the exact timeline, at what point were the profits taken out. \"They may also want to consider whether there is a claim for wrongful trading, because that effectively pierces the corporate veil of protection of a limited company, and can allow proceedings against company officers personally. \"The net of a director can also be expanded to shadow directors, people sitting in the background quite clearly with a degree of control of the management of the company, in which case some claims may rest against them.\" A spokesman for Forvis Mazars, one of the joint administrators of PPE Medpro, did not comment other than to confirm the firm's appointment. The DHSC was approached for comment."
    },
    {
        "title": "Asylum seeker seen 'dancing and laughing' after stabbing hotel worker 23 times, jury hears",
        "description": "An asylum seeker stabbed a hotel worker more than 20 times with a screwdriver on a railway station platform and left her for dead, a jury has heard.",
        "url": "https://news.sky.com/story/asylum-seeker-seen-dancing-and-laughing-after-stabbing-hotel-worker-23-times-jury-hears-13450007",
        "image_url": "https://e3.365dm.com/24/10/1920x1080/skynews-skye-whyte-bescot-rhiannon-skye-whyte_6726114.jpg?20241024084118",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-14 11:37:00",
        "Headline": "Jurors heard how Deng Chol Majek, who is from Sudan and claims to be 19, was caught on CCTV following Rhiannon Skye Whyte from the town's Park Inn hotel, which was then being used to house asylum seekers, on 20 October last year.",
        "Content": " An asylum seeker stabbed a hotel worker more than 20 times with a screwdriver on a railway station platform and left her for dead, a jury has heard. Deng Chol Majek left Rhiannon Skye Whyte with 23 stab wounds, mainly to her head, at Bescot Stadium station in Walsall, West Midlands, Wolverhampton Crown Court was told. Jurors heard how Majek, who is from Sudan and claims to be 19, was caught on CCTV following Ms Whyte from the town's Park Inn hotel, which was then being used to house asylum seekers, on 20 October last year. Ms Whyte was heard screaming during a phone call to a friend after finishing her shift, prosecutor Michelle Heeley KC told the court. Her body was found on the platform by a train guard minutes later.  Opening the Crown's case against Majek at the murder trial on Tuesday, Ms Heeley told the court he followed the 27-year-old from the hotel, where he was living. \"He followed her down on to the train platform at the Bescot Stadium station and then he attacked her. Stabbing her over and over again with a screwdriver,\" Ms Heeley said. \"He left her bleeding to death and then casually went back to his hotel. We say you can be sure he is guilty of murder.\" Read more: Family pay tribute to 'most selfless person' Jurors were told Ms Whyte had worked at the hotel for around three months, helping with cleaning and serving food. \"During the evening one of Rhiannon's co-workers noticed this defendant. He seemed to be staring at Rhiannon and the women she was working with,\" Ms Heeley said. \"No one could recall any particular issue that would have caused him to act in that way.\" She added: \"What is clear from the CCTV is that the defendant was hanging around the reception area, staring at Rhiannon throughout the evening. He changed into a distinctive jacket and sandals and then waited around the reception area where Rhiannon was. \"CCTV tracks the defendant all the way. He followed her from the hotel and to the station. He had been hanging around waiting for her to leave and waited until she was on her own before he followed her.\" Ms Heeley said Ms Whyte's friend \"heard a scream, then another scream\" before her \"phone went dead\". A train driver who pulled into the station saw a figure slumped on the platform and Ms Heeley said the guard tried to help Ms Whyte, as did an employee who had come from the hotel, but \"she was too seriously injured and nothing could be done to save her\". She died in hospital surrounded by family three days later. Read more from Sky News:Migrant with AK-47 face tattoo who threatened to kill Farage jailedEx-Premier League referee admits making indecent image of child Ms Heeley said Majek went to a shop to buy a drink, threw Ms Whyte's phone into a river, and then returned to the hotel, where \"he was seen dancing and laughing, clearly excited about what he had done\". Majek denies murder and possessing a screwdriver as an offensive weapon. The trial continues."
    },
    {
        "title": "UK to have highest inflation in G7, IMF says",
        "description": "Price rises in the UK are to be the highest among the G7 club of industrialised nations, according to the International Monetary Fund (IMF). ",
        "url": "https://news.sky.com/story/uk-to-have-highest-inflation-in-g7-imf-says-13449998",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-imf-economy_6117647.jpg?20230411065631",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-14 13:00:00",
        "Headline": "Economic performance has been upgraded this year, but downgraded for next.",
        "Content": "Price rises in the UK are to be the highest among the G7 club of industrialised nations, according to the International Monetary Fund (IMF).  Inflation will be the highest among the club both this year and next, the world's lender of last resort said in its World Economic Outlook. As a result, the body's chief economist Pierre-Olivier Gourinchas said the Bank of England should be \"very cautious\" on making future interest rate cuts. Money blog: State pension to rise more than expected There was mixed news elsewhere in the outlook, as the UK's economic growth forecast, as measured by GDP, was revised up for this year but revised down for next. Latest data showed inflation stood at 3.8% and is forecast by the Bank to peak at 4% shortly. The IMF, however, said it expected inflation to average at 3.4% in 2025, up from its previously predicted 3.2%. That is forecast to slow to 2.5% this year, higher than the 2.3% anticipated just three months ago. Food and services inflation had been particularly high in recent months due to rising wage bills and poor harvests. Read more:Got AirPods? There's more to them than meets the eyeHomes now need repairs after work done under govt scheme Economic growth will be a higher 1.3% this year, up from the 1.2% forecast in July, thanks to a strong first few months of the year. Next year, however, GDP will be 1.4% rather than 1.3% as economies across the world feel trade pressures. Political reaction  Chancellor Rachel Reeves said: \"This is the second consecutive upgrade to this year's growth forecast from the IMF. \"But know this is just the start. For too many people, our economy feels stuck. Working people feel it every day, experts talk about it, and I am going to deal with it.\" Shadow chancellor Sir Mel Stride said the IMF assessment made for \"grim reading\". \"Since taking office, Labour have allowed the cost of living to rise, debt to balloon, and business confidence to collapse to record lows,\" he said. \"Working people are feeling the impact every time they shop, fill up the car, or pay their mortgage.\""
    },
    {
        "title": "Four big themes as IMF takes aim at UK growth and inflation",
        "description": "Six months ago the International Monetary Fund (IMF) warned that the world economy was heading for a serious slowdown, in the face of Donald Trump's tariffs.",
        "url": "https://news.sky.com/story/four-big-themes-as-imf-takes-aim-at-uk-growth-and-inflation-13450072",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-economy-bank_6965901.png?20250716091522",
        "type": "UK",
        "Author": "Ed Conway",
        "Date Published": "2025-10-14 13:04:00",
        "Headline": "Sky's economics and data editor writes that the latest World Economic Outlook actually contains little for the UK to smile about, as big risks continue to loom large globally.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Six months ago the International Monetary Fund (IMF) warned that the world economy was heading for a serious slowdown, in the face of Donald Trump's tariffs. It slashed its forecasts for economic growth both in the US and predicted that global economic growth would slow to 2.8% this year. Today the Fund has resurfaced with a markedly different message. It upgraded growth in both the US and elsewhere. Global economic growth this year will actually be 3.2%, it added. So, has the Fund conceded victory to Donald Trump? Is it no longer fretting about the economic impact of tariffs? Money latest: Shock over retirement age  Either way, the World Economic Outlook (WEO), the IMF's six-monthly analysis of economic trends, is well worth a look. This document is perhaps the ultimate synthesis of what economists are feeling about the state of the world, so there's plenty of insights in there, both about the US, about far-reaching trends like artificial intelligence, about smaller economies like the UK and plenty else besides. Here, then, are four things you need to know from today's WEO. The tariff impact is much smaller than expected… so far The key bit there is the final two words. The Fund upgraded US and global growth, saying: \"The global economy has shown resilience to the trade policy shocks\", but added: \"The unexpected resilience in activity and muted inflation response reflect - in addition to the fact that the tariff shock has turned out to be smaller than originally announced - a range of factors that provide temporary relief, rather than underlying strength in economic fundamentals.\" In short, the Fund still thinks those things it was worried about six months ago - higher inflation, lower trade flows and weaker income growth - will still kick in. It just now thinks it might take longer than expected. The UK faces the highest inflation in the industrialised world  One of the standard exercises each time one of these reports come out is for the Treasury to pick out a flattering statistic they can then go back home and talk about for the following months. This time around the thing they will most likely focus on is that Britain is forecast to have one of the strongest economic growth rates in the G7 (second only to the US) this year, and the third strongest next year. But there are a couple of less flattering prisms through which one can look at the UK economy. First, if you look not at gross domestic product but (as you really ought to) at GDP per head (which adjusts for the growing population), in fact UK growth next year is poised to be the weakest in the G7 (at just 0.5 per cent). Second, and perhaps more worryingly, UK inflation remains stubbornly high in comparison to most other economies, the highest in the G7 both this year and next. Why is Britain such an outlier? This is a question both Chancellor Rachel Reeves and Bank of England governor Andrew Bailey will have to explain while in Washington this week for the Fund's annual meeting. What happens if the Artificial Intelligence bubble bursts?  Few, even inside the world of AI, doubt that the extraordinary ramp up in tech share prices in recent months has some of the traits of a financial bubble. But what happens if that bubble goes pop? The Fund has the following, somewhat scary, passage: \"Excessively optimistic growth expectations about AI could be revised in light of incoming data from early adopters and could trigger a market correction. Elevated valuations in tech and AI-linked sectors have been fuelled by expectations of transformative productivity gains. If these gains fail to materialize, the resulting earnings disappointment could lead to a reassessment of the sustainability of AI-driven valuations and a drop in tech stock prices, with systemic implications. \"A potential bust of the AI boom could rival the dot-com crash of 2000 in severity, especially considering the dominance of a few tech firms in market indices and involvement of less-regulated private credit loans funding much of the industry's expansion. Such a correction could erode household wealth and dampen consumption.\" Pay attention to what's happening in less developed countries For many years, one of the main focuses at each IMF meeting was about the state of finances in many of the world's poorest nations. Rich countries lined up in Washington with generous policies to provide donations and trim developing world debt. But since the financial crisis, rich world attention has turned inwards - for understandable reasons. One of the upshots of this is that the amount of aid going to poor countries has fallen, year by year. At the same time, the amount these countries are having to pay in their annual debt interest has been creeping up (as have global interest rates). The upshot is something rather disturbing. For the first time in a generation, poor countries' debt interest payments are now higher than their aid receipts. I'm not sure what this spells. But what we do know is that when poor countries in the Middle East and Sub-Saharan Africa face financial problems, they often face instability. And when they face instability, that often has knock on consequences for everyone else. All of which is to say, this is something to watch, with concern. The IMF's report is strictly speaking the starting gun for a week of meetings in Washington. So there'll be more to come in the next few days, as finance ministers from around the world meet to discuss the state of the global economy."
    },
    {
        "title": "England qualify for 2026 World Cup after convincing win over Latvia",
        "description": "England are through to next summer's World Cup thanks to a convincing 5-0 win over Latvia in their latest qualifier. ",
        "url": "https://news.sky.com/story/england-qualify-for-2026-world-cup-after-convincing-win-over-latvia-13450126",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-england-kane-eze_7051200.jpg?20251014214229",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-14 15:32:00",
        "Headline": "Thomas Tuchel's side have dominated their group in the qualifying games and tonight's 5-0 win means they are through to next summer's main tournament with two matches to spare.",
        "Content": "England are through to next summer's World Cup thanks to a convincing 5-0 win over Latvia in their latest qualifier.  Thomas Tuchel's side have dominated their group in the qualifying games and the win in Riga means they are through to next summer's main tournament with two matches to spare. England is the first European team to qualify for the 2026 World Cup after winning their six Group K matches so far, without conceding a single goal. The Three Lions were already up 3-0 at half-time in the Daugava Stadium thanks to Anthony Gordon scoring once and Harry Kane twice, including a penalty. The fourth goal came early in the second half when Djed Spence's shot bounced off the leg of Latvia's Maksims Tonisev. And in the 86th minute, substitute Eberechi Eze scored the final goal for the Three Lions. There are two games left to play for Tuchel's team, against Serbia on 13 November at Wembley Stadium and Albania on 16 November in the country's capital, Tirana. England already beat Serbia 5-0 and Albania 2-0 in earlier qualifiers. \n                  Lionesses stumbled at start of Euros but want to feel like 'Proper England' again\n                 \n                  Ex-Man Utd and England star Jesse Lingard gives evidence at grandfather's sex assault trial\n                 \n                  World Cup 2026 qualifying draw: Who are the home nations facing?\n                 Next year's men's World Cup will take place from June to July. The 23rd edition of the tournament will take place across 16 cities in the United States, Canada and Mexico. Read more from Sky News:Why the UK weather has been gloomy recentlyRemote pub axes Harry Potter party after backlash The draw for the group stage fixtures will take place in Washington on 5 December, with US President Donald Trump set to join FIFA president Gianni Infantino to decide the match-ups. The 2026 World Cup final will be the first ever to have a half-time show, in a move inspired by the NFL's Super Bowl."
    },
    {
        "title": "Niece of Kenyan woman allegedly murdered by British soldier meets with Defence Secretary",
        "description": "The niece of a Kenyan woman allegedly murdered by a British soldier has met with the UK's Defence Secretary to fight for the accused man's extradition.",
        "url": "https://news.sky.com/story/niece-of-kenyan-woman-allegedly-murdered-by-british-soldier-meets-with-defence-secretary-13450258",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-esther-njoki-kenya_7051173.jpg?20251014210137",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-10-14 20:05:00",
        "Headline": "Agnes Wanjiru's body was found in a septic tank close to a British Army base in Kenya, 2012.",
        "Content": " The niece of a Kenyan woman allegedly murdered by a British soldier has met with the UK's Defence Secretary to fight for the accused man's extradition. Esther Njoki, 21, was eight-years-old when her aunt Agnes Wanjiru, 21, was found dead in 2012. Her body was discovered in a hotel septic tank close to a British Army base in Nanyuki, Kenya, two months after her disappearance. Kenyan prosecutors have issued an arrest warrant for the British soldier accused of the murder. He has been living freely in the UK since. Today, Esther, who is the family's spokesperson, held a meeting with Defence Secretary John Healey to make the case for him to be extradited to Kenya. Ms Njoki told Sky News' The UK Tonight with Sarah-Jane Mee that she would keep fighting for justice. She said: \"My reason for my visit is to keep on putting pressure on. Extradition must be done, the family want him extradited to Kenya. \"He should not be excused for any reason just because he had an army uniform.\" Ms Njoki added: \"I am also here because I want change, change must begin with us. \"It doesn't matter where I come from. I come from the same background Agnes came from. I know they took advantage because my family was not able. \"I know things are changing since I stepped up to say what is happening and holding the government accountable.\" She added: \"If we can change the entire system, I think we will secure a great future for other generations because my family has had to go through hell.\" Read more:'Many mistakes' made over COVID school closuresUK's 'most remote pub' cancels Harry Potter-themed party Mr Healey, who previously met Ms Njoki in April 2025 during a visit to Kenya, paid tribute to Esther and said the government would support the Kenyan investigation. He said: \"I want to pay tribute to Esther, who is an extraordinary spokesperson for her family, and for women who have suffered violence. \"Our government will continue to do everything we can to support the Kenyan investigation, secure a resolution to this case and finally bring peace to Esther and her grieving family.\""
    },
    {
        "title": "Why the weather has been gloomy in the UK recently",
        "description": "If the weather in your part of the country has been grey and dull, then it may be because of a meteorological phenomenon known as anticyclonic gloom.",
        "url": "https://news.sky.com/story/why-the-weather-has-been-gloomy-in-the-uk-recently-13450252",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-cloud-weather-grey_7051218.jpg?20251014221812",
        "type": "UK",
        "Author": "Jo Robinson",
        "Date Published": "2025-10-14 19:52:00",
        "Headline": "The UK can often experience anticyclonic gloom in late autumn, winter or early spring, sometimes lasting for many days and even weeks.",
        "Content": "\n          Weather producer\n              @SkyJoRobinson\n If the weather in your part of the country has been grey and dull, then it may be because of a meteorological phenomenon known as anticyclonic gloom. The Great Smog of 1952 was an extreme example. This week, while conditions are mostly settled, with high pressure in charge, there is a lack of blue sky and sun. The UK can often experience anticyclonic gloom in late autumn, winter or early spring, sometimes lasting for many days and even weeks. What happens is that high pressure allows air to sink, causing warming and compression, with the sinking motion trapping moisture and cloud near the surface. A temperature inversion can occur, when colder air exists near the surface of the earth with a layer of warmer air above, acting as an atmospheric lid. When the sun isn't as strong, it limits the breakup of cloud, along with a lack of wind from the area of high pressure. Overnight, the cloud can often thicken, too, as moisture condenses, with drizzly outbreaks possible. Anticyclonic gloom can often lead to higher levels of pollution, as that becomes trapped as well. Read more:'Many mistakes' made over COVID school closuresUK's 'most remote pub' cancels Harry Potter-themed party The first half of November 2024 was the last notable instance of anticyclonic gloom, with virtually no sunshine recorded in many locations across the UK. For now, it looks like things will change from Sunday, with wet and windy weather moving in from the west."
    },
    {
        "title": "Hamas releases more bodies of hostages - as Trump threatens 'violent' disarmament",
        "description": "Israel has received the bodies of four hostages taken by Hamas during the October 7 attacks, as pressure grows on the group to locate the remaining victims as part of the Gaza ceasefire deal.",
        "url": "https://news.sky.com/story/hamas-releases-more-bodies-of-hostages-as-trump-threatens-violent-disarmament-13450311",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-gaza-hostages_7051249.jpg?20251014234954",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-14 22:12:00",
        "Headline": "Donald Trump has suggested Hamas \"misrepresented\" the number of hostages it could free during ceasefire negotiations - and also threatened the group with consequences should it not disarm.",
        "Content": " Israel has received the bodies of four hostages taken by Hamas during the October 7 attacks, as pressure grows on the group to locate the remaining victims as part of the Gaza ceasefire deal. After all 20 remaining living Israelis kidnapped two years ago were returned on Monday, attention has turned to the victims who have died in captivity. Catch on the latest from Gaza Of the 28 dead hostages, only eight have so far been returned. The four returned late on Tuesday, via the Red Cross, are yet to be formally identified. The four handed over by Hamas on Monday are Guy Illouz, Bipin Joshi, Yossi Sharabi, and Daniel Peretz. Sky's Middle East correspondent Adam Parsons said it's \"clear Hamas doesn't know where all these bodies are\", with fears they could be under rubble in parts of Gaza devastated by Israel's two-year bombardment. Some of the fighters who had been guarding them have been killed. The return of all the hostages, living and dead, is a key pillar of the deal agreed to by Israel and Hamas, heralded by US President Donald Trump as having brought \"peace in the Middle East\". Israel - which has freed hundreds of Palestinian prisoners - said it would keep the Rafah crossing between Gaza and Egypt closed on Wednesday, and limit aid entering Gaza, due to Hamas's failure to return all the dead. Hostage families have urged their government to \"finish the job\" and get the remaining bodies home. Two far-right ministers in Benjamin Netanyahu's government, Bezalel Smotrich and Itamar Ben-Gvir, said Israel should limit aid and use \"military pressure\" to ensure their return.  Trump: Hamas must disarm, or we will disarm them Hamas is also facing questions over whether it's willing to comply with a longer-term requirement of the Gaza peace plan: that the group must disarm. Photos and videos have emerged on social media in the past few days of Hamas fighters appearing to kill other Palestinians, whom they accused of collaborating with Israel. Mr Trump told reporters that if the group didn't disarm, \"we will disarm them\". \"It will happen quickly and perhaps violently,\" he said in a meeting with Argentina's Javier Milei at the White House. Mr Trump said he had received assurances from Hamas \"through my people\" that the group would disarm. From our experts:Will Trump stay the course?There is a catch to Trump's deal  Starmer: Hamas must honour ceasefire But the president also appeared to suggest Hamas had \"misrepresented\" the number of hostages it will be able to return during ceasefire negotiations. \"We were told they had 26, 24 [bodies] of dead hostages, if we can use those terms,\" he added. \"And it seems they don't have that number because we're talking about a much lesser number. \"I want them back. That's what they said. I want them back.\" Hamas had agreed to a Monday deadline to return all the hostages. Britain's Sir Keir Starmer has also called on Hamas to \"honour the terms of the ceasefire\" and release the remaining hostages, as he paid tribute to one of those returned to Israel on Monday. The loss of Yossi Sharabi, who has British family, \"will be felt deeply by his family after Hamas so cruelly drew out their horror and denied them the right to grieve\", the prime minister said."
    },
    {
        "title": "Freed Palestinian prisoner alleges torture and deaths in Israeli detention",
        "description": "A freed Palestinian prisoner, one of about 1,700 detainees from Gaza who had been held by Israel without charge, has described scenes of systematic torture, humiliation and death inside Israeli detention. ",
        "url": "https://news.sky.com/story/freed-palestinian-prisoner-alleges-torture-and-deaths-in-israeli-detention-13450233",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-akram-al-basyouni-palestinian-prisoners_7051191.jpg?20251014212316",
        "type": "World",
        "Author": "Celine Alkhaldi, Middle East producer",
        "Date Published": "2025-10-14 19:11:00",
        "Headline": "Akram al Basyouni, who spent nearly two years in custody, tells Sky News that prisoners were beaten \"so savagely our ribs were shattered\". ",
        "Content": "By Celine Alkhaldi, Middle East producer  A freed Palestinian prisoner, one of about 1,700 detainees from Gaza who had been held by Israel without charge, has described scenes of systematic torture, humiliation and death inside Israeli detention.  Akram al Basyouni, 45, from northern Gaza, says he was detained on 10 December 2023 at a shelter school in Jabalia and spent nearly two years in custody, including at the Sde Teiman military base. \"Many of our fellow prisoners were beaten to the point of death,\" he told Sky News. \"When we cried out to the guards for help, they would answer coldly, 'Let him die'. Five minutes later they would take the body away, wrap it in a bag, and shut the door.\" Al Basyouni said detainees were routinely tortured, beaten with batons and fists, attacked by dogs and gassed during what guards called a \"reception ceremony\". \"They beat us so savagely our ribs were shattered. They poured boiling water over the faces and backs of young men until their skin peeled away. We sat on cold metal floors for days, punished even for asking for help.\" Sky News has contacted the Israel Prison Service (IPS) and the Israel Defense Forces for comment but has not yet received a response. Al Basyouni claimed prisoners were forced to remain on their knees for long hours, deprived of clothing and blankets, and subjected to religious and psychological abuse. \n                  Hamas releases more bodies of hostages - as Trump threatens 'violent' disarmament\n                 \n                  Is Hamas ready to give up Gaza?\n                 \n                  Bodies of four hostages returned to Israel - and why finding others will be 'massive challenge'\n                 \"They cursed the Prophet, tore up the Koran in front of us, and insulted our mothers and sisters in the foulest language,\" he said. \"They told us our families were dead. 'There is no Gaza,' they said. 'We killed your children.'\"  Palestinians freed from Israeli prisons in past exchanges have reported frequent beatings, insufficient food and deprivation of medical care. A 2024 UN report said that since 7 October 2023, thousands of Palestinians have been held arbitrarily and incommunicado by Israel, often shackled, subject to torture and deprived of food, water, sleep and medical care. Israel has maintained that it follows international and domestic legal standards for the treatment of prisoners and that any prison personnel violations are investigated. Its National Security Minister Itamar Ben-Gvir, who oversees the country's prisons, has on multiple occasions boasted about making conditions for Palestinians as harsh as possible while remaining within the law. Al Basyouni claimed many detainees, including doctors, died from beatings or medical neglect. \"I heard about Dr Adnan al-Bursh, may God have mercy on him,\" he said. \"He was struck in the chest by a prison guard, over his heart. He lost consciousness immediately and died five minutes later.\" Read more from Sky News:Trump warned his plan for Gaza 'doesn't make sense'Hamas official says Blair isn't welcome in Gaza role Sky News' own investigation found that Dr al-Bursh, one of Gaza's most respected surgeons, died after being tortured in Israeli custody, sustaining broken ribs and severe injuries while being held at Ofer Prison. Al Basyouni said he also met Dr Hossam Abu Safiya at Ofer and heard that Dr Akram Abu Ouda had been \"subjected to severe and repeated torture.\" \"Even the doctors were beaten and denied treatment,\" he said. \"Many reached the brink of death.\" In response to our investigation into Dr al-Bursh's death, a spokesman for the Israel Prison Service said at the time: \"We are not aware of the claims you described and as far as we know, no such events have occurred under IPS responsibility.\""
    },
    {
        "title": "French PM Sebastien Lecornu shelves Emmanuel Macron's pension reform in bid for political survival",
        "description": "France's reappointed prime minister has offered to suspend controversial reforms to the country's pension system, days after returning to the top role. ",
        "url": "https://news.sky.com/story/french-pm-sebastien-lecornu-shelves-emmanuel-macrons-pension-reform-in-bid-for-political-survival-13450132",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-sebastien-lecornu-emmanuel-macron_7043724.jpg?20251006093920",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-14 15:37:00",
        "Headline": "Sebastien Lecornu says he will postpone the rollout of pension age changes, one of President Emmanuel Macron's main economic policies, until after the 2027 presidential election.",
        "Content": "France's reappointed prime minister has offered to suspend controversial reforms to the country's pension system, days after returning to the top role.  Emmanuel Macron's pension reform, which gradually raises the age at which a worker can retire on a full pension from 62 to 64, was forced through without a vote in parliament after weeks of street protests in 2023. Sebastien Lecornu said on Tuesday he would postpone the introduction of the scheme, one of Mr Macron's main economic policies, until after the 2027 presidential election. With two no-confidence votes in parliament this week, Mr Lecornu had little choice but to make the offer to secure the support of left-wing MPs who demanded it as the price of their support for his survival. The prime minister will hope it is enough to get a slimmed-down 2026 budget passed at a time when France's public finances are in a mess. It will be seen as a blow to Mr Macron, leaving him with little in the way of domestic achievements after eight years in office. But it reflects the reality that giving ground on the landmark measure was the only way to ensure the survival of his sixth prime minister in under two years. Mr Lecornu told MPs he will \"suspend the 2023 pension reform until the presidential election\". \"No increase in the retirement age will take place from now until January 2028,\" he added. Read more:Police use tear gas on Belgian protestersMigrant who threatened to kill Farage jailed The move will cost the Treasury €400m (£349m) in 2026, and €1.8bn (£1.5bn) the year after, he said, warning it couldn't just be added to the deficit and \"must therefore be financially offset, including through savings measures\". Mr Lecornu, 39, was reappointed as prime minister by Mr Macron on Friday, four days after he resigned from the role just hours after naming his cabinet - and after political rivals threatened to topple his government.  On re-taking office, he pledged to \"put an end to this political crisis, which is exasperating the French people, and to this instability, which is bad for France's image and its interests\". Economists in Europe have previously warned that France - the EU's second-largest economy - faces a Greek-style debt crisis, with its deficit at 5.4%. Mr Lecornu is hoping to bring that down to 4.7% with an overall package of cuts totalling €30bn (£26bn), but his plans were dismissed as wishful thinking by France's independent fiscal watchdog. Mr Macron has burned through five prime ministers in less than two years, but has so far refused to call another election or resign. "
    },
    {
        "title": "Niece of Kenyan woman allegedly murdered by British soldier meets with Defence Secretary",
        "description": "The niece of a Kenyan woman allegedly murdered by a British soldier has met with the UK's Defence Secretary to fight for the accused man's extradition.",
        "url": "https://news.sky.com/story/niece-of-kenyan-woman-allegedly-murdered-by-british-soldier-meets-with-defence-secretary-13450258",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-esther-njoki-kenya_7051173.jpg?20251014210137",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-14 20:05:00",
        "Headline": "Agnes Wanjiru's body was found in a septic tank close to a British Army base in Kenya, 2012.",
        "Content": " The niece of a Kenyan woman allegedly murdered by a British soldier has met with the UK's Defence Secretary to fight for the accused man's extradition. Esther Njoki, 21, was eight-years-old when her aunt Agnes Wanjiru, 21, was found dead in 2012. Her body was discovered in a hotel septic tank close to a British Army base in Nanyuki, Kenya, two months after her disappearance. Kenyan prosecutors have issued an arrest warrant for the British soldier accused of the murder. He has been living freely in the UK since. Today, Esther, who is the family's spokesperson, held a meeting with Defence Secretary John Healey to make the case for him to be extradited to Kenya. Ms Njoki told Sky News' The UK Tonight with Sarah-Jane Mee that she would keep fighting for justice. She said: \"My reason for my visit is to keep on putting pressure on. Extradition must be done, the family want him extradited to Kenya. \"He should not be excused for any reason just because he had an army uniform.\" Ms Njoki added: \"I am also here because I want change, change must begin with us. \"It doesn't matter where I come from. I come from the same background Agnes came from. I know they took advantage because my family was not able. \"I know things are changing since I stepped up to say what is happening and holding the government accountable.\" She added: \"If we can change the entire system, I think we will secure a great future for other generations because my family has had to go through hell.\" Read more:'Many mistakes' made over COVID school closuresUK's 'most remote pub' cancels Harry Potter-themed party Mr Healey, who previously met Ms Njoki in April 2025 during a visit to Kenya, paid tribute to Esther and said the government would support the Kenyan investigation. He said: \"I want to pay tribute to Esther, who is an extraordinary spokesperson for her family, and for women who have suffered violence. \"Our government will continue to do everything we can to support the Kenyan investigation, secure a resolution to this case and finally bring peace to Esther and her grieving family.\""
    },
    {
        "title": "Trump achieves something remarkable, but will his 'goldfish' attention span stay the course?",
        "description": "Two things can be true at the same time - an adage so apt for the past day.&#160;",
        "url": "https://news.sky.com/story/trump-has-achieved-something-remarkable-but-will-his-goldfish-attention-span-stay-the-course-13449797",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-family-photo-peace-summit_7050152.jpg?20251013174006",
        "type": "World",
        "Author": "Mark Stone",
        "Date Published": "2025-10-14 00:34:00",
        "Headline": "The world leaders' summit in Egypt was the Trump show. It was a show called by him, pulled off for him, attended by leaders who had no other choice and all because he craves the ego boost.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Two things can be true at the same time - an adage so apt for the past day.  This was the Trump show. There's no question about that. It was a show called by him, pulled off for him, attended by leaders who had no other choice and all because he craves the ego boost. Gaza deal signed - as it happened But the day was also an unquestionable and game-changing geopolitical achievement. Trump stopped the war, he stopped the killing, he forced Hamas to release all the hostages, he demanded Israel to free prisoners held without any judicial process, he enabled aid to be delivered to Gaza, and he committed everyone to a roadmap, of sorts, ahead. He did all that and more. He also made the Israel-Palestine conflict, which the world has ignored for decades, a cause that European and Middle Eastern nations are now committed to invest in. No one, it seems, can ignore Trump. Love him or loathe him, those are remarkable achievements. 'Focus of a goldfish' The key question now is - will he stay the course? One person central to the negotiations which have led us to this point said to me last week that Trump has the \"focus of a goldfish\". It's true that he tends to have a short attention span. If things are not going his way, and it looks likely that he won't turn out to be the winner, he quickly moves on and blames someone else. So, is there a danger of that with this? Let's check in on it all six months from now (I am willing to be proved wrong - the Trump-show is truly hard to chart), but my judgement right now is that he will stay the course with this one for several reasons. First, precisely because of the show he has created around this. Surely, he won't want it all to fall apart now? He has invested so much personal reputation in all this, I'd argue that even he wouldn't want to drop it, even when the going gets tough - which it will. Second, the Abraham Accords. They represented his signature foreign policy achievement in his first term - the normalisation of relations between Israel and the Muslim world.  Back in his first presidency, he tried to push the accords through without solving the Palestinian question. It didn't work. This time, he's grasped the nettle. Now he wants to bring it all together in a grand bargain. He's doing it for peace but also, of course, for the business opportunities - to help \"make America great again\". Peace - and prosperity - in the Middle East is good for America. It's also good for Trump Inc. He and his family are going to get even richer from a prosperous Middle East. Read more:Trump hails 'peace in the Middle East'His team ripped up golden rule to pull off peace plan Then there is the Nobel Peace Prize. He didn't win it this year. He was never going to - nominations had to be in by January. But next year he really could win - especially if he solves the Ukraine challenge too. If he could bring his coexistence and unity vibe to his own country - rather than stoking the division - he may stand an even greater chance of winning."
    },
    {
        "title": "Armed forces taking control of Madagascar, military colonel says",
        "description": "A military colonel in Madagascar has announced that the armed forces are taking control of the country.",
        "url": "https://news.sky.com/story/armed-forces-taking-control-of-madagascar-military-colonel-says-13450130",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-madagascar-mdagascar-protests_7051029.jpg?20251014165942",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-14 15:38:00",
        "Headline": "The military has taken control after the impeachment of President Andry Rajoelina amid widespread youth protests over poverty and governance failures",
        "Content": "A military colonel in Madagascar has announced that the armed forces are taking control of the country. The announcement, in front of a ceremonial presidential palace in the capital, Antananarivo, came almost immediately after parliament voted to impeach President Andry Rajoelina. \"We are taking power,\" Colonel Michael Randrianirina, the leader of Madagascar's elite CAPSAT military unit, said. Mr Rajoelina, whose government has faced weeks of youth protests over poverty, power outages and a lack of opportunity in the Indian Ocean island country, has reportedly fled the country, fearing for his safety. However, his office denounced the military's actions as an \"attempted coup d'etat\" and an \"illegal declaration\" and insisted that Mr Rajoelina remained in charge. Colonel Randrianirina said the military would form a council composed of officers from the military and gendarmerie (a military force with policing duties), and that a prime minister would be appointed to \"quickly\" form a civilian government. The constitution and the powers of the High Constitutional Court had been suspended, and a referendum would be held in two years, he added, even though the details of the vote were not immediately clear. \n                  Hamas releases more bodies of hostages - as Trump threatens 'violent' disarmament\n                 \n                  Freed Palestinian prisoner alleges torture and deaths in Israeli detention\n                 \n                  Wildlife Photographer of the Year: See 2025's winning snaps\n                  Mr Rajoelina had faced growing demands to step down amid weeks of anti-government protests, largely driven by young Gen Z (those born in the mid-to-late 1990s) demonstrators. The protests reached a critical moment on Saturday, when Colonel Randrianirina and soldiers from his elite CAPSAT unit joined the demonstrators and turned against Mr Rajoelina. On Tuesday, from an undisclosed location, Mr Rajoelina issued a decree dissolving the lower house of parliament, seemingly to prevent impeachment. However, lawmakers disregarded the decree and voted overwhelmingly to impeach the 51-year-old. Mr Rajoelina's whereabouts are currently unknown. He has left the country for a \"safe place\" in fear for his life after the rebellion. Once a French colony, Madagascar has experienced multiple military-backed coups since gaining independence in 1960. This includes the 2009 coup, which brought Mr Rajoelina to power as the head of a transitional government. The youth-led protests against his administration began last month in response to electricity and water shortages, but have since expanded into broader discontent with the government and Mr Rajoelina's leadership. Demonstrators have raised various concerns, such as poverty, the high cost of living, access to higher education, and allegations of corruption involving government officials and their relatives. Read more from Sky News:Madagascar's president has fled country, opposition leader saysMigrant with AK-47 face tattoo who threatened to kill Farage jailed Madagascar faces significant poverty, impacting about 75% of its 31 million residents, according to the World Bank. On Tuesday, thousands of young protesters gathered in a central square in Antananarivo, continuing their anti-government demonstrations and demanding Mr Rajoelina's resignation. While the streets remained largely peaceful and soldiers patrolling in armoured vehicles were met with cheers from locals, the situation remained tense. \"We don't have a reliable supply of electricity and water from the government,\" said protester Soavololona Faraniaina. \"If children in Madagascar are forced to study in the dark, what hope does the country's future hold? Where is the prosperous Madagascar that other nations once admired?\""
    },
    {
        "title": "Belgium: Tear gas, scuffles and cancelled flights as thousands stage general strike and protests",
        "description": "Police in Belgium fired tear gas as they tried to disperse tens of thousands of demonstrators protesting against Prime Minister Bart de Wever's proposed austerity plans.",
        "url": "https://news.sky.com/story/belgium-tear-gas-scuffles-and-cancelled-flights-as-workers-stage-general-strike-and-protests-13450002",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-brussels-demonstration_7050854.jpg?20251014135133",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-14 11:21:00",
        "Headline": "Several dozen demonstrators were arrested in Brussels on Tuesday as tens of thousands took to the streets to protest against budget cuts. ",
        "Content": " Police in Belgium fired tear gas as they tried to disperse tens of thousands of demonstrators protesting against Prime Minister Bart de Wever's proposed austerity plans. Minor scuffles broke out between police and protesters in Brussels, as workers staged a general strike against the government, organised by the country's three largest unions. Crowds, some playing drums and horns and others setting off flares and smoke bombs, crossed the entire city centre between the Gare du Nord and Gare du Midi train stations, Brussels police said. While organisers said 150,000 people joined the demonstration, the police put the number at 80,000. Most of the scheduled flights in and out of Belgium's two largest airports were grounded as part of Tuesday's industrial action. All departures and around half of the scheduled arrivals at Brussels International Airport were cancelled as staff from the security firm providing X-ray screening walked out, an airport spokesman said. At Brussels South Charleroi Airport, about 60 km (40 miles) south of the city, all flights were cancelled, according to the airport's website. \n                  Police thwart suspected plot to attack Belgium's prime minister\n                 \n                  Belgium announces it will recognise Palestinian state\n                 \n                  Tomorrowland: 'Devastating' blaze destroys main stage at major festival - two days before it was due to begin\n                 The protest also disrupted traffic and public transport in the Belgian capital. Most of Brussels' underground train, bus and tram lines were cut as a result of the strike, public transport operator STIB said in a post on social media platform X. Traffic was gridlocked in places as protesters started fires on some of the city's big boulevards, police said. Some marchers carried signs with the number 67 crossed out, referring to the planned new retirement age, which already rose from 65 to 66 earlier this year. Several dozen protesters were arrested. Pension reform is one of the key issues for demonstrators, who were led by the country's main unions and backed by activist groups such as Greenpeace and Oxfam. The protesters are also unhappy with cuts to unemployment benefits and hospital funding that have been proposed by PM Bart De Wever and his new centre-right coalition government. Read more on Sky News:Briton detained in Iran movedAttack on minister thwartedMigrant jailed over Farage kill threat  Thierry Bodson, the leader of the FGTB union, which claims on its website to have more than 1.5 million members, told the French-language state radio station RTBF on Tuesday: \"What really mobilises us are pensions.\" Mr Bodson said ministers' plans would not only reduce income for future retirees but also introduce uncertainty by changing how state pensions are calculated. Mr De Wever, from the nationalist New Flemish Alliance (N-VA), became prime minister in February and now heads a predominantly right-wing coalition. He has promised to reduce the national debt without raising taxes but is facing challenges in finalising next year's budget."
    },
    {
        "title": "Bodies of four hostages returned to Israel - and why finding others will be 'massive challenge'",
        "description": "The families of 24 dead hostages are still waiting to have their bodies returned from Gaza.",
        "url": "https://news.sky.com/story/bodies-of-four-hostages-returned-to-israel-and-why-finding-others-will-be-massive-challenge-13449883",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-hostage-israel-gaza_7050522.jpg?20251014085745",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-10-14 08:26:00",
        "Headline": "Only four bodies were transferred by Hamas to Israel on Monday. It remains to be seen when the bodies of the remaining hostages in Gaza will be handed over. The Red Cross said it could take days or weeks - and there's a possibility some may never be found.",
        "Content": "The families of 24 dead hostages are still waiting to have their bodies returned from Gaza. Only four bodies were transferred by Hamas to Israel on Monday. It remains to be seen when the remains of the remaining hostages will be handed over. Here's what we know about the four hostages whose bodies have been returned, while the families of others who have been declared dead await word from Israeli authorities on the fate of their loved ones. Gaza latest: 'Six killed' as Israeli troops open fire on 'suspects'  Who are the four hostages whose bodies have been found? The bodies of Yossi Sharabi, Guy Illouz, Daniel Peretz and Bipin Joshi have been returned to Israel. The Israeli military has officially identified the bodies of Mr Illouz and Mr Joshi. The two men were both in their 20s when Hamas took then during the October 7 2023 attack on Israel that sparked the war. Mr Illouz, who is from Israel, was taken from the Nova music festival, while Mr Joshi, a student from Nepal, was taken from a bomb shelter. Israel said Mr Illouz died from his wounds while being held captive without proper medical treatment, while Mr Joshi was murdered in captivity during the first months of the war. What about the remaining hostages' bodies? Hamas has said recovering the remaining bodies could take time, as not all burial sites are known. Israeli authorities have said some of those remains may not be located. The Red Cross said it will take time to hand over the remains of hostages and detainees killed in the war, calling it a \"massive challenge\" considering the difficulties of finding bodies amid Gaza's rubble. \"That's an even bigger challenge than having the people alive being released. That's a massive challenge,\" said Christian Cardon, spokesperson for the International Committee of the Red Cross. He said it could take days or weeks - and there was a possibility some may never be found. An international task force will work to locate the bodies of the deceased hostages who are not returned within 72 hours, said Gal Hirsch, Israel's coordinator for the hostages and the missing. What has been the response of hostages' families? The Israeli Hostages Families Forum has called for the suspension of the ceasefire agreement, saying \"Hamas's violation of the agreement must be met with a very serious response\". \"We demand all 28 hostages back. We will not give up on anyone, until the last hostage is returned,\" it added. Under US President Donald Trump's peace plan, all the hostages - including the deceased - should be returned as part of the first phase of the ceasefire. Udi Goren, cousin of Tal Haimi, whose body has not yet returned, said his family would only be able to mourn properly after the process is complete. Mr Haimi was killed while defending his kibbutz of Nir Yitzhak on 7 October. Mr Goren told Sky News: \"Tal is missing from his family and there's no closure and there's no certainty. And unless he's back home, first of all, there's always this sliver of doubt. What happens? Where is he? Maybe someone was wrong. \"And only when he's brought back, then we can we can mourn him. So that's a huge thing that allows us to move on with life. \"And the other thing is beyond Jewish tradition and bringing home someone for burial, it's actually having a final place of rest. That we know this is where he is. That if his kids want to go talk to him because they had a dream about him, they know where he is. \"And on the anniversary, then we could go there and we can mourn and we could have a proper service. And this concept of certainty and finding closure, it doesn't happen without it.\" Read more:Inside rooms where hostages will spend first nights of freedomSongs of celebration in Tel Aviv as crowds greet hostages Release of living hostages brings pause to two years of war On Monday, Hamas released all 20 living hostages, bringing a pause to two years of war that has levelled much of Gaza and killed tens of thousands of Palestinians. Tens of thousands of Israelis watched the hostage transfer at public screenings across the country. Tap on their pictures to read more about the hostages: The hostages were exchanged for more than 1,900 Palestinian prisoners - including 250 serving life sentences for convictions for attacks on Israelis, as well as 1,700 Gazans detained during the war.  Issues remain with ceasefire plan The exchange of hostages and prisoners has raised hopes it marks the end of the bloody conflict between Israel and Hamas. A second phase of the plan, which all sides have yet to agree on, could see Israeli troops withdraw from Gaza. However, issues remain, such as whether Hamas will disarm, and who will govern Gaza.  Trump calls for new era of peace in Middle East Mr Trump travelled to the region to celebrate the deal. He received a rapturous welcome and multiple standing ovations as he addressed Israel's parliament, though at one point he was heckled by two left-wing politicians who were ejected from the chamber after they interrupted his speech. \"This is a historic dawn of a new Middle East,\" Mr Trump told the Knesset. \"Generations from now this will be remembered as the moment that everything began to change, and change very much for the better.\" Mr Trump later travelled to the Egyptian Red Sea resort town of Sharm el-Sheikh, where he called for a new era of peace in the Middle East, saying the region has \"a once-in-a-lifetime chance to put the old feuds and bitter hatreds behind us\". 👉 Follow Trump100 on your podcast app 👈  Speaking to world leaders attending the summit, he urged them \"to declare that our future will not be ruled by the fights of generations past\".  The war began when Hamas stormed into Israel on October 7 2023, killing around 1,200 people and taking 251 hostage. Israel invaded Gaza in retaliation, with airstrikes and ground assaults devastating much of the enclave and killing more than 67,000, according to the Hamas-run health ministry. Its figures do not differentiate between civilians and combatants but it says around half of those killed were women and children. "
    },
    {
        "title": "Authorities name 16 killed in Tennessee explosives factory blast",
        "description": "Authorities have identified the 16 people killed in a massive blast at a munitions factory in rural Tennessee.",
        "url": "https://news.sky.com/story/authorities-name-16-killed-in-tennessee-explosives-factory-blast-13449834",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-reyna-gillahan-tennessee_7050503.jpg?20251014083247",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-14 05:33:00",
        "Headline": "They were killed in an explosion on Friday at an Accurate Energetic Systems facility around 60 miles southwest of Nashville. The company researches and supplies explosives for the military.",
        "Content": " Authorities have identified the 16 people killed in a massive blast at a munitions factory in rural Tennessee. They were killed in an explosion on Friday at an Accurate Energetic Systems facility around 60 miles southwest of Nashville. The company researches and supplies explosives for the military. Investigators are still working to discover the cause of the explosion. Those killed were: Jason Adams, Erick Anderson, Billy Baker, Adam Boatman, Christopher Clark, Mindy Clifton, James Cook, Reyna Gillahan, LaTeisha Mays, Jeremy Moore, Melinda Rainey, Melissa Stanford, Trenton Stewart, Rachel Woodall, Steven Wright and Donald Yowell.  At a news conference, Humphreys County Sheriff Chris Davis said people in the community probably at least knew relatives of the victims killed in the explosion. \"It's just small county, rural America, where everybody knows each other and everybody's gonna take care of each other,\" he said. Authorities said there were no survivors of the blast, which left twisted and burning metal in its wake. They said they were working to clear the area of hazards, including explosives, and identify remains. Read more from Sky News:Huge rise in cyber attacks reportedBudget is 'make or break', chancellor warned Once the area is clear they can begin investigating what caused the explosion, said Matthew Belew, acting special agent in charge of the Bureau of Alcohol, Tobacco, Firearms and Explosives. He said some of the relevant evidence was spread out over miles. \"It's almost like putting a puzzle back together,\" he added. \"We have worked closely with AES to look at pictures, look at blueprints, any of the identifying things that were in the building. And then we slowly methodically start to put some of that stuff together.\""
    },
    {
        "title": "Charlie Kirk posthumously awarded Presidential Medal of Freedom by Donald Trump",
        "description": "Charlie Kirk has been posthumously awarded the Presidential Medal of Freedom by Donald Trump.",
        "url": "https://news.sky.com/story/charlie-kirk-posthumously-awarded-presidential-medal-of-freedom-by-donald-trump-13450211",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-erika-kirk-charlie-kirk_7051223.jpg?20251014223251",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-14 20:40:00",
        "Headline": "Trump described Charlie Kirk as an \"American patriot of the deepest conviction, the finest quality and the highest calibre\".",
        "Content": " Charlie Kirk has been posthumously awarded the Presidential Medal of Freedom by Donald Trump. The USA's highest civilian honour was received by the conservative activist's widow, Erika, at the White House. Kirk, 31, was fatally shot on 10 September while speaking at an event at Utah Valley University. He founded Turning Point USA and toured American university campuses, debating students about current affairs. Addressing those attending the ceremony in the White House rose garden, the US president said they were there to \"honour and remember a fearless warrior for liberty\" and a \"beloved leader who galvanised the next generation\". He said Kirk's name was being entered \"forever into the eternal roster of true American heroes\". Trump described Charlie Kirk as an \"American patriot of the deepest conviction, the finest quality and the highest calibre\". He said his nation had been \"robbed\" of an \"extraordinary champion\". And Trump said Kirk was assassinated in the \"prime of his life for boldly speaking the truth, for living his faith, and relentlessly fighting for a better and stronger America\". Read more from Sky News:Migrant with AK-47 face tattoo who threatened to kill Farage jailedEx-Premier League referee admits making indecent image of child Today was Charlie Kirk's birthday, the president said. He described Erika Kirk as someone who had \"endured unspeakable hardship with unbelievable strength\". A 22-year-old man, Tyler Robinson, from the city of Washington in Utah has been charged with Kirk's murder. Prosecutors said they would seek the death penalty. At a memorial event held at a stadium in Arizona, Erika Kirk told an enormous crowd she forgave her husband's killer. \"The answer to hate is not hate,\" she said."
    },
    {
        "title": "Grammy-winning R&B and soul star D'Angelo dies after 'prolonged battle with cancer'",
        "description": "Grammy-award winning R&B and soul singer D'Angelo has died following a battle with pancreatic cancer, his family has said.",
        "url": "https://news.sky.com/story/grammy-winning-singer-dangelo-dies-after-prolonged-battle-with-cancer-13450168",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dangelo-rb-dangelo_7051076.jpg?20251014181029",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-14 16:50:00",
        "Headline": "The 51-year-old died on Tuesday following a \"prolonged and courageous battle with cancer,\" his family said.",
        "Content": "Grammy-award winning R&B and soul singer D'Angelo has died following a battle with pancreatic cancer, his family has said. He died on Tuesday, leaving behind a \"legacy of extraordinarily moving music\" following a \"prolonged and courageous battle with cancer,\" his family said in a statement. The prominent musician, born Michael D'Angelo Archer, was 51 years old. A family statement said: \"We are saddened that he can only leave dear memories with his family, but we are eternally grateful for the legacy of extraordinarily moving music he leaves behind. \"We ask that you respect our privacy during this difficult time, but invite you all join us in mourning his passing while also celebrating the gift of song that he has left for the world.\" The singer rose to prominence in the 1990s with his first album, Brown Sugar. The track \"Lady\" from that album reached No. 10 in March 1996 and remained on Billboard's Hot 100 chart for 20 weeks."
    },
    {
        "title": "Alex Jones's appeal over £1bn Sandy Hook judgement rejected by US Supreme Court",
        "description": "The US Supreme Court has rejected an appeal from conspiracy theorist Alex Jones over a $1.4bn (&#163;1bn) judgment against him after he described the Sandy Hook shooting as a hoax.",
        "url": "https://news.sky.com/story/alex-joness-appeal-over-1631bn-sandy-hook-judgement-rejected-by-us-supreme-court-13450146",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-alex-jones-infowars_7051045.jpg?20251014171920",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-10-14 16:08:00",
        "Headline": "The lawyers for Alex Jones say the conspiracist will never be able to pay the amount.",
        "Content": "The US Supreme Court has rejected an appeal from conspiracy theorist Alex Jones over a $1.4bn (£1bn) judgment against him after he described the Sandy Hook shooting as a hoax. The Infowars host, who filed for bankruptcy in late 2022, had argued that the judge was wrong to find him liable for defamation and infliction of emotional distress without holding a trial. But the US Supreme Court has declined to hear a challenge from Mr Jones over the money, set to be awarded to the families of the victims of the shooting. The tragedy saw 20 primary school children and six teaching staff killed in Newtown, Connecticut, in 2012. Justices on Tuesday upheld most of the judgment, issued by a judge and jury in 2022, to 14 family members of children and school employees killed and an FBI agent who responded to the shooting. Mr Jones's lawyers told the justices that the \"plaintiffs have no possible hope of collecting\" all of the money.  Chris Mattei, a lawyer representing the Sandy Hook families, said they were looking forward to enforcing the judgment. \n                  Authorities name 16 killed in Tennessee explosives factory blast\n                 \n                  Charlie Kirk posthumously awarded Presidential Medal of Freedom by Donald Trump\n                 \n                  Grammy-winning R&B and soul star D'Angelo dies after 'prolonged battle with cancer'\n                 He said the court had properly rejected Mr Jones's \"latest desperate attempt to avoid accountability for the harm he has caused\". What did Alex Jones say about Sandy Hook? The right-wing figure falsely claimed the incident at Sandy Hook Elementary School was staged by actors. Mr Jones was sued for defamation after calling the shooting a \"false flag\" operation designed to stir up anti-gun sentiment among Americans. He also falsely claimed the parents of the children were \"crisis actors\" faking grief in TV interviews. Mr Jones has argued that the $1.4bn judgment in the lawsuit brought against him violated his constitutional rights to due process and free speech. It is understood to be the largest judgment in American libel case history, according to Mr Jones's filing to the US Supreme Court. Read more:Who is Alex Jones?Sandy Hook survivors graduate high school Mr Jones is separately appealing against a $49m (£37m) judgment in a similar defamation lawsuit in Texas, after failing to turn over documents sought by the parents of another Sandy Hook victim. Jones also faces two more defamation lawsuits from other Sandy Hook parents, and the man falsely identified as a school shooter. Those cases have not yet gone to trial."
    },
    {
        "title": "Trump achieves something remarkable, but will his 'goldfish' attention span stay the course?",
        "description": "Two things can be true at the same time - an adage so apt for the past day.&#160;",
        "url": "https://news.sky.com/story/trump-has-achieved-something-remarkable-but-will-his-goldfish-attention-span-stay-the-course-13449797",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-family-photo-peace-summit_7050152.jpg?20251013174006",
        "type": "US",
        "Author": "Mark Stone",
        "Date Published": "2025-10-14 00:34:00",
        "Headline": "The world leaders' summit in Egypt was the Trump show. It was a show called by him, pulled off for him, attended by leaders who had no other choice and all because he craves the ego boost.",
        "Content": "\n          US correspondent\n              @Stone_SkyNews\n  Two things can be true at the same time - an adage so apt for the past day.  This was the Trump show. There's no question about that. It was a show called by him, pulled off for him, attended by leaders who had no other choice and all because he craves the ego boost. Gaza deal signed - as it happened But the day was also an unquestionable and game-changing geopolitical achievement. Trump stopped the war, he stopped the killing, he forced Hamas to release all the hostages, he demanded Israel to free prisoners held without any judicial process, he enabled aid to be delivered to Gaza, and he committed everyone to a roadmap, of sorts, ahead. He did all that and more. He also made the Israel-Palestine conflict, which the world has ignored for decades, a cause that European and Middle Eastern nations are now committed to invest in. No one, it seems, can ignore Trump. Love him or loathe him, those are remarkable achievements. 'Focus of a goldfish' The key question now is - will he stay the course? One person central to the negotiations which have led us to this point said to me last week that Trump has the \"focus of a goldfish\". It's true that he tends to have a short attention span. If things are not going his way, and it looks likely that he won't turn out to be the winner, he quickly moves on and blames someone else. So, is there a danger of that with this? Let's check in on it all six months from now (I am willing to be proved wrong - the Trump-show is truly hard to chart), but my judgement right now is that he will stay the course with this one for several reasons. First, precisely because of the show he has created around this. Surely, he won't want it all to fall apart now? He has invested so much personal reputation in all this, I'd argue that even he wouldn't want to drop it, even when the going gets tough - which it will. Second, the Abraham Accords. They represented his signature foreign policy achievement in his first term - the normalisation of relations between Israel and the Muslim world.  Back in his first presidency, he tried to push the accords through without solving the Palestinian question. It didn't work. This time, he's grasped the nettle. Now he wants to bring it all together in a grand bargain. He's doing it for peace but also, of course, for the business opportunities - to help \"make America great again\". Peace - and prosperity - in the Middle East is good for America. It's also good for Trump Inc. He and his family are going to get even richer from a prosperous Middle East. Read more:Trump hails 'peace in the Middle East'His team ripped up golden rule to pull off peace plan Then there is the Nobel Peace Prize. He didn't win it this year. He was never going to - nominations had to be in by January. But next year he really could win - especially if he solves the Ukraine challenge too. If he could bring his coexistence and unity vibe to his own country - rather than stoking the division - he may stand an even greater chance of winning."
    },
    {
        "title": "Deadline day for firm linked to Tory peer to pay back millions over COVID contract scandal",
        "description": "Today is the High Court's deadline for a firm linked to Baroness Michelle Mone to repay &#163;122m for supplying defective PPE at the height of the pandemic, with no indication the Department of Health and Social Care (DHSC) will be paid in full.",
        "url": "https://news.sky.com/story/deadline-day-for-firm-linked-to-tory-peer-to-pay-back-millions-over-covid-contract-scandal-13450074",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-michelle-mone-doug-barrowman_7048089.jpg?20251010212504",
        "type": "Business",
        "Author": "Paul Kelso",
        "Date Published": "2025-10-14 13:08:00",
        "Headline": "The government appears set for a protracted and costly effort to secure the money as PPR Medpro is said to have assets worth less than £700k.",
        "Content": "\n          Business and economics correspondent\n              @pkelso\n  Today is the High Court's deadline for a firm linked to Baroness Michelle Mone to repay £122m for supplying defective PPE at the height of the pandemic, with no indication the Department of Health and Social Care (DHSC) will be paid in full. PPE Medpro, the company founded by her husband Doug Barrowman and introduced to a \"VIP lane\" for providers by the Conservative peer, has until 4pm to make the payment. While Mr Barrowman has described himself as the \"ultimate beneficial owner\" of PPE Medpro, and says £29m of profit from the deal was paid into a trust benefitting his family, including Baroness Mone and her children, he was never a director and the couple are not personally liable for the money. PPE Medpro filed for insolvency the day before Mrs Justice Cockerill's finding of breach of contract was published, and the company's most recent accounts show assets of just £666,000. Court-appointed administrators will now be responsible for recovering as much money as possible on behalf of creditors, principally the DHSC. Last week, Mr Barrowman's spokesman said \"consortium partners\" of PPE Medpro are \"prepared to enter into a dialogue with the administrators of the company to discuss a possible settlement with the government\". Read more:The PPE scandal surrounding Michelle Mone explained Sky News understands the consortium met last week and has contacted the administrators to request they facilitate a negotiation with the government. Mr Barrowman's spokesman did not specify how much they would be willing to offer by way of settlement, but in June PPE Medpro offered to settle the case for £23m. The DHSC rejected that offer, but with the company in administration and potentially limited avenues to recover funds, there is a risk the government may recover nothing while incurring further legal expenses.  What happened during the pandemic? In June 2020, PPE Medpro won contracts worth a total of £203m to provide 210 million masks and 25 million surgical gowns after Baroness Mone contacted ministers, including Michael Gove, on the company's behalf. While the £81m mask contract was fulfilled, the gowns were rejected for failing sterility standards, and in 2022 the DHSC sued. Earlier this month, Mrs Justice Cockerill ruled PPE Medpro was in breach of contract and liable to repay the full amount. Mr Barrowman has previously named several other companies as part of the gown supply, including two registered in the UK, and last week his spokesman said there was a \"strong case\" for the administrator to pursue them for the money. One of the companies named has denied any connection to PPE Medpro and two others have not responded to requests for comment. What could government do about it? Insolvency experts say administrators and creditors, in this case the government, may have some recourse to pursue individuals and entities beyond the liable company, but any process is likely to be lengthy and expensive. Julie Palmer, a partner at Begbies Traynor, told Sky News: \"The administrators will want to look at what's happened to what look like significant profits made on these contracts. \"If I was looking at this, I would want to establish the exact timeline, at what point were the profits taken out. \"They may also want to consider whether there is a claim for wrongful trading, because that effectively pierces the corporate veil of protection of a limited company, and can allow proceedings against company officers personally. \"The net of a director can also be expanded to shadow directors, people sitting in the background quite clearly with a degree of control of the management of the company, in which case some claims may rest against them.\" A spokesman for Forvis Mazars, one of the joint administrators of PPE Medpro, did not comment other than to confirm the firm's appointment. The DHSC was approached for comment."
    },
    {
        "title": "UK to have highest inflation in G7, IMF says",
        "description": "Price rises in the UK are to be the highest among the G7 club of industrialised nations, according to the International Monetary Fund (IMF). ",
        "url": "https://news.sky.com/story/uk-to-have-highest-inflation-in-g7-imf-says-13449998",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-imf-economy_6117647.jpg?20230411065631",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-14 13:00:00",
        "Headline": "Economic performance has been upgraded this year, but downgraded for next.",
        "Content": "Price rises in the UK are to be the highest among the G7 club of industrialised nations, according to the International Monetary Fund (IMF).  Inflation will be the highest among the club both this year and next, the world's lender of last resort said in its World Economic Outlook. As a result, the body's chief economist Pierre-Olivier Gourinchas said the Bank of England should be \"very cautious\" on making future interest rate cuts. Money blog: State pension to rise more than expected There was mixed news elsewhere in the outlook, as the UK's economic growth forecast, as measured by GDP, was revised up for this year but revised down for next. Latest data showed inflation stood at 3.8% and is forecast by the Bank to peak at 4% shortly. The IMF, however, said it expected inflation to average at 3.4% in 2025, up from its previously predicted 3.2%. That is forecast to slow to 2.5% this year, higher than the 2.3% anticipated just three months ago. Food and services inflation had been particularly high in recent months due to rising wage bills and poor harvests. Read more:Got AirPods? There's more to them than meets the eyeHomes now need repairs after work done under govt scheme Economic growth will be a higher 1.3% this year, up from the 1.2% forecast in July, thanks to a strong first few months of the year. Next year, however, GDP will be 1.4% rather than 1.3% as economies across the world feel trade pressures. Political reaction  Chancellor Rachel Reeves said: \"This is the second consecutive upgrade to this year's growth forecast from the IMF. \"But know this is just the start. For too many people, our economy feels stuck. Working people feel it every day, experts talk about it, and I am going to deal with it.\" Shadow chancellor Sir Mel Stride said the IMF assessment made for \"grim reading\". \"Since taking office, Labour have allowed the cost of living to rise, debt to balloon, and business confidence to collapse to record lows,\" he said. \"Working people are feeling the impact every time they shop, fill up the car, or pay their mortgage.\""
    },
    {
        "title": "Four big themes as IMF takes aim at UK growth and inflation",
        "description": "Six months ago the International Monetary Fund (IMF) warned that the world economy was heading for a serious slowdown, in the face of Donald Trump's tariffs.",
        "url": "https://news.sky.com/story/four-big-themes-as-imf-takes-aim-at-uk-growth-and-inflation-13450072",
        "image_url": "https://e3.365dm.com/25/07/1920x1080/skynews-money-economy-bank_6965901.png?20250716091522",
        "type": "Business",
        "Author": "Ed Conway",
        "Date Published": "2025-10-14 13:04:00",
        "Headline": "Sky's economics and data editor writes that the latest World Economic Outlook actually contains little for the UK to smile about, as big risks continue to loom large globally.",
        "Content": "\n          Economics and data editor\n              @EdConwaySky\n  Six months ago the International Monetary Fund (IMF) warned that the world economy was heading for a serious slowdown, in the face of Donald Trump's tariffs. It slashed its forecasts for economic growth both in the US and predicted that global economic growth would slow to 2.8% this year. Today the Fund has resurfaced with a markedly different message. It upgraded growth in both the US and elsewhere. Global economic growth this year will actually be 3.2%, it added. So, has the Fund conceded victory to Donald Trump? Is it no longer fretting about the economic impact of tariffs? Money latest: Shock over retirement age  Either way, the World Economic Outlook (WEO), the IMF's six-monthly analysis of economic trends, is well worth a look. This document is perhaps the ultimate synthesis of what economists are feeling about the state of the world, so there's plenty of insights in there, both about the US, about far-reaching trends like artificial intelligence, about smaller economies like the UK and plenty else besides. Here, then, are four things you need to know from today's WEO. The tariff impact is much smaller than expected… so far The key bit there is the final two words. The Fund upgraded US and global growth, saying: \"The global economy has shown resilience to the trade policy shocks\", but added: \"The unexpected resilience in activity and muted inflation response reflect - in addition to the fact that the tariff shock has turned out to be smaller than originally announced - a range of factors that provide temporary relief, rather than underlying strength in economic fundamentals.\" In short, the Fund still thinks those things it was worried about six months ago - higher inflation, lower trade flows and weaker income growth - will still kick in. It just now thinks it might take longer than expected. The UK faces the highest inflation in the industrialised world  One of the standard exercises each time one of these reports come out is for the Treasury to pick out a flattering statistic they can then go back home and talk about for the following months. This time around the thing they will most likely focus on is that Britain is forecast to have one of the strongest economic growth rates in the G7 (second only to the US) this year, and the third strongest next year. But there are a couple of less flattering prisms through which one can look at the UK economy. First, if you look not at gross domestic product but (as you really ought to) at GDP per head (which adjusts for the growing population), in fact UK growth next year is poised to be the weakest in the G7 (at just 0.5 per cent). Second, and perhaps more worryingly, UK inflation remains stubbornly high in comparison to most other economies, the highest in the G7 both this year and next. Why is Britain such an outlier? This is a question both Chancellor Rachel Reeves and Bank of England governor Andrew Bailey will have to explain while in Washington this week for the Fund's annual meeting. What happens if the Artificial Intelligence bubble bursts?  Few, even inside the world of AI, doubt that the extraordinary ramp up in tech share prices in recent months has some of the traits of a financial bubble. But what happens if that bubble goes pop? The Fund has the following, somewhat scary, passage: \"Excessively optimistic growth expectations about AI could be revised in light of incoming data from early adopters and could trigger a market correction. Elevated valuations in tech and AI-linked sectors have been fuelled by expectations of transformative productivity gains. If these gains fail to materialize, the resulting earnings disappointment could lead to a reassessment of the sustainability of AI-driven valuations and a drop in tech stock prices, with systemic implications. \"A potential bust of the AI boom could rival the dot-com crash of 2000 in severity, especially considering the dominance of a few tech firms in market indices and involvement of less-regulated private credit loans funding much of the industry's expansion. Such a correction could erode household wealth and dampen consumption.\" Pay attention to what's happening in less developed countries For many years, one of the main focuses at each IMF meeting was about the state of finances in many of the world's poorest nations. Rich countries lined up in Washington with generous policies to provide donations and trim developing world debt. But since the financial crisis, rich world attention has turned inwards - for understandable reasons. One of the upshots of this is that the amount of aid going to poor countries has fallen, year by year. At the same time, the amount these countries are having to pay in their annual debt interest has been creeping up (as have global interest rates). The upshot is something rather disturbing. For the first time in a generation, poor countries' debt interest payments are now higher than their aid receipts. I'm not sure what this spells. But what we do know is that when poor countries in the Middle East and Sub-Saharan Africa face financial problems, they often face instability. And when they face instability, that often has knock on consequences for everyone else. All of which is to say, this is something to watch, with concern. The IMF's report is strictly speaking the starting gun for a week of meetings in Washington. So there'll be more to come in the next few days, as finance ministers from around the world meet to discuss the state of the global economy."
    },
    {
        "title": "Getting a job becomes harder with fewer vacancies - official ONS figures",
        "description": "The jobs market has continued to slow, with 9,000 fewer vacancies in the three months to September, official figures show.",
        "url": "https://news.sky.com/story/getting-a-job-became-harder-with-fewer-vacancies-official-figures-13449823",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-commuters-workers-london_7011109.jpg?20250904141814",
        "type": "Business",
        "Author": "Sarah Taaffe-Maguire",
        "Date Published": "2025-10-14 05:26:00",
        "Headline": "There was an unexpected increase in the unemployment rate, despite a record number of people over 65 being in work.",
        "Content": "\n          Business and economics reporter\n              @taaffems\n The jobs market has continued to slow, with 9,000 fewer vacancies in the three months to September, official figures show. It is the 39th consecutive period where vacancy numbers have dropped. Having fewer job openings can mean it is harder to find work. Money blog: Big retirement age surprise awaits 14% of Britons  There was also a surprise increase in the unemployment rate, up to 4.8% from 4.7% a month earlier, primarily driven by younger people, as a record number of people over 65 are in work, the Office for National Statistics (ONS) said. Economists polled by Reuters anticipated no change in the jobless rate, but instead the figure is now the highest since the three months to May 2021, when the country was in lockdown due to the COVID pandemic. The ONS, however, has advised caution when interpreting changes in the monthly unemployment rate and job vacancy numbers due to concerns over the reliability of the figures. The labour market has struggled in recent months as the cost of employing staff became more expensive due to higher employers' national insurance contributions and an increased minimum wage. Wage rises slowing Further signs of a slowing labour market were seen in the fall of annual private sector wage growth to the lowest rate in nearly four years - 4.4%. Public sector pay growth increased more quickly, at 6%, as some public sector pay rises were awarded earlier than they were last year.  Average weekly earnings rose more than expected by economists at 5% and also more than previously thought after a revision to last month's figures (4.8%). This revision means the state pension is likely to increase by 4.8% in April, higher than first thought. The pension is determined by the triple lock, which means it will rise every year by whichever is highest: inflation in September, average weekly earnings from May to July or 2.5%. Read more:Got AirPods? There's more to them than meets the eyeHomes now need repairs after work done under govt scheme Inflation in September is expected to be 4% by the Bank of England, meaning wage data is set to be the highest figure. Also published by the ONS was data on industrial action, which showed August had the fewest working days lost to strike action in a single month for nearly six years. What does it mean for interest rates? While a tough job market is difficult for people looking for work, the slowing wage rises can mean interest rates are brought down. The rate-setters at the Bank of England had been concerned about the effect higher wages could have on inflation, which it is mandated to bring to 2% though latest figures showed it was at 3.8%. Following today's figures, traders expect a cut in the interest rate to 4.75% in December. No change is anticipated at the next interest rate setter meeting in November."
    },
    {
        "title": "Ocado hires Atos executive to deliver partnerships boost",
        "description": "Ocado Group, the online grocery technology provider, is embarking on a strategic shake-up which includes the appointment of its first chief revenue officer as it tries to revive its flagging stock market valuation.",
        "url": "https://news.sky.com/story/ocado-hires-atos-executive-to-deliver-partnerships-boost-13450067",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-ocado-warehouse_7050883.jpg?20251014141459",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-14 12:59:00",
        "Headline": "The London-listed retail technology group will announce the appointment of Atos executive Nick de la Vega as its first chief revenue officer on Wednesday, Sky News learns.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n Ocado Group, the online grocery technology provider, is embarking on a strategic shake-up which includes the appointment of its first chief revenue officer as it tries to revive its flagging stock market valuation. Sky News has learnt that the London-listed operator of automated retail goods warehouses will announce on Wednesday that it has recruited Nick de la Vega to the new post, with a brief to drive global sales across food and non-grocery retailers. Mr de la Vega will join Ocado Group from Atos, the specialist in digital transformation, where he was global head of sales. Money latest: Shock over retirement age He will report to Tim Steiner, the Ocado co-founder and chief executive. Ocado Group employees were notified about his appointment on Tuesday afternoon. His mandate will be to build new partnerships and maintain existing ones, as well as leading Ocado's global technology sales efforts in new areas such as pharmaceuticals and apparel, into which it has expanded in recent years. The company said in July that its exclusivity arrangements with a number of customers would \"roll off in the majority of markets where Ocado's technology is already live\", although it does not specify which partners it was referring to. In the UK, it serves multiple customers, including Marks & Spencer - through Ocado Retail - and Morrisons. Ocado's grocery partners include Aeon in Japan, Alcampo in Spain, the Australian chain Coles, and Lotte in South Korea Its non-grocery partners include McKesson in Canada. Shares in Ocado Group slumped last month when Kroger, its key US-based retail partner, said it would take a \"hard look\" at future automated warehouse investments. The statement wiped roughly £500m off Ocado's value in a single day. Shares in Ocado Group closed on Tuesday at 234.4p, giving the company a market capitalisation of just under £2bn. The stock has fallen by nearly 40% in the last year. Ocado Group declined to comment."
    },
    {
        "title": "Banks step up lobbying over threat of Reeves tax hikes",
        "description": "The total tax rate levied on British banks has risen again this year, according to a report by an industry trade body that will underpin warnings about threats to the City's international competitiveness ahead of next month's budget.",
        "url": "https://news.sky.com/story/banks-step-up-lobbying-over-threat-of-reeves-tax-hikes-13450068",
        "image_url": "https://e3.365dm.com/25/08/1920x1080/skynews-hsbc-app-banks_7002554.jpg?20250827115937",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-10-14 12:44:00",
        "Headline": "The gap between the tax burden on British banks and their international rivals is widening, even before the imposition of any further levies in next month's budget, according to a report seen by Sky News.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The total tax rate levied on British banks has risen again this year, according to a report by an industry trade body that will underpin warnings about threats to the City's international competitiveness ahead of next month's budget. Sky News has learnt that a study by UK Finance will show that the disparity between the tax rate paid by London-based banks - with a total tax rate of 46.4% - and those in rival financial centres such as Amsterdam, Frankfurt and New York has also widened this year. UK Finance's report will be made public on Wednesday, weeks before Rachel Reeves, the chancellor, delivers a budget which speculation suggests will include additional bank-specific taxes as she seeks to plug a fiscal gap estimated at up to £30bn. According to the trade association's document, the total tax rate applied to London-based banks this year is almost precisely two-thirds higher than that applied to their New York-based peers, whose equivalent figure was 27.9%. Money latest: Shock over retirement age The UK figure of 46.4% was 0.6 percentage points higher than in 2024, largely because of the increase in employers' national insurance contributions, which came into effect in April, the report will say. It projects a further increase in the UK figure in 2026 to 46.6% - with the trend likely to exacerbate concerns that London is losing ground to its major international competitors. \n                  Deadline day for firm linked to Tory peer to pay back millions over COVID contract scandal\n                 \n                  UK to have highest inflation in G7, IMF says\n                 \n                  Four big themes as IMF takes aim at UK growth and inflation\n                 In total, the UK banking industry paid £43.3bn in tax to the exchequer in the year to the end of March 2025, according to an estimate in the report. That figure is nearly one-third higher than the contribution of £33.4bn in 2014, the first year for which comparable figures were compiled.  Produced in conjunction with PwC, the professional services firm, the report will also conclude that the removal of bank-specific taxes in the UK - which exist in the form of the Bank Levy and a 3% corporation tax surcharge - would reduce the total tax take rate for next year to 40%. That would still be higher than in Dublin, Frankfurt, and New York, although it would be lower than Amsterdam's 42.2% rate calculated in the report. The Bank Levy was introduced in the aftermath of the 2008 financial crisis by George Osborne, the chancellor during the 2010-2015 coalition government. Industry executives have been calling for its removal, but accept that Britain's fiscal position means that a reduction in banks' tax liabilities is unlikely to materialise for years. In an accompanying letter to Ms Reeves seen by Sky News, David Postings, UK Finance's chief executive, reiterated a warning about the competitiveness of Britain's banking sector. \"Uncertainty and speculation regarding potential tax increases have already caused negative market reaction, which is harmful to the UK's ability to attract international investment,\" he wrote. \"There also appears to be a view in some quarters that the industry is sanguine about a rise in taxation. \"I should like to put on record that this is not the case. \"The industry understands the fiscal issues the government has to deal with, however, as the report shows, it already shoulders a significant burden that renders the UK much less competitive when it comes to attracting capital.\" Earlier this week, Sky News revealed that David Solomon, the Goldman Sachs chief executive, had urged the chancellor not to increase bank taxes in the budget during a private meeting last week. Mr Postings added in his letter to the chancellor that the banking industry \"agree[s] with you that the best way to strengthen the public finances is by growing the economy, and a strong financial services centre is a critical component\". \"Our sector underpins investment, business growth and homeownership across the country and is crucial to help achieve positive outcomes for pensioners and savers.\" UK Finance declined to comment on the contents of its report or the letter to Ms Reeves."
    },
    {
        "title": "Vodafone reveals cause of massive internet blackout amid calls for compensation",
        "description": "Vodafone has said a massive blackout in its internet coverage yesterday was not caused by a cyber attack.",
        "url": "https://news.sky.com/story/vodafone-reveals-cause-of-massive-internet-blackout-amid-calls-for-compensation-13449877",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vodafone-internet_7050532.jpg?20251014092305",
        "type": "Business",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-14 08:04:00",
        "Headline": "Customers contacted Sky News and posted on social media to find out if payment would be given to those affected.",
        "Content": "\n          Science and technology reporter\n       Vodafone has said a massive blackout in its internet coverage yesterday was not caused by a cyber attack. The issues have now been fully resolved, according to the company, after hundreds of thousands of people reported their wifi, 4G and 5G connections dropping out. \"On Monday afternoon, for a short time, the Vodafone network had an issue affecting broadband, 4G and 5G services,\" said a Vodafone spokesperson. \"This was triggered by a non-malicious software issue with one of our vendor partners which has now been resolved, and the network has fully recovered. \"We apologise for any inconvenience this caused our customers.\" As well as internet connections, Vodafone's app, website and customer services were also down. At its peak, more than 130,000 people reported problems to the internet status checker Downdetector. \n                  Vodafone internet services down for thousands of users\n                 \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Vodafone and Three merger could get green light, says UK's competition watchdog\n                 Vodafone users contacted Sky News and posted on social media to find out if compensation would be given to affected customers. \"We all better get some compensation or I'll be cancelling my contract,\" said one X user. \"Are they paying any compensation to those affected?\" asked a Sky News reader. \"This outage must have had major effects on ordinary people/business.\" Read more technology news:Warning China poses 'highly sophisticated' cyber threat to UKGot a pair of AirPods? There's more to them than meets the eyeSpaceX enjoys successful Starship rocket launch test According to Sabrina Hoque, a telecoms expert at Uswitch, customers could be entitled to compensation of £9.76 for each calendar day their broadband doesn't work - but only if it is down for more than two days. \"Ofcom advises that compensation for mobile signal outages is 'dependent on the circumstances',\" she said, \"but in extreme cases, where repairs take much longer, you may be entitled to an additional refund or account credit.\" Considering the outage only lasted a few hours for most people, they may not be entitled to claim. However, Melanie Pizzey, chief executive of the Global Payroll Alliance, said the company could now face \"a wave of compensation claims ... particularly if financial losses or missed deadlines can be directly linked to the downtime.\" One X user warned that last night, scammers pretending to be from Vodafone had called and directed him to download an app in order to receive compensation. \"Who knows how many people they [are] scamming as we speak?\" he said."
    },
    {
        "title": "'Make or break': Chancellor warned businesses can't take more tax hikes in budget",
        "description": "Rachel Reeves has been warned that firms face a \"make-or-break moment\" at next month's budget.",
        "url": "https://news.sky.com/story/make-or-break-chancellor-warned-businesses-cant-take-more-tax-hikes-in-budget-13449801",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-conference-rachel-reeves_7035694.jpg?20250929073647",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-10-14 02:49:00",
        "Headline": "Rachel Reeves will deliver her second budget on 26 November. She has vowed not to raise taxes on \"working people\", but some increases are expected as she faces a multibillion-pound black hole in the public finances.",
        "Content": "Rachel Reeves has been warned that firms face a \"make-or-break moment\" at next month's budget. The British Chamber of Commerce (BCC) urged the chancellor, who is widely expected to announce tax hikes in November's budget to fill a gap in the public finances, to steer clear of increasing levies on businesses. Ms Reeves raised taxes by £40bn last year and the BCC said business confidence had not recovered since. \"Last year's budget took the wind from their sails, and they have been struggling to find momentum ever since,\" BCC director-general Shevaun Haviland said. She said firms felt \"drained\" and could not plan ahead as they expected \"further tax demands to be laid at their feet\" when the budget is delivered on 26 November. \"The chancellor must seize this moment and use her budget to deliver a pro-growth agenda that can restore optimism and belief amongst business leaders,\" Ms Haviland added. \"This year's budget will be a make-or-break moment for many firms.\"  The BCC also called for a reform of business rates and the removal of the windfall tax on gas and oil introduced by the last government. In its submission, the industry body outlined more than 60 recommendations, including the proposal of further infrastructure investment, cuts to customs barriers and action on skill shortages. Earlier this year, Prime Minister Sir Keir Starmer announced Labour would aim to approve 150 major infrastructure projects by the next election, with Labour already pledging to support expansions of both Heathrow and Gatwick airports - another of the BCC's requests. While the Treasury would not comment on budget speculation, a spokesperson insisted Ms Reeves would \"strike the right balance\" between ensuring funding for public services and securing economic growth. She has vowed to stick to Labour's manifesto pledges not to raise taxes on \"working people\".  Household spending on the wane The BCC's plea to halt further tax rises on businesses comes as retail sales growth slowed in September. \"With the budget looming large, and households facing higher bills, retail spending rose more slowly than in recent months,\" Helen Dickinson, chief executive of the British Retail Consortium (BRC), said. \"Rising inflation and a potentially taxing budget is weighing on the minds of many households planning their Christmas spending.\" Total retail sales in the UK increased by 2.3% year-on-year in September, against growth of 2% in September 2024 and above the 12-month average growth of 2.1%, according to BRC and KPMG data. While food sales were up by 4.3% year-on-year, this was largely driven by inflation rather than volume growth. Non-food sales growth slowed to 0.7% against the growth of 1.7% last September, making it below the 12-month average growth of 0.9%. Read more:Goldman chief delivers warning to Reeves over tax hikesReeves urged to break election pledge and raise major tax Online non-food sales only increased by 1% against last September's growth of 3.4%, which was below the 12-month average growth of 1.8%. \"The future of many large anchor stores and thousands of jobs remains in jeopardy while the Treasury keeps the risk of a new business rates surtax on the table,\" Ms Dickinson said. \"By exempting these shops when the budget announcements are made, the chancellor can reduce the inflationary pressures hammering businesses and households alike.\""
    },
    {
        "title": "'Make or break': Chancellor warned businesses can't take more tax hikes in budget",
        "description": "Rachel Reeves has been warned that firms face a \"make-or-break moment\" at next month's budget.",
        "url": "https://news.sky.com/story/make-or-break-chancellor-warned-businesses-cant-take-more-tax-hikes-in-budget-13449801",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-conference-rachel-reeves_7035694.jpg?20250929073647",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-14 02:49:00",
        "Headline": "Rachel Reeves will deliver her second budget on 26 November. She has vowed not to raise taxes on \"working people\", but some increases are expected as she faces a multibillion-pound black hole in the public finances.",
        "Content": "Rachel Reeves has been warned that firms face a \"make-or-break moment\" at next month's budget. The British Chamber of Commerce (BCC) urged the chancellor, who is widely expected to announce tax hikes in November's budget to fill a gap in the public finances, to steer clear of increasing levies on businesses. Ms Reeves raised taxes by £40bn last year and the BCC said business confidence had not recovered since. \"Last year's budget took the wind from their sails, and they have been struggling to find momentum ever since,\" BCC director-general Shevaun Haviland said. She said firms felt \"drained\" and could not plan ahead as they expected \"further tax demands to be laid at their feet\" when the budget is delivered on 26 November. \"The chancellor must seize this moment and use her budget to deliver a pro-growth agenda that can restore optimism and belief amongst business leaders,\" Ms Haviland added. \"This year's budget will be a make-or-break moment for many firms.\"  The BCC also called for a reform of business rates and the removal of the windfall tax on gas and oil introduced by the last government. In its submission, the industry body outlined more than 60 recommendations, including the proposal of further infrastructure investment, cuts to customs barriers and action on skill shortages. Earlier this year, Prime Minister Sir Keir Starmer announced Labour would aim to approve 150 major infrastructure projects by the next election, with Labour already pledging to support expansions of both Heathrow and Gatwick airports - another of the BCC's requests. While the Treasury would not comment on budget speculation, a spokesperson insisted Ms Reeves would \"strike the right balance\" between ensuring funding for public services and securing economic growth. She has vowed to stick to Labour's manifesto pledges not to raise taxes on \"working people\".  Household spending on the wane The BCC's plea to halt further tax rises on businesses comes as retail sales growth slowed in September. \"With the budget looming large, and households facing higher bills, retail spending rose more slowly than in recent months,\" Helen Dickinson, chief executive of the British Retail Consortium (BRC), said. \"Rising inflation and a potentially taxing budget is weighing on the minds of many households planning their Christmas spending.\" Total retail sales in the UK increased by 2.3% year-on-year in September, against growth of 2% in September 2024 and above the 12-month average growth of 2.1%, according to BRC and KPMG data. While food sales were up by 4.3% year-on-year, this was largely driven by inflation rather than volume growth. Non-food sales growth slowed to 0.7% against the growth of 1.7% last September, making it below the 12-month average growth of 0.9%. Read more:Goldman chief delivers warning to Reeves over tax hikesReeves urged to break election pledge and raise major tax Online non-food sales only increased by 1% against last September's growth of 3.4%, which was below the 12-month average growth of 1.8%. \"The future of many large anchor stores and thousands of jobs remains in jeopardy while the Treasury keeps the risk of a new business rates surtax on the table,\" Ms Dickinson said. \"By exempting these shops when the budget announcements are made, the chancellor can reduce the inflationary pressures hammering businesses and households alike.\""
    },
    {
        "title": "Gaza peace deal not possible without Trump, says Starmer",
        "description": "The Gaza peace deal would not have been possible without US President Donald Trump, Sir Keir Starmer has said.",
        "url": "https://news.sky.com/story/gaza-peace-deal-not-possible-without-trump-says-starmer-13450091",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-donald-trump-keir-starmer_7050085.jpg?20251013165802",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-14 13:33:00",
        "Headline": "The prime minister said the UK's recognition of Palestine helped get the Arab nations around the table.",
        "Content": "The Gaza peace deal would not have been possible without US President Donald Trump, Sir Keir Starmer has said. Speaking in the House of Commons the day after the peace deal was signed, the prime minister said: \"Let no one be in any doubt that none of this would have been possible without President Trump. \"This is his peace deal, delivered, of course, with President Sisi of Egypt, the Emir of Qatar and President Erdogan.\" Sir Keir added: \"I've had the opportunity to say that to him [President Trump] publicly and also privately, because, as you know, we get along, and that is good for our relationship with the US.\" Politics latest: Starmer defends UK's role in peace deal Following claims the UK had nothing to do with the peace deal, Sir Keir added that his government \"offered the UK's full support\" to getting the peace deal over the line. \"We've worked behind the scenes for months with the US, Arab and European nations to help deliver a ceasefire, get the hostages out, get aid in and secure a better future for Israel, Gaza and the West Bank,\" he said. \n                  Hamas releases more bodies of hostages - as Trump threatens 'violent' disarmament\n                 \n                  Is Hamas ready to give up Gaza?\n                 \n                  An extraordinary day in the drive for lasting peace in the Middle East\n                 \"I'm proud of our contribution.\" Read more: Trump heckled in Israeli parliament over peace dealWhat does Trump's Gaza peace plan look like? Hours before the deal was signed, US special envoy Steve Witkoff said the UK played a \"vital role\" after a tit-for-tat when the US ambassador for Israel accused cabinet minister Bridget Phillipson of being \"delusional\" for saying the UK played a \"key role\". He reiterated secretary of state Marco Rubio's earlier claim that the UK and others recognising Palestine delayed the peace deal by two months. UK ready to help peace plan Sir Keir said the UK is \"in a position to play this role precisely because of the approach this government takes\". He said that includes the UK's recognition of a Palestinian state last month, which he said got Arab nations to condemn the 7 October attacks. Sir Keir said the UK stands ready \"to deploy our diplomacy and expertise in three areas\" to ensure peace lasts. Those areas are: • Support the reconstruction of Gaza • Support transitional governance arrangements in Gaza • Draw on the UK's experience in Northern Ireland to decommission Hamas weapons and capability. The PM said the UK will help to deliver the 20-point peace plan \"in full\".  Badenoch: UK was not at heart of efforts Conservative leader Kemi Badenoch said Monday was \"truly momentous\" and thanked the US administration. However, she said: \"It saddens me that the prime minister's statement does not appear to show that the UK was at the heart of any of these efforts specifically. \"It is quite clear that UK relations with Israel have been strained by the actions of this government.\" She said relations with Israel \"have been so damaged\" that when Israel launched strikes against Iran \"the UK was out of the loop\". And she accused the government of a \"moral failure\", quoting former British-Israeli hostage Emily Damari. \"I'm surprised to hear the prime minister say in his statement that it was a contribution to this peace deal,\" she added. \"We all know that the US Secretary of State, Marco Rubio, condemned this recognition, saying it had made ceasefire negotiations harder.\""
    },
    {
        "title": "Migrant with AK-47 face tattoo who threatened to kill Nigel Farage shouts from dock as he's jailed",
        "description": "An Afghan migrant who came to the UK on a small boat has been jailed for five years after posting a TikTok video in which he threatened to kill Reform UK leader Nigel Farage.",
        "url": "https://news.sky.com/story/migrant-with-ak-47-face-tattoo-jailed-for-threatening-to-kill-nigel-farage-13449841",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-fayaz-khan-nigel-farage_7047444.jpg?20251010080813",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-14 11:00:00",
        "Headline": "In the \"chilling\" video, Fayaz Khan said he was coming to England to \"pop, pop, pop\" Nigel Farage after the Reform UK leader posted a video of the Afghan national coming to the UK in a small boat.",
        "Content": " An Afghan migrant who came to the UK on a small boat has been jailed for five years after posting a TikTok video in which he threatened to kill Reform UK leader Nigel Farage. Hundreds of thousands of viewers saw the \"chilling\" video Fayaz Khan, 26, posted last October, in which Southwark Crown Court heard he threatened to \"pop pop pop\" Mr Farage. As he was sentenced, Khan yelled to the court that Mr Farage had initiated proceedings to \"use me because you want to be prime minister\".   As he was taken down to the cells, he again shouted: \"You want to be prime minister, I am not here because I want to kill you. \"I want to go back to Afghanistan, send me back to Afghanistan, my family is in Afghanistan. \n                  Migrant with AK-47 face tattoo found guilty of threatening to kill Nigel Farage\n                 \n                  'The time is now to stop Reform' - Plaid Cymru calls on Labour voters to unite behind Welsh nationalists \n                 \n                  Lord Heseltine attacks Badenoch's new policies - and calls Farage a 'phoney'\n                 \"You want to use me because you want to be prime minister. \"Just because you want to do that you want to f*** my life, you want to put me in prison.\"  Outside the court, Mr Farage welcomed the sentence but said he was \"deeply deeply concerned\" Khan would be \"out in 18 months\". He added: \"This violent criminal... will be in this country, living in a house of multiple occupancy or a hotel, free to walk the streets whilst his asylum claim is judged.\" 'Don't talk s***' Jurors had been told the TikTok content was posted in response to a video Mr Farage had uploaded to YouTube titled \"the journey of an illegal migrant\", which highlighted Khan and referenced \"young males of fighting age coming into our country about whom we know very little\". Khan's post appeared to say: \"Englishman Nigel, don't talk s*** about me. \"You not know me. I come to England because I want to marry with your sister. You not know me. \"Don't talk about me more. Delete the video. \"I'm coming to England. I'm going to pop, pop, pop.\" While Khan said \"pop, pop, pop\" he made \"gun gestures with his hand\". He also headbutted the camera during the video and pointed to an AK-47 tattoo on his face to \"emphasise he wasn't joking\", jurors were told. Khan had \"live-streamed\" his journey across the English Channel from France and was arrested on 31 October last year after arriving in the UK on a small boat, Detective Constable Liam Taylor told the court. Mr Farage told the trial last week he found Khan's video \"pretty chilling\", adding: \"Given his proximity to guns and love of guns, I was genuinely worried.\" 'Sorry' Jurors deliberated for 11 hours and 55 minutes before finding him guilty. During the sentencing hearing on Tuesday, Khan asked his lawyer Charles Royle to apologise to Mr Farage and the politician's sister \"for any offence and upset caused\". Mr Farage, who arrived at court with security guards, was sitting just metres away from the defendant in the courtroom. Known in Britain as Khan and 26 years old, prosecutor Peter Ratliff said that in Sweden - where Khan had lived previously - authorities believe he is called Fayaz Husseini and is 31. The court heard it was thought he had given a false name in the UK to hide his Swedish criminal history, which included convictions for carrying a knife in a public place and threatening behaviour. Mr Ratliff said records suggest Khan had been convicted of 17 offences on 12 separate occasions there. Addressing the video from Mr Farage, sentencing judge Mrs Justice Steyn told Khan: \"You saw the widespread dissemination of Mr Farage's video as a hindrance to your attempts to come to the UK.\" Khan was also sentenced for entering the UK illegally having previously pleaded guilty to the offence."
    },
    {
        "title": "UK to have highest inflation in G7, IMF says",
        "description": "Price rises in the UK are to be the highest among the G7 club of industrialised nations, according to the International Monetary Fund (IMF). ",
        "url": "https://news.sky.com/story/uk-to-have-highest-inflation-in-g7-imf-says-13449998",
        "image_url": "https://e3.365dm.com/23/04/1920x1080/skynews-imf-economy_6117647.jpg?20230411065631",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-10-14 13:00:00",
        "Headline": "Economic performance has been upgraded this year, but downgraded for next.",
        "Content": "Price rises in the UK are to be the highest among the G7 club of industrialised nations, according to the International Monetary Fund (IMF).  Inflation will be the highest among the club both this year and next, the world's lender of last resort said in its World Economic Outlook. As a result, the body's chief economist Pierre-Olivier Gourinchas said the Bank of England should be \"very cautious\" on making future interest rate cuts. Money blog: State pension to rise more than expected There was mixed news elsewhere in the outlook, as the UK's economic growth forecast, as measured by GDP, was revised up for this year but revised down for next. Latest data showed inflation stood at 3.8% and is forecast by the Bank to peak at 4% shortly. The IMF, however, said it expected inflation to average at 3.4% in 2025, up from its previously predicted 3.2%. That is forecast to slow to 2.5% this year, higher than the 2.3% anticipated just three months ago. Food and services inflation had been particularly high in recent months due to rising wage bills and poor harvests. Read more:Got AirPods? There's more to them than meets the eyeHomes now need repairs after work done under govt scheme Economic growth will be a higher 1.3% this year, up from the 1.2% forecast in July, thanks to a strong first few months of the year. Next year, however, GDP will be 1.4% rather than 1.3% as economies across the world feel trade pressures. Political reaction  Chancellor Rachel Reeves said: \"This is the second consecutive upgrade to this year's growth forecast from the IMF. \"But know this is just the start. For too many people, our economy feels stuck. Working people feel it every day, experts talk about it, and I am going to deal with it.\" Shadow chancellor Sir Mel Stride said the IMF assessment made for \"grim reading\". \"Since taking office, Labour have allowed the cost of living to rise, debt to balloon, and business confidence to collapse to record lows,\" he said. \"Working people are feeling the impact every time they shop, fill up the car, or pay their mortgage.\""
    },
    {
        "title": "UK must prepare for 2C of warming by 2050, government told for first time",
        "description": "Britain must prepare for at least 2C of warming within just 25 years, the government has been advised by its top climate advisers.",
        "url": "https://news.sky.com/story/uk-must-prepare-for-2c-of-warming-by-2050-government-told-for-first-time-13450092",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-climate-rain-northern-ireland_6860427.jpg?20250318123411",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-10-14 13:39:00",
        "Headline": "The goal is hotter and sooner than most official previous advice, and is a nod to the high chance of breaching the ambitious Paris Agreement limit. National advisers on the Climate Change Committee hope a target would kickstart efforts to make hospitals, homes, and schools more resilient.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  Britain must prepare for at least 2C of warming within just 25 years, the government has been advised by its top climate advisers. That limit is hotter and sooner than most of the previous official advice, and is worse than the 1.5C level most of the world has been trying to stick to. What is the 1.5C temperature threshold? Under the 2015 Paris Agreement, countries agreed to try to limit warming to \"well below\" 2C - and ideally 1.5C. But with global average temperatures already nearing 1.4C, warnings that we may have blown our chances of staying at 1.5C have been growing. This new warning from the government's top advisers, the independent Climate Change Committee (CCC), spells out the risk to the UK in the starkest terms yet. In a letter today, the CCC said ministers should \"at a minimum, prepare the country for the weather extremes that will be experienced if global warming levels reach 2C above pre-industrial levels by 2050\". It is the first time the committee has recommended such a target, in the hopes of kickstarting efforts to make everything from flooded train tracks to sweltering classrooms more resilient in a hotter world - after years of warnings the country is woefully unprepared. How climate change affects the UK The UK is already struggling to cope with the drought, flooding, and heat brought by the current 1.4C - \"let alone\" what is to come, the advisers said. Just this year, the country battled the second-worst harvest on record and hottest summer ever, which saw an extra 300 Londoners die. \"Though the change from 1.5C and 2C may sound small, the difference in impacts would be substantial,\" CCC adviser Professor Richard Betts told Sky News. It would mean twice as many people at risk of flooding in some areas, and in southern England, 10 times as many days with a very high risk of wildfires - an emerging risk for Britain. The experts said the mass building the government is currently pushing, including new nuclear power stations and homes, should even be adaptable for 4C of warming in the future - a level unlikely, but which cannot be ruled out. Is it too late to stop climate change or limit to 1.5C? The CCC's Baroness Brown said in a briefing: \"We continue to believe 1.5C is achievable as a long-term goal. \"But clearly the risk it will not be achieved is getting higher, and for risk management we do believe we have to plan for 2C.\" World leaders will discuss their plans to adapt to hotter temperatures at the COP30 climate summit in Brazil in November. Professor Eric Wolff, who advises the Royal Society, said leaders needed to wake up. \"It is now very challenging even to stay below two degrees,\" he told Sky News. \"This is a wake-up call both to continue reducing emissions, but at the same time to prepare our infrastructure and economy for the inevitable climate changes that we are already committed to.\""
    },
    {
        "title": "Vodafone reveals cause of massive internet blackout amid calls for compensation",
        "description": "Vodafone has said a massive blackout in its internet coverage yesterday was not caused by a cyber attack.",
        "url": "https://news.sky.com/story/vodafone-reveals-cause-of-massive-internet-blackout-amid-calls-for-compensation-13449877",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-vodafone-internet_7050532.jpg?20251014092305",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-14 08:04:00",
        "Headline": "Customers contacted Sky News and posted on social media to find out if payment would be given to those affected.",
        "Content": "\n          Science and technology reporter\n       Vodafone has said a massive blackout in its internet coverage yesterday was not caused by a cyber attack. The issues have now been fully resolved, according to the company, after hundreds of thousands of people reported their wifi, 4G and 5G connections dropping out. \"On Monday afternoon, for a short time, the Vodafone network had an issue affecting broadband, 4G and 5G services,\" said a Vodafone spokesperson. \"This was triggered by a non-malicious software issue with one of our vendor partners which has now been resolved, and the network has fully recovered. \"We apologise for any inconvenience this caused our customers.\" As well as internet connections, Vodafone's app, website and customer services were also down. At its peak, more than 130,000 people reported problems to the internet status checker Downdetector. \n                  Vodafone internet services down for thousands of users\n                 \n                  UK biggest phone network created as Three-Vodafone merger gets conditional approval\n                 \n                  Vodafone and Three merger could get green light, says UK's competition watchdog\n                 Vodafone users contacted Sky News and posted on social media to find out if compensation would be given to affected customers. \"We all better get some compensation or I'll be cancelling my contract,\" said one X user. \"Are they paying any compensation to those affected?\" asked a Sky News reader. \"This outage must have had major effects on ordinary people/business.\" Read more technology news:Warning China poses 'highly sophisticated' cyber threat to UKGot a pair of AirPods? There's more to them than meets the eyeSpaceX enjoys successful Starship rocket launch test According to Sabrina Hoque, a telecoms expert at Uswitch, customers could be entitled to compensation of £9.76 for each calendar day their broadband doesn't work - but only if it is down for more than two days. \"Ofcom advises that compensation for mobile signal outages is 'dependent on the circumstances',\" she said, \"but in extreme cases, where repairs take much longer, you may be entitled to an additional refund or account credit.\" Considering the outage only lasted a few hours for most people, they may not be entitled to claim. However, Melanie Pizzey, chief executive of the Global Payroll Alliance, said the company could now face \"a wave of compensation claims ... particularly if financial losses or missed deadlines can be directly linked to the downtime.\" One X user warned that last night, scammers pretending to be from Vodafone had called and directed him to download an app in order to receive compensation. \"Who knows how many people they [are] scamming as we speak?\" he said."
    },
    {
        "title": "Meta rolls out PG-13 restrictions on Instagram teen accounts",
        "description": "Teenagers using Instagram will now only see content that abides by a PG-13 cinema rating, according to Meta.",
        "url": "https://news.sky.com/story/meta-rolls-out-pg-13-restrictions-on-instagram-teen-accounts-13450069",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-instagram-restrictions_7050879.png?20251014141152",
        "type": "Technology",
        "Author": "Mickey Carroll",
        "Date Published": "2025-10-14 13:02:00",
        "Headline": "Chats between teenagers and Meta AI will also be restricted to a PG-13 rating.",
        "Content": "\n          Science and technology reporter\n       Teenagers using Instagram will now only see content that abides by a PG-13 cinema rating, according to Meta. PG-13 films, similar to the UK's 12A, are generally allowed to have some swear words, mild violence and partial nudity - although Meta said it would attempt to hide suggestive content and strong language \"as much as possible\". Earlier this year, new UK online safety rules were introduced that make it a legal requirement to age-restrict adult content online, but Meta says these age ratings go further. \"In addition to our longstanding policies - which already hide or prohibit the recommendation of sexually suggestive content, graphic or disturbing images, and adult content like tobacco or alcohol sales from teens, our updated policies will now go even further,\" said the company in its announcement. \"This includes hiding or not recommending posts with strong language, certain risky stunts, and additional content that could encourage potentially harmful behaviors, such as posts showing marijuana paraphernalia.\"  Chats between teenagers and Meta AI will also be restricted to a PG-13 rating. In August, Reuters reported that an internal Meta document permitted children to engage in \"romantic or sensual\" AI chats, including on an Instagram chatbot. \n                  TikTok and Instagram accused of targeting teens with suicide and self-harm content\n                 \n                  'Tradwife', 'delulu' and 'skibidi' among new words added to Cambridge Dictionary\n                 \n                  Could Meta be forced to sell Instagram and WhatsApp - and would it matter?\n                 Meta spokesman Andy Stone said the company was in the process of revising the document and that such conversations with children never should have been allowed. Although teen accounts require a user to be honest about their date of birth, Meta says it uses \"age-prediction\" technology to spot when a user is lying about their age and restrict their content appropriately.  Last year, research by Ofcom showed that 22% of 17-year-olds said they lied on social media about being 18 or older. From next year, parents will also be given the option to restrict their teenager's account even further, with a \"limited content\" setting. That will filter even more content and remove the teenager's ability to see, leave or receive comments under posts, as well as restrict the conversations teenagers can have with Meta's AI. Read more technology news:Denmark proposes social media ban for under-15sImpact of new online safety rules revealed The changes will start rolling out to Teen Accounts in the US, UK, Australia, and Canada today and will be fully rolled out by the end of the year, according to Meta, after which they'll be rolled out globally. The updated content restrictions for young Instagram users come after calls from parents who want to better understand what their kids are seeing online. Some 90% of parents of teens in the US said the PG-13 rating will make it easier to understand the kind of content their teen is likely to see on Instagram, according to research commissioned by Meta. The company said it will run regular Instagram surveys, inviting parents to review content and see if they think it is appropriate for teenagers. \"These surveys will help us understand if parents still agree with where we've drawn the line, and if we need to further adjust our guidelines,\" said Meta."
    },
    {
        "title": "Got a cold? Try sucking on a peppermint, say scientists",
        "description": "There seem to be plenty of colds going around at the moment - so here's a possible aid you might not have considered: peppermints.",
        "url": "https://news.sky.com/story/got-a-cold-try-sucking-on-a-peppermint-say-scientists-13449810",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-peppermint-istock_7050436.jpg?20251014051006",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-10-14 04:03:00",
        "Headline": "Scientists have found sucking a peppermint increases someone's alertness, as the sweets soothe the signals between body and brain.",
        "Content": "There seem to be plenty of colds going around at the moment - so here's a possible aid you might not have considered: peppermints. Newly published research from scientists at Cardiff University says sucking on them can increase alertness in people who are ill with the common cold. They monitored 81 students over 10 weeks, during which time 17 developed a mild illness. Six of them were given peppermints, six were given butterscotch, and five were not given any sweets at all. Of the 64 who remained healthy, 21 sucked peppermint, 22 were given placebo sweets, and 21 did not eat any. All participants were then tested for their mood, performance, and reaction times - with those who had a cold being slower and suffering reduced alertness. But they found sucking a peppermint increased alertness in both those with colds and those who were healthy. Why? Because the sweets soothed the signals between body and brain. Read more from Sky News:SpaceX test launches Starship rocketShearer and Caine join smacking campaign Dr Andy Smith, who led the research, explained: \"When people are sick with a mild upper respiratory tract illness, they will likely experience malaise - a general discomfort and a lack of wellbeing. \"This can impact performance and reduce our alertness. \"Vapours are known to have therapeutic benefits - and aromatics, such as mint, have been shown in previous research to have an impact on our wellbeing when ill and in perfect health. \"We thought it was plausible that peppermints might help reduce the malaise associated with the common cold and its symptoms.\" And so they did. Dr Smith said the results showed that \"with the right understanding, simple things can be done to improve our wellbeing when unwell - and that includes eating a peppermint to help with a cold\". The study was published in the World Journal Of Pharmacy And Pharmaceutical Sciences."
    },
    {
        "title": "Grammy-winning R&B and soul star D'Angelo dies after 'prolonged battle with cancer'",
        "description": "Grammy-award winning R&B and soul singer D'Angelo has died following a battle with pancreatic cancer, his family has said.",
        "url": "https://news.sky.com/story/grammy-winning-singer-dangelo-dies-after-prolonged-battle-with-cancer-13450168",
        "image_url": "https://e3.365dm.com/25/10/1920x1080/skynews-dangelo-rb-dangelo_7051076.jpg?20251014181029",
        "type": "Entertainment",
        "Author": "Unknown",
        "Date Published": "2025-10-14 16:50:00",
        "Headline": "The 51-year-old died on Tuesday following a \"prolonged and courageous battle with cancer,\" his family said.",
        "Content": "Grammy-award winning R&B and soul singer D'Angelo has died following a battle with pancreatic cancer, his family has said. He died on Tuesday, leaving behind a \"legacy of extraordinarily moving music\" following a \"prolonged and courageous battle with cancer,\" his family said in a statement. The prominent musician, born Michael D'Angelo Archer, was 51 years old. A family statement said: \"We are saddened that he can only leave dear memories with his family, but we are eternally grateful for the legacy of extraordinarily moving music he leaves behind. \"We ask that you respect our privacy during this difficult time, but invite you all join us in mourning his passing while also celebrating the gift of song that he has left for the world.\" The singer rose to prominence in the 1990s with his first album, Brown Sugar. The track \"Lady\" from that album reached No. 10 in March 1996 and remained on Billboard's Hot 100 chart for 20 weeks."
    },
    {
        "title": "Eurovision emergency vote on Israel's inclusion is called off",
        "description": "An emergency vote on Israel's participation in the Eurovision Song Contest has been called off following developments in the Middle East, the European Broadcasting Union (EBU) has said.",
        "url": "https://news.sky.com/story/eurovision-emergency-vote-on-israels-inclusion-is-called-off-13449921",
        "image_url": "https://e3.365dm.com/25/09/1920x1080/skynews-eden-golan-israel_7017103.jpg?20250911135805",
        "type": "Entertainment",
        "Author": "Bethany Minelle",
        "Date Published": "2025-10-14 09:34:00",
        "Headline": "Organisers had scheduled a vote on whether Israel should or shouldn't take part in the Eurovision Song Contest, but following the Gaza ceasefire deal, plans have changed.",
        "Content": "\n          Arts and entertainment reporter\n              @BethanyMinelle\n An emergency vote on Israel's participation in the Eurovision Song Contest has been called off following developments in the Middle East, the European Broadcasting Union (EBU) has said. Contest organisers had scheduled \"an extraordinary meeting of [its] general assembly to be held online\" in early November after several countries said they would no longer take part in Eurovision if Israel participated. The EBU said in a statement that following \"recent developments in the Middle East\" the executive board had agreed on Monday that there should be an in-person discussion among members \"on the issue of participation in the Eurovision Song Contest 2026\". It said the matter had now been added to the agenda of its winter general assembly, which will take place in December. Further details about the session would be shared with EBU members in the coming weeks, it added. It is not clear if a vote will still take place at a later date. Austria is hosting next year's show in Vienna. The country's national broadcaster, ORF, told Reuters news agency it welcomed the EBU's decision. Sky News has contacted Israeli broadcaster KAN for comment.   Faced with controversy over the conflict in Gaza, Eurovision - which labels itself a non-political event - had said member countries would vote on whether Israel should or shouldn't take part. Slovenia and broadcasters from Spain, the Netherlands, Ireland and Iceland had all issued statements saying if Israel was allowed to enter, they'd consider boycotting the contest. As one of the \"Big Five\" backers of Eurovision, Spain's decision to leave the competition would have a significant financial impact on the event - which is the world's largest live singing competition. In September, a letter from EBU president Delphine Ernotte Cunci, said \"given that the union has never faced a divisive situation like this before\" the board agreed it \"merited a broader democratic basis for a decision\". Read more:Why Eurovision vote on Israel might not stop boycottCould Eurovision boycott lead to a competition crisis? On Monday, Palestinian militant group Hamas freed the last living Israeli hostages from Gaza, and Israel released busloads of Palestinian detainees, under a ceasefire deal aimed at bringing an end to the two-year war in the Middle East. The war began when Hamas stormed into Israel on October 7 2023, killing around 1,200 people and taking 251 hostage. Israel invaded Gaza in retaliation, with airstrikes and ground assaults devastating much of the enclave and killing more than 67,000, according to the Hamas-run health ministry. Its figures do not differentiate between civilians and combatants but it says around half of those killed were women and children."
    }
]