[
    {
        "title": "Search for missing crew member ended after oil tanker and cargo ship collide in North Sea",
        "description": "A crew member remains missing after an oil tanker and cargo ship collided in the North Sea off the coast of East Yorkshire.",
        "url": "https://news.sky.com/story/coastguard-helicopter-scrambled-over-report-tanker-and-cargo-ship-have-collided-in-north-sea-13325739",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tanker-collision-north-sea_6852109.jpg?20250310133022",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 11:53:00",
        "Headline": "Sky News understands there is a five-mile air and sea exclusion zone around the location of the incident, which may be widened to 10 miles if later required.",
        "Content": " A crew member remains missing after an oil tanker and cargo ship collided in the North Sea off the coast of East Yorkshire. Dozens of people abandoned the vessels after the crash just before 9.50am, with the Coastguard rescuing 36 people. All 23 on board the oil tanker Stena Immaculate are accounted for - but one of the 14 crew members of the Solong cargo ship is still missing. A Coastguard search was called off around 9.40pm, while both vessels were both still on fire. One of the 36 people rescued was taken to hospital. Sky News understands there is a five-mile air and sea exclusion zone around the location of the incident, which may be widened to 10 miles if later required. Read more: What we know about the collision The Stena Immaculate was carrying jet fuel and was on a short-term charter to the US Navy at the time of the incident. The cargo ship was reportedly carrying 15 containers of sodium cyanide and an unknown quantity of alcohol. Two maritime security sources told Reuters there was \"no indication\" of any malicious activity or other actors involved in the incident. 'Multiple explosions onboard' US logistics group Crowley, which manages oil tanker Stena Immaculate, confirmed the vessel had released some jet fuel after sustaining a ruptured cargo tank. The firm said it initiated its emergency vessel response plan and is \"actively working with public agencies to contain the fire and secure the vessel\". Crowley added: \"Our first priority is the safety of the people and environment. We will provide more updates as information becomes available.\" Read more: Environmental impact of collision depends on at least three things Downing Street 'monitoring situation' The prime minister's official spokesman said it was an \"extremely concerning situation\". He said: \"We thank the emergency services for their rapid response. I understand the Department for Transport is working closely with the coastguard to help support the response to the incident. \"We're obviously monitoring the situation, we'll continue to coordinate the response and we're grateful to emergency personnel for their continued efforts.\" Meanwhile, Hull City Council leader Mike Ross has called for the UK government to set out a rapid response plan in response to the events. Transport Secretary Heidi Alexander later praised the work of the emergency services, adding: \"The Maritime Accident Investigation Branch (MAIB) has begun a preliminary assessment and I am working closely with the MCA (Maritime and Coastguard Agency) as they conduct an assessment of any counter pollution response which may be required over the coming days.\" Coastguard's emergency message Moments after the collision, a message broadcast by the Coastguard warned other ships to stay away from the area. In audio shared on social media, the Coastguard can be heard warning Solong \"has collided\" with Stena Immaculate. \"Both vessels are abandoning,\" the message continued. \"Vessels who have firefighting equipment or can assist with search and rescue, contact Humber Coastguard. \"Stena is carrying Jet-A1 fuel, which is on fire and in the water. Vessels - remain at safe distance.\" 'Inspectors are gathering evidence' The Marine Accident Investigation Branch is now investigating the collision. A spokesperson said: \"Our team of inspectors and support staff are gathering evidence and undertaking a preliminary assessment of the accident to determine our next steps.\" The oil tanker was sailing under a US flag, while the Solong cargo ship was Portuguese-flagged, according to Marinetraffic.com. Overall responsibility for investigating this collision rests with the flag states of the vessels - in this case, Portugal and the United States. MAIB has an interest as the incident occurred in UK waters, UK authorities are co-ordinating the response, and the crews of both ships were recovered to the UK. The Solong had been due to travel to Rotterdam in the Netherlands after departing from Grangemouth in Scotland on Monday morning, Marinetraffic.com shows. Moving images on the tracking site suggest the oil tanker had remained stationary as the Solong headed straight towards it before the collision. It is believed the Stena Immaculate, which was travelling from Greece to the UK, was anchored at the time. David McFarlane, director Maritime Risk and Safety Consultants, told Sky News it can take up to an hour to raise an anchor - meaning the tanker might not have had time to get out of the way. It comes as Martyn Boyers, chief executive of the Port of Grimsby East, said the container ship may have been on autopilot at the time of the crash. \"Autopilot just steers a course, they don't deviate, there's no bend in the sea,\" he added. Visibility in the area had been poor before the collision this morning, according to the Met Office. \"Areas of fog and low cloud lifting as winds increase through the morning, with some warm, if rather hazy sunny spells expected in places for a time,\" it said on Monday morning. "
    },
    {
        "title": "Jet fuel and sodium cyanide: How North Sea ship crash could have lethal consequences for wildlife",
        "description": "The crash involving a cargo ship and oil tanker off the East Yorkshire coast is bad news for the sea, fish and air in the area. What we don't know yet is quite how bad it will be.",
        "url": "https://news.sky.com/story/environmental-impact-of-oil-tanker-collision-depends-on-at-least-three-things-13325891",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tanker-collision-north-sea_6852107.jpg?20250310132309",
        "type": "Home",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-10 16:06:00",
        "Headline": "So much is still unclear about this collision between an oil tanker and a container ship in the North Sea. We know it will impact the environment, but how bad depends on at least three things, and it may take a long time to really know.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  The crash involving a cargo ship and oil tanker off the East Yorkshire coast is bad news for the sea, fish and air in the area. What we don't know yet is quite how bad it will be. That depends on a few things - but the speed of the collision, clouds of filthy black smoke from the fires and the leaked fuel are certainly worrying. Firstly, it matters what was on board those two massive vessels. Follow live: Jet fuel spilling into sea after tanker collision Analytics firm Vortexa estimates the 183m-long tanker was carrying about 130,000 barrels of jet fuel (kerosene), which is now leaking into the sea. Jet fuel is not as sticky or viscous as heavier types of oil, thankfully, so it's less likely to clog the feathers and fur of birds and seals. It can also be broken down by natural bacteria. But it can still poison fish and kill animals and plants on the shoreline if it makes its way into the soil there. \n                  Wild beavers to make a comeback in England after government approves reintroduction\n                 \n                  Lorries dumped waste on beach - as Sky News told gangs can 'make millions' from illegal tipping\n                 \n                  Trump 100 Day 25: Has Trump's call with Putin brought peace a step closer? \n                 The Marine Conservation Society has pointed out the site in the Humber estuary is close to some protected areas and is important for seabirds and harbour porpoises.  'Hopefully, the effect on wildlife will be minimal' Martin Slater, director of operations at Yorkshire Wildlife Trust, said: \"East Yorkshire's coast is home to protected and significant colonies of seabirds including puffins, razorbills, gannets and kittiwakes. \"Many birds are gathering offshore on the sea ahead of the nesting season. There are significant numbers of Atlantic grey seals in the area, many rearing this year's young, as well as porpoises and other cetaceans around Spurn. \"If pollution spillage enters the Humber, this could potentially be devastating for the wildlife of the estuary, including important fish stocks and tens of thousands of overwintering and migrating birds who use the mud flats.\" The Royal Society for the Protection of Birds (RSPB) said the crash was close to the biggest gannet colony in England and warned a leak could be \"lethal\" to seabirds. Wildlife authorities have stated they will not intervene in the rescue efforts until all the mariners are accounted for. A spokesperson for Whitby Wildlife Sanctuary said: \"Hopefully, the effect on wildlife will be minimal, but there is an emergency contingency plan in place if lots of oiled birds wash up.\" 'Heavy fuel oil is nasty stuff' Both ships will have been powered by a dirtier, heavier kind of oil - likely marine gas oil or heavy fuel oil, though we don't know the details yet. Heavy fuel oil is nasty stuff. Cheap, thick and tar-like, it can smother animals and is very dangerous if they consume it, and is extremely difficult to clean up. Let's hope this isn't creeping around the North Sea already. We don't know how much of either the jet fuel or the oil powering the ships has leaked, or how much will be burned off in the violent fires - which themselves are ploughing black smoke and filthy air pollution into the surrounding atmosphere. Cargo ship 'had sodium cyanide on board' The Solong cargo ship was carrying 15 containers of sodium cyanide among other cargo, according to a report from maritime data provider Lloyd's List Intelligence. The container vessel was also transporting an unknown quantity of alcohol, said the casualty report - an assessment of incidents at sea - citing a message from the local coastguard. Plastic takes hundreds of years to break down, and potentially can choke or trap animals. Many of us have seen that uncomfortable viral video of a turtle having a straw yanked out of its nose. Previous accidents on cargo ships have seen plastic Lego pieces wash up in Cornwall 25 years later. Read more:How UK North Sea platforms dump gas Secondly, the impact depends on the sea and weather conditions around it. Things like the wind and currents affect how an oil spill spreads in the sea. Scientists can draw up computer models to simulate how the oil could behave. Thirdly, it matters how quickly this is all tackled and then cleaned up, if necessary, and if it can be. Usually the slower the response, the worse the impact. The coastguard has said the incident \"remains ongoing\" and it has started assessing the \"likely counter pollution response\" that will be required. Such a response might need the help of numerous public bodies: the government environment department, the transport department, the Environment Agency and the Maritime and Coastguard Agency. So for now the best we can hope for - aside from the welfare of the people involved - is that not all the oil is spilled or burnt, that conditions are calm and that rescuers and those cleaning up can work swiftly."
    },
    {
        "title": "US shares drop sharply after Trump refuses to rule out recession",
        "description": "US shares fell sharply again on Monday amid uncertainty in the American economy, with President Donald Trump refusing to rule out a recession.",
        "url": "https://news.sky.com/story/us-shares-drop-sharply-after-trump-refuses-to-rule-out-recession-13326030",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trader-stock-market_6852619.jpg?20250310220527",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:33:00",
        "Headline": "Tesla shares plunge by at least 15% to $222 - meaning it has lost more than half its value since December while the tech-heavy Nasdaq Composite closes down more than 4%.",
        "Content": "US shares fell sharply again on Monday amid uncertainty in the American economy, with President Donald Trump refusing to rule out a recession. Tesla shares plunged by at least 15% to $222 - meaning it has lost more than half its value since its peak at $479.86 on 17 December. But Elon Musk said on X that \"it will be fine long-term\". The tech-heavy Nasdaq Composite closed down more than 4% on Monday while the S&P 500 slumped about 2.7% - its biggest daily percentage drop since 18 December. The CBOE Volatility Index, often dubbed Wall Street's \"fear gauge\", surged over 3.6 points to hit 27, marking its highest level since 18 December. Airlines and other companies that need US shoppers feeling confident enough to spend also saw sharp losses. Bitcoin fell below $79,000 from more than $100,000 in December, with richly valued US tech stocks bearing the brunt of the recent sell-off on Wall Street. Financial markets have been volatile in recent weeks as rising trade tensions - with tariffs of up to 25% against goods from Canada and Mexico - and signs of slowing US economic growth weighed on consumer confidence and business activity. China has also been targeted with tariffs and the European Union could be next, from 2 April, when Mr Trump has promised to ramp up his \"America first\" ambitions. China's retaliatory tariffs on select US imports are set to take effect on Monday, with US tariffs on certain base metals anticipated later in the week.  Read more:An A-Z of Trump's first 50 days in officeWhat's gone wrong at Musk's Tesla?'Common error' could leave thousands out of pocket Asked directly in a Fox News interview on Sunday whether he was expecting a recession, Mr Trump did not deny the possibility. He said: \"I hate to predict things like that. There is a period of transition because what we're doing is very big, we're bringing wealth back to America. That's a big thing. And there are always periods of - it takes a little time. It takes a little time.\" 👉 Follow Trump 100 on your podcast app 👈 In an interview on Monday, Kevin Hassett, who heads the US National Economic Council, said there were many reasons to be optimistic about the US economy, despite some predictions of a contraction in GDP in the first quarter and concerns about inflation. \"There are a lot of reasons to be extremely bullish about the economy going forward. But for sure, this quarter, there are some blips in the data,\" Mr Hassett said, saying those stemmed from both timing effects of Mr Trump's rapid-fire tariffs push and some of what he called the \"Biden inheritance\". The president and his team have repeatedly bashed the economy that they inherited from Joe Biden. But when Mr Trump took office in January, GDP growth had largely exceeded trend for two years, consumer spending was strong and unemployment was still near historic lows."
    },
    {
        "title": "What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further",
        "description": "Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla.",
        "url": "https://news.sky.com/story/teslas-share-price-losing-streak-is-musks-trump-role-distracting-him-from-his-day-job-of-running-ev-maker-13325824",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250212051115",
        "type": "Home",
        "Author": "Ian King",
        "Date Published": "2025-03-10 14:32:00",
        "Headline": "Tesla saw its shares peak in December, but since then more than $800bn has been wiped from its stock market value with suggestions of further falls.",
        "Content": "\n          Business presenter\n              @iankingsky\n Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla. Shares of Elon Musk's electric vehicle maker have fallen for seven straight weeks, the longest losing streak since the company floated on the stock market 15 years ago, wiping out all of the gains it enjoyed after Mr Trump was elected US president in November last year. Money blog latest On Monday, the Tesla share price plunged by at least 15% to $222. Since the price peaked at $479.86 on 17 December, it has fallen by over half, wiping more than $800bn from its stock market value. To put it in context, that sum is roughly equivalent to Poland's annual economic output. And there may be worse to come. Wall Street analysts have been rushing to downgrade Tesla stock. A quarter of the 40 brokerages covering the stock currently rate it a \"strong sell\", suggesting there could be further falls to come. Reasons for share price drop There are a number of reasons behind the drop. Those who deplore Mr Musk's political views and his close proximity to the Trump administration will doubtless cite this as the key factor. It has certainly played a part. Mr Musk's recent antics, such as wielding a chainsaw on stage at a recent political conference and making a gesture on stage that some interpreted as a Nazi salute, have not endeared him or his companies to a swathe of the public both in the US and beyond. There have been protests and outbreaks of vandalism at Tesla dealerships and EV charging points across the US while, in both Europe and China, Tesla orders in January were down 45% year on year. Admittedly, a lot of the people staging protests at Tesla properties are unlikely to have been would-be buyers of the company's products, but the bigger problem is that Mr Musk now appears to be alienating customers who were previously loyal to the brand - as shown by the popularity, in the US, of Tesla bumper stickers with messages such as \"I bought this before Elon went crazy\" and \"Anti-Elon Tesla Club\".  Is Musk distracted? Conversely, some investors who wholly approve of the work Mr Musk is doing for the Trump administration may also have concerns, notably that it is proving too much of a distraction from the day job of running Tesla. Even before Mr Musk took the wheel at the US Department Of Government Efficiency (DOGE), there were already fears that he was being too distracted by his private companies, including the social media platform X, the aerospace and defence contractor SpaceX and his artificial intelligence business xAI. X, on which lies peddled by the Kremlin about Ukraine are regularly amplified, may also be adding to the damage being done to the Tesla brand. But Mr Musk's association with the Trump administration is only part of the reason for the recent declines. Tesla shares could have been over-priced Another key factor is that shares of Tesla were arguably over-priced to begin with. In the two weeks following the US presidential election, Tesla shares shot up by 32%, adding $250bn to its stock market value. To put that into context, that gain was equal to the entire stock market value of Toyota, the world's next biggest carmaker after Tesla. At the time its shares peaked, Tesla shares were trading at 112 times expected earnings, compared with the 25 times or so that the S&P 500 was trading at and higher even than the company's average over the last five years of 93. Again, to put things in context, Ford shares are valued at just eight times prospective earnings. That exotic rating reflected the superlative growth prospects previously accorded to Tesla, in particular Mr Musk's pledges to launch a new cut-price electric vehicle and a fully autonomous ride-hailing service. Competition from China But investors are now reappraising those growth prospects as Tesla loses share of the electric vehicle market to rivals, such as China's BYD, which is also seen as outpacing the company on self-driving vehicle technology. News on Tesla's planned new low-cost model remains elusive and, until it is launched, critics believe it has little hope of building share in burgeoning markets such as India. Mr Musk always wanted Tesla to be seen as an AI and robotics company rather than an electric vehicle maker and that was part of the bull case for the stock. Yet there are now fears that the company is investing too much in such projects and on its much-criticised Cybertrucks. Another concern is that Tesla's core operations may be misfiring. Read more from Sky News:Trump dodges US recession question'Canada will never be part of the US'  Results published at the end of January revealed that operating profits for the final three months of 2024 were down 23% on the same period a year earlier - which Tesla blamed on lower average selling prices on each of its Model 3, Model Y, Model X and Model S lines. For the full year, deliveries of new vehicles were down on 2023, the first year-on-year fall the company has suffered. And the operating margins, partly reflecting the sums Tesla is investing, were also lower. It all adds up to an unpleasant cocktail for investors."
    },
    {
        "title": "Donald Trump calls detained Palestinian student activist Mahmoud Khalil 'anti-American' - and warns of further arrests",
        "description": "Donald Trump says a Palestinian student activist detained by federal immigration agents is \"anti-American\".",
        "url": "https://news.sky.com/story/donald-trump-calls-detained-palestinian-student-activist-mahmoud-khalil-anti-american-and-warns-of-further-arrests-13326033",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mahmoud-khalil-columbia-university_6852642.jpg?20250310222519",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:49:00",
        "Headline": "Mahmoud Khalil, a graduate student at Columbia University, has been a prominent figure in the university's pro-Palestinian protest movement. He was detained at his Columbia apartment building in Manhattan on Saturday evening.",
        "Content": " Donald Trump says a Palestinian student activist detained by federal immigration agents is \"anti-American\". Mahmoud Khalil, a postgraduate student at Columbia University's school of international and public affairs, has been a prominent figure in the university's pro-Palestinian student protest movement. A federal judge in New York City ordered for Mr Khalil not be deported on Monday while the court considers a lawsuit challenging his detention. A hearing was scheduled for Wednesday.   Mr Khalil was detained at his Columbia apartment building in Manhattan in front of his wife, a US citizen who is eight months pregnant, on Saturday evening. Agents from the Department of Homeland Security (DHS) told him his student visa had been revoked but Mr Khalil has held a US permanent residency green card since 2024, his lawyer Amy Greer said. The Trump administration has not said what Mr Khalil is accused of or if he has been charged with a crime. He has since been moved to a federal jail for migrants in Louisiana to await deportation proceedings, according to a US detainee database. Lawyers for the student have started a legal challenge against his arrest. In a post on Truth Social, Mr Trump said: \"ICE [Immigration and Customs Enforcement] proudly apprehended and detained Mahmoud Khalil, a Radical Foreign Pro-Hamas Student on the campus of Columbia University.\" The US president said Mr Khalil's arrest was the \"first arrest of many to come\". 👉 Follow Trump 100 on your podcast app 👈 \"This is the first arrest of many to come. We know there are more students at Columbia and other Universities across the Country who have engaged in pro-terrorist, anti-Semitic, anti-American activity, and the Trump Administration will not tolerate it,\" he said. \"Many are not students, they are paid agitators. We will find, apprehend, and deport these terrorist sympathisers from our country - never to return again.\" \"If you support terrorism, including the slaughtering of innocent men, women, and children, your presence is contrary to our national and foreign policy interests, and you are not welcome here. We expect every one of America's Colleges and Universities to comply,\" the president added. Students say federal immigration agents have been spotted at student housing around Columbia's Manhattan campus since Thursday, a day before the Trump administration announced it was cancelling $400m (£310.7m) in federal grants and contracts awarded to the university. Read more:How Trump has upended millions of lives in his first 50 daysRating the president's second term so far The federal agents have been trying to detain a second international student, according to the Student Workers of Columbia labour union. Mr Trump has singled out Columbia's handling of the protests since returning to the White House, saying the university has allowed antisemitic harassment \"on and near\" its campus. Mr Khalil and other activists from Columbia University Apartheid Divest said Jewish students were among the organisers, and say their criticism of Israel and its US government support is being wrongly conflated with antisemitism. In the wrongful detention challenge filed in the Manhattan federal court on Sunday. Ms Greer said Mr Khalil's arrest was motivated by his \"criticism of US institutions that support Israel\", which she said was free speech protected by the US constitution's first amendment. \"Even the threat of detention and deportation has a chilling effect on speech,\" Ms Greer wrote. It is unclear when Mr Khalil will have a hearing in an immigration court, which is typically the first step in the deportation process. Spokespeople for ICE and DHS did not provide details about his case on Monday. Typically, expelling a person who has permanent residency in the US requires a high bar, such as that person being convicted of certain types of crimes. In January, Mr Trump signed an executive order calling on the Department of Justice to \"investigate and punish anti-Jewish racism in leftist, anti-American colleges and universities\"."
    },
    {
        "title": "Volodymyr Zelenskyy arrives in Saudi Arabia ahead of US-Ukraine meeting - as Marco Rubio says Kyiv should be 'prepared to do difficult things'",
        "description": "Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-arrives-in-saudi-arabia-ahead-of-us-ukraine-meeting-13325920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-volodymyr-zelenskyy_6852331.jpg?20250310172041",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 17:07:00",
        "Headline": "US secretary of state Marco Rubio is also in Saudi Arabia - but is not due to meet the Ukrainian president.",
        "Content": " Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday. Mr Zelenskyy will not be at the meeting with US secretary of state Marco Rubio, but Mr Zelenskyy's team will try to improve relations following his disastrous 28 February visit to Washington, which descended into an Oval Office argument with President Donald Trump and vice president JD Vance. Follow latest updates on Ukraine and Trump Mr Zelenskyy briefly met Crown Prince Mohammed bin Salman on Monday, after the end of the daily fast during the Muslim holy month of Ramadan. US secretary of state Marco Rubio is also in Jeddah. He is not due to meet Mr Zelenskyy - but he held talks with Prince Mohammed to discuss Yemen and threats to ships from Houthis, Syria, and the reconstruction of Gaza. During talks on Tuesday the Ukrainian team will try to convince the US to restore military aid and intelligence that had helped Kyiv since Russia's full-scale invasion of Ukraine in 2022. Speaking to reporters while travelling to Jeddah, Mr Rubio said if Ukraine and the US reach an understanding acceptable to Mr Trump, that could accelerate his administration's push to peace talks. \n                  US shares drop sharply after Trump refuses to rule out recession\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  How will Canada's new PM take on Donald Trump?\n                 \"What we want to know is, are they interested [in] entering some sort of peace conversation and general outlines of the kinds of things they could consider, recognising that it has been a costly and bloody war for the Ukrainians,\" Mr Rubio said. \"They have suffered greatly and their people have suffered greatly. And it's hard in the aftermath of something like that to even talk about concessions, but that's the only way this is going to end and prevent more suffering.\"  He said: \"I'm not going to set any conditions on what they have to or need to do. I think we want to listen to see how far they're willing to go and then compare that to what the Russians want and see how far apart we truly are.\" He added: \"The most important thing that we have to leave here with is a strong sense that Ukraine is prepared to do difficult things, like the Russians are going to have to do difficult things to end this conflict.\" Meanwhile, British prime minister Sir Keir Starmer spoke to Mr Trump on Monday ahead of the US-Ukraine meeting. Read more:How Trump has upended millions of lives in his first 50 daysTrump says Ukraine 'may not survive' war against RussiaRating the president's second term so far A Downing Street readout of the call said that Sir Keir told the president that \"UK officials had been speaking to Ukraine officials over the weekend and they remain committed to a lasting peace\". \"The prime minister said he hoped there would be a positive outcome to the talks that would enable US aid and intelligence sharing to be restarted,\" the statement said. \"The two leaders also spoke about the economic deal they had discussed at the White House and the prime minister welcomed the detailed conversations that had already happened to move this forward. Both leaders agreed to stay in touch.\" The European Union agreed last week to boost the continent's defences and free up hundreds of billions of euros for security in response to the Trump administration's shift in policy towards Ukraine. A US intelligence official said a pause on sharing US intelligence that can be used for offensive purposes by Ukrainian forces remains in effect. The official suggested that progress could be made towards reinstating intelligence sharing with Ukraine during the Saudi talks."
    },
    {
        "title": "Constance Marten and partner caused 'entirely avoidable' death of baby daughter, court hears",
        "description": "Constance Marten and her partner Mark Gordon caused the \"entirely avoidable\" death of their baby daughter, their retrial has heard.",
        "url": "https://news.sky.com/story/constance-marten-and-partner-caused-entirely-avoidable-death-of-baby-daughter-court-hears-13325882",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-constance-marten-mark-gordon_6585473.jpg?20240619134209",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 15:49:00",
        "Headline": "Marten, 37, and 50-year-old Mark Gordon are accused of the manslaughter of their newborn daughter by gross negligence in early 2023 in a retrial at the Old Bailey.",
        "Content": "Constance Marten and her partner Mark Gordon caused the \"entirely avoidable\" death of their baby daughter, their retrial has heard. Marten, 37, and Gordon, 50, are accused of the manslaughter of their newborn daughter by gross negligence in early 2023. Jurors at the Old Bailey heard that the couple allegedly kept the birth of their daughter as \"their little secret\" after their four older children were taken into care. On 5 January 2023, the defendants went on the run with the baby after their car burst into flames on a motorway in Greater Manchester, jurors heard. They fled the scene, and went on to travel hundreds of miles across England in taxis costing thousands of pounds, the court was told. Prosecutor Tom Little KC said Marten came from a \"very wealthy family\" and had a trust fund so could buy whatever she needed. Couple 'went off-grid' \n                  Constance Marten and partner guilty of concealing birth of child and perverting course of justice\n                 \n                  Constance Marten and Mark Gordon trial: Jury begins deliberations over manslaughter charges\n                 \n                  Constance Marten and Mark Gordon trial: Couple's newborn baby 'did not stand a chance', court hears\n                 Mr Little said the couple travelled from Harwich to Colchester in Essex and on to east London before making their way to the South Downs where they went \"off-grid\" and slept in a \"flimsy\" tent from 8 January. The couple transferred the baby to a Lidl bag for life after dumping a brand new buggy and were next seen on 12 January at a Texaco garage where Marten bought snacks with cash. There was no sign of the baby. Mr Little told the jury: \"You will have to consider if the baby had by now died of hypothermia, or had been smothered and suffocated in the obviously dangerous sleeping conditions in that tent, or whether she was still alive at this point but that her fate was sealed by the conduct of the defendants carrying her in a bag for life.\" After the baby died, the defendants continued to sleep rough and scavenge in bins for food while carrying the body in the same Lidl bag. Baby's decomposed body discovered The child's decomposed body was eventually found by police a few days after the defendants were detained in Brighton on 27 February 2023. Read more:Tower Bridge shut down after man scales railingsKing shares playlist for Commonwealth Day radio showWhippet becomes first Italian dog to win Crufts Mr Little told jurors: \"They put their relationship and their views of life before the life of a little baby girl. \"Rather than act in the obvious best interests of a vulnerable baby and one that they should have cared for and looked after, they decided instead that they knew best. \"They decided to ignore the advice that they had previously been given. They decided that in the middle of winter and in obviously dangerous weather conditions they would deprive the baby of what it needed - warmth, shelter, protection and food and ultimately safety. \"They essentially went off-grid and lived in a tent with hardly any clothes, no means of keeping and remaining warm and dry and with scarcely any food.\" It was their \"grossly negligent and obviously dangerous conduct\" that caused the death of the baby, jurors were told. \"After the baby died, in January 2023, the defendants did not hand themselves in but instead remained off-grid, trying to hide for a number of weeks, leaving the body of their dead baby in a shopping bag covered in rubbish, which they carried around and then left in a disused shed,\" Mr Little added. Defendants deny manslaughter Jurors were told the defendants were convicted at an earlier trial of concealing the birth of a child and perverting the course of justice. The defendants have denied manslaughter and a second charge of causing or allowing the death of a child between 4 January and 27 February 2023. Marten appeared in court while Gordon did not, but jurors were told he might join the proceedings later by video link. Judge Mark Lucraft KC warned jurors against \"jumping to any conclusions\" before hearing all the evidence in the case. The Old Bailey retrial is expected to last for up to eight weeks."
    },
    {
        "title": "Elon Musk blames 'IP addresses in Ukraine' after X hit by cyber attack  ",
        "description": "X has been hit by a \"massive cyber attack\", according to Elon Musk.",
        "url": "https://news.sky.com/story/elon-musk-says-x-hit-by-massive-cyber-attack-as-users-unable-to-log-in-13325939",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-x-twiter-social-media_6659747.jpg?20240818040415",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 17:35:00",
        "Headline": "More than 40,000 users reported they could not access X on Monday, according to data from tracking website Downdetector.com.",
        "Content": "X has been hit by a \"massive cyber attack\", according to Elon Musk. The boss of the social media platform said the attack was carried out \"with a lot of resources\". Mr Musk claimed that either a large coordinated group or a country was involved, or both. He wrote on the platform: \"There was (still is) a massive cyberattack against X. \"We get attacked every day, but this was done with a lot of resources. Either a large, coordinated group and/or a country is involved. Tracing...\" Later on Monday, Mr Musk claimed on Fox News that IP addresses involved in the cyber attack were traced to locations \"in the Ukraine area\". The US government has recently revoked some access to satellite imagery for Ukraine and paused intelligence sharing, piling pressure on Kyiv as President Trump seeks a swift end to the war with Russia. \n                  Elon Musk calls US senator Mark Kelly 'a traitor' for visiting Ukraine - as Democrat fires back\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  Second SpaceX flight crash is a new blow for Musk's Mars programme\n                 In a now-deleted post on Telegram, a hacking group called Dark Storm Team claimed responsibility for the attack. Around 40,000 users reported they could not access the platform on Monday, according to data from tracking website Downdetector.com. Complaints about outages spiked at around 10am in the UK, and again at 2pm. Read more from Sky News:Is Musk's Trump role distracting him from his day job?US shares plunge as Trump refuses to rule out recession A source in the internet infrastructure industry told the Reuters news agency that the platform had been hit by several waves of denial of service (DoS) attacks at around 9.45am. According to the National Cyber Security Centre, DoS attacks are attempts to overload a website or network - aiming to degrade its performance or make it completely inaccessible. Such attacks are not necessarily sophisticated but they can cause significant disruption."
    },
    {
        "title": "Elon Musk calls US senator Mark Kelly 'a traitor' for visiting Ukraine - as Democrat fires back",
        "description": "A US senator has hit back at Elon Musk, saying the billionaire Trump adviser is \"not a serious guy\" after he branded the politician a \"traitor\" for visiting Ukraine.",
        "url": "https://news.sky.com/story/elon-musk-calls-us-senator-mark-kelly-a-traitor-for-visiting-ukraine-as-democrat-fires-back-13326079",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-elon-musk_6827946.jpg?20250213175145",
        "type": "Home",
        "Author": "Unknown",
        "Date Published": "2025-03-10 22:11:00",
        "Headline": "Senator Mark Kelly - a former US navy pilot - visited Kyiv earlier in March and met with wounded service members and Ukrainian officials. Posting on X, Elon Musk called the Democrat a \"traitor\" for making the trip.",
        "Content": "A US senator has hit back at Elon Musk, saying the billionaire Trump adviser is \"not a serious guy\" after he branded the politician a \"traitor\" for visiting Ukraine. Mark Kelly, the Democrat senator for Arizona and a former US navy combat pilot, made his third visit to Kyiv since 2023 earlier this month, meeting with wounded service members and Ukrainian officials. Posting on X after he left the country, he said \"what I saw proved to me we can't give up on the Ukrainian people\", and in a break from US President Donald Trump's stance on negotiations, called for security guarantees in any peace deal. \"Everyone wants this war to end, but any agreement has to protect Ukraine's security and can't be a giveaway to Putin,\" he said.  Mr Musk, who also leads the Department of Government Efficiency (DOGE), an advisory department under the Trump administration, replied on X and said: \"You are a traitor.\" Firing back at the Tesla chief, Mr Kelly said: \"Traitor? Elon, if you don't understand that defending freedom is a basic tenet of what makes America great and keeps us safe, maybe you should leave it to those of us who do.\" He then told reporters back in the US the billionaire is \"obviously not a serious guy\".   It comes as Ukraine's President Volodymyr Zelenskyy arrives in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday. Mr Zelenskyy will not be at the meeting with US secretary of state Marco Rubio, but his team will try to improve relations following his disastrous 28 February visit to Washington, which descended into an Oval Office argument with the US president and vice president JD Vance. Read more:Trump says Ukraine 'may not survive' warRussian forces creep through disused gas pipeline It also comes as Mr Musk said X was hit by a \"massive cyber attack\" on Monday, with thousands of users reporting they were unable to use the platform. Later, he claimed in an interview with Fox News that IP addresses involved in the cyber attack were traced to locations \"in the Ukraine area\"."
    },
    {
        "title": "Sir David Amess's family 'betrayed and angry' as government refuse inquiry",
        "description": "Sir David Amess's daughter has said the government's decision to not hold a national inquiry into his murder has left his family \"betrayed and angry\".",
        "url": "https://news.sky.com/story/sir-david-amesss-family-betrayed-and-angry-as-government-refuse-inquiry-13326004",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-david-amess-politics-hub_6852505.jpg?20250310201323",
        "type": "Home",
        "Author": "Alix Culbertson and Alexandra Rogers, political reporters",
        "Date Published": "2025-03-10 10:48:00",
        "Headline": "Katie Amess has questioned why public inquiries have been called into the Southport and Nottingham murders but not her father's.",
        "Content": "By Alix Culbertson and Alexandra Rogers, political reporters   Sir David Amess's daughter has said the government's decision to not hold a national inquiry into his murder has left his family \"betrayed and angry\". The Conservative MP for Southend West was murdered by Islamic State sympathiser Ali Harbi Ali in 2021 as he held a constituency surgery. On Monday, Home Secretary Yvette Cooper rejected the MP's family's call for a national inquiry into his death. His daughter, Katie Amess, told Sky News' Politics Hub With Sophy Ridge she is in \"utter disbelief\" the government thinks they \"should be happy\" with an initial inquiry into her father's death as she said it was purely a \"paper review\" without an investigation or interviews.  Politics latest: Starmer facing first by-election test as PM \"We're in utter disbelief and we're completely heartbroken all over again,\" she said. \"We just feel betrayed, ignored, let down and also angry because, why are we having to fight so hard for an inquiry? \"This inquiry should have happened immediately after his death. Nobody wants to help me and I just don't understand why.\" Ms Amess said her father was friends with everybody, whatever their race, religion, economic status or political affiliation. She revealed when he died they received many letters from people who said they were his best friend, which showed just the kind of person he was. Earlier, Ms Amess and her mother, Lady Julia Amess, spoke at a news conference where Ms Amess said the authorities had let her father down \"so badly\" and that his death had been \"brushed under the carpet\". She urged Ms Cooper to reverse her decision, saying: \"Do not let my father's murder be forgotten. \"Do not let his death be just another statistic.\" Ali, who was given a whole-life sentence, had been referred to the anti-terror programme Prevent before the attack. A review into his murder found he was released from Prevent \"too quickly\", with his case closed five years before the attack following one meeting at a McDonald's to deal with his interpretation of what is forbidden under Islamic law. The late MP's daughter, who is also taking legal action against Essex Police and the Home Office, has dismissed that investigation as \"another useless paper review conducted by a person of their choice\". In a tearful statement, she accused Ms Cooper of having \"strung\" the family along for \"months\" by suggesting she \"was working on ways to help us\". Read more: What is Prevent?  She told reporters: \"How can the government justify holding inquiries for other tragic events like Southport and Nottingham and yet refuse to investigate the very system that failed my father? \"Is his life worth less than others? \"Does our family not deserve the truth like other families and to know that what happened will never happen again?\" She said all Ms Cooper had done was \"remove the possibility of us being included in the Southport inquiry; instead offering another useless paper review, conducted by a person of their choice\". In a direct message to the government, she said: \"I want Sir Keir and Yvette Cooper to know exactly what the consequences are when the very government agencies that are set up to protect people like my dad, and members of the public, fail. \"Doing paper review after paper review into what happened, like what they have done since the day my dad was murdered, is simply not enough.\"  Ms Cooper rejected the Amess family's calls for a public inquiry in a letter to the late MP's widow and his daughter, seen by the PA news agency. In it, Ms Cooper said it was \"hard to see how an inquiry would be able to go beyond\" terrorist killer Ali Harbi Ali's trial and the recently published Prevent learning review. Lady Julia and Ms Amess said the prime minister should \"go away and reconsider the government's position\" ahead of a family meeting with himself and Ms Cooper on Wednesday. Read more:Basic failings to stop killer of Sir David AmessHow 'fanatical terrorist' carried out MP assassination  Outlining the government's reasoning for refusing a public inquiry, security minister Dan Jarvis said he did not believe such a step would \"unearth any information that has not already been assessed\". \"In the years since this cowardly attack, there have been several reviews asking how this could have been avoided, and we have seen significant improvements to the Prevent programme as well as stronger protections for MPs,\" he said. \"We understand that the Amess family are still looking for answers and we take this incredibly seriously. \"While we do not think a public inquiry would unearth any information that has not already been assessed, the home secretary has confirmed that we will further scrutinise all the reviews that have taken place over the last few years. \"We very much hope this will help the family to get the justice they deserve.\""
    },
    {
        "title": "Search for missing crew member ended after oil tanker and cargo ship collide in North Sea",
        "description": "A crew member remains missing after an oil tanker and cargo ship collided in the North Sea off the coast of East Yorkshire.",
        "url": "https://news.sky.com/story/coastguard-helicopter-scrambled-over-report-tanker-and-cargo-ship-have-collided-in-north-sea-13325739",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tanker-collision-north-sea_6852109.jpg?20250310133022",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-10 11:53:00",
        "Headline": "Sky News understands there is a five-mile air and sea exclusion zone around the location of the incident, which may be widened to 10 miles if later required.",
        "Content": " A crew member remains missing after an oil tanker and cargo ship collided in the North Sea off the coast of East Yorkshire. Dozens of people abandoned the vessels after the crash just before 9.50am, with the Coastguard rescuing 36 people. All 23 on board the oil tanker Stena Immaculate are accounted for - but one of the 14 crew members of the Solong cargo ship is still missing. A Coastguard search was called off around 9.40pm, while both vessels were both still on fire. One of the 36 people rescued was taken to hospital. Sky News understands there is a five-mile air and sea exclusion zone around the location of the incident, which may be widened to 10 miles if later required. Read more: What we know about the collision The Stena Immaculate was carrying jet fuel and was on a short-term charter to the US Navy at the time of the incident. The cargo ship was reportedly carrying 15 containers of sodium cyanide and an unknown quantity of alcohol. Two maritime security sources told Reuters there was \"no indication\" of any malicious activity or other actors involved in the incident. 'Multiple explosions onboard' US logistics group Crowley, which manages oil tanker Stena Immaculate, confirmed the vessel had released some jet fuel after sustaining a ruptured cargo tank. The firm said it initiated its emergency vessel response plan and is \"actively working with public agencies to contain the fire and secure the vessel\". Crowley added: \"Our first priority is the safety of the people and environment. We will provide more updates as information becomes available.\" Read more: Environmental impact of collision depends on at least three things Downing Street 'monitoring situation' The prime minister's official spokesman said it was an \"extremely concerning situation\". He said: \"We thank the emergency services for their rapid response. I understand the Department for Transport is working closely with the coastguard to help support the response to the incident. \"We're obviously monitoring the situation, we'll continue to coordinate the response and we're grateful to emergency personnel for their continued efforts.\" Meanwhile, Hull City Council leader Mike Ross has called for the UK government to set out a rapid response plan in response to the events. Transport Secretary Heidi Alexander later praised the work of the emergency services, adding: \"The Maritime Accident Investigation Branch (MAIB) has begun a preliminary assessment and I am working closely with the MCA (Maritime and Coastguard Agency) as they conduct an assessment of any counter pollution response which may be required over the coming days.\" Coastguard's emergency message Moments after the collision, a message broadcast by the Coastguard warned other ships to stay away from the area. In audio shared on social media, the Coastguard can be heard warning Solong \"has collided\" with Stena Immaculate. \"Both vessels are abandoning,\" the message continued. \"Vessels who have firefighting equipment or can assist with search and rescue, contact Humber Coastguard. \"Stena is carrying Jet-A1 fuel, which is on fire and in the water. Vessels - remain at safe distance.\" 'Inspectors are gathering evidence' The Marine Accident Investigation Branch is now investigating the collision. A spokesperson said: \"Our team of inspectors and support staff are gathering evidence and undertaking a preliminary assessment of the accident to determine our next steps.\" The oil tanker was sailing under a US flag, while the Solong cargo ship was Portuguese-flagged, according to Marinetraffic.com. Overall responsibility for investigating this collision rests with the flag states of the vessels - in this case, Portugal and the United States. MAIB has an interest as the incident occurred in UK waters, UK authorities are co-ordinating the response, and the crews of both ships were recovered to the UK. The Solong had been due to travel to Rotterdam in the Netherlands after departing from Grangemouth in Scotland on Monday morning, Marinetraffic.com shows. Moving images on the tracking site suggest the oil tanker had remained stationary as the Solong headed straight towards it before the collision. It is believed the Stena Immaculate, which was travelling from Greece to the UK, was anchored at the time. David McFarlane, director Maritime Risk and Safety Consultants, told Sky News it can take up to an hour to raise an anchor - meaning the tanker might not have had time to get out of the way. It comes as Martyn Boyers, chief executive of the Port of Grimsby East, said the container ship may have been on autopilot at the time of the crash. \"Autopilot just steers a course, they don't deviate, there's no bend in the sea,\" he added. Visibility in the area had been poor before the collision this morning, according to the Met Office. \"Areas of fog and low cloud lifting as winds increase through the morning, with some warm, if rather hazy sunny spells expected in places for a time,\" it said on Monday morning. "
    },
    {
        "title": "Jet fuel and sodium cyanide: How North Sea ship crash could have lethal consequences for wildlife",
        "description": "The crash involving a cargo ship and oil tanker off the East Yorkshire coast is bad news for the sea, fish and air in the area. What we don't know yet is quite how bad it will be.",
        "url": "https://news.sky.com/story/environmental-impact-of-oil-tanker-collision-depends-on-at-least-three-things-13325891",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tanker-collision-north-sea_6852107.jpg?20250310132309",
        "type": "UK",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-10 16:06:00",
        "Headline": "So much is still unclear about this collision between an oil tanker and a container ship in the North Sea. We know it will impact the environment, but how bad depends on at least three things, and it may take a long time to really know.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  The crash involving a cargo ship and oil tanker off the East Yorkshire coast is bad news for the sea, fish and air in the area. What we don't know yet is quite how bad it will be. That depends on a few things - but the speed of the collision, clouds of filthy black smoke from the fires and the leaked fuel are certainly worrying. Firstly, it matters what was on board those two massive vessels. Follow live: Jet fuel spilling into sea after tanker collision Analytics firm Vortexa estimates the 183m-long tanker was carrying about 130,000 barrels of jet fuel (kerosene), which is now leaking into the sea. Jet fuel is not as sticky or viscous as heavier types of oil, thankfully, so it's less likely to clog the feathers and fur of birds and seals. It can also be broken down by natural bacteria. But it can still poison fish and kill animals and plants on the shoreline if it makes its way into the soil there. \n                  Wild beavers to make a comeback in England after government approves reintroduction\n                 \n                  Lorries dumped waste on beach - as Sky News told gangs can 'make millions' from illegal tipping\n                 \n                  Trump 100 Day 25: Has Trump's call with Putin brought peace a step closer? \n                 The Marine Conservation Society has pointed out the site in the Humber estuary is close to some protected areas and is important for seabirds and harbour porpoises.  'Hopefully, the effect on wildlife will be minimal' Martin Slater, director of operations at Yorkshire Wildlife Trust, said: \"East Yorkshire's coast is home to protected and significant colonies of seabirds including puffins, razorbills, gannets and kittiwakes. \"Many birds are gathering offshore on the sea ahead of the nesting season. There are significant numbers of Atlantic grey seals in the area, many rearing this year's young, as well as porpoises and other cetaceans around Spurn. \"If pollution spillage enters the Humber, this could potentially be devastating for the wildlife of the estuary, including important fish stocks and tens of thousands of overwintering and migrating birds who use the mud flats.\" The Royal Society for the Protection of Birds (RSPB) said the crash was close to the biggest gannet colony in England and warned a leak could be \"lethal\" to seabirds. Wildlife authorities have stated they will not intervene in the rescue efforts until all the mariners are accounted for. A spokesperson for Whitby Wildlife Sanctuary said: \"Hopefully, the effect on wildlife will be minimal, but there is an emergency contingency plan in place if lots of oiled birds wash up.\" 'Heavy fuel oil is nasty stuff' Both ships will have been powered by a dirtier, heavier kind of oil - likely marine gas oil or heavy fuel oil, though we don't know the details yet. Heavy fuel oil is nasty stuff. Cheap, thick and tar-like, it can smother animals and is very dangerous if they consume it, and is extremely difficult to clean up. Let's hope this isn't creeping around the North Sea already. We don't know how much of either the jet fuel or the oil powering the ships has leaked, or how much will be burned off in the violent fires - which themselves are ploughing black smoke and filthy air pollution into the surrounding atmosphere. Cargo ship 'had sodium cyanide on board' The Solong cargo ship was carrying 15 containers of sodium cyanide among other cargo, according to a report from maritime data provider Lloyd's List Intelligence. The container vessel was also transporting an unknown quantity of alcohol, said the casualty report - an assessment of incidents at sea - citing a message from the local coastguard. Plastic takes hundreds of years to break down, and potentially can choke or trap animals. Many of us have seen that uncomfortable viral video of a turtle having a straw yanked out of its nose. Previous accidents on cargo ships have seen plastic Lego pieces wash up in Cornwall 25 years later. Read more:How UK North Sea platforms dump gas Secondly, the impact depends on the sea and weather conditions around it. Things like the wind and currents affect how an oil spill spreads in the sea. Scientists can draw up computer models to simulate how the oil could behave. Thirdly, it matters how quickly this is all tackled and then cleaned up, if necessary, and if it can be. Usually the slower the response, the worse the impact. The coastguard has said the incident \"remains ongoing\" and it has started assessing the \"likely counter pollution response\" that will be required. Such a response might need the help of numerous public bodies: the government environment department, the transport department, the Environment Agency and the Maritime and Coastguard Agency. So for now the best we can hope for - aside from the welfare of the people involved - is that not all the oil is spilled or burnt, that conditions are calm and that rescuers and those cleaning up can work swiftly."
    },
    {
        "title": "Constance Marten and partner caused 'entirely avoidable' death of baby daughter, court hears",
        "description": "Constance Marten and her partner Mark Gordon caused the \"entirely avoidable\" death of their baby daughter, their retrial has heard.",
        "url": "https://news.sky.com/story/constance-marten-and-partner-caused-entirely-avoidable-death-of-baby-daughter-court-hears-13325882",
        "image_url": "https://e3.365dm.com/24/06/1920x1080/skynews-constance-marten-mark-gordon_6585473.jpg?20240619134209",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-10 15:49:00",
        "Headline": "Marten, 37, and 50-year-old Mark Gordon are accused of the manslaughter of their newborn daughter by gross negligence in early 2023 in a retrial at the Old Bailey.",
        "Content": "Constance Marten and her partner Mark Gordon caused the \"entirely avoidable\" death of their baby daughter, their retrial has heard. Marten, 37, and Gordon, 50, are accused of the manslaughter of their newborn daughter by gross negligence in early 2023. Jurors at the Old Bailey heard that the couple allegedly kept the birth of their daughter as \"their little secret\" after their four older children were taken into care. On 5 January 2023, the defendants went on the run with the baby after their car burst into flames on a motorway in Greater Manchester, jurors heard. They fled the scene, and went on to travel hundreds of miles across England in taxis costing thousands of pounds, the court was told. Prosecutor Tom Little KC said Marten came from a \"very wealthy family\" and had a trust fund so could buy whatever she needed. Couple 'went off-grid' \n                  Constance Marten and partner guilty of concealing birth of child and perverting course of justice\n                 \n                  Constance Marten and Mark Gordon trial: Jury begins deliberations over manslaughter charges\n                 \n                  Constance Marten and Mark Gordon trial: Couple's newborn baby 'did not stand a chance', court hears\n                 Mr Little said the couple travelled from Harwich to Colchester in Essex and on to east London before making their way to the South Downs where they went \"off-grid\" and slept in a \"flimsy\" tent from 8 January. The couple transferred the baby to a Lidl bag for life after dumping a brand new buggy and were next seen on 12 January at a Texaco garage where Marten bought snacks with cash. There was no sign of the baby. Mr Little told the jury: \"You will have to consider if the baby had by now died of hypothermia, or had been smothered and suffocated in the obviously dangerous sleeping conditions in that tent, or whether she was still alive at this point but that her fate was sealed by the conduct of the defendants carrying her in a bag for life.\" After the baby died, the defendants continued to sleep rough and scavenge in bins for food while carrying the body in the same Lidl bag. Baby's decomposed body discovered The child's decomposed body was eventually found by police a few days after the defendants were detained in Brighton on 27 February 2023. Read more:Tower Bridge shut down after man scales railingsKing shares playlist for Commonwealth Day radio showWhippet becomes first Italian dog to win Crufts Mr Little told jurors: \"They put their relationship and their views of life before the life of a little baby girl. \"Rather than act in the obvious best interests of a vulnerable baby and one that they should have cared for and looked after, they decided instead that they knew best. \"They decided to ignore the advice that they had previously been given. They decided that in the middle of winter and in obviously dangerous weather conditions they would deprive the baby of what it needed - warmth, shelter, protection and food and ultimately safety. \"They essentially went off-grid and lived in a tent with hardly any clothes, no means of keeping and remaining warm and dry and with scarcely any food.\" It was their \"grossly negligent and obviously dangerous conduct\" that caused the death of the baby, jurors were told. \"After the baby died, in January 2023, the defendants did not hand themselves in but instead remained off-grid, trying to hide for a number of weeks, leaving the body of their dead baby in a shopping bag covered in rubbish, which they carried around and then left in a disused shed,\" Mr Little added. Defendants deny manslaughter Jurors were told the defendants were convicted at an earlier trial of concealing the birth of a child and perverting the course of justice. The defendants have denied manslaughter and a second charge of causing or allowing the death of a child between 4 January and 27 February 2023. Marten appeared in court while Gordon did not, but jurors were told he might join the proceedings later by video link. Judge Mark Lucraft KC warned jurors against \"jumping to any conclusions\" before hearing all the evidence in the case. The Old Bailey retrial is expected to last for up to eight weeks."
    },
    {
        "title": "Amen Teklay: Teenager in court charged with Glasgow schoolboy's murder",
        "description": "A teenage boy has appeared in court charged with the murder of 15-year-old Amen Teklay in Glasgow.",
        "url": "https://news.sky.com/story/amen-teklay-teenager-in-court-charged-with-glasgow-schoolboys-murder-13325792",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-amen-teklay-glasgow_6848843.jpg?20250310132922",
        "type": "UK",
        "Author": "Jenness Mitchell",
        "Date Published": "2025-03-10 13:26:00",
        "Headline": "Two boys, aged 14 and 15, were arrested at the weekend as part of an inquiry into the death of Amen Teklay. The 14-year-old has been charged with murder.",
        "Content": "\n          Scotland reporter\n              @Jenster13\n A teenage boy has appeared in court charged with the murder of 15-year-old Amen Teklay in Glasgow. Amen, who was an Eritrean refugee, was seriously injured in the city's Clarendon Street at about 10.30pm last Wednesday. Emergency crews attended but the schoolboy was pronounced dead at the scene. A murder investigation was subsequently launched following a post-mortem examination.  Two Glasgow boys, aged 14 and 15, were arrested and charged at the weekend in connection with the incident. The pair, who cannot be identified due to legal reasons, appeared at Glasgow Sheriff Court on Monday. Both have been accused of assault and carrying an offensive weapon in a public place. The 14-year-old has additionally been charged with Amen's murder. The teenagers made no plea to the charges. Both were granted bail by the sheriff, but the 14-year-old has been remanded in custody pending the outcome of a Crown bail appeal. He is due back in the dock within the next eight days, while the 15-year-old's next court appearance is yet to be confirmed. Amen was a pupil at St Thomas Aquinas Secondary School in Glasgow. A vigil for the youngster took place on Sunday. Police Scotland said it is continuing to provide specialist support to Amen's family. Read more from Sky News:Woman and partner caused 'entirely avoidable' death of baby daughter, court hearsTeenager jailed for stabbing older sister to death in 'brutal' murder Detective Chief Inspector Campbell Jackson said: \"Our thoughts remain with Amen's family and friends at this very difficult time. \"I would also like to thank the community for their support so far. \"Our investigation continues and I would ask anyone, who may have information which could help us and who has not yet come forward, to please contact us.\" Those with information who are yet to speak to officers can submit details directly to the inquiry team via an online portal."
    },
    {
        "title": "'Seismic' planning system reforms to be 'unleashed', government promises",
        "description": "The government has promised to \"unleash seismic reforms\" to the planning system under major new legislation being published on Tuesday.",
        "url": "https://news.sky.com/story/seismic-planning-system-reforms-to-be-unleashed-government-promises-13326085",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-worcester-construction_6774588.jpg?20241213071037",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-10 22:27:00",
        "Headline": "The reforms will make the planning process easier and change the way developers meet environmental obligations, say ministers.",
        "Content": "The government has promised to \"unleash seismic reforms\" to the planning system under major new legislation being published on Tuesday. The Planning and Infrastructure Bill is expected to include wide-ranging changes to help deliver on Labour's promise to build 1.5 million homes and make decisions on 150 major infrastructure projects by the next election in 2029. Reforms include making the planning process easier, giving communities living near new electricity pylons money off their energy bills and changing the way developers meet environmental obligations. Deputy Prime Minister and Housing Secretary Angela Rayner said the government would create \"the biggest building boom in a generation\" by \"lifting the bureaucratic burden which has been holding back developments for too long\". She added: \"The Planning and Infrastructure Bill will unleash seismic reforms to help builders get shovels in the ground quicker to build more homes, and the vital infrastructure we need to improve transport links and make Britain a clean energy superpower to protect billpayers.\" The bill is expected to include plans to allow more planning applications to be decided by planning officers instead of elected councillors, with council planning committees to be made smaller to \"ensure good debate is encouraged\". Planning fees will also be allowed to be set by councils to recover their costs, and \"meritless\" legal challenges to major applications will face a crackdown. \n                  Mike Amesbury to quit as MP after punching man in street - triggering by-election\n                 \n                  Sir David Amess's family 'betrayed and angry' as government refuse inquiry\n                 \n                  The Reform row: What has happened and what has been said?\n                 Nature restoration fund A new nature restoration fund will be introduced to allow developers to pay into larger environmental projects instead of funding single-site initiatives. The government is hoping to avoid a repeat of the £100m \"bat tunnel\" HS2 was required to build. 'Hundreds of pounds off energy bills for some' And for those living near new electricity pylons, they will get up to £250 a year off energy bills for 10 years, as well as community projects such as leisure facilities to encourage communities to host major infrastructure. Other consumers are likely to fund this through higher energy bills, however, the government expects this will only increase bills by a few pence per household when spread across the UK. Read more:Govt demands immediate housing plans from councilsCouncils to get £68m to build houses on brownfield sites  Many of the details have yet to be decided and will have to go to consultation - including how the bill discount scheme will work and which decisions will be made by planning officers, not councillors. One consultation will look at removing some organisations, such as the Theatres Trust and Sport England, from the list of bodies legally required to be consulted on planning decisions. What will happen to most controversial applications? Consultations will run alongside the legislative process to allow new measures to be implemented quickly once the bill is approved, housing minister Matthew Pennycook said. He also said decisions on \"the most significant and controversial\" applications would still be made by councillors. The Home Builders Federation welcomed the proposals, with chief executive Neil Jefferson saying they will be \"essential to getting more sites up and running\". However, the changes to environmental rules could prove contentious. Richard Benwell, chief executive of nature coalition Wildlife and Countryside Link, welcomed some of the changes but said more enforcement is needed to \"ensure that unsustainable development can never proceed without impunity\". He said: \"For nature recovery and development to go hand-in-hand, the bill should be strengthened with a guarantee that all planning decisions must be compatible with nature and climate targets, more protection for irreplaceable habitats and nature recovery areas, and new building regulations for biodiversity so that all infrastructure is wilder by design.\""
    },
    {
        "title": "Probe into police handling of missing person reports after Cardiff crash 'close to concluding'",
        "description": "The police watchdog says its investigation into police handling of missing person reports following a crash in Cardiff which left three young people dead is \"close to concluding\".",
        "url": "https://news.sky.com/story/probe-into-police-handling-of-missing-person-reports-after-cardiff-crash-close-to-concluding-13325952",
        "image_url": "https://e3.365dm.com/23/03/1920x1080/skynews-cardiff-car-crash-dead_6080202.jpg?20230306153623",
        "type": "UK",
        "Author": "Dan Whitehead",
        "Date Published": "2025-03-10 18:08:00",
        "Headline": "The Independent Office for Police Conduct (IOPC) says the investigation relating to the 2023 crash that left three people dead has been \"complex\" and \"resource intensive\".",
        "Content": "\n          West of England and Wales correspondent\n              @danwnews\n The police watchdog says its investigation into police handling of missing person reports following a crash in Cardiff which left three young people dead is \"close to concluding\". The Independent Office for Police Conduct (IOPC) says the investigation into the incident in March 2023 has been \"complex\" and \"resource intensive\". Driver Rafel Jeanne, 24, and passengers Darcy Ross and Eve Smith, both 21, died in the crash in the St Mellons area of the city on 4 March. Sophie Russon, 20, and Shane Loughlin, 32, were both injured but survived. The vehicle - a Volkswagon Tiguan - veered off a slip road approaching a roundabout at 2.03am before hitting trees. The five were not discovered until 6 March - around 46 hours after the crash took place. The IOPC launched an investigation into how police dealt with missing persons reports over that weekend. \n                  Police officer removed burglar's tag to have secret sexual relationship\n                 \n                  Man dies after being arrested by Border Force officers at Manchester Airport\n                 \n                  Police training in non-contact sexual offences welcomed by mother of murdered student Libby Squire\n                 In an update, it said it had conducted interviews \"at length\" with eight Gwent police officers, all of whom have been served with gross misconduct and misconduct notices. \"As part of our enquiries we have obtained and reviewed relevant policing policies and procedures including College of Policing Guidance on missing persons and risk assessments and have recorded in excess of 400 documents. \"We have collated nearly 100 statements as part of our enquiries and as well reviewing and analysing a substantial volume of police radio airwaves, audio calls and body worn video.\" He added: \"All this evidence has been carefully assessed and is being compiled into an overarching final report, to assist with the decision-making process. \"We are finalising our investigation as swiftly as possible while ensuring it is comprehensive and thorough. \"Our thoughts and sympathies remain with the families and friends of the young people who tragically lost their lives, those who were left seriously injured, and everyone affected by this incident.\""
    },
    {
        "title": "King Charles attends first Commonwealth Day service since cancer diagnosis",
        "description": "The King has made his first appearance at a Commonwealth Day service for two years - as the Royal Family celebrated the association's \"powerful influence for good in the world\".",
        "url": "https://news.sky.com/story/king-charles-attends-first-commonwealth-day-service-since-cancer-diagnosis-13325896",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-the-king-king-charles_6852296.jpg?20250310163623",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-10 16:16:00",
        "Headline": "Other attendees included Prime Minister Sir Keir Starmer and Conservative leader Kemi Badenoch, as well as singer-songwriter Geri Halliwell.",
        "Content": "The King has made his first appearance at a Commonwealth Day service for two years - as the Royal Family celebrated the association's \"powerful influence for good in the world\". The monarch joined the Queen, the Prince and Princess of Wales and the Princess Royal at the annual event at Westminster Abbey. It was his first appearance since 2023, after a cancer diagnosis forced him to postpone some public-facing duties throughout the last year.   In his message for this year's event - commemorating the 80th anniversary of the end of the Second World War - the King said restoring the \"disrupted harmony of our entire planet\" is humanity's most \"important\" task. The monarch added in his written address in a Commonwealth booklet: \"More than one and-a-half million men and women who served during the war came from across the Commonwealth to support the United Kingdom and its allies. \"On this special anniversary, we remember with particular pride and everlasting gratitude the untold sacrifice and selflessness of so many from around our family of nations who gave their lives in that dreadful conflict.\" Other attendees included Prime Minister Sir Keir Starmer and Conservative leader Kemi Badenoch, as well as singer-songwriter Geri Halliwell. Maltese author Leanne Ellul and Cameroonian activist Cynthia Wakuna both read in the Abbey during the service, and singer Joan Armatrading performed her song Love And Affection to cap proceedings. At the end, the congregation responded: \"We affirm our belief in the Commonwealth as a powerful influence for good in the world, and pledge ourselves to its service, now and for the future.\" Later, at Buckingham Palace, former Olympian Sir Chris Hoy was handed a baton by the monarch, officially starting the countdown towards the Glasgow 2026 Commonwealth Games. Read more from Sky News:US shares plunge as Trump refuses to rule out recessionNo UK plans for conscription, says minister It comes after the King shared a playlist of songs to mark Commonwealth Day, with a selection including tracks that have made it \"incredibly hard to sit still\". The monarch hosted a one-off radio programme from his office at Buckingham Palace - featuring hits from Bob Marley, Kylie Minogue, Grace Jones and contemporary artists Davido and Raye - in collaboration with Apple Music. Introducing Kylie's The Loco-Motion in the broadcast, the King said: \"This is music for dancing. Again, it has that infectious energy which makes it, I find, incredibly hard to sit still!\""
    },
    {
        "title": "Tower Bridge shut down after man scales railings",
        "description": "Tower Bridge was temporarily shut down after a person climbed up the railings.",
        "url": "https://news.sky.com/story/tower-bridge-shut-down-after-man-scales-railings-13325741",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tower-bridge-climb_6852002.jpg?20250310114906",
        "type": "UK",
        "Author": "Unknown",
        "Date Published": "2025-03-10 11:54:00",
        "Headline": "The bridge was closed to traffic and pedestrians and the public told to avoid the area during the incident.",
        "Content": " Tower Bridge was temporarily shut down after a person climbed up the railings. The incident saw the bridge in central London being \"closed to traffic and pedestrians\" with the public being urged to \"avoid the area where possible\". Firefighters attended the scene and raised a ladder so rescuers could communicate with the man, who was wearing a hooded top. Other reports said river traffic on the Thames had also been disrupted. Small crowds gathered near the bridge watching as the events unfolded. Less than two hours after reports of the incident first emerged, City Of London Police said the man had \"safely come down\" and the authorities would be reopening the bridge. The incident was first reported at the end of Monday morning. The man was back on the ground just before 1pm. The force said: \"The man has safely come down from the railings on Tower Bridge. \"The bridge will reopen shortly. Thank you for your patience.\" Monday's disruption comes after a man spent more than 16 hours perched on the Elizabeth Tower - which is home to Big Ben - in central London on Saturday. Westminster Bridge was closed to traffic during the incident as emergency services attended the scene and tourists gathered to watch. Daniel Day, 29, of Westcliff-on-Sea in Essex, appeared at Westminster Magistrates' Court on Monday charged with intentionally or recklessly causing a public nuisance and trespassing on a protected site. Commons speaker Sir Lindsay Hoyle has ordered a security review to ensure \"lessons are learnt\" following the incident, as he thanked those for helping to resolve it safely."
    },
    {
        "title": "The Reform row: What has happened and what has been said?",
        "description": "Senior members of Reform UK are embroiled in a bitter row  - with one of its MPs being suspended from the party.",
        "url": "https://news.sky.com/story/the-reform-row-what-has-happened-and-what-has-been-said-13325620",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-farage-nigel-rupert_6849285.jpg?20250307181945",
        "type": "UK",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-10 09:33:00",
        "Headline": "Sky News takes a look at how Rupert Lowe, the MP for Great Yarmouth, came to be suspended by the party, resulting in a public feud with leader Nigel Farage.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Senior members of Reform UK are embroiled in a bitter row  - with one of its MPs being suspended from the party. Rupert Lowe, the Reform MP for Great Yarmouth, lost the party whip over the weekend, meaning he will now sit as an independent MP in the Commons. It is a setback for party leader Nigel Farage, who has been on a mission to \"professionalise\" Reform as it seeks to capitalise on its position in the polls - which only a month ago gave the party a lead over Labour and the Conservatives for the first time. But how did the row start, and what now for Mr Lowe? Politics latest: Tearful daughter of murdered MP condemns government Alleged threats of physical violence Mr Lowe, the former chairman of Southampton Football Club, was suspended last week after Reform reported him to the police over alleged threats of physical violence towards the party's chairman, Zia Yusuf. A statement from Mr Yusuf and Lee Anderson, the chief whip, also said the party had received complaints from two female employees about alleged serious bullying in Mr Lowe's offices. Mr Lowe, who served as a member of the European Parliament for the Brexit Party, has strongly denied the allegations, calling the accusations of physical threats \"outrageous and entirely untrue\". He also referenced a \"vexatious complaint\" made by another staff member. Mr Yusuf and Mr Anderson claimed the Great Yarmouth MP had \"on at least two occasions made threats of physical violence against\" the former. \"It is with regret that we feel obligated to disclose that the party received complaints from two female employees about serious bullying in the offices of the member of parliament for Great Yarmouth, Rupert Lowe,\" they said in a joint statement. \"Evidence was provided to us of workplace bullying, the targeting of female staff who raised concerns, and evidence of derogatory and discriminatory remarks made about women, including reference to a perceived disability. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly. Accordingly, we appointed an independent King's Counsel to conduct an investigation into the veracity of these complaints. To date, Mr Lowe has yet to cooperate with this investigation. \"In addition to these allegations of a disturbing pattern of behaviour, Mr Lowe has on at least two occasions made threats of physical violence against our party chairman. Accordingly, this matter is with the police. \"Reform stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour, including within our own party.\" What has Mr Lowe said? In response to the allegations, Mr Lowe said on Friday the party leadership had a \"complete inability to accept even the most mild constructive criticism without such a malicious reaction\". In a statement posted on X, he wrote: \"I am disappointed, but not surprised, to read Reform's untrue and false allegations. Let me be abundantly clear - this investigation is based on zero credible evidence against me, as has been repeatedly stated by the neutral investigator. None has been provided. \"I have cooperated and spoken at length with the KC they instructed, at great cost to the party, to investigate a minor staff matter.\" In a further statement on X, Mr Lowe said: \"Ever since this malicious attack on my reputation was launched, all I have asked for from both Reform and the KC is the credible evidence against me.\" He said that \"none has been provided\" because \"there is no credible evidence against me\". He added: \"I will not have my name dragged through the mud as part of a political assassination because I dared to question Nigel Farage.\" By Liz Bates, political correspondent, and Josh Gafson, politics producer Claims of bullying against ex-Reform MP Rupert Lowe are \"nonsense\", according to a current staff member.  The woman, who asked not to be named, added he is a \"good man\" who is being subjected to a \"horrific and unfair\" ordeal. Another of his employees has now spoken out in his defence. They told Sky News: \"Rupert is a good man who does not deserve any of this. He has done nothing wrong.  \"The allegations aren't against Rupert. I've not seen any evidence of any bullying from anyone in Rupert's office. These claims are nonsense. \n \"This is wrong what they're doing to Rupert. He's nice to everybody.  \"What they're putting him through is horrific and unfair. They are vexatious complaints. There has never been any bullying in the office.\"\n A Reform UK spokesman said: \"Reform UK acted on serious allegations by two female members of Mr Lowe's team by appointing an independent KC to investigate. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly.\n \"Reform UK stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour.\" War of words Mr Lowe's statement suggests he believes he has been suspended from the party because he chose to criticise Mr Farage. 👉Listen to Politics At Jack And Sam's on your podcast app👈 In a recent interview with the Daily Mail, Mr Lowe said that while Mr Farage was a \"fiercely independent individual\" with \"messianic qualities\", that did not equate to \"sage leadership\". He added: \"I'm not going to be by Nigel's side at the next election unless we have a proper plan to change the way we govern from top to bottom,\" he said. He also said he was \"barely six months into being an MP\" and \"in the betting to be the next prime minister.\" Those words could have struck a nerve with Mr Farage after Elon Musk, the Tesla and Space X billionaire who has become one of Donald Trump's closest allies, suggested the Reform leader \"doesn't have what it takes\" and that Mr Lowe should take over. Mr Farage has brushed off the incident and in an article for the Daily Telegraph on Saturday claimed Mr Lowe's suspension was a result of \"inappropriate\" behaviour. 'Sense of unity has been dented' \"If the last general election taught us anything, it is that the public does not like political parties that engage in constant infighting,\" Mr Farage wrote. \"Now, thanks to one of our MPs, Rupert Lowe, unloading a barrage of criticisms against our operations and its main actors, that sense of unity has been dented.\" Mr Farage went on to claim that Mr Lowe had \"managed to fall out with all his parliamentary colleagues in one way or another\", adding: \"We did our best to keep a lid on things but, in the end, containment strategies invariably fail.\" He then referred to a Commons clash with transport minister Mike Kane just before Christmas after Mr Lowe staged a debate about a damaged ship containing toxic cargo docked in his Great Yarmouth constituency. \"Mr Lowe was unhappy with the answer that he received from Mr Kane and, at the end of the debate, he crossed the floor to make his feelings known,\" Mr Farage wrote. Read more politics news:Sir David Amess's daughter criticises inquiry decisionSenior civil servants to have pay linked to performance \"A confrontation ensued. Heated language was heard. The minister's shoulder was pushed. In the end, the Serjeant at Arms had to step in to calm things down between the two parliamentarians.\" He added: \"Yet the fact is that, sadly, there have been too many similar outbursts from Mr Lowe, often involving the use of inappropriate language, to the despair of our chief whip, Lee Anderson. \"I have been surprised and saddened at this behaviour.\" On bullying allegations, Mr Farage said Reform was a \"responsible political party\" that had a \"duty of care to every single member of staff, whether they are employed by us directly or indirectly\". As a result, he said a lawyer had been appointed to conduct an independent inquiry into the allegations. Reform's deputy leader Richard Tice said it was \"right and proper\" that the KC had been appointed to conduct an investigation. Speaking on Sky News' Sunday Morning with Trevor Phillips, he said: \"We've also got a duty of care as a party, whether people are employed directly or indirectly. So, that's why the chairman has instructed an independent investigation by a KC, that's the right and proper thing to do. That will run its course.\"  'Correcting' the record In his own Telegraph article, Mr Lowe repeated the claim he made on X that there was no credible evidence against him and he was removed from the party before any investigation had started. He called his treatment by the party a \"witch hunt\" and said he had been \"entirely frozen out of the Reform machine over the last few months, in a deliberate and calculated way\". However, the lawyer appointed to investigate the claims against Mr Lowe - who has remained anonymous - has denied saying they were \"shocked\" about the party's process. The lawyer said \"I have seen a number of statements made by Mr Lowe MP which are attributed to me and which describe my reactions to the process conducted by the party into the allegations made against both Mr Lowe and his constituency manager.\" \"I find myself in the unfortunate and regrettable position of having to make this statement to correct the record. I have not expressed either 'dismay' or 'shock' at any time as to the process. \"Nor have I said 'there is zero credible evidence against [Mr Lowe]', let alone said this 'repeatedly'.\""
    },
    {
        "title": "Volodymyr Zelenskyy arrives in Saudi Arabia ahead of US-Ukraine meeting - as Marco Rubio says Kyiv should be 'prepared to do difficult things'",
        "description": "Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-arrives-in-saudi-arabia-ahead-of-us-ukraine-meeting-13325920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-volodymyr-zelenskyy_6852331.jpg?20250310172041",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-10 17:07:00",
        "Headline": "US secretary of state Marco Rubio is also in Saudi Arabia - but is not due to meet the Ukrainian president.",
        "Content": " Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday. Mr Zelenskyy will not be at the meeting with US secretary of state Marco Rubio, but Mr Zelenskyy's team will try to improve relations following his disastrous 28 February visit to Washington, which descended into an Oval Office argument with President Donald Trump and vice president JD Vance. Follow latest updates on Ukraine and Trump Mr Zelenskyy briefly met Crown Prince Mohammed bin Salman on Monday, after the end of the daily fast during the Muslim holy month of Ramadan. US secretary of state Marco Rubio is also in Jeddah. He is not due to meet Mr Zelenskyy - but he held talks with Prince Mohammed to discuss Yemen and threats to ships from Houthis, Syria, and the reconstruction of Gaza. During talks on Tuesday the Ukrainian team will try to convince the US to restore military aid and intelligence that had helped Kyiv since Russia's full-scale invasion of Ukraine in 2022. Speaking to reporters while travelling to Jeddah, Mr Rubio said if Ukraine and the US reach an understanding acceptable to Mr Trump, that could accelerate his administration's push to peace talks. \n                  US shares drop sharply after Trump refuses to rule out recession\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  How will Canada's new PM take on Donald Trump?\n                 \"What we want to know is, are they interested [in] entering some sort of peace conversation and general outlines of the kinds of things they could consider, recognising that it has been a costly and bloody war for the Ukrainians,\" Mr Rubio said. \"They have suffered greatly and their people have suffered greatly. And it's hard in the aftermath of something like that to even talk about concessions, but that's the only way this is going to end and prevent more suffering.\"  He said: \"I'm not going to set any conditions on what they have to or need to do. I think we want to listen to see how far they're willing to go and then compare that to what the Russians want and see how far apart we truly are.\" He added: \"The most important thing that we have to leave here with is a strong sense that Ukraine is prepared to do difficult things, like the Russians are going to have to do difficult things to end this conflict.\" Meanwhile, British prime minister Sir Keir Starmer spoke to Mr Trump on Monday ahead of the US-Ukraine meeting. Read more:How Trump has upended millions of lives in his first 50 daysTrump says Ukraine 'may not survive' war against RussiaRating the president's second term so far A Downing Street readout of the call said that Sir Keir told the president that \"UK officials had been speaking to Ukraine officials over the weekend and they remain committed to a lasting peace\". \"The prime minister said he hoped there would be a positive outcome to the talks that would enable US aid and intelligence sharing to be restarted,\" the statement said. \"The two leaders also spoke about the economic deal they had discussed at the White House and the prime minister welcomed the detailed conversations that had already happened to move this forward. Both leaders agreed to stay in touch.\" The European Union agreed last week to boost the continent's defences and free up hundreds of billions of euros for security in response to the Trump administration's shift in policy towards Ukraine. A US intelligence official said a pause on sharing US intelligence that can be used for offensive purposes by Ukrainian forces remains in effect. The official suggested that progress could be made towards reinstating intelligence sharing with Ukraine during the Saudi talks."
    },
    {
        "title": "Syria's government signs breakthrough deal with Kurdish-led Syrian Democratic Forces",
        "description": "Syria's interim government has signed a deal with the Kurdish-led authority that controls the country's oil-rich northeast.",
        "url": "https://news.sky.com/story/syrias-government-signs-breakthrough-deal-with-kurdish-led-syrian-democratic-forces-13326020",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-syria-ahmad-al-sharaa_6852578.jpg?20250310212545",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:28:00",
        "Headline": "The deal - to be implemented by the end of the year - would bring all border crossings with Iraq and Turkey, airports and oil fields in the northeast under the central government's control.",
        "Content": " Syria's interim government has signed a deal with the Kurdish-led authority that controls the country's oil-rich northeast. The agreement - which includes a ceasefire and the merging of Syrian Democratic Forces (SDF) there into the Syrian army - will bring most of the nation under the control of the government. The government is currently led by Islamist group Hayat Tahrir al Sham, which helped to topple president Bashar al Assad in December. Recent clashes have seen more than 1,000 people killed amid violence between government supporters and those thought to be loyal to the ousted leader. On Monday, the deal was signed by interim president Ahmad al Sharaa and Mazloum Abdi, the commander of the US-backed SDF. The deal - to be implemented by the end of the year - would bring all border crossings with Iraq and Turkey, airports and oil fields in the northeast under the central government's control. Prisons, where about 9,000 suspected members of the Islamic State group are being held, are also expected to come under government control. \n                  Syria's new government vows to investigate mass killings\n                 \n                  'They left nobody': More than 1,000 people killed in some of Syria's deadliest violence\n                 \n                  Syria: 'Nearly 200 killed' in country's worst violence since Assad toppled\n                 Syria's Kurds will gain their \"constitutional rights\" including using and teaching their language, which were banned for decades under Mr Assad. Hundreds of thousands of Kurds who were displaced during Syria's nearly 14-year civil war will return to their homes. The deal will also allow all Syrians to be part of the political process, no matter their religion or ethnicity. Syria's new rulers are struggling to exert their authority across the country and reach political settlements with other minority communities, notably the Druze in southern Syria. Earlier in the day, the government announced the end of the military operation against insurgents loyal to Mr Assad and his family in the worst fighting since the end of the civil war.  The defence ministry's announcement came after a surprise attack by gunmen from the Alawite community on a police patrol near the port city of Latakia on Thursday spiralled into widespread clashes across Syria's coastal region. The Assad family are Alawites. Read more from Sky News:How Trump upended millions of lives in first 50 days in officeZelenskyy in Saudi Arabia ahead of US-Ukraine meeting Defence ministry spokesperson Colonel Abdel-Ghani said security forces will continue searching for sleeper cells and remnants of the insurgency of former government loyalists. Though the government's counter-offensive was able to mostly contain the insurgency, footage surfaced of what appeared to be retaliatory attacks targeting the broader minority Alawite community, an offshoot of Shia Islam whose adherents live mainly in the western coastal region. The Syrian Observatory for Human Rights, a Britain-based war monitoring group, said 1,130 people were killed in the clashes, including 830 civilians. The interim president said the retaliatory attacks against Alawite civilians and mistreatment of prisoners were isolated incidents, and vowed to crack down on the perpetrators as he formed a committee to investigate."
    },
    {
        "title": "How Donald Trump has upended millions of lives in his first 50 days in office",
        "description": "In just 50 days, Donald Trump has upended our world. He has ripped up rules, attacked allies and sided with enemies.",
        "url": "https://news.sky.com/story/how-donald-trump-has-upended-millions-of-lives-in-his-first-50-days-in-office-13323230",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6851879.jpg?20250310102046",
        "type": "World",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-10 04:00:00",
        "Headline": "With 83% of US aid contracts cut, Trump's first 50 days in office has upended millions of lives around the world - with one health worker comparing his actions to biological warfare.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  In just 50 days, Donald Trump has upended our world. He has ripped up rules, attacked allies and sided with enemies. A country we thought for decades had our backs is no longer a reliable partner. We travelled thousands of miles to ask what that means for our lives and millions of others - from the sweltering backstreets of Africa to the frozen wastes of Greenland and Finland's tense border with Russia. Donald Trump's supporters at home and abroad see him as the disruptor-in-chief who will bring peace and prosperity, putting America first. But to many others we found he threatens chaos and a far darker future. While Mr Trump may be challenging convention and bringing fresh thinking, his critics say he is moving too fast and erratically. His first 50 days in office, they claim, have weakened America's place in the world and that will be exploited by rivals. Risk of resurgent epidemics in Kenya We went first to Kenya. The focus in the West may have been on Mr Trump and Russia but in the developing world, it's the end of US aid that is grabbing the headlines. On the frontlines of Africa's war on HIV we heard Mr Trump's actions being compared to an act of \"biological warfare\". Even among allies and admirers of the American president, there is deep unease and fear about what could come next, most of all the risk of resurgent epidemics of diseases like HIV, TB, malaria, ebola, and polio. In one of Kenya's poorest neighbourhoods in Nairobi, we joined health workers on their rounds, down sewage-filled alleyways into cramped, overcrowded buildings. In a one-room home, we met a young mother who is dependent on American aid. Anne is HIV positive and needs daily medication and nutritional support for both herself and her one-year-old son. She is terrified for their future because of the cut in US aid. \"I'm so worried,\" she told us, \"because if it carries on like this the medication could run out. When the medicine is not there, the protector of my body is not there, so anything can just pass through me.\" 'We had no warning' Kenya received $850m (£658m) in aid a year and that has now been abruptly severed. A US Supreme Court decision against the Trump administration may restore some of that but there is complete uncertainty about what happens next. Martha, a healthcare manager in Nairobi, spelled out what is at stake: \"We had no warning. We could not prepare the households. It was so sudden. \"We expect more death. We expect more children to die before the age of five. We expect more death for children living with HIV and it is going to be bad,\" Martha said, adding that more than 20,000 children who use her organisation's services will be affected. 83% of all US aid contracts cut The Trump administration says the aid has been only been suspended for 90 days pending a review. But in reality, many key programmes appear to have been shut down completely. After a 45-minute flight west of Nairobi to Kisumu, we saw what is happening away from big cities. The impact seemed just as severe. At one provincial hospital US Agency for International Development (USAID) signs were everywhere but on doors that are now shut. It had been a hub for patients to receive their treatment but that's now in doubt. Staff told us there were just two months of supplies left for some medication, and less than a month for others, because there have been no more deliveries. Patients were stockpiling drugs, said doctors, panicking for the future. 'Biological warfare' The US-supplied ammunition for Africa's war against HIV, malaria, TB and other diseases is running out. It has taken decades and billions to bring them under control. The fear is of a return to epidemics not seen for years. Eric Okioma is HIV positive and runs a charity helping others with the disease in Kisumu. \"When you look at it from a public health aspect, that's biological warfare that's the way I'm seeing it because from a human rights perspective, he did the wrong thing - he should not have taken it abruptly.\" Mr Trump is popular among many in Kenya. His conservative stance on issues like gender and sexuality resonates in this predominantly Christian country. But even among admirers and supporters there is deep unease about his aid cut. Peter Gunday, a father and churchgoer, told us he agreed Kenya should be less dependent on US aid and encouraged to provide for itself - but Mr Trump's action had been too sudden. \"He wants to make America great again... [but give an] olive branch to us even if it is only for some time.\" The aid cut threatens lives and America's standing in the world. The US has used aid to wield soft power and influence. Read more:US aid crisis leaves South Africans living with HIV in turmoilWhat is USAID? America in retreat Its superpower rival China prefers building. They have lent billions for massive infrastructure projects like the new railway from Nairobi to the coast through the heart of the city's safari park. For Beijing it's all leverage, applied ruthlessly to increase access to Africa's abundant natural resources. Under Trump, America is unilaterally deserting that battle for power and influence. Its values and interests will inevitably suffer. Not so much America first but America in retreat. Finland prepares for Russian aggression Closer to home, it is America's shift on security causing the greatest concern. We flew thousands of miles north to one of NATO's newest member countries that sits on a border with Russia. What did people in Finland make of what Mr Trump is doing to the Western alliance they have only just joined? We filmed with Finland's military on the border with Russia that was closed because of the war in Ukraine. In sparsely populated woods, locals report sightings of Russian drones, we were told. And there has been a surge in recruits to the border guard because of the international situation. One of them, Aku Jaeske, told us he had joined up \"for the defence of our own country\". He said: \"I think most of us, I think, are here because of that. It's really hard if we have a 1,300 and something kilometre border with Russia - it's pretty long - we have to have good men there.\" 'Bring it on', says one Finn What did he make of Mr Trump and what he saw on the news? \"I think it's crazy when you turn your TV on today, you can't know what is really happening.\" The war with Ukraine and Russia's belligerence has sparked a boom in shooting, with hundreds of new ranges opening up in Finland to meet demand. In a range outside Helsinki, one shooting enthusiast Jerkri told us what he thought was behind its growing popularity. \"The situation in Ukraine and people are noticing that maybe [they are] having to take care of themselves... think about it.\" Amateur shooters go through their paces, crisscrossing an open range at speed firing at targets dotted around the room. Patrick said he was worried by the direction of events. \"But if it did come to it... bring it on,\" he said. In a service station, Finland's most popular tabloid had the headline, \"Trump's 10 gifts to Putin.\" Finns were once a byword for peace-loving neutrality. They are arming up now, and watching Mr Trump's overtures to the Kremlin warily. Finland after all is where Mr Trump stood next to Russian President Vladimir Putin during his first term in office and infamously said he would believe him over the word of US spy agencies. US may be deserting the West The Finns know from their history a belligerent Russia cannot be trusted. In Europe, the US is not just withdrawing under Donald Trump, who says the US cannot prioritise the continent's security any longer. It looks like it may be changing sides deserting the West entirely: Cutting off aid and intelligence to Ukraine while it is pummelled by Russian rockets and drones; branding Ukraine's leader - and not the tyrant of Moscow - a dictator; attacking close allies with tariffs; resetting relations with Russia while it continues to invade a part of Europe. 'Trump is ridiculous', Greenlanders say And threatening to take over its neighbours. Our journey ended in Greenland, top of the list of Mr Trump's planned acquisitions. Most people we spoke to were genuinely worried by him. Students Aviana and Julie told us Mr Trump's antics were alarming. \"That's very scary actually - it seems he's more with Russia than Ukraine. I'm really scared.\" Another passerby said Mr Trump had no right to make a play for their homeland. They said: \"I think it's ridiculous that he thinks he can just take our land. We don't have the resources to fight against the USA.\" Jurgen Boassen has become a well-known figure for having opposing views - he is outspokenly pro-Trump. \"I think he is a great man who wants to have peace in the world,\" he told us. 'Europe is failing' He admits he is paid by MAGA groups in America to promote \"cultural ties\" and believes Greenland will gradually come around to the idea of becoming closer to America. \"I don't care because they will realise I'm doing the good thing for Greenland. Europe is failing, Britain, Sweden, Belgium, Holland even Germany,\" he said. Wherever we travelled people seemed in shock. America used to believe helping others was good for America - keeping the peace in Europe, saving lives, or protecting the sovereignty of neighbours. Read more:Why does Trump want Greenland?85% of Greenlanders oppose joining US, poll finds The fear is under President Trump it is just out for itself. The idea Mr Trump could carve up the world into spheres of influence with other authoritarian leaders seems plausible. If that is the case, lesser nations like Greenland may have plenty to fear. From what we were told on our journey, Donald Trump's America First foreign policy risks the lives of millions, the security and sovereignty of allies, and America's own place in the world while potentially strengthening its enemies."
    },
    {
        "title": "Surprise strike at Hamburg Airport as major walkout set to begin at 12 more German hubs",
        "description": "More than 40,000 people have been hit by a surprise strike that shut Hamburg Airport - and more than 500,000 could be disrupted today as the walkout spreads across Germany.",
        "url": "https://news.sky.com/story/surprise-strike-at-hamburg-airport-as-major-walkout-set-to-begin-at-12-more-german-hubs-13325529",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-hamburg-airport-strike_6851706.jpg?20250310051600",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-10 04:27:00",
        "Headline": "Staff at German airports are set to begin a walkout that could ground thousands more flights on Monday - after only 10 of more than 280 departures and arrivals went as planned on Sunday.",
        "Content": "More than 40,000 people have been hit by a surprise strike that shut Hamburg Airport - and more than 500,000 could be disrupted today as the walkout spreads across Germany. The strike reportedly began with just half an hour notice yesterday morning, with passengers told to stay away and terminals and check-in desks eerily quiet. The airport said only 10 of more than 280 departures and arrivals went as planned on Sunday. It posted on X: \"Without any notice, the union #verdi has called on the services at Hamburg Airport to go on strike immediately, Sunday 9 March. \"For this reason, the airport is closed and there will be no departures or arrivals all day.\" An airport spokesperson said the action by the ver.di union was \"dishonourable\" and \"unfair to tens of thousands of travellers who have nothing to do with the disputes\". Travellers have been advised to contact their airline. The disruption is set to worsen significantly today when a pre-planned strike takes place for 24 hours at 13 German airports, including Berlin, Frankfurt, Dusseldorf, Stuttgart, Hanover, Munich and Cologne. More than half a million people could be affected and 3,400 flights cancelled, according to ADV, the German Airport Association. \"Germany's air traffic will be largely shut down on Monday,\" it said in a statement last week. Read more from Sky News:Syria vows to investigate mass killingsCanada names new prime minister The strike at Hamburg, Germany's second biggest city, is scheduled to continue. Thousands of security staff who screen passengers and cargo are taking the action over pay and conditions in a new contract. Union official Lars Stubbe said it was vital the strikes caused \"economic damage\" to force concessions from bosses. \"We know that it is a massive burden for passengers,\" he said. \"Our colleagues know that too. But they have said we have to go on strike. It must be effective, so that we have a reasonable offer to negotiate.\""
    },
    {
        "title": "Donald Trump calls detained Palestinian student activist Mahmoud Khalil 'anti-American' - and warns of further arrests",
        "description": "Donald Trump says a Palestinian student activist detained by federal immigration agents is \"anti-American\".",
        "url": "https://news.sky.com/story/donald-trump-calls-detained-palestinian-student-activist-mahmoud-khalil-anti-american-and-warns-of-further-arrests-13326033",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mahmoud-khalil-columbia-university_6852642.jpg?20250310222519",
        "type": "World",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:49:00",
        "Headline": "Mahmoud Khalil, a graduate student at Columbia University, has been a prominent figure in the university's pro-Palestinian protest movement. He was detained at his Columbia apartment building in Manhattan on Saturday evening.",
        "Content": " Donald Trump says a Palestinian student activist detained by federal immigration agents is \"anti-American\". Mahmoud Khalil, a postgraduate student at Columbia University's school of international and public affairs, has been a prominent figure in the university's pro-Palestinian student protest movement. A federal judge in New York City ordered for Mr Khalil not be deported on Monday while the court considers a lawsuit challenging his detention. A hearing was scheduled for Wednesday.   Mr Khalil was detained at his Columbia apartment building in Manhattan in front of his wife, a US citizen who is eight months pregnant, on Saturday evening. Agents from the Department of Homeland Security (DHS) told him his student visa had been revoked but Mr Khalil has held a US permanent residency green card since 2024, his lawyer Amy Greer said. The Trump administration has not said what Mr Khalil is accused of or if he has been charged with a crime. He has since been moved to a federal jail for migrants in Louisiana to await deportation proceedings, according to a US detainee database. Lawyers for the student have started a legal challenge against his arrest. In a post on Truth Social, Mr Trump said: \"ICE [Immigration and Customs Enforcement] proudly apprehended and detained Mahmoud Khalil, a Radical Foreign Pro-Hamas Student on the campus of Columbia University.\" The US president said Mr Khalil's arrest was the \"first arrest of many to come\". 👉 Follow Trump 100 on your podcast app 👈 \"This is the first arrest of many to come. We know there are more students at Columbia and other Universities across the Country who have engaged in pro-terrorist, anti-Semitic, anti-American activity, and the Trump Administration will not tolerate it,\" he said. \"Many are not students, they are paid agitators. We will find, apprehend, and deport these terrorist sympathisers from our country - never to return again.\" \"If you support terrorism, including the slaughtering of innocent men, women, and children, your presence is contrary to our national and foreign policy interests, and you are not welcome here. We expect every one of America's Colleges and Universities to comply,\" the president added. Students say federal immigration agents have been spotted at student housing around Columbia's Manhattan campus since Thursday, a day before the Trump administration announced it was cancelling $400m (£310.7m) in federal grants and contracts awarded to the university. Read more:How Trump has upended millions of lives in his first 50 daysRating the president's second term so far The federal agents have been trying to detain a second international student, according to the Student Workers of Columbia labour union. Mr Trump has singled out Columbia's handling of the protests since returning to the White House, saying the university has allowed antisemitic harassment \"on and near\" its campus. Mr Khalil and other activists from Columbia University Apartheid Divest said Jewish students were among the organisers, and say their criticism of Israel and its US government support is being wrongly conflated with antisemitism. In the wrongful detention challenge filed in the Manhattan federal court on Sunday. Ms Greer said Mr Khalil's arrest was motivated by his \"criticism of US institutions that support Israel\", which she said was free speech protected by the US constitution's first amendment. \"Even the threat of detention and deportation has a chilling effect on speech,\" Ms Greer wrote. It is unclear when Mr Khalil will have a hearing in an immigration court, which is typically the first step in the deportation process. Spokespeople for ICE and DHS did not provide details about his case on Monday. Typically, expelling a person who has permanent residency in the US requires a high bar, such as that person being convicted of certain types of crimes. In January, Mr Trump signed an executive order calling on the Department of Justice to \"investigate and punish anti-Jewish racism in leftist, anti-American colleges and universities\"."
    },
    {
        "title": "US shares drop sharply after Trump refuses to rule out recession",
        "description": "US shares fell sharply again on Monday amid uncertainty in the American economy, with President Donald Trump refusing to rule out a recession.",
        "url": "https://news.sky.com/story/us-shares-drop-sharply-after-trump-refuses-to-rule-out-recession-13326030",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trader-stock-market_6852619.jpg?20250310220527",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:33:00",
        "Headline": "Tesla shares plunge by at least 15% to $222 - meaning it has lost more than half its value since December while the tech-heavy Nasdaq Composite closes down more than 4%.",
        "Content": "US shares fell sharply again on Monday amid uncertainty in the American economy, with President Donald Trump refusing to rule out a recession. Tesla shares plunged by at least 15% to $222 - meaning it has lost more than half its value since its peak at $479.86 on 17 December. But Elon Musk said on X that \"it will be fine long-term\". The tech-heavy Nasdaq Composite closed down more than 4% on Monday while the S&P 500 slumped about 2.7% - its biggest daily percentage drop since 18 December. The CBOE Volatility Index, often dubbed Wall Street's \"fear gauge\", surged over 3.6 points to hit 27, marking its highest level since 18 December. Airlines and other companies that need US shoppers feeling confident enough to spend also saw sharp losses. Bitcoin fell below $79,000 from more than $100,000 in December, with richly valued US tech stocks bearing the brunt of the recent sell-off on Wall Street. Financial markets have been volatile in recent weeks as rising trade tensions - with tariffs of up to 25% against goods from Canada and Mexico - and signs of slowing US economic growth weighed on consumer confidence and business activity. China has also been targeted with tariffs and the European Union could be next, from 2 April, when Mr Trump has promised to ramp up his \"America first\" ambitions. China's retaliatory tariffs on select US imports are set to take effect on Monday, with US tariffs on certain base metals anticipated later in the week.  Read more:An A-Z of Trump's first 50 days in officeWhat's gone wrong at Musk's Tesla?'Common error' could leave thousands out of pocket Asked directly in a Fox News interview on Sunday whether he was expecting a recession, Mr Trump did not deny the possibility. He said: \"I hate to predict things like that. There is a period of transition because what we're doing is very big, we're bringing wealth back to America. That's a big thing. And there are always periods of - it takes a little time. It takes a little time.\" 👉 Follow Trump 100 on your podcast app 👈 In an interview on Monday, Kevin Hassett, who heads the US National Economic Council, said there were many reasons to be optimistic about the US economy, despite some predictions of a contraction in GDP in the first quarter and concerns about inflation. \"There are a lot of reasons to be extremely bullish about the economy going forward. But for sure, this quarter, there are some blips in the data,\" Mr Hassett said, saying those stemmed from both timing effects of Mr Trump's rapid-fire tariffs push and some of what he called the \"Biden inheritance\". The president and his team have repeatedly bashed the economy that they inherited from Joe Biden. But when Mr Trump took office in January, GDP growth had largely exceeded trend for two years, consumer spending was strong and unemployment was still near historic lows."
    },
    {
        "title": "What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further",
        "description": "Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla.",
        "url": "https://news.sky.com/story/teslas-share-price-losing-streak-is-musks-trump-role-distracting-him-from-his-day-job-of-running-ev-maker-13325824",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250212051115",
        "type": "US",
        "Author": "Ian King",
        "Date Published": "2025-03-10 14:32:00",
        "Headline": "Tesla saw its shares peak in December, but since then more than $800bn has been wiped from its stock market value with suggestions of further falls.",
        "Content": "\n          Business presenter\n              @iankingsky\n Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla. Shares of Elon Musk's electric vehicle maker have fallen for seven straight weeks, the longest losing streak since the company floated on the stock market 15 years ago, wiping out all of the gains it enjoyed after Mr Trump was elected US president in November last year. Money blog latest On Monday, the Tesla share price plunged by at least 15% to $222. Since the price peaked at $479.86 on 17 December, it has fallen by over half, wiping more than $800bn from its stock market value. To put it in context, that sum is roughly equivalent to Poland's annual economic output. And there may be worse to come. Wall Street analysts have been rushing to downgrade Tesla stock. A quarter of the 40 brokerages covering the stock currently rate it a \"strong sell\", suggesting there could be further falls to come. Reasons for share price drop There are a number of reasons behind the drop. Those who deplore Mr Musk's political views and his close proximity to the Trump administration will doubtless cite this as the key factor. It has certainly played a part. Mr Musk's recent antics, such as wielding a chainsaw on stage at a recent political conference and making a gesture on stage that some interpreted as a Nazi salute, have not endeared him or his companies to a swathe of the public both in the US and beyond. There have been protests and outbreaks of vandalism at Tesla dealerships and EV charging points across the US while, in both Europe and China, Tesla orders in January were down 45% year on year. Admittedly, a lot of the people staging protests at Tesla properties are unlikely to have been would-be buyers of the company's products, but the bigger problem is that Mr Musk now appears to be alienating customers who were previously loyal to the brand - as shown by the popularity, in the US, of Tesla bumper stickers with messages such as \"I bought this before Elon went crazy\" and \"Anti-Elon Tesla Club\".  Is Musk distracted? Conversely, some investors who wholly approve of the work Mr Musk is doing for the Trump administration may also have concerns, notably that it is proving too much of a distraction from the day job of running Tesla. Even before Mr Musk took the wheel at the US Department Of Government Efficiency (DOGE), there were already fears that he was being too distracted by his private companies, including the social media platform X, the aerospace and defence contractor SpaceX and his artificial intelligence business xAI. X, on which lies peddled by the Kremlin about Ukraine are regularly amplified, may also be adding to the damage being done to the Tesla brand. But Mr Musk's association with the Trump administration is only part of the reason for the recent declines. Tesla shares could have been over-priced Another key factor is that shares of Tesla were arguably over-priced to begin with. In the two weeks following the US presidential election, Tesla shares shot up by 32%, adding $250bn to its stock market value. To put that into context, that gain was equal to the entire stock market value of Toyota, the world's next biggest carmaker after Tesla. At the time its shares peaked, Tesla shares were trading at 112 times expected earnings, compared with the 25 times or so that the S&P 500 was trading at and higher even than the company's average over the last five years of 93. Again, to put things in context, Ford shares are valued at just eight times prospective earnings. That exotic rating reflected the superlative growth prospects previously accorded to Tesla, in particular Mr Musk's pledges to launch a new cut-price electric vehicle and a fully autonomous ride-hailing service. Competition from China But investors are now reappraising those growth prospects as Tesla loses share of the electric vehicle market to rivals, such as China's BYD, which is also seen as outpacing the company on self-driving vehicle technology. News on Tesla's planned new low-cost model remains elusive and, until it is launched, critics believe it has little hope of building share in burgeoning markets such as India. Mr Musk always wanted Tesla to be seen as an AI and robotics company rather than an electric vehicle maker and that was part of the bull case for the stock. Yet there are now fears that the company is investing too much in such projects and on its much-criticised Cybertrucks. Another concern is that Tesla's core operations may be misfiring. Read more from Sky News:Trump dodges US recession question'Canada will never be part of the US'  Results published at the end of January revealed that operating profits for the final three months of 2024 were down 23% on the same period a year earlier - which Tesla blamed on lower average selling prices on each of its Model 3, Model Y, Model X and Model S lines. For the full year, deliveries of new vehicles were down on 2023, the first year-on-year fall the company has suffered. And the operating margins, partly reflecting the sums Tesla is investing, were also lower. It all adds up to an unpleasant cocktail for investors."
    },
    {
        "title": "Donald Trump calls detained Palestinian student activist Mahmoud Khalil 'anti-American' - and warns of further arrests",
        "description": "Donald Trump says a Palestinian student activist detained by federal immigration agents is \"anti-American\".",
        "url": "https://news.sky.com/story/donald-trump-calls-detained-palestinian-student-activist-mahmoud-khalil-anti-american-and-warns-of-further-arrests-13326033",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-mahmoud-khalil-columbia-university_6852642.jpg?20250310222519",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:49:00",
        "Headline": "Mahmoud Khalil, a graduate student at Columbia University, has been a prominent figure in the university's pro-Palestinian protest movement. He was detained at his Columbia apartment building in Manhattan on Saturday evening.",
        "Content": " Donald Trump says a Palestinian student activist detained by federal immigration agents is \"anti-American\". Mahmoud Khalil, a postgraduate student at Columbia University's school of international and public affairs, has been a prominent figure in the university's pro-Palestinian student protest movement. A federal judge in New York City ordered for Mr Khalil not be deported on Monday while the court considers a lawsuit challenging his detention. A hearing was scheduled for Wednesday.   Mr Khalil was detained at his Columbia apartment building in Manhattan in front of his wife, a US citizen who is eight months pregnant, on Saturday evening. Agents from the Department of Homeland Security (DHS) told him his student visa had been revoked but Mr Khalil has held a US permanent residency green card since 2024, his lawyer Amy Greer said. The Trump administration has not said what Mr Khalil is accused of or if he has been charged with a crime. He has since been moved to a federal jail for migrants in Louisiana to await deportation proceedings, according to a US detainee database. Lawyers for the student have started a legal challenge against his arrest. In a post on Truth Social, Mr Trump said: \"ICE [Immigration and Customs Enforcement] proudly apprehended and detained Mahmoud Khalil, a Radical Foreign Pro-Hamas Student on the campus of Columbia University.\" The US president said Mr Khalil's arrest was the \"first arrest of many to come\". 👉 Follow Trump 100 on your podcast app 👈 \"This is the first arrest of many to come. We know there are more students at Columbia and other Universities across the Country who have engaged in pro-terrorist, anti-Semitic, anti-American activity, and the Trump Administration will not tolerate it,\" he said. \"Many are not students, they are paid agitators. We will find, apprehend, and deport these terrorist sympathisers from our country - never to return again.\" \"If you support terrorism, including the slaughtering of innocent men, women, and children, your presence is contrary to our national and foreign policy interests, and you are not welcome here. We expect every one of America's Colleges and Universities to comply,\" the president added. Students say federal immigration agents have been spotted at student housing around Columbia's Manhattan campus since Thursday, a day before the Trump administration announced it was cancelling $400m (£310.7m) in federal grants and contracts awarded to the university. Read more:How Trump has upended millions of lives in his first 50 daysRating the president's second term so far The federal agents have been trying to detain a second international student, according to the Student Workers of Columbia labour union. Mr Trump has singled out Columbia's handling of the protests since returning to the White House, saying the university has allowed antisemitic harassment \"on and near\" its campus. Mr Khalil and other activists from Columbia University Apartheid Divest said Jewish students were among the organisers, and say their criticism of Israel and its US government support is being wrongly conflated with antisemitism. In the wrongful detention challenge filed in the Manhattan federal court on Sunday. Ms Greer said Mr Khalil's arrest was motivated by his \"criticism of US institutions that support Israel\", which she said was free speech protected by the US constitution's first amendment. \"Even the threat of detention and deportation has a chilling effect on speech,\" Ms Greer wrote. It is unclear when Mr Khalil will have a hearing in an immigration court, which is typically the first step in the deportation process. Spokespeople for ICE and DHS did not provide details about his case on Monday. Typically, expelling a person who has permanent residency in the US requires a high bar, such as that person being convicted of certain types of crimes. In January, Mr Trump signed an executive order calling on the Department of Justice to \"investigate and punish anti-Jewish racism in leftist, anti-American colleges and universities\"."
    },
    {
        "title": "Elon Musk calls US senator Mark Kelly 'a traitor' for visiting Ukraine - as Democrat fires back",
        "description": "A US senator has hit back at Elon Musk, saying the billionaire Trump adviser is \"not a serious guy\" after he branded the politician a \"traitor\" for visiting Ukraine.",
        "url": "https://news.sky.com/story/elon-musk-calls-us-senator-mark-kelly-a-traitor-for-visiting-ukraine-as-democrat-fires-back-13326079",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-washington-elon-musk_6827946.jpg?20250213175145",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-10 22:11:00",
        "Headline": "Senator Mark Kelly - a former US navy pilot - visited Kyiv earlier in March and met with wounded service members and Ukrainian officials. Posting on X, Elon Musk called the Democrat a \"traitor\" for making the trip.",
        "Content": "A US senator has hit back at Elon Musk, saying the billionaire Trump adviser is \"not a serious guy\" after he branded the politician a \"traitor\" for visiting Ukraine. Mark Kelly, the Democrat senator for Arizona and a former US navy combat pilot, made his third visit to Kyiv since 2023 earlier this month, meeting with wounded service members and Ukrainian officials. Posting on X after he left the country, he said \"what I saw proved to me we can't give up on the Ukrainian people\", and in a break from US President Donald Trump's stance on negotiations, called for security guarantees in any peace deal. \"Everyone wants this war to end, but any agreement has to protect Ukraine's security and can't be a giveaway to Putin,\" he said.  Mr Musk, who also leads the Department of Government Efficiency (DOGE), an advisory department under the Trump administration, replied on X and said: \"You are a traitor.\" Firing back at the Tesla chief, Mr Kelly said: \"Traitor? Elon, if you don't understand that defending freedom is a basic tenet of what makes America great and keeps us safe, maybe you should leave it to those of us who do.\" He then told reporters back in the US the billionaire is \"obviously not a serious guy\".   It comes as Ukraine's President Volodymyr Zelenskyy arrives in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday. Mr Zelenskyy will not be at the meeting with US secretary of state Marco Rubio, but his team will try to improve relations following his disastrous 28 February visit to Washington, which descended into an Oval Office argument with the US president and vice president JD Vance. Read more:Trump says Ukraine 'may not survive' warRussian forces creep through disused gas pipeline It also comes as Mr Musk said X was hit by a \"massive cyber attack\" on Monday, with thousands of users reporting they were unable to use the platform. Later, he claimed in an interview with Fox News that IP addresses involved in the cyber attack were traced to locations \"in the Ukraine area\"."
    },
    {
        "title": "Volodymyr Zelenskyy arrives in Saudi Arabia ahead of US-Ukraine meeting - as Marco Rubio says Kyiv should be 'prepared to do difficult things'",
        "description": "Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday.",
        "url": "https://news.sky.com/story/volodymyr-zelenskyy-arrives-in-saudi-arabia-ahead-of-us-ukraine-meeting-13325920",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-volodymyr-zelenskyy_6852331.jpg?20250310172041",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-10 17:07:00",
        "Headline": "US secretary of state Marco Rubio is also in Saudi Arabia - but is not due to meet the Ukrainian president.",
        "Content": " Ukraine's President Volodymyr Zelenskyy has arrived in Saudi Arabia ahead of his team having talks with America's top diplomat on Tuesday. Mr Zelenskyy will not be at the meeting with US secretary of state Marco Rubio, but Mr Zelenskyy's team will try to improve relations following his disastrous 28 February visit to Washington, which descended into an Oval Office argument with President Donald Trump and vice president JD Vance. Follow latest updates on Ukraine and Trump Mr Zelenskyy briefly met Crown Prince Mohammed bin Salman on Monday, after the end of the daily fast during the Muslim holy month of Ramadan. US secretary of state Marco Rubio is also in Jeddah. He is not due to meet Mr Zelenskyy - but he held talks with Prince Mohammed to discuss Yemen and threats to ships from Houthis, Syria, and the reconstruction of Gaza. During talks on Tuesday the Ukrainian team will try to convince the US to restore military aid and intelligence that had helped Kyiv since Russia's full-scale invasion of Ukraine in 2022. Speaking to reporters while travelling to Jeddah, Mr Rubio said if Ukraine and the US reach an understanding acceptable to Mr Trump, that could accelerate his administration's push to peace talks. \n                  US shares drop sharply after Trump refuses to rule out recession\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  How will Canada's new PM take on Donald Trump?\n                 \"What we want to know is, are they interested [in] entering some sort of peace conversation and general outlines of the kinds of things they could consider, recognising that it has been a costly and bloody war for the Ukrainians,\" Mr Rubio said. \"They have suffered greatly and their people have suffered greatly. And it's hard in the aftermath of something like that to even talk about concessions, but that's the only way this is going to end and prevent more suffering.\"  He said: \"I'm not going to set any conditions on what they have to or need to do. I think we want to listen to see how far they're willing to go and then compare that to what the Russians want and see how far apart we truly are.\" He added: \"The most important thing that we have to leave here with is a strong sense that Ukraine is prepared to do difficult things, like the Russians are going to have to do difficult things to end this conflict.\" Meanwhile, British prime minister Sir Keir Starmer spoke to Mr Trump on Monday ahead of the US-Ukraine meeting. Read more:How Trump has upended millions of lives in his first 50 daysTrump says Ukraine 'may not survive' war against RussiaRating the president's second term so far A Downing Street readout of the call said that Sir Keir told the president that \"UK officials had been speaking to Ukraine officials over the weekend and they remain committed to a lasting peace\". \"The prime minister said he hoped there would be a positive outcome to the talks that would enable US aid and intelligence sharing to be restarted,\" the statement said. \"The two leaders also spoke about the economic deal they had discussed at the White House and the prime minister welcomed the detailed conversations that had already happened to move this forward. Both leaders agreed to stay in touch.\" The European Union agreed last week to boost the continent's defences and free up hundreds of billions of euros for security in response to the Trump administration's shift in policy towards Ukraine. A US intelligence official said a pause on sharing US intelligence that can be used for offensive purposes by Ukrainian forces remains in effect. The official suggested that progress could be made towards reinstating intelligence sharing with Ukraine during the Saudi talks."
    },
    {
        "title": "Elon Musk blames 'IP addresses in Ukraine' after X hit by cyber attack  ",
        "description": "X has been hit by a \"massive cyber attack\", according to Elon Musk.",
        "url": "https://news.sky.com/story/elon-musk-says-x-hit-by-massive-cyber-attack-as-users-unable-to-log-in-13325939",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-x-twiter-social-media_6659747.jpg?20240818040415",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-10 17:35:00",
        "Headline": "More than 40,000 users reported they could not access X on Monday, according to data from tracking website Downdetector.com.",
        "Content": "X has been hit by a \"massive cyber attack\", according to Elon Musk. The boss of the social media platform said the attack was carried out \"with a lot of resources\". Mr Musk claimed that either a large coordinated group or a country was involved, or both. He wrote on the platform: \"There was (still is) a massive cyberattack against X. \"We get attacked every day, but this was done with a lot of resources. Either a large, coordinated group and/or a country is involved. Tracing...\" Later on Monday, Mr Musk claimed on Fox News that IP addresses involved in the cyber attack were traced to locations \"in the Ukraine area\". The US government has recently revoked some access to satellite imagery for Ukraine and paused intelligence sharing, piling pressure on Kyiv as President Trump seeks a swift end to the war with Russia. \n                  Elon Musk calls US senator Mark Kelly 'a traitor' for visiting Ukraine - as Democrat fires back\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  Second SpaceX flight crash is a new blow for Musk's Mars programme\n                 In a now-deleted post on Telegram, a hacking group called Dark Storm Team claimed responsibility for the attack. Around 40,000 users reported they could not access the platform on Monday, according to data from tracking website Downdetector.com. Complaints about outages spiked at around 10am in the UK, and again at 2pm. Read more from Sky News:Is Musk's Trump role distracting him from his day job?US shares plunge as Trump refuses to rule out recession A source in the internet infrastructure industry told the Reuters news agency that the platform had been hit by several waves of denial of service (DoS) attacks at around 9.45am. According to the National Cyber Security Centre, DoS attacks are attempts to overload a website or network - aiming to degrade its performance or make it completely inaccessible. Such attacks are not necessarily sophisticated but they can cause significant disruption."
    },
    {
        "title": "How Donald Trump has upended millions of lives in his first 50 days in office",
        "description": "In just 50 days, Donald Trump has upended our world. He has ripped up rules, attacked allies and sided with enemies.",
        "url": "https://news.sky.com/story/how-donald-trump-has-upended-millions-of-lives-in-his-first-50-days-in-office-13323230",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump-white-house_6851879.jpg?20250310102046",
        "type": "US",
        "Author": "Dominic Waghorn",
        "Date Published": "2025-03-10 04:00:00",
        "Headline": "With 83% of US aid contracts cut, Trump's first 50 days in office has upended millions of lives around the world - with one health worker comparing his actions to biological warfare.",
        "Content": "\n          International affairs editor\n              @DominicWaghorn\n  In just 50 days, Donald Trump has upended our world. He has ripped up rules, attacked allies and sided with enemies. A country we thought for decades had our backs is no longer a reliable partner. We travelled thousands of miles to ask what that means for our lives and millions of others - from the sweltering backstreets of Africa to the frozen wastes of Greenland and Finland's tense border with Russia. Donald Trump's supporters at home and abroad see him as the disruptor-in-chief who will bring peace and prosperity, putting America first. But to many others we found he threatens chaos and a far darker future. While Mr Trump may be challenging convention and bringing fresh thinking, his critics say he is moving too fast and erratically. His first 50 days in office, they claim, have weakened America's place in the world and that will be exploited by rivals. Risk of resurgent epidemics in Kenya We went first to Kenya. The focus in the West may have been on Mr Trump and Russia but in the developing world, it's the end of US aid that is grabbing the headlines. On the frontlines of Africa's war on HIV we heard Mr Trump's actions being compared to an act of \"biological warfare\". Even among allies and admirers of the American president, there is deep unease and fear about what could come next, most of all the risk of resurgent epidemics of diseases like HIV, TB, malaria, ebola, and polio. In one of Kenya's poorest neighbourhoods in Nairobi, we joined health workers on their rounds, down sewage-filled alleyways into cramped, overcrowded buildings. In a one-room home, we met a young mother who is dependent on American aid. Anne is HIV positive and needs daily medication and nutritional support for both herself and her one-year-old son. She is terrified for their future because of the cut in US aid. \"I'm so worried,\" she told us, \"because if it carries on like this the medication could run out. When the medicine is not there, the protector of my body is not there, so anything can just pass through me.\" 'We had no warning' Kenya received $850m (£658m) in aid a year and that has now been abruptly severed. A US Supreme Court decision against the Trump administration may restore some of that but there is complete uncertainty about what happens next. Martha, a healthcare manager in Nairobi, spelled out what is at stake: \"We had no warning. We could not prepare the households. It was so sudden. \"We expect more death. We expect more children to die before the age of five. We expect more death for children living with HIV and it is going to be bad,\" Martha said, adding that more than 20,000 children who use her organisation's services will be affected. 83% of all US aid contracts cut The Trump administration says the aid has been only been suspended for 90 days pending a review. But in reality, many key programmes appear to have been shut down completely. After a 45-minute flight west of Nairobi to Kisumu, we saw what is happening away from big cities. The impact seemed just as severe. At one provincial hospital US Agency for International Development (USAID) signs were everywhere but on doors that are now shut. It had been a hub for patients to receive their treatment but that's now in doubt. Staff told us there were just two months of supplies left for some medication, and less than a month for others, because there have been no more deliveries. Patients were stockpiling drugs, said doctors, panicking for the future. 'Biological warfare' The US-supplied ammunition for Africa's war against HIV, malaria, TB and other diseases is running out. It has taken decades and billions to bring them under control. The fear is of a return to epidemics not seen for years. Eric Okioma is HIV positive and runs a charity helping others with the disease in Kisumu. \"When you look at it from a public health aspect, that's biological warfare that's the way I'm seeing it because from a human rights perspective, he did the wrong thing - he should not have taken it abruptly.\" Mr Trump is popular among many in Kenya. His conservative stance on issues like gender and sexuality resonates in this predominantly Christian country. But even among admirers and supporters there is deep unease about his aid cut. Peter Gunday, a father and churchgoer, told us he agreed Kenya should be less dependent on US aid and encouraged to provide for itself - but Mr Trump's action had been too sudden. \"He wants to make America great again... [but give an] olive branch to us even if it is only for some time.\" The aid cut threatens lives and America's standing in the world. The US has used aid to wield soft power and influence. Read more:US aid crisis leaves South Africans living with HIV in turmoilWhat is USAID? America in retreat Its superpower rival China prefers building. They have lent billions for massive infrastructure projects like the new railway from Nairobi to the coast through the heart of the city's safari park. For Beijing it's all leverage, applied ruthlessly to increase access to Africa's abundant natural resources. Under Trump, America is unilaterally deserting that battle for power and influence. Its values and interests will inevitably suffer. Not so much America first but America in retreat. Finland prepares for Russian aggression Closer to home, it is America's shift on security causing the greatest concern. We flew thousands of miles north to one of NATO's newest member countries that sits on a border with Russia. What did people in Finland make of what Mr Trump is doing to the Western alliance they have only just joined? We filmed with Finland's military on the border with Russia that was closed because of the war in Ukraine. In sparsely populated woods, locals report sightings of Russian drones, we were told. And there has been a surge in recruits to the border guard because of the international situation. One of them, Aku Jaeske, told us he had joined up \"for the defence of our own country\". He said: \"I think most of us, I think, are here because of that. It's really hard if we have a 1,300 and something kilometre border with Russia - it's pretty long - we have to have good men there.\" 'Bring it on', says one Finn What did he make of Mr Trump and what he saw on the news? \"I think it's crazy when you turn your TV on today, you can't know what is really happening.\" The war with Ukraine and Russia's belligerence has sparked a boom in shooting, with hundreds of new ranges opening up in Finland to meet demand. In a range outside Helsinki, one shooting enthusiast Jerkri told us what he thought was behind its growing popularity. \"The situation in Ukraine and people are noticing that maybe [they are] having to take care of themselves... think about it.\" Amateur shooters go through their paces, crisscrossing an open range at speed firing at targets dotted around the room. Patrick said he was worried by the direction of events. \"But if it did come to it... bring it on,\" he said. In a service station, Finland's most popular tabloid had the headline, \"Trump's 10 gifts to Putin.\" Finns were once a byword for peace-loving neutrality. They are arming up now, and watching Mr Trump's overtures to the Kremlin warily. Finland after all is where Mr Trump stood next to Russian President Vladimir Putin during his first term in office and infamously said he would believe him over the word of US spy agencies. US may be deserting the West The Finns know from their history a belligerent Russia cannot be trusted. In Europe, the US is not just withdrawing under Donald Trump, who says the US cannot prioritise the continent's security any longer. It looks like it may be changing sides deserting the West entirely: Cutting off aid and intelligence to Ukraine while it is pummelled by Russian rockets and drones; branding Ukraine's leader - and not the tyrant of Moscow - a dictator; attacking close allies with tariffs; resetting relations with Russia while it continues to invade a part of Europe. 'Trump is ridiculous', Greenlanders say And threatening to take over its neighbours. Our journey ended in Greenland, top of the list of Mr Trump's planned acquisitions. Most people we spoke to were genuinely worried by him. Students Aviana and Julie told us Mr Trump's antics were alarming. \"That's very scary actually - it seems he's more with Russia than Ukraine. I'm really scared.\" Another passerby said Mr Trump had no right to make a play for their homeland. They said: \"I think it's ridiculous that he thinks he can just take our land. We don't have the resources to fight against the USA.\" Jurgen Boassen has become a well-known figure for having opposing views - he is outspokenly pro-Trump. \"I think he is a great man who wants to have peace in the world,\" he told us. 'Europe is failing' He admits he is paid by MAGA groups in America to promote \"cultural ties\" and believes Greenland will gradually come around to the idea of becoming closer to America. \"I don't care because they will realise I'm doing the good thing for Greenland. Europe is failing, Britain, Sweden, Belgium, Holland even Germany,\" he said. Wherever we travelled people seemed in shock. America used to believe helping others was good for America - keeping the peace in Europe, saving lives, or protecting the sovereignty of neighbours. Read more:Why does Trump want Greenland?85% of Greenlanders oppose joining US, poll finds The fear is under President Trump it is just out for itself. The idea Mr Trump could carve up the world into spheres of influence with other authoritarian leaders seems plausible. If that is the case, lesser nations like Greenland may have plenty to fear. From what we were told on our journey, Donald Trump's America First foreign policy risks the lives of millions, the security and sovereignty of allies, and America's own place in the world while potentially strengthening its enemies."
    },
    {
        "title": "Trump 100 Day 50: What does the world make of Trump 2.0?",
        "description": "<a href='https://podfollow.com/trump100/view'>👉 Follow Trump 100 on your podcast app 👈  </a>  ",
        "url": "https://news.sky.com/story/trump-100-day-50-what-does-the-world-make-of-trump-20-13325522",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-trump-100-trump-podcast_6818183.jpg?20250228061116",
        "type": "US",
        "Author": "Unknown",
        "Date Published": "2025-03-10 03:15:00",
        "Headline": "No subtitle found",
        "Content": "👉 Follow Trump 100 on your podcast app 👈    President Trump has been in office for 50 days and the impact of his presidency in just a few weeks has been seismic. To mark 50 days of Trump 2.0 Mark Stone has been to swing state Pennsylvania to take the temperature of how voters are feeling. James and Mark are also joined by international affairs editor Dominic Waghorn who has been on a 10-day trip from Africa to the Arctic to assess the impact of Trump's first 50 days in different corners of the globe. If you've got a question you'd like James, Martha, and Mark to answer, you can email it to trump100@sky.uk."
    },
    {
        "title": "US shares drop sharply after Trump refuses to rule out recession",
        "description": "US shares fell sharply again on Monday amid uncertainty in the American economy, with President Donald Trump refusing to rule out a recession.",
        "url": "https://news.sky.com/story/us-shares-drop-sharply-after-trump-refuses-to-rule-out-recession-13326030",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-trader-stock-market_6852619.jpg?20250310220527",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-10 20:33:00",
        "Headline": "Tesla shares plunge by at least 15% to $222 - meaning it has lost more than half its value since December while the tech-heavy Nasdaq Composite closes down more than 4%.",
        "Content": "US shares fell sharply again on Monday amid uncertainty in the American economy, with President Donald Trump refusing to rule out a recession. Tesla shares plunged by at least 15% to $222 - meaning it has lost more than half its value since its peak at $479.86 on 17 December. But Elon Musk said on X that \"it will be fine long-term\". The tech-heavy Nasdaq Composite closed down more than 4% on Monday while the S&P 500 slumped about 2.7% - its biggest daily percentage drop since 18 December. The CBOE Volatility Index, often dubbed Wall Street's \"fear gauge\", surged over 3.6 points to hit 27, marking its highest level since 18 December. Airlines and other companies that need US shoppers feeling confident enough to spend also saw sharp losses. Bitcoin fell below $79,000 from more than $100,000 in December, with richly valued US tech stocks bearing the brunt of the recent sell-off on Wall Street. Financial markets have been volatile in recent weeks as rising trade tensions - with tariffs of up to 25% against goods from Canada and Mexico - and signs of slowing US economic growth weighed on consumer confidence and business activity. China has also been targeted with tariffs and the European Union could be next, from 2 April, when Mr Trump has promised to ramp up his \"America first\" ambitions. China's retaliatory tariffs on select US imports are set to take effect on Monday, with US tariffs on certain base metals anticipated later in the week.  Read more:An A-Z of Trump's first 50 days in officeWhat's gone wrong at Musk's Tesla?'Common error' could leave thousands out of pocket Asked directly in a Fox News interview on Sunday whether he was expecting a recession, Mr Trump did not deny the possibility. He said: \"I hate to predict things like that. There is a period of transition because what we're doing is very big, we're bringing wealth back to America. That's a big thing. And there are always periods of - it takes a little time. It takes a little time.\" 👉 Follow Trump 100 on your podcast app 👈 In an interview on Monday, Kevin Hassett, who heads the US National Economic Council, said there were many reasons to be optimistic about the US economy, despite some predictions of a contraction in GDP in the first quarter and concerns about inflation. \"There are a lot of reasons to be extremely bullish about the economy going forward. But for sure, this quarter, there are some blips in the data,\" Mr Hassett said, saying those stemmed from both timing effects of Mr Trump's rapid-fire tariffs push and some of what he called the \"Biden inheritance\". The president and his team have repeatedly bashed the economy that they inherited from Joe Biden. But when Mr Trump took office in January, GDP growth had largely exceeded trend for two years, consumer spending was strong and unemployment was still near historic lows."
    },
    {
        "title": "What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further",
        "description": "Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla.",
        "url": "https://news.sky.com/story/teslas-share-price-losing-streak-is-musks-trump-role-distracting-him-from-his-day-job-of-running-ev-maker-13325824",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250212051115",
        "type": "Business",
        "Author": "Ian King",
        "Date Published": "2025-03-10 14:32:00",
        "Headline": "Tesla saw its shares peak in December, but since then more than $800bn has been wiped from its stock market value with suggestions of further falls.",
        "Content": "\n          Business presenter\n              @iankingsky\n Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla. Shares of Elon Musk's electric vehicle maker have fallen for seven straight weeks, the longest losing streak since the company floated on the stock market 15 years ago, wiping out all of the gains it enjoyed after Mr Trump was elected US president in November last year. Money blog latest On Monday, the Tesla share price plunged by at least 15% to $222. Since the price peaked at $479.86 on 17 December, it has fallen by over half, wiping more than $800bn from its stock market value. To put it in context, that sum is roughly equivalent to Poland's annual economic output. And there may be worse to come. Wall Street analysts have been rushing to downgrade Tesla stock. A quarter of the 40 brokerages covering the stock currently rate it a \"strong sell\", suggesting there could be further falls to come. Reasons for share price drop There are a number of reasons behind the drop. Those who deplore Mr Musk's political views and his close proximity to the Trump administration will doubtless cite this as the key factor. It has certainly played a part. Mr Musk's recent antics, such as wielding a chainsaw on stage at a recent political conference and making a gesture on stage that some interpreted as a Nazi salute, have not endeared him or his companies to a swathe of the public both in the US and beyond. There have been protests and outbreaks of vandalism at Tesla dealerships and EV charging points across the US while, in both Europe and China, Tesla orders in January were down 45% year on year. Admittedly, a lot of the people staging protests at Tesla properties are unlikely to have been would-be buyers of the company's products, but the bigger problem is that Mr Musk now appears to be alienating customers who were previously loyal to the brand - as shown by the popularity, in the US, of Tesla bumper stickers with messages such as \"I bought this before Elon went crazy\" and \"Anti-Elon Tesla Club\".  Is Musk distracted? Conversely, some investors who wholly approve of the work Mr Musk is doing for the Trump administration may also have concerns, notably that it is proving too much of a distraction from the day job of running Tesla. Even before Mr Musk took the wheel at the US Department Of Government Efficiency (DOGE), there were already fears that he was being too distracted by his private companies, including the social media platform X, the aerospace and defence contractor SpaceX and his artificial intelligence business xAI. X, on which lies peddled by the Kremlin about Ukraine are regularly amplified, may also be adding to the damage being done to the Tesla brand. But Mr Musk's association with the Trump administration is only part of the reason for the recent declines. Tesla shares could have been over-priced Another key factor is that shares of Tesla were arguably over-priced to begin with. In the two weeks following the US presidential election, Tesla shares shot up by 32%, adding $250bn to its stock market value. To put that into context, that gain was equal to the entire stock market value of Toyota, the world's next biggest carmaker after Tesla. At the time its shares peaked, Tesla shares were trading at 112 times expected earnings, compared with the 25 times or so that the S&P 500 was trading at and higher even than the company's average over the last five years of 93. Again, to put things in context, Ford shares are valued at just eight times prospective earnings. That exotic rating reflected the superlative growth prospects previously accorded to Tesla, in particular Mr Musk's pledges to launch a new cut-price electric vehicle and a fully autonomous ride-hailing service. Competition from China But investors are now reappraising those growth prospects as Tesla loses share of the electric vehicle market to rivals, such as China's BYD, which is also seen as outpacing the company on self-driving vehicle technology. News on Tesla's planned new low-cost model remains elusive and, until it is launched, critics believe it has little hope of building share in burgeoning markets such as India. Mr Musk always wanted Tesla to be seen as an AI and robotics company rather than an electric vehicle maker and that was part of the bull case for the stock. Yet there are now fears that the company is investing too much in such projects and on its much-criticised Cybertrucks. Another concern is that Tesla's core operations may be misfiring. Read more from Sky News:Trump dodges US recession question'Canada will never be part of the US'  Results published at the end of January revealed that operating profits for the final three months of 2024 were down 23% on the same period a year earlier - which Tesla blamed on lower average selling prices on each of its Model 3, Model Y, Model X and Model S lines. For the full year, deliveries of new vehicles were down on 2023, the first year-on-year fall the company has suffered. And the operating margins, partly reflecting the sums Tesla is investing, were also lower. It all adds up to an unpleasant cocktail for investors."
    },
    {
        "title": "People living near new pylons could get £250-a-year off their energy bills, minister says",
        "description": "Residents who live near newly installed pylons will be compensated with &#163;250-a-year off their energy bills, a minister has said.",
        "url": "https://news.sky.com/story/people-living-near-new-pylons-could-get-163250-a-year-off-their-energy-bills-minister-says-13325576",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wind-farm-wind-power_6840032.jpg?20250226090448",
        "type": "Business",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-10 07:46:00",
        "Headline": "Alex Norris says communities need to \"share the benefits\" of the UK's move towards clean energy - as the government announces an overhaul of the planning system to speed up house building.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Residents who live near newly installed pylons will be compensated with £250-a-year off their energy bills, a minister has said. Housing and planning minister Alex Norris told Sky's Wilfred Frost on Breakfast that communities \"need to share the benefits\" of the government's tilt towards clean energy. \"If you're making that sacrifice of having some of the infrastructure in your community, you should get some of the money back,\" he said. \"So we're making that commitment - £250-a-year if you are near those pylons. \"We think that's a fair balance between people who are making that commitment to the country... they should be rewarded for that.\" Politics latest: UK advising Ukraine on handling peace talks with the US Ministers are currently pushing through an overhaul of the planning system - long seen as a brake on housebuilding and vital infrastructure projects - to stimulate growth in the economy. Overnight it was announced parts of the planning system could be stripped away as part of the government's attempts to speed up house building. In its election-winning manifesto, Labour promised to build 1.5 million new homes over the next five years to tackle the lack of affordable housing, with recent statistics showing that there are 123,000 households in temporary accommodation - including nearly 160,000 children. Sir Keir Starmer has repeatedly vowed to put \"builders not blockers first\", announcing at the beginning of the year \"unarguable cases\" that are legally challenged will only be able to be brought back to the courts once - rather than the current three times. Councils have also been told to come up with \"immediate, mandatory\" housing targets to help the government achieve its target. Under the reforms announced last night, consulting bodies such as Sport England, the Theatres Trust and the Garden History Society will no longer be required for those looking to build under the new plans being considered by ministers. While consultees will not be completely removed from the process, it will no longer be mandatory for builders to receive the opinion of such bodies and their scope will be \"narrowed to focus on heritage, safety and environmental protection\", according to the government. It is hoped the slimming down of the process will reduce waiting times for projects. Read more:What you need to know about stamp duty changesWelfare cuts are 'coming soon' Mr Norris said the interjections of official bodies in planning decisions was causing a \"bottleneck\" in granting applications. \"I think viewers might be surprised to hear that there are two dozen-plus organisations that have to be consulted on planning applications - that's providing a bit of a bottleneck, often not getting back in time,\" he said. He said that while members of Sport England were \"fine people\", there was a case where the body held up the development in Bradford next to a cricket pitch. \"The hold up is around a disagreement on the speed at which cricket balls are hit,\" he explained. \"So Sport England are querying the modelling of the speed at which the balls will be hit, and that, as a result, has meant that the whole process is now multiple years down the line, and there's no build out.\""
    },
    {
        "title": "London set to miss out on €20bn float of security group Verisure",
        "description": "The owners of Verisure, a provider of domestic alarm systems, are leaning towards a &#8364;20bn (&#163;16.7bn) flotation in Amsterdam &#8211; a decision that would deliver another blow to London's hopes of capitalising on a revival in the market for major initial public offerings (IPOs).",
        "url": "https://news.sky.com/story/london-set-to-miss-out-on-836420bn-float-of-security-group-verisure-13325704",
        "image_url": "https://e3.365dm.com/25/01/1920x1080/skynews-london-city-airport_6811201.jpg?20250126144347",
        "type": "Business",
        "Author": "Mark Kleinman",
        "Date Published": "2025-03-10 11:21:00",
        "Headline": "The owners of Verisure, which has more than five million customers, are leaning towards a listing on Euronext Amsterdam in what would represent a fresh blow to the London Stock Exchange, Sky News understands.",
        "Content": "\n          City editor\n              @MarkKleinmanSky\n The owners of Verisure, a provider of domestic alarm systems, are leaning towards a €20bn (£16.7bn) flotation in Amsterdam – a decision that would deliver another blow to London's hopes of capitalising on a revival in the market for major initial public offerings (IPOs). Sky News has learnt Euronext Amsterdam is emerging as the likeliest destination for a listing of Verisure following preliminary talks with a group of investment banks angling to work on the deal. Sources close to Verisure insisted on Monday no final decision about whether to proceed with an IPO, or its venue, had been taken. They acknowledged the possibility of such an outcome, however, despite the efforts of stock exchanges in London, Stockholm and Zurich to position themselves for the flotation. Money latest: Giant trolley scales anger Tesco customers One said recent rule changes in the UK could yet tip the balance back in London's favour. A number of Wall Street banks have pitched to work on the deal, Bloomberg News reported last week, while Sky News revealed in January preparations for an IPO were under way. \n                  US shares drop sharply after Trump refuses to rule out recession\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  People living near new pylons could get £250-a-year off their energy bills, minister says\n                 Verisure is majority-owned by the private equity firm Hellman & Friedman (H&F), with a listing unlikely until next year. People close to Verisure said they expected the company would be valued at more than €20bn, with some market sources suggesting the eventual figure could be as high as €30bn (£25.2bn). That figure includes Verisure's debt, meaning its equity market capitalisation would be smaller. Verisure has roughly 5.5 million customers in 17 countries, including the UK, Brazil, Chile, Italy and the Netherlands. Under Austin Lally, its chief executive, it has been transformed into a lucrative subscription model-based business pitching technologically advanced services to its customer base. Four years ago, the company was responsible for a $2bn dividend payout to its owners. Read more from Sky News:Trump dodges recession question as trade war implications dominate marketsPeople living near new pylons could get £250-a-year off their energy bills News of Verisure's deliberations comes at an increasingly critical time for the London Stock Exchange. David Schwimmer, the boss of its parent company, recently expressed confidence about its listings pipeline, although hopes that Shein, the Chinese-founded online fashion group, would stage a float in London this year have been buffeted by the early weeks of Donald Trump's presidency and protests about its alleged use of child labour in its supply chain. Data compiled by EY, the professional services firm, showed 2024 was among the quietest years on record for new issuance, with just eight new listings - and only three on the main market. Just £778m in proceeds was raised during the year through IPOs, down 18% on the previous year. At the same time, the momentum of companies drifting away from London has gathered pace with Ashtead, the equipment rental company, saying it would relocate its listing to New York. Flutter Entertainment, the gambling group behind Paddy Power and Betfair, has already moved its primary listing to the US. H&F, which ranks among the world's most successful buyout firms, became Verisure's majority shareholder in 2015 when it bought the stake held by Bain Capital, another private equity group. At the time, the company was known as Securitas Direct Verisure Group, with it continuing to trade under the Securitas Direct brand in some markets. A spokesman for Verisure declined to comment on Monday."
    },
    {
        "title": "Donald Trump dodges US recession question as trade war implications dominate markets",
        "description": "Donald Trump has not ruled out a recession in the United States this year, saying the world's largest economy is in \"transition\" through his trade war.",
        "url": "https://news.sky.com/story/trump-dodges-recession-question-as-trade-war-implications-dominate-markets-13325588",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-donald-trump_6851883.jpg?20250310102224",
        "type": "Business",
        "Author": "James Sillars",
        "Date Published": "2025-03-10 08:20:00",
        "Headline": "Could the 'Trump slump' become a 'Trumpcession'? The implications of the president's tariff regime face a second week of close financial market scrutiny following a big shift in risk sentiment.",
        "Content": "\n          Business and economics reporter\n              @SkyNewsBiz\n Donald Trump has not ruled out a recession in the United States this year, saying the world's largest economy is in \"transition\" through his trade war. Financial markets have been spooked by the implications of his early trade fights involving the country's nearest partners Canada and Mexico through on-off tariffs of up to 25%. China has also been targeted and the European Union could be next, from 2 April, when Mr Trump has promised to ramp up his \"America first\" ambitions. Money latest: The financial advice the over-50s would give their younger selves The recession question first cropped up a week ago when a closely-watched economic indicator suggested the US economy was shrinking at its fastest pace since the COVID pandemic. The Atlanta Federal Reserve's GDPNow model showed activity shrinking in the current first quarter, even before the president took office as the threat of tariffs loomed large. Other indicators show signs for concern, with the US unemployment rate ticking up in February to 4.1%, according to official data on Friday. \n                  US shares drop sharply after Trump refuses to rule out recession\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  People living near new pylons could get £250-a-year off their energy bills, minister says\n                 The stock market sell-off of last week left the broad S&P 500 trading at near six-month lows.  The dollar has suffered too, with sterling and the euro gaining four cents since the end of February. They are hardly the headlines Mr Trump wants. He was asked directly in a Fox News interview on Sunday whether he was expecting a recession. Crucially, he did not deny the possibility in his reply when he said: \"I hate to predict things like that. There is a period of transition because what we're doing is very big, we're bringing wealth back to America. That's a big thing. And there are always periods of - it takes a little time. It takes a little time.\"  \"It will be great for us,\" he said of the tariff regime's domestic impact, which, he claims, will force more companies to hire more workers in the United States. Both Canada and Mexico have been given two temporary reprieves, with companies operating cross-border complaining of chaos in terms of red tape and a lack of clarity on future tariffs. Asked by Fox if he could give businesses some reassurance, Mr Trump added: \"Well, I think so. But, you know, the tariffs could go up as time goes by and they may go up. And you know, I don't know if it's predictability, I think...\". When told by the interviewer Maria Bartiromo that those remarks were not providing clarity, he responded: \"No, I think they say that, you know, it sounds good to say. But for years, the globalists, the big globalists have been ripping off the United States; they've been taking money away from the United States. And all we're doing is getting some of it back. And we're going to treat our country fairly.\" The markets will study carefully the key US economic data ahead for signs of a protracted slowdown. News that China returned to deflation in February helped keep sentiment on the back foot in Monday's market moves as it showed underlying demand in its economy remained weak. Most major equity markets in Asia and Europe were down, with futures suggesting that America would follow suit amid its own economic worries. The country does not rely on the common international definition of a recession - two consecutive quarters of negative growth. In the United States, only an independent committee of economists has the power to declare a recession. Its deliberations expand beyond pure growth to include other facets such as the state of the employment market."
    },
    {
        "title": "£1,000 a day, drunk celebrities and fighting pirates: What it's really like being a bodyguard",
        "description": "My clients fall into one of several categories.",
        "url": "https://news.sky.com/story/1631000-a-day-drunk-celebrities-and-fighting-pirates-what-its-really-like-being-a-bodyguard-13325756",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-james-bodyguard_6852051.jpg?20250310122443",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-10 12:10:00",
        "Headline": "Close protection officer James, who asked for his surname to remain anonymous, tells the Sky News Money team about an often unpredictable role - that can involve everything from handling intoxicated celebrities to hurling rioters over hedges.",
        "Content": "My clients fall into one of several categories. 1. Ultra-high-net-worth individuals (UHNWI) and their families, those who require discreet yet comprehensive security for their homes, travel, and daily lives. 2. Celebrities, often dealing with stalkers, intrusive paparazzi, or even death threats. 3. Corporate executives in high-risk areas. Or businesses and staff in hostile environments. 4. Professional athletes. Many seek security for themselves or their homes, especially when dealing with obsessive fans or potential break-ins. 5. Wealthy tourists - those travelling to high-crime locations who want an added layer of security. 95% of it is sheer monotony and endless waiting... It's also physically and mentally demanding. And the freelance nature means income isn't always steady. \n                  Search for missing crew member ended after oil tanker and cargo ship collide in North Sea\n                 \n                  Jet fuel and sodium cyanide: How North Sea ship crash could have lethal consequences for wildlife\n                 \n                  Constance Marten and partner caused 'entirely avoidable' death of baby daughter, court hears\n                 Success often depends on recognising the absence of the normal and the presence of the abnormal... Being able to anticipate threats before they arise is crucial. This includes avoiding predictable routines, reading the environment, and understanding subtle changes in people's demeanour. Strong communication skills, quick decision-making, and the ability to remain calm under pressure are also essential. Some clients refuse to follow advice... The worst cases involve clients who get drunk, aggressive or recklessly put themselves in danger. One of my most difficult experiences was looking after a Bollywood actor in Manchester overnight. He was extremely drunk, rude to women and nearly got into a fight with the venue's doormen. My role wasn't to babysit him, and I wasn't comfortable with the way he behaved. After that job, I refused to work for the company again. Building a good reputation is key... Some full-time corporate positions exist, but most CPOs work on short-term contracts. Recruitment is all about word of mouth and networking. Job interviews are more practical than sit-down interviews... Candidates may be tested on: how they handle hostile situations, their ability to escort a client safely, first aid skills, fitness tests and security route planning. Hours are often long and unpredictable, sometimes ranging from 12 to 16 hours a day... The job is mostly about being on call or waiting for your client. Your tasks could include: escorting a high-profile client to meetings, conducting security advance sweeps of venues and restaurants to check for threats and ensuring everything runs smoothly. Managing vehicle arrangements if you're mobile, always knowing their locations in case of an emergency. Your client might enjoy skiing so you would need to be able to ski. There are two classic routes into the job... military or law enforcement. It's a well-trodden path - get some tactical experience, learn how to keep your head on a swivel and then transition into the private sector, swapping a uniform for a suit and an earpiece. I was a Butlins Redcoat... then, fate intervened in the form of a poorly timed groin kick from a teenager who underestimated the combat capabilities of a man in a bear suit. Unfortunately, Butlins security was not as understanding as one might hope and thus ended the promising career of Billy the Bear. From there, I took the logical next step - joining the military. I was assigned to protect a camera crew who were adamant on filming the riots in Salford during the UK riots in 2011... At one point, three men in hoodies spotted the camera and moved in. One of them attempted to attack the cameraman, but I had been blending in, also wearing a hoodie, standing right next to him. At the last moment, I shouted for the cameraman to run to a pre-arranged rendezvous where our safety car was parked. The aggressor didn't see me until it was too late - I launched him over a hedge and ran behind the cameraman to ensure he got away safely. Read moreWhat it's really like living on a canal boat - and how much it costs'Common error' could leave thousands of women out of pocket in pensions I experienced an attempted hijacking in the middle of the Indian Ocean... and it was one of the most stressful - yet rewarding - situations I've faced. We were providing armed security on a ship. A pirate skiff was following in the wake of our ship, trying to remain hidden among the waves, but we spotted them. After firing warning shots, they halted their approach but fired back. However, by that point, the job was done - my colleague and I had successfully prevented the hijacking. That experience was both intense and incredibly rewarding. The best perks... for some CPOs are travelling to exotic locations, being around high-end vehicles, and staying in some of the world's most luxurious hotels. I am bound by strict non-disclosure agreements... and ethical standards to protect the privacy of my clients. It's not about being expected to take a bullet... it's about proactive protection, strategic planning, and maintaining a secure environment. That said, I am fully committed to doing whatever it takes to ensure my client's safety, including putting myself in harm's way. Striking a good work-life balance is... difficult. The long hours, last-minute jobs, and travel make work-life balance tough. Many CPOs struggle with family time and relationships. Entry-level CPOs in the UK can expect to earn...  around £150-£250 a day (£40,000-£50,000 a year). Experienced CPOs can earn between £250-£450 a day (£60,000-£100,000 a year). High-end roles (for ultra-high-net-worth individuals or celebrities) can sometimes pay £1,000+ a day (£150,000+ a year). Overseas roles (especially in hostile environments) used to pay significantly more, sometimes £500- £1,000 a day, but this is rare in this climate."
    },
    {
        "title": "Drivers 'confused' by transition to electric vehicles, ministers warned",
        "description": "UK drivers are \"confused\" by the country's electric car transition, ministers are being warned.",
        "url": "https://news.sky.com/story/drivers-confused-by-transition-to-electric-vehicles-ministers-warned-13325133",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electric-cars-ev_6851283.jpg?20250309154915",
        "type": "Business",
        "Author": "Unknown",
        "Date Published": "2025-03-10 00:01:00",
        "Headline": "In a survey of more than 14,000 AA members, 7% thought the government was banning the sale of used petrol and diesel cars.",
        "Content": "UK drivers are \"confused\" by the country's electric car transition, ministers are being warned. Although most drivers are not hostile towards electric vehicles (EVs), many are confused about what changes are coming and when, according to new research from the AA. In a survey of more than 14,000 AA members, 7% thought the government was banning the sale of used petrol and diesel cars. Around a third thought manual EVs exist, despite them all being automatic. More than one in five said they would never buy an EV. The government's plan for increasing the number of electric vehicles being driven in the UK focuses heavily on increasing the supply of the vehicles.  In 2024, at least 22% of new cars and 10% of new vans sold by each manufacturer in the UK had to be zero-emission, which generally means pure electric. \n                  More heat pumps, fewer kebabs - Is this the way to stop climate change?\n                 \n                  Heat pumps, EVs and fewer kebabs: You'll notice the next cut to emissions - but half the work is done\n                 \n                  How the climate fight is coming into your home\n                 Each year, those percentages will rise, reaching 80% of new cars and 70% of new vans in 2030. Manufacturers will face fines of £15,000 per vehicle if electric vehicle sales fall short of 28% of total production this year. Read more from Sky News:Survivor reflects on five years on from COVIDAt least 12 people injured in shooting in Toronto By 2035, all new cars and vans will be required to be fully zero emission, according to the Department for Transport. Second-hand diesel and petrol cars will still be allowed to be sold after this date, and their fuel will still be available. There are more EVs - but will people buy them? In February, 25% of new cars were powered purely by battery and in January, they made up 21% of all new cars registered in the UK. But despite the growth of electric sales, manufacturers continue to warn that the market will not support the growth required to hit government EV targets, and called for consumer incentives and the extension of tax breaks. The AA suggested the government's plan focuses on \"supply but does little to encourage demand for EVs\". It called on ministers to co-ordinate a public awareness campaign alongside the motoring industry which directly targets drivers who doubt the viability of EVs. \"Our message to government is more needs to be done to make EVs accessible for everyone,\" said Jakob Pfaudler, AA chief executive. Which? head of consumer rights Sue Davis said: \"When it comes to making sustainable choices such as switching to an electric car, our research shows that people are often held back by high costs, complex choices or uncertainty. \"The government needs to provide the right information on electric vehicles and other sustainable choices so that people have the confidence to switch.\" A Department for Transport spokesperson said: \"We're investing over £2.3bn to help industry and consumers make a supported switch to EVs. \"This includes installing a public charge point every 28 minutes, keeping EV incentives in the company car tax regime to 2030, and extending 100% first-year allowances for zero-emission cars for another year. \"Second-hand EVs are also becoming cheaper than ever, with one in three available under £20,000 and 21 brand new models available for less than £30,000. \"We're seeing growing consumer confidence as a result.\""
    },
    {
        "title": "Sir David Amess's family 'betrayed and angry' as government refuse inquiry",
        "description": "Sir David Amess's daughter has said the government's decision to not hold a national inquiry into his murder has left his family \"betrayed and angry\".",
        "url": "https://news.sky.com/story/sir-david-amesss-family-betrayed-and-angry-as-government-refuse-inquiry-13326004",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-david-amess-politics-hub_6852505.jpg?20250310201323",
        "type": "Politics",
        "Author": "Alix Culbertson and Alexandra Rogers, political reporters",
        "Date Published": "2025-03-10 10:48:00",
        "Headline": "Katie Amess has questioned why public inquiries have been called into the Southport and Nottingham murders but not her father's.",
        "Content": "By Alix Culbertson and Alexandra Rogers, political reporters   Sir David Amess's daughter has said the government's decision to not hold a national inquiry into his murder has left his family \"betrayed and angry\". The Conservative MP for Southend West was murdered by Islamic State sympathiser Ali Harbi Ali in 2021 as he held a constituency surgery. On Monday, Home Secretary Yvette Cooper rejected the MP's family's call for a national inquiry into his death. His daughter, Katie Amess, told Sky News' Politics Hub With Sophy Ridge she is in \"utter disbelief\" the government thinks they \"should be happy\" with an initial inquiry into her father's death as she said it was purely a \"paper review\" without an investigation or interviews.  Politics latest: Starmer facing first by-election test as PM \"We're in utter disbelief and we're completely heartbroken all over again,\" she said. \"We just feel betrayed, ignored, let down and also angry because, why are we having to fight so hard for an inquiry? \"This inquiry should have happened immediately after his death. Nobody wants to help me and I just don't understand why.\" Ms Amess said her father was friends with everybody, whatever their race, religion, economic status or political affiliation. She revealed when he died they received many letters from people who said they were his best friend, which showed just the kind of person he was. Earlier, Ms Amess and her mother, Lady Julia Amess, spoke at a news conference where Ms Amess said the authorities had let her father down \"so badly\" and that his death had been \"brushed under the carpet\". She urged Ms Cooper to reverse her decision, saying: \"Do not let my father's murder be forgotten. \"Do not let his death be just another statistic.\" Ali, who was given a whole-life sentence, had been referred to the anti-terror programme Prevent before the attack. A review into his murder found he was released from Prevent \"too quickly\", with his case closed five years before the attack following one meeting at a McDonald's to deal with his interpretation of what is forbidden under Islamic law. The late MP's daughter, who is also taking legal action against Essex Police and the Home Office, has dismissed that investigation as \"another useless paper review conducted by a person of their choice\". In a tearful statement, she accused Ms Cooper of having \"strung\" the family along for \"months\" by suggesting she \"was working on ways to help us\". Read more: What is Prevent?  She told reporters: \"How can the government justify holding inquiries for other tragic events like Southport and Nottingham and yet refuse to investigate the very system that failed my father? \"Is his life worth less than others? \"Does our family not deserve the truth like other families and to know that what happened will never happen again?\" She said all Ms Cooper had done was \"remove the possibility of us being included in the Southport inquiry; instead offering another useless paper review, conducted by a person of their choice\". In a direct message to the government, she said: \"I want Sir Keir and Yvette Cooper to know exactly what the consequences are when the very government agencies that are set up to protect people like my dad, and members of the public, fail. \"Doing paper review after paper review into what happened, like what they have done since the day my dad was murdered, is simply not enough.\"  Ms Cooper rejected the Amess family's calls for a public inquiry in a letter to the late MP's widow and his daughter, seen by the PA news agency. In it, Ms Cooper said it was \"hard to see how an inquiry would be able to go beyond\" terrorist killer Ali Harbi Ali's trial and the recently published Prevent learning review. Lady Julia and Ms Amess said the prime minister should \"go away and reconsider the government's position\" ahead of a family meeting with himself and Ms Cooper on Wednesday. Read more:Basic failings to stop killer of Sir David AmessHow 'fanatical terrorist' carried out MP assassination  Outlining the government's reasoning for refusing a public inquiry, security minister Dan Jarvis said he did not believe such a step would \"unearth any information that has not already been assessed\". \"In the years since this cowardly attack, there have been several reviews asking how this could have been avoided, and we have seen significant improvements to the Prevent programme as well as stronger protections for MPs,\" he said. \"We understand that the Amess family are still looking for answers and we take this incredibly seriously. \"While we do not think a public inquiry would unearth any information that has not already been assessed, the home secretary has confirmed that we will further scrutinise all the reviews that have taken place over the last few years. \"We very much hope this will help the family to get the justice they deserve.\""
    },
    {
        "title": "'Seismic' planning system reforms to be 'unleashed', government promises",
        "description": "The government has promised to \"unleash seismic reforms\" to the planning system under major new legislation being published on Tuesday.",
        "url": "https://news.sky.com/story/seismic-planning-system-reforms-to-be-unleashed-government-promises-13326085",
        "image_url": "https://e3.365dm.com/24/12/1920x1080/skynews-worcester-construction_6774588.jpg?20241213071037",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-10 22:27:00",
        "Headline": "The reforms will make the planning process easier and change the way developers meet environmental obligations, say ministers.",
        "Content": "The government has promised to \"unleash seismic reforms\" to the planning system under major new legislation being published on Tuesday. The Planning and Infrastructure Bill is expected to include wide-ranging changes to help deliver on Labour's promise to build 1.5 million homes and make decisions on 150 major infrastructure projects by the next election in 2029. Reforms include making the planning process easier, giving communities living near new electricity pylons money off their energy bills and changing the way developers meet environmental obligations. Deputy Prime Minister and Housing Secretary Angela Rayner said the government would create \"the biggest building boom in a generation\" by \"lifting the bureaucratic burden which has been holding back developments for too long\". She added: \"The Planning and Infrastructure Bill will unleash seismic reforms to help builders get shovels in the ground quicker to build more homes, and the vital infrastructure we need to improve transport links and make Britain a clean energy superpower to protect billpayers.\" The bill is expected to include plans to allow more planning applications to be decided by planning officers instead of elected councillors, with council planning committees to be made smaller to \"ensure good debate is encouraged\". Planning fees will also be allowed to be set by councils to recover their costs, and \"meritless\" legal challenges to major applications will face a crackdown. \n                  Mike Amesbury to quit as MP after punching man in street - triggering by-election\n                 \n                  Sir David Amess's family 'betrayed and angry' as government refuse inquiry\n                 \n                  The Reform row: What has happened and what has been said?\n                 Nature restoration fund A new nature restoration fund will be introduced to allow developers to pay into larger environmental projects instead of funding single-site initiatives. The government is hoping to avoid a repeat of the £100m \"bat tunnel\" HS2 was required to build. 'Hundreds of pounds off energy bills for some' And for those living near new electricity pylons, they will get up to £250 a year off energy bills for 10 years, as well as community projects such as leisure facilities to encourage communities to host major infrastructure. Other consumers are likely to fund this through higher energy bills, however, the government expects this will only increase bills by a few pence per household when spread across the UK. Read more:Govt demands immediate housing plans from councilsCouncils to get £68m to build houses on brownfield sites  Many of the details have yet to be decided and will have to go to consultation - including how the bill discount scheme will work and which decisions will be made by planning officers, not councillors. One consultation will look at removing some organisations, such as the Theatres Trust and Sport England, from the list of bodies legally required to be consulted on planning decisions. What will happen to most controversial applications? Consultations will run alongside the legislative process to allow new measures to be implemented quickly once the bill is approved, housing minister Matthew Pennycook said. He also said decisions on \"the most significant and controversial\" applications would still be made by councillors. The Home Builders Federation welcomed the proposals, with chief executive Neil Jefferson saying they will be \"essential to getting more sites up and running\". However, the changes to environmental rules could prove contentious. Richard Benwell, chief executive of nature coalition Wildlife and Countryside Link, welcomed some of the changes but said more enforcement is needed to \"ensure that unsustainable development can never proceed without impunity\". He said: \"For nature recovery and development to go hand-in-hand, the bill should be strengthened with a guarantee that all planning decisions must be compatible with nature and climate targets, more protection for irreplaceable habitats and nature recovery areas, and new building regulations for biodiversity so that all infrastructure is wilder by design.\""
    },
    {
        "title": "The Reform row: What has happened and what has been said?",
        "description": "Senior members of Reform UK are embroiled in a bitter row  - with one of its MPs being suspended from the party.",
        "url": "https://news.sky.com/story/the-reform-row-what-has-happened-and-what-has-been-said-13325620",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-farage-nigel-rupert_6849285.jpg?20250307181945",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-10 09:33:00",
        "Headline": "Sky News takes a look at how Rupert Lowe, the MP for Great Yarmouth, came to be suspended by the party, resulting in a public feud with leader Nigel Farage.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Senior members of Reform UK are embroiled in a bitter row  - with one of its MPs being suspended from the party. Rupert Lowe, the Reform MP for Great Yarmouth, lost the party whip over the weekend, meaning he will now sit as an independent MP in the Commons. It is a setback for party leader Nigel Farage, who has been on a mission to \"professionalise\" Reform as it seeks to capitalise on its position in the polls - which only a month ago gave the party a lead over Labour and the Conservatives for the first time. But how did the row start, and what now for Mr Lowe? Politics latest: Tearful daughter of murdered MP condemns government Alleged threats of physical violence Mr Lowe, the former chairman of Southampton Football Club, was suspended last week after Reform reported him to the police over alleged threats of physical violence towards the party's chairman, Zia Yusuf. A statement from Mr Yusuf and Lee Anderson, the chief whip, also said the party had received complaints from two female employees about alleged serious bullying in Mr Lowe's offices. Mr Lowe, who served as a member of the European Parliament for the Brexit Party, has strongly denied the allegations, calling the accusations of physical threats \"outrageous and entirely untrue\". He also referenced a \"vexatious complaint\" made by another staff member. Mr Yusuf and Mr Anderson claimed the Great Yarmouth MP had \"on at least two occasions made threats of physical violence against\" the former. \"It is with regret that we feel obligated to disclose that the party received complaints from two female employees about serious bullying in the offices of the member of parliament for Great Yarmouth, Rupert Lowe,\" they said in a joint statement. \"Evidence was provided to us of workplace bullying, the targeting of female staff who raised concerns, and evidence of derogatory and discriminatory remarks made about women, including reference to a perceived disability. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly. Accordingly, we appointed an independent King's Counsel to conduct an investigation into the veracity of these complaints. To date, Mr Lowe has yet to cooperate with this investigation. \"In addition to these allegations of a disturbing pattern of behaviour, Mr Lowe has on at least two occasions made threats of physical violence against our party chairman. Accordingly, this matter is with the police. \"Reform stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour, including within our own party.\" What has Mr Lowe said? In response to the allegations, Mr Lowe said on Friday the party leadership had a \"complete inability to accept even the most mild constructive criticism without such a malicious reaction\". In a statement posted on X, he wrote: \"I am disappointed, but not surprised, to read Reform's untrue and false allegations. Let me be abundantly clear - this investigation is based on zero credible evidence against me, as has been repeatedly stated by the neutral investigator. None has been provided. \"I have cooperated and spoken at length with the KC they instructed, at great cost to the party, to investigate a minor staff matter.\" In a further statement on X, Mr Lowe said: \"Ever since this malicious attack on my reputation was launched, all I have asked for from both Reform and the KC is the credible evidence against me.\" He said that \"none has been provided\" because \"there is no credible evidence against me\". He added: \"I will not have my name dragged through the mud as part of a political assassination because I dared to question Nigel Farage.\" By Liz Bates, political correspondent, and Josh Gafson, politics producer Claims of bullying against ex-Reform MP Rupert Lowe are \"nonsense\", according to a current staff member.  The woman, who asked not to be named, added he is a \"good man\" who is being subjected to a \"horrific and unfair\" ordeal. Another of his employees has now spoken out in his defence. They told Sky News: \"Rupert is a good man who does not deserve any of this. He has done nothing wrong.  \"The allegations aren't against Rupert. I've not seen any evidence of any bullying from anyone in Rupert's office. These claims are nonsense. \n \"This is wrong what they're doing to Rupert. He's nice to everybody.  \"What they're putting him through is horrific and unfair. They are vexatious complaints. There has never been any bullying in the office.\"\n A Reform UK spokesman said: \"Reform UK acted on serious allegations by two female members of Mr Lowe's team by appointing an independent KC to investigate. \"We feel we have a duty of care to all our staff, whether employed directly or indirectly.\n \"Reform UK stands for the highest standards of conduct in public life, and we will apply these standards without fear nor favour.\" War of words Mr Lowe's statement suggests he believes he has been suspended from the party because he chose to criticise Mr Farage. 👉Listen to Politics At Jack And Sam's on your podcast app👈 In a recent interview with the Daily Mail, Mr Lowe said that while Mr Farage was a \"fiercely independent individual\" with \"messianic qualities\", that did not equate to \"sage leadership\". He added: \"I'm not going to be by Nigel's side at the next election unless we have a proper plan to change the way we govern from top to bottom,\" he said. He also said he was \"barely six months into being an MP\" and \"in the betting to be the next prime minister.\" Those words could have struck a nerve with Mr Farage after Elon Musk, the Tesla and Space X billionaire who has become one of Donald Trump's closest allies, suggested the Reform leader \"doesn't have what it takes\" and that Mr Lowe should take over. Mr Farage has brushed off the incident and in an article for the Daily Telegraph on Saturday claimed Mr Lowe's suspension was a result of \"inappropriate\" behaviour. 'Sense of unity has been dented' \"If the last general election taught us anything, it is that the public does not like political parties that engage in constant infighting,\" Mr Farage wrote. \"Now, thanks to one of our MPs, Rupert Lowe, unloading a barrage of criticisms against our operations and its main actors, that sense of unity has been dented.\" Mr Farage went on to claim that Mr Lowe had \"managed to fall out with all his parliamentary colleagues in one way or another\", adding: \"We did our best to keep a lid on things but, in the end, containment strategies invariably fail.\" He then referred to a Commons clash with transport minister Mike Kane just before Christmas after Mr Lowe staged a debate about a damaged ship containing toxic cargo docked in his Great Yarmouth constituency. \"Mr Lowe was unhappy with the answer that he received from Mr Kane and, at the end of the debate, he crossed the floor to make his feelings known,\" Mr Farage wrote. Read more politics news:Sir David Amess's daughter criticises inquiry decisionSenior civil servants to have pay linked to performance \"A confrontation ensued. Heated language was heard. The minister's shoulder was pushed. In the end, the Serjeant at Arms had to step in to calm things down between the two parliamentarians.\" He added: \"Yet the fact is that, sadly, there have been too many similar outbursts from Mr Lowe, often involving the use of inappropriate language, to the despair of our chief whip, Lee Anderson. \"I have been surprised and saddened at this behaviour.\" On bullying allegations, Mr Farage said Reform was a \"responsible political party\" that had a \"duty of care to every single member of staff, whether they are employed by us directly or indirectly\". As a result, he said a lawyer had been appointed to conduct an independent inquiry into the allegations. Reform's deputy leader Richard Tice said it was \"right and proper\" that the KC had been appointed to conduct an investigation. Speaking on Sky News' Sunday Morning with Trevor Phillips, he said: \"We've also got a duty of care as a party, whether people are employed directly or indirectly. So, that's why the chairman has instructed an independent investigation by a KC, that's the right and proper thing to do. That will run its course.\"  'Correcting' the record In his own Telegraph article, Mr Lowe repeated the claim he made on X that there was no credible evidence against him and he was removed from the party before any investigation had started. He called his treatment by the party a \"witch hunt\" and said he had been \"entirely frozen out of the Reform machine over the last few months, in a deliberate and calculated way\". However, the lawyer appointed to investigate the claims against Mr Lowe - who has remained anonymous - has denied saying they were \"shocked\" about the party's process. The lawyer said \"I have seen a number of statements made by Mr Lowe MP which are attributed to me and which describe my reactions to the process conducted by the party into the allegations made against both Mr Lowe and his constituency manager.\" \"I find myself in the unfortunate and regrettable position of having to make this statement to correct the record. I have not expressed either 'dismay' or 'shock' at any time as to the process. \"Nor have I said 'there is zero credible evidence against [Mr Lowe]', let alone said this 'repeatedly'.\""
    },
    {
        "title": "People living near new pylons could get £250-a-year off their energy bills, minister says",
        "description": "Residents who live near newly installed pylons will be compensated with &#163;250-a-year off their energy bills, a minister has said.",
        "url": "https://news.sky.com/story/people-living-near-new-pylons-could-get-163250-a-year-off-their-energy-bills-minister-says-13325576",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-wind-farm-wind-power_6840032.jpg?20250226090448",
        "type": "Politics",
        "Author": "Alexandra Rogers",
        "Date Published": "2025-03-10 07:46:00",
        "Headline": "Alex Norris says communities need to \"share the benefits\" of the UK's move towards clean energy - as the government announces an overhaul of the planning system to speed up house building.",
        "Content": "\n          Political reporter\n              @alexrogerssky\n  Residents who live near newly installed pylons will be compensated with £250-a-year off their energy bills, a minister has said. Housing and planning minister Alex Norris told Sky's Wilfred Frost on Breakfast that communities \"need to share the benefits\" of the government's tilt towards clean energy. \"If you're making that sacrifice of having some of the infrastructure in your community, you should get some of the money back,\" he said. \"So we're making that commitment - £250-a-year if you are near those pylons. \"We think that's a fair balance between people who are making that commitment to the country... they should be rewarded for that.\" Politics latest: UK advising Ukraine on handling peace talks with the US Ministers are currently pushing through an overhaul of the planning system - long seen as a brake on housebuilding and vital infrastructure projects - to stimulate growth in the economy. Overnight it was announced parts of the planning system could be stripped away as part of the government's attempts to speed up house building. In its election-winning manifesto, Labour promised to build 1.5 million new homes over the next five years to tackle the lack of affordable housing, with recent statistics showing that there are 123,000 households in temporary accommodation - including nearly 160,000 children. Sir Keir Starmer has repeatedly vowed to put \"builders not blockers first\", announcing at the beginning of the year \"unarguable cases\" that are legally challenged will only be able to be brought back to the courts once - rather than the current three times. Councils have also been told to come up with \"immediate, mandatory\" housing targets to help the government achieve its target. Under the reforms announced last night, consulting bodies such as Sport England, the Theatres Trust and the Garden History Society will no longer be required for those looking to build under the new plans being considered by ministers. While consultees will not be completely removed from the process, it will no longer be mandatory for builders to receive the opinion of such bodies and their scope will be \"narrowed to focus on heritage, safety and environmental protection\", according to the government. It is hoped the slimming down of the process will reduce waiting times for projects. Read more:What you need to know about stamp duty changesWelfare cuts are 'coming soon' Mr Norris said the interjections of official bodies in planning decisions was causing a \"bottleneck\" in granting applications. \"I think viewers might be surprised to hear that there are two dozen-plus organisations that have to be consulted on planning applications - that's providing a bit of a bottleneck, often not getting back in time,\" he said. He said that while members of Sport England were \"fine people\", there was a case where the body held up the development in Bradford next to a cricket pitch. \"The hold up is around a disagreement on the speed at which cricket balls are hit,\" he explained. \"So Sport England are querying the modelling of the speed at which the balls will be hit, and that, as a result, has meant that the whole process is now multiple years down the line, and there's no build out.\""
    },
    {
        "title": "Daniel Day: Man accused of climbing Big Ben's Elizabeth Tower appears in court",
        "description": "A man has appeared in court accused of climbing up the tower of Big Ben.",
        "url": "https://news.sky.com/story/daniel-day-man-accused-of-climbing-big-bens-elizabeth-tower-appears-in-court-13324870",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-big-ben-climb_6851714.jpg?20250310055909",
        "type": "Politics",
        "Author": "Unknown",
        "Date Published": "2025-03-10 00:07:00",
        "Headline": "Saturday's incident lasted for more than 16 hours before a man was brought down shortly after midnight.",
        "Content": "A man has appeared in court accused of climbing up the tower of Big Ben. Daniel Day, 29, of Westcliff-on-Sea, Essex, appeared at Westminster Magistrates' Court on Monday charged with intentionally or recklessly causing a public nuisance and trespassing on a protected site. Day spoke to confirm his identity and was remanded into custody until later this month. No pleas were entered. The Metropolitan Police were called to reports of a man climbing up Elizabeth Tower at 7.24am on Saturday. The man was carrying a Palestinian flag and remained barefoot on a ledge for more than 16 hours before being lifted to the ground in a cherry picker just after midnight. In a video posted on Instagram on Saturday evening, the man told negotiators from the ledge he was sitting on that he would come down \"on his own terms\". In the footage, negotiators on an aerial ladder platform appear to raise concerns about an injury to his foot, saying there is \"quite a lot of blood\" and that his clothes were not warm enough as temperatures dropped after sunset. But he insisted he was safe, saying: \"I will come down on my own terms, I have said this. But right now I am saying I am safe. \"If you come towards me you are putting me in danger and I will climb higher.\" Read more from Sky News:Man arrested after woman shot dead in South WalesUK to mark five years since start of pandemic Westminster Bridge was forced to close to traffic during the morning, as tourists in central London stood around watching the spectacle. Police said specialist officers worked with the fire brigade \"to bring this incident to a close as quickly as possible whilst minimising risk to life\". Commons speaker Sir Lindsay Hoyle on Monday ordered a security review to ensure \"lessons are learnt\" following the incident, as he thanked those for helping to resolve it safely."
    },
    {
        "title": "Jet fuel and sodium cyanide: How North Sea ship crash could have lethal consequences for wildlife",
        "description": "The crash involving a cargo ship and oil tanker off the East Yorkshire coast is bad news for the sea, fish and air in the area. What we don't know yet is quite how bad it will be.",
        "url": "https://news.sky.com/story/environmental-impact-of-oil-tanker-collision-depends-on-at-least-three-things-13325891",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-tanker-collision-north-sea_6852107.jpg?20250310132309",
        "type": "Technology",
        "Author": "Victoria Seabrook",
        "Date Published": "2025-03-10 16:06:00",
        "Headline": "So much is still unclear about this collision between an oil tanker and a container ship in the North Sea. We know it will impact the environment, but how bad depends on at least three things, and it may take a long time to really know.",
        "Content": "\n          Climate reporter\n              @SeabrookClimate\n  The crash involving a cargo ship and oil tanker off the East Yorkshire coast is bad news for the sea, fish and air in the area. What we don't know yet is quite how bad it will be. That depends on a few things - but the speed of the collision, clouds of filthy black smoke from the fires and the leaked fuel are certainly worrying. Firstly, it matters what was on board those two massive vessels. Follow live: Jet fuel spilling into sea after tanker collision Analytics firm Vortexa estimates the 183m-long tanker was carrying about 130,000 barrels of jet fuel (kerosene), which is now leaking into the sea. Jet fuel is not as sticky or viscous as heavier types of oil, thankfully, so it's less likely to clog the feathers and fur of birds and seals. It can also be broken down by natural bacteria. But it can still poison fish and kill animals and plants on the shoreline if it makes its way into the soil there. \n                  Wild beavers to make a comeback in England after government approves reintroduction\n                 \n                  Lorries dumped waste on beach - as Sky News told gangs can 'make millions' from illegal tipping\n                 \n                  Trump 100 Day 25: Has Trump's call with Putin brought peace a step closer? \n                 The Marine Conservation Society has pointed out the site in the Humber estuary is close to some protected areas and is important for seabirds and harbour porpoises.  'Hopefully, the effect on wildlife will be minimal' Martin Slater, director of operations at Yorkshire Wildlife Trust, said: \"East Yorkshire's coast is home to protected and significant colonies of seabirds including puffins, razorbills, gannets and kittiwakes. \"Many birds are gathering offshore on the sea ahead of the nesting season. There are significant numbers of Atlantic grey seals in the area, many rearing this year's young, as well as porpoises and other cetaceans around Spurn. \"If pollution spillage enters the Humber, this could potentially be devastating for the wildlife of the estuary, including important fish stocks and tens of thousands of overwintering and migrating birds who use the mud flats.\" The Royal Society for the Protection of Birds (RSPB) said the crash was close to the biggest gannet colony in England and warned a leak could be \"lethal\" to seabirds. Wildlife authorities have stated they will not intervene in the rescue efforts until all the mariners are accounted for. A spokesperson for Whitby Wildlife Sanctuary said: \"Hopefully, the effect on wildlife will be minimal, but there is an emergency contingency plan in place if lots of oiled birds wash up.\" 'Heavy fuel oil is nasty stuff' Both ships will have been powered by a dirtier, heavier kind of oil - likely marine gas oil or heavy fuel oil, though we don't know the details yet. Heavy fuel oil is nasty stuff. Cheap, thick and tar-like, it can smother animals and is very dangerous if they consume it, and is extremely difficult to clean up. Let's hope this isn't creeping around the North Sea already. We don't know how much of either the jet fuel or the oil powering the ships has leaked, or how much will be burned off in the violent fires - which themselves are ploughing black smoke and filthy air pollution into the surrounding atmosphere. Cargo ship 'had sodium cyanide on board' The Solong cargo ship was carrying 15 containers of sodium cyanide among other cargo, according to a report from maritime data provider Lloyd's List Intelligence. The container vessel was also transporting an unknown quantity of alcohol, said the casualty report - an assessment of incidents at sea - citing a message from the local coastguard. Plastic takes hundreds of years to break down, and potentially can choke or trap animals. Many of us have seen that uncomfortable viral video of a turtle having a straw yanked out of its nose. Previous accidents on cargo ships have seen plastic Lego pieces wash up in Cornwall 25 years later. Read more:How UK North Sea platforms dump gas Secondly, the impact depends on the sea and weather conditions around it. Things like the wind and currents affect how an oil spill spreads in the sea. Scientists can draw up computer models to simulate how the oil could behave. Thirdly, it matters how quickly this is all tackled and then cleaned up, if necessary, and if it can be. Usually the slower the response, the worse the impact. The coastguard has said the incident \"remains ongoing\" and it has started assessing the \"likely counter pollution response\" that will be required. Such a response might need the help of numerous public bodies: the government environment department, the transport department, the Environment Agency and the Maritime and Coastguard Agency. So for now the best we can hope for - aside from the welfare of the people involved - is that not all the oil is spilled or burnt, that conditions are calm and that rescuers and those cleaning up can work swiftly."
    },
    {
        "title": "Elon Musk blames 'IP addresses in Ukraine' after X hit by cyber attack  ",
        "description": "X has been hit by a \"massive cyber attack\", according to Elon Musk.",
        "url": "https://news.sky.com/story/elon-musk-says-x-hit-by-massive-cyber-attack-as-users-unable-to-log-in-13325939",
        "image_url": "https://e3.365dm.com/24/08/1920x1080/skynews-x-twiter-social-media_6659747.jpg?20240818040415",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-10 17:35:00",
        "Headline": "More than 40,000 users reported they could not access X on Monday, according to data from tracking website Downdetector.com.",
        "Content": "X has been hit by a \"massive cyber attack\", according to Elon Musk. The boss of the social media platform said the attack was carried out \"with a lot of resources\". Mr Musk claimed that either a large coordinated group or a country was involved, or both. He wrote on the platform: \"There was (still is) a massive cyberattack against X. \"We get attacked every day, but this was done with a lot of resources. Either a large, coordinated group and/or a country is involved. Tracing...\" Later on Monday, Mr Musk claimed on Fox News that IP addresses involved in the cyber attack were traced to locations \"in the Ukraine area\". The US government has recently revoked some access to satellite imagery for Ukraine and paused intelligence sharing, piling pressure on Kyiv as President Trump seeks a swift end to the war with Russia. \n                  Elon Musk calls US senator Mark Kelly 'a traitor' for visiting Ukraine - as Democrat fires back\n                 \n                  What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further\n                 \n                  Second SpaceX flight crash is a new blow for Musk's Mars programme\n                 In a now-deleted post on Telegram, a hacking group called Dark Storm Team claimed responsibility for the attack. Around 40,000 users reported they could not access the platform on Monday, according to data from tracking website Downdetector.com. Complaints about outages spiked at around 10am in the UK, and again at 2pm. Read more from Sky News:Is Musk's Trump role distracting him from his day job?US shares plunge as Trump refuses to rule out recession A source in the internet infrastructure industry told the Reuters news agency that the platform had been hit by several waves of denial of service (DoS) attacks at around 9.45am. According to the National Cyber Security Centre, DoS attacks are attempts to overload a website or network - aiming to degrade its performance or make it completely inaccessible. Such attacks are not necessarily sophisticated but they can cause significant disruption."
    },
    {
        "title": "What's gone wrong at Musk's Tesla? Share price has plunged - and could fall further",
        "description": "Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla.",
        "url": "https://news.sky.com/story/teslas-share-price-losing-streak-is-musks-trump-role-distracting-him-from-his-day-job-of-running-ev-maker-13325824",
        "image_url": "https://e3.365dm.com/25/02/1920x1080/skynews-donald-trump-elon-musk_6826159.jpg?20250212051115",
        "type": "Technology",
        "Author": "Ian King",
        "Date Published": "2025-03-10 14:32:00",
        "Headline": "Tesla saw its shares peak in December, but since then more than $800bn has been wiped from its stock market value with suggestions of further falls.",
        "Content": "\n          Business presenter\n              @iankingsky\n Amid the market volatility sparked by Donald Trump's on-off tariff plans, during which the benchmark S&P 500 index fell by 3.1% last week and the Nasdaq entered 'correction' territory, no stock has been more badly hit than Tesla. Shares of Elon Musk's electric vehicle maker have fallen for seven straight weeks, the longest losing streak since the company floated on the stock market 15 years ago, wiping out all of the gains it enjoyed after Mr Trump was elected US president in November last year. Money blog latest On Monday, the Tesla share price plunged by at least 15% to $222. Since the price peaked at $479.86 on 17 December, it has fallen by over half, wiping more than $800bn from its stock market value. To put it in context, that sum is roughly equivalent to Poland's annual economic output. And there may be worse to come. Wall Street analysts have been rushing to downgrade Tesla stock. A quarter of the 40 brokerages covering the stock currently rate it a \"strong sell\", suggesting there could be further falls to come. Reasons for share price drop There are a number of reasons behind the drop. Those who deplore Mr Musk's political views and his close proximity to the Trump administration will doubtless cite this as the key factor. It has certainly played a part. Mr Musk's recent antics, such as wielding a chainsaw on stage at a recent political conference and making a gesture on stage that some interpreted as a Nazi salute, have not endeared him or his companies to a swathe of the public both in the US and beyond. There have been protests and outbreaks of vandalism at Tesla dealerships and EV charging points across the US while, in both Europe and China, Tesla orders in January were down 45% year on year. Admittedly, a lot of the people staging protests at Tesla properties are unlikely to have been would-be buyers of the company's products, but the bigger problem is that Mr Musk now appears to be alienating customers who were previously loyal to the brand - as shown by the popularity, in the US, of Tesla bumper stickers with messages such as \"I bought this before Elon went crazy\" and \"Anti-Elon Tesla Club\".  Is Musk distracted? Conversely, some investors who wholly approve of the work Mr Musk is doing for the Trump administration may also have concerns, notably that it is proving too much of a distraction from the day job of running Tesla. Even before Mr Musk took the wheel at the US Department Of Government Efficiency (DOGE), there were already fears that he was being too distracted by his private companies, including the social media platform X, the aerospace and defence contractor SpaceX and his artificial intelligence business xAI. X, on which lies peddled by the Kremlin about Ukraine are regularly amplified, may also be adding to the damage being done to the Tesla brand. But Mr Musk's association with the Trump administration is only part of the reason for the recent declines. Tesla shares could have been over-priced Another key factor is that shares of Tesla were arguably over-priced to begin with. In the two weeks following the US presidential election, Tesla shares shot up by 32%, adding $250bn to its stock market value. To put that into context, that gain was equal to the entire stock market value of Toyota, the world's next biggest carmaker after Tesla. At the time its shares peaked, Tesla shares were trading at 112 times expected earnings, compared with the 25 times or so that the S&P 500 was trading at and higher even than the company's average over the last five years of 93. Again, to put things in context, Ford shares are valued at just eight times prospective earnings. That exotic rating reflected the superlative growth prospects previously accorded to Tesla, in particular Mr Musk's pledges to launch a new cut-price electric vehicle and a fully autonomous ride-hailing service. Competition from China But investors are now reappraising those growth prospects as Tesla loses share of the electric vehicle market to rivals, such as China's BYD, which is also seen as outpacing the company on self-driving vehicle technology. News on Tesla's planned new low-cost model remains elusive and, until it is launched, critics believe it has little hope of building share in burgeoning markets such as India. Mr Musk always wanted Tesla to be seen as an AI and robotics company rather than an electric vehicle maker and that was part of the bull case for the stock. Yet there are now fears that the company is investing too much in such projects and on its much-criticised Cybertrucks. Another concern is that Tesla's core operations may be misfiring. Read more from Sky News:Trump dodges US recession question'Canada will never be part of the US'  Results published at the end of January revealed that operating profits for the final three months of 2024 were down 23% on the same period a year earlier - which Tesla blamed on lower average selling prices on each of its Model 3, Model Y, Model X and Model S lines. For the full year, deliveries of new vehicles were down on 2023, the first year-on-year fall the company has suffered. And the operating margins, partly reflecting the sums Tesla is investing, were also lower. It all adds up to an unpleasant cocktail for investors."
    },
    {
        "title": "How lab-grown food could be on UK shelves within two years",
        "description": "Once the stuff of sci-fi novels, food grown in a laboratory could be approved for human consumption in the UK within two years.",
        "url": "https://news.sky.com/story/how-lab-grown-food-could-be-on-uk-shelves-within-two-years-13325612",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-lab-grown-meat_6851946.jpg?20250310111521",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-10 09:17:00",
        "Headline": "The UK is one of the leaders in the field of developing cell-cultivated products (CCPs) but companies have complained about the difficulties in getting them approved by the Food Standards Agency.",
        "Content": "Once the stuff of sci-fi novels, food grown in a laboratory could be approved for human consumption in the UK within two years. Companies in the UK have already been producing meatballs, animal fat and other foods in laboratories, but have complained about the difficulties in getting them approved by the Food Standards Agency (FSA). However, the government department has now said a team of scientists and regulatory experts will begin gathering \"rigorous scientific evidence\" about the products and how they are made. The FSA added that it is committed to completing a \"fully safety assessment\" of two lab-produced foods which would allow them to be sold in the UK within the next two years. How the sausages are made The foods, which include burgers, steaks, sausages and salmon, are developed from tiny animal cells by scientists working in chemical plants. They are known as cell-cultivated products (CCPs) and are made without using traditional farming methods such as rearing livestock. Lab-grown meats therefore have strong environmental credentials because their production doesn't require huge amounts of land and the greenhouse gas emissions resulting from livestock farming are reduced. Scientists have also reportedly suggested altering the nutritional contents of cell-cultured meat so that it could be healthier than the animal product. Farmers' fears However, some say the development of CCPs marks another move away from natural foodstuffs at a time when there is already concern about the consumption of ultra-processed foods. And some animal farmers fear lab-grown meats pose yet another threat to their livelihoods. Singapore, Israel and pockets of the US have approved cultivated meat for human consumption, but the UK has so far only allowed it in pet food. This is despite the UK being one of the leaders in the field of producing CCPs. Announcing its \"pioneering programme for cell-cultivated products\" on Monday, the FSA said eight companies that produce lab-grown foods will be involved in the programme. Hoxton Farms, Roslin Technologies and Uncommon are the three UK-based companies that will take part. The other five are BlueNalu from the US, Mosa Meat from the Netherlands, Gourmey and Vital Meat from France and Vow from Australia. Vegetables can also be produced in a lab through cell-cultivation but the companies involved in the programme focus on either meat or seafood. The FSA programme comes months after the UK's innovation agency, UKRI, dished out £15m to the newly-formed National Alternative Protein Innovation Centre (NAPIC) in August. Read more:I'm a bad vegetarian - could lab-grown meat be the answer?Are alternative proteins going mainstream?  A solution for 'bad vegetarians'? In 2023, Sky News climate reporter Victoria Seabrook - a self-confessed \"bad vegetarian\" - signed a disclaimer to try pork meatballs that had been produced in a lab by Oxford-based start-up Ivy Farm. She was interested in whether cell-cultivated meat would provide a good alternative to sometimes indulging in the real thing. After devouring one of the lab-grown products, she said: \"The cultivated meatball has an authentically crispy exterior, oozes fatty juices and chews the same way as pork. It smells like cooked meat too. \"The only difference is that the normal meatball has a slightly stronger flavour, which could be due to the fact it is a little larger, so juicier.\" Commenting on the programme announced today, Professor Robin May, chief scientific adviser at the FSA, said \"safe innovation\" was at its heart. \"By prioritising consumer safety and making sure new foods, like CCPs are safe, we can support growth in innovative sectors. Our aim is to ultimately provide consumers with a wider choice of new food, while maintaining the highest safety standards.\" Lord Patrick Vallance, science minister, said: \"By supporting the safe development of cell-cultivated products, we're giving businesses the confidence to innovate and accelerating the UK's position as a global leader in sustainable food production. \"This work will not only help bring new products to market faster, but strengthen consumer trust, supporting our Plan for Change and creating new economic opportunities across the country.\" Jim Mellon, executive chairman of Agronomics, a company which invests in firms which produce cell-cultivated food, said: \"It's great to see the UK making another positive step forward in becoming a leader in the cell-cultivated sector... However the (programme) will only be considered a success if the FSA also receives the support and funding to complete its assessments within faster timelines. \"Without this speed, it risks losing out on creating a competitive homegrown industry which can power low-carbon economic growth, boost food security, and ensure the UK becomes a leader in net-zero within the food industry.\""
    },
    {
        "title": "Drivers 'confused' by transition to electric vehicles, ministers warned",
        "description": "UK drivers are \"confused\" by the country's electric car transition, ministers are being warned.",
        "url": "https://news.sky.com/story/drivers-confused-by-transition-to-electric-vehicles-ministers-warned-13325133",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-electric-cars-ev_6851283.jpg?20250309154915",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-10 00:01:00",
        "Headline": "In a survey of more than 14,000 AA members, 7% thought the government was banning the sale of used petrol and diesel cars.",
        "Content": "UK drivers are \"confused\" by the country's electric car transition, ministers are being warned. Although most drivers are not hostile towards electric vehicles (EVs), many are confused about what changes are coming and when, according to new research from the AA. In a survey of more than 14,000 AA members, 7% thought the government was banning the sale of used petrol and diesel cars. Around a third thought manual EVs exist, despite them all being automatic. More than one in five said they would never buy an EV. The government's plan for increasing the number of electric vehicles being driven in the UK focuses heavily on increasing the supply of the vehicles.  In 2024, at least 22% of new cars and 10% of new vans sold by each manufacturer in the UK had to be zero-emission, which generally means pure electric. \n                  More heat pumps, fewer kebabs - Is this the way to stop climate change?\n                 \n                  Heat pumps, EVs and fewer kebabs: You'll notice the next cut to emissions - but half the work is done\n                 \n                  How the climate fight is coming into your home\n                 Each year, those percentages will rise, reaching 80% of new cars and 70% of new vans in 2030. Manufacturers will face fines of £15,000 per vehicle if electric vehicle sales fall short of 28% of total production this year. Read more from Sky News:Survivor reflects on five years on from COVIDAt least 12 people injured in shooting in Toronto By 2035, all new cars and vans will be required to be fully zero emission, according to the Department for Transport. Second-hand diesel and petrol cars will still be allowed to be sold after this date, and their fuel will still be available. There are more EVs - but will people buy them? In February, 25% of new cars were powered purely by battery and in January, they made up 21% of all new cars registered in the UK. But despite the growth of electric sales, manufacturers continue to warn that the market will not support the growth required to hit government EV targets, and called for consumer incentives and the extension of tax breaks. The AA suggested the government's plan focuses on \"supply but does little to encourage demand for EVs\". It called on ministers to co-ordinate a public awareness campaign alongside the motoring industry which directly targets drivers who doubt the viability of EVs. \"Our message to government is more needs to be done to make EVs accessible for everyone,\" said Jakob Pfaudler, AA chief executive. Which? head of consumer rights Sue Davis said: \"When it comes to making sustainable choices such as switching to an electric car, our research shows that people are often held back by high costs, complex choices or uncertainty. \"The government needs to provide the right information on electric vehicles and other sustainable choices so that people have the confidence to switch.\" A Department for Transport spokesperson said: \"We're investing over £2.3bn to help industry and consumers make a supported switch to EVs. \"This includes installing a public charge point every 28 minutes, keeping EV incentives in the company car tax regime to 2030, and extending 100% first-year allowances for zero-emission cars for another year. \"Second-hand EVs are also becoming cheaper than ever, with one in three available under £20,000 and 21 brand new models available for less than £30,000. \"We're seeing growing consumer confidence as a result.\""
    },
    {
        "title": "Government pledges to clean up Windermere sewage pollution",
        "description": "The government is vowing to clean up Windermere and stop it being \"choked\" by sewage pollution.",
        "url": "https://news.sky.com/story/government-pledges-to-clean-up-windermere-sewage-pollution-13325633",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-lake-windermere-cumbria_6851880.jpg?20250310102119",
        "type": "Technology",
        "Author": "Unknown",
        "Date Published": "2025-03-10 10:04:00",
        "Headline": "Environment Secretary Steve Reed is vowing to restore Windermere to its \"natural beauty\" with an ambitious scheme.",
        "Content": "The government is vowing to clean up Windermere and stop it being \"choked\" by sewage pollution. Environment Secretary Steve Reed wants to ensure \"only rainwater\" enters England's largest lake. On a visit to Cumbria on Monday as part of a Things Can Only Get Cleaner tour, Mr Reed said the government is working \"to stop all sewage going into the lake and restore it to its natural beauty\". He added: \"Windermere is a stunningly beautiful national treasure - but it's being choked by unacceptable levels of sewage pollution.\" Mr Reed, who is meeting local campaigners, said Windermere had been contaminated with \"more than 140 million litres\" of pollution and the government is \"committed to cleaning up this iconic lake\" as part of its Plan For Change scheme. The project aims to upgrade the crumbling water infrastructure and increase economic growth using more than £100bn of private investment - and Mr Reed said £200m had already been secured. Local groups and organisations have set up a feasibility study to look into what is needed to eliminate sewage discharges into the lake, drawing on other examples from around the world. Windermere, part of the Lake District National Park Unesco World Heritage Site, is home to more than 14,000 people. The area's scenery, rare species and cultural heritage attract seven million visitors a year, generating £750m for the local economy. Wastewater from United Utilities and private sewage treatment along with rural and urban land use are among a range of pollution issues it faces. Sewage spills from water infrastructure have contributed to the pollution of beauty spots, including Windermere.  Storm overflows - which release untreated wastewater into rivers and seas when there is heavy rain to prevent sewers becoming overwhelmed - have dumped sewage into the lake. Water utilities have been handed large fines for repeated and damaging illegal pollution in recent years and there is concern about the levels of leaks from water infrastructure. Read more:Four water firms 'responsible for 90% of serious pollution'Water industry review to tackle sewage pollution Last year, a protest was held outside the offices of United Utilities calling on the government to compel the firm to clean up the lake rather than pay huge dividends to shareholders. Climate change and worsening weather extremes, from downpours to drought, are expected to pile more pressure on supplies."
    },
    {
        "title": "Bridgerton star Simone Ashley on 'normalising' the narrative for South Asian actors",
        "description": "British actress Simone Ashley says she believes the industry has \"come a long way\" in terms of diversifying - but says the process is ongoing.",
        "url": "https://news.sky.com/story/bridgerton-star-simone-ashley-on-normalising-the-narrative-for-south-asian-actors-13325910",
        "image_url": "https://e3.365dm.com/25/03/1920x1080/skynews-simone-ashley-picture-this_6852294.jpg?20250310163545",
        "type": "Entertainment",
        "Author": "Faye de Silva, radio reporter",
        "Date Published": "2025-03-10 16:36:00",
        "Headline": "Bridgerton and Sex Education star Simone Ashley heads the cast of romcom Picture This, and says she hopes to inspire a new generation of South Asian performers.",
        "Content": "By Faye de Silva, radio reporter   British actress Simone Ashley says she believes the industry has \"come a long way\" in terms of diversifying - but says the process is ongoing. The Bridgerton and Sex Education star says that growing up she loved watching Hollywood royalty Julia Roberts, Cameron Diaz and Anne Hathaway take on romcom leads. But the 29-year-old - who is of Indian Tamil descent and grew up in Surrey - says she never really saw people like her in those roles. Ashley told Sky News: \"I always wanted to play a character like that. \"So, when we got the script, I just jumped on it - because I wanted to fill those shoes, and kind of bring back that 90s romcom world.\" Simone's new film Picture This sees her in the starring role as London photographer Pia, who's navigating a struggling business while dealing with the societal pressures of finding love. Though the character is more than content with the life she's built, a prediction from a spiritual guru threatens to throw that into chaos as she's set up on five blind dates. Hero Fiennes Tiffin - star of the After film series and nephew of Ralph and Joseph Fiennes - and British comedian Asim Chaudhry also join the Picture This cast. Ashley goes on: \"What was so important about this film is that we celebrated and enhanced the culture, and any aspects of comedy were just from the characters themselves - it wasn't making fun of the culture.\" 'Part of the change' And while the film is centred around a South Asian family, Ashley says that's not what she wants viewers to take from it. \"This is a story that is a classic romcom - and I want that to be the selling point, that's how we normalise this narrative. \"The billboards aren't 'Indian girl in the movie'. \"I'm just super proud, super pleased and I just hope that universally all women - not just South Asian women - can see themselves in this character.\" Read more from Sky News:Meet former drill rapper turned conservation starGene Hackman's wife died from rare infectious disease Not only does the movie mark Ashley's first romcom role, but also her first as executive producer. Since being named one of Variety's 2021 Brits to Watch, she's made her stamp on the acting world - most notably as leading lady Kate Sharma in the second season of Netflix period drama Bridgerton. And she recently confirmed she'll be releasing her first music album soon. Ashley has previously picked apart what she's described as the \"restrictive\" nature of being an Indian actress - and how it took her longer to break into the industry compared to her white peers. But she says the industry is changing. \"I think we've come a long way - I think we're part of the change and I think more movies like [Picture This] - more women like you in your seat, more women in my seat - I think that's part of the change.\" Picture This is available to watch on Prime Video now."
    }
]